000100***************************************************************** 00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300 PROGRAM-ID.             SUKRP071.                                00030000
000400 AUTHOR.                 DENISE HAHN.                             00040000
000500 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00050000
000600 DATE-WRITTEN.           MAY, 2015.                               00060000
000700 DATE-COMPILED.                                                   00070000
000800***************************************************************** 00080000
000900*                                                               * 00090000
001000*  SHIPPING SUMMARY TRAILER REPORT                              * 00100000
001100*                                                               * 00110000
001500*  INPUT FILE IS CREATED BY SUKUT180 - SURD123                  * 00150000
001600*                                                               * 00160000
001700***************************************************************** 00170000
001800 ENVIRONMENT DIVISION.                                            00180000
001900 CONFIGURATION SECTION.                                           00190000
002000                                                                  00200000
002100 SOURCE-COMPUTER.        IBM-3090.                                00210000
002200 OBJECT-COMPUTER.        IBM-3090.                                00220000
002300                                                                  00230000
002400***************************************************************** 00240000
002500 INPUT-OUTPUT SECTION.                                            00250000
002600                                                                  00260000
002700 FILE-CONTROL.                                                    00270000
002800                                                                  00280000
002900     SELECT INPUT-FILE                                            00290000
003000         ASSIGN TO INP01.                                         00300000
003100                                                                  00310000
003110     SELECT CONTROL-FILE                                          00311051
003120         ASSIGN TO INP02.                                         00312051
003130                                                                  00313051
003140     SELECT SELECTION-FILE                                        00314099
003150         ASSIGN TO INP03.                                         00315099
003160                                                                  00316099
003200     SELECT REPORT-FILE                                           00320000
003300         ASSIGN TO RPT01.                                         00330000
003400                                                                  00340000
003410     SELECT OUTPUT-FILE                                           00341004
003420         ASSIGN TO OUT01.                                         00342004
003430                                                                  00343004
003500***************************************************************** 00350000
003600 DATA DIVISION.                                                   00360000
003700***************************************************************** 00370000
003800 FILE SECTION.                                                    00380000
003900                                                                  00390000
004000 FD  INPUT-FILE                                                   00400000
004100     RECORDING MODE IS F                                          00410000
004200     LABEL RECORDS ARE STANDARD                                   00420000
004300     BLOCK CONTAINS 0 RECORDS.                                    00430000
004400 01  INPUT-RECORD                    PIC  X(600).                 00440038
004500                                                                  00450000
004510 FD  CONTROL-FILE                                                 00451051
004520     RECORDING MODE IS F                                          00452051
004530     LABEL RECORDS ARE STANDARD                                   00453051
004540     BLOCK CONTAINS 0 RECORDS.                                    00454051
004550 01  CONTROL-RECORD                  PIC  X(80).                  00455051
004560                                                                  00456051
004570 FD  SELECTION-FILE                                               00457099
004580     RECORDING MODE IS F                                          00458099
004590     LABEL RECORDS ARE STANDARD                                   00459099
004591     BLOCK CONTAINS 0 RECORDS.                                    00459199
004592 01  SELECTION-RECORD               PIC  X(80).                   00459299
004593                                                                  00459399
004600 FD  REPORT-FILE                                                  00460000
004700     RECORDING MODE IS F                                          00470000
004800     BLOCK CONTAINS 0  RECORDS.                                   00480000
004900 01  REPORT-RECORD                   PIC X(150).                  00490028
005000                                                                  00500000
005010 FD  OUTPUT-FILE                                                  00501000
005020     RECORDING MODE IS F                                          00502000
005030     BLOCK CONTAINS 0  RECORDS.                                   00503000
005040 01  OUTPUT-RECORD                   PIC X(600).                  00504034
005050                                                                  00505000
005100***************************************************************** 00510000
005200 WORKING-STORAGE SECTION.                                         00520000
005300                                                                  00530000
005400 01  PROGRAM-SWITCHES.                                            00540000
005500     05  PS-END-OF-INPUT-FILE-SW     PIC X(01) VALUE 'N'.         00550000
005600         88  PS-END-OF-INPUT                   VALUE 'Y'.         00560000
005700         88  PS-NOT-END-OF-INPUT               VALUE 'N'.         00570000
005800                                                                  00580000
005900 01  PC-PROGRAM-CONSTANTS.                                        00590000
006000     05  PC-SUKRP071                 PIC X(08) VALUE              00600000
006100                                               'SUKRP071'.        00610000
006200     05  PC-REPORT-NBR               PIC X(02) VALUE '-1'.        00620000
006300     05  PC-MAX-LINE-COUNT           PIC S9(3) VALUE +60          00630000
006400                                               COMP-3.            00640000
006500     05  PC-DEFAULT-TMST             PIC X(26)  VALUE             00650000
006600                                    '9999-09-09-09.09.09.999999'. 00660000
006700     05  PC-SLASH                    PIC X(01) VALUE '/'.         00670000
006800     05  PC-DASH                     PIC X(01) VALUE '-'.         00680000
006900                                                                  00690000
007000 01  SD-DATE-TIME.                                                00700000
007100     05  SD-SYSTEM-DATE.                                          00710000
007200         10  SD-SYSTEM-DATE-YY       PIC 9(02) VALUE ZERO.        00720000
007300         10  SD-SYSTEM-DATE-MM       PIC 9(02) VALUE ZERO.        00730000
007400         10  SD-SYSTEM-DATE-DD       PIC 9(02) VALUE ZERO.        00740000
007500     05  SD-SYSTEM-TIME.                                          00750000
007600         10  SD-SYSTEM-TIME-HH       PIC 9(02) VALUE ZERO.        00760000
007700         10  SD-SYSTEM-TIME-MM       PIC 9(02) VALUE ZERO.        00770000
007800         10  SD-SYSTEM-TIME-SS       PIC 9(02) VALUE ZERO.        00780000
007900         10  FILLER                  PIC 9(02) VALUE ZERO.        00790000
008000                                                                  00800000
008100 01  PV-PROGRAM-VARIABLES.                                        00810000
008200     05  PV-READ-COUNT                PIC S9(7) COMP-3            00820000
008300                                                VALUE ZERO.       00830000
008400     05  PV-WRITE-COUNT               PIC S9(7) COMP-3            00840000
008500                                                VALUE ZERO.       00850000
008600     05  PV-NULL-IND                 PIC S9(04) VALUE +0          00860000
008700                                               COMP SYNC.         00870000
008800     05  PV-FORMAT-DATE.                                          00880000
008900         10 PV-FORMAT-DATE-MM         PIC  9(02).                 00890000
009000         10 FILLER                    PIC  X(01) VALUE '/'.       00900000
009100         10 PV-FORMAT-DATE-DD         PIC  9(02).                 00910000
009200         10 FILLER                    PIC  X(01) VALUE '/'.       00920000
009300         10 PV-FORMAT-DATE-CCYY       PIC  9(04).                 00930000
009400                                                                  00940000
009500     05  PV-SQLCODE                  PIC 9(09) VALUE ZERO.        00950000
009600     05  PV-PAGE-COUNT               PIC S9(4) VALUE ZERO         00960000
009700                                               COMP-3.            00970000
009800     05  PV-LINE-COUNT               PIC S9(3) VALUE ZERO         00980000
009900                                               COMP-3.            00990000
009910     05  PV-TRIP-COUNT               PIC S9(3) VALUE ZERO         00991058
009920                                               COMP-3.            00992058
010000     05  PV-LINES-ON-PAGE            PIC  9(3) VALUE 60.          01000000
010010     05  PV-TRIPS-ON-PAGE            PIC  9(3) VALUE 4.           01001099
010100                                                                  01010000
010110     05  PV-PREV-TRIP-ID             PIC S9(09) COMP.             01011007
010111     05  PV-PREV-OPER                PIC S9(04) COMP.             01011134
010112     05  PV-PREV-DEST                PIC S9(04) COMP.             01011234
010190                                                                  01019000
010200     05  PV-TODAYS-DATE.                                          01020000
010300         10  PV-TODAYS-DATE-YY       PIC 9(02) VALUE ZERO.        01030000
010400         10  PV-TODAYS-DATE-MM       PIC 9(02) VALUE ZERO.        01040000
010500         10  PV-TODAYS-DATE-DD       PIC 9(02) VALUE ZERO.        01050000
010600     05  PV-TODAYS-DATE-YYYY.                                     01060000
010700         10  PV-TODAYS-DATE-CC       PIC 9(02) VALUE 20.          01070000
010800         10  PV-TODAYS-DATE-Y2       PIC 9(02) VALUE ZERO.        01080000
010900                                                                  01090000
011000     05  PV-TODAYS-TIME.                                          01100000
011100         10  PV-TODAYS-TIME-HH       PIC 9(02) VALUE ZERO.        01110000
011200         10  PV-TODAYS-TIME-MM       PIC 9(02) VALUE ZERO.        01120000
011300         10  PV-TODAYS-TIME-SS       PIC 9(02) VALUE ZERO.        01130000
011400         10  FILLER                  PIC 9(02) VALUE ZERO.        01140000
011500                                                                  01150000
011501* TRIP - AVERAGE MINUTES                                          01150125
011502     05  PV-TRIP-OPEN-TO-CLOSE-AVG   PIC  S9(16)9V99.             01150246
011503     05  PV-TRIP-CLOSE-TO-SHIP-AVG   PIC  S9(16)9V99.             01150346
011504     05  PV-TRIP-OPEN-TO-SHIP-AVG    PIC  S9(16)9V99.             01150446
011505                                                                  01150503
011510     05  PV-ARRIVE-TO-PRC-AVG        PIC  S9(16)9V99.             01151046
011520     05  PV-ARRIVE-TO-P2L-PKD-AVG    PIC  S9(16)9V99.             01152046
011530     05  PV-PRC-TO-P2L-PKD-AVG       PIC  S9(16)9V99.             01153046
011540     05  PV-P2L-PKD-TO-CLOSE-AVG     PIC  S9(16)9V99.             01154046
011550     05  PV-P2L-OPEN-TO-CLOSE-AVG    PIC  S9(16)9V99.             01155046
011560     05  PV-P2L-OPEN-TO-OTBND-AVG    PIC  S9(16)9V99.             01156046
011561     05  PV-P2L-CLOSE-TO-OTBND-AVG   PIC  S9(16)9V99.             01156146
011570     05  PV-ARRIVE-TO-OTBND-AVG      PIC  S9(16)9V99.             01157046
011580     05  PV-PRC-TO-OTBND-AVG         PIC  S9(16)9V99.             01158046
011590     05  PV-ARRIVE-TO-TCLOS-AVG      PIC  S9(16)9V99.             01159046
011591     05  PV-ARRIVE-TO-SHIP-AVG       PIC  S9(16)9V99.             01159146
011592     05  PV-P2L-OPEN-TO-TCLOS-AVG    PIC  S9(16)9V99.             01159246
011593     05  PV-P2L-OPEN-TO-SHIP-AVG     PIC  S9(16)9V99.             01159346
011594     05  PV-P2L-CLOSE-TO-TCLOS-AVG   PIC  S9(16)9V99.             01159446
011595     05  PV-P2L-CLOSE-TO-SHIP-AVG    PIC  S9(16)9V99.             01159546
011596     05  PV-ARRIVE-TO-MSTR-AVG       PIC  S9(16)9V99.             01159646
011597     05  PV-PRC-TO-MSTR-AVG          PIC  S9(16)9V99.             01159746
011600     05  PV-MSTR-CRE-TO-OTBND-AVG    PIC  S9(16)9V99.             01160046
011601     05  PV-MSTR-CRE-TO-TCLOS-AVG    PIC  S9(16)9V99.             01160146
011602     05  PV-MSTR-CRE-TO-SHIP-AVG     PIC  S9(16)9V99.             01160246
011603     05  PV-MSTR-FIRST-TO-OTBND-AVG  PIC  S9(16)9V99.             01160346
011604     05  PV-MSTR-FIRST-TO-TCLOS-AVG  PIC  S9(16)9V99.             01160446
011605     05  PV-MSTR-FIRST-TO-SHIP-AVG   PIC  S9(16)9V99.             01160546
011606     05  PV-MSTR-LAST-TO-OTBND-AVG   PIC  S9(16)9V99.             01160646
011607     05  PV-MSTR-LAST-TO-TCLOS-AVG   PIC  S9(16)9V99.             01160746
011608     05  PV-MSTR-LAST-TO-SHIP-AVG    PIC  S9(16)9V99.             01160846
011609     05  PV-ON-OTBND-TO-CLOS-AVG     PIC  S9(16)9V99.             01160946
011610     05  PV-ON-OTBND-TO-SHIP-AVG     PIC  S9(16)9V99.             01161046
011611                                                                  01161111
011612* TRIP - AVERAGE DAYS                                             01161225
011613     05  PV-TRIP-OPEN-TO-CLOSE-DAY   PIC  S999V99.                01161331
011614     05  PV-TRIP-CLOSE-TO-SHIP-DAY   PIC  S999V99.                01161431
011615     05  PV-TRIP-OPEN-TO-SHIP-DAY    PIC  S999V99.                01161531
011616                                                                  01161625
011617     05  PV-ARRIVE-TO-PRC-DAY        PIC  S999V99.                01161731
011618     05  PV-ARRIVE-TO-P2L-PKD-DAY    PIC  S999V99.                01161831
011619     05  PV-PRC-TO-P2L-PKD-DAY       PIC  S999V99.                01161931
011620     05  PV-P2L-PKD-TO-CLOSE-DAY     PIC  S999V99.                01162031
011630     05  PV-P2L-OPEN-TO-CLOSE-DAY    PIC  S999V99.                01163031
011640     05  PV-P2L-OPEN-TO-OTBND-DAY    PIC  S999V99.                01164031
011650     05  PV-P2L-CLOSE-TO-OTBND-DAY   PIC  S999V99.                01165031
011651     05  PV-ARRIVE-TO-OTBND-DAY      PIC  S999V99.                01165131
011652     05  PV-PRC-TO-OTBND-DAY         PIC  S999V99.                01165231
011653     05  PV-ARRIVE-TO-TCLOS-DAY      PIC  S999V99.                01165331
011654     05  PV-ARRIVE-TO-SHIP-DAY       PIC  S999V99.                01165431
011655     05  PV-P2L-OPEN-TO-TCLOS-DAY    PIC  S999V99.                01165531
011656     05  PV-P2L-OPEN-TO-SHIP-DAY     PIC  S999V99.                01165631
011657     05  PV-P2L-CLOSE-TO-TCLOS-DAY   PIC  S999V99.                01165731
011658     05  PV-P2L-CLOSE-TO-SHIP-DAY    PIC  S999V99.                01165831
011659     05  PV-ARRIVE-TO-MSTR-DAY       PIC  S999V99.                01165931
011660     05  PV-PRC-TO-MSTR-DAY          PIC  S999V99.                01166031
011661     05  PV-MSTR-CRE-TO-OTBND-DAY    PIC  S999V99.                01166131
011662     05  PV-MSTR-CRE-TO-TCLOS-DAY    PIC  S999V99.                01166231
011663     05  PV-MSTR-CRE-TO-SHIP-DAY     PIC  S999V99.                01166331
011664     05  PV-MSTR-FIRST-TO-OTBND-DAY  PIC  S999V99.                01166431
011665     05  PV-MSTR-FIRST-TO-TCLOS-DAY  PIC  S999V99.                01166531
011666     05  PV-MSTR-FIRST-TO-SHIP-DAY   PIC  S999V99.                01166631
011667     05  PV-MSTR-LAST-TO-OTBND-DAY   PIC  S999V99.                01166731
011668     05  PV-MSTR-LAST-TO-TCLOS-DAY   PIC  S999V99.                01166831
011669     05  PV-MSTR-LAST-TO-SHIP-DAY    PIC  S999V99.                01166931
011670     05  PV-ON-OTBND-TO-CLOS-DAY     PIC  S999V99.                01167031
011671     05  PV-ON-OTBND-TO-SHIP-DAY     PIC  S999V99.                01167131
011672                                                                  01167225
011673* TRIP TOTAL MINUTES                                              01167306
011674     05  PV-TRIP-OPEN-TO-CLOSE-MIN-TOT  PIC  S9(16) COMP.         01167446
011675     05  PV-TRIP-CLOSE-TO-SHIP-MIN-TOT  PIC  S9(16) COMP.         01167546
011676     05  PV-TRIP-OPEN-TO-SHIP-MIN-TOT   PIC  S9(16) COMP.         01167646
011677                                                                  01167706
011678     05  PV-TRIP-ARRIVE-TO-PRC-MIN-TOT        PIC  S9(16) COMP.   01167846
011679     05  PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT       PIC  S9(16) COMP.   01167946
011680     05  PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT       PIC  S9(16) COMP.   01168046
011681     05  PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT       PIC  S9(16) COMP.   01168146
011682     05  PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT       PIC  S9(16) COMP.   01168246
011683     05  PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT       PIC  S9(16) COMP.   01168346
011684     05  PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT       PIC  S9(16) COMP.   01168446
011685     05  PV-TRIP-ARRIV-TO-OTBND-MIN-TOT       PIC  S9(16) COMP.   01168546
011686     05  PV-TRIP-PRC-TO-OTBND-MIN-TOT         PIC  S9(16) COMP.   01168646
011687     05  PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT       PIC  S9(16) COMP.   01168746
011688     05  PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT       PIC  S9(16) COMP.   01168846
011689     05  PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT       PIC  S9(16) COMP.   01168946
011690     05  PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT       PIC  S9(16) COMP.   01169046
011691     05  PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT       PIC  S9(16) COMP.   01169146
011692     05  PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT       PIC  S9(16) COMP.   01169246
011693     05  PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT       PIC  S9(16) COMP.   01169346
011694     05  PV-TRIP-PRC-TO-MSTR-MIN-TOT          PIC  S9(16) COMP.   01169446
011695     05  PV-TRIP-ON-OTBND-TO-TCLOS-TOT        PIC  S9(16) COMP.   01169546
011696     05  PV-TRIP-ON-OTBND-TO-TSHIP-TOT        PIC  S9(16) COMP.   01169646
011697     05  PV-TRIP-MST-CRE-TO-OTB-MIN-TOT       PIC  S9(16) COMP.   01169746
011698     05  PV-TRIP-MST-CRE-TO-TCL-MIN-TOT       PIC  S9(16) COMP.   01169846
011699     05  PV-TRIP-MST-CRE-TO-SHP-MIN-TOT       PIC  S9(16) COMP.   01169946
011700     05  PV-TRIP-MST-1ST-TO-OTB-MIN-TOT       PIC  S9(16) COMP.   01170046
011701     05  PV-TRIP-MST-1ST-TO-TCL-MIN-TOT       PIC  S9(16) COMP.   01170146
011702     05  PV-TRIP-MST-1ST-TO-SHP-MIN-TOT       PIC  S9(16) COMP.   01170246
011703     05  PV-TRIP-MST-LST-TO-OTB-MIN-TOT       PIC  S9(16) COMP.   01170346
011704     05  PV-TRIP-MST-LST-TO-TCL-MIN-TOT       PIC  S9(16) COMP.   01170446
011705     05  PV-TRIP-MST-LST-TO-SHP-MIN-TOT       PIC  S9(16) COMP.   01170546
011706     05  PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT       PIC  S9(16) COMP.   01170646
011707     05  PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT       PIC  S9(16) COMP.   01170746
011708                                                                  01170806
011709* TRIP TOTAL COUNT                                                01170905
011710     05  PV-TRIP-INPUT-RECORD-TOTAL           PIC  S9(16) COMP.   01171046
011711                                                                  01171102
011712     05  PV-TRIP-ARRIVE-TO-PRC-CNT-TOT        PIC  S9(16) COMP.   01171246
011713     05  PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT       PIC  S9(16) COMP.   01171346
011714     05  PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT       PIC  S9(16) COMP.   01171446
011715     05  PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT       PIC  S9(16) COMP.   01171546
011716     05  PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT       PIC  S9(16) COMP.   01171646
011717     05  PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT       PIC  S9(16) COMP.   01171746
011718     05  PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT       PIC  S9(16) COMP.   01171846
011719     05  PV-TRIP-ARRIV-TO-OTBND-CNT-TOT       PIC  S9(16) COMP.   01171946
011720     05  PV-TRIP-PRC-TO-OTBND-CNT-TOT         PIC  S9(16) COMP.   01172046
011721     05  PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT       PIC  S9(16) COMP.   01172146
011722     05  PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT       PIC  S9(16) COMP.   01172246
011723     05  PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT       PIC  S9(16) COMP.   01172346
011724     05  PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT       PIC  S9(16) COMP.   01172446
011725     05  PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT       PIC  S9(16) COMP.   01172546
011726     05  PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT       PIC  S9(16) COMP.   01172646
011727     05  PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT       PIC  S9(16) COMP.   01172746
011728     05  PV-TRIP-PRC-TO-MSTR-CNT-TOT          PIC  S9(16) COMP.   01172846
011729     05  PV-TRIP-ON-OTB-TO-TCL0-CNT-TOT       PIC  S9(16) COMP.   01172946
011730     05  PV-TRIP-ON-OTB-TO-TSHP-CNT-TOT       PIC  S9(16) COMP.   01173046
011731     05  PV-TRIP-MST-CRE-TO-OTB-CNT-TOT       PIC  S9(16) COMP.   01173146
011732     05  PV-TRIP-MST-CRE-TO-TCL-CNT-TOT       PIC  S9(16) COMP.   01173246
011733     05  PV-TRIP-MST-CRE-TO-SHP-CNT-TOT       PIC  S9(16) COMP.   01173346
011734     05  PV-TRIP-MST-1ST-TO-OTB-CNT-TOT       PIC  S9(16) COMP.   01173446
011735     05  PV-TRIP-MST-1ST-TO-TCL-CNT-TOT       PIC  S9(16) COMP.   01173546
011736     05  PV-TRIP-MST-1ST-TO-SHP-CNT-TOT       PIC  S9(16) COMP.   01173646
011737     05  PV-TRIP-MST-LST-TO-OTB-CNT-TOT       PIC  S9(16) COMP.   01173746
011738     05  PV-TRIP-MST-LST-TO-TCL-CNT-TOT       PIC  S9(16) COMP.   01173846
011739     05  PV-TRIP-MST-LST-TO-SHP-CNT-TOT       PIC  S9(16) COMP.   01173946
011740     05  PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT       PIC  S9(16) COMP.   01174074
011741     05  PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT       PIC  S9(16) COMP.   01174174
012970                                                                  01297074
012971* DMH - 8/19/16 - BEGIN                                           01297189
012972     05  PV-TRIP-SRC-CRTN                     PIC   9(05)V9999.   01297289
012973     05  PV-TRIP-SRC-CRTN-PCNT                PIC   9(03)V99.     01297399
012974     05  PV-TRIP-CARTONS                      PIC   9(16).        01297492
012975     05  PV-TRIP-SRC-CARTONS                  PIC   9(16).        01297592
012976* DMH - 8/19/16 - END                                             01297692
012977                                                                  01297792
012978 01  PV-ABEND-FIELDS.                                             01297892
012979     05  PV-ABEND-CODE               PIC S9(4) VALUE +0           01297992
012980                                               COMP SYNC.         01298092
012981     05  PV-ABEND-PROGRAM            PIC X(08) VALUE 'SUKRP071'.  01298192
012982     05  PV-ABEND-PARAGRAPH          PIC X(50) VALUE SPACES.      01298292
012983     05  PV-ABEND-OPERATION          PIC X(50) VALUE SPACES.      01298392
012984     05  PV-ABEND-STRUCTURE-1        PIC X(08) VALUE SPACES.      01298492
012985     05  PV-DB2-OPERATION-MESSAGE-1  PIC X(79) VALUE SPACES.      01298592
012986     05  PV-DB2-OPERATION-MESSAGE-2  PIC X(79) VALUE SPACES.      01298692
012987     05  PV-DB2-OPERATION-MESSAGE-3  PIC X(79) VALUE SPACES.      01298792
012988     05  PV-DB2-OPERATION-MESSAGE-4  PIC X(79) VALUE SPACES.      01298892
012989     05  PV-DB2-TABLE-NAME-1         PIC X(08) VALUE SPACES.      01298992
012990     05  PV-DB2-TABLE-NAME-2         PIC X(08) VALUE SPACES.      01299092
012991                                                                  01299192
013000     05  PV-DISPLAY-OPER             PIC  9(04) VALUE ZEROES.     01300000
013100     05  PV-DISPLAY-SQLCODE          PIC  9(03)- VALUE ZEROES.    01310000
013200     05  PV-DB2-TABLE-NAME1          PIC  X(15) VALUE SPACES.     01320000
013300                                                                  01330000
013400     05  PV-DISPLAY-READ-COUNT       PIC ZZZ,ZZZ,ZZ9.             01340000
013500     05  PV-DISPLAY-WRITE-COUNT      PIC ZZZ,ZZZ,ZZ9.             01350000
013600     05  PV-DISPLAY-PERCENT1         PIC ZZZ.99.                  01360000
013700     05  PV-DISPLAY-PERCENT2         PIC ZZZ.                     01370000
013800                                                                  01380000
013900 01  PV-SAVE-FIELDS.                                              01390000
014000     05  PV-SAVE-OPER-UNT-ID          PIC S9(04) COMP             01400000
014100                                                 VALUE +0.        01410000
014200 01  DK-DB-KEYS.                                                  01420000
014300     05  DK-OPER-UNT-ID              PIC S9(4) COMP.              01430000
014400                                                                  01440000
014410 01  REPORT-DATES.                                                01441053
014500     05  REPORT-FROM-DATE            PIC X(10).                   01450053
014501     05  REPORT-TO-DATE              PIC X(10).                   01450153
014502******************************************************************01450253
014503*    DATE CONTROL CARD                                            01450353
014504******************************************************************01450453
014520     COPY SURD032.                                                01452051
014530                                                                  01453051
014600******************************************************************01460000
014700* RECORD LAYOUT FOR THE INPUT FILE.                               01470000
014800******************************************************************01480000
014900     COPY SURD123.                                                01490000
015000                                                                  01500000
015001******************************************************************01500199
015002* RECORD LAYOUT FOR THE SELECTION FILE                            01500299
015003******************************************************************01500399
015004     COPY SURD134.                                                01500499
015005                                                                  01500599
015010******************************************************************01501000
015020* RECORD LAYOUT FOR THE OUTPUT TILE                               01502000
015030******************************************************************01503000
015040     COPY SURD129.                                                01504005
015050                                                                  01505000
015100******************************************************************01510000
015200*  WORK FIELDS FOR PRINTING A 150 CHARACTER REPORT.               01520003
015300******************************************************************01530000
015410     COPY DPWS150O.                                               01541003
015500                                                                  01550000
015600 01  WS-BATCH-PROC-DATE.                                          01560000
015700     05  WS-BATCH-PROC-CC            PIC X(02) VALUE SPACES.      01570000
015800     05  WS-BATCH-PROC-YY            PIC X(02) VALUE SPACES.      01580000
015900     05  FILLER                      PIC X(01) VALUE SPACES.      01590000
016000     05  WS-BATCH-PROC-MM            PIC X(02) VALUE SPACES.      01600000
016100     05  FILLER                      PIC X(01) VALUE SPACES.      01610000
016200     05  WS-BATCH-PROC-DD            PIC X(02) VALUE SPACES.      01620000
016300*                                                                 01630000
016400 01  HEADING-LINES.                                               01640000
016500     05  HEADING-LINE1.                                           01650000
016600         10  FILLER                  PIC X(50) VALUE SPACES.      01660099
016610         10  HL1-SELECTION           PIC X(04) VALUE SPACES.      01661099
016620             88  HL1-RDC-STORES                VALUE SPACES.      01662099
016630             88  HL1-EFC-STORES                VALUE 'EFC '.      01663099
016640             88  HL1-LFC-STORES                VALUE 'LFC '.      01664099
016700         10  FILLER                  PIC X(43) VALUE              01670003
016800         'SHIPPED TRAILERS AVG DAYS SUMMARY BY SOURCE'.           01680004
016900         10  FILLER                  PIC X(53) VALUE SPACES.      01690054
017000                                                                  01700000
017010     05  HEADING-LINE1A.                                          01701000
017020         10  FILLER                  PIC X(58) VALUE SPACES.      01702056
017030         10  FILLER                  PIC X(12) VALUE              01703000
017040         'FISCAL WEEK '.                                          01704009
017041         10  HD1A-FROM-DATE          PIC X(10) VALUE SPACES.      01704100
017042         10  FILLER                  PIC X(03) VALUE ' - '.       01704256
017043         10  HD1A-TO-DATE            PIC X(10) VALUE SPACES.      01704300
017050         10  FILLER                  PIC X(59) VALUE SPACES.      01705054
017060                                                                  01706000
017100     05  HEADING-LINE2.                                           01710000
017200         10  HD2-OPER-UNT-ID         PIC 9(04) VALUE ZEROES.      01720000
017300         10  FILLER                  PIC X(01) VALUE SPACES.      01730000
017400         10  HD2-DC-NAME             PIC X(40) VALUE SPACES.      01740000
017500         10  FILLER                  PIC X(87) VALUE SPACES.      01750000
017510         10  FILLER                  PIC X(18) VALUE SPACES.      01751054
017600                                                                  01760000
017700     05  HEADING-LINE3.                                           01770000
017800         10  FILLER            PIC X(38) VALUE SPACES.            01780087
017900         10  FILLER            PIC X(05) VALUE '     '.           01790003
018000         10  FILLER            PIC X(02) VALUE SPACES.            01800003
018001         10  FILLER            PIC X(05) VALUE '     '.           01800187
018002         10  FILLER            PIC X(02) VALUE SPACES.            01800287
018010         10  FILLER            PIC X(05) VALUE '     '.           01801003
018020         10  FILLER            PIC X(02) VALUE SPACES.            01802003
018030         10  FILLER            PIC X(05) VALUE '     '.           01803003
018040         10  FILLER            PIC X(02) VALUE SPACES.            01804003
018050         10  FILLER            PIC X(05) VALUE '     '.           01805003
018060         10  FILLER            PIC X(02) VALUE SPACES.            01806003
018070         10  FILLER            PIC X(05) VALUE '     '.           01807086
018080         10  FILLER            PIC X(02) VALUE SPACES.            01808003
018100         10  FILLER            PIC X(05) VALUE '     '.           01810085
018200         10  FILLER            PIC X(02) VALUE SPACES.            01820003
018300         10  FILLER            PIC X(05) VALUE 'TOTE/'.           01830086
018400         10  FILLER            PIC X(02) VALUE SPACES.            01840003
018500         10  FILLER            PIC X(05) VALUE ' CRTN'.           01850003
018600         10  FILLER            PIC X(02) VALUE SPACES.            01860003
018700         10  FILLER            PIC X(05) VALUE ' CRTN'.           01870003
018710         10  FILLER            PIC X(02) VALUE SPACES.            01871003
018720         10  FILLER            PIC X(05) VALUE ' CRTN'.           01872003
018800         10  FILLER            PIC X(02) VALUE SPACES.            01880003
018810         10  FILLER            PIC X(05) VALUE '     '.           01881003
018820         10  FILLER            PIC X(02) VALUE SPACES.            01882003
018830         10  FILLER            PIC X(05) VALUE '     '.           01883003
018840         10  FILLER            PIC X(02) VALUE SPACES.            01884003
018850         10  FILLER            PIC X(05) VALUE '     '.           01885003
018860         10  FILLER            PIC X(02) VALUE SPACES.            01886003
018870         10  FILLER            PIC X(05) VALUE '     '.           01887003
018871         10  FILLER            PIC X(02) VALUE SPACES.            01887103
018872         10  FILLER            PIC X(05) VALUE '     '.           01887203
018880         10  FILLER            PIC X(02) VALUE SPACES.            01888087
018900                                                                  01890000
018910     05  HEADING-LINE4.                                           01891000
018911         10  FILLER            PIC X(38) VALUE SPACES.            01891187
018912         10  FILLER            PIC X(05) VALUE '     '.           01891203
018913         10  FILLER            PIC X(02) VALUE SPACES.            01891303
018914         10  FILLER            PIC X(05) VALUE '     '.           01891487
018915         10  FILLER            PIC X(02) VALUE SPACES.            01891587
018916         10  FILLER            PIC X(05) VALUE '     '.           01891603
018917         10  FILLER            PIC X(02) VALUE SPACES.            01891703
018918         10  FILLER            PIC X(05) VALUE '     '.           01891803
018919         10  FILLER            PIC X(02) VALUE SPACES.            01891903
018920         10  FILLER            PIC X(05) VALUE ' TOTE'.           01892082
018921         10  FILLER            PIC X(02) VALUE SPACES.            01892103
018922         10  FILLER            PIC X(05) VALUE ' TOTE'.           01892286
018923         10  FILLER            PIC X(02) VALUE SPACES.            01892303
018924         10  FILLER            PIC X(05) VALUE ' TOTE'.           01892485
018925         10  FILLER            PIC X(02) VALUE SPACES.            01892503
018926         10  FILLER            PIC X(05) VALUE ' CRTN'.           01892686
018927         10  FILLER            PIC X(02) VALUE SPACES.            01892703
018928         10  FILLER            PIC X(05) VALUE ' ARVL'.           01892803
018929         10  FILLER            PIC X(02) VALUE SPACES.            01892903
018930         10  FILLER            PIC X(05) VALUE '  ON '.           01893003
018931         10  FILLER            PIC X(02) VALUE SPACES.            01893103
018932         10  FILLER            PIC X(05) VALUE '  ON '.           01893203
018933         10  FILLER            PIC X(02) VALUE SPACES.            01893303
018934         10  FILLER            PIC X(05) VALUE ' ARVL'.           01893464
018935         10  FILLER            PIC X(02) VALUE SPACES.            01893503
018936         10  FILLER            PIC X(05) VALUE ' ARVL'.           01893664
018937         10  FILLER            PIC X(02) VALUE SPACES.            01893703
018938         10  FILLER            PIC X(05) VALUE ' TRLR'.           01893803
018939         10  FILLER            PIC X(02) VALUE SPACES.            01893903
018940         10  FILLER            PIC X(05) VALUE ' TRLR'.           01894064
018941         10  FILLER            PIC X(02) VALUE SPACES.            01894103
018942         10  FILLER            PIC X(05) VALUE ' TRLR'.           01894264
018950         10  FILLER            PIC X(02) VALUE SPACES.            01895087
019002                                                                  01900200
019003     05  HEADING-LINE5.                                           01900300
019004         10  FILLER            PIC X(38) VALUE SPACES.            01900487
019005         10  FILLER            PIC X(05) VALUE ' %   '.           01900587
019006         10  FILLER            PIC X(02) VALUE SPACES.            01900603
019007         10  FILLER            PIC X(05) VALUE ' ARVL'.           01900787
019008         10  FILLER            PIC X(02) VALUE SPACES.            01900887
019009         10  FILLER            PIC X(05) VALUE 'CK-IN'.           01900903
019010         10  FILLER            PIC X(02) VALUE SPACES.            01901003
019011         10  FILLER            PIC X(05) VALUE ' ARVL'.           01901103
019012         10  FILLER            PIC X(02) VALUE SPACES.            01901203
019013         10  FILLER            PIC X(05) VALUE ' OPEN'.           01901303
019014         10  FILLER            PIC X(02) VALUE SPACES.            01901403
019015         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01901586
019016         10  FILLER            PIC X(02) VALUE SPACES.            01901603
019017         10  FILLER            PIC X(05) VALUE ' OPEN'.           01901786
019018         10  FILLER            PIC X(02) VALUE SPACES.            01901803
019019         10  FILLER            PIC X(05) VALUE '  TO '.           01901986
019020         10  FILLER            PIC X(02) VALUE SPACES.            01902003
019021         10  FILLER            PIC X(05) VALUE '  TO '.           01902103
019022         10  FILLER            PIC X(02) VALUE SPACES.            01902203
019023         10  FILLER            PIC X(05) VALUE ' TRLR'.           01902303
019024         10  FILLER            PIC X(02) VALUE SPACES.            01902403
019025         10  FILLER            PIC X(05) VALUE ' TRLR'.           01902503
019026         10  FILLER            PIC X(02) VALUE SPACES.            01902603
019027         10  FILLER            PIC X(05) VALUE '  TO '.           01902764
019028         10  FILLER            PIC X(02) VALUE SPACES.            01902803
019029         10  FILLER            PIC X(05) VALUE '  TO '.           01902964
019030         10  FILLER            PIC X(02) VALUE SPACES.            01903003
019031         10  FILLER            PIC X(05) VALUE ' OPEN'.           01903103
019032         10  FILLER            PIC X(02) VALUE SPACES.            01903203
019033         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01903364
019034         10  FILLER            PIC X(02) VALUE SPACES.            01903403
019035         10  FILLER            PIC X(05) VALUE ' OPEN'.           01903564
019036         10  FILLER            PIC X(02) VALUE SPACES.            01903687
019056                                                                  01905600
019057     05  HEADING-LINE6.                                           01905700
019058         10  FILLER            PIC X(02) VALUE SPACES.            01905803
019059         10  FILLER            PIC X(02) VALUE 'DC'.              01905903
019060         10  FILLER            PIC X(02) VALUE SPACES.            01906003
019061         10  FILLER            PIC X(05) VALUE 'STORE'.           01906103
019062         10  FILLER            PIC X(02) VALUE SPACES.            01906203
019063         10  FILLER            PIC X(04) VALUE 'TRIP'.            01906303
019064         10  FILLER            PIC X(21) VALUE SPACES.            01906487
019065         10  FILLER            PIC X(05) VALUE '  OF '.           01906587
019066         10  FILLER            PIC X(02) VALUE SPACES.            01906603
019067         10  FILLER            PIC X(05) VALUE '  TO '.           01906787
019068         10  FILLER            PIC X(02) VALUE SPACES.            01906887
019069         10  FILLER            PIC X(05) VALUE '  TO '.           01906903
019070         10  FILLER            PIC X(02) VALUE SPACES.            01907003
019071         10  FILLER            PIC X(05) VALUE '  TO '.           01907103
019072         10  FILLER            PIC X(02) VALUE SPACES.            01907203
019073         10  FILLER            PIC X(05) VALUE '  TO '.           01907320
019074         10  FILLER            PIC X(02) VALUE SPACES.            01907403
019075         10  FILLER            PIC X(05) VALUE '  TO '.           01907586
019076         10  FILLER            PIC X(02) VALUE SPACES.            01907603
019077         10  FILLER            PIC X(05) VALUE '  TO '.           01907785
019078         10  FILLER            PIC X(02) VALUE SPACES.            01907803
019079         10  FILLER            PIC X(05) VALUE 'OTBND'.           01907986
019080         10  FILLER            PIC X(02) VALUE SPACES.            01908003
019081         10  FILLER            PIC X(05) VALUE 'OTBND'.           01908103
019082         10  FILLER            PIC X(02) VALUE SPACES.            01908203
019083         10  FILLER            PIC X(05) VALUE '  TO '.           01908303
019084         10  FILLER            PIC X(02) VALUE SPACES.            01908403
019085         10  FILLER            PIC X(05) VALUE '  TO '.           01908503
019086         10  FILLER            PIC X(02) VALUE SPACES.            01908603
019087         10  FILLER            PIC X(05) VALUE ' TRLR'.           01908764
019088         10  FILLER            PIC X(02) VALUE SPACES.            01908803
019089         10  FILLER            PIC X(05) VALUE ' TRLR'.           01908964
019090         10  FILLER            PIC X(02) VALUE SPACES.            01909003
019091         10  FILLER            PIC X(05) VALUE '  TO '.           01909103
019092         10  FILLER            PIC X(02) VALUE SPACES.            01909203
019093         10  FILLER            PIC X(05) VALUE '  TO '.           01909364
019094         10  FILLER            PIC X(02) VALUE SPACES.            01909403
019095         10  FILLER            PIC X(05) VALUE '  TO '.           01909564
019100         10  FILLER            PIC X(02) VALUE SPACES.            01910087
019110                                                                  01911000
019111     05  HEADING-LINE7.                                           01911103
019112         10  FILLER            PIC X(02) VALUE SPACES.            01911203
019113         10  FILLER            PIC X(03) VALUE 'NBR'.             01911303
019114         10  FILLER            PIC X(02) VALUE SPACES.            01911403
019115         10  FILLER            PIC X(03) VALUE 'NBR'.             01911503
019116         10  FILLER            PIC X(03) VALUE SPACES.            01911603
019117         10  FILLER            PIC X(04) VALUE ' ID '.            01911703
019118         10  FILLER            PIC X(04) VALUE SPACES.            01911803
019119         10  FILLER            PIC X(13) VALUE 'CARTON SOURCE'.   01911963
019120         10  FILLER            PIC X(04) VALUE SPACES.            01912087
019121         10  FILLER            PIC X(05) VALUE ' CRTN'.           01912187
019122         10  FILLER            PIC X(02) VALUE SPACES.            01912203
019123         10  FILLER            PIC X(05) VALUE 'CK-IN'.           01912387
019124         10  FILLER            PIC X(02) VALUE SPACES.            01912487
019125         10  FILLER            PIC X(05) VALUE ' PACK'.           01912503
019126         10  FILLER            PIC X(02) VALUE SPACES.            01912603
019127         10  FILLER            PIC X(05) VALUE ' PACK'.           01912703
019128         10  FILLER            PIC X(02) VALUE SPACES.            01912803
019129         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01912903
019130         10  FILLER            PIC X(02) VALUE SPACES.            01913003
019131         10  FILLER            PIC X(05) VALUE ' TRLR'.           01913103
019132         10  FILLER            PIC X(02) VALUE SPACES.            01913203
019133         10  FILLER            PIC X(05) VALUE ' TRLR'.           01913303
019134         10  FILLER            PIC X(02) VALUE SPACES.            01913403
019135         10  FILLER            PIC X(05) VALUE ' TRLR'.           01913503
019136         10  FILLER            PIC X(02) VALUE SPACES.            01913603
019137         10  FILLER            PIC X(05) VALUE ' TRLR'.           01913703
019138         10  FILLER            PIC X(02) VALUE SPACES.            01913803
019139         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01913903
019140         10  FILLER            PIC X(02) VALUE SPACES.            01914003
019141         10  FILLER            PIC X(05) VALUE ' SHIP'.           01914103
019142         10  FILLER            PIC X(02) VALUE SPACES.            01914203
019143         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01914347
019144         10  FILLER            PIC X(02) VALUE SPACES.            01914403
019145         10  FILLER            PIC X(05) VALUE ' SHIP'.           01914547
019146         10  FILLER            PIC X(02) VALUE SPACES.            01914603
019147         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01914764
019148         10  FILLER            PIC X(02) VALUE SPACES.            01914803
019149         10  FILLER            PIC X(05) VALUE ' SHIP'.           01914964
019150         10  FILLER            PIC X(02) VALUE SPACES.            01915003
019151         10  FILLER            PIC X(05) VALUE ' SHIP'.           01915103
019160         10  FILLER            PIC X(02) VALUE SPACES.            01916087
019300                                                                  01930000
022200 01  DETAIL-LINES.                                                02220000
022300     05  DETAIL-LINE1.                                            02230000
022400         10  FILLER                   PIC  X(01) VALUE SPACES.    02240057
022410         10  DL1-DC-NBR               PIC  Z(04) VALUE ZEROES.    02241000
022500         10  FILLER                   PIC  X(01) VALUE SPACES.    02250000
022600         10  DL1-STORE                PIC  Z(04) VALUE ZEROES.    02260000
022700         10  FILLER                   PIC  X(01) VALUE SPACES.    02270021
023000         10  DL1-TRIP-ID              PIC  Z(09) VALUE ZEROES.    02300000
023100         10  FILLER                   PIC  X(01) VALUE SPACES.    02310000
023200         10  DL1-SOURCE               PIC  X(16) VALUE SPACES.    02320021
023300         10  FILLER                   PIC  X(01)  VALUE SPACES.   02330003
023310*                                                                 02331087
023400         10  DL1-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02340099
023500         10  FILLER                   PIC  X(01)  VALUE SPACES.   02350099
023501*  <5>                                                            02350187
023502         10  DL1-ARVL-CKIN            PIC  ZZZ.9  VALUE ZERO.     02350287
023503         10  FILLER                   PIC  X(02)  VALUE SPACES.   02350387
023504*  <6>                                                            02350403
023510         10  DL1-P2L-CKIN-PACK        PIC  ZZZ.9  VALUE ZERO.     02351067
023520         10  FILLER                   PIC  X(02)  VALUE SPACES.   02352067
023521*  <7>                                                            02352103
023530         10  DL1-P2L-ARVL-PACK        PIC  ZZZ.9  VALUE ZERO.     02353067
023540         10  FILLER                   PIC  X(02)  VALUE SPACES.   02354067
023541*  <8>                                                            02354103
023550         10  DL1-P2L-OPEN-CLOSE       PIC  ZZZ.9  VALUE ZERO.     02355067
023560         10  FILLER                   PIC  X(02)  VALUE SPACES.   02356067
023568*  <8.2>                                                          02356881
023569         10  DL1-P2L-CLOSE-TRLR       PIC  ZZZ.9  VALUE ZERO.     02356981
023580         10  FILLER                   PIC  X(02)  VALUE SPACES.   02358067
023581*  <8.1>                                                          02358185
023582         10  DL1-P2L-OPEN-TRLR        PIC  ZZZ.9  VALUE ZERO.     02358285
023583         10  FILLER                   PIC  X(02)  VALUE SPACES.   02358385
023584*  <9>                                                            02358486
023585         10  DL1-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02358586
023586         10  FILLER                   PIC  X(02)  VALUE SPACES.   02358686
023587* <10>                                                            02358703
023590         10  DL1-ARVL-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02359067
023591         10  FILLER                   PIC  X(02)  VALUE SPACES.   02359167
023592* <11>                                                            02359203
023593         10  DL1-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02359367
023594         10  FILLER                   PIC  X(02)  VALUE SPACES.   02359467
023595* <11.5>                                                          02359503
023596         10  DL1-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02359667
023597         10  FILLER                   PIC  X(02)  VALUE SPACES.   02359767
023598* <15>                                                            02359864
023599         10  DL1-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02359967
023600         10  FILLER                   PIC  X(02)  VALUE SPACES.   02360067
023601* <16>                                                            02360164
023603         10  DL1-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02360367
023604         10  FILLER                   PIC  X(02)  VALUE SPACES.   02360467
023605* <12>                                                            02360564
023606         10  FILLER                   PIC  X(06)  VALUE SPACES.   02360664
023607         10  FILLER                   PIC  X(01)  VALUE SPACES.   02360703
023608* <13>                                                            02360864
023609         10  FILLER                   PIC  X(06)  VALUE SPACES.   02360964
023610         10  FILLER                   PIC  X(01)  VALUE SPACES.   02361003
023611* <14>                                                            02361164
023620         10  FILLER                   PIC  X(06)  VALUE SPACES.   02362064
023700         10  FILLER                   PIC  X(02)  VALUE SPACES.   02370087
025000                                                                  02500000
025010     05  DETAIL-LINE2.                                            02501064
025020         10  FILLER                   PIC  X(01) VALUE SPACES.    02502064
025030         10  DL2-DC-NBR               PIC  Z(04) VALUE ZEROES.    02503064
025040         10  FILLER                   PIC  X(01) VALUE SPACES.    02504064
025050         10  DL2-STORE                PIC  Z(04) VALUE ZEROES.    02505064
025060         10  FILLER                   PIC  X(01) VALUE SPACES.    02506064
025070         10  DL2-TRIP-ID              PIC  Z(09) VALUE ZEROES.    02507064
025080         10  FILLER                   PIC  X(01) VALUE SPACES.    02508064
025090         10  DL2-SOURCE               PIC  X(16) VALUE SPACES.    02509064
025091         10  FILLER                   PIC  X(01)  VALUE SPACES.   02509164
025092*                                                                 02509287
025093         10  DL2-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02509399
025094         10  FILLER                   PIC  X(01)  VALUE SPACES.   02509499
025095*  <5>                                                            02509564
025096         10  DL2-ARVL-CKIN            PIC  ZZZ.9  VALUE ZERO.     02509667
025097         10  FILLER                   PIC  X(02)  VALUE SPACES.   02509767
025098*  <6>                                                            02509864
025099         10  DL2-P2L-CKIN-PACK        PIC  ZZZ.9  VALUE ZERO.     02509967
025100         10  FILLER                   PIC  X(02)  VALUE SPACES.   02510067
025101*  <7>                                                            02510164
025102         10  DL2-P2L-ARVL-PACK        PIC  ZZZ.9  VALUE ZERO.     02510267
025103         10  FILLER                   PIC  X(02)  VALUE SPACES.   02510367
025104*  <8>                                                            02510464
025105         10  DL2-P2L-OPEN-CLOSE       PIC  ZZZ.9  VALUE ZERO.     02510567
025106         10  FILLER                   PIC  X(02)  VALUE SPACES.   02510667
025111*  <8.2>                                                          02511181
025112         10  DL2-P2L-CLOSE-TRLR       PIC  ZZZ.9  VALUE ZERO.     02511281
025114         10  FILLER                   PIC  X(02)  VALUE SPACES.   02511467
025115*  <8.1>                                                          02511585
025116         10  DL2-P2L-OPEN-TRLR        PIC  ZZZ.9  VALUE ZERO.     02511685
025117         10  FILLER                   PIC  X(02)  VALUE SPACES.   02511785
025118*  <9>                                                            02511886
025119         10  DL2-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02511986
025120         10  FILLER                   PIC  X(02)  VALUE SPACES.   02512086
025121* <10>                                                            02512164
025122         10  DL2-ARVL-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02512267
025123         10  FILLER                   PIC  X(02)  VALUE SPACES.   02512367
025124* <11>                                                            02512464
025125         10  DL2-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02512567
025126         10  FILLER                   PIC  X(02)  VALUE SPACES.   02512667
025127* <11.5>                                                          02512764
025128         10  DL2-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02512867
025129         10  FILLER                   PIC  X(02)  VALUE SPACES.   02512967
025130* <15>                                                            02513064
025131         10  DL2-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02513167
025132         10  FILLER                   PIC  X(02)  VALUE SPACES.   02513267
025133* <16>                                                            02513364
025134         10  DL2-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02513467
025135         10  FILLER                   PIC  X(02)  VALUE SPACES.   02513567
025136* <12>                                                            02513664
025137         10  DL2-TRLR-OPEN-TO-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02513767
025138         10  FILLER                   PIC  X(02)  VALUE SPACES.   02513867
025139* <13>                                                            02513964
025140         10  DL2-TRLR-CLOSE-TO-SHIP   PIC  ZZZ.9  VALUE ZERO.     02514067
025141         10  FILLER                   PIC  X(02)  VALUE SPACES.   02514167
025142* <14>                                                            02514264
025143         10  DL2-TRLR-OPEN-TO-SHIP    PIC  ZZZ.9  VALUE ZERO.     02514367
025144         10  FILLER                   PIC X(02)  VALUE SPACES.    02514487
025145                                                                  02514564
025146*** DETAIL LINE 3 IS FOR XDOCK CARTONS                            02514672
025147*** USER DID NOT WANT .0 TO SHOW IN THE P2L CARTONS               02514768
025148*** WANTED BLANKS TO APPEAR                                       02514868
025149                                                                  02514968
025150     05  DETAIL-LINE3.                                            02515068
025151         10  FILLER                   PIC  X(01) VALUE SPACES.    02515168
025152         10  DL3-DC-NBR               PIC  Z(04) VALUE ZEROES.    02515268
025153         10  FILLER                   PIC  X(01) VALUE SPACES.    02515368
025154         10  DL3-STORE                PIC  Z(04) VALUE ZEROES.    02515468
025155         10  FILLER                   PIC  X(01) VALUE SPACES.    02515568
025156         10  DL3-TRIP-ID              PIC  Z(09) VALUE ZEROES.    02515668
025157         10  FILLER                   PIC  X(01) VALUE SPACES.    02515768
025158         10  DL3-SOURCE               PIC  X(16) VALUE SPACES.    02515868
025159         10  FILLER                   PIC  X(01)  VALUE SPACES.   02515968
025160*                                                                 02516087
025161         10  DL3-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02516199
025162         10  FILLER                   PIC  X(01)  VALUE SPACES.   02516299
025163*  <5>                                                            02516368
025164         10  DL3-ARVL-CKIN            PIC  ZZZ.9  VALUE ZERO.     02516468
025165         10  FILLER                   PIC  X(02)  VALUE SPACES.   02516568
025166*  <6>                                                            02516668
025167         10  FILLER                   PIC  X(05)  VALUE SPACES.   02516768
025168         10  FILLER                   PIC  X(02)  VALUE SPACES.   02516868
025169*  <7>                                                            02516968
025170         10  FILLER                   PIC  X(05)  VALUE SPACES.   02517068
025171         10  FILLER                   PIC  X(02)  VALUE SPACES.   02517168
025172*  <8>                                                            02517268
025173         10  FILLER                   PIC  X(05)  VALUE SPACES.   02517368
025174         10  FILLER                   PIC  X(02)  VALUE SPACES.   02517468
025175*  <8.2>                                                          02517581
025176         10  FILLER                   PIC  X(05)  VALUE SPACES.   02517681
025177         10  FILLER                   PIC  X(02)  VALUE SPACES.   02517768
025178*  <8.1>                                                          02517885
025179         10  FILLER                   PIC  X(05)  VALUE SPACES.   02517985
025180         10  FILLER                   PIC  X(02)  VALUE SPACES.   02518085
025181*  <9>                                                            02518186
025182         10  DL3-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02518286
025183         10  FILLER                   PIC  X(02)  VALUE SPACES.   02518386
025184* <10>                                                            02518468
025185         10  DL3-ARVL-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02518568
025186         10  FILLER                   PIC  X(02)  VALUE SPACES.   02518668
025187* <11>                                                            02518768
025188         10  DL3-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02518868
025189         10  FILLER                   PIC  X(02)  VALUE SPACES.   02518968
025190* <11.5>                                                          02519068
025191         10  DL3-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02519168
025192         10  FILLER                   PIC  X(02)  VALUE SPACES.   02519268
025193* <15>                                                            02519368
025194         10  DL3-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02519468
025195         10  FILLER                   PIC  X(02)  VALUE SPACES.   02519568
025196* <16>                                                            02519668
025197         10  DL3-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02519768
025198         10  FILLER                   PIC  X(02)  VALUE SPACES.   02519868
025199* <12>                                                            02519968
025200         10  FILLER                   PIC  X(06)  VALUE SPACES.   02520068
025201         10  FILLER                   PIC  X(01)  VALUE SPACES.   02520168
025202* <13>                                                            02520268
025203         10  FILLER                   PIC  X(06)  VALUE SPACES.   02520368
025204         10  FILLER                   PIC  X(01)  VALUE SPACES.   02520468
025205* <14>                                                            02520568
025206         10  FILLER                   PIC  X(06)  VALUE SPACES.   02520668
025207         10  FILLER                   PIC  X(02)  VALUE SPACES.   02520787
025208                                                                  02520868
025209*** DETAIL LINE 4 IS FOR MASTER CONTAINERS                        02520968
025210*** USER DID NOT WANT .0 TO SHOW IN THE MST CARTONS               02521068
025211*** WANTED BLANKS TO APPEAR                                       02521168
025212                                                                  02521268
025213     05  DETAIL-LINE4.                                            02521368
025214         10  FILLER                   PIC  X(01) VALUE SPACES.    02521468
025215         10  DL4-DC-NBR               PIC  Z(04) VALUE ZEROES.    02521568
025216         10  FILLER                   PIC  X(01) VALUE SPACES.    02521668
025217         10  DL4-STORE                PIC  Z(04) VALUE ZEROES.    02521768
025218         10  FILLER                   PIC  X(01) VALUE SPACES.    02521868
025219         10  DL4-TRIP-ID              PIC  Z(09) VALUE ZEROES.    02521968
025220         10  FILLER                   PIC  X(01) VALUE SPACES.    02522068
025221         10  DL4-SOURCE               PIC  X(16) VALUE SPACES.    02522168
025222         10  FILLER                   PIC  X(01)  VALUE SPACES.   02522268
025223*                                                                 02522387
025224         10  DL4-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02522499
025225         10  FILLER                   PIC  X(01)  VALUE SPACES.   02522599
025226*  <5>                                                            02522668
025227         10  FILLER                   PIC  X(05)  VALUE SPACES.   02522768
025228         10  FILLER                   PIC  X(02)  VALUE SPACES.   02522868
025229*  <6>                                                            02522968
025230         10  DL4-P2L-CKIN-PACK        PIC  ZZZ.9  VALUE ZERO.     02523068
025231         10  FILLER                   PIC  X(02)  VALUE SPACES.   02523168
025232*  <7>                                                            02523268
025233         10  DL4-P2L-ARVL-PACK        PIC  ZZZ.9  VALUE ZERO.     02523368
025234         10  FILLER                   PIC  X(02)  VALUE SPACES.   02523468
025235*  <8>                                                            02523568
025236         10  DL4-P2L-OPEN-CLOSE       PIC  ZZZ.9  VALUE ZERO.     02523668
025237         10  FILLER                   PIC  X(02)  VALUE SPACES.   02523768
025238*  <8.2>                                                          02523881
025239         10  FILLER                   PIC  X(05)  VALUE SPACES.   02523981
025240         10  FILLER                   PIC  X(02)  VALUE SPACES.   02524068
025241*  <8.1>                                                          02524185
025242         10  FILLER                   PIC  X(05)  VALUE SPACES.   02524285
025243         10  FILLER                   PIC  X(02)  VALUE SPACES.   02524385
025244*  <9>                                                            02524486
025245         10  DL4-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02524586
025246         10  FILLER                   PIC  X(02)  VALUE SPACES.   02524686
025247* <10>                                                            02524768
025248         10  FILLER                   PIC  X(05)  VALUE SPACES.   02524868
025249         10  FILLER                   PIC  X(02)  VALUE SPACES.   02524968
025250* <11>                                                            02525068
025251         10  DL4-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02525168
025252         10  FILLER                   PIC  X(02)  VALUE SPACES.   02525268
025253* <11.5>                                                          02525368
025254         10  DL4-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02525468
025255         10  FILLER                   PIC  X(02)  VALUE SPACES.   02525568
025256* <15>                                                            02525668
025257         10  DL4-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02525768
025258         10  FILLER                   PIC  X(02)  VALUE SPACES.   02525868
025259* <16>                                                            02525968
025260         10  DL4-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02526068
025261         10  FILLER                   PIC  X(02)  VALUE SPACES.   02526168
025262* <12>                                                            02526268
025263         10  FILLER                   PIC  X(06)  VALUE SPACES.   02526368
025264         10  FILLER                   PIC  X(01)  VALUE SPACES.   02526468
025265* <13>                                                            02526568
025266         10  FILLER                   PIC  X(06)  VALUE SPACES.   02526668
025267         10  FILLER                   PIC  X(01)  VALUE SPACES.   02526768
025268* <14>                                                            02526868
025269         10  FILLER                   PIC  X(06)  VALUE SPACES.   02526968
025270         10  FILLER                   PIC  X(02)  VALUE SPACES.   02527087
025271                                                                  02527168
025272*** DETAIL LINE 5 IS FOR RDM (IR-IMPORT REPLEN) CARTONS           02527272
025273*** USER DID NOT WANT .0 TO SHOW IN THE P2L CARTONS               02527372
025274*** WANTED BLANKS TO APPEAR                                       02527472
025275                                                                  02527572
025276     05  DETAIL-LINE5.                                            02527672
025277         10  FILLER                   PIC  X(01)  VALUE SPACES.   02527772
025278         10  DL5-DC-NBR               PIC  Z(04)  VALUE ZEROES.   02527872
025279         10  FILLER                   PIC  X(01)  VALUE SPACES.   02527972
025280         10  DL5-STORE                PIC  Z(04)  VALUE ZEROES.   02528072
025281         10  FILLER                   PIC  X(01)  VALUE SPACES.   02528172
025282         10  DL5-TRIP-ID              PIC  Z(09)  VALUE ZEROES.   02528272
025283         10  FILLER                   PIC  X(01)  VALUE SPACES.   02528372
025284         10  DL5-SOURCE               PIC  X(16)  VALUE SPACES.   02528472
025285         10  FILLER                   PIC  X(01)  VALUE SPACES.   02528572
025286*                                                                 02528687
025287         10  DL5-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02528799
025288         10  FILLER                   PIC  X(01)  VALUE SPACES.   02528899
025289*  <5>                                                            02528972
025290         10  FILLER                   PIC  X(05)  VALUE SPACES.   02529072
025291         10  FILLER                   PIC  X(02)  VALUE SPACES.   02529172
025292*  <6>                                                            02529272
025293         10  FILLER                   PIC  X(05)  VALUE SPACES.   02529372
025294         10  FILLER                   PIC  X(02)  VALUE SPACES.   02529472
025295*  <7>                                                            02529572
025296         10  FILLER                   PIC  X(05)  VALUE SPACES.   02529672
025297         10  FILLER                   PIC  X(02)  VALUE SPACES.   02529772
025298*  <8>                                                            02529872
025299         10  FILLER                   PIC  X(05)  VALUE SPACES.   02529972
025300         10  FILLER                   PIC  X(02)  VALUE SPACES.   02530072
025301*  <8.2>                                                          02530181
025302         10  FILLER                   PIC  X(05)  VALUE SPACES.   02530281
025303         10  FILLER                   PIC  X(02)  VALUE SPACES.   02530372
025304*  <8.1>                                                          02530485
025305         10  FILLER                   PIC  X(05)  VALUE SPACES.   02530585
025306         10  FILLER                   PIC  X(02)  VALUE SPACES.   02530685
025307*  <9>                                                            02530786
025308         10  DL5-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02530886
025309         10  FILLER                   PIC  X(02)  VALUE SPACES.   02530986
025310* <10>                                                            02531072
025311         10  FILLER                   PIC  X(05)  VALUE SPACES.   02531180
025312         10  FILLER                   PIC  X(02)  VALUE SPACES.   02531272
025313* <11>                                                            02531372
025314         10  DL5-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02531472
025315         10  FILLER                   PIC  X(02)  VALUE SPACES.   02531572
025316* <11.5>                                                          02531672
025317         10  DL5-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02531772
025318         10  FILLER                   PIC  X(02)  VALUE SPACES.   02531872
025319* <15>                                                            02531972
025320         10  DL5-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02532072
025321         10  FILLER                   PIC  X(02)  VALUE SPACES.   02532172
025322* <16>                                                            02532272
025323         10  DL5-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02532372
025324         10  FILLER                   PIC  X(02)  VALUE SPACES.   02532472
025325* <12>                                                            02532572
025326         10  FILLER                   PIC  X(06)  VALUE SPACES.   02532672
025327         10  FILLER                   PIC  X(01)  VALUE SPACES.   02532772
025328* <13>                                                            02532872
025329         10  FILLER                   PIC  X(06)  VALUE SPACES.   02532972
025330         10  FILLER                   PIC  X(01)  VALUE SPACES.   02533072
025331* <14>                                                            02533172
025332         10  FILLER                   PIC  X(06)  VALUE SPACES.   02533272
025333         10  FILLER                   PIC  X(08)  VALUE SPACES.   02533372
025334                                                                  02533472
025335 01  MISCELLANEOUS-LINES.                                         02533568
025336     05  BLANK-LINE.                                              02533600
025340         10  FILLER                  PIC X(150) VALUE SPACES.     02534054
025400                                                                  02540000
025500     05  END-OF-REPORT-LINE.                                      02550000
025600         10  FILLER                  PIC X(44) VALUE SPACES.      02560000
025700         10  FILLER                  PIC X(45) VALUE              02570000
025800             '*******   E N D   O F   R E P O R T   *******'.     02580000
025900         10  FILLER                  PIC X(43) VALUE SPACES.      02590000
025910         10  FILLER                  PIC X(18) VALUE SPACES.      02591054
026000                                                                  02600000
026100     05  NO-DATA-TO-REPORT-LINE.                                  02610000
026200         10  FILLER                  PIC X(40) VALUE SPACES.      02620000
026300         10  FILLER                  PIC  X(52)    VALUE          02630000
026400         '*******  N O   D A T A   T O   R E P O R T   *******'.  02640000
026500         10  FILLER                  PIC  X(40)    VALUE SPACES.  02650000
026510         10  FILLER                  PIC X(18) VALUE SPACES.      02651054
026600                                                                  02660000
026700                                                                  02670000
026800******************************************************************02680000
026900*  USED FOR DB2 ERROR MESSAGE BUILDING                            02690000
027000******************************************************************02700000
027100     COPY DPWS004.                                                02710000
027200                                                                  02720000
027300******************************************************************02730000
027400*   DB2 SQL COMMUNICATION AREA                                    02740000
027500******************************************************************02750000
027600     EXEC SQL                                                     02760000
027700          INCLUDE SQLCA                                           02770000
027800     END-EXEC.                                                    02780000
027900                                                                  02790000
028000*---------------------------------------------------------------* 02800000
028100*  DCLGEN FOR THE LOGISTICS LOCATION TABLE                        02810000
028200*  XLT_LOC                                                        02820000
028300*---------------------------------------------------------------* 02830000
028400     EXEC SQL                                                     02840000
028500          INCLUDE XLT00010                                        02850000
028600     END-EXEC.                                                    02860000
028700                                                                  02870000
028800******************************************************************02880000
028900 PROCEDURE DIVISION.                                              02890000
029000     DISPLAY '**** START OF SUKRP071 ****'.                       02900000
029100                                                                  02910000
029200*OPEN FILES.                                                      02920000
029300     OPEN INPUT  INPUT-FILE                                       02930000
029310                 CONTROL-FILE                                     02931051
029320                 SELECTION-FILE                                   02932099
029400          OUTPUT REPORT-FILE                                      02940000
029410                 OUTPUT-FILE.                                     02941000
029500                                                                  02950000
029600     PERFORM 1000-INITIALIZATION.                                 02960000
029700                                                                  02970000
029800     SET  PS-NOT-END-OF-INPUT   TO  TRUE.                         02980000
029900                                                                  02990000
030000     PERFORM 7000-READ-EXTRACT-FILE.                              03000000
030100                                                                  03010000
030210     MOVE SU123-TRIP-ID         TO  PV-PREV-TRIP-ID.              03021000
030220     MOVE SU123-OPER-UNT-ID     TO  PV-PREV-OPER.                 03022000
030230     MOVE SU123-STORE-DEST      TO  PV-PREV-DEST.                 03023034
030300                                                                  03030000
030400     IF PS-END-OF-INPUT                                           03040000
030500        ADD +1                  TO PV-PAGE-COUNT                  03050000
030600        MOVE PV-PAGE-COUNT      TO DP150O-PAGE-NUMBER             03060009
030700        WRITE REPORT-RECORD                                       03070000
030800          FROM DP150O-STANDRD-HEADER-150-COLS                     03080009
030900            AFTER ADVANCING PAGE                                  03090000
031000        WRITE REPORT-RECORD                                       03100000
031100          FROM HEADING-LINE1                                      03110000
031200            AFTER ADVANCING 1 LINES                               03120000
031210        WRITE REPORT-RECORD                                       03121000
031220          FROM HEADING-LINE1A                                     03122000
031230            AFTER ADVANCING 1 LINES                               03123000
031300        WRITE REPORT-RECORD                                       03130000
031400          FROM HEADING-LINE2                                      03140000
031500            AFTER ADVANCING 1 LINE                                03150000
031600        WRITE REPORT-RECORD                                       03160000
031700          FROM NO-DATA-TO-REPORT-LINE                             03170000
031800            AFTER ADVANCING 2 LINES                               03180000
031900     ELSE                                                         03190000
032000         MOVE SU123-OPER-UNT-ID  TO PV-SAVE-OPER-UNT-ID           03200061
032100         PERFORM 8500-GET-LOCATION-NAME                           03210061
032200         PERFORM 1500-PRINT-HEADINGS                              03220061
032300         PERFORM 2000-PROCESS-INPUT                               03230061
032400           UNTIL PS-END-OF-INPUT                                  03240061
032410         PERFORM 3020-CALC-TRIP-AVERAGES                          03241061
032411         PERFORM 3025-CALC-TRIP-CART-PCNT                         03241191
032420         PERFORM 5020-PRINT-TRLR-TOTALS                           03242061
032430         PERFORM 8020-WRITE-OUTPUT-FILE                           03243061
032500     END-IF.                                                      03250000
032600                                                                  03260000
032700*FINISH REPORT.                                                   03270000
032800                                                                  03280000
032900     WRITE REPORT-RECORD                                          03290000
033000       FROM END-OF-REPORT-LINE                                    03300000
033100         AFTER ADVANCING 3 LINES.                                 03310000
033200                                                                  03320000
033300*CLOSE FILES.                                                     03330000
033400     CLOSE INPUT-FILE                                             03340000
033410           CONTROL-FILE                                           03341051
033420           SELECTION-FILE                                         03342099
033500           REPORT-FILE                                            03350000
033510           OUTPUT-FILE.                                           03351000
033600                                                                  03360000
033700     MOVE PV-READ-COUNT TO PV-DISPLAY-READ-COUNT.                 03370000
033800     DISPLAY 'TOTAL INPUT READ ' PV-DISPLAY-READ-COUNT.           03380000
033900                                                                  03390000
034000     MOVE PV-WRITE-COUNT TO PV-DISPLAY-WRITE-COUNT.               03400000
034100     DISPLAY 'TOTAL RECS WRITTEN ' PV-DISPLAY-WRITE-COUNT.        03410000
034200                                                                  03420000
034300     GOBACK.                                                      03430000
034400                                                                  03440000
034500******************************************************************03450000
034600*  PERFORM THE INITIAL PROCESSING FOR THE PROGRAM.               *03460000
034700******************************************************************03470000
034800 1000-INITIALIZATION.                                             03480000
034900     ACCEPT SD-SYSTEM-DATE                                        03490000
035000       FROM DATE.                                                 03500000
035100                                                                  03510000
035200     ACCEPT SD-SYSTEM-TIME                                        03520000
035300       FROM TIME.                                                 03530000
035400                                                                  03540000
035500     MOVE SD-SYSTEM-DATE-MM  TO DP150O-RUN-MONTH.                 03550009
035600     MOVE SD-SYSTEM-DATE-DD  TO DP150O-RUN-DAY.                   03560009
035700     MOVE SD-SYSTEM-DATE-YY  TO DP150O-RUN-YEAR.                  03570009
035800     MOVE SD-SYSTEM-TIME-HH  TO DP150O-RUN-HOUR.                  03580009
035900     MOVE SD-SYSTEM-TIME-MM  TO DP150O-RUN-MINUTE.                03590009
036000                                                                  03600000
036100     MOVE PC-SUKRP071             TO DP150O-PROGRAM-NAME.         03610009
036200     MOVE PC-REPORT-NBR           TO DP150O-REPORT-NUMBER.        03620009
036300     MOVE +0                      TO PV-PAGE-COUNT.               03630000
036400                                                                  03640000
036410     PERFORM 7010-READ-CONTROL-REC.                               03641051
036411     MOVE SU032-FROM-DATE    TO  REPORT-FROM-DATE.                03641153
036412     MOVE SU032-TO-DATE      TO  REPORT-TO-DATE.                  03641253
036420                                                                  03642051
036430     PERFORM 7015-READ-SELECTION-REC.                             03643099
036460                                                                  03646099
036470                                                                  03647099
036500******************************************************************03650000
036600**  WRITES REPORT HEADER LINES FOR FIRST PAGE AND ANY SUBSEQUENT  03660000
036700**  PAGES (AS NEEDED).                                            03670000
036800******************************************************************03680000
036900 1500-PRINT-HEADINGS.                                             03690000
037000     ADD +1                  TO PV-PAGE-COUNT.                    03700000
037100     MOVE PV-PAGE-COUNT      TO DP150O-PAGE-NUMBER.               03710009
037200                                                                  03720000
037201     MOVE REPORT-FROM-DATE   TO  HD1A-FROM-DATE.                  03720153
037203     MOVE REPORT-TO-DATE     TO  HD1A-TO-DATE.                    03720353
037220                                                                  03722051
037300     WRITE REPORT-RECORD                                          03730000
037400       FROM DP150O-STANDRD-HEADER-150-COLS                        03740009
037500         AFTER ADVANCING PAGE.                                    03750000
037600                                                                  03760000
037700     WRITE REPORT-RECORD                                          03770000
037800       FROM HEADING-LINE1                                         03780000
037900         AFTER ADVANCING 1 LINES.                                 03790000
038000                                                                  03800000
038010     WRITE REPORT-RECORD                                          03801000
038020       FROM HEADING-LINE1A                                        03802000
038030         AFTER ADVANCING 1 LINES.                                 03803000
038040                                                                  03804000
038100     WRITE REPORT-RECORD                                          03810000
038200       FROM HEADING-LINE2                                         03820000
038300         AFTER ADVANCING 1 LINE.                                  03830000
038400                                                                  03840000
038500     WRITE REPORT-RECORD                                          03850000
038600       FROM HEADING-LINE3                                         03860000
038700         AFTER ADVANCING 2 LINES.                                 03870000
038800                                                                  03880000
038900     WRITE REPORT-RECORD                                          03890000
039000       FROM HEADING-LINE4                                         03900000
039100         AFTER ADVANCING 1 LINES.                                 03910000
039200                                                                  03920000
039300     WRITE REPORT-RECORD                                          03930000
039400       FROM HEADING-LINE5                                         03940000
039500         AFTER ADVANCING 1 LINES.                                 03950000
039600                                                                  03960000
039610     WRITE REPORT-RECORD                                          03961000
039620       FROM HEADING-LINE6                                         03962000
039630         AFTER ADVANCING 1 LINES.                                 03963000
039640                                                                  03964000
039650     WRITE REPORT-RECORD                                          03965000
039660       FROM HEADING-LINE7                                         03966000
039670         AFTER ADVANCING 1 LINES.                                 03967000
039680                                                                  03968000
039700     WRITE REPORT-RECORD                                          03970000
039800       FROM BLANK-LINE                                            03980000
039900         AFTER ADVANCING 1 LINE.                                  03990000
040000                                                                  04000000
040100     MOVE +08                TO PV-LINE-COUNT.                    04010000
040110     MOVE ZEROES             TO PV-TRIP-COUNT.                    04011058
040200                                                                  04020000
040300******************************************************************04030000
040400**  READ INPUT-FILE, WHEN DC CHANGES, DO A PAGE BREAK             04040000
040500******************************************************************04050000
040600 2000-PROCESS-INPUT.                                              04060000
040700     IF  SU123-TRIP-ID = PV-PREV-TRIP-ID                          04070000
040800         CONTINUE                                                 04080000
040900     ELSE                                                         04090000
040911         PERFORM 3020-CALC-TRIP-AVERAGES                          04091107
040912         PERFORM 3025-CALC-TRIP-CART-PCNT                         04091291
040920         PERFORM 5020-PRINT-TRLR-TOTALS                           04092007
040930         PERFORM 8020-WRITE-OUTPUT-FILE                           04093034
041000         MOVE SU123-TRIP-ID    TO  PV-PREV-TRIP-ID                04100034
041100         MOVE SU123-STORE-DEST TO  PV-PREV-DEST                   04110034
041300     END-IF.                                                      04130000
041400                                                                  04140000
041410     IF  SU123-OPER-UNT-ID = PV-PREV-OPER                         04141000
041420         CONTINUE                                                 04142000
041430     ELSE                                                         04143000
041450         MOVE SU123-OPER-UNT-ID    TO PV-PREV-OPER                04145010
041451         MOVE SU123-OPER-UNT-ID    TO PV-SAVE-OPER-UNT-ID         04145132
041460         PERFORM 8500-GET-LOCATION-NAME                           04146000
041470         PERFORM 1500-PRINT-HEADINGS                              04147000
041480     END-IF.                                                      04148000
041490                                                                  04149000
041500     PERFORM 3000-CALC-AREA-AVERAGES.                             04150007
041501     PERFORM 3005-CALC-SRC-CRTN-PCNT.                             04150188
041502                                                                  04150288
041503     IF  SU123-SML-SRC-CDE   =  'MST'                             04150388
041504         CONTINUE                                                 04150488
041505     ELSE                                                         04150588
041506         PERFORM 3010-ACCUM-TRLR-TOTALS                           04150688
041507     END-IF.                                                      04150788
041508                                                                  04150888
041510     PERFORM 5000-PRINT-AREA-AVERAGE                              04151000
041520     PERFORM 8000-WRITE-OUTPUT-FILE                               04152034
041600                                                                  04160000
041700     PERFORM 7000-READ-EXTRACT-FILE.                              04170000
041800                                                                  04180000
041900                                                                  04190000
041901****************************************************************  04190100
041902* CALCULATE THE AVERAGES                                       *  04190200
041903****************************************************************  04190300
041910 3000-CALC-AREA-AVERAGES.                                         04191007
041911                                                                  04191137
041912     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04191237
041913                             PV-TRIP-CLOSE-TO-SHIP-AVG            04191337
041914                             PV-TRIP-OPEN-TO-SHIP-AVG             04191437
041916                             PV-ARRIVE-TO-PRC-AVG                 04191637
041917                             PV-ARRIVE-TO-P2L-PKD-AVG             04191737
041918                             PV-PRC-TO-P2L-PKD-AVG                04191837
041919                             PV-P2L-PKD-TO-CLOSE-AVG              04191937
041920                             PV-P2L-OPEN-TO-CLOSE-AVG             04192037
041921                             PV-P2L-OPEN-TO-OTBND-AVG             04192137
041922                             PV-P2L-CLOSE-TO-OTBND-AVG            04192237
041923                             PV-ARRIVE-TO-OTBND-AVG               04192337
041924                             PV-PRC-TO-OTBND-AVG                  04192437
041925                             PV-ARRIVE-TO-TCLOS-AVG               04192537
041926                             PV-ARRIVE-TO-SHIP-AVG                04192637
041927                             PV-P2L-OPEN-TO-TCLOS-AVG             04192737
041928                             PV-P2L-OPEN-TO-SHIP-AVG              04192837
041929                             PV-P2L-CLOSE-TO-TCLOS-AVG            04192937
041930                             PV-P2L-CLOSE-TO-SHIP-AVG             04193037
041931                             PV-ARRIVE-TO-MSTR-AVG                04193137
041932                             PV-PRC-TO-MSTR-AVG                   04193237
041933                             PV-MSTR-CRE-TO-OTBND-AVG             04193337
041934                             PV-MSTR-CRE-TO-TCLOS-AVG             04193437
041935                             PV-MSTR-CRE-TO-SHIP-AVG              04193537
041936                             PV-MSTR-FIRST-TO-OTBND-AVG           04193637
041937                             PV-MSTR-FIRST-TO-TCLOS-AVG           04193737
041938                             PV-MSTR-FIRST-TO-SHIP-AVG            04193837
041939                             PV-MSTR-LAST-TO-OTBND-AVG            04193937
041940                             PV-MSTR-LAST-TO-TCLOS-AVG            04194037
041941                             PV-MSTR-LAST-TO-SHIP-AVG             04194137
041942                             PV-ON-OTBND-TO-CLOS-AVG              04194237
041943                             PV-ON-OTBND-TO-SHIP-AVG              04194337
041945                             PV-TRIP-OPEN-TO-CLOSE-DAY            04194537
041946                             PV-TRIP-CLOSE-TO-SHIP-DAY            04194637
041947                             PV-TRIP-OPEN-TO-SHIP-DAY             04194737
041949                             PV-ARRIVE-TO-PRC-DAY                 04194937
041950                             PV-ARRIVE-TO-P2L-PKD-DAY             04195037
041951                             PV-PRC-TO-P2L-PKD-DAY                04195137
041952                             PV-P2L-PKD-TO-CLOSE-DAY              04195237
041953                             PV-P2L-OPEN-TO-CLOSE-DAY             04195337
041954                             PV-P2L-OPEN-TO-OTBND-DAY             04195437
041955                             PV-P2L-CLOSE-TO-OTBND-DAY            04195537
041956                             PV-ARRIVE-TO-OTBND-DAY               04195637
041957                             PV-PRC-TO-OTBND-DAY                  04195737
041958                             PV-ARRIVE-TO-TCLOS-DAY               04195837
041959                             PV-ARRIVE-TO-SHIP-DAY                04195937
041960                             PV-P2L-OPEN-TO-TCLOS-DAY             04196037
041961                             PV-P2L-OPEN-TO-SHIP-DAY              04196137
041962                             PV-P2L-CLOSE-TO-TCLOS-DAY            04196237
041963                             PV-P2L-CLOSE-TO-SHIP-DAY             04196337
041964                             PV-ARRIVE-TO-MSTR-DAY                04196437
041965                             PV-PRC-TO-MSTR-DAY                   04196537
041966                             PV-MSTR-CRE-TO-OTBND-DAY             04196637
041967                             PV-MSTR-CRE-TO-TCLOS-DAY             04196737
041968                             PV-MSTR-CRE-TO-SHIP-DAY              04196837
041969                             PV-MSTR-FIRST-TO-OTBND-DAY           04196937
041970                             PV-MSTR-FIRST-TO-TCLOS-DAY           04197037
041971                             PV-MSTR-FIRST-TO-SHIP-DAY            04197137
041972                             PV-MSTR-LAST-TO-OTBND-DAY            04197237
041973                             PV-MSTR-LAST-TO-TCLOS-DAY            04197337
041974                             PV-MSTR-LAST-TO-SHIP-DAY             04197437
041975                             PV-ON-OTBND-TO-CLOS-DAY              04197537
041976                             PV-ON-OTBND-TO-SHIP-DAY.             04197637
041977                                                                  04197700
041978     IF  SU123-TRIP-OPEN-TO-CLOSE-MIN  >  0                       04197842
041980         DIVIDE  SU123-TRIP-OPEN-TO-CLOSE-MIN                     04198000
041985             BY  1440                                             04198525
041986         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04198625
041987                 ROUNDED                                          04198725
041988     ELSE                                                         04198800
041989         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04198900
041990                           PV-TRIP-OPEN-TO-CLOSE-DAY              04199025
041991     END-IF.                                                      04199125
041992                                                                  04199225
041993     IF  SU123-TRIP-CLOSE-TO-SHIP-MIN  >  0                       04199342
041995         DIVIDE  SU123-TRIP-CLOSE-TO-SHIP-MIN                     04199525
042000             BY  1440                                             04200025
042001         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04200125
042002                 ROUNDED                                          04200225
042003     ELSE                                                         04200325
042004         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04200425
042005                           PV-TRIP-CLOSE-TO-SHIP-DAY              04200525
042006     END-IF.                                                      04200625
042007                                                                  04200725
042008     IF  SU123-TRIP-OPEN-TO-SHIP-MIN  >  0                        04200842
042010         DIVIDE  SU123-TRIP-OPEN-TO-SHIP-MIN                      04201025
042015             BY  1440                                             04201525
042016         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04201625
042017                 ROUNDED                                          04201725
042018     ELSE                                                         04201825
042019         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04201925
042020                           PV-TRIP-OPEN-TO-SHIP-DAY               04202025
042021     END-IF.                                                      04202125
042022                                                                  04202225
042023                                                                  04202325
042024     IF  SU123-ARRIVE-TO-PRC-MIN  >  0  AND                       04202425
042025         SU123-ARRIVE-TO-PRC-CNT  >  0                            04202525
042026         DIVIDE SU123-ARRIVE-TO-PRC-MIN                           04202625
042027             BY SU123-ARRIVE-TO-PRC-CNT                           04202725
042028         GIVING PV-ARRIVE-TO-PRC-AVG                              04202825
042029                 ROUNDED                                          04202925
042030         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04203025
042031             BY 1440                                              04203125
042032         GIVING PV-ARRIVE-TO-PRC-DAY                              04203225
042033                 ROUNDED                                          04203325
042034     ELSE                                                         04203425
042035         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04203525
042036                           PV-ARRIVE-TO-PRC-DAY                   04203625
042037     END-IF.                                                      04203725
042038                                                                  04203825
042039     IF  SU123-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                   04203925
042040         SU123-ARRIVE-TO-P2L-PKD-CNT  >  0                        04204025
042041         DIVIDE SU123-ARRIVE-TO-P2L-PKD-MIN                       04204125
042042             BY SU123-ARRIVE-TO-P2L-PKD-CNT                       04204225
042043         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04204325
042044                 ROUNDED                                          04204425
042045         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04204525
042046             BY 1440                                              04204625
042047         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04204725
042048                 ROUNDED                                          04204825
042049     ELSE                                                         04204925
042050         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04205025
042051                           PV-ARRIVE-TO-P2L-PKD-DAY               04205125
042052     END-IF.                                                      04205225
042053                                                                  04205325
042054                                                                  04205425
042055     IF  SU123-PRC-TO-P2L-PKD-MIN  >  0  AND                      04205525
042056         SU123-PRC-TO-P2L-PKD-CNT  >  0                           04205625
042057         DIVIDE SU123-PRC-TO-P2L-PKD-MIN                          04205725
042058             BY SU123-PRC-TO-P2L-PKD-CNT                          04205825
042059         GIVING PV-PRC-TO-P2L-PKD-AVG                             04205925
042060                 ROUNDED                                          04206025
042061         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04206125
042062             BY 1440                                              04206225
042063         GIVING PV-PRC-TO-P2L-PKD-DAY                             04206325
042064                 ROUNDED                                          04206425
042065     ELSE                                                         04206525
042066         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04206625
042067                           PV-PRC-TO-P2L-PKD-DAY                  04206725
042068     END-IF.                                                      04206825
042069                                                                  04206925
042070     IF  SU123-P2L-PKD-TO-CLOSE-MIN  >  0  AND                    04207025
042071         SU123-P2L-PKD-TO-CLOSE-CNT  >  0                         04207125
042072         DIVIDE SU123-P2L-PKD-TO-CLOSE-MIN                        04207225
042073             BY SU123-P2L-PKD-TO-CLOSE-CNT                        04207325
042074         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04207425
042075                 ROUNDED                                          04207525
042076         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04207625
042077             BY 1440                                              04207725
042078         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04207825
042079                 ROUNDED                                          04207925
042080     ELSE                                                         04208025
042081         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04208125
042082                           PV-P2L-PKD-TO-CLOSE-DAY                04208225
042083     END-IF.                                                      04208325
042084                                                                  04208425
042085     IF  SU123-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                   04208525
042086         SU123-P2L-OPEN-TO-CLOSE-CNT  >  0                        04208625
042087         DIVIDE SU123-P2L-OPEN-TO-CLOSE-MIN                       04208725
042088             BY SU123-P2L-OPEN-TO-CLOSE-CNT                       04208825
042089         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04208925
042090                 ROUNDED                                          04209025
042091         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04209125
042092             BY 1440                                              04209225
042093         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04209325
042094                 ROUNDED                                          04209425
042095     ELSE                                                         04209525
042096         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04209625
042097                           PV-P2L-OPEN-TO-CLOSE-DAY               04209725
042098     END-IF.                                                      04209825
042099                                                                  04209925
042100     IF  SU123-P2L-OPEN-TO-OTBND-MIN  >  0  AND                   04210025
042101         SU123-P2L-OPEN-TO-OTBND-CNT  >  0                        04210125
042102         DIVIDE SU123-P2L-OPEN-TO-OTBND-MIN                       04210225
042103             BY SU123-P2L-OPEN-TO-OTBND-CNT                       04210325
042104         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04210425
042105                 ROUNDED                                          04210525
042106         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04210625
042107             BY 1440                                              04210725
042108         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04210825
042109                 ROUNDED                                          04210925
042110     ELSE                                                         04211025
042111         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04211125
042112                           PV-P2L-OPEN-TO-OTBND-DAY               04211225
042113     END-IF.                                                      04211325
042114                                                                  04211425
042115     IF  SU123-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                  04211525
042116         SU123-P2L-CLOSE-TO-OTBND-CNT  >  0                       04211625
042117         DIVIDE SU123-P2L-CLOSE-TO-OTBND-MIN                      04211725
042118             BY SU123-P2L-CLOSE-TO-OTBND-CNT                      04211825
042119         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04211925
042120                 ROUNDED                                          04212025
042121         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04212125
042122             BY 1440                                              04212225
042123         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04212325
042124                 ROUNDED                                          04212425
042125     ELSE                                                         04212525
042126         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04212625
042127                           PV-P2L-CLOSE-TO-OTBND-DAY              04212725
042128     END-IF.                                                      04212825
042129                                                                  04212925
042130     IF  SU123-ARRIVE-TO-OTBND-MIN  >  0  AND                     04213025
042131         SU123-ARRIVE-TO-OTBND-CNT  >  0                          04213125
042132         DIVIDE SU123-ARRIVE-TO-OTBND-MIN                         04213225
042133             BY SU123-ARRIVE-TO-OTBND-CNT                         04213325
042134         GIVING PV-ARRIVE-TO-OTBND-AVG                            04213425
042135                 ROUNDED                                          04213525
042136         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04213625
042137             BY 1440                                              04213725
042138         GIVING PV-ARRIVE-TO-OTBND-DAY                            04213825
042139                 ROUNDED                                          04213925
042140     ELSE                                                         04214025
042141         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04214125
042142                           PV-ARRIVE-TO-OTBND-DAY                 04214225
042143     END-IF.                                                      04214325
042144                                                                  04214425
042145     IF  SU123-PRC-TO-OTBND-MIN  >  0  AND                        04214525
042146         SU123-PRC-TO-OTBND-CNT  >  0                             04214625
042147         DIVIDE SU123-PRC-TO-OTBND-MIN                            04214725
042148             BY SU123-PRC-TO-OTBND-CNT                            04214825
042149         GIVING PV-PRC-TO-OTBND-AVG                               04214925
042150                 ROUNDED                                          04215025
042151         DIVIDE PV-PRC-TO-OTBND-AVG                               04215125
042152             BY 1440                                              04215225
042153         GIVING PV-PRC-TO-OTBND-DAY                               04215325
042154                 ROUNDED                                          04215425
042155     ELSE                                                         04215525
042156         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04215625
042157                           PV-PRC-TO-OTBND-DAY                    04215725
042158     END-IF.                                                      04215825
042159                                                                  04215925
042160     IF  SU123-ARRIVE-TO-TCLOS-MIN  >  0  AND                     04216025
042161         SU123-ARRIVE-TO-TCLOS-CNT  >  0                          04216125
042162         DIVIDE SU123-ARRIVE-TO-TCLOS-MIN                         04216225
042163             BY SU123-ARRIVE-TO-TCLOS-CNT                         04216325
042164         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04216425
042165                 ROUNDED                                          04216525
042166         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04216625
042167             BY 1440                                              04216725
042168         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04216825
042169                 ROUNDED                                          04216925
042170     ELSE                                                         04217025
042171         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04217125
042172                           PV-ARRIVE-TO-TCLOS-DAY                 04217225
042173     END-IF.                                                      04217325
042174                                                                  04217425
042175     IF  SU123-ARRIVE-TO-SHIP-MIN  >  0  AND                      04217525
042176         SU123-ARRIVE-TO-SHIP-CNT  >  0                           04217625
042177         DIVIDE SU123-ARRIVE-TO-SHIP-MIN                          04217725
042178             BY SU123-ARRIVE-TO-SHIP-CNT                          04217825
042179         GIVING PV-ARRIVE-TO-SHIP-AVG                             04217925
042180                 ROUNDED                                          04218025
042181         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04218125
042182             BY 1440                                              04218225
042183         GIVING PV-ARRIVE-TO-SHIP-DAY                             04218325
042184                 ROUNDED                                          04218425
042185     ELSE                                                         04218525
042186         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04218625
042187                           PV-ARRIVE-TO-SHIP-DAY                  04218725
042188     END-IF.                                                      04218825
042189                                                                  04218925
042190     IF  SU123-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                   04219025
042191         SU123-P2L-OPEN-TO-TCLOS-CNT  >  0                        04219125
042192         DIVIDE SU123-P2L-OPEN-TO-TCLOS-MIN                       04219225
042193             BY SU123-P2L-OPEN-TO-TCLOS-CNT                       04219325
042194         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04219425
042195                 ROUNDED                                          04219525
042196         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04219625
042197             BY 1440                                              04219725
042198         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04219825
042199                 ROUNDED                                          04219925
042200     ELSE                                                         04220025
042201         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04220125
042202                           PV-P2L-OPEN-TO-TCLOS-DAY               04220225
042203     END-IF.                                                      04220325
042204                                                                  04220425
042205     IF  SU123-P2L-OPEN-TO-SHIP-MIN  >  0  AND                    04220525
042206         SU123-P2L-OPEN-TO-SHIP-CNT  >  0                         04220625
042207         DIVIDE SU123-P2L-OPEN-TO-SHIP-MIN                        04220725
042208             BY SU123-P2L-OPEN-TO-SHIP-CNT                        04220825
042209         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04220925
042210                 ROUNDED                                          04221025
042211         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04221125
042212             BY 1440                                              04221225
042213         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04221325
042214                 ROUNDED                                          04221425
042215     ELSE                                                         04221525
042216         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04221625
042217                           PV-P2L-OPEN-TO-SHIP-DAY                04221725
042218     END-IF.                                                      04221825
042219                                                                  04221925
042220     IF  SU123-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                  04222025
042221         SU123-P2L-CLOSE-TO-TCLOS-CNT  >  0                       04222125
042222         DIVIDE SU123-P2L-CLOSE-TO-TCLOS-MIN                      04222225
042223             BY SU123-P2L-CLOSE-TO-TCLOS-CNT                      04222325
042224         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04222425
042225                 ROUNDED                                          04222525
042226         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04222625
042227             BY 1440                                              04222725
042228         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04222825
042229                 ROUNDED                                          04222925
042230     ELSE                                                         04223025
042231         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04223125
042232                           PV-P2L-CLOSE-TO-TCLOS-DAY              04223225
042233     END-IF.                                                      04223325
042234                                                                  04223425
042235     IF  SU123-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                   04223525
042236         SU123-P2L-CLOSE-TO-SHIP-CNT  >  0                        04223625
042237         DIVIDE SU123-P2L-CLOSE-TO-SHIP-MIN                       04223725
042238             BY SU123-P2L-CLOSE-TO-SHIP-CNT                       04223825
042239         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04223925
042240                 ROUNDED                                          04224025
042241         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04224125
042242             BY 1440                                              04224225
042243         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04224325
042244                 ROUNDED                                          04224425
042245     ELSE                                                         04224525
042246         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04224625
042247                           PV-P2L-CLOSE-TO-SHIP-DAY               04224725
042248     END-IF.                                                      04224825
042249                                                                  04224925
042250     IF  SU123-ARRIVE-TO-MSTR-MIN  >  0  AND                      04225025
042251         SU123-ARRIVE-TO-MSTR-CNT  >  0                           04225125
042252         DIVIDE SU123-ARRIVE-TO-MSTR-MIN                          04225225
042253             BY SU123-ARRIVE-TO-MSTR-CNT                          04225325
042254         GIVING PV-ARRIVE-TO-MSTR-AVG                             04225425
042255                 ROUNDED                                          04225525
042256         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04225625
042257             BY 1440                                              04225725
042258         GIVING PV-ARRIVE-TO-MSTR-DAY                             04225825
042259                 ROUNDED                                          04225925
042260     ELSE                                                         04226025
042261         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04226125
042262                           PV-ARRIVE-TO-MSTR-DAY                  04226225
042263     END-IF.                                                      04226325
042264                                                                  04226425
042265     IF  SU123-PRC-TO-MSTR-MIN  >  0  AND                         04226525
042266         SU123-PRC-TO-MSTR-CNT  >  0                              04226625
042267         DIVIDE SU123-PRC-TO-MSTR-MIN                             04226725
042268             BY SU123-PRC-TO-MSTR-CNT                             04226825
042269         GIVING PV-PRC-TO-MSTR-AVG                                04226925
042270                 ROUNDED                                          04227025
042271         DIVIDE PV-PRC-TO-MSTR-AVG                                04227125
042272             BY 1440                                              04227225
042273         GIVING PV-PRC-TO-MSTR-DAY                                04227325
042274                 ROUNDED                                          04227425
042275     ELSE                                                         04227525
042276         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04227625
042277                           PV-PRC-TO-MSTR-DAY                     04227725
042278     END-IF.                                                      04227825
042279                                                                  04227925
042280     IF  SU123-ON-OTBND-TO-CLOS-MIN  >  0  AND                    04228025
042281         SU123-ON-OTBND-TO-CLOS-CNT  >  0                         04228125
042282         DIVIDE SU123-ON-OTBND-TO-CLOS-MIN                        04228225
042283             BY SU123-ON-OTBND-TO-CLOS-CNT                        04228325
042284         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04228425
042285                 ROUNDED                                          04228525
042286         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04228625
042287             BY 1440                                              04228725
042288         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04228825
042289                 ROUNDED                                          04228925
042290     ELSE                                                         04229025
042291         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04229125
042292                           PV-ON-OTBND-TO-CLOS-DAY                04229225
042293     END-IF.                                                      04229325
042294                                                                  04229425
042295     IF  SU123-ON-OTBND-TO-SHIP-MIN  >  0  AND                    04229525
042296         SU123-ON-OTBND-TO-SHIP-CNT  >  0                         04229625
042297         DIVIDE SU123-ON-OTBND-TO-SHIP-MIN                        04229725
042298             BY SU123-ON-OTBND-TO-SHIP-CNT                        04229825
042299         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04229925
042300                 ROUNDED                                          04230025
042301         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04230125
042302             BY 1440                                              04230225
042303         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04230325
042304                 ROUNDED                                          04230425
042305     ELSE                                                         04230525
042306         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04230625
042307                           PV-ON-OTBND-TO-SHIP-DAY                04230725
042308     END-IF.                                                      04230825
042309                                                                  04230925
042310     IF  SU123-MSTR-CRE-TO-OTBND-MIN  >  0  AND                   04231025
042311         SU123-MSTR-CRE-TO-OTBND-CNT  >  0                        04231125
042312         DIVIDE SU123-MSTR-CRE-TO-OTBND-MIN                       04231225
042313             BY SU123-MSTR-CRE-TO-OTBND-CNT                       04231325
042314         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04231425
042315                 ROUNDED                                          04231525
042316         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04231625
042317             BY 1440                                              04231725
042318         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04231825
042319                 ROUNDED                                          04231925
042320     ELSE                                                         04232025
042321         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04232125
042322                           PV-MSTR-CRE-TO-OTBND-DAY               04232225
042323     END-IF.                                                      04232325
042324                                                                  04232425
042325     IF  SU123-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                   04232525
042326         SU123-MSTR-CRE-TO-TCLOS-CNT  >  0                        04232625
042327         DIVIDE SU123-MSTR-CRE-TO-TCLOS-MIN                       04232725
042328             BY SU123-MSTR-CRE-TO-TCLOS-CNT                       04232825
042329         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04232925
042330                 ROUNDED                                          04233025
042331         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04233125
042332             BY 1440                                              04233225
042333         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04233325
042334                 ROUNDED                                          04233425
042335     ELSE                                                         04233525
042336         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04233625
042337                           PV-MSTR-CRE-TO-TCLOS-DAY               04233725
042338     END-IF.                                                      04233825
042339                                                                  04233925
042340     IF  SU123-MSTR-CRE-TO-SHIP-MIN  >  0  AND                    04234025
042341         SU123-MSTR-CRE-TO-SHIP-CNT  >  0                         04234125
042342         DIVIDE SU123-MSTR-CRE-TO-SHIP-MIN                        04234225
042343             BY SU123-MSTR-CRE-TO-SHIP-CNT                        04234325
042344         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04234425
042345                 ROUNDED                                          04234525
042346         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04234625
042347             BY 1440                                              04234725
042348         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04234825
042349                 ROUNDED                                          04234925
042350     ELSE                                                         04235025
042351         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04235125
042352                           PV-MSTR-CRE-TO-SHIP-DAY                04235225
042353     END-IF.                                                      04235325
042354                                                                  04235425
042355     IF  SU123-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                 04235525
042356         SU123-MSTR-FIRST-TO-OTBND-CNT  >  0                      04235625
042357         DIVIDE SU123-MSTR-FIRST-TO-OTBND-MIN                     04235725
042358             BY SU123-MSTR-FIRST-TO-OTBND-CNT                     04235825
042359         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04235925
042360                 ROUNDED                                          04236025
042361         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04236125
042362             BY 1440                                              04236225
042363         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04236325
042364                 ROUNDED                                          04236425
042365     ELSE                                                         04236525
042366         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04236625
042367                           PV-MSTR-FIRST-TO-OTBND-DAY             04236725
042368     END-IF.                                                      04236825
042369                                                                  04236925
042370     IF  SU123-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                 04237025
042371         SU123-MSTR-FIRST-TO-TCLOS-CNT  >  0                      04237125
042372         DIVIDE SU123-MSTR-FIRST-TO-TCLOS-MIN                     04237225
042373             BY SU123-MSTR-FIRST-TO-TCLOS-CNT                     04237325
042374         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04237425
042375                 ROUNDED                                          04237525
042376         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04237625
042377             BY 1440                                              04237725
042378         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04237825
042379                 ROUNDED                                          04237925
042380     ELSE                                                         04238025
042381         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04238125
042382                           PV-MSTR-FIRST-TO-TCLOS-DAY             04238225
042383     END-IF.                                                      04238325
042384                                                                  04238425
042385     IF  SU123-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                  04238525
042386         SU123-MSTR-FIRST-TO-SHIP-CNT  >  0                       04238625
042387         DIVIDE SU123-MSTR-FIRST-TO-SHIP-MIN                      04238725
042388             BY SU123-MSTR-FIRST-TO-SHIP-CNT                      04238825
042389         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04238925
042390                 ROUNDED                                          04239025
042391         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04239125
042392             BY 1440                                              04239225
042393         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04239325
042394                 ROUNDED                                          04239425
042395     ELSE                                                         04239525
042396         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04239625
042397                           PV-MSTR-FIRST-TO-SHIP-DAY              04239725
042398     END-IF.                                                      04239825
042399                                                                  04239925
042400     IF  SU123-MSTR-LAST-TO-OTBND-MIN  >  0  AND                  04240025
042401         SU123-MSTR-LAST-TO-OTBND-CNT  >  0                       04240125
042402         DIVIDE SU123-MSTR-LAST-TO-OTBND-MIN                      04240225
042403             BY SU123-MSTR-LAST-TO-OTBND-CNT                      04240325
042404         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04240425
042405                 ROUNDED                                          04240525
042406         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04240625
042407             BY 1440                                              04240725
042408         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04240825
042409                 ROUNDED                                          04240925
042410     ELSE                                                         04241025
042411         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04241125
042412                           PV-MSTR-LAST-TO-OTBND-DAY              04241225
042413     END-IF.                                                      04241325
042414                                                                  04241425
042415     IF  SU123-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                  04241525
042416         SU123-MSTR-LAST-TO-TCLOS-CNT  >  0                       04241625
042417         DIVIDE SU123-MSTR-LAST-TO-TCLOS-MIN                      04241725
042418             BY SU123-MSTR-LAST-TO-TCLOS-CNT                      04241825
042419         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04241925
042420                 ROUNDED                                          04242025
042421         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04242125
042422             BY 1440                                              04242225
042423         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04242325
042424                 ROUNDED                                          04242425
042425     ELSE                                                         04242525
042426         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04242625
042427                           PV-MSTR-LAST-TO-TCLOS-DAY              04242725
042428     END-IF.                                                      04242825
042429                                                                  04242925
042430     IF  SU123-MSTR-LAST-TO-SHIP-MIN  >  0  AND                   04243025
042431         SU123-MSTR-LAST-TO-SHIP-CNT  >  0                        04243125
042432         DIVIDE SU123-MSTR-LAST-TO-SHIP-MIN                       04243225
042433             BY SU123-MSTR-LAST-TO-SHIP-CNT                       04243325
042434         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04243425
042435                 ROUNDED                                          04243525
042436         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04243625
042437             BY 1440                                              04243725
042438         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04243825
042439                 ROUNDED                                          04243925
042440     ELSE                                                         04244025
042441         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04244125
042442                           PV-MSTR-LAST-TO-SHIP-DAY               04244225
042443     END-IF.                                                      04244325
042444                                                                  04244425
042445                                                                  04244525
042446****************************************************************  04244688
042447* CALCULATE THE % OF THE CARTONS ON THE TRAILER ARE FOR THE    *  04244788
042448* CARTON SOURCE                                                *  04244888
042449* DMH ADDED 8/19/16                                            *  04244988
042450****************************************************************  04245088
042451 3005-CALC-SRC-CRTN-PCNT.                                         04245188
042452                                                                  04245288
042453     MOVE  ZEROES        TO  PV-TRIP-SRC-CRTN                     04245388
042454                             PV-TRIP-SRC-CRTN-PCNT.               04245488
042456                                                                  04245688
042467                                                                  04246799
042468     IF  SU123-TRIP-CARTONS            >  0  AND                  04246899
042469         SU123-TRIP-SRC-CARTONS        >  0                       04246999
042470         DIVIDE  SU123-TRIP-SRC-CARTONS                           04247099
042471             BY  SU123-TRIP-CARTONS                               04247199
042472         GIVING  PV-TRIP-SRC-CRTN                                 04247299
042473                   ROUNDED                                        04247399
042474         MULTIPLY  PV-TRIP-SRC-CRTN                               04247499
042475               BY  100                                            04247599
042476           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04247699
042477     ELSE                                                         04247799
042478         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04247899
042479                           PV-TRIP-SRC-CRTN                       04247999
042480     END-IF.                                                      04248099
042481                                                                  04248199
042482     MOVE SU123-TRIP-CARTONS     TO PV-TRIP-CARTONS.              04248299
042483     ADD  SU123-TRIP-SRC-CARTONS TO PV-TRIP-SRC-CARTONS.          04248399
042484                                                                  04248499
042485                                                                  04248599
042486****************************************************************  04248699
042487* ACCUMULATE TRAILER TOTALS                                    *  04248799
042488****************************************************************  04248899
042489 3010-ACCUM-TRLR-TOTALS.                                          04248999
042490                                                                  04249099
042491     MOVE SU123-TRIP-OPEN-TO-CLOSE-MIN                            04249199
042492       TO PV-TRIP-OPEN-TO-CLOSE-MIN-TOT.                          04249299
042493                                                                  04249399
042494     MOVE SU123-TRIP-CLOSE-TO-SHIP-MIN                            04249499
042495       TO PV-TRIP-CLOSE-TO-SHIP-MIN-TOT.                          04249599
042496                                                                  04249699
042497     MOVE SU123-TRIP-OPEN-TO-SHIP-MIN                             04249799
042498       TO PV-TRIP-OPEN-TO-SHIP-MIN-TOT.                           04249899
042499                                                                  04249999
042500     MOVE SU123-INPUT-RECORD-COUNT                                04250099
042501       TO PV-TRIP-INPUT-RECORD-TOTAL.                             04250199
042502                                                                  04250299
042503     ADD SU123-ARRIVE-TO-PRC-MIN                                  04250399
042504      TO PV-TRIP-ARRIVE-TO-PRC-MIN-TOT.                           04250499
042505     ADD SU123-ARRIVE-TO-PRC-CNT                                  04250599
042506      TO PV-TRIP-ARRIVE-TO-PRC-CNT-TOT.                           04250699
042507                                                                  04250799
042508     ADD SU123-ARRIVE-TO-P2L-PKD-MIN                              04250899
042509      TO PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT.                          04250999
042510     ADD SU123-ARRIVE-TO-P2L-PKD-CNT                              04251099
042511      TO PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT.                          04251199
042512                                                                  04251299
042513     ADD SU123-PRC-TO-P2L-PKD-MIN                                 04251399
042514      TO PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT.                          04251499
042515     ADD SU123-PRC-TO-P2L-PKD-CNT                                 04251599
042516      TO PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT.                          04251699
042517                                                                  04251799
042518     ADD SU123-P2L-PKD-TO-CLOSE-MIN                               04251899
042519      TO PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT.                          04251999
042520     ADD SU123-P2L-PKD-TO-CLOSE-CNT                               04252099
042521      TO PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT.                          04252199
042522                                                                  04252299
042523     ADD SU123-P2L-OPEN-TO-CLOSE-MIN                              04252399
042524      TO PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT.                          04252499
042525     ADD SU123-P2L-OPEN-TO-CLOSE-CNT                              04252599
042526      TO PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT.                          04252699
042527                                                                  04252799
042528     ADD SU123-P2L-OPEN-TO-OTBND-MIN                              04252899
042529      TO PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT.                          04252999
042530     ADD SU123-P2L-OPEN-TO-OTBND-CNT                              04253099
042531      TO PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT.                          04253199
042532                                                                  04253299
042533                                                                  04253399
042534     ADD SU123-P2L-CLOSE-TO-OTBND-MIN                             04253499
042535      TO PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT.                          04253599
042536     ADD SU123-P2L-CLOSE-TO-OTBND-CNT                             04253699
042537      TO PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT.                          04253799
042538                                                                  04253899
042539     ADD SU123-ARRIVE-TO-OTBND-MIN                                04253999
042540      TO PV-TRIP-ARRIV-TO-OTBND-MIN-TOT.                          04254099
042541     ADD SU123-ARRIVE-TO-OTBND-CNT                                04254199
042542      TO PV-TRIP-ARRIV-TO-OTBND-CNT-TOT.                          04254299
042543                                                                  04254399
042544     ADD SU123-PRC-TO-OTBND-MIN                                   04254499
042545      TO PV-TRIP-PRC-TO-OTBND-MIN-TOT.                            04254599
042546     ADD SU123-PRC-TO-OTBND-CNT                                   04254699
042547      TO PV-TRIP-PRC-TO-OTBND-CNT-TOT.                            04254799
042548                                                                  04254899
042549     ADD SU123-ARRIVE-TO-TCLOS-MIN                                04254999
042550      TO PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT.                          04255099
042551     ADD SU123-ARRIVE-TO-TCLOS-CNT                                04255199
042552      TO PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT.                          04255299
042553                                                                  04255399
042554     ADD SU123-ARRIVE-TO-SHIP-MIN                                 04255499
042555      TO PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT.                          04255599
042556     ADD SU123-ARRIVE-TO-SHIP-CNT                                 04255699
042557      TO PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT.                          04255799
042558                                                                  04255899
042559     ADD SU123-P2L-OPEN-TO-TCLOS-MIN                              04255999
042560      TO PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT.                          04256099
042561     ADD SU123-P2L-OPEN-TO-TCLOS-CNT                              04256199
042562      TO PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT.                          04256299
042563                                                                  04256399
042564     ADD SU123-P2L-OPEN-TO-SHIP-MIN                               04256499
042565      TO PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT.                          04256599
042566     ADD SU123-P2L-OPEN-TO-SHIP-CNT                               04256699
042567      TO PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT.                          04256799
042568                                                                  04256899
042569     ADD SU123-P2L-CLOSE-TO-TCLOS-MIN                             04256999
042570      TO PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT.                          04257099
042571     ADD SU123-P2L-CLOSE-TO-TCLOS-CNT                             04257199
042572      TO PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT.                          04257299
042573                                                                  04257399
042574     ADD SU123-P2L-CLOSE-TO-SHIP-MIN                              04257499
042575      TO PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT.                          04257599
042576     ADD SU123-P2L-CLOSE-TO-SHIP-CNT                              04257699
042577      TO PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT.                          04257799
042578                                                                  04257899
042579     ADD SU123-ARRIVE-TO-MSTR-MIN                                 04257999
042580      TO PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT.                          04258099
042581     ADD SU123-ARRIVE-TO-MSTR-CNT                                 04258199
042582      TO PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT.                          04258299
042583                                                                  04258399
042584     ADD SU123-PRC-TO-MSTR-MIN                                    04258499
042585      TO PV-TRIP-PRC-TO-MSTR-MIN-TOT.                             04258599
042586     ADD SU123-PRC-TO-MSTR-CNT                                    04258699
042587      TO PV-TRIP-PRC-TO-MSTR-CNT-TOT.                             04258799
042588                                                                  04258899
042589     ADD SU123-ON-OTBND-TO-CLOS-MIN                               04258999
042590      TO PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT.                          04259099
042591     ADD SU123-ON-OTBND-TO-CLOS-CNT                               04259199
042592      TO PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT.                          04259299
042593                                                                  04259399
042594     ADD SU123-ON-OTBND-TO-SHIP-MIN                               04259499
042595      TO PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT.                          04259599
042596     ADD SU123-ON-OTBND-TO-SHIP-CNT                               04259699
042597      TO PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT.                          04259799
042600                                                                  04260099
043652                                                                  04365274
043653****************************************************************  04365374
043654* CALCULATE THE AVERAGES                                       *  04365474
043655****************************************************************  04365574
043656 3020-CALC-TRIP-AVERAGES.                                         04365674
043657                                                                  04365774
043658     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04365874
043659                             PV-TRIP-CLOSE-TO-SHIP-AVG            04365974
043660                             PV-TRIP-OPEN-TO-SHIP-AVG             04366074
043661                             PV-ARRIVE-TO-PRC-AVG                 04366174
043662                             PV-ARRIVE-TO-P2L-PKD-AVG             04366274
043663                             PV-PRC-TO-P2L-PKD-AVG                04366374
043664                             PV-P2L-PKD-TO-CLOSE-AVG              04366474
043665                             PV-P2L-OPEN-TO-CLOSE-AVG             04366574
043666                             PV-P2L-OPEN-TO-OTBND-AVG             04366674
043667                             PV-P2L-CLOSE-TO-OTBND-AVG            04366774
043668                             PV-ARRIVE-TO-OTBND-AVG               04366874
043669                             PV-PRC-TO-OTBND-AVG                  04366974
043670                             PV-ARRIVE-TO-TCLOS-AVG               04367074
043671                             PV-ARRIVE-TO-SHIP-AVG                04367174
043672                             PV-P2L-OPEN-TO-TCLOS-AVG             04367274
043673                             PV-P2L-OPEN-TO-SHIP-AVG              04367374
043674                             PV-P2L-CLOSE-TO-TCLOS-AVG            04367474
043675                             PV-P2L-CLOSE-TO-SHIP-AVG             04367574
043676                             PV-ARRIVE-TO-MSTR-AVG                04367674
043677                             PV-PRC-TO-MSTR-AVG                   04367774
043678                             PV-MSTR-CRE-TO-OTBND-AVG             04367874
043679                             PV-MSTR-CRE-TO-TCLOS-AVG             04367974
043680                             PV-MSTR-CRE-TO-SHIP-AVG              04368074
043681                             PV-MSTR-FIRST-TO-OTBND-AVG           04368174
043682                             PV-MSTR-FIRST-TO-TCLOS-AVG           04368274
043683                             PV-MSTR-FIRST-TO-SHIP-AVG            04368374
043684                             PV-MSTR-LAST-TO-OTBND-AVG            04368474
043685                             PV-MSTR-LAST-TO-TCLOS-AVG            04368574
043686                             PV-MSTR-LAST-TO-SHIP-AVG             04368674
043687                             PV-ON-OTBND-TO-CLOS-AVG              04368774
043688                             PV-ON-OTBND-TO-SHIP-AVG              04368874
043689                             PV-TRIP-OPEN-TO-CLOSE-DAY            04368974
043690                             PV-TRIP-CLOSE-TO-SHIP-DAY            04369074
043691                             PV-TRIP-OPEN-TO-SHIP-DAY             04369174
043692                             PV-ARRIVE-TO-PRC-DAY                 04369274
043693                             PV-ARRIVE-TO-P2L-PKD-DAY             04369374
043694                             PV-PRC-TO-P2L-PKD-DAY                04369474
043695                             PV-P2L-PKD-TO-CLOSE-DAY              04369574
043696                             PV-P2L-OPEN-TO-CLOSE-DAY             04369674
043697                             PV-P2L-OPEN-TO-OTBND-DAY             04369774
043698                             PV-P2L-CLOSE-TO-OTBND-DAY            04369874
043699                             PV-ARRIVE-TO-OTBND-DAY               04369974
043700                             PV-PRC-TO-OTBND-DAY                  04370074
043701                             PV-ARRIVE-TO-TCLOS-DAY               04370174
043702                             PV-ARRIVE-TO-SHIP-DAY                04370274
043703                             PV-P2L-OPEN-TO-TCLOS-DAY             04370374
043704                             PV-P2L-OPEN-TO-SHIP-DAY              04370474
043705                             PV-P2L-CLOSE-TO-TCLOS-DAY            04370574
043706                             PV-P2L-CLOSE-TO-SHIP-DAY             04370674
043707                             PV-ARRIVE-TO-MSTR-DAY                04370774
043708                             PV-PRC-TO-MSTR-DAY                   04370874
043709                             PV-MSTR-CRE-TO-OTBND-DAY             04370974
043710                             PV-MSTR-CRE-TO-TCLOS-DAY             04371074
043711                             PV-MSTR-CRE-TO-SHIP-DAY              04371174
043712                             PV-MSTR-FIRST-TO-OTBND-DAY           04371274
043713                             PV-MSTR-FIRST-TO-TCLOS-DAY           04371374
043714                             PV-MSTR-FIRST-TO-SHIP-DAY            04371474
043715                             PV-MSTR-LAST-TO-OTBND-DAY            04371574
043716                             PV-MSTR-LAST-TO-TCLOS-DAY            04371674
043717                             PV-MSTR-LAST-TO-SHIP-DAY             04371774
043718                             PV-ON-OTBND-TO-CLOS-DAY              04371874
043719                             PV-ON-OTBND-TO-SHIP-DAY.             04371974
043720                                                                  04372074
043721                                                                  04372174
043722     IF  PV-TRIP-OPEN-TO-CLOSE-MIN-TOT   >  0                     04372274
043723         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-MIN-TOT                    04372374
043724             BY  1440                                             04372474
043725         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04372574
043726                 ROUNDED                                          04372674
043727     ELSE                                                         04372774
043728         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04372874
043729                           PV-TRIP-OPEN-TO-CLOSE-DAY              04372974
043730     END-IF.                                                      04373074
043731                                                                  04373174
043732     IF  PV-TRIP-CLOSE-TO-SHIP-MIN-TOT   >  0                     04373274
043733         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-MIN-TOT                    04373374
043734             BY  1440                                             04373474
043735         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04373574
043736                 ROUNDED                                          04373674
043737     ELSE                                                         04373774
043738         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04373874
043739                           PV-TRIP-CLOSE-TO-SHIP-DAY              04373974
043740     END-IF.                                                      04374074
043741                                                                  04374174
043742     IF  PV-TRIP-OPEN-TO-SHIP-MIN-TOT   >  0                      04374274
043743         DIVIDE  PV-TRIP-OPEN-TO-SHIP-MIN-TOT                     04374374
043744             BY  1440                                             04374474
043745         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04374574
043746                 ROUNDED                                          04374674
043747     ELSE                                                         04374774
043748         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04374874
043749                           PV-TRIP-OPEN-TO-SHIP-DAY               04374974
043750     END-IF.                                                      04375074
043751                                                                  04375174
043752     IF  PV-TRIP-ARRIVE-TO-PRC-MIN-TOT  >  0  AND                 04375274
043753         PV-TRIP-ARRIVE-TO-PRC-CNT-TOT  >  0                      04375374
043754         DIVIDE PV-TRIP-ARRIVE-TO-PRC-MIN-TOT                     04375474
043755             BY PV-TRIP-ARRIVE-TO-PRC-CNT-TOT                     04375574
043756         GIVING PV-ARRIVE-TO-PRC-AVG                              04375674
043757                 ROUNDED                                          04375774
043758         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04375874
043759             BY 1440                                              04375974
043760         GIVING PV-ARRIVE-TO-PRC-DAY                              04376074
043761                 ROUNDED                                          04376174
043762     ELSE                                                         04376274
043763         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04376374
043764                           PV-ARRIVE-TO-PRC-DAY                   04376474
043765     END-IF.                                                      04376574
043766                                                                  04376674
043767     IF  PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT   >  0  AND               04376774
043768         PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT   >  0                    04376874
043769         DIVIDE PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT                    04376974
043770             BY PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT                    04377074
043771         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04377174
043772                 ROUNDED                                          04377274
043773         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04377374
043774             BY 1440                                              04377474
043775         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04377574
043776                 ROUNDED                                          04377674
043777     ELSE                                                         04377774
043778         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04377874
043779                           PV-ARRIVE-TO-P2L-PKD-DAY               04377974
043780     END-IF.                                                      04378074
043781                                                                  04378174
043782     IF  PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT >  0  AND                 04378274
043783         PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT >  0                      04378374
043784         DIVIDE PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT                    04378474
043785             BY PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT                    04378574
043786         GIVING PV-PRC-TO-P2L-PKD-AVG                             04378674
043787                 ROUNDED                                          04378774
043788         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04378874
043789             BY 1440                                              04378974
043790         GIVING PV-PRC-TO-P2L-PKD-DAY                             04379074
043791                 ROUNDED                                          04379174
043792     ELSE                                                         04379274
043793         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04379374
043794                           PV-PRC-TO-P2L-PKD-DAY                  04379474
043795     END-IF.                                                      04379574
043796                                                                  04379674
043797     IF  PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT    >  0  AND              04379774
043798         PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT    >  0                   04379874
043799         DIVIDE PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT                    04379974
043800             BY PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT                    04380074
043801         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04380174
043802                 ROUNDED                                          04380274
043803         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04380374
043804             BY 1440                                              04380474
043805         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04380574
043806                 ROUNDED                                          04380674
043807     ELSE                                                         04380774
043808         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04380874
043809                           PV-P2L-PKD-TO-CLOSE-DAY                04380974
043810     END-IF.                                                      04381074
043811                                                                  04381174
043812     IF  PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT    >  0  AND              04381274
043813         PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT    >  0                   04381374
043814         DIVIDE PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT                    04381474
043815             BY PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT                    04381574
043816         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04381674
043817                 ROUNDED                                          04381774
043818         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04381874
043819             BY 1440                                              04381974
043820         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04382074
043821                 ROUNDED                                          04382174
043822     ELSE                                                         04382274
043823         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04382374
043824                           PV-P2L-OPEN-TO-CLOSE-DAY               04382474
043825     END-IF.                                                      04382574
043826                                                                  04382674
043827     IF  PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT    >  0  AND              04382774
043828         PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT    >  0                   04382874
043829         DIVIDE PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT                    04382974
043830             BY PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT                    04383074
043831         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04383174
043832                 ROUNDED                                          04383274
043833         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04383374
043834             BY 1440                                              04383474
043835         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04383574
043836                 ROUNDED                                          04383674
043837     ELSE                                                         04383774
043838         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04383874
043839                           PV-P2L-OPEN-TO-OTBND-DAY               04383974
043840     END-IF.                                                      04384074
043841                                                                  04384174
043842     IF  PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT >  0  AND                 04384274
043843         PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT     >  0                  04384374
043844         DIVIDE PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT                    04384474
043845             BY PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT                    04384574
043846         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04384674
043847                 ROUNDED                                          04384774
043848         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04384874
043849             BY 1440                                              04384974
043850         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04385074
043851                 ROUNDED                                          04385174
043852     ELSE                                                         04385274
043853         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04385374
043854                           PV-P2L-CLOSE-TO-OTBND-DAY              04385474
043855     END-IF.                                                      04385574
043856                                                                  04385674
043857     IF  PV-TRIP-ARRIV-TO-OTBND-MIN-TOT  >  0  AND                04385774
043858         PV-TRIP-ARRIV-TO-OTBND-CNT-TOT   >  0                    04385874
043859         DIVIDE PV-TRIP-ARRIV-TO-OTBND-MIN-TOT                    04385974
043860             BY PV-TRIP-ARRIV-TO-OTBND-CNT-TOT                    04386074
043861         GIVING PV-ARRIVE-TO-OTBND-AVG                            04386174
043862                 ROUNDED                                          04386274
043863         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04386374
043864             BY 1440                                              04386474
043865         GIVING PV-ARRIVE-TO-OTBND-DAY                            04386574
043866                 ROUNDED                                          04386674
043867     ELSE                                                         04386774
043868         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04386874
043869                           PV-ARRIVE-TO-OTBND-DAY                 04386974
043870     END-IF.                                                      04387074
043871                                                                  04387174
043872     IF  PV-TRIP-PRC-TO-OTBND-MIN-TOT >  0  AND                   04387274
043873         PV-TRIP-PRC-TO-OTBND-CNT-TOT >  0                        04387374
043874         DIVIDE PV-TRIP-PRC-TO-OTBND-MIN-TOT                      04387474
043875             BY PV-TRIP-PRC-TO-OTBND-CNT-TOT                      04387574
043876         GIVING PV-PRC-TO-OTBND-AVG                               04387674
043877                 ROUNDED                                          04387774
043878         DIVIDE PV-PRC-TO-OTBND-AVG                               04387874
043879             BY 1440                                              04387974
043880         GIVING PV-PRC-TO-OTBND-DAY                               04388074
043881                 ROUNDED                                          04388174
043882     ELSE                                                         04388274
043883         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04388374
043884                           PV-PRC-TO-OTBND-DAY                    04388474
043885     END-IF.                                                      04388574
043886                                                                  04388674
043887     IF  PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT >  0  AND                 04388774
043888         PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT >  0                      04388874
043889         DIVIDE PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT                    04388974
043890             BY PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT                    04389074
043891         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04389174
043892                 ROUNDED                                          04389274
043893         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04389374
043894             BY 1440                                              04389474
043895         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04389574
043896                 ROUNDED                                          04389674
043897     ELSE                                                         04389774
043898         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04389874
043899                           PV-ARRIVE-TO-TCLOS-DAY                 04389974
043900     END-IF.                                                      04390074
043901                                                                  04390174
043902     IF  PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT >  0  AND                 04390274
043903         PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT >  0                      04390374
043904         DIVIDE PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT                    04390474
043905             BY PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT                    04390574
043906         GIVING PV-ARRIVE-TO-SHIP-AVG                             04390674
043907                 ROUNDED                                          04390774
043908         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04390874
043909             BY 1440                                              04390974
043910         GIVING PV-ARRIVE-TO-SHIP-DAY                             04391074
043911                 ROUNDED                                          04391174
043912     ELSE                                                         04391274
043913         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04391374
043914                           PV-ARRIVE-TO-SHIP-DAY                  04391474
043915     END-IF.                                                      04391574
043916                                                                  04391674
043917     IF  PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT    >  0  AND              04391774
043918         PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT    >  0                   04391874
043919         DIVIDE PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT                    04391974
043920             BY PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT                    04392074
043921         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04392174
043922                 ROUNDED                                          04392274
043923         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04392374
043924             BY 1440                                              04392474
043925         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04392574
043926                 ROUNDED                                          04392674
043927     ELSE                                                         04392774
043928         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04392874
043929                           PV-P2L-OPEN-TO-TCLOS-DAY               04392974
043930     END-IF.                                                      04393074
043931                                                                  04393174
043932     IF  PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT >  0  AND                 04393274
043933         PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT >  0                      04393374
043934         DIVIDE PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT                    04393474
043935             BY PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT                    04393574
043936         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04393674
043937                 ROUNDED                                          04393774
043938         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04393874
043939             BY 1440                                              04393974
043940         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04394074
043941                 ROUNDED                                          04394174
043942     ELSE                                                         04394274
043943         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04394374
043944                           PV-P2L-OPEN-TO-SHIP-DAY                04394474
043945     END-IF.                                                      04394574
043946                                                                  04394674
043947     IF  PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT >  0  AND                 04394774
043948         PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT >  0                      04394874
043949         DIVIDE PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT                    04394974
043950             BY PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT                    04395074
043951         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04395174
043952                 ROUNDED                                          04395274
043953         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04395374
043954             BY 1440                                              04395474
043955         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04395574
043956                 ROUNDED                                          04395674
043957     ELSE                                                         04395774
043958         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04395874
043959                           PV-P2L-CLOSE-TO-TCLOS-DAY              04395974
043960     END-IF.                                                      04396074
043961                                                                  04396174
043962     IF  PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT >  0  AND                 04396274
043963         PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT >  0                      04396374
043964         DIVIDE PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT                    04396474
043965             BY PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT                    04396574
043966         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04396674
043967                 ROUNDED                                          04396774
043968         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04396874
043969             BY 1440                                              04396974
043970         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04397074
043971                 ROUNDED                                          04397174
043972     ELSE                                                         04397274
043973         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04397374
043974                           PV-P2L-CLOSE-TO-SHIP-DAY               04397474
043975     END-IF.                                                      04397574
043976                                                                  04397674
043977     IF  PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT >  0  AND                 04397774
043978         PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT >  0                      04397874
043979         DIVIDE PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT                    04397974
043980             BY PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT                    04398074
043981         GIVING PV-ARRIVE-TO-MSTR-AVG                             04398174
043982                 ROUNDED                                          04398274
043983         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04398374
043984             BY 1440                                              04398474
043985         GIVING PV-ARRIVE-TO-MSTR-DAY                             04398574
043986                 ROUNDED                                          04398674
043987     ELSE                                                         04398774
043988         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04398874
043989                           PV-ARRIVE-TO-MSTR-DAY                  04398974
043990     END-IF.                                                      04399074
043991                                                                  04399174
043992     IF  PV-TRIP-PRC-TO-MSTR-MIN-TOT  > 0  AND                    04399274
043993         PV-TRIP-PRC-TO-MSTR-CNT-TOT  > 0                         04399374
043994         DIVIDE PV-TRIP-PRC-TO-MSTR-MIN-TOT                       04399474
043995             BY PV-TRIP-PRC-TO-MSTR-CNT-TOT                       04399574
043996         GIVING PV-PRC-TO-MSTR-AVG                                04399674
043997                 ROUNDED                                          04399774
043998         DIVIDE PV-PRC-TO-MSTR-AVG                                04399874
043999             BY 1440                                              04399974
044000         GIVING PV-PRC-TO-MSTR-DAY                                04400074
044001                 ROUNDED                                          04400174
044002     ELSE                                                         04400274
044003         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04400374
044004                           PV-PRC-TO-MSTR-DAY                     04400474
044005     END-IF.                                                      04400574
044006                                                                  04400674
044007     IF  PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT >  0  AND                 04400774
044008         PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT >  0                      04400874
044009         DIVIDE PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT                    04400974
044010             BY PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT                    04401074
044011         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04401174
044012                 ROUNDED                                          04401274
044013         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04401374
044014             BY 1440                                              04401474
044015         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04401574
044016                 ROUNDED                                          04401674
044017     ELSE                                                         04401774
044018         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04401874
044019                           PV-ON-OTBND-TO-CLOS-DAY                04401974
044020     END-IF.                                                      04402074
044021                                                                  04402174
044022     IF  PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT  >  0  AND                04402274
044023         PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT  >  0                     04402374
044024         DIVIDE PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT                    04402474
044025             BY PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT                    04402574
044026         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04402674
044027                 ROUNDED                                          04402774
044028         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04402874
044029             BY 1440                                              04402974
044030         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04403074
044031                 ROUNDED                                          04403174
044032     ELSE                                                         04403274
044033         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04403374
044034                           PV-ON-OTBND-TO-SHIP-DAY                04403474
044035     END-IF.                                                      04403574
044036                                                                  04403674
044037     IF  PV-TRIP-MST-CRE-TO-OTB-MIN-TOT >  0  AND                 04403774
044038         PV-TRIP-MST-CRE-TO-OTB-CNT-TOT    >  0                   04403874
044039         DIVIDE PV-TRIP-MST-CRE-TO-OTB-MIN-TOT                    04403974
044040             BY PV-TRIP-MST-CRE-TO-OTB-CNT-TOT                    04404074
044041         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04404174
044042                 ROUNDED                                          04404274
044043         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04404374
044044             BY 1440                                              04404474
044045         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04404574
044046                 ROUNDED                                          04404674
044047     ELSE                                                         04404774
044048         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04404874
044049                           PV-MSTR-CRE-TO-OTBND-DAY               04404974
044050     END-IF.                                                      04405074
044051                                                                  04405174
044052     IF  PV-TRIP-MST-CRE-TO-TCL-MIN-TOT  >  0  AND                04405274
044053         PV-TRIP-MST-CRE-TO-TCL-CNT-TOT  >  0                     04405374
044054         DIVIDE PV-TRIP-MST-CRE-TO-TCL-MIN-TOT                    04405474
044055             BY PV-TRIP-MST-CRE-TO-TCL-CNT-TOT                    04405574
044056         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04405674
044057                 ROUNDED                                          04405774
044058         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04405874
044059             BY 1440                                              04405974
044060         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04406074
044061                 ROUNDED                                          04406174
044062     ELSE                                                         04406274
044063         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04406374
044064                           PV-MSTR-CRE-TO-TCLOS-DAY               04406474
044065     END-IF.                                                      04406574
044066                                                                  04406674
044067     IF  PV-TRIP-MST-CRE-TO-SHP-MIN-TOT  >  0  AND                04406774
044068         PV-TRIP-MST-CRE-TO-SHP-CNT-TOT  >  0                     04406874
044069         DIVIDE PV-TRIP-MST-CRE-TO-SHP-MIN-TOT                    04406974
044070             BY PV-TRIP-MST-CRE-TO-SHP-CNT-TOT                    04407074
044071         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04407174
044072                 ROUNDED                                          04407274
044073         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04407374
044074             BY 1440                                              04407474
044075         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04407574
044076                 ROUNDED                                          04407674
044077     ELSE                                                         04407774
044078         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04407874
044079                           PV-MSTR-CRE-TO-SHIP-DAY                04407974
044080     END-IF.                                                      04408074
044081                                                                  04408174
044082     IF  PV-TRIP-MST-1ST-TO-OTB-MIN-TOT >     0  AND              04408274
044083         PV-TRIP-MST-1ST-TO-OTB-CNT-TOT >     0                   04408374
044084         DIVIDE PV-TRIP-MST-1ST-TO-OTB-MIN-TOT                    04408474
044085             BY PV-TRIP-MST-1ST-TO-OTB-CNT-TOT                    04408574
044086         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04408674
044087                 ROUNDED                                          04408774
044088         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04408874
044089             BY 1440                                              04408974
044090         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04409074
044091                 ROUNDED                                          04409174
044092     ELSE                                                         04409274
044093         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04409374
044094                           PV-MSTR-FIRST-TO-OTBND-DAY             04409474
044095     END-IF.                                                      04409574
044096                                                                  04409674
044097     IF  PV-TRIP-MST-1ST-TO-TCL-MIN-TOT  >     0  AND             04409774
044098         PV-TRIP-MST-1ST-TO-TCL-CNT-TOT >     0                   04409874
044099         DIVIDE PV-TRIP-MST-1ST-TO-TCL-MIN-TOT                    04409974
044100             BY PV-TRIP-MST-1ST-TO-TCL-CNT-TOT                    04410074
044101         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04410174
044102                 ROUNDED                                          04410274
044103         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04410374
044104             BY 1440                                              04410474
044105         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04410574
044106                 ROUNDED                                          04410674
044107     ELSE                                                         04410774
044108         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04410874
044109                           PV-MSTR-FIRST-TO-TCLOS-DAY             04410974
044110     END-IF.                                                      04411074
044111                                                                  04411174
044112     IF  PV-TRIP-MST-1ST-TO-SHP-MIN-TOT  >     0  AND             04411274
044113         PV-TRIP-MST-1ST-TO-SHP-CNT-TOT  >     0                  04411374
044114         DIVIDE PV-TRIP-MST-1ST-TO-SHP-MIN-TOT                    04411474
044115             BY PV-TRIP-MST-1ST-TO-SHP-CNT-TOT                    04411574
044116         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04411674
044117                 ROUNDED                                          04411774
044118         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04411874
044119             BY 1440                                              04411974
044120         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04412074
044121                 ROUNDED                                          04412174
044122     ELSE                                                         04412274
044123         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04412374
044124                           PV-MSTR-FIRST-TO-SHIP-DAY              04412474
044125     END-IF.                                                      04412574
044126                                                                  04412674
044127     IF  PV-TRIP-MST-LST-TO-OTB-MIN-TOT  >    0  AND              04412774
044128         PV-TRIP-MST-LST-TO-OTB-CNT-TOT  >    0                   04412874
044129         DIVIDE PV-TRIP-MST-LST-TO-OTB-MIN-TOT                    04412974
044130             BY PV-TRIP-MST-LST-TO-OTB-CNT-TOT                    04413074
044131         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04413174
044132                 ROUNDED                                          04413274
044133         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04413374
044134             BY 1440                                              04413474
044135         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04413574
044136                 ROUNDED                                          04413674
044137     ELSE                                                         04413774
044138         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04413874
044139                           PV-MSTR-LAST-TO-OTBND-DAY              04413974
044140     END-IF.                                                      04414074
044141                                                                  04414174
044142     IF  PV-TRIP-MST-LST-TO-TCL-MIN-TOT  >    0  AND              04414274
044143         PV-TRIP-MST-LST-TO-TCL-CNT-TOT  >    0                   04414374
044144         DIVIDE PV-TRIP-MST-LST-TO-TCL-MIN-TOT                    04414474
044145             BY PV-TRIP-MST-LST-TO-TCL-CNT-TOT                    04414574
044146         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04414674
044147                 ROUNDED                                          04414774
044148         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04414874
044149             BY 1440                                              04414974
044150         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04415074
044151                 ROUNDED                                          04415174
044152     ELSE                                                         04415274
044153         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04415374
044154                           PV-MSTR-LAST-TO-TCLOS-DAY              04415474
044155     END-IF.                                                      04415574
044156                                                                  04415674
044157     IF  PV-TRIP-MST-LST-TO-SHP-MIN-TOT  >    0  AND              04415774
044158         PV-TRIP-MST-LST-TO-SHP-CNT-TOT  >    0                   04415874
044159         DIVIDE PV-TRIP-MST-LST-TO-SHP-MIN-TOT                    04415974
044160             BY PV-TRIP-MST-LST-TO-SHP-CNT-TOT                    04416074
044161         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04416174
044162                 ROUNDED                                          04416274
044163         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04416374
044164             BY 1440                                              04416474
044165         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04416574
044166                 ROUNDED                                          04416674
044167     ELSE                                                         04416774
044168         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04416874
044169                           PV-MSTR-LAST-TO-SHIP-DAY               04416974
044170     END-IF.                                                      04417074
044171                                                                  04417174
044172                                                                  04417291
044173****************************************************************  04417391
044174*                                                              *  04417491
044175****************************************************************  04417591
044176 3025-CALC-TRIP-CART-PCNT.                                        04417691
044177                                                                  04417791
044178     MOVE  ZEROES        TO  PV-TRIP-SRC-CRTN                     04417891
044179                             PV-TRIP-SRC-CRTN-PCNT.               04417991
044180                                                                  04418091
044190                                                                  04419099
044191     IF  PV-TRIP-CARTONS               >  0  AND                  04419199
044192         PV-TRIP-SRC-CARTONS           >  0                       04419299
044193         DIVIDE  PV-TRIP-CARTONS                                  04419399
044194             BY  PV-TRIP-CARTONS                                  04419499
044195         GIVING  PV-TRIP-SRC-CRTN                                 04419599
044196                   ROUNDED                                        04419699
044197         MULTIPLY  PV-TRIP-SRC-CRTN                               04419799
044198               BY  100                                            04419899
044199           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04419999
044200     ELSE                                                         04420099
044201         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04420199
044202                           PV-TRIP-SRC-CRTN                       04420299
044210     END-IF.                                                      04421099
044220                                                                  04422091
044300                                                                  04430091
045225****************************************************************  04522577
045226* MOVE THE DETAILS TO REPORT LINE.                             *  04522677
045227****************************************************************  04522777
045228 5000-PRINT-AREA-AVERAGE.                                         04522877
045229                                                                  04522977
045230     MOVE SU123-OPER-UNT-ID         TO DL1-DC-NBR                 04523077
045231                                       DL2-DC-NBR                 04523177
045232                                       DL3-DC-NBR                 04523277
045233                                       DL4-DC-NBR                 04523377
045234                                       DL5-DC-NBR.                04523477
045235     MOVE SU123-STORE-DEST          TO DL1-STORE                  04523577
045236                                       DL2-STORE                  04523677
045237                                       DL3-STORE                  04523777
045238                                       DL4-STORE                  04523877
045239                                       DL5-STORE.                 04523977
045240     MOVE SU123-TRIP-ID             TO DL1-TRIP-ID                04524077
045241                                       DL2-TRIP-ID                04524177
045242                                       DL3-TRIP-ID                04524277
045243                                       DL4-TRIP-ID                04524377
045244                                       DL5-TRIP-ID.               04524477
045245                                                                  04524577
045246     IF  SU123-SML-SRC-CDE   =  'ASN'                             04524677
045247         MOVE 'SCAN BASED XDOCK'    TO DL1-SOURCE                 04524777
045248                                       DL3-SOURCE                 04524877
045249                                       DL4-SOURCE                 04524977
045250                                       DL5-SOURCE                 04525077
045251     ELSE                                                         04525177
045252     IF  SU123-SML-SRC-CDE   =  'CPS'                             04525277
045253         MOVE 'MANUAL XDOCK    '    TO DL1-SOURCE                 04525377
045254                                       DL3-SOURCE                 04525477
045255                                       DL4-SOURCE                 04525577
045256                                       DL5-SOURCE                 04525677
045257     ELSE                                                         04525777
045258     IF  SU123-SML-SRC-CDE   =  'P2L'                             04525877
045259         MOVE 'PACK-TO-LIGHT   '    TO DL1-SOURCE                 04525977
045260                                       DL3-SOURCE                 04526077
045261                                       DL4-SOURCE                 04526177
045262                                       DL5-SOURCE                 04526277
045263     ELSE                                                         04526377
045264     IF  SU123-SML-SRC-CDE   =  'RDM'                             04526477
045265         MOVE 'IMPORT REPLEN   '    TO DL1-SOURCE                 04526577
045266                                       DL3-SOURCE                 04526677
045267                                       DL4-SOURCE                 04526777
045268                                       DL5-SOURCE                 04526877
045269     ELSE                                                         04526977
045270     IF  SU123-SML-SRC-CDE   =  '3WD'                             04527099
045271         MOVE '3PRTY WHSE DISTR'    TO DL1-SOURCE                 04527199
045272                                       DL3-SOURCE                 04527299
045273                                       DL4-SOURCE                 04527399
045274                                       DL5-SOURCE                 04527499
045275     ELSE                                                         04527599
045276     IF  SU123-SML-SRC-CDE   =  'JWL'                             04527677
045277         MOVE 'P2L JEWELRY     '    TO DL1-SOURCE                 04527777
045278                                       DL3-SOURCE                 04527877
045279                                       DL5-SOURCE                 04527977
045280     ELSE                                                         04528077
045281     IF  SU123-SML-SRC-CDE   =  'MST'                             04528177
045282         MOVE 'MASTER CONTAINER'    TO DL1-SOURCE                 04528277
045283                                       DL3-SOURCE                 04528377
045284                                       DL4-SOURCE                 04528477
045285                                       DL5-SOURCE                 04528577
045286     ELSE                                                         04528677
045287     IF  SU123-SML-SRC-CDE   =  'SMO'                             04528777
045288         MOVE 'PBS MANUAL XDOCK'    TO DL1-SOURCE                 04528877
045289                                       DL3-SOURCE                 04528977
045290                                       DL4-SOURCE                 04529077
045291                                       DL5-SOURCE                 04529177
045292     ELSE                                                         04529277
045293         MOVE SU123-SML-SRC-CDE     TO DL1-SOURCE                 04529377
045294                                       DL3-SOURCE                 04529477
045295                                       DL4-SOURCE                 04529577
045296                                       DL5-SOURCE                 04529677
045297     END-IF.                                                      04529777
045298                                                                  04529877
045299* DMH 8/19/16 BEGIN                                               04529988
045300     MOVE  PV-TRIP-SRC-CRTN-PCNT        TO DL1-CRTN-PCNT          04530088
045301                                           DL2-CRTN-PCNT          04530188
045302                                           DL3-CRTN-PCNT          04530288
045303                                           DL4-CRTN-PCNT          04530388
045304                                           DL5-CRTN-PCNT          04530488
045305* DMH 8/19/16 END                                                 04530588
045306                                                                  04530688
045307     IF  SU123-SML-SRC-CDE   =  'MST'                             04530788
045308*  <5>                                                            04530888
045309*        MOVE ZEROES                    TO DL1-ARVL-CKIN          04530988
045310*  <6>                                                            04531088
045311         MOVE PV-PRC-TO-MSTR-DAY        TO DL1-P2L-CKIN-PACK      04531188
045312                                           DL4-P2L-CKIN-PACK      04531288
045313*  <7>                                                            04531388
045314         MOVE PV-ARRIVE-TO-MSTR-DAY     TO DL1-P2L-ARVL-PACK      04531488
045315                                           DL4-P2L-ARVL-PACK      04531588
045316*  <8>                                                            04531688
045317         MOVE PV-MSTR-FIRST-TO-OTBND-DAY TO DL1-P2L-OPEN-CLOSE    04531788
045318                                            DL4-P2L-OPEN-CLOSE    04531888
045319*  <8.1>                                                          04531988
045320*        MOVE ZEROES                    TO DL1-P2L-OPEN-TRLR      04532088
045321*  <8.2>                                                          04532188
045322*        MOVE ZEROES                    TO DL1-P2L-CLOSE-TRLR     04532288
045323*  <9>                                                            04532388
045324         MOVE PV-MSTR-CRE-TO-OTBND-DAY  TO DL1-CKIN-OTBND-TRLR    04532488
045325                                           DL4-CKIN-OTBND-TRLR    04532588
045326* <10>                                                            04532688
045327*        MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL1-ARVL-OTBND-TRLR    04532788
045328* <11>                                                            04532888
045329         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL1-ON-TRLR-TO-CLOSE   04532988
045330                                           DL4-ON-TRLR-TO-CLOSE   04533088
045331* <11.5>                                                          04533188
045332         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL1-ON-TRLR-TO-SHIP    04533288
045333                                           DL4-ON-TRLR-TO-SHIP    04533388
045334* <12>                                                            04533488
045335*        MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL1-TRLR-CLOSE-TO-SHIP 04533588
045336* <13>                                                            04533688
045337*        MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL1-TRLR-OPEN-TO-CLOSE 04533788
045338* <14>                                                            04533888
045339*        MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL1-TRLR-OPEN-TO-SHIP  04533988
045340* <15>                                                            04534088
045341         MOVE PV-MSTR-CRE-TO-TCLOS-DAY  TO DL1-ARVL-TO-TRLR-CLOSE 04534188
045342                                           DL4-ARVL-TO-TRLR-CLOSE 04534288
045343* <16>                                                            04534388
045344         MOVE PV-MSTR-CRE-TO-SHIP-DAY   TO DL1-ARVL-TO-TRLR-SHIP  04534488
045345                                           DL4-ARVL-TO-TRLR-SHIP  04534588
045346     ELSE                                                         04534688
045347*  <5>                                                            04534788
045348         MOVE PV-ARRIVE-TO-PRC-DAY      TO DL1-ARVL-CKIN          04534888
045349                                           DL3-ARVL-CKIN          04534988
045350*  <6>                                                            04535088
045351         MOVE PV-PRC-TO-P2L-PKD-DAY     TO DL1-P2L-CKIN-PACK      04535188
045352*  <7>                                                            04535288
045353         MOVE PV-ARRIVE-TO-P2L-PKD-DAY  TO DL1-P2L-ARVL-PACK      04535388
045354*  <8>                                                            04535488
045355         MOVE PV-P2L-OPEN-TO-CLOSE-DAY  TO DL1-P2L-OPEN-CLOSE     04535588
045356*  <8.1>                                                          04535688
045357         MOVE PV-P2L-OPEN-TO-OTBND-DAY  TO DL1-P2L-OPEN-TRLR      04535788
045358*  <8.2>                                                          04535888
045359         MOVE PV-P2L-CLOSE-TO-OTBND-DAY TO DL1-P2L-CLOSE-TRLR     04535988
045360*  <9>                                                            04536088
045361         MOVE PV-PRC-TO-OTBND-DAY       TO DL1-CKIN-OTBND-TRLR    04536188
045362                                           DL3-CKIN-OTBND-TRLR    04536288
045363                                           DL5-CKIN-OTBND-TRLR    04536388
045364* <10>                                                            04536488
045365         MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL1-ARVL-OTBND-TRLR    04536588
045366                                           DL3-ARVL-OTBND-TRLR    04536688
045367* <11>                                                            04536788
045368         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL1-ON-TRLR-TO-CLOSE   04536888
045369                                           DL3-ON-TRLR-TO-CLOSE   04536988
045370                                           DL5-ON-TRLR-TO-CLOSE   04537088
045371* <11.5>                                                          04537188
045372         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL1-ON-TRLR-TO-SHIP    04537288
045373                                           DL3-ON-TRLR-TO-SHIP    04537388
045374                                           DL5-ON-TRLR-TO-SHIP    04537488
045375* <12>                                                            04537588
045376*        MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL1-TRLR-CLOSE-TO-SHIP 04537688
045377* <13>                                                            04537788
045378*        MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL1-TRLR-OPEN-TO-CLOSE 04537888
045379* <14>                                                            04537988
045380*        MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL1-TRLR-OPEN-TO-SHIP  04538088
045381*        MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL1-TRLR-OPEN-TO-SHIP  04538188
045382* <15>                                                            04538288
045383         MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL1-ARVL-TO-TRLR-CLOSE 04538388
045384                                           DL3-ARVL-TO-TRLR-CLOSE 04538488
045385                                           DL5-ARVL-TO-TRLR-CLOSE 04538588
045386* <16>                                                            04538688
045387         MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL1-ARVL-TO-TRLR-SHIP  04538788
045388                                           DL3-ARVL-TO-TRLR-SHIP  04538888
045389                                           DL5-ARVL-TO-TRLR-SHIP  04538988
045390     END-IF.                                                      04539088
045391                                                                  04539188
045392                                                                  04539288
045393     IF  SU123-SML-SRC-CDE   =  'ASN'  OR                         04539388
045394         SU123-SML-SRC-CDE   =  'CPS'  OR                         04539488
045395         SU123-SML-SRC-CDE   =  'SMO'                             04539588
045396         WRITE REPORT-RECORD                                      04539688
045397          FROM DETAIL-LINE3                                       04539788
045398         AFTER ADVANCING 1 LINES                                  04539888
045399     ELSE                                                         04539988
045400         IF  SU123-SML-SRC-CDE   =  'MST'                         04540088
045401             WRITE REPORT-RECORD                                  04540188
045402              FROM DETAIL-LINE4                                   04540288
045403             AFTER ADVANCING 1 LINES                              04540388
045404         ELSE                                                     04540488
045405             IF  SU123-SML-SRC-CDE   =  'RDM'  OR                 04540599
045406                 SU123-SML-SRC-CDE   =  '3WD'                     04540699
045407                 WRITE REPORT-RECORD                              04540799
045408                  FROM DETAIL-LINE5                               04540899
045409                 AFTER ADVANCING 1 LINES                          04540999
045410             ELSE                                                 04541099
045411                 WRITE REPORT-RECORD                              04541199
045412                  FROM DETAIL-LINE1                               04541299
045413                 AFTER ADVANCING 1 LINES                          04541399
045414             END-IF                                               04541499
045415         END-IF                                                   04541599
045416     END-IF.                                                      04541699
045417                                                                  04541799
045418     ADD  1                  TO PV-LINE-COUNT.                    04541899
045419     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        04541999
045420         PERFORM 1500-PRINT-HEADINGS                              04542099
045421     END-IF.                                                      04542199
045422                                                                  04542299
045423****************************************************************  04542399
045424* PRINT TRAILER TOTALS                                            04542499
045425****************************************************************  04542599
045426 5020-PRINT-TRLR-TOTALS.                                          04542699
045427                                                                  04542799
045428     MOVE 'TRAILER OVERALL '    TO DL2-SOURCE                     04542899
045429*                                                                 04542999
045430     MOVE PV-TRIP-SRC-CRTN-PCNT     TO DL2-CRTN-PCNT              04543099
045431*  <5>                                                            04543199
045432     MOVE PV-ARRIVE-TO-PRC-DAY      TO DL2-ARVL-CKIN              04543299
045433*  <6>                                                            04543399
045434     MOVE PV-PRC-TO-P2L-PKD-DAY     TO DL2-P2L-CKIN-PACK          04543499
045435*  <7>                                                            04543599
045436     MOVE PV-ARRIVE-TO-P2L-PKD-DAY  TO DL2-P2L-ARVL-PACK          04543699
045437*  <8>                                                            04543799
045438     MOVE PV-P2L-OPEN-TO-CLOSE-DAY  TO DL2-P2L-OPEN-CLOSE         04543899
045439*  <8.1>                                                          04543999
045440     MOVE PV-P2L-OPEN-TO-OTBND-DAY  TO DL2-P2L-OPEN-TRLR          04544099
045441*  <8.2>                                                          04544199
045442     MOVE PV-P2L-CLOSE-TO-OTBND-DAY TO DL2-P2L-CLOSE-TRLR         04544299
045443*  <9>                                                            04544399
045444     MOVE PV-PRC-TO-OTBND-DAY       TO DL2-CKIN-OTBND-TRLR        04544499
045445* <10>                                                            04544599
045446     MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL2-ARVL-OTBND-TRLR        04544699
045447* <11>                                                            04544799
045448     MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL2-ON-TRLR-TO-CLOSE       04544899
045449* <11.5>                                                          04544999
045450     MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL2-ON-TRLR-TO-SHIP        04545099
045451* <12>                                                            04545199
045452     MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL2-TRLR-CLOSE-TO-SHIP     04545299
045453* <13>                                                            04545399
045454     MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL2-TRLR-OPEN-TO-CLOSE     04545499
045455* <14>                                                            04545599
045456     MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL2-TRLR-OPEN-TO-SHIP      04545699
045457* <15>                                                            04545799
045458     MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL2-ARVL-TO-TRLR-CLOSE     04545899
045459* <16>                                                            04545999
045460     MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL2-ARVL-TO-TRLR-SHIP      04546099
045461                                                                  04546199
045462     WRITE REPORT-RECORD                                          04546299
045463       FROM DETAIL-LINE2                                          04546399
045464         AFTER ADVANCING 1 LINES.                                 04546499
045465                                                                  04546599
045466     ADD  1                  TO PV-LINE-COUNT.                    04546699
045467     ADD  1                  TO PV-TRIP-COUNT.                    04546799
045468     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE  OR                    04546899
045469         PV-TRIP-COUNT  > PV-TRIPS-ON-PAGE                        04546999
045470         PERFORM 1500-PRINT-HEADINGS                              04547099
045471     ELSE                                                         04547199
045472         MOVE  SPACES TO REPORT-RECORD                            04547299
045473         WRITE REPORT-RECORD                                      04547399
045474             AFTER ADVANCING 1 LINES                              04547499
045475         ADD  1              TO PV-LINE-COUNT                     04547599
045476         IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                    04547699
045477             PERFORM 1500-PRINT-HEADINGS                          04547799
045478         END-IF                                                   04547899
045479     END-IF.                                                      04547999
045480                                                                  04548099
045481****************************************************************  04548199
045482* PRINTS A BLANK LINE                                          *  04548299
045483****************************************************************  04548399
045484 6000-PRINT-BLANK-LINE.                                           04548499
045485                                                                  04548599
045486        WRITE REPORT-RECORD                                       04548699
045490          FROM BLANK-LINE                                         04549088
045500            AFTER ADVANCING 1 LINE                                04550000
045600                                                                  04560000
045700     ADD +1 TO PV-LINE-COUNT.                                     04570000
045800                                                                  04580000
045900******************************************************************04590000
046000*  READ A RECORD FROM THE MANIFESTED NOT LOADED FILE             *04600000
046100******************************************************************04610000
046200 7000-READ-EXTRACT-FILE.                                          04620000
046300     READ INPUT-FILE                                              04630000
046400          INTO SU123-EXTRACT-RECORD                               04640010
046500         AT END                                                   04650000
046600             SET PS-END-OF-INPUT TO TRUE                          04660000
046700         NOT AT END                                               04670000
046800             ADD +1 TO PV-READ-COUNT                              04680000
046900     END-READ.                                                    04690000
047000                                                                  04700000
047001*-----------------------------------------------------------------04700151
047002*  READ DATE CONTROL RECORD                                       04700251
047003*-----------------------------------------------------------------04700351
047004 7010-READ-CONTROL-REC.                                           04700451
047005                                                                  04700551
047006     MOVE SPACES  TO  SU032-DATE-CONTROL-REC.                     04700652
047007                                                                  04700752
047008     READ CONTROL-FILE     INTO                                   04700855
047009           SU032-DATE-CONTROL-REC                                 04700952
047010     AT END                                                       04701052
047011         DISPLAY 'PROGRAM:  SUKRP071'                             04701152
047012         DISPLAY 'NO DATE CONTROL CARD'                           04701252
047013         DISPLAY SPACES                                           04701352
047014     NOT AT END                                                   04701452
047015         DISPLAY 'PROGRAM:  SUKRP071'                             04701552
047016         DISPLAY 'DATE CONTROL CARD:'                             04701652
047017                 SU032-DATE-CONTROL-REC                           04701752
047018         DISPLAY SPACES                                           04701852
047019     END-READ.                                                    04701952
047020                                                                  04702052
047021*-----------------------------------------------------------------04702199
047022*  READ DATE SELECTION RECORD                                     04702299
047023*-----------------------------------------------------------------04702399
047024 7015-READ-SELECTION-REC.                                         04702499
047025                                                                  04702599
047026     MOVE SPACES  TO  SU134-SELECTION-REC.                        04702699
047027                                                                  04702799
047028     READ SELECTION-FILE     INTO                                 04702899
047029           SU134-SELECTION-REC                                    04702999
047030     AT END                                                       04703099
047031         DISPLAY 'PROGRAM:  SUKRP071'                             04703199
047032         DISPLAY 'NO DATE SELECTION CARD'                         04703299
047033         DISPLAY SPACES                                           04703399
047034     NOT AT END                                                   04703499
047035         DISPLAY 'PROGRAM:  SUKRP071'                             04703599
047036         DISPLAY 'DATE CONTROL CARD:'                             04703699
047037                 SU032-DATE-CONTROL-REC                           04703799
047038         DISPLAY SPACES                                           04703899
047039     END-READ.                                                    04703999
047040                                                                  04704099
047042     IF  SU134-EFC-STORES                                         04704299
047043         SET  HL1-EFC-STORES   TO  TRUE                           04704399
047044     ELSE                                                         04704499
047045     IF  SU134-LFC-STORES                                         04704599
047046          SET  HL1-LFC-STORES  TO  TRUE                           04704699
047047     ELSE                                                         04704799
047048          SET  HL1-RDC-STORES  TO  TRUE                           04704899
047049     END-IF                                                       04704999
047050     END-IF.                                                      04705099
047051                                                                  04705199
047052                                                                  04705299
047053******************************************************************04705352
047054*  WRITE AREA TOTAL RECORD                                       *04705452
047055******************************************************************04705533
047056 8000-WRITE-OUTPUT-FILE.                                          04705633
047057                                                                  04705733
047060     MOVE SU123-OPER-UNT-ID                                       04706033
047117                         TO  SU129-OPER-UNT-ID.                   04711733
047118     MOVE SU123-STORE-DEST                                        04711833
047119                         TO  SU129-STORE-DEST.                    04711933
047120     MOVE SU123-TRIP-ID                                           04712033
047121                         TO  SU129-TRIP-ID.                       04712133
047122     MOVE SU123-TRIP-OPEN-TO-CLOSE-MIN                            04712233
047123                         TO  SU129-TRIP-OPEN-TO-CLOSE-MIN.        04712333
047124     MOVE SU123-TRIP-CLOSE-TO-SHIP-MIN                            04712433
047125                         TO  SU129-TRIP-CLOSE-TO-SHIP-MIN.        04712533
047126     MOVE SU123-TRIP-OPEN-TO-SHIP-MIN                             04712633
047127                         TO  SU129-TRIP-OPEN-TO-SHIP-MIN.         04712733
047129     MOVE SU123-SML-SRC-CDE                                       04712933
047130                         TO  SU129-SML-SRC-CDE.                   04713033
047131     MOVE SU123-REPORT-SORT-SEQ                                   04713166
047132                         TO  SU129-REPORT-SORT-SEQ                04713266
047133     MOVE SU123-INPUT-RECORD-COUNT                                04713333
047134                         TO  SU129-INPUT-RECORD-COUNT.            04713433
047135     MOVE SU123-ARRIVE-TO-PRC-MIN                                 04713533
047136                         TO  SU129-ARRIVE-TO-PRC-MIN.             04713633
047137     MOVE SU123-ARRIVE-TO-P2L-PKD-MIN                             04713733
047138                         TO  SU129-ARRIVE-TO-P2L-PKD-MIN.         04713833
047139     MOVE SU123-PRC-TO-P2L-PKD-MIN                                04713933
047140                         TO  SU129-PRC-TO-P2L-PKD-MIN.            04714033
047141     MOVE SU123-P2L-PKD-TO-CLOSE-MIN                              04714133
047142                         TO  SU129-P2L-PKD-TO-CLOSE-MIN.          04714233
047143     MOVE SU123-P2L-OPEN-TO-CLOSE-MIN                             04714333
047144                         TO  SU129-P2L-OPEN-TO-CLOSE-MIN.         04714433
047145     MOVE SU123-P2L-OPEN-TO-OTBND-MIN                             04714533
047146                         TO  SU129-P2L-OPEN-TO-OTBND-MIN.         04714633
047147     MOVE SU123-P2L-CLOSE-TO-OTBND-MIN                            04714733
047148                         TO  SU129-P2L-CLOSE-TO-OTBND-MIN.        04714833
047149     MOVE SU123-ARRIVE-TO-OTBND-MIN                               04714933
047150                         TO  SU129-ARRIVE-TO-OTBND-MIN.           04715033
047151     MOVE SU123-PRC-TO-OTBND-MIN                                  04715133
047152                         TO  SU129-PRC-TO-OTBND-MIN.              04715233
047153     MOVE SU123-ARRIVE-TO-TCLOS-MIN                               04715333
047154                         TO  SU129-ARRIVE-TO-TCLOS-MIN.           04715433
047155     MOVE SU123-ARRIVE-TO-SHIP-MIN                                04715533
047156                         TO  SU129-ARRIVE-TO-SHIP-MIN.            04715633
047157     MOVE SU123-P2L-OPEN-TO-TCLOS-MIN                             04715733
047158                         TO  SU129-P2L-OPEN-TO-TCLOS-MIN.         04715833
047159     MOVE SU123-P2L-OPEN-TO-SHIP-MIN                              04715933
047160                         TO  SU129-P2L-OPEN-TO-SHIP-MIN.          04716033
047161     MOVE SU123-P2L-CLOSE-TO-TCLOS-MIN                            04716133
047162                         TO  SU129-P2L-CLOSE-TO-TCLOS-MIN.        04716233
047163     MOVE SU123-P2L-CLOSE-TO-SHIP-MIN                             04716333
047164                         TO  SU129-P2L-CLOSE-TO-SHIP-MIN.         04716433
047165     MOVE SU123-ARRIVE-TO-MSTR-MIN                                04716533
047166                         TO  SU129-ARRIVE-TO-MSTR-MIN.            04716633
047167     MOVE SU123-PRC-TO-MSTR-MIN                                   04716733
047168                         TO  SU129-PRC-TO-MSTR-MIN.               04716833
047169     MOVE SU123-ON-OTBND-TO-CLOS-MIN                              04716939
047170                         TO  SU129-ON-OTBND-TO-TCLOS-MIN.         04717033
047171     MOVE SU123-ON-OTBND-TO-SHIP-MIN                              04717139
047172                         TO  SU129-ON-OTBND-TO-TSHIP-MIN.         04717233
047173     MOVE SU123-MSTR-CRE-TO-OTBND-MIN                             04717333
047174                         TO  SU129-MSTR-CRE-TO-OTBND-MIN.         04717433
047175     MOVE SU123-MSTR-CRE-TO-TCLOS-MIN                             04717533
047176                         TO  SU129-MSTR-CRE-TO-TCLOS-MIN.         04717633
047177     MOVE SU123-MSTR-CRE-TO-SHIP-MIN                              04717733
047178                         TO  SU129-MSTR-CRE-TO-SHIP-MIN.          04717833
047179     MOVE SU123-MSTR-FIRST-TO-OTBND-MIN                           04717933
047180                         TO  SU129-MSTR-FIRST-TO-OTBND-MIN.       04718033
047181     MOVE SU123-MSTR-FIRST-TO-TCLOS-MIN                           04718133
047182                         TO  SU129-MSTR-FIRST-TO-TCLOS-MIN.       04718233
047183     MOVE SU123-MSTR-FIRST-TO-SHIP-MIN                            04718333
047184                         TO  SU129-MSTR-FIRST-TO-SHIP-MIN.        04718433
047185     MOVE SU123-MSTR-LAST-TO-OTBND-MIN                            04718533
047186                         TO  SU129-MSTR-LAST-TO-OTBND-MIN.        04718633
047187     MOVE SU123-MSTR-LAST-TO-TCLOS-MIN                            04718733
047188                         TO  SU129-MSTR-LAST-TO-TCLOS-MIN.        04718833
047189     MOVE SU123-MSTR-LAST-TO-SHIP-MIN                             04718933
047190                         TO  SU129-MSTR-LAST-TO-SHIP-MIN.         04719033
047191     MOVE SU123-ON-OTBND-TO-CLOS-MIN                              04719133
047192                         TO  SU129-ON-OTBND-TO-CLOS-MIN.          04719233
047193     MOVE SU123-ON-OTBND-TO-SHIP-MIN                              04719333
047194                         TO  SU129-ON-OTBND-TO-SHIP-MIN.          04719433
047195*                                                                 04719533
047196     MOVE SU123-ARRIVE-TO-PRC-CNT                                 04719633
047197                         TO  SU129-ARRIVE-TO-PRC-CNT.             04719733
047198     MOVE SU123-ARRIVE-TO-P2L-PKD-CNT                             04719833
047199                         TO  SU129-ARRIVE-TO-P2L-PKD-CNT.         04719933
047200     MOVE SU123-PRC-TO-P2L-PKD-CNT                                04720033
047201                         TO  SU129-PRC-TO-P2L-PKD-CNT.            04720133
047202     MOVE SU123-P2L-PKD-TO-CLOSE-CNT                              04720233
047203                         TO  SU129-P2L-PKD-TO-CLOSE-CNT.          04720333
047204     MOVE SU123-P2L-OPEN-TO-CLOSE-CNT                             04720433
047205                         TO  SU129-P2L-OPEN-TO-CLOSE-CNT.         04720533
047206     MOVE SU123-P2L-OPEN-TO-OTBND-CNT                             04720633
047207                         TO  SU129-P2L-OPEN-TO-OTBND-CNT.         04720733
047208     MOVE SU123-P2L-CLOSE-TO-OTBND-CNT                            04720833
047209                         TO  SU129-P2L-CLOSE-TO-OTBND-CNT.        04720933
047210     MOVE SU123-ARRIVE-TO-OTBND-CNT                               04721033
047211                         TO  SU129-ARRIVE-TO-OTBND-CNT.           04721133
047212     MOVE SU123-PRC-TO-OTBND-CNT                                  04721233
047213                         TO  SU129-PRC-TO-OTBND-CNT.              04721333
047214     MOVE SU123-ARRIVE-TO-TCLOS-CNT                               04721433
047215                         TO  SU129-ARRIVE-TO-TCLOS-CNT.           04721533
047216     MOVE SU123-ARRIVE-TO-SHIP-CNT                                04721633
047217                         TO  SU129-ARRIVE-TO-SHIP-CNT.            04721733
047218     MOVE SU123-P2L-OPEN-TO-TCLOS-CNT                             04721833
047219                         TO  SU129-P2L-OPEN-TO-TCLOS-CNT.         04721933
047220     MOVE SU123-P2L-OPEN-TO-SHIP-CNT                              04722033
047221                         TO  SU129-P2L-OPEN-TO-SHIP-CNT.          04722133
047222     MOVE SU123-P2L-CLOSE-TO-TCLOS-CNT                            04722233
047223                         TO  SU129-P2L-CLOSE-TO-TCLOS-CNT.        04722333
047224     MOVE SU123-P2L-CLOSE-TO-SHIP-CNT                             04722433
047225                         TO  SU129-P2L-CLOSE-TO-SHIP-CNT.         04722533
047226     MOVE SU123-ARRIVE-TO-MSTR-CNT                                04722633
047227                         TO  SU129-ARRIVE-TO-MSTR-CNT.            04722733
047228     MOVE SU123-PRC-TO-MSTR-CNT                                   04722833
047229                         TO  SU129-PRC-TO-MSTR-CNT.               04722933
047230     MOVE SU123-ON-OTBND-TO-CLOS-CNT                              04723040
047231                         TO  SU129-ON-OTBND-TO-TCLOS-CNT.         04723133
047232     MOVE SU123-ON-OTBND-TO-SHIP-CNT                              04723240
047233                         TO  SU129-ON-OTBND-TO-TSHIP-CNT.         04723333
047234     MOVE SU123-MSTR-CRE-TO-OTBND-CNT                             04723433
047235                         TO  SU129-MSTR-CRE-TO-OTBND-CNT.         04723533
047236     MOVE SU123-MSTR-CRE-TO-TCLOS-CNT                             04723633
047237                         TO  SU129-MSTR-CRE-TO-TCLOS-CNT.         04723733
047238     MOVE SU123-MSTR-CRE-TO-SHIP-CNT                              04723833
047239                         TO  SU129-MSTR-CRE-TO-SHIP-CNT.          04723933
047240     MOVE SU123-MSTR-FIRST-TO-OTBND-CNT                           04724033
047241                         TO  SU129-MSTR-FIRST-TO-OTBND-CNT.       04724133
047242     MOVE SU123-MSTR-FIRST-TO-TCLOS-CNT                           04724233
047243                         TO  SU129-MSTR-FIRST-TO-TCLOS-CNT.       04724333
047244     MOVE SU123-MSTR-FIRST-TO-SHIP-CNT                            04724433
047245                         TO  SU129-MSTR-FIRST-TO-SHIP-CNT.        04724533
047246     MOVE SU123-MSTR-LAST-TO-OTBND-CNT                            04724633
047247                         TO  SU129-MSTR-LAST-TO-OTBND-CNT.        04724733
047248     MOVE SU123-MSTR-LAST-TO-TCLOS-CNT                            04724833
047249                         TO  SU129-MSTR-LAST-TO-TCLOS-CNT.        04724933
047250     MOVE SU123-MSTR-LAST-TO-SHIP-CNT                             04725033
047251                         TO  SU129-MSTR-LAST-TO-SHIP-CNT.         04725133
047252     MOVE SU123-ON-OTBND-TO-CLOS-CNT                              04725233
047253                         TO  SU129-ON-OTBND-TO-CLOS-CNT.          04725333
047254     MOVE SU123-ON-OTBND-TO-SHIP-CNT                              04725433
047255                         TO  SU129-ON-OTBND-TO-SHIP-CNT.          04725533
047256                                                                  04725633
047257*                                                                 04725799
047258* DMH 08/19/16 - BEGIN                                            04725899
047259*                                                                 04725999
047260     MOVE SU123-TRIP-CARTONS                                      04726099
047261                         TO SU129-TRIP-CARTONS                    04726199
047262     MOVE SU123-TRIP-SRC-CARTONS                                  04726299
047263                         TO SU129-TRIP-SRC-CARTONS                04726399
047265     MOVE SU123-TOTAL-TRIPS                                       04726599
047266                         TO SU129-TOTAL-TRIPS                     04726699
047267*                                                                 04726799
047268* DMH 08/19/16 - END                                              04726899
047269*                                                                 04726999
047270                                                                  04727099
047271     WRITE OUTPUT-RECORD                                          04727199
047272           FROM SU129-EXTRACT-RECORD                              04727299
047273     END-WRITE.                                                   04727399
047274     ADD +1 TO PV-WRITE-COUNT.                                    04727499
047275                                                                  04727599
047276                                                                  04727699
047277******************************************************************04727799
047278*  WRITE TRAILER TOTAL RECORD                                    *04727899
047279******************************************************************04727999
047280 8020-WRITE-OUTPUT-FILE.                                          04728099
047335     MOVE PV-PREV-OPER     TO  SU129-OPER-UNT-ID.                 04733534
047336     MOVE PV-PREV-DEST     TO  SU129-STORE-DEST.                  04733634
047337     MOVE PV-PREV-TRIP-ID  TO  SU129-TRIP-ID.                     04733734
047338     MOVE 'ZZZ'            TO  SU129-SML-SRC-CDE.                 04733834
047339     MOVE PV-TRIP-OPEN-TO-CLOSE-MIN-TOT                           04733934
047340                         TO  SU129-TRIP-OPEN-TO-CLOSE-MIN.        04734034
047341     MOVE PV-TRIP-CLOSE-TO-SHIP-MIN-TOT                           04734134
047342                         TO  SU129-TRIP-CLOSE-TO-SHIP-MIN.        04734234
047343     MOVE PV-TRIP-OPEN-TO-SHIP-MIN-TOT                            04734334
047344                         TO  SU129-TRIP-OPEN-TO-SHIP-MIN.         04734434
047345     MOVE PV-TRIP-INPUT-RECORD-TOTAL                              04734534
047346                         TO  SU129-INPUT-RECORD-COUNT.            04734634
047347     MOVE PV-TRIP-ARRIVE-TO-PRC-MIN-TOT                           04734734
047351                         TO  SU129-ARRIVE-TO-PRC-MIN.             04735134
047352     MOVE PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT                          04735234
047353                         TO  SU129-ARRIVE-TO-P2L-PKD-MIN.         04735334
047354     MOVE PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT                          04735434
047355                         TO  SU129-PRC-TO-P2L-PKD-MIN.            04735534
047356     MOVE PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT                          04735634
047357                         TO  SU129-P2L-PKD-TO-CLOSE-MIN.          04735734
047358     MOVE PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT                          04735834
047359                         TO  SU129-P2L-OPEN-TO-CLOSE-MIN.         04735934
047360     MOVE PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT                          04736034
047361                         TO  SU129-P2L-OPEN-TO-OTBND-MIN.         04736134
047362     MOVE PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT                          04736234
047363                         TO  SU129-P2L-CLOSE-TO-OTBND-MIN.        04736334
047364     MOVE PV-TRIP-ARRIV-TO-OTBND-MIN-TOT                          04736434
047365                         TO  SU129-ARRIVE-TO-OTBND-MIN.           04736534
047366     MOVE PV-TRIP-PRC-TO-OTBND-MIN-TOT                            04736634
047367                         TO  SU129-PRC-TO-OTBND-MIN.              04736734
047368     MOVE PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT                          04736834
047369                         TO  SU129-ARRIVE-TO-TCLOS-MIN.           04736934
047370     MOVE PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT                          04737034
047371                         TO  SU129-ARRIVE-TO-SHIP-MIN.            04737134
047372     MOVE PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT                          04737234
047373                         TO  SU129-P2L-OPEN-TO-TCLOS-MIN.         04737334
047374     MOVE PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT                          04737434
047375                         TO  SU129-P2L-OPEN-TO-SHIP-MIN.          04737534
047376     MOVE PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT                          04737634
047377                         TO  SU129-P2L-CLOSE-TO-TCLOS-MIN.        04737734
047378     MOVE PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT                          04737834
047379                         TO  SU129-P2L-CLOSE-TO-SHIP-MIN.         04737934
047380     MOVE PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT                          04738034
047381                         TO  SU129-ARRIVE-TO-MSTR-MIN.            04738134
047382     MOVE PV-TRIP-PRC-TO-MSTR-MIN-TOT                             04738234
047383                         TO  SU129-PRC-TO-MSTR-MIN.               04738334
047384     MOVE PV-TRIP-ON-OTBND-TO-TCLOS-TOT                           04738434
047385                         TO  SU129-ON-OTBND-TO-TCLOS-MIN.         04738534
047386     MOVE PV-TRIP-ON-OTBND-TO-TSHIP-TOT                           04738634
047387                         TO  SU129-ON-OTBND-TO-TSHIP-MIN.         04738734
047388     MOVE PV-TRIP-MST-CRE-TO-OTB-MIN-TOT                          04738834
047389                         TO  SU129-MSTR-CRE-TO-OTBND-MIN.         04738934
047390     MOVE PV-TRIP-MST-CRE-TO-TCL-MIN-TOT                          04739034
047391                         TO  SU129-MSTR-CRE-TO-TCLOS-MIN.         04739134
047392     MOVE PV-TRIP-MST-CRE-TO-SHP-MIN-TOT                          04739234
047393                         TO  SU129-MSTR-CRE-TO-SHIP-MIN.          04739334
047394     MOVE PV-TRIP-MST-1ST-TO-OTB-MIN-TOT                          04739434
047395                         TO  SU129-MSTR-FIRST-TO-OTBND-MIN.       04739534
047396     MOVE PV-TRIP-MST-1ST-TO-TCL-MIN-TOT                          04739634
047397                         TO  SU129-MSTR-FIRST-TO-TCLOS-MIN.       04739734
047398     MOVE PV-TRIP-MST-1ST-TO-SHP-MIN-TOT                          04739834
047399                         TO  SU129-MSTR-FIRST-TO-SHIP-MIN.        04739934
047400     MOVE PV-TRIP-MST-LST-TO-OTB-MIN-TOT                          04740034
047401                         TO  SU129-MSTR-LAST-TO-OTBND-MIN.        04740134
047402     MOVE PV-TRIP-MST-LST-TO-TCL-MIN-TOT                          04740234
047403                         TO  SU129-MSTR-LAST-TO-TCLOS-MIN.        04740334
047404     MOVE PV-TRIP-MST-LST-TO-SHP-MIN-TOT                          04740434
047405                         TO  SU129-MSTR-LAST-TO-SHIP-MIN.         04740534
047406     MOVE PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT                          04740634
047407                         TO  SU129-ON-OTBND-TO-CLOS-MIN.          04740734
047408     MOVE PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT                          04740834
047409                         TO  SU129-ON-OTBND-TO-SHIP-MIN.          04740934
047410*                                                                 04741034
047411     MOVE PV-TRIP-ARRIVE-TO-PRC-CNT-TOT                           04741134
047412                         TO  SU129-ARRIVE-TO-PRC-CNT.             04741234
047413     MOVE PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT                          04741334
047414                         TO  SU129-ARRIVE-TO-P2L-PKD-CNT.         04741434
047415     MOVE PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT                          04741534
047416                         TO  SU129-PRC-TO-P2L-PKD-CNT.            04741634
047417     MOVE PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT                          04741734
047418                         TO  SU129-P2L-PKD-TO-CLOSE-CNT.          04741834
047419     MOVE PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT                          04741934
047420                         TO  SU129-P2L-OPEN-TO-CLOSE-CNT.         04742034
047421     MOVE PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT                          04742134
047422                         TO  SU129-P2L-OPEN-TO-OTBND-CNT.         04742234
047423     MOVE PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT                          04742334
047424                         TO  SU129-P2L-CLOSE-TO-OTBND-CNT.        04742434
047425     MOVE PV-TRIP-ARRIV-TO-OTBND-CNT-TOT                          04742534
047426                         TO  SU129-ARRIVE-TO-OTBND-CNT.           04742634
047427     MOVE PV-TRIP-PRC-TO-OTBND-CNT-TOT                            04742734
047428                         TO  SU129-PRC-TO-OTBND-CNT.              04742834
047429     MOVE PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT                          04742934
047430                         TO  SU129-ARRIVE-TO-TCLOS-CNT.           04743034
047431     MOVE PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT                          04743134
047432                         TO  SU129-ARRIVE-TO-SHIP-CNT.            04743234
047433     MOVE PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT                          04743334
047434                         TO  SU129-P2L-OPEN-TO-TCLOS-CNT.         04743434
047435     MOVE PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT                          04743534
047436                         TO  SU129-P2L-OPEN-TO-SHIP-CNT.          04743634
047437     MOVE PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT                          04743734
047438                         TO  SU129-P2L-CLOSE-TO-TCLOS-CNT.        04743834
047439     MOVE PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT                          04743934
047440                         TO  SU129-P2L-CLOSE-TO-SHIP-CNT.         04744034
047441     MOVE PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT                          04744134
047442                         TO  SU129-ARRIVE-TO-MSTR-CNT.            04744234
047443     MOVE PV-TRIP-PRC-TO-MSTR-CNT-TOT                             04744334
047444                         TO  SU129-PRC-TO-MSTR-CNT.               04744434
047445     MOVE PV-TRIP-ON-OTB-TO-TCL0-CNT-TOT                          04744534
047446                         TO  SU129-ON-OTBND-TO-TCLOS-CNT.         04744634
047447     MOVE PV-TRIP-ON-OTB-TO-TSHP-CNT-TOT                          04744734
047448                         TO  SU129-ON-OTBND-TO-TSHIP-CNT.         04744834
047449     MOVE PV-TRIP-MST-CRE-TO-OTB-CNT-TOT                          04744934
047450                         TO  SU129-MSTR-CRE-TO-OTBND-CNT.         04745034
047451     MOVE PV-TRIP-MST-CRE-TO-TCL-CNT-TOT                          04745134
047452                         TO  SU129-MSTR-CRE-TO-TCLOS-CNT.         04745234
047453     MOVE PV-TRIP-MST-CRE-TO-SHP-CNT-TOT                          04745334
047454                         TO  SU129-MSTR-CRE-TO-SHIP-CNT.          04745434
047455     MOVE PV-TRIP-MST-1ST-TO-OTB-CNT-TOT                          04745534
047456                         TO  SU129-MSTR-FIRST-TO-OTBND-CNT.       04745634
047457     MOVE PV-TRIP-MST-1ST-TO-TCL-CNT-TOT                          04745734
047458                         TO  SU129-MSTR-FIRST-TO-TCLOS-CNT.       04745834
047459     MOVE PV-TRIP-MST-1ST-TO-SHP-CNT-TOT                          04745934
047460                         TO  SU129-MSTR-FIRST-TO-SHIP-CNT.        04746034
047461     MOVE PV-TRIP-MST-LST-TO-OTB-CNT-TOT                          04746134
047462                         TO  SU129-MSTR-LAST-TO-OTBND-CNT.        04746234
047463     MOVE PV-TRIP-MST-LST-TO-TCL-CNT-TOT                          04746334
047464                         TO  SU129-MSTR-LAST-TO-TCLOS-CNT.        04746434
047465     MOVE PV-TRIP-MST-LST-TO-SHP-CNT-TOT                          04746534
047466                         TO  SU129-MSTR-LAST-TO-SHIP-CNT.         04746634
047467     MOVE PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT                          04746734
047468                         TO  SU129-ON-OTBND-TO-CLOS-CNT.          04746834
047469     MOVE PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT                          04746934
047470                         TO  SU129-ON-OTBND-TO-SHIP-CNT.          04747034
047471                                                                  04747134
047472*                                                                 04747299
047473*** DMH 8/18/16                                                   04747399
047474*                                                                 04747499
047475     MOVE 99                  TO  SU129-REPORT-SORT-SEQ.          04747599
047476     MOVE PV-TRIP-CARTONS     TO  SU129-TRIP-CARTONS.             04747699
047477     MOVE PV-TRIP-CARTONS     TO  SU129-TRIP-SRC-CARTONS.         04747799
047478     MOVE ZEROES              TO  SU129-TOTAL-TRIPS.              04747899
047479                                                                  04747999
047480     MOVE ZEROES              TO  PV-TRIP-CARTONS                 04748099
047481                                  PV-TRIP-SRC-CARTONS.            04748199
047482*                                                                 04748299
047483***                                                               04748399
047484*                                                                 04748499
047485                                                                  04748599
047486     WRITE OUTPUT-RECORD                                          04748699
047487          FROM SU129-EXTRACT-RECORD                               04748799
047488     END-WRITE.                                                   04748899
047489     ADD +1 TO PV-WRITE-COUNT.                                    04748999
047490                                                                  04749099
047491******************************************************************04749199
047492 8500-GET-LOCATION-NAME.                                          04749299
047493******************************************************************04749399
047494                                                                  04749499
047500     MOVE PV-SAVE-OPER-UNT-ID  TO  XLT00010-LOC-NBR               04750000
047600                                   PV-DISPLAY-OPER.               04760000
047700                                                                  04770000
047800     EXEC SQL                                                     04780000
047900         SELECT   LOC_NM                                          04790000
048000           INTO  :XLT00010-LOC-NM                                 04800000
048100           FROM   XLT_LOC                                         04810000
048200          WHERE   LOC_NBR  =  :XLT00010-LOC-NBR                   04820000
048300     END-EXEC.                                                    04830000
048400                                                                  04840000
048500     EVALUATE TRUE                                                04850000
048600         WHEN SQLCODE = +0                                        04860000
048700              MOVE PV-SAVE-OPER-UNT-ID TO HD2-OPER-UNT-ID         04870000
048800              MOVE XLT00010-LOC-NM     TO HD2-DC-NAME             04880000
048900         WHEN OTHER                                               04890000
049000              CONTINUE                                            04900000
049100     END-EVALUATE.                                                04910000
049200                                                                  04920000
049300******************************************************************04930000
049400*  ABEND ROUTINE                                                 *04940000
049500******************************************************************04950000
049600 9900-DB2-ABEND.                                                  04960000
049700                                                                  04970000
049800     MOVE SQLCODE TO PV-SQLCODE.                                  04980000
049900     DISPLAY '*** DB2 ERROR '.                                    04990000
050000     DISPLAY '*** SQLCODE   = ' PV-SQLCODE.                       05000000
050100     DISPLAY '*** PROGRAM   = ' PV-ABEND-PROGRAM.                 05010000
050200     DISPLAY '*** PARAGRAPH = ' PV-ABEND-PARAGRAPH.               05020000
050300     DISPLAY '*** OPERATION = ' PV-ABEND-OPERATION.               05030000
050400     DISPLAY '*** MESSAGE   = ' PV-DB2-OPERATION-MESSAGE-1.       05040000
050500     DISPLAY '***           = ' PV-DB2-OPERATION-MESSAGE-2.       05050000
050600     DISPLAY '*** TABLE 1   = ' PV-DB2-TABLE-NAME-1.              05060000
050700     DISPLAY '*** TABLE 2   = ' PV-DB2-TABLE-NAME-2.              05070000
050800                                                                  05080000
050900     COPY DPPD004.                                                05090000
051000                                                                  05100000
051100     MOVE +4013 TO PV-ABEND-CODE.                                 05110000
051200     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         05120000
051300                                                                  05130000
051400 9999-ABEND.                                                      05140000
051500                                                                  05150000
051600     DISPLAY '***************'.                                   05160000
051700     DISPLAY '** ABEND     **'.                                   05170000
051800     DISPLAY '** PROGRAM   ** = ' PV-ABEND-PROGRAM.               05180000
051900     DISPLAY '** PARAGRAPH ** = ' PV-ABEND-PARAGRAPH.             05190000
052000     DISPLAY '***************'.                                   05200000
052100                                                                  05210000
052200     MOVE +4008                  TO PV-ABEND-CODE.                05220000
052300     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         05230000
052400                                                                  05240000
052500******************************************************************05250000
052600*                 E N D   O F   P R O G R A M                    *05260000
052700******************************************************************05270000
