000100***************************************************************** 00010002
000200 IDENTIFICATION DIVISION.                                         00020002
000300***************************************************************** 00030002
000400*                                                                 00040002
000500 PROGRAM-ID.             SUKRP045.                                00050002
000600 AUTHOR.                 PATRICK BURKE.                           00060002
000700 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00070002
000800 DATE-WRITTEN.           OCTOBER 2005.                            00080002
000900 DATE-COMPILED.                                                   00090002
001000*                                                                 00100002
001100***************************************************************** 00110002
001200*  THIS PROGRAM WILL TAKE THE OUTPUT FILE FROM SUKUT115 AFTER IT  00120003
001300*  HAS BEEN SORTED AND USE IT TO CREATE THE DAILY NOT SCANNED     00130017
001400*  DETAIL REPORT.                                                 00140017
001500***************************************************************** 00150002
001600 ENVIRONMENT DIVISION.                                            00160002
001700***************************************************************** 00170002
001800 CONFIGURATION SECTION.                                           00180002
001900 SOURCE-COMPUTER.                        IBM-3090.                00190002
002000 OBJECT-COMPUTER.                        IBM-3090.                00200002
002100 INPUT-OUTPUT SECTION.                                            00210002
002200 FILE-CONTROL.                                                    00220002
002300                                                                  00230002
002400     SELECT EXTRACT-FILE                                          00240002
002500         ASSIGN TO INP01.                                         00250002
002600                                                                  00260002
002700     SELECT REPORT-FILE-1                                         00270002
002800         ASSIGN TO RPT01.                                         00280002
002900/                                                                 00290003
003000***************************************************************** 00300002
003100 DATA DIVISION.                                                   00310002
003200***************************************************************** 00320002
003300 FILE SECTION.                                                    00330002
003400                                                                  00340002
003500 FD  EXTRACT-FILE                                                 00350002
003600     RECORDING MODE IS F                                          00360002
003700     LABEL RECORDS ARE STANDARD                                   00370002
003800     BLOCK CONTAINS 0 RECORDS.                                    00380002
003900 01  EXTRACT-RECORD                   PIC X(600).                 00390003
004000                                                                  00400002
004100 FD  REPORT-FILE-1                                                00410002
004200     RECORDING MODE IS F                                          00420002
004300     BLOCK CONTAINS 0 RECORDS.                                    00430002
004400 01  REPORT-RECORD-1                  PIC X(132).                 00440002
004500                                                                  00450002
004600/                                                                 00460002
004700***************************************************************** 00470002
004800 WORKING-STORAGE SECTION.                                         00480002
004900***************************************************************** 00490002
005000                                                                  00500002
005100 01  PS-SWITCHES.                                                 00510002
005200     05  PS-PRINT-DETAILS-SW          PIC X(01) VALUE 'N'.        00520002
005300         88  PS-PRINT-DETAILS-NO                VALUE 'Y'.        00530002
005400         88  PS-PRINT-DETAILS                   VALUE 'N'.        00540002
005500     05  PS-END-OF-INPUT-FILE-SW      PIC X(01) VALUE 'N'.        00550002
005600         88  PS-END-OF-INPUT                    VALUE 'Y'.        00560002
005700         88  PS-NOT-END-OF-INPUT                VALUE 'N'.        00570002
005800     05  PS-PAGE-SW                   PIC X(01) VALUE 'N'.        00580002
005900         88  PS-NEW-PAGE                        VALUE 'Y'.        00590002
006000         88  PS-SAME-PAGE                       VALUE 'N'.        00600002
006100     05  PS-AUTO-RECEIVER-SW          PIC X(01) VALUE 'N'.        00610002
006200         88  PS-AUTO-RECEIVER                   VALUE 'Y'.        00620002
006300         88  PS-AUTO-RECEIVER-NO                VALUE 'N'.        00630002
006400                                                                  00640002
006500 01  DK-DB2-KEYS.                                                 00650002
006600     05  DK-RUN-DATE                  PIC X(10).                  00660002
006700     05  DK-WEEK-END-DATE             PIC X(10).                  00670002
006800     05  DK-OPER-ID                   PIC S9(4) COMP.             00680002
006900     05  DK-DB2-TMST-1                PIC X(26).                  00690002
007000     05  DK-DB2-TMST-2                PIC X(26).                  00700002
007100                                                                  00710002
007200 01  DN-NULL-INDICATORS.                                          00720002
007300     05  DN-LOC-NULL                  PIC S9(04) COMP VALUE ZERO. 00730002
007400     05  DN-CART-NULL                 PIC S9(04) COMP VALUE ZERO. 00740002
007500     05  DN-DOOR-NULL                 PIC S9(04) COMP VALUE ZERO. 00750002
007600                                                                  00760002
007700 01  PV-DATE-RECORD.                                              00770002
007800     05  PV-FROM-DATE                 PIC X(10) VALUE SPACES.     00780002
007900     05  FILLER                       PIC X(01) VALUE SPACES.     00790002
008000     05  PV-TO-DATE                   PIC X(10) VALUE SPACES.     00800002
008100                                                                  00810002
008200 01  SD-SYSTEM-DATE.                                              00820002
008300     05  SD-SYSTEM-DATE-YY          PIC  9(02)   VALUE ZERO.      00830002
008400     05  SD-SYSTEM-DATE-MM          PIC  9(02)   VALUE ZERO.      00840002
008500     05  SD-SYSTEM-DATE-DD          PIC  9(02)   VALUE ZERO.      00850002
008600                                                                  00860002
008700 01  ST-SYSTEM-TIME.                                              00870002
008800     05  ST-SYSTEM-HOUR             PIC  9(02)   VALUE ZERO.      00880002
008900     05  ST-SYSTEM-MINUTE           PIC  9(02)   VALUE ZERO.      00890002
009000     05  FILLER                     PIC  9(04)   VALUE ZERO.      00900002
009100                                                                  00910002
009200 01  PV-VARIABLES.                                                00920002
009300     05  PV-SCAN-OFF-TMST             PIC X(26).                  00930002
009400     05  PV-READ-COUNT                PIC S9(7) COMP-3            00940002
009500                                                VALUE ZERO.       00950002
009600     05  PV-FETCH-COUNT               PIC S9(7) COMP-3            00960002
009700                                                VALUE ZERO.       00970002
009800     05  PV-REC-READ-QTY              PIC S9(7) COMP-3            00980002
009900                                                VALUE ZERO.       00990002
010000     05  PV-WRITE-COUNT               PIC S9(7) COMP-3            01000002
010100                                                VALUE ZERO.       01010002
010200     05  PV-PAGE-COUNT                PIC S9(3) COMP-3            01020002
010300                                                VALUE ZERO.       01030002
010400     05  PV-LINE-COUNT                PIC S9(04) VALUE ZERO       01040002
010500                                                 COMP SYNC.       01050002
010600     05  PV-TRANS-QTY                 PIC S9(07) VALUE ZERO       01060002
010700                                                 COMP SYNC.       01070002
010800     05  PV-DC-TRANS-QTY              PIC S9(07) VALUE ZERO       01080002
010900                                                 COMP SYNC.       01090002
011000     05  PV-SCAN-ON-WRITTEN           PIC S9(09) VALUE ZERO       01100002
011100                                                 COMP SYNC.       01110002
011200                                                                  01120002
011300***************************************************************   01130002
011400     05  PV-TOTAL-DIVERTS            PIC S9(07) VALUE ZERO        01140002
011500                                                 COMP SYNC.       01150002
011600     05  PV-SHIPPING-DOOR             PIC S9(07) VALUE ZERO       01160002
011700                                                 COMP SYNC.       01170002
011800     05  PV-STORAGE-DOOR              PIC S9(07) VALUE ZERO       01180002
011900                                                 COMP SYNC.       01190002
012000     05  PV-SHUTTLE-DOOR              PIC S9(07) VALUE ZERO       01200002
012100                                                 COMP SYNC.       01210002
012200     05  PV-OTHER                     PIC S9(07) VALUE ZERO       01220002
012300                                                 COMP SYNC.       01230002
012400     05  PV-DUPLICATE-DIVERTS         PIC S9(07) VALUE ZERO       01240002
012500                                                 COMP SYNC.       01250002
012600     05  PV-NO-INFO-DIVERTS           PIC S9(07) VALUE ZERO       01260002
012700                                                 COMP SYNC.       01270002
012800     05  PV-INACTIVE-DIVERTS          PIC S9(07) VALUE ZERO       01280002
012900                                                 COMP SYNC.       01290002
013000                                                                  01300002
013100***************************************************************   01310002
013200     05  PV-DISPLAY-COUNT             PIC ZZZ,ZZZ,ZZ9.            01320002
013300     05  PV-PO-NBR                    PIC S9(09) COMP.            01330002
013400     05  PV-REC-SEQ-NBR               PIC S9(09) COMP.            01340002
013500     05  PV-PREV-OPER                 PIC 9(09) VALUE ZERO.       01350006
013600     05  PV-PREV-REC-SEQ-NBR          PIC 9(05) VALUE ZERO.       01360002
013700     05  PV-PREV-TRBL-RSN-CDE         PIC 9(04) VALUE ZERO.       01370007
013800     05  PV-OPER-UNT-ID               PIC 9(09) VALUE ZERO.       01380002
013900                                                                  01390002
014000     05  PV-DB2-FUNCTION              PIC X(30) VALUE SPACES.     01400002
014100     05  PV-DB2-TABLE-NAME            PIC X(30) VALUE SPACES.     01410002
014200     05  PV-PARAGRAPH                 PIC X(30) VALUE SPACES.     01420002
014300     05  PV-DISPLAY-HOST-VAR          PIC X(18) VALUE SPACES.     01430002
014400     05  PV-DISP-NUMBER               PIC Z,ZZZ,ZZ9.              01440002
014500                                                                  01450002
014600     05  PV-RUN-DATE                  PIC X(10) VALUE SPACES.     01460002
014700     05  PV-SAVE-START-DATE           PIC X(10) VALUE SPACES.     01470002
014800     05  PV-ERROR-MESSAGE-1           PIC X(60) VALUE SPACES.     01480002
014900     05  PV-ERROR-MESSAGE-2           PIC X(60) VALUE SPACES.     01490002
015000     05  PV-DB2-YEAR                  PIC S9(08) COMP             01500002
015100                                          VALUE ZERO.             01510002
015200     05  PV-DB2-MONTH                 PIC S9(08) COMP             01520002
015300                                          VALUE ZERO.             01530002
015400     05  PV-DB2-DAY                   PIC S9(08) COMP             01540002
015500                                          VALUE ZERO.             01550002
015600     05  PV-DB2-HOUR                  PIC S9(08) COMP             01560002
015700                                          VALUE ZERO.             01570002
015800     05  PV-DB2-MINUTE                PIC S9(08) COMP             01580002
015900                                          VALUE ZERO.             01590002
016000     05  PV-DB2-SECOND                PIC S9(08) COMP             01600002
016100                                          VALUE ZERO.             01610002
016200                                                                  01620002
016300     05  PV-DIVIDEND                  PIC 9(03)V9999.             01630002
016400                                                                  01640002
016500     05  PV-LOCATION-TOTALS.                                      01650019
016600         10  PV-TOT-CARTONS-LOC         PIC S9(07)  VALUE ZERO.   01660019
016700     05  PV-FINAL-TOTALS.                                         01670019
016800         10  PV-TOT-CARTONS-ALL-LOC     PIC S9(07)  VALUE ZERO.   01680019
016900                                                                  01690019
017000******************************************************************01700002
017100 01  PV-DATE-FIELD.                                               01710002
017200     05  PV-DB2-TMST.                                             01720002
017300         10 PV-DB2-TMST-CCYY          PIC  9(04).                 01730002
017400         10 FILLER                    PIC  X(01).                 01740002
017500         10 PV-DB2-TMST-MM            PIC  9(02).                 01750002
017600         10 FILLER                    PIC  X(01).                 01760002
017700         10 PV-DB2-TMST-DD            PIC  9(02).                 01770002
017800         10 FILLER                    PIC  X(01).                 01780002
017900         10 PV-DB2-TMST-HH            PIC  9(02).                 01790002
018000         10 FILLER                    PIC  X(01).                 01800002
018100         10 PV-DB2-TMST-MN            PIC  9(02).                 01810002
018200         10 FILLER                    PIC  X(01).                 01820002
018300         10 PV-DB2-TMST-SS            PIC  9(02).                 01830002
018400         10 FILLER                    PIC  X(07).                 01840002
018500     05  PV-FORMAT-DATE.                                          01850002
018600         10 PV-FORMAT-DATE-MM         PIC  9(02).                 01860002
018700         10 FILLER                    PIC  X(01) VALUE '/'.       01870002
018800         10 PV-FORMAT-DATE-DD         PIC  9(02).                 01880002
018900         10 FILLER                    PIC  X(01) VALUE '/'.       01890002
019000         10 PV-FORMAT-DATE-YY         PIC  9(02).                 01900010
019100                                                                  01910002
019200     05  PV-DB2-TMST-1.                                           01920002
019300         10  PV-DB2-DATE-1                PIC X(10) VALUE SPACES. 01930002
019400         10  FILLER                       PIC X(16) VALUE         01940002
019500                              '-00.00.00.000000'.                 01950002
019600     05  PV-DB2-TMST-2.                                           01960002
019700         10  PV-DB2-DATE-2                PIC X(10) VALUE SPACES. 01970002
019800         10  FILLER                       PIC X(16) VALUE         01980002
019900                              '-23.59.59.999999'.                 01990002
020000     05  PV-DB2-DATE.                                             02000010
020100         10  PV-DB2-DATE-CC          PIC X(02) VALUE ZERO.        02010010
020200         10  PV-DB2-DATE-YY          PIC X(02) VALUE ZERO.        02020010
020300         10  FILLER                  PIC X(01) VALUE ZERO.        02030010
020400         10  PV-DB2-DATE-MM          PIC X(02) VALUE ZERO.        02040010
020500         10  FILLER                  PIC X(01) VALUE ZERO.        02050010
020600         10  PV-DB2-DATE-DD          PIC X(02) VALUE ZERO.        02060010
020700                                                                  02070002
020800                                                                  02080002
020900 01  PV-ABEND-FIELDS.                                             02090002
021000     05  PV-ABEND-CODE                PIC S9(04) VALUE +0         02100002
021100                                                 COMP SYNC.       02110002
021200     05  PV-ABEND-PROGRAM             PIC  X(08) VALUE 'SUKUT045'.02120003
021300     05  PV-ABEND-PARAGRAPH           PIC  X(50) VALUE SPACES.    02130002
021400     05  PV-ABEND-OPERATION           PIC  X(51) VALUE SPACES.    02140002
021500     05  PV-ABEND-STRUCTURE-1         PIC X(8)   VALUE SPACES.    02150002
021600     05  PV-ABEND-STRUCTURE-2         PIC X(8)   VALUE SPACES.    02160002
021700     05  PV-ABEND-STRUCTURE-3         PIC X(8)   VALUE SPACES.    02170002
021800     05  PV-DB2-OPERATION-MESSAGE-1   PIC  X(79) VALUE SPACES.    02180002
021900     05  PV-DB2-OPERATION-MESSAGE-2   PIC  X(79) VALUE SPACES.    02190002
022000     05  PV-DB2-OPERATION-MESSAGE-3   PIC  X(79) VALUE SPACES.    02200002
022100     05  PV-DB2-OPERATION-ATTEMPTED   PIC  X(30)  VALUE SPACE.    02210002
022200/                                                                 02220002
022300 01  PC-CONSTANTS.                                                02230002
022400     05  PC-SUKRP045                  PIC X(08) VALUE 'SUKRP045'. 02240003
022500     05  PC-CURRENT-PROGRAM-NAME      PIC X(08) VALUE 'SUKRP045'. 02250003
022600     05  PC-END-OF-PAGE               PIC S9(3) COMP-3 VALUE +60. 02260002
022700     05  PC-MAX-LINE-COUNT            PIC S9(3) VALUE +60         02270002
022800                                                COMP-3.           02280002
022900/                                                                 02290002
023000******************************************************************02300002
023100*  WORK FIELDS FOR PRINTING A 132 CHARACTER REPORT.               02310002
023200******************************************************************02320002
023300     COPY DPWS132O.                                               02330002
023400*                                                                 02340002
023500 01  HL-HEADING-LINE-1.                                           02350002
023600     05  FILLER                      PIC  X(50).                  02360018
023700     05  FILLER                      PIC  X(33)  VALUE            02370018
023800      'DAILY - NOT SCANNED DETAIL REPORT'.                        02380018
023900     05  FILLER                      PIC  X(49).                  02390018
024000                                                                  02400002
024100 01  HL-HEADING-LINE-2.                                           02410003
024200     05  FILLER                      PIC  X(103).                 02420003
024300     05  FILLER                      PIC  X(10)  VALUE            02430006
024400            'PROCESSING'.                                         02440003
024500     05  FILLER                      PIC  X(05).                  02450003
024600     05  FILLER                      PIC  X(06)  VALUE            02460003
024700            'IMPORT'.                                             02470003
024800     05  FILLER                      PIC  X(02).                  02480003
024900                                                                  02490003
025000 01  HL-HEADING-LINE-3.                                           02500003
025100     05  FILLER                      PIC  X(06).                  02510003
025200     05  FILLER                      PIC  X(06)  VALUE            02520003
025300            'LOOKUP'.                                             02530003
025400     05  FILLER                      PIC  X(11).                  02540003
025500     05  FILLER                      PIC  X(14)  VALUE            02550003
025600            'PO INFORMATION'.                                     02560003
025700     05  FILLER                      PIC  X(12).                  02570003
025800     05  FILLER                      PIC  X(20)  VALUE            02580003
025900            'RESEARCH INFORMATION'.                               02590003
026000     05  FILLER                      PIC  X(11).                  02600003
026100     05  FILLER                      PIC  X(19)  VALUE            02610003
026200            'CONTACT INFORMATION'.                                02620003
026300     05  FILLER                      PIC  X(03).                  02630003
026400     05  FILLER                      PIC  X(11)  VALUE            02640003
026500            'INFORMATION'.                                        02650003
026600     05  FILLER                      PIC  X(04).                  02660010
026700     05  FILLER                      PIC  X(11)  VALUE            02670010
026800            'INFORMATION'.                                        02680010
026900     05  FILLER                      PIC  X(04).                  02690002
027000                                                                  02700002
027100 01  HL-HEADING-LINE-4.                                           02710003
027200     05  FILLER                      PIC  X(20)  VALUE            02720003
027300            '--------------------'.                               02730010
027400     05  FILLER                      PIC  X(01).                  02740003
027500     05  FILLER                      PIC  X(19)  VALUE            02750010
027600            '-------------------'.                                02760010
027700     05  FILLER                      PIC  X(01).                  02770003
027800     05  FILLER                      PIC  X(37)  VALUE            02780010
027900            '-------------------------------------'.              02790010
028000     05  FILLER                      PIC  X(01).                  02800003
028100     05  FILLER                      PIC  X(21)  VALUE            02810010
028200            '---------------------'.                              02820010
028300     05  FILLER                      PIC  X(01).                  02830003
028400     05  FILLER                      PIC  X(12)  VALUE            02840004
028500            '----------- '.                                       02850006
028600     05  FILLER                      PIC  X(01).                  02860003
028700     05  FILLER                      PIC  X(18)  VALUE            02870003
028800            '-----------------'.                                  02880006
028900     05  FILLER                      PIC  X(04).                  02890003
029000                                                                  02900003
029100 01  HL-HEADING-LINE-5.                                           02910004
029200     05  FILLER                      PIC  X(82).                  02920016
029300     05  FILLER                      PIC  X(03)  VALUE            02930014
029400            'SML'.                                                02940015
029500     05  FILLER                      PIC  X(03).                  02950016
029600     05  FILLER                      PIC  X(01)  VALUE            02960004
029700            'S'.                                                  02970004
029800     05  FILLER                      PIC  X(12).                  02980004
029900     05  FILLER                      PIC  X(04)  VALUE            02990004
030000            'VND '.                                               03000004
030100     05  FILLER                      PIC  X(04)  VALUE            03010004
030200            'ASN '.                                               03020004
030300     05  FILLER                      PIC  X(03)  VALUE            03030004
030400            'PR '.                                                03040004
030500     05  FILLER                      PIC  X(04).                  03050010
030600     05  FILLER                      PIC  X(06)  VALUE            03060004
030700            'ENT   '.                                             03070004
030800     05  FILLER                      PIC  X(03)  VALUE            03080004
030900            'ENT'.                                                03090004
031000     05  FILLER                      PIC  X(02).                  03100003
031100                                                                  03110002
031200 01  HL-HEADING-LINE-6.                                           03120004
031300     05  FILLER                      PIC  X(21).                  03130004
031400     05  FILLER                      PIC  X(03)  VALUE            03140004
031500            'PO '.                                                03150004
031600     05  FILLER                      PIC  X(04)  VALUE            03160004
031700            'P   '.                                               03170004
031800     05  FILLER                      PIC  X(06)  VALUE            03180006
031900            'VENDOR'.                                             03190004
032000     05  FILLER                      PIC  X(07).                  03200004
032100     05  FILLER                      PIC  X(07)  VALUE            03210004
032200            'CRTN   '.                                            03220004
032300     05  FILLER                      PIC  X(07)  VALUE            03230006
032400            'TROUBLE'.                                            03240004
032500     05  FILLER                      PIC  X(25).                  03250013
032600     05  FILLER                      PIC  X(06)  VALUE            03260013
032700            'CREATE'.                                             03270013
032800     05  FILLER                      PIC  X(02).                  03280013
032900     05  FILLER                      PIC  X(05)  VALUE            03290013
033000            'H    '.                                              03300013
033100     05  FILLER                      PIC  X(08)  VALUE            03310013
033200            'NAME    '.                                           03320013
033300     05  FILLER                      PIC  X(04)  VALUE            03330013
033400            'ASN '.                                               03340013
033500     05  FILLER                      PIC  X(04)  VALUE            03350013
033600            'CTN '.                                               03360013
033700     05  FILLER                      PIC  X(03)  VALUE            03370013
033800            'QC '.                                                03380013
033900     05  FILLER                      PIC  X(03)  VALUE            03390013
034000            'MX '.                                                03400013
034100     05  FILLER                      PIC  X(03)  VALUE            03410013
034200            'ID '.                                                03420013
034300     05  FILLER                      PIC  X(03)  VALUE            03430013
034400            'OF '.                                                03440013
034500     05  FILLER                      PIC  X(03)  VALUE            03450013
034600            'ID '.                                                03460013
034700     05  FILLER                      PIC  X(03)  VALUE            03470013
034800            'OF '.                                                03480013
034900     05  FILLER                      PIC  X(04).                  03490013
035000                                                                  03500013
035100 01  HL-HEADING-LINE-7.                                           03510013
035200     05  FILLER                      PIC  X(01).                  03520013
035300     05  FILLER                      PIC  X(03)  VALUE            03530031
035400            'DC '.                                                03540031
035500     05  FILLER                      PIC  X(05).                  03550031
035600     05  FILLER                      PIC  X(07)  VALUE            03560010
035700            'PO     '.                                            03570010
035800     05  FILLER                      PIC  X(05)  VALUE            03580003
035900            'REC  '.                                              03590003
036000     05  FILLER                      PIC  X(03)  VALUE            03600003
036100            'TY '.                                                03610003
036200     05  FILLER                      PIC  X(05)  VALUE            03620010
036300            'K    '.                                              03630010
036400     05  FILLER                      PIC  X(08)  VALUE            03640010
036500            'NAME    '.                                           03650010
036600     05  FILLER                      PIC  X(04)  VALUE            03660003
036700            'DPT '.                                               03670003
036800     05  FILLER                      PIC  X(08)  VALUE            03680003
036900            'CNT  *  '.                                           03690010
037000     05  FILLER                      PIC  X(12)  VALUE            03700034
037100            'NOTES    *  '.                                       03710035
037200     05  FILLER                      PIC  X(16)  VALUE            03720003
037300            'DC COMMENTS TEXT'.                                   03730003
037400     05  FILLER                      PIC  X(05).                  03740003
037500     05  FILLER                      PIC  X(06)  VALUE            03750010
037600            'DATE  '.                                             03760010
037700     05  FILLER                      PIC  X(04)  VALUE            03770003
037800            'F   '.                                               03780003
037900     05  FILLER                      PIC  X(09)  VALUE            03790003
038000            'ON REC   '.                                          03800003
038100     05  FILLER                      PIC  X(04)  VALUE            03810003
038200            'PRD '.                                               03820003
038300     05  FILLER                      PIC  X(04)  VALUE            03830003
038400            'DAT '.                                               03840003
038500     05  FILLER                      PIC  X(03)  VALUE            03850003
038600            'AU '.                                                03860003
038700     05  FILLER                      PIC  X(03)  VALUE            03870003
038800            'SK '.                                                03880003
038900     05  FILLER                      PIC  X(06)  VALUE            03890003
039000            'PARNT '.                                             03900003
039100     05  FILLER                      PIC  X(06)  VALUE            03910003
039200            'FACTR '.                                             03920003
039300     05  FILLER                      PIC  X(05)  VALUE            03930003
039400            'DECN '.                                              03940003
039500     05  FILLER                      PIC  X(02).                  03950003
039600                                                                  03960003
039700 01  HL-HEADING-LINE-8.                                           03970004
039800     05  FILLER                      PIC  X(21)  VALUE            03980004
039900            '----  --------- ---- '.                              03990006
040000     05  FILLER                      PIC  X(20)  VALUE            04000004
040100            '-- - ---------- --- '.                               04010006
040200     05  FILLER                      PIC  X(38)  VALUE            04020010
040300            '----  ---------- -------------------- '.             04030010
040400     05  FILLER                      PIC  X(22)  VALUE            04040010
040500            '-------- - ---------- '.                             04050010
040600     05  FILLER                      PIC  X(14)  VALUE            04060006
040700            '--- --- -- -- '.                                     04070006
040800     05  FILLER                      PIC  X(17)  VALUE            04080004
040900            '----- ----- ---- '.                                  04090006
041000     05  FILLER                      PIC  X(04).                  04100004
041100                                                                  04110002
041200 01  DL-DETAIL-LINE-1.                                            04120002
041300     05  DL-DETAIL-L1.                                            04130002
041400        10  DL1-DC                       PIC Z(04) VALUE SPACES.  04140011
041500        10  FILLER                       PIC X(01) VALUE SPACES.  04150006
041600        10  DL1-PO                       PIC Z(09) VALUE SPACES.  04160011
041700        10  FILLER                       PIC X(02) VALUE SPACES.  04170032
041800        10  DL1-REC-SEQ-NBR              PIC Z(04) VALUE SPACES.  04180011
041900        10  FILLER                       PIC X(01) VALUE SPACES.  04190002
042000        10  DL1-PO-TYPE                  PIC X(02).               04200004
042100        10  FILLER                       PIC X(01) VALUE SPACES.  04210010
042200        10  DL1-PKGNG-CDE                PIC X(01).               04220006
042300        10  FILLER                       PIC X(01) VALUE SPACES.  04230010
042400        10  DL1-VENDOR-NAME              PIC X(10).               04240004
042500        10  FILLER                       PIC X(01) VALUE SPACES.  04250004
042600        10  DL1-DEPT                     PIC 9(03).               04260004
042700        10  FILLER                       PIC X(01) VALUE SPACES.  04270004
042800        10  DL1-CRTN-CNT                 PIC Z(04) VALUE SPACES.  04280011
042900        10  FILLER                       PIC X(01) VALUE SPACES.  04290006
043000        10  DL1-TRBL-MTPL-IND            PIC X(01).               04300006
043100        10  DL1-TROUBLE-NOTES            PIC X(10).               04310004
043200        10  FILLER                       PIC X(01) VALUE SPACES.  04320033
043300        10  DL1-DC-COMMENT-MTPL-IND      PIC X(01).               04330031
043400        10  DL1-DC-COMMENTS-TEXT         PIC X(19).               04340036
043500        10  FILLER                       PIC X(01) VALUE SPACES.  04350004
043600        10  DL1-DATE                     PIC X(08).               04360004
043700        10  FILLER                       PIC X(01) VALUE SPACES.  04370004
043800        10  DL1-SHIFT                    PIC 9(01).               04380004
043900        10  FILLER                       PIC X(01) VALUE SPACES.  04390004
044000        10  DL1-NAME-ON-REC              PIC X(10).               04400004
044100        10  FILLER                       PIC X(02) VALUE SPACES.  04410004
044200        10  DL1-VND-ASN-PRD              PIC X(01).               04420004
044300        10  FILLER                       PIC X(03) VALUE SPACES.  04430004
044400        10  DL1-ASN-CTN-DAT              PIC X(01).               04440004
044500        10  FILLER                       PIC X(03) VALUE SPACES.  04450004
044600        10  DL1-PR-QC-AU                 PIC X(01).               04460006
044700        10  FILLER                       PIC X(02) VALUE SPACES.  04470010
044800        10  DL1-MX-SK                    PIC X(01).               04480006
044900        10  FILLER                       PIC X(01) VALUE SPACES.  04490006
045000        10  DL1-ENT-ID-PARENT            PIC Z(05) VALUE SPACES.  04500011
045100        10  FILLER                       PIC X(01) VALUE SPACES.  04510004
045200        10  DL1-ENT-ID-FACTORY           PIC Z(05) VALUE SPACES.  04520011
045300        10  FILLER                       PIC X(01) VALUE SPACES.  04530004
045400        10  DL1-DECN                     PIC X(04).               04540006
045500                                                                  04550002
045600 01  TL-DC-CRTN-TOTAL-LINE.                                       04560019
045700     05  FILLER                       PIC X(06) VALUE SPACES.     04570022
045800     05  FILLER                       PIC X(16) VALUE             04580022
045900            'DC CARTON TOTALS'.                                   04590022
046000     05  FILLER                       PIC X(16) VALUE SPACES.     04600029
046100     05  TL-DC-CRTN-TOTALS            PIC ZZZ,ZZ9.                04610022
046200     05  FILLER                       PIC X(87) VALUE SPACES.     04620029
046300                                                                  04630002
046400 01  GT-ALL-DC-CRTN-TOTAL-LINE.                                   04640019
046500     05  FILLER                       PIC X(06) VALUE SPACES.     04650022
046600     05  FILLER                       PIC X(16) VALUE             04660022
046700            'CORPORATE TOTALS'.                                   04670022
046800     05  FILLER                       PIC X(16) VALUE SPACES.     04680029
046900     05  GT-ALL-DC-CRTN-TOTALS        PIC ZZZ,ZZ9.                04690022
047000     05  FILLER                       PIC X(87) VALUE SPACES.     04700029
047100                                                                  04710019
047200 01  ER-END-OF-REPORT-LINE.                                       04720019
047300     05  FILLER                       PIC X(19)  VALUE            04730019
047400         '** END OF REPORT **'.                                   04740019
047500     05  FILLER                       PIC X(113)  VALUE SPACES.   04750019
047600                                                                  04760019
047700 01  EP-EMPTY-REPORT-LINE.                                        04770019
047800     05  FILLER                       PIC X(34)  VALUE SPACES.    04780019
047900     05  FILLER                       PIC X(52)  VALUE            04790019
048000      '*************** EMPTY INPUT FILE *******************'.     04800019
048100     05  FILLER                       PIC X(49)  VALUE SPACES.    04810019
048200                                                                  04820019
048300 01  DL-BLANK-LINE                    PIC X(132) VALUE SPACES.    04830019
048400                                                                  04840019
048500 01  EL1-ERROR-LINE-1P.                                           04850019
048600     05  FILLER                      PIC  X(02)     VALUE SPACES. 04860019
048700     05  FILLER                      PIC  X(48)     VALUE         04870019
048800         'A PROBLEM WAS ENCOUNTERED DURING THE PROCESS OF '.      04880019
048900     05  FILLER                      PIC  X(49)     VALUE         04890019
049000         'CREATING YOUR REPORT.   THIS REPORT COULD NOT BE '.     04900019
049100     05  FILLER                      PIC  X(33)     VALUE         04910019
049200         'COMPLETED.                       '.                     04920019
049300                                                                  04930019
049400/                                                                 04940019
049500******************************************************************04950019
049600*  RECORD LAYOUT FOR INPUT FILE                                   04960019
049700******************************************************************04970019
049800     COPY SURD066.                                                04980019
049900/                                                                 04990019
050000******************************************************************05000019
050100*  COPYBOOK USED BY MBS SYSTEM                                    05010019
050200******************************************************************05020019
050300     COPY DPWS003.                                                05030019
050400*                                                                 05040019
050500******************************************************************05050019
050600*  WORKING STORAGE AREA FOR NAME REFORMAT DPPD024                 05060019
050700******************************************************************05070019
050800     COPY DPWS024.                                                05080019
050900/                                                                 05090019
051000******************************************************************05100019
051100*  DB2 FORMATTED MESSAGE AREA                                     05110019
051200******************************************************************05120019
051300     COPY DPWS004.                                                05130019
051400/                                                                 05140019
051500******************************************************************05150019
051600* CORPORATE DATE ROUTINES                                         05160019
051700******************************************************************05170019
051800     COPY DPWS500.                                                05180019
051900/                                                                 05190019
052000******************************************************************05200019
052100 PROCEDURE DIVISION.                                              05210019
052200******************************************************************05220019
052300 0000-MAINLINE.                                                   05230019
052400                                                                  05240019
052500     OPEN INPUT  EXTRACT-FILE                                     05250019
052600          OUTPUT REPORT-FILE-1.                                   05260019
052700                                                                  05270019
052800     PERFORM 2100-READ-EXTRACT.                                   05280019
052900     PERFORM 1000-INITIALIZE.                                     05290019
053000     IF PS-END-OF-INPUT                                           05300019
053100         PERFORM 1300-NO-DETAIL-LINE                              05310019
053200     ELSE                                                         05320019
053300         PERFORM 8000-WRITE-MAIN-HEADINGS                         05330019
053400         PERFORM 2000-PROCESS-EXTRACT                             05340019
053500             UNTIL PS-END-OF-INPUT                                05350019
053600     END-IF.                                                      05360019
053700                                                                  05370019
053800     IF PV-READ-COUNT > ZERO                                      05380020
053900        PERFORM 6500-FINAL-TOTALS                                 05390020
054000     END-IF                                                       05400020
054100                                                                  05410020
054200     PERFORM 9000-EOJ.                                            05420019
054300                                                                  05430019
054400     GOBACK.                                                      05440019
054500/                                                                 05450019
054600******************************************************************05460019
054700 1000-INITIALIZE.                                                 05470019
054800******************************************************************05480019
054900*                                                                 05490019
055000* LOAD SYSTEM DATE INTO HEADINGS                                  05500019
055100     ACCEPT SD-SYSTEM-DATE FROM DATE.                             05510019
055200     ACCEPT ST-SYSTEM-TIME FROM TIME.                             05520019
055300                                                                  05530019
055400     MOVE SD-SYSTEM-DATE-YY      TO DP132O-RUN-YEAR.              05540019
055500     MOVE SD-SYSTEM-DATE-MM      TO DP132O-RUN-MONTH.             05550019
055600     MOVE SD-SYSTEM-DATE-DD      TO DP132O-RUN-DAY.               05560019
055700     MOVE ST-SYSTEM-HOUR         TO DP132O-RUN-HOUR.              05570019
055800     MOVE ST-SYSTEM-MINUTE       TO DP132O-RUN-MINUTE.            05580019
055900                                                                  05590019
056000     MOVE PC-CURRENT-PROGRAM-NAME                                 05600019
056100                                 TO DP132O-PROGRAM-NAME.          05610019
056200     MOVE 1                      TO DP132O-REPORT-NUMBER          05620019
056300                                    DP132O-PAGE-NUMBER.           05630019
056400                                                                  05640019
056500     MOVE SU066-OPER-UNT-ID      TO PV-PREV-OPER.                 05650019
056600     MOVE SU066-TRBL-RSN-CDE     TO PV-PREV-TRBL-RSN-CDE.         05660019
056700                                                                  05670019
056800*                                                                 05680019
056900******************************************************************05690019
057000*  PRINT A 'NO INPUT' REPORT LINE.                                05700019
057100******************************************************************05710019
057200 1300-NO-DETAIL-LINE.                                             05720019
057300*                                                                 05730019
057400     PERFORM 8000-WRITE-MAIN-HEADINGS.                            05740019
057500                                                                  05750019
057600     WRITE REPORT-RECORD-1                                        05760019
057700       FROM EP-EMPTY-REPORT-LINE                                  05770019
057800         AFTER ADVANCING 3 LINES.                                 05780019
057900*                                                                 05790019
058000******************************************************************05800019
058100*  PRINT A BLANK LINE.                                            05810019
058200******************************************************************05820019
058300 1400-BLANK-LINE.                                                 05830019
058400*                                                                 05840019
058500     WRITE REPORT-RECORD-1                                        05850019
058600       FROM DL-BLANK-LINE                                         05860019
058700         AFTER ADVANCING 1 LINE.                                  05870019
058800     ADD 1                   TO PV-LINE-COUNT.                    05880019
058900*                                                                 05890019
059000******************************************************************05900019
059100 2000-PROCESS-EXTRACT.                                            05910019
059200******************************************************************05920019
059300*                                                                 05930019
059400     IF SU066-OPER-UNT-ID  = PV-PREV-OPER                         05940019
059500         IF SU066-TRBL-RSN-CDE  = PV-PREV-TRBL-RSN-CDE            05950019
059600            PERFORM 5500-BUILD-REPORT-ROW                         05960019
059700         ELSE                                                     05970019
059800            PERFORM 1400-BLANK-LINE                               05980019
059900            PERFORM 5500-BUILD-REPORT-ROW                         05990019
060000            MOVE SU066-TRBL-RSN-CDE    TO PV-PREV-TRBL-RSN-CDE    06000019
060100         END-IF                                                   06010019
060200     ELSE                                                         06020019
060300         PERFORM 6000-LOCATION-TOTALS                             06030023
060400         SET PS-NEW-PAGE TO TRUE                                  06040019
060500         PERFORM 8000-WRITE-MAIN-HEADINGS                         06050019
060600         PERFORM 5500-BUILD-REPORT-ROW                            06060019
060700                                                                  06070019
060800                                                                  06080019
060900         MOVE SU066-OPER-UNT-ID     TO PV-PREV-OPER               06090019
061000         MOVE SU066-TRBL-RSN-CDE    TO PV-PREV-TRBL-RSN-CDE       06100019
061100     END-IF.                                                      06110019
061200                                                                  06120019
061300     PERFORM 2100-READ-EXTRACT.                                   06130019
061400*                                                                 06140019
061500******************************************************************06150019
061600*  READ NEXT INPUT FILE RECORD.                                   06160019
061700******************************************************************06170019
061800 2100-READ-EXTRACT.                                               06180019
061900                                                                  06190019
062000     READ EXTRACT-FILE INTO SU066-RECORD                          06200019
062100        AT END                                                    06210019
062200           SET PS-END-OF-INPUT TO TRUE                            06220019
062300        NOT AT END                                                06230019
062400           ADD +1                   TO PV-READ-COUNT              06240019
062500     END-READ.                                                    06250019
062600*                                                                 06260019
062700******************************************************************06270019
062800*  PRINT DETAIL REPORT LINE.                                      06280019
062900******************************************************************06290019
063000 3000-PRINT-DETAILS.                                              06300019
063100*                                                                 06310019
063200*CHECK FOR OVERFLOW.                                              06320019
063300     ADD 1 TO PV-LINE-COUNT.                                      06330019
063400     IF PV-LINE-COUNT > PC-MAX-LINE-COUNT                         06340019
063500         SET PS-NEW-PAGE TO TRUE                                  06350019
063600         PERFORM 8000-WRITE-MAIN-HEADINGS                         06360019
063700     END-IF.                                                      06370019
063800                                                                  06380019
063900*IF NEW PAGE, DISPLAY WEEK-END DATE.                              06390019
064000     IF PS-NEW-PAGE                                               06400019
064100         SET PS-SAME-PAGE             TO TRUE                     06410019
064200     END-IF.                                                      06420019
064300                                                                  06430019
064400*WRITE DETAIL LINE.                                               06440019
064500             WRITE REPORT-RECORD-1                                06450019
064600               FROM DL-DETAIL-LINE-1                              06460019
064700                 AFTER ADVANCING 1 LINES.                         06470019
064800*                                                                 06480019
064900******************************************************************06490019
065000*  BUILD REPORT ROW.                                              06500019
065100******************************************************************06510019
065200 5500-BUILD-REPORT-ROW.                                           06520019
065300*                                                                 06530019
065400     MOVE SU066-OPER-UNT-ID         TO DL1-DC.                    06540019
065500     IF SU066-DC-COMMENT-MTPL-IND = 'Y'                           06550031
065600         MOVE '*'                   TO DL1-DC-COMMENT-MTPL-IND    06560031
065700     ELSE                                                         06570019
065800         MOVE SPACE                 TO DL1-DC-COMMENT-MTPL-IND    06580031
065900     END-IF.                                                      06590019
066000     MOVE SU066-PO-NBR              TO DL1-PO.                    06600019
066100     MOVE SU066-REC-SEQ-NBR         TO DL1-REC-SEQ-NBR.           06610019
066200     MOVE SU066-PO-TYP-CDE          TO DL1-PO-TYPE.               06620019
066300     MOVE SU066-PKGNG-CDE           TO DL1-PKGNG-CDE.             06630019
066400     MOVE SU066-ENT-NAME-DESC       TO DL1-VENDOR-NAME.           06640019
066500     MOVE SU066-DEPT-NBR            TO DL1-DEPT.                  06650019
066600                                                                  06660028
066700     MOVE SU066-CRTN-CNT            TO DL1-CRTN-CNT.              06670028
066800     ADD  SU066-CRTN-CNT            TO PV-TOT-CARTONS-LOC.        06680026
066900                                                                  06690026
067000     IF SU066-TRBL-MTPL-IND   = 'Y'                               06700019
067100         MOVE '*'                   TO DL1-TRBL-MTPL-IND          06710019
067200     ELSE                                                         06720019
067300         MOVE SPACE                 TO DL1-TRBL-MTPL-IND          06730019
067400     END-IF.                                                      06740019
067500     MOVE SU066-TRBL-SHT-DESC       TO DL1-TROUBLE-NOTES.         06750019
067600*LMM IF SU066-TRBL-RSN-CDE   = 802                                06760030
067700        MOVE SU066-FREEFORM-TEXT    TO DL1-DC-COMMENTS-TEXT       06770019
067800*    ELSE                                                         06780030
067900*        MOVE SPACE                 TO DL1-DC-COMMENTS-TEXT       06790030
068000*    END-IF.                                                      06800030
068100     MOVE SU066-CRE-DTE             TO PV-DB2-DATE.               06810019
068200     MOVE PV-DB2-DATE-YY            TO PV-FORMAT-DATE-YY.         06820019
068300     MOVE PV-DB2-DATE-MM            TO PV-FORMAT-DATE-MM.         06830019
068400     MOVE PV-DB2-DATE-DD            TO PV-FORMAT-DATE-DD.         06840019
068500     MOVE PV-FORMAT-DATE            TO DL1-DATE.                  06850019
068600                                                                  06860019
068700     MOVE SU066-SHFT-NBR            TO DL1-SHIFT.                 06870019
068800     MOVE SU066-COMBINED-NAME       TO DL1-NAME-ON-REC.           06880019
068900     MOVE SU066-VND-ASN-PRD-SW      TO DL1-VND-ASN-PRD.           06890019
069000     MOVE SU066-ASN-CTN-DAT-SW      TO DL1-ASN-CTN-DAT.           06900019
069100     MOVE SU066-PR-QC-AU-SW         TO DL1-PR-QC-AU.              06910019
069200     MOVE SU066-MX-SK-SW            TO DL1-MX-SK.                 06920019
069300     MOVE SU066-IMPRT-VND-ID        TO DL1-ENT-ID-PARENT.         06930019
069400     MOVE SU066-IMPRT-FCTRY-ID      TO DL1-ENT-ID-FACTORY.        06940019
069500     MOVE SU066-DECN-SCAC-CDE       TO DL1-DECN.                  06950019
069600                                                                  06960019
069700     PERFORM 3000-PRINT-DETAILS.                                  06970019
069800*                                                                 06980019
070600******************************************************************07060019
070700*  WRITE DC CARTON TOTALS.                                        07070019
070800******************************************************************07080019
070900 6000-LOCATION-TOTALS.                                            07090019
071000*                                                                 07100019
071100     MOVE PV-TOT-CARTONS-LOC          TO TL-DC-CRTN-TOTALS        07110019
071200                                                                  07120019
071300     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     07130021
071400        AFTER ADVANCING 1 LINES.                                  07140019
071500                                                                  07150019
071600     WRITE REPORT-RECORD-1 FROM TL-DC-CRTN-TOTAL-LINE             07160021
071700         AFTER ADVANCING 2 LINES.                                 07170019
071800                                                                  07180027
071900     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     07190027
072000        AFTER ADVANCING 1 LINES.                                  07200027
072100                                                                  07210027
072200     ADD 4                            TO PV-LINE-COUNT            07220027
072300     ADD PV-TOT-CARTONS-LOC           TO PV-TOT-CARTONS-ALL-LOC   07230019
072400     INITIALIZE PV-LOCATION-TOTALS.                               07240019
072500*                                                                 07250019
072600*                                                                 07260019
072700 6500-FINAL-TOTALS.                                               07270019
072800     PERFORM 6000-LOCATION-TOTALS.                                07280024
072900     MOVE PV-TOT-CARTONS-ALL-LOC      TO GT-ALL-DC-CRTN-TOTALS    07290019
073000                                                                  07300019
073100     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     07310021
073200        AFTER ADVANCING 1 LINES.                                  07320019
073300                                                                  07330019
073400     WRITE REPORT-RECORD-1 FROM GT-ALL-DC-CRTN-TOTAL-LINE         07340021
073500         AFTER ADVANCING 2 LINES.                                 07350019
073600     ADD 2                            TO PV-LINE-COUNT.           07360021
073700*                                                                 07370019
073800*                                                                 07380019
073900******************************************************************07390019
074000 8000-WRITE-MAIN-HEADINGS.                                        07400019
074100******************************************************************07410019
074200*                                                                 07420019
074300     ADD 1                         TO PV-PAGE-COUNT.              07430019
074400     MOVE PV-PAGE-COUNT            TO DP132O-PAGE-NUMBER.         07440019
074500     MOVE ZERO                     TO PV-LINE-COUNT.              07450019
074600                                                                  07460019
074700     WRITE REPORT-RECORD-1 FROM                                   07470019
074800         DP132O-STANDRD-HEADER-132-COLS                           07480019
074900         AFTER ADVANCING PAGE.                                    07490019
075000                                                                  07500019
075100     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     07510019
075200         AFTER ADVANCING 1 LINE                                   07520019
075300                                                                  07530019
075400     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-1                 07540019
075500        AFTER ADVANCING 1 LINES.                                  07550019
075600                                                                  07560019
075700     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     07570019
075800         AFTER ADVANCING 1 LINE                                   07580019
075900                                                                  07590019
076000     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-2                 07600019
076100        AFTER ADVANCING 1 LINES.                                  07610019
076200                                                                  07620019
076300     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-3                 07630019
076400        AFTER ADVANCING 1 LINES.                                  07640019
076500                                                                  07650019
076600     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-4                 07660019
076700        AFTER ADVANCING 1 LINES.                                  07670019
076800                                                                  07680019
076900     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-5                 07690019
077000        AFTER ADVANCING 1 LINES.                                  07700019
077100                                                                  07710019
077200     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-6                 07720019
077300        AFTER ADVANCING 1 LINES.                                  07730019
077400                                                                  07740019
077500     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-7                 07750019
077600        AFTER ADVANCING 1 LINES.                                  07760019
077700                                                                  07770019
077800     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-8                 07780019
077900        AFTER ADVANCING 1 LINES.                                  07790019
078000                                                                  07800019
078100     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     07810019
078200         AFTER ADVANCING 1 LINE                                   07820019
078300                                                                  07830019
078400     ADD 11                           TO PV-LINE-COUNT.           07840019
078500*                                                                 07850019
078600******************************************************************07860019
078700 9000-EOJ.                                                        07870019
078800******************************************************************07880019
078900*                                                                 07890019
079000     WRITE REPORT-RECORD-1 FROM ER-END-OF-REPORT-LINE             07900019
079100        AFTER ADVANCING 2 LINES                                   07910019
079200                                                                  07920019
079300*CLOSE FILES.                                                     07930019
079400     CLOSE EXTRACT-FILE                                           07940019
079500                                                                  07950019
079600     CLOSE REPORT-FILE-1                                          07960019
079700                                                                  07970019
079800                                                                  07980019
079900     MOVE PV-READ-COUNT      TO PV-DISPLAY-COUNT.                 07990019
080000     DISPLAY 'TOTAL INPUT RECORDS READ ' PV-DISPLAY-COUNT.        08000019
080100                                                                  08010019
080300*                                                                 08030019
