000100***************************************************************** 00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300 PROGRAM-ID.             SUKRP072.                                00030000
000400 AUTHOR.                 DENISE HAHN.                             00040000
000500 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00050000
000600 DATE-WRITTEN.           JULY, 2015.                              00060000
000700 DATE-COMPILED.                                                   00070000
000800***************************************************************** 00080000
000900*                                                               * 00090000
001000*  SHIPPING SUMMARY TRAILER REPORT - DC LEVEL                   * 00100000
001100*                                                               * 00110000
001200*  INPUT FILE IS CREATED BY SUKRP071 - SURD129                  * 00120000
001300*                                                               * 00130000
001400***************************************************************** 00140000
001500 ENVIRONMENT DIVISION.                                            00150000
001600 CONFIGURATION SECTION.                                           00160000
001700                                                                  00170000
001800 SOURCE-COMPUTER.        IBM-3090.                                00180000
001900 OBJECT-COMPUTER.        IBM-3090.                                00190000
002000                                                                  00200000
002100***************************************************************** 00210000
002200 INPUT-OUTPUT SECTION.                                            00220000
002300                                                                  00230000
002400 FILE-CONTROL.                                                    00240000
002500                                                                  00250000
002600     SELECT INPUT-FILE                                            00260000
002700         ASSIGN TO INP01.                                         00270000
002800                                                                  00280000
002900     SELECT CONTROL-FILE                                          00290000
003000         ASSIGN TO INP02.                                         00300000
003100                                                                  00310000
003110     SELECT SELECTION-FILE                                        00311096
003120         ASSIGN TO INP03.                                         00312096
003130                                                                  00313096
003200     SELECT REPORT-FILE                                           00320000
003300         ASSIGN TO RPT01.                                         00330000
003301                                                                  00330119
003310     SELECT OUTPUT-FILE                                           00331019
003320         ASSIGN TO OUT01.                                         00332019
003330                                                                  00333019
003430                                                                  00343000
003440***************************************************************** 00344000
003450 DATA DIVISION.                                                   00345000
003460***************************************************************** 00346000
003470 FILE SECTION.                                                    00347000
003480                                                                  00348000
003490 FD  INPUT-FILE                                                   00349000
003500     RECORDING MODE IS F                                          00350000
003600     LABEL RECORDS ARE STANDARD                                   00360000
003700     BLOCK CONTAINS 0 RECORDS.                                    00370000
003800 01  INPUT-RECORD                    PIC  X(600).                 00380000
003900                                                                  00390000
004000 FD  CONTROL-FILE                                                 00400000
004100     RECORDING MODE IS F                                          00410000
004200     LABEL RECORDS ARE STANDARD                                   00420000
004300     BLOCK CONTAINS 0 RECORDS.                                    00430000
004400 01  CONTROL-RECORD                  PIC  X(80).                  00440000
004500                                                                  00450000
004510 FD  SELECTION-FILE                                               00451096
004520     RECORDING MODE IS F                                          00452096
004530     LABEL RECORDS ARE STANDARD                                   00453096
004540     BLOCK CONTAINS 0 RECORDS.                                    00454096
004550 01  SELECTION-RECORD                PIC  X(80).                  00455096
004560                                                                  00456096
004600 FD  REPORT-FILE                                                  00460000
004700     RECORDING MODE IS F                                          00470000
004800     BLOCK CONTAINS 0  RECORDS.                                   00480000
004900 01  REPORT-RECORD                   PIC X(150).                  00490000
004901                                                                  00490119
004910 FD  OUTPUT-FILE                                                  00491019
004920     RECORDING MODE IS F                                          00492019
004930     LABEL RECORDS ARE STANDARD                                   00493019
004940     BLOCK CONTAINS 0 RECORDS.                                    00494019
004950 01  OUTPUT-RECORD                   PIC  X(1300).                00495025
004960                                                                  00496019
005000                                                                  00500000
005050                                                                  00505000
005060***************************************************************** 00506000
005070 WORKING-STORAGE SECTION.                                         00507000
005080                                                                  00508000
005090 01  PROGRAM-SWITCHES.                                            00509000
005100     05  PS-END-OF-INPUT-FILE-SW     PIC X(01) VALUE 'N'.         00510000
005200         88  PS-END-OF-INPUT                   VALUE 'Y'.         00520000
005300         88  PS-NOT-END-OF-INPUT               VALUE 'N'.         00530000
005400                                                                  00540000
005500 01  PC-PROGRAM-CONSTANTS.                                        00550000
005600     05  PC-SUKRP072                 PIC X(08) VALUE              00560000
005700                                               'SUKRP072'.        00570000
005800     05  PC-REPORT-NBR               PIC X(02) VALUE '-1'.        00580000
005900     05  PC-MAX-LINE-COUNT           PIC S9(3) VALUE +60          00590000
006000                                               COMP-3.            00600000
006100     05  PC-DEFAULT-TMST             PIC X(26)  VALUE             00610000
006200                                    '9999-09-09-09.09.09.999999'. 00620000
006300     05  PC-SLASH                    PIC X(01) VALUE '/'.         00630000
006400     05  PC-DASH                     PIC X(01) VALUE '-'.         00640000
006500                                                                  00650000
006600 01  SD-DATE-TIME.                                                00660000
006700     05  SD-SYSTEM-DATE.                                          00670000
006800         10  SD-SYSTEM-DATE-YY       PIC 9(02) VALUE ZERO.        00680000
006900         10  SD-SYSTEM-DATE-MM       PIC 9(02) VALUE ZERO.        00690000
007000         10  SD-SYSTEM-DATE-DD       PIC 9(02) VALUE ZERO.        00700000
007100     05  SD-SYSTEM-TIME.                                          00710000
007200         10  SD-SYSTEM-TIME-HH       PIC 9(02) VALUE ZERO.        00720000
007300         10  SD-SYSTEM-TIME-MM       PIC 9(02) VALUE ZERO.        00730000
007400         10  SD-SYSTEM-TIME-SS       PIC 9(02) VALUE ZERO.        00740000
007500         10  FILLER                  PIC 9(02) VALUE ZERO.        00750000
007600                                                                  00760000
007700 01  PV-PROGRAM-VARIABLES.                                        00770000
007800     05  PV-READ-COUNT                PIC S9(7) COMP-3            00780000
007900                                                VALUE ZERO.       00790000
008000     05  PV-WRITE-COUNT               PIC S9(7) COMP-3            00800000
008100                                                VALUE ZERO.       00810000
008200     05  PV-NULL-IND                 PIC S9(04) VALUE +0          00820000
008300                                               COMP SYNC.         00830000
008400     05  PV-FORMAT-DATE.                                          00840000
008500         10 PV-FORMAT-DATE-MM         PIC  9(02).                 00850000
008600         10 FILLER                    PIC  X(01) VALUE '/'.       00860000
008700         10 PV-FORMAT-DATE-DD         PIC  9(02).                 00870000
008800         10 FILLER                    PIC  X(01) VALUE '/'.       00880000
008900         10 PV-FORMAT-DATE-CCYY       PIC  9(04).                 00890000
009000                                                                  00900000
009100     05  PV-SQLCODE                  PIC  999- VALUE ZERO.        00910019
009110     05  PV-DISP-OPER                PIC ZZZ9  VALUE ZERO.        00911019
009120     05  PV-DISP-TRIP                PIC Z(09) VALUE ZERO.        00912088
009200     05  PV-PAGE-COUNT               PIC S9(4) VALUE ZERO         00920000
009300                                               COMP-3.            00930000
009400     05  PV-LINE-COUNT               PIC S9(3) VALUE ZERO         00940000
009500                                               COMP-3.            00950000
009510     05  PV-DC-COUNT                 PIC S9(3) VALUE ZERO         00951003
009520                                               COMP-3.            00952003
009600     05  PV-LINES-ON-PAGE            PIC  9(3) VALUE 60.          00960095
009610     05  PV-DC-ON-PAGE               PIC  9(3) VALUE 4.           00961093
009700                                                                  00970000
009800     05  PV-PREV-TRIP-ID             PIC S9(09) COMP.             00980000
009900     05  PV-PREV-OPER                PIC S9(04) COMP.             00990000
010000     05  PV-PREV-SOURCE              PIC  X(03).                  01000013
010010     05  PV-PREV-SEQ                 PIC  9(02).                  01001036
010100                                                                  01010000
010200     05  PV-TODAYS-DATE.                                          01020000
010300         10  PV-TODAYS-DATE-YY       PIC 9(02) VALUE ZERO.        01030000
010400         10  PV-TODAYS-DATE-MM       PIC 9(02) VALUE ZERO.        01040000
010500         10  PV-TODAYS-DATE-DD       PIC 9(02) VALUE ZERO.        01050000
010600     05  PV-TODAYS-DATE-YYYY.                                     01060000
010700         10  PV-TODAYS-DATE-CC       PIC 9(02) VALUE 20.          01070000
010800         10  PV-TODAYS-DATE-Y2       PIC 9(02) VALUE ZERO.        01080000
010900                                                                  01090000
011000     05  PV-TODAYS-TIME.                                          01100000
011100         10  PV-TODAYS-TIME-HH       PIC 9(02) VALUE ZERO.        01110000
011200         10  PV-TODAYS-TIME-MM       PIC 9(02) VALUE ZERO.        01120000
011300         10  PV-TODAYS-TIME-SS       PIC 9(02) VALUE ZERO.        01130000
011400         10  FILLER                  PIC 9(02) VALUE ZERO.        01140000
011500                                                                  01150000
011501* TRIP - AVERAGE MINUTES                                          01150100
011502     05  PV-TRIP-OPEN-TO-CLOSE-AVG   PIC  S9(16)9V99.             01150200
011503     05  PV-TRIP-CLOSE-TO-SHIP-AVG   PIC  S9(16)9V99.             01150300
011504     05  PV-TRIP-OPEN-TO-SHIP-AVG    PIC  S9(16)9V99.             01150400
011505                                                                  01150500
011506     05  PV-ARRIVE-TO-PRC-AVG        PIC  S9(16)9V99.             01150600
011507     05  PV-ARRIVE-TO-P2L-PKD-AVG    PIC  S9(16)9V99.             01150700
011508     05  PV-PRC-TO-P2L-PKD-AVG       PIC  S9(16)9V99.             01150800
011509     05  PV-P2L-PKD-TO-CLOSE-AVG     PIC  S9(16)9V99.             01150900
011510     05  PV-P2L-OPEN-TO-CLOSE-AVG    PIC  S9(16)9V99.             01151000
011520     05  PV-P2L-OPEN-TO-OTBND-AVG    PIC  S9(16)9V99.             01152000
011530     05  PV-P2L-CLOSE-TO-OTBND-AVG   PIC  S9(16)9V99.             01153000
011540     05  PV-ARRIVE-TO-OTBND-AVG      PIC  S9(16)9V99.             01154000
011550     05  PV-PRC-TO-OTBND-AVG         PIC  S9(16)9V99.             01155000
011560     05  PV-ARRIVE-TO-TCLOS-AVG      PIC  S9(16)9V99.             01156000
011570     05  PV-ARRIVE-TO-SHIP-AVG       PIC  S9(16)9V99.             01157000
011580     05  PV-P2L-OPEN-TO-TCLOS-AVG    PIC  S9(16)9V99.             01158000
011590     05  PV-P2L-OPEN-TO-SHIP-AVG     PIC  S9(16)9V99.             01159000
011591     05  PV-P2L-CLOSE-TO-TCLOS-AVG   PIC  S9(16)9V99.             01159100
011592     05  PV-P2L-CLOSE-TO-SHIP-AVG    PIC  S9(16)9V99.             01159200
011593     05  PV-ARRIVE-TO-MSTR-AVG       PIC  S9(16)9V99.             01159300
011594     05  PV-PRC-TO-MSTR-AVG          PIC  S9(16)9V99.             01159400
011595     05  PV-MSTR-CRE-TO-OTBND-AVG    PIC  S9(16)9V99.             01159500
011596     05  PV-MSTR-CRE-TO-TCLOS-AVG    PIC  S9(16)9V99.             01159600
011597     05  PV-MSTR-CRE-TO-SHIP-AVG     PIC  S9(16)9V99.             01159700
011598     05  PV-MSTR-FIRST-TO-OTBND-AVG  PIC  S9(16)9V99.             01159800
011599     05  PV-MSTR-FIRST-TO-TCLOS-AVG  PIC  S9(16)9V99.             01159900
011600     05  PV-MSTR-FIRST-TO-SHIP-AVG   PIC  S9(16)9V99.             01160000
011601     05  PV-MSTR-LAST-TO-OTBND-AVG   PIC  S9(16)9V99.             01160100
011602     05  PV-MSTR-LAST-TO-TCLOS-AVG   PIC  S9(16)9V99.             01160200
011603     05  PV-MSTR-LAST-TO-SHIP-AVG    PIC  S9(16)9V99.             01160300
011604     05  PV-ON-OTBND-TO-CLOS-AVG     PIC  S9(16)9V99.             01160400
011605     05  PV-ON-OTBND-TO-SHIP-AVG     PIC  S9(16)9V99.             01160500
011606                                                                  01160600
011607* TRIP - AVERAGE DAYS                                             01160700
011608     05  PV-TRIP-OPEN-TO-CLOSE-DAY   PIC  S999V99.                01160800
011609     05  PV-TRIP-CLOSE-TO-SHIP-DAY   PIC  S999V99.                01160900
011610     05  PV-TRIP-OPEN-TO-SHIP-DAY    PIC  S999V99.                01161000
011611                                                                  01161100
011612     05  PV-ARRIVE-TO-PRC-DAY        PIC  S999V99.                01161200
011613     05  PV-ARRIVE-TO-P2L-PKD-DAY    PIC  S999V99.                01161300
011614     05  PV-PRC-TO-P2L-PKD-DAY       PIC  S999V99.                01161400
011615     05  PV-P2L-PKD-TO-CLOSE-DAY     PIC  S999V99.                01161500
011616     05  PV-P2L-OPEN-TO-CLOSE-DAY    PIC  S999V99.                01161600
011617     05  PV-P2L-OPEN-TO-OTBND-DAY    PIC  S999V99.                01161700
011618     05  PV-P2L-CLOSE-TO-OTBND-DAY   PIC  S999V99.                01161800
011619     05  PV-ARRIVE-TO-OTBND-DAY      PIC  S999V99.                01161900
011620     05  PV-PRC-TO-OTBND-DAY         PIC  S999V99.                01162000
011630     05  PV-ARRIVE-TO-TCLOS-DAY      PIC  S999V99.                01163000
011640     05  PV-ARRIVE-TO-SHIP-DAY       PIC  S999V99.                01164000
011650     05  PV-P2L-OPEN-TO-TCLOS-DAY    PIC  S999V99.                01165000
011651     05  PV-P2L-OPEN-TO-SHIP-DAY     PIC  S999V99.                01165100
011652     05  PV-P2L-CLOSE-TO-TCLOS-DAY   PIC  S999V99.                01165200
011653     05  PV-P2L-CLOSE-TO-SHIP-DAY    PIC  S999V99.                01165300
011654     05  PV-ARRIVE-TO-MSTR-DAY       PIC  S999V99.                01165400
011655     05  PV-PRC-TO-MSTR-DAY          PIC  S999V99.                01165500
011656     05  PV-MSTR-CRE-TO-OTBND-DAY    PIC  S999V99.                01165600
011657     05  PV-MSTR-CRE-TO-TCLOS-DAY    PIC  S999V99.                01165700
011658     05  PV-MSTR-CRE-TO-SHIP-DAY     PIC  S999V99.                01165800
011659     05  PV-MSTR-FIRST-TO-OTBND-DAY  PIC  S999V99.                01165900
011660     05  PV-MSTR-FIRST-TO-TCLOS-DAY  PIC  S999V99.                01166000
011661     05  PV-MSTR-FIRST-TO-SHIP-DAY   PIC  S999V99.                01166100
011662     05  PV-MSTR-LAST-TO-OTBND-DAY   PIC  S999V99.                01166200
011663     05  PV-MSTR-LAST-TO-TCLOS-DAY   PIC  S999V99.                01166300
011664     05  PV-MSTR-LAST-TO-SHIP-DAY    PIC  S999V99.                01166400
011665     05  PV-ON-OTBND-TO-CLOS-DAY     PIC  S999V99.                01166500
011666     05  PV-ON-OTBND-TO-SHIP-DAY     PIC  S999V99.                01166600
011667                                                                  01166700
011668* TRIP TOTAL MINUTES                                              01166800
011669     05  PV-TRIP-OPEN-TO-CLOSE-MIN-TOT        PIC  S9(18) COMP.   01166910
011670     05  PV-TRIP-CLOSE-TO-SHIP-MIN-TOT        PIC  S9(18) COMP.   01167010
011671     05  PV-TRIP-OPEN-TO-SHIP-MIN-TOT         PIC  S9(18) COMP.   01167110
011672                                                                  01167200
011673     05  PV-TRIP-OPEN-TO-CLOSE-CNT-TOT        PIC  S9(18) COMP.   01167323
011674     05  PV-TRIP-CLOSE-TO-SHIP-CNT-TOT        PIC  S9(18) COMP.   01167423
011675     05  PV-TRIP-OPEN-TO-SHIP-CNT-TOT         PIC  S9(18) COMP.   01167523
011676                                                                  01167623
011677     05  PV-TRIP-ARRIVE-TO-PRC-MIN-TOT        PIC  S9(18) COMP.   01167710
011678     05  PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT       PIC  S9(18) COMP.   01167810
011679     05  PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT       PIC  S9(18) COMP.   01167910
011680     05  PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT       PIC  S9(18) COMP.   01168010
011681     05  PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT       PIC  S9(18) COMP.   01168110
011682     05  PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT       PIC  S9(18) COMP.   01168210
011683     05  PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT       PIC  S9(18) COMP.   01168310
011684     05  PV-TRIP-ARRIV-TO-OTBND-MIN-TOT       PIC  S9(18) COMP.   01168410
011685     05  PV-TRIP-PRC-TO-OTBND-MIN-TOT         PIC  S9(18) COMP.   01168510
011686     05  PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT       PIC  S9(18) COMP.   01168610
011687     05  PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT       PIC  S9(18) COMP.   01168710
011688     05  PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT       PIC  S9(18) COMP.   01168810
011689     05  PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT       PIC  S9(18) COMP.   01168910
011690     05  PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT       PIC  S9(18) COMP.   01169010
011691     05  PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT       PIC  S9(18) COMP.   01169110
011692     05  PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT       PIC  S9(18) COMP.   01169210
011693     05  PV-TRIP-PRC-TO-MSTR-MIN-TOT          PIC  S9(18) COMP.   01169310
011694     05  PV-TRIP-ON-OTBND-TO-TCLOS-TOT        PIC  S9(18) COMP.   01169410
011695     05  PV-TRIP-ON-OTBND-TO-TSHIP-TOT        PIC  S9(18) COMP.   01169510
011696     05  PV-TRIP-MST-CRE-TO-OTB-MIN-TOT       PIC  S9(18) COMP.   01169610
011697     05  PV-TRIP-MST-CRE-TO-TCL-MIN-TOT       PIC  S9(18) COMP.   01169710
011698     05  PV-TRIP-MST-CRE-TO-SHP-MIN-TOT       PIC  S9(18) COMP.   01169810
011699     05  PV-TRIP-MST-1ST-TO-OTB-MIN-TOT       PIC  S9(18) COMP.   01169910
011700     05  PV-TRIP-MST-1ST-TO-TCL-MIN-TOT       PIC  S9(18) COMP.   01170010
011701     05  PV-TRIP-MST-1ST-TO-SHP-MIN-TOT       PIC  S9(18) COMP.   01170110
011702     05  PV-TRIP-MST-LST-TO-OTB-MIN-TOT       PIC  S9(18) COMP.   01170210
011703     05  PV-TRIP-MST-LST-TO-TCL-MIN-TOT       PIC  S9(18) COMP.   01170310
011704     05  PV-TRIP-MST-LST-TO-SHP-MIN-TOT       PIC  S9(18) COMP.   01170410
011705     05  PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT       PIC  S9(18) COMP.   01170510
011706     05  PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT       PIC  S9(18) COMP.   01170610
011707                                                                  01170700
011708* TRIP TOTAL COUNT                                                01170800
011709     05  PV-TRIP-INPUT-RECORD-TOTAL           PIC  S9(18) COMP.   01170910
011710                                                                  01171000
011711     05  PV-TRIP-ARRIVE-TO-PRC-CNT-TOT        PIC  S9(18) COMP.   01171110
011712     05  PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT       PIC  S9(18) COMP.   01171210
011713     05  PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT       PIC  S9(18) COMP.   01171310
011714     05  PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT       PIC  S9(18) COMP.   01171410
011715     05  PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT       PIC  S9(18) COMP.   01171510
011716     05  PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT       PIC  S9(18) COMP.   01171610
011717     05  PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT       PIC  S9(18) COMP.   01171710
011718     05  PV-TRIP-ARRIV-TO-OTBND-CNT-TOT       PIC  S9(18) COMP.   01171810
011719     05  PV-TRIP-PRC-TO-OTBND-CNT-TOT         PIC  S9(18) COMP.   01171910
011720     05  PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT       PIC  S9(18) COMP.   01172010
011721     05  PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT       PIC  S9(18) COMP.   01172110
011722     05  PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT       PIC  S9(18) COMP.   01172210
011723     05  PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT       PIC  S9(18) COMP.   01172310
011724     05  PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT       PIC  S9(18) COMP.   01172410
011725     05  PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT       PIC  S9(18) COMP.   01172510
011726     05  PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT       PIC  S9(18) COMP.   01172610
011727     05  PV-TRIP-PRC-TO-MSTR-CNT-TOT          PIC  S9(18) COMP.   01172710
011728     05  PV-TRIP-ON-OTB-TO-TCL0-CNT-TOT       PIC  S9(18) COMP.   01172810
011729     05  PV-TRIP-ON-OTB-TO-TSHP-CNT-TOT       PIC  S9(18) COMP.   01172910
011730     05  PV-TRIP-MST-CRE-TO-OTB-CNT-TOT       PIC  S9(18) COMP.   01173010
011731     05  PV-TRIP-MST-CRE-TO-TCL-CNT-TOT       PIC  S9(18) COMP.   01173110
011732     05  PV-TRIP-MST-CRE-TO-SHP-CNT-TOT       PIC  S9(18) COMP.   01173210
011733     05  PV-TRIP-MST-1ST-TO-OTB-CNT-TOT       PIC  S9(18) COMP.   01173310
011734     05  PV-TRIP-MST-1ST-TO-TCL-CNT-TOT       PIC  S9(18) COMP.   01173410
011735     05  PV-TRIP-MST-1ST-TO-SHP-CNT-TOT       PIC  S9(18) COMP.   01173510
011736     05  PV-TRIP-MST-LST-TO-OTB-CNT-TOT       PIC  S9(18) COMP.   01173610
011737     05  PV-TRIP-MST-LST-TO-TCL-CNT-TOT       PIC  S9(18) COMP.   01173710
011738     05  PV-TRIP-MST-LST-TO-SHP-CNT-TOT       PIC  S9(18) COMP.   01173810
011739     05  PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT       PIC  S9(18) COMP.   01173910
011740     05  PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT       PIC  S9(18) COMP.   01174010
011741                                                                  01174110
011750* SOURCE TOTAL MINUTES                                            01175010
011751     05  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01175114
011752     05  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01175214
011753     05  PV-SRC-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01175314
011754*                                                                 01175423
011755     05  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01175523
011756     05  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01175623
011757     05  PV-SRC-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01175723
011758*                                                                 01175823
011759     05  PV-SRC-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01175914
011760*                                                                 01176013
011761     05  PV-SRC-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01176114
011762     05  PV-SRC-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01176214
011763     05  PV-SRC-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01176314
011764     05  PV-SRC-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01176414
011765     05  PV-SRC-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01176514
011766     05  PV-SRC-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01176614
011767     05  PV-SRC-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01176714
011768     05  PV-SRC-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01176814
011769     05  PV-SRC-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01176914
011770     05  PV-SRC-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01177014
011771     05  PV-SRC-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01177114
011772     05  PV-SRC-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01177214
011773     05  PV-SRC-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01177314
011774     05  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01177414
011775     05  PV-SRC-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01177514
011776     05  PV-SRC-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01177614
011777     05  PV-SRC-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01177714
011778     05  PV-SRC-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01177814
011779     05  PV-SRC-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01177914
011780     05  PV-SRC-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01178014
011781     05  PV-SRC-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01178114
011782     05  PV-SRC-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01178214
011783     05  PV-SRC-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01178314
011784     05  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01178414
011785     05  PV-SRC-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01178514
011786     05  PV-SRC-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01178614
011787     05  PV-SRC-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01178714
011788     05  PV-SRC-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01178814
011789     05  PV-SRC-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01178914
011790     05  PV-SRC-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01179014
011791*                                                                 01179113
011793     05  PV-SRC-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01179314
011794     05  PV-SRC-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01179414
011795     05  PV-SRC-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01179514
011796     05  PV-SRC-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01179614
011797     05  PV-SRC-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01179714
011798     05  PV-SRC-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01179814
011799     05  PV-SRC-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01179914
011800     05  PV-SRC-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01180014
011801     05  PV-SRC-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01180114
011802     05  PV-SRC-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01180214
011803     05  PV-SRC-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01180314
011804     05  PV-SRC-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01180414
011805     05  PV-SRC-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01180514
011806     05  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01180614
011807     05  PV-SRC-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01180714
011808     05  PV-SRC-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01180814
011809     05  PV-SRC-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01180914
011810     05  PV-SRC-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01181014
011811     05  PV-SRC-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01181114
011812     05  PV-SRC-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01181214
011813     05  PV-SRC-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01181314
011814     05  PV-SRC-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01181414
011815     05  PV-SRC-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01181514
011816     05  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01181614
011817     05  PV-SRC-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01181714
011818     05  PV-SRC-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01181814
011819     05  PV-SRC-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01181914
011820     05  PV-SRC-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01182014
011821     05  PV-SRC-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01182114
011822     05  PV-SRC-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01182214
011823*                                                                 01182366
011824     05  PV-SRC-TRIP-CARTONS                  PIC  S9(18) COMP.   01182466
011825     05  PV-SRC-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01182566
011826     05  PV-SRC-TOTAL-TRIPS                   PIC  S9(18) COMP.   01182666
011827     05  PV-DC-TOTAL-TRIPS                    PIC  S9(18) COMP.   01182791
011828     05  PV-TRIP-TRIP-CARTONS                 PIC  S9(18) COMP.   01182891
011829     05  PV-TRIP-TRIP-SRC-CARTONS             PIC  S9(18) COMP.   01182991
011830     05  PV-TRIP-TOTAL-TRIPS                  PIC  S9(18) COMP.   01183091
011831     05  PV-TRIP-SRC-CRTN                     PIC   9(05)V9999.   01183191
011832     05  PV-TRIP-SRC-CRTN-PCNT                PIC   9(03)V99.     01183298
011833     05  PV-TRIP-CARTONS                      PIC   9(18).        01183391
011834     05  PV-TRIP-SRC-CARTONS                  PIC   9(18).        01183491
011835                                                                  01183591
011836     05  PV-ASN-TRIP-CARTONS                  PIC  S9(18) COMP.   01183691
011837     05  PV-ASN-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01183791
011838     05  PV-ASN-TOTAL-TRIPS                   PIC  S9(18) COMP.   01183891
011839     05  PV-CPS-TRIP-CARTONS                  PIC  S9(18) COMP.   01183991
011840     05  PV-CPS-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01184091
011841     05  PV-CPS-TOTAL-TRIPS                   PIC  S9(18) COMP.   01184191
011842     05  PV-SMO-TRIP-CARTONS                  PIC  S9(18) COMP.   01184291
011843     05  PV-SMO-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01184391
011844     05  PV-SMO-TOTAL-TRIPS                   PIC  S9(18) COMP.   01184491
011845     05  PV-JWL-TRIP-CARTONS                  PIC  S9(18) COMP.   01184591
011846     05  PV-JWL-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01184691
011847     05  PV-JWL-TOTAL-TRIPS                   PIC  S9(18) COMP.   01184791
011848     05  PV-P2L-TRIP-CARTONS                  PIC  S9(18) COMP.   01184891
011849     05  PV-P2L-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01184991
011850     05  PV-P2L-TOTAL-TRIPS                   PIC  S9(18) COMP.   01185091
011851     05  PV-MST-TRIP-CARTONS                  PIC  S9(18) COMP.   01185191
011852     05  PV-MST-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01185291
011853     05  PV-MST-TOTAL-TRIPS                   PIC  S9(18) COMP.   01185391
011854     05  PV-RDM-TOTAL-TRIPS                   PIC  S9(18) COMP.   01185491
011855     05  PV-RDM-TRIP-CARTONS                  PIC  S9(18) COMP.   01185591
011856     05  PV-RDM-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01185691
011857     05  PV-3WD-TOTAL-TRIPS                   PIC  S9(18) COMP.   01185799
011858     05  PV-3WD-TRIP-CARTONS                  PIC  S9(18) COMP.   01185899
011859     05  PV-3WD-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01185999
011860     05  PV-OTH-TOTAL-TRIPS                   PIC  S9(18) COMP.   01186091
011861     05  PV-OTH-TRIP-CARTONS                  PIC  S9(18) COMP.   01186191
011862     05  PV-OTH-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01186291
011863     05  PV-OVR-TOTAL-TRIPS                   PIC  S9(18) COMP.   01186391
011864     05  PV-OVR-TRIP-CARTONS                  PIC  S9(18) COMP.   01186491
011865     05  PV-OVR-TRIP-SRC-CARTONS              PIC  S9(18) COMP.   01186591
011866     05  PV-DISP-OVR-TOTAL-TRIPS              PIC  Z(18).         01186691
011867     05  PV-DISP-OVR-TRIP-CARTONS             PIC  Z(18).         01186791
011868     05  PV-DISP-OVR-TRIP-SRC-CARTONS         PIC  Z(18).         01186891
011869*                                                                 01186991
011870* ASN TOTAL MINUTES                                               01187091
011871     05  PV-ASN-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01187191
011872     05  PV-ASN-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01187291
011873     05  PV-ASN-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01187391
011874*                                                                 01187491
011875     05  PV-ASN-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01187591
011876     05  PV-ASN-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01187691
011877     05  PV-ASN-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01187791
011878*                                                                 01187891
011879     05  PV-ASN-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01187991
011880*                                                                 01188091
011881     05  PV-ASN-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01188147
011890     05  PV-ASN-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01189047
011891     05  PV-ASN-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01189147
011892     05  PV-ASN-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01189247
011893     05  PV-ASN-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01189347
011894     05  PV-ASN-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01189447
011895     05  PV-ASN-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01189547
011896     05  PV-ASN-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01189647
011897     05  PV-ASN-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01189747
011898     05  PV-ASN-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01189847
011899     05  PV-ASN-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01189947
011900     05  PV-ASN-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01190047
011901     05  PV-ASN-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01190147
011902     05  PV-ASN-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01190247
011903     05  PV-ASN-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01190347
011904     05  PV-ASN-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01190447
011905     05  PV-ASN-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01190547
011906     05  PV-ASN-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01190647
011907     05  PV-ASN-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01190747
011908     05  PV-ASN-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01190847
011909     05  PV-ASN-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01190947
011910     05  PV-ASN-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01191047
011911     05  PV-ASN-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01191147
011912     05  PV-ASN-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01191247
011913     05  PV-ASN-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01191347
011914     05  PV-ASN-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01191447
011915     05  PV-ASN-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01191547
011916     05  PV-ASN-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01191647
011917     05  PV-ASN-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01191747
011918     05  PV-ASN-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01191847
011919*                                                                 01191947
011920     05  PV-ASN-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01192047
011921     05  PV-ASN-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01192147
011922     05  PV-ASN-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01192247
011923     05  PV-ASN-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01192347
011924     05  PV-ASN-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01192447
011925     05  PV-ASN-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01192547
011926     05  PV-ASN-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01192647
011927     05  PV-ASN-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01192747
011928     05  PV-ASN-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01192847
011929     05  PV-ASN-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01192947
011930     05  PV-ASN-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01193047
011931     05  PV-ASN-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01193147
011932     05  PV-ASN-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01193247
011933     05  PV-ASN-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01193347
011934     05  PV-ASN-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01193447
011935     05  PV-ASN-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01193547
011936     05  PV-ASN-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01193647
011937     05  PV-ASN-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01193747
011938     05  PV-ASN-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01193847
011939     05  PV-ASN-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01193947
011940     05  PV-ASN-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01194047
011941     05  PV-ASN-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01194147
011942     05  PV-ASN-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01194247
011943     05  PV-ASN-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01194347
011944     05  PV-ASN-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01194447
011945     05  PV-ASN-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01194547
011946     05  PV-ASN-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01194647
011947     05  PV-ASN-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01194747
011948     05  PV-ASN-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01194847
011949     05  PV-ASN-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01194947
011950                                                                  01195047
011951*                                                                 01195147
011952* CPS TOTAL MINUTES   CASEPACK SPLIT                              01195247
011953     05  PV-CPS-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01195347
011954     05  PV-CPS-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01195447
011955     05  PV-CPS-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01195547
011956*                                                                 01195647
011957     05  PV-CPS-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01195747
011958     05  PV-CPS-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01195847
011959     05  PV-CPS-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01195947
011960*                                                                 01196047
011961     05  PV-CPS-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01196147
011962*                                                                 01196247
011963     05  PV-CPS-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01196347
011964     05  PV-CPS-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01196447
011965     05  PV-CPS-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01196547
011966     05  PV-CPS-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01196647
011967     05  PV-CPS-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01196747
011968     05  PV-CPS-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01196847
011969     05  PV-CPS-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01196947
011970     05  PV-CPS-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01197047
011971     05  PV-CPS-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01197147
011972     05  PV-CPS-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01197247
011973     05  PV-CPS-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01197347
011974     05  PV-CPS-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01197447
011975     05  PV-CPS-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01197547
011976     05  PV-CPS-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01197647
011977     05  PV-CPS-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01197747
011978     05  PV-CPS-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01197847
011979     05  PV-CPS-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01197947
011980     05  PV-CPS-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01198047
011981     05  PV-CPS-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01198147
011982     05  PV-CPS-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01198247
011983     05  PV-CPS-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01198347
011984     05  PV-CPS-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01198447
011985     05  PV-CPS-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01198547
011986     05  PV-CPS-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01198647
011987     05  PV-CPS-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01198747
011988     05  PV-CPS-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01198847
011989     05  PV-CPS-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01198947
011990     05  PV-CPS-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01199047
011991     05  PV-CPS-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01199147
011992     05  PV-CPS-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01199247
011993*                                                                 01199347
011994     05  PV-CPS-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01199447
011995     05  PV-CPS-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01199547
011996     05  PV-CPS-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01199647
011997     05  PV-CPS-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01199747
011998     05  PV-CPS-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01199847
011999     05  PV-CPS-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01199947
012000     05  PV-CPS-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01200047
012001     05  PV-CPS-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01200147
012002     05  PV-CPS-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01200247
012003     05  PV-CPS-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01200347
012004     05  PV-CPS-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01200447
012005     05  PV-CPS-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01200547
012006     05  PV-CPS-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01200647
012007     05  PV-CPS-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01200747
012008     05  PV-CPS-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01200847
012009     05  PV-CPS-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01200947
012010     05  PV-CPS-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01201047
012011     05  PV-CPS-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01201147
012012     05  PV-CPS-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01201247
012013     05  PV-CPS-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01201347
012014     05  PV-CPS-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01201447
012015     05  PV-CPS-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01201547
012016     05  PV-CPS-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01201647
012017     05  PV-CPS-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01201747
012018     05  PV-CPS-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01201847
012019     05  PV-CPS-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01201947
012020     05  PV-CPS-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01202047
012021     05  PV-CPS-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01202147
012022     05  PV-CPS-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01202247
012023     05  PV-CPS-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01202347
012025                                                                  01202500
012026*                                                                 01202647
012027* SMO TOTAL MINUTES   SMOOTHING                                   01202747
012028     05  PV-SMO-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01202847
012029     05  PV-SMO-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01202947
012030     05  PV-SMO-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01203047
012031*                                                                 01203147
012032     05  PV-SMO-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01203247
012033     05  PV-SMO-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01203347
012034     05  PV-SMO-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01203447
012035*                                                                 01203547
012036     05  PV-SMO-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01203647
012037*                                                                 01203747
012038     05  PV-SMO-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01203847
012039     05  PV-SMO-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01203947
012040     05  PV-SMO-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01204047
012041     05  PV-SMO-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01204147
012042     05  PV-SMO-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01204247
012043     05  PV-SMO-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01204347
012044     05  PV-SMO-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01204447
012045     05  PV-SMO-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01204547
012046     05  PV-SMO-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01204647
012047     05  PV-SMO-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01204747
012048     05  PV-SMO-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01204847
012049     05  PV-SMO-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01204947
012050     05  PV-SMO-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01205047
012051     05  PV-SMO-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01205147
012052     05  PV-SMO-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01205247
012053     05  PV-SMO-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01205347
012054     05  PV-SMO-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01205447
012055     05  PV-SMO-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01205547
012056     05  PV-SMO-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01205647
012057     05  PV-SMO-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01205747
012058     05  PV-SMO-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01205847
012059     05  PV-SMO-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01205947
012060     05  PV-SMO-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01206047
012061     05  PV-SMO-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01206147
012062     05  PV-SMO-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01206247
012063     05  PV-SMO-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01206347
012064     05  PV-SMO-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01206447
012065     05  PV-SMO-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01206547
012066     05  PV-SMO-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01206647
012067     05  PV-SMO-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01206747
012068*                                                                 01206847
012069     05  PV-SMO-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01206947
012070     05  PV-SMO-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01207047
012071     05  PV-SMO-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01207147
012072     05  PV-SMO-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01207247
012073     05  PV-SMO-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01207347
012074     05  PV-SMO-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01207447
012075     05  PV-SMO-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01207547
012076     05  PV-SMO-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01207647
012077     05  PV-SMO-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01207747
012078     05  PV-SMO-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01207847
012079     05  PV-SMO-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01207947
012080     05  PV-SMO-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01208047
012081     05  PV-SMO-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01208147
012082     05  PV-SMO-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01208247
012083     05  PV-SMO-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01208347
012084     05  PV-SMO-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01208447
012085     05  PV-SMO-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01208547
012086     05  PV-SMO-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01208647
012087     05  PV-SMO-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01208747
012088     05  PV-SMO-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01208847
012089     05  PV-SMO-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01208947
012090     05  PV-SMO-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01209047
012091     05  PV-SMO-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01209147
012092     05  PV-SMO-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01209247
012093     05  PV-SMO-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01209347
012094     05  PV-SMO-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01209447
012095     05  PV-SMO-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01209547
012096     05  PV-SMO-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01209647
012097     05  PV-SMO-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01209747
012098     05  PV-SMO-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01209847
012099                                                                  01209947
012100*                                                                 01210047
012101* JWL TOTAL MINUTES   JEWELRY -PACK-TO-LIGHT                      01210147
012102     05  PV-JWL-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01210247
012103     05  PV-JWL-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01210347
012104     05  PV-JWL-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01210447
012105*                                                                 01210547
012106     05  PV-JWL-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01210647
012107     05  PV-JWL-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01210747
012108     05  PV-JWL-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01210847
012109*                                                                 01210947
012110     05  PV-JWL-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01211047
012111*                                                                 01211147
012112     05  PV-JWL-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01211247
012113     05  PV-JWL-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01211347
012114     05  PV-JWL-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01211447
012115     05  PV-JWL-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01211547
012116     05  PV-JWL-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01211647
012117     05  PV-JWL-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01211747
012118     05  PV-JWL-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01211847
012119     05  PV-JWL-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01211947
012120     05  PV-JWL-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01212047
012121     05  PV-JWL-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01212147
012122     05  PV-JWL-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01212247
012123     05  PV-JWL-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01212347
012124     05  PV-JWL-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01212447
012125     05  PV-JWL-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01212547
012126     05  PV-JWL-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01212647
012127     05  PV-JWL-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01212747
012128     05  PV-JWL-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01212847
012129     05  PV-JWL-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01212947
012130     05  PV-JWL-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01213047
012131     05  PV-JWL-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01213147
012132     05  PV-JWL-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01213247
012133     05  PV-JWL-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01213347
012134     05  PV-JWL-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01213447
012135     05  PV-JWL-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01213547
012136     05  PV-JWL-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01213647
012137     05  PV-JWL-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01213747
012138     05  PV-JWL-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01213847
012139     05  PV-JWL-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01213947
012140     05  PV-JWL-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01214047
012141     05  PV-JWL-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01214147
012142*                                                                 01214247
012143     05  PV-JWL-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01214347
012144     05  PV-JWL-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01214447
012145     05  PV-JWL-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01214547
012146     05  PV-JWL-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01214647
012147     05  PV-JWL-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01214747
012148     05  PV-JWL-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01214847
012149     05  PV-JWL-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01214947
012150     05  PV-JWL-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01215047
012151     05  PV-JWL-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01215147
012152     05  PV-JWL-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01215247
012153     05  PV-JWL-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01215347
012154     05  PV-JWL-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01215447
012155     05  PV-JWL-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01215547
012156     05  PV-JWL-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01215647
012157     05  PV-JWL-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01215747
012158     05  PV-JWL-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01215847
012159     05  PV-JWL-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01215947
012160     05  PV-JWL-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01216047
012161     05  PV-JWL-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01216147
012162     05  PV-JWL-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01216247
012163     05  PV-JWL-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01216347
012164     05  PV-JWL-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01216447
012165     05  PV-JWL-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01216547
012166     05  PV-JWL-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01216647
012167     05  PV-JWL-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01216747
012168     05  PV-JWL-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01216847
012169     05  PV-JWL-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01216947
012170     05  PV-JWL-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01217047
012171     05  PV-JWL-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01217147
012172     05  PV-JWL-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01217247
012173                                                                  01217347
012174*                                                                 01217447
012175* P2L TOTAL MINUTES   PACK-TO-LIGHT                               01217547
012176     05  PV-P2L-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01217647
012177     05  PV-P2L-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01217747
012178     05  PV-P2L-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01217847
012179*                                                                 01217947
012180     05  PV-P2L-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01218047
012181     05  PV-P2L-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01218147
012182     05  PV-P2L-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01218247
012183*                                                                 01218347
012184     05  PV-P2L-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01218447
012185*                                                                 01218547
012186     05  PV-P2L-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01218647
012187     05  PV-P2L-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01218747
012188     05  PV-P2L-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01218847
012189     05  PV-P2L-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01218947
012190     05  PV-P2L-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01219047
012191     05  PV-P2L-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01219147
012192     05  PV-P2L-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01219247
012193     05  PV-P2L-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01219347
012194     05  PV-P2L-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01219447
012195     05  PV-P2L-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01219547
012196     05  PV-P2L-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01219647
012197     05  PV-P2L-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01219747
012198     05  PV-P2L-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01219847
012199     05  PV-P2L-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01219947
012200     05  PV-P2L-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01220047
012201     05  PV-P2L-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01220147
012202     05  PV-P2L-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01220247
012203     05  PV-P2L-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01220347
012204     05  PV-P2L-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01220447
012205     05  PV-P2L-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01220547
012206     05  PV-P2L-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01220647
012207     05  PV-P2L-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01220747
012208     05  PV-P2L-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01220847
012209     05  PV-P2L-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01220947
012210     05  PV-P2L-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01221047
012211     05  PV-P2L-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01221147
012212     05  PV-P2L-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01221247
012213     05  PV-P2L-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01221347
012214     05  PV-P2L-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01221447
012215     05  PV-P2L-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01221547
012216*                                                                 01221647
012217     05  PV-P2L-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01221747
012218     05  PV-P2L-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01221847
012219     05  PV-P2L-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01221947
012220     05  PV-P2L-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01222047
012221     05  PV-P2L-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01222147
012222     05  PV-P2L-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01222247
012223     05  PV-P2L-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01222347
012224     05  PV-P2L-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01222447
012225     05  PV-P2L-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01222547
012226     05  PV-P2L-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01222647
012227     05  PV-P2L-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01222747
012228     05  PV-P2L-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01222847
012229     05  PV-P2L-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01222947
012230     05  PV-P2L-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01223047
012231     05  PV-P2L-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01223147
012232     05  PV-P2L-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01223247
012233     05  PV-P2L-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01223347
012234     05  PV-P2L-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01223447
012235     05  PV-P2L-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01223547
012236     05  PV-P2L-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01223647
012237     05  PV-P2L-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01223747
012238     05  PV-P2L-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01223847
012239     05  PV-P2L-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01223947
012240     05  PV-P2L-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01224047
012241     05  PV-P2L-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01224147
012242     05  PV-P2L-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01224247
012243     05  PV-P2L-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01224347
012244     05  PV-P2L-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01224447
012245     05  PV-P2L-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01224547
012246     05  PV-P2L-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01224647
012247                                                                  01224747
012248*                                                                 01224847
012249* MST TOTAL MINUTES   MASTER CONTAINER                            01224947
012250     05  PV-MST-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01225047
012251     05  PV-MST-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01225147
012252     05  PV-MST-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01225247
012253*                                                                 01225347
012254     05  PV-MST-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01225447
012255     05  PV-MST-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01225547
012256     05  PV-MST-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01225647
012257*                                                                 01225747
012258     05  PV-MST-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01225847
012259*                                                                 01225947
012260     05  PV-MST-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01226047
012261     05  PV-MST-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01226147
012262     05  PV-MST-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01226247
012263     05  PV-MST-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01226347
012264     05  PV-MST-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01226447
012265     05  PV-MST-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01226547
012266     05  PV-MST-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01226647
012267     05  PV-MST-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01226747
012268     05  PV-MST-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01226847
012269     05  PV-MST-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01226947
012270     05  PV-MST-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01227047
012271     05  PV-MST-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01227147
012272     05  PV-MST-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01227247
012273     05  PV-MST-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01227347
012274     05  PV-MST-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01227447
012275     05  PV-MST-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01227547
012276     05  PV-MST-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01227647
012277     05  PV-MST-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01227747
012278     05  PV-MST-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01227847
012279     05  PV-MST-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01227947
012280     05  PV-MST-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01228047
012281     05  PV-MST-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01228147
012282     05  PV-MST-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01228247
012283     05  PV-MST-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01228347
012284     05  PV-MST-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01228447
012285     05  PV-MST-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01228547
012286     05  PV-MST-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01228647
012287     05  PV-MST-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01228747
012288     05  PV-MST-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01228847
012289     05  PV-MST-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01228947
012290*                                                                 01229047
012291     05  PV-MST-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01229147
012292     05  PV-MST-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01229247
012293     05  PV-MST-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01229347
012294     05  PV-MST-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01229447
012295     05  PV-MST-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01229547
012296     05  PV-MST-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01229647
012297     05  PV-MST-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01229747
012298     05  PV-MST-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01229847
012299     05  PV-MST-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01229947
012300     05  PV-MST-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01230047
012301     05  PV-MST-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01230147
012302     05  PV-MST-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01230247
012303     05  PV-MST-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01230347
012304     05  PV-MST-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01230447
012305     05  PV-MST-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01230547
012306     05  PV-MST-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01230647
012307     05  PV-MST-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01230747
012308     05  PV-MST-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01230847
012309     05  PV-MST-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01230947
012310     05  PV-MST-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01231047
012311     05  PV-MST-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01231147
012312     05  PV-MST-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01231247
012313     05  PV-MST-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01231347
012314     05  PV-MST-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01231447
012315     05  PV-MST-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01231547
012316     05  PV-MST-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01231647
012317     05  PV-MST-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01231747
012318     05  PV-MST-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01231847
012319     05  PV-MST-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01231947
012320     05  PV-MST-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01232047
012321                                                                  01232147
012322*                                                                 01232247
012323* RDM TOTAL MINUTES   IMPORT REPLEN                               01232347
012324     05  PV-RDM-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01232447
012325     05  PV-RDM-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01232547
012326     05  PV-RDM-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01232647
012327*                                                                 01232747
012328     05  PV-RDM-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01232847
012329     05  PV-RDM-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01232947
012330     05  PV-RDM-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01233047
012331*                                                                 01233147
012332     05  PV-RDM-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01233247
012333*                                                                 01233347
012334     05  PV-RDM-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01233447
012335     05  PV-RDM-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01233547
012336     05  PV-RDM-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01233647
012337     05  PV-RDM-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01233747
012338     05  PV-RDM-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01233847
012339     05  PV-RDM-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01233947
012340     05  PV-RDM-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01234047
012341     05  PV-RDM-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01234147
012342     05  PV-RDM-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01234247
012343     05  PV-RDM-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01234347
012344     05  PV-RDM-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01234447
012345     05  PV-RDM-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01234547
012346     05  PV-RDM-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01234647
012347     05  PV-RDM-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01234747
012348     05  PV-RDM-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01234847
012349     05  PV-RDM-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01234947
012350     05  PV-RDM-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01235047
012351     05  PV-RDM-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01235147
012352     05  PV-RDM-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01235247
012353     05  PV-RDM-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01235347
012354     05  PV-RDM-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01235447
012355     05  PV-RDM-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01235547
012356     05  PV-RDM-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01235647
012357     05  PV-RDM-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01235747
012358     05  PV-RDM-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01235847
012359     05  PV-RDM-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01235947
012360     05  PV-RDM-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01236047
012361     05  PV-RDM-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01236147
012362     05  PV-RDM-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01236247
012363     05  PV-RDM-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01236347
012364*                                                                 01236447
012365     05  PV-RDM-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01236547
012366     05  PV-RDM-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01236647
012367     05  PV-RDM-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01236747
012368     05  PV-RDM-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01236847
012369     05  PV-RDM-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01236947
012370     05  PV-RDM-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01237047
012371     05  PV-RDM-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01237147
012372     05  PV-RDM-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01237247
012373     05  PV-RDM-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01237347
012374     05  PV-RDM-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01237447
012375     05  PV-RDM-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01237547
012376     05  PV-RDM-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01237647
012377     05  PV-RDM-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01237747
012378     05  PV-RDM-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01237847
012379     05  PV-RDM-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01237947
012380     05  PV-RDM-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01238047
012381     05  PV-RDM-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01238147
012382     05  PV-RDM-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01238247
012383     05  PV-RDM-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01238347
012384     05  PV-RDM-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01238447
012385     05  PV-RDM-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01238547
012386     05  PV-RDM-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01238647
012387     05  PV-RDM-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01238747
012388     05  PV-RDM-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01238847
012389     05  PV-RDM-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01238947
012390     05  PV-RDM-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01239047
012391     05  PV-RDM-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01239147
012392     05  PV-RDM-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01239247
012393     05  PV-RDM-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01239347
012394     05  PV-RDM-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01239447
012395                                                                  01239547
012396* 3WD TOTAL MINUTES   THIRD PARTY WAREHOUSE REPLENISHMENT         01239699
012397     05  PV-3WD-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01239799
012398     05  PV-3WD-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01239899
012399     05  PV-3WD-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01239999
012400*                                                                 01240099
012401     05  PV-3WD-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01240199
012402     05  PV-3WD-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01240299
012403     05  PV-3WD-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01240399
012404*                                                                 01240499
012405     05  PV-3WD-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01240599
012406*                                                                 01240699
012407     05  PV-3WD-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01240799
012408     05  PV-3WD-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01240899
012409     05  PV-3WD-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01240999
012410     05  PV-3WD-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01241099
012411     05  PV-3WD-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01241199
012412     05  PV-3WD-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01241299
012413     05  PV-3WD-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01241399
012414     05  PV-3WD-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01241499
012415     05  PV-3WD-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01241599
012416     05  PV-3WD-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01241699
012417     05  PV-3WD-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01241799
012418     05  PV-3WD-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01241899
012419     05  PV-3WD-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01241999
012420     05  PV-3WD-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01242099
012421     05  PV-3WD-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01242199
012422     05  PV-3WD-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01242299
012423     05  PV-3WD-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01242399
012424     05  PV-3WD-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01242499
012425     05  PV-3WD-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01242599
012426     05  PV-3WD-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01242699
012427     05  PV-3WD-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01242799
012428     05  PV-3WD-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01242899
012429     05  PV-3WD-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01242999
012430     05  PV-3WD-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01243099
012431     05  PV-3WD-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01243199
012432     05  PV-3WD-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01243299
012433     05  PV-3WD-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01243399
012434     05  PV-3WD-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01243499
012435     05  PV-3WD-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01243599
012436     05  PV-3WD-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01243699
012437*                                                                 01243799
012438     05  PV-3WD-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01243899
012439     05  PV-3WD-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01243999
012440     05  PV-3WD-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01244099
012441     05  PV-3WD-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01244199
012442     05  PV-3WD-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01244299
012443     05  PV-3WD-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01244399
012444     05  PV-3WD-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01244499
012445     05  PV-3WD-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01244599
012446     05  PV-3WD-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01244699
012447     05  PV-3WD-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01244799
012448     05  PV-3WD-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01244899
012449     05  PV-3WD-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01244999
012450     05  PV-3WD-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01245099
012451     05  PV-3WD-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01245199
012452     05  PV-3WD-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01245299
012453     05  PV-3WD-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01245399
012454     05  PV-3WD-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01245499
012455     05  PV-3WD-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01245599
012456     05  PV-3WD-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01245699
012457     05  PV-3WD-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01245799
012458     05  PV-3WD-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01245899
012459     05  PV-3WD-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01245999
012460     05  PV-3WD-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01246099
012461     05  PV-3WD-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01246199
012462     05  PV-3WD-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01246299
012463     05  PV-3WD-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01246399
012464     05  PV-3WD-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01246499
012465     05  PV-3WD-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01246599
012466     05  PV-3WD-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01246699
012467     05  PV-3WD-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01246799
012468                                                                  01246899
012469*                                                                 01246947
012470* OTH TOTAL MINUTES   OTHER UNKNOW SOURCE                         01247047
012471     05  PV-OTH-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01247147
012472     05  PV-OTH-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01247247
012473     05  PV-OTH-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01247347
012474*                                                                 01247447
012475     05  PV-OTH-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01247547
012476     05  PV-OTH-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01247647
012477     05  PV-OTH-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01247747
012478*                                                                 01247847
012479     05  PV-OTH-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01247947
012480*                                                                 01248047
012481     05  PV-OTH-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01248147
012482     05  PV-OTH-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01248247
012483     05  PV-OTH-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01248347
012484     05  PV-OTH-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01248447
012485     05  PV-OTH-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01248547
012486     05  PV-OTH-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01248647
012487     05  PV-OTH-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01248747
012488     05  PV-OTH-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01248847
012489     05  PV-OTH-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01248947
012490     05  PV-OTH-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01249047
012491     05  PV-OTH-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01249147
012492     05  PV-OTH-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01249247
012493     05  PV-OTH-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01249347
012494     05  PV-OTH-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01249447
012495     05  PV-OTH-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01249547
012496     05  PV-OTH-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01249647
012497     05  PV-OTH-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01249747
012498     05  PV-OTH-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01249847
012499     05  PV-OTH-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01249947
012500     05  PV-OTH-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01250047
012501     05  PV-OTH-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01250147
012502     05  PV-OTH-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01250247
012503     05  PV-OTH-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01250347
012504     05  PV-OTH-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01250447
012505     05  PV-OTH-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01250547
012506     05  PV-OTH-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01250647
012507     05  PV-OTH-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01250747
012508     05  PV-OTH-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01250847
012509     05  PV-OTH-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01250947
012510     05  PV-OTH-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01251047
012511*                                                                 01251147
012512     05  PV-OTH-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01251247
012513     05  PV-OTH-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01251347
012514     05  PV-OTH-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01251447
012515     05  PV-OTH-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01251547
012516     05  PV-OTH-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01251647
012517     05  PV-OTH-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01251747
012518     05  PV-OTH-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01251847
012519     05  PV-OTH-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01251947
012520     05  PV-OTH-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01252047
012521     05  PV-OTH-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01252147
012522     05  PV-OTH-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01252247
012523     05  PV-OTH-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01252347
012524     05  PV-OTH-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01252447
012525     05  PV-OTH-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01252547
012526     05  PV-OTH-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01252647
012527     05  PV-OTH-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01252747
012528     05  PV-OTH-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01252847
012529     05  PV-OTH-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01252947
012530     05  PV-OTH-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01253047
012531     05  PV-OTH-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01253147
012532     05  PV-OTH-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01253247
012533     05  PV-OTH-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01253347
012534     05  PV-OTH-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01253447
012535     05  PV-OTH-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01253547
012536     05  PV-OTH-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01253647
012537     05  PV-OTH-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01253747
012538     05  PV-OTH-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01253847
012539     05  PV-OTH-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01253947
012540     05  PV-OTH-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01254047
012541     05  PV-OTH-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01254147
012542                                                                  01254247
012543*                                                                 01254347
012544* OVR TOTAL MINUTES   CORPORTE OVER ALL TOTAL                     01254447
012545     05  PV-OVR-TRIP-OPEN-TO-CLOSE-MIN        PIC  S9(18) COMP.   01254547
012546     05  PV-OVR-TRIP-CLOSE-TO-SHIP-MIN        PIC  S9(18) COMP.   01254647
012547     05  PV-OVR-TRIP-OPEN-TO-SHIP-MIN         PIC  S9(18) COMP.   01254747
012548*                                                                 01254847
012549     05  PV-OVR-TRIP-OPEN-TO-CLOSE-CNT        PIC  S9(18) COMP.   01254947
012550     05  PV-OVR-TRIP-CLOSE-TO-SHIP-CNT        PIC  S9(18) COMP.   01255047
012551     05  PV-OVR-TRIP-OPEN-TO-SHIP-CNT         PIC  S9(18) COMP.   01255147
012552*                                                                 01255247
012553     05  PV-OVR-INPUT-RECORD-COUNT            PIC  S9(18) COMP.   01255347
012554*                                                                 01255447
012555     05  PV-OVR-ARRIVE-TO-PRC-MIN             PIC  S9(18) COMP.   01255547
012556     05  PV-OVR-ARRIVE-TO-P2L-PKD-MIN         PIC  S9(18) COMP.   01255647
012557     05  PV-OVR-PRC-TO-P2L-PKD-MIN            PIC  S9(18) COMP.   01255747
012558     05  PV-OVR-P2L-PKD-TO-CLOSE-MIN          PIC  S9(18) COMP.   01255847
012559     05  PV-OVR-P2L-OPEN-TO-CLOSE-MIN         PIC  S9(18) COMP.   01255947
012560     05  PV-OVR-P2L-OPEN-TO-OTBND-MIN         PIC  S9(18) COMP.   01256047
012561     05  PV-OVR-P2L-CLOSE-TO-OTBND-MIN        PIC  S9(18) COMP.   01256147
012562     05  PV-OVR-ARRIVE-TO-OTBND-MIN           PIC  S9(18) COMP.   01256247
012563     05  PV-OVR-PRC-TO-OTBND-MIN              PIC  S9(18) COMP.   01256347
012564     05  PV-OVR-ARRIVE-TO-TCLOS-MIN           PIC  S9(18) COMP.   01256447
012565     05  PV-OVR-ARRIVE-TO-SHIP-MIN            PIC  S9(18) COMP.   01256547
012566     05  PV-OVR-P2L-OPEN-TO-TCLOS-MIN         PIC  S9(18) COMP.   01256647
012567     05  PV-OVR-P2L-OPEN-TO-SHIP-MIN          PIC  S9(18) COMP.   01256747
012568     05  PV-OVR-P2L-CLOSE-TO-TCLOS-MIN        PIC  S9(18) COMP.   01256847
012569     05  PV-OVR-P2L-CLOSE-TO-SHIP-MIN         PIC  S9(18) COMP.   01256947
012570     05  PV-OVR-ARRIVE-TO-MSTR-MIN            PIC  S9(18) COMP.   01257047
012571     05  PV-OVR-PRC-TO-MSTR-MIN               PIC  S9(18) COMP.   01257147
012572     05  PV-OVR-ON-OTBND-TO-TCLOS-MIN         PIC  S9(18) COMP.   01257247
012573     05  PV-OVR-ON-OTBND-TO-TSHIP-MIN         PIC  S9(18) COMP.   01257347
012574     05  PV-OVR-MSTR-CRE-TO-OTBND-MIN         PIC  S9(18) COMP.   01257447
012575     05  PV-OVR-MSTR-CRE-TO-TCLOS-MIN         PIC  S9(18) COMP.   01257547
012576     05  PV-OVR-MSTR-CRE-TO-SHIP-MIN          PIC  S9(18) COMP.   01257647
012577     05  PV-OVR-MSTR-FIRST-TO-OTBND-MIN       PIC  S9(18) COMP.   01257747
012578     05  PV-OVR-MSTR-FIRST-TO-TCLOS-MIN       PIC  S9(18) COMP.   01257847
012579     05  PV-OVR-MSTR-FIRST-TO-SHIP-MIN        PIC  S9(18) COMP.   01257947
012580     05  PV-OVR-MSTR-LAST-TO-OTBND-MIN        PIC  S9(18) COMP.   01258047
012581     05  PV-OVR-MSTR-LAST-TO-TCLOS-MIN        PIC  S9(18) COMP.   01258147
012582     05  PV-OVR-MSTR-LAST-TO-SHIP-MIN         PIC  S9(18) COMP.   01258247
012583     05  PV-OVR-ON-OTBND-TO-CLOS-MIN          PIC  S9(18) COMP.   01258347
012584     05  PV-OVR-ON-OTBND-TO-SHIP-MIN          PIC  S9(18) COMP.   01258447
012585*                                                                 01258547
012586     05  PV-OVR-ARRIVE-TO-PRC-CNT             PIC  S9(18) COMP.   01258647
012587     05  PV-OVR-ARRIVE-TO-P2L-PKD-CNT         PIC  S9(18) COMP.   01258747
012588     05  PV-OVR-PRC-TO-P2L-PKD-CNT            PIC  S9(18) COMP.   01258847
012589     05  PV-OVR-P2L-PKD-TO-CLOSE-CNT          PIC  S9(18) COMP.   01258947
012590     05  PV-OVR-P2L-OPEN-TO-CLOSE-CNT         PIC  S9(18) COMP.   01259047
012591     05  PV-OVR-P2L-OPEN-TO-OTBND-CNT         PIC  S9(18) COMP.   01259147
012592     05  PV-OVR-P2L-CLOSE-TO-OTBND-CNT        PIC  S9(18) COMP.   01259247
012593     05  PV-OVR-ARRIVE-TO-OTBND-CNT           PIC  S9(18) COMP.   01259347
012594     05  PV-OVR-PRC-TO-OTBND-CNT              PIC  S9(18) COMP.   01259447
012595     05  PV-OVR-ARRIVE-TO-TCLOS-CNT           PIC  S9(18) COMP.   01259547
012596     05  PV-OVR-ARRIVE-TO-SHIP-CNT            PIC  S9(18) COMP.   01259647
012597     05  PV-OVR-P2L-OPEN-TO-TCLOS-CNT         PIC  S9(18) COMP.   01259747
012598     05  PV-OVR-P2L-OPEN-TO-SHIP-CNT          PIC  S9(18) COMP.   01259847
012599     05  PV-OVR-P2L-CLOSE-TO-TCLOS-CNT        PIC  S9(18) COMP.   01259947
012600     05  PV-OVR-P2L-CLOSE-TO-SHIP-CNT         PIC  S9(18) COMP.   01260047
012601     05  PV-OVR-ARRIVE-TO-MSTR-CNT            PIC  S9(18) COMP.   01260147
012602     05  PV-OVR-PRC-TO-MSTR-CNT               PIC  S9(18) COMP.   01260247
012603     05  PV-OVR-ON-OTBND-TO-TCLOS-CNT         PIC  S9(18) COMP.   01260347
012604     05  PV-OVR-ON-OTBND-TO-TSHIP-CNT         PIC  S9(18) COMP.   01260447
012605     05  PV-OVR-MSTR-CRE-TO-OTBND-CNT         PIC  S9(18) COMP.   01260547
012606     05  PV-OVR-MSTR-CRE-TO-TCLOS-CNT         PIC  S9(18) COMP.   01260647
012607     05  PV-OVR-MSTR-CRE-TO-SHIP-CNT          PIC  S9(18) COMP.   01260747
012608     05  PV-OVR-MSTR-FIRST-TO-OTBND-CNT       PIC  S9(18) COMP.   01260847
012609     05  PV-OVR-MSTR-FIRST-TO-TCLOS-CNT       PIC  S9(18) COMP.   01260947
012610     05  PV-OVR-MSTR-FIRST-TO-SHIP-CNT        PIC  S9(18) COMP.   01261047
012611     05  PV-OVR-MSTR-LAST-TO-OTBND-CNT        PIC  S9(18) COMP.   01261147
012612     05  PV-OVR-MSTR-LAST-TO-TCLOS-CNT        PIC  S9(18) COMP.   01261247
012613     05  PV-OVR-MSTR-LAST-TO-SHIP-CNT         PIC  S9(18) COMP.   01261347
012614     05  PV-OVR-ON-OTBND-TO-CLOS-CNT          PIC  S9(18) COMP.   01261447
012615     05  PV-OVR-ON-OTBND-TO-SHIP-CNT          PIC  S9(18) COMP.   01261547
012616*                                                                 01261647
012617* START - S T A R T                                               01261747
012618                                                                  01261847
012619 01  PV-ABEND-FIELDS.                                             01261947
012620     05  PV-ABEND-CODE               PIC S9(4) VALUE +0           01262047
012621                                               COMP SYNC.         01262147
012622     05  PV-ABEND-PROGRAM            PIC X(08) VALUE 'SUKRP072'.  01262247
012623     05  PV-ABEND-PARAGRAPH          PIC X(50) VALUE SPACES.      01262347
012624     05  PV-ABEND-OPERATION          PIC X(50) VALUE SPACES.      01262447
012625     05  PV-ABEND-STRUCTURE-1        PIC X(08) VALUE SPACES.      01262547
012626     05  PV-DB2-OPERATION-MESSAGE-1  PIC X(79) VALUE SPACES.      01262647
012627     05  PV-DB2-OPERATION-MESSAGE-2  PIC X(79) VALUE SPACES.      01262747
012628     05  PV-DB2-OPERATION-MESSAGE-3  PIC X(79) VALUE SPACES.      01262847
012629     05  PV-DB2-OPERATION-MESSAGE-4  PIC X(79) VALUE SPACES.      01262947
012630     05  PV-DB2-TABLE-NAME-1         PIC X(08) VALUE SPACES.      01263047
012631     05  PV-DB2-TABLE-NAME-2         PIC X(08) VALUE SPACES.      01263147
012632                                                                  01263247
012633     05  PV-DISPLAY-OPER             PIC  9(04) VALUE ZEROES.     01263300
012634     05  PV-DISPLAY-SQLCODE          PIC  9(03)- VALUE ZEROES.    01263400
012640     05  PV-DB2-TABLE-NAME1          PIC  X(15) VALUE SPACES.     01264000
012700                                                                  01270000
012800     05  PV-DISPLAY-READ-COUNT       PIC ZZZ,ZZZ,ZZ9.             01280000
012900     05  PV-DISPLAY-WRITE-COUNT      PIC ZZZ,ZZZ,ZZ9.             01290000
013000     05  PV-DISPLAY-PERCENT1         PIC ZZZ.99.                  01300000
013100     05  PV-DISPLAY-PERCENT2         PIC ZZZ.                     01310000
013200                                                                  01320000
013300 01  PV-SAVE-FIELDS.                                              01330000
013400     05  PV-SAVE-OPER-UNT-ID          PIC S9(04) COMP             01340000
013500                                                 VALUE +0.        01350000
013600 01  DK-DB-KEYS.                                                  01360000
013700     05  DK-OPER-UNT-ID              PIC S9(4) COMP.              01370000
013800                                                                  01380000
013900 01  REPORT-DATES.                                                01390000
014000     05  REPORT-FROM-DATE            PIC X(10).                   01400000
014100     05  REPORT-TO-DATE              PIC X(10).                   01410000
014110                                                                  01411004
014200******************************************************************01420000
014300*    DATE CONTROL CARD                                            01430000
014400******************************************************************01440000
014500     COPY SURD032.                                                01450000
014510                                                                  01451000
014520******************************************************************01452000
014530* RECORD LAYOUT FOR THE INPUT FILE.                               01453000
014540******************************************************************01454000
014550     COPY SURD129.                                                01455000
014551                                                                  01455120
014552******************************************************************01455296
014553* RECORD LAYOUT FOR THE SELECTION FILE.                           01455396
014554******************************************************************01455496
014555     COPY SURD134.                                                01455596
014556                                                                  01455696
014557******************************************************************01455720
014558* RECORD LAYOUT FOR THE OUTPUT FILE COMMA DELIMITED COUNTS        01455820
014559******************************************************************01455920
014560     COPY SURD130.                                                01456020
014700                                                                  01470000
014800******************************************************************01480000
014900*  WORK FIELDS FOR PRINTING A 150 CHARACTER REPORT.               01490000
015000******************************************************************01500000
015100     COPY DPWS150O.                                               01510000
015200                                                                  01520000
015300 01  WS-BATCH-PROC-DATE.                                          01530000
015400     05  WS-BATCH-PROC-CC            PIC X(02) VALUE SPACES.      01540000
015500     05  WS-BATCH-PROC-YY            PIC X(02) VALUE SPACES.      01550000
015600     05  FILLER                      PIC X(01) VALUE SPACES.      01560000
015700     05  WS-BATCH-PROC-MM            PIC X(02) VALUE SPACES.      01570000
015800     05  FILLER                      PIC X(01) VALUE SPACES.      01580000
015900     05  WS-BATCH-PROC-DD            PIC X(02) VALUE SPACES.      01590000
016000*                                                                 01600000
016100 01  HEADING-LINES.                                               01610000
016200     05  HEADING-LINE1.                                           01620000
016300         10  FILLER                  PIC X(45) VALUE SPACES.      01630096
016310         10  HL1-SELECTION           PIC X(04) VALUE SPACES.      01631096
016320             88  HL1-RDC-STORES                VALUE SPACES.      01632096
016330             88  HL1-EFC-STORES                VALUE 'EFC '.      01633096
016340             88  HL1-LFC-STORES                VALUE 'LFC '.      01634096
016400         10  FILLER                  PIC X(54) VALUE              01640000
016500         'SHIPPED TRAILERS AVG DAYS SUMMARY BY SOURCE - DC LEVEL'.01650000
016600         10  FILLER                  PIC X(53) VALUE SPACES.      01660000
016700                                                                  01670000
016800     05  HEADING-LINE1A.                                          01680000
016900         10  FILLER                  PIC X(57) VALUE SPACES.      01690063
017000         10  FILLER                  PIC X(07) VALUE              01700063
017010         'FISCAL '.                                               01701063
017011*             WEEK - MONTH - MTD - YTD                            01701199
017012         10  H1A-FISCAL-PERIOD       PIC X(07) VALUE              01701263
017013         'WEEK  '.                                                01701363
017020         10  HD1A-FROM-DATE          PIC X(10) VALUE SPACES.      01702000
017030         10  FILLER                  PIC X(03) VALUE ' - '.       01703000
017040         10  HD1A-TO-DATE            PIC X(10) VALUE SPACES.      01704000
017050         10  FILLER                  PIC X(59) VALUE SPACES.      01705000
017060                                                                  01706000
017500     05  HEADING-LINE3.                                           01750000
017600         10  FILLER            PIC X(38) VALUE SPACES.            01760065
017700         10  FILLER            PIC X(05) VALUE '     '.           01770000
017800         10  FILLER            PIC X(02) VALUE SPACES.            01780000
017810         10  FILLER            PIC X(05) VALUE '     '.           01781065
017820         10  FILLER            PIC X(02) VALUE SPACES.            01782065
017900         10  FILLER            PIC X(05) VALUE '     '.           01790000
018000         10  FILLER            PIC X(02) VALUE SPACES.            01800000
018010         10  FILLER            PIC X(05) VALUE '     '.           01801000
018020         10  FILLER            PIC X(02) VALUE SPACES.            01802000
018030         10  FILLER            PIC X(05) VALUE '     '.           01803000
018040         10  FILLER            PIC X(02) VALUE SPACES.            01804000
018050         10  FILLER            PIC X(05) VALUE '     '.           01805061
018060         10  FILLER            PIC X(02) VALUE SPACES.            01806000
018070         10  FILLER            PIC X(05) VALUE '     '.           01807060
018080         10  FILLER            PIC X(02) VALUE SPACES.            01808000
018090         10  FILLER            PIC X(05) VALUE 'TOTE/'.           01809061
018100         10  FILLER            PIC X(02) VALUE SPACES.            01810000
018200         10  FILLER            PIC X(05) VALUE ' CRTN'.           01820000
018300         10  FILLER            PIC X(02) VALUE SPACES.            01830000
018400         10  FILLER            PIC X(05) VALUE ' CRTN'.           01840000
018500         10  FILLER            PIC X(02) VALUE SPACES.            01850000
018600         10  FILLER            PIC X(05) VALUE ' CRTN'.           01860000
018700         10  FILLER            PIC X(02) VALUE SPACES.            01870000
018800         10  FILLER            PIC X(05) VALUE '     '.           01880000
018810         10  FILLER            PIC X(02) VALUE SPACES.            01881000
018820         10  FILLER            PIC X(05) VALUE '     '.           01882000
018830         10  FILLER            PIC X(02) VALUE SPACES.            01883000
018840         10  FILLER            PIC X(05) VALUE '     '.           01884062
018850         10  FILLER            PIC X(02) VALUE SPACES.            01885000
018860         10  FILLER            PIC X(05) VALUE '     '.           01886000
018870         10  FILLER            PIC X(02) VALUE SPACES.            01887000
018871         10  FILLER            PIC X(05) VALUE '     '.           01887100
018872         10  FILLER            PIC X(02) VALUE SPACES.            01887265
018873                                                                  01887300
018874     05  HEADING-LINE4.                                           01887400
018875         10  FILLER            PIC X(38) VALUE SPACES.            01887565
018876         10  FILLER            PIC X(05) VALUE '     '.           01887600
018877         10  FILLER            PIC X(02) VALUE SPACES.            01887700
018878         10  FILLER            PIC X(05) VALUE '     '.           01887865
018879         10  FILLER            PIC X(02) VALUE SPACES.            01887965
018880         10  FILLER            PIC X(05) VALUE '     '.           01888000
018881         10  FILLER            PIC X(02) VALUE SPACES.            01888100
018882         10  FILLER            PIC X(05) VALUE '     '.           01888200
018890         10  FILLER            PIC X(02) VALUE SPACES.            01889000
018900         10  FILLER            PIC X(05) VALUE ' TOTE'.           01890059
018910         10  FILLER            PIC X(02) VALUE SPACES.            01891000
018920         10  FILLER            PIC X(05) VALUE ' TOTE'.           01892061
018921         10  FILLER            PIC X(02) VALUE SPACES.            01892100
018922         10  FILLER            PIC X(05) VALUE ' TOTE'.           01892260
018923         10  FILLER            PIC X(02) VALUE SPACES.            01892300
018924         10  FILLER            PIC X(05) VALUE ' CRTN'.           01892461
018925         10  FILLER            PIC X(02) VALUE SPACES.            01892500
018926         10  FILLER            PIC X(05) VALUE ' ARVL'.           01892600
018927         10  FILLER            PIC X(02) VALUE SPACES.            01892700
018928         10  FILLER            PIC X(05) VALUE '  ON '.           01892800
018929         10  FILLER            PIC X(02) VALUE SPACES.            01892900
018930         10  FILLER            PIC X(05) VALUE '  ON '.           01893000
018931         10  FILLER            PIC X(02) VALUE SPACES.            01893100
018932         10  FILLER            PIC X(05) VALUE ' ARVL'.           01893232
018933         10  FILLER            PIC X(02) VALUE SPACES.            01893300
018934         10  FILLER            PIC X(05) VALUE ' ARVL'.           01893432
018935         10  FILLER            PIC X(02) VALUE SPACES.            01893500
018936         10  FILLER            PIC X(05) VALUE ' TRLR'.           01893600
018937         10  FILLER            PIC X(02) VALUE SPACES.            01893700
018938         10  FILLER            PIC X(05) VALUE ' TRLR'.           01893832
018939         10  FILLER            PIC X(02) VALUE SPACES.            01893900
018940         10  FILLER            PIC X(05) VALUE ' TRLR'.           01894032
018950         10  FILLER            PIC X(02) VALUE SPACES.            01895065
018960                                                                  01896000
018970     05  HEADING-LINE5.                                           01897000
018980         10  FILLER            PIC X(38) VALUE SPACES.            01898065
018990         10  FILLER            PIC X(05) VALUE '  %  '.           01899065
019000         10  FILLER            PIC X(02) VALUE SPACES.            01900000
019001         10  FILLER            PIC X(05) VALUE ' ARVL'.           01900165
019002         10  FILLER            PIC X(02) VALUE SPACES.            01900265
019003         10  FILLER            PIC X(05) VALUE 'CK-IN'.           01900300
019004         10  FILLER            PIC X(02) VALUE SPACES.            01900400
019005         10  FILLER            PIC X(05) VALUE ' ARVL'.           01900500
019006         10  FILLER            PIC X(02) VALUE SPACES.            01900600
019007         10  FILLER            PIC X(05) VALUE ' OPEN'.           01900700
019008         10  FILLER            PIC X(02) VALUE SPACES.            01900800
019009         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01900961
019010         10  FILLER            PIC X(02) VALUE SPACES.            01901000
019011         10  FILLER            PIC X(05) VALUE ' OPEN'.           01901161
019012         10  FILLER            PIC X(02) VALUE SPACES.            01901200
019013         10  FILLER            PIC X(05) VALUE '  TO '.           01901361
019014         10  FILLER            PIC X(02) VALUE SPACES.            01901400
019015         10  FILLER            PIC X(05) VALUE '  TO '.           01901500
019016         10  FILLER            PIC X(02) VALUE SPACES.            01901600
019017         10  FILLER            PIC X(05) VALUE ' TRLR'.           01901700
019018         10  FILLER            PIC X(02) VALUE SPACES.            01901800
019019         10  FILLER            PIC X(05) VALUE ' TRLR'.           01901900
019020         10  FILLER            PIC X(02) VALUE SPACES.            01902000
019021         10  FILLER            PIC X(05) VALUE '  TO '.           01902132
019022         10  FILLER            PIC X(02) VALUE SPACES.            01902200
019023         10  FILLER            PIC X(05) VALUE '  TO '.           01902332
019024         10  FILLER            PIC X(02) VALUE SPACES.            01902400
019025         10  FILLER            PIC X(05) VALUE ' OPEN'.           01902500
019026         10  FILLER            PIC X(02) VALUE SPACES.            01902600
019027         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01902732
019028         10  FILLER            PIC X(02) VALUE SPACES.            01902800
019029         10  FILLER            PIC X(05) VALUE ' OPEN'.           01902932
019030         10  FILLER            PIC X(02) VALUE SPACES.            01903065
019031                                                                  01903100
019032     05  HEADING-LINE6.                                           01903200
019040         10  FILLER            PIC X(02) VALUE SPACES.            01904000
019050         10  FILLER            PIC X(02) VALUE 'DC'.              01905000
019060         10  FILLER            PIC X(02) VALUE SPACES.            01906000
019061         10  FILLER            PIC X(05) VALUE '  DC '.           01906109
019062         10  FILLER            PIC X(02) VALUE SPACES.            01906200
019063         10  FILLER            PIC X(04) VALUE SPACES.            01906309
019064         10  FILLER            PIC X(21) VALUE SPACES.            01906465
019065         10  FILLER            PIC X(05) VALUE '  OF '.           01906565
019066         10  FILLER            PIC X(02) VALUE SPACES.            01906600
019067         10  FILLER            PIC X(05) VALUE '  TO '.           01906765
019068         10  FILLER            PIC X(02) VALUE SPACES.            01906865
019069         10  FILLER            PIC X(05) VALUE '  TO '.           01906900
019070         10  FILLER            PIC X(02) VALUE SPACES.            01907000
019071         10  FILLER            PIC X(05) VALUE '  TO '.           01907100
019072         10  FILLER            PIC X(02) VALUE SPACES.            01907200
019073         10  FILLER            PIC X(05) VALUE '  TO '.           01907300
019074         10  FILLER            PIC X(02) VALUE SPACES.            01907400
019075         10  FILLER            PIC X(05) VALUE '  TO '.           01907561
019076         10  FILLER            PIC X(02) VALUE SPACES.            01907600
019077         10  FILLER            PIC X(05) VALUE '  TO '.           01907760
019078         10  FILLER            PIC X(02) VALUE SPACES.            01907800
019079         10  FILLER            PIC X(05) VALUE 'OTBND'.           01907961
019080         10  FILLER            PIC X(02) VALUE SPACES.            01908000
019081         10  FILLER            PIC X(05) VALUE 'OTBND'.           01908100
019082         10  FILLER            PIC X(02) VALUE SPACES.            01908200
019083         10  FILLER            PIC X(05) VALUE '  TO '.           01908300
019084         10  FILLER            PIC X(02) VALUE SPACES.            01908400
019085         10  FILLER            PIC X(05) VALUE '  TO '.           01908500
019086         10  FILLER            PIC X(02) VALUE SPACES.            01908600
019087         10  FILLER            PIC X(05) VALUE ' TRLR'.           01908732
019088         10  FILLER            PIC X(02) VALUE SPACES.            01908800
019089         10  FILLER            PIC X(05) VALUE ' TRLR'.           01908932
019090         10  FILLER            PIC X(02) VALUE SPACES.            01909000
019091         10  FILLER            PIC X(05) VALUE '  TO '.           01909100
019092         10  FILLER            PIC X(02) VALUE SPACES.            01909200
019093         10  FILLER            PIC X(05) VALUE '  TO '.           01909332
019094         10  FILLER            PIC X(02) VALUE SPACES.            01909400
019095         10  FILLER            PIC X(05) VALUE '  TO '.           01909532
019096         10  FILLER            PIC X(02) VALUE SPACES.            01909665
019097                                                                  01909700
019098     05  HEADING-LINE7.                                           01909800
019099         10  FILLER            PIC X(02) VALUE SPACES.            01909900
019100         10  FILLER            PIC X(03) VALUE 'NBR'.             01910000
019101         10  FILLER            PIC X(02) VALUE SPACES.            01910100
019102         10  FILLER            PIC X(04) VALUE 'NAME'.            01910209
019110         10  FILLER            PIC X(06) VALUE SPACES.            01911009
019112         10  FILLER            PIC X(04) VALUE SPACES.            01911200
019113         10  FILLER            PIC X(13) VALUE 'CARTON SOURCE'.   01911332
019114         10  FILLER            PIC X(04) VALUE SPACES.            01911465
019115         10  FILLER            PIC X(05) VALUE ' CRTN'.           01911565
019116         10  FILLER            PIC X(02) VALUE SPACES.            01911600
019117         10  FILLER            PIC X(05) VALUE 'CK-IN'.           01911765
019118         10  FILLER            PIC X(02) VALUE SPACES.            01911865
019119         10  FILLER            PIC X(05) VALUE ' PACK'.           01911900
019120         10  FILLER            PIC X(02) VALUE SPACES.            01912000
019121         10  FILLER            PIC X(05) VALUE ' PACK'.           01912100
019122         10  FILLER            PIC X(02) VALUE SPACES.            01912200
019123         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01912300
019124         10  FILLER            PIC X(02) VALUE SPACES.            01912400
019125         10  FILLER            PIC X(05) VALUE ' TRLR'.           01912500
019126         10  FILLER            PIC X(02) VALUE SPACES.            01912600
019127         10  FILLER            PIC X(05) VALUE ' TRLR'.           01912700
019128         10  FILLER            PIC X(02) VALUE SPACES.            01912800
019129         10  FILLER            PIC X(05) VALUE ' TRLR'.           01912900
019130         10  FILLER            PIC X(02) VALUE SPACES.            01913000
019131         10  FILLER            PIC X(05) VALUE ' TRLR'.           01913100
019132         10  FILLER            PIC X(02) VALUE SPACES.            01913200
019133         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01913300
019134         10  FILLER            PIC X(02) VALUE SPACES.            01913400
019135         10  FILLER            PIC X(05) VALUE ' SHIP'.           01913500
019136         10  FILLER            PIC X(02) VALUE SPACES.            01913600
019137         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01913700
019138         10  FILLER            PIC X(02) VALUE SPACES.            01913800
019139         10  FILLER            PIC X(05) VALUE ' SHIP'.           01913900
019140         10  FILLER            PIC X(02) VALUE SPACES.            01914000
019141         10  FILLER            PIC X(05) VALUE 'CLOSE'.           01914132
019142         10  FILLER            PIC X(02) VALUE SPACES.            01914200
019143         10  FILLER            PIC X(05) VALUE ' SHIP'.           01914332
019144         10  FILLER            PIC X(02) VALUE SPACES.            01914400
019145         10  FILLER            PIC X(05) VALUE ' SHIP'.           01914500
019146         10  FILLER            PIC X(02) VALUE SPACES.            01914665
019147                                                                  01914700
019148 01  DETAIL-LINES.                                                01914800
019149     05  DETAIL-LINE1.                                            01914900
019150         10  FILLER                   PIC  X(01) VALUE SPACES.    01915002
019151         10  DL1-DC-NBR               PIC  Z(04) VALUE ZEROES.    01915100
019152         10  FILLER                   PIC  X(01) VALUE SPACES.    01915200
019160         10  DL1-DC-NAME              PIC  X(14) VALUE ZEROES.    01916029
019190         10  FILLER                   PIC  X(01) VALUE SPACES.    01919000
019200         10  DL1-SOURCE               PIC  X(16) VALUE SPACES.    01920000
019300         10  FILLER                   PIC  X(01)  VALUE SPACES.   01930000
019400*                                                                 01940065
019500         10  DL1-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     01950098
019600         10  FILLER                   PIC  X(01)  VALUE SPACES.   01960098
019610*  <5>                                                            01961065
019620         10  DL1-ARVL-CKIN            PIC  ZZZ.9  VALUE ZERO.     01962065
019630         10  FILLER                   PIC  X(02)  VALUE SPACES.   01963065
019700*  <6>                                                            01970000
019800         10  DL1-P2L-CKIN-PACK        PIC  ZZZ.9  VALUE ZERO.     01980037
019900         10  FILLER                   PIC  X(02)  VALUE SPACES.   01990037
020000*  <7>                                                            02000000
020100         10  DL1-P2L-ARVL-PACK        PIC  ZZZ.9  VALUE ZERO.     02010037
020200         10  FILLER                   PIC  X(02)  VALUE SPACES.   02020037
020300*  <8>                                                            02030000
020400         10  DL1-P2L-OPEN-CLOSE       PIC  ZZZ.9  VALUE ZERO.     02040037
020500         10  FILLER                   PIC  X(02)  VALUE SPACES.   02050037
021200*  <8.2>                                                          02120058
021210         10  DL1-P2L-CLOSE-TRLR       PIC  ZZZ.9  VALUE ZERO.     02121058
021400         10  FILLER                   PIC  X(02)  VALUE SPACES.   02140037
021410*  <8.1>                                                          02141060
021420         10  DL1-P2L-OPEN-TRLR        PIC  ZZZ.9  VALUE ZERO.     02142060
021430         10  FILLER                   PIC  X(02)  VALUE SPACES.   02143060
021440*  <9>                                                            02144061
021450         10  DL1-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02145061
021460         10  FILLER                   PIC  X(02)  VALUE SPACES.   02146061
021500* <10>                                                            02150000
021600         10  DL1-ARVL-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02160037
021700         10  FILLER                   PIC  X(02)  VALUE SPACES.   02170037
021800* <11>                                                            02180000
021900         10  DL1-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02190037
022000         10  FILLER                   PIC  X(02)  VALUE SPACES.   02200037
022100* <11.5>                                                          02210000
022200         10  DL1-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02220037
022300         10  FILLER                   PIC  X(02)  VALUE SPACES.   02230037
022400* <15>                                                            02240032
022500         10  DL1-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02250037
022600         10  FILLER                   PIC  X(02)  VALUE SPACES.   02260037
022700* <16>                                                            02270032
022800         10  DL1-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02280037
022900         10  FILLER                   PIC  X(02)  VALUE SPACES.   02290037
023000* <12>                                                            02300032
023100         10  FILLER                   PIC  X(06)  VALUE SPACES.   02310032
023200         10  FILLER                   PIC  X(01)  VALUE SPACES.   02320000
023300* <13>                                                            02330032
023400         10  FILLER                   PIC  X(06)  VALUE SPACES.   02340032
023500         10  FILLER                   PIC  X(01)  VALUE SPACES.   02350000
023600* <14>                                                            02360032
023610         10  FILLER                   PIC  X(06)  VALUE SPACES.   02361032
023620         10  FILLER                   PIC  X(02)  VALUE SPACES.   02362065
023630                                                                  02363000
023650     05  DETAIL-LINE2.                                            02365032
023660         10  FILLER                   PIC  X(01) VALUE SPACES.    02366032
023670         10  DL2-DC-NBR               PIC  Z(04) VALUE ZEROES.    02367032
023680         10  FILLER                   PIC  X(01) VALUE SPACES.    02368032
023681         10  DL2-DC-NAME              PIC  X(14) VALUE ZEROES.    02368132
023682         10  FILLER                   PIC  X(01) VALUE SPACES.    02368232
023683         10  DL2-SOURCE               PIC  X(16) VALUE SPACES.    02368332
023684         10  FILLER                   PIC  X(01)  VALUE SPACES.   02368432
023685*                                                                 02368565
023686         10  DL2-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02368698
023687         10  FILLER                   PIC  X(01)  VALUE SPACES.   02368798
023688*  <5>                                                            02368832
023689         10  DL2-ARVL-CKIN            PIC  ZZZ.9  VALUE ZERO.     02368937
023690         10  FILLER                   PIC  X(02)  VALUE SPACES.   02369037
023691*  <6>                                                            02369132
023692         10  DL2-P2L-CKIN-PACK        PIC  ZZZ.9  VALUE ZERO.     02369237
023693         10  FILLER                   PIC  X(02)  VALUE SPACES.   02369337
023694*  <7>                                                            02369432
023695         10  DL2-P2L-ARVL-PACK        PIC  ZZZ.9  VALUE ZERO.     02369537
023696         10  FILLER                   PIC  X(02)  VALUE SPACES.   02369637
023697*  <8>                                                            02369732
023698         10  DL2-P2L-OPEN-CLOSE       PIC  ZZZ.9  VALUE ZERO.     02369837
023699         10  FILLER                   PIC  X(02)  VALUE SPACES.   02369937
023703*  <8.2>                                                          02370358
023704         10  DL2-P2L-CLOSE-TRLR       PIC  ZZZ.9  VALUE ZERO.     02370458
023706         10  FILLER                   PIC  X(02)  VALUE SPACES.   02370637
023707*  <8.1>                                                          02370760
023708         10  DL2-P2L-OPEN-TRLR        PIC  ZZZ.9  VALUE ZERO.     02370860
023709         10  FILLER                   PIC  X(02)  VALUE SPACES.   02370960
023710*  <9>                                                            02371061
023711         10  DL2-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02371161
023712         10  FILLER                   PIC  X(02)  VALUE SPACES.   02371261
023713* <10>                                                            02371332
023714         10  DL2-ARVL-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02371437
023715         10  FILLER                   PIC  X(02)  VALUE SPACES.   02371537
023716* <11>                                                            02371632
023717         10  DL2-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02371737
023718         10  FILLER                   PIC  X(02)  VALUE SPACES.   02371837
023719* <11.5>                                                          02371932
023720         10  DL2-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02372037
023721         10  FILLER                   PIC  X(02)  VALUE SPACES.   02372137
023722* <15>                                                            02372232
023723         10  DL2-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02372337
023724         10  FILLER                   PIC  X(02)  VALUE SPACES.   02372437
023725* <16>                                                            02372532
023726         10  DL2-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02372637
023727         10  FILLER                   PIC  X(02)  VALUE SPACES.   02372737
023728* <12>                                                            02372832
023729         10  DL2-TRLR-OPEN-TO-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02372937
023730         10  FILLER                   PIC  X(02)  VALUE SPACES.   02373037
023731* <13>                                                            02373132
023732         10  DL2-TRLR-CLOSE-TO-SHIP   PIC  ZZZ.9  VALUE ZERO.     02373237
023733         10  FILLER                   PIC  X(02)  VALUE SPACES.   02373337
023734* <14>                                                            02373432
023735         10  DL2-TRLR-OPEN-TO-SHIP    PIC  ZZZ.9  VALUE ZERO.     02373537
023736         10  FILLER                   PIC X(02)  VALUE SPACES.    02373665
023740                                                                  02374039
023750*** DETAIL LINE 3 IS FOR XDOCK CARTONS                            02375045
023760*** USER DID NOT WANT .0 TO SHOW IN THE P2L CARTONS               02376039
023770*** WANTED BLANKS TO APPEAR                                       02377039
023780                                                                  02378039
023790     05  DETAIL-LINE3.                                            02379039
023792         10  FILLER                   PIC  X(01) VALUE SPACES.    02379240
023793         10  DL3-DC-NBR               PIC  Z(04) VALUE ZEROES.    02379340
023794         10  FILLER                   PIC  X(01) VALUE SPACES.    02379440
023795         10  DL3-DC-NAME              PIC  X(14) VALUE ZEROES.    02379540
023796         10  FILLER                   PIC  X(01) VALUE SPACES.    02379640
023797         10  DL3-SOURCE               PIC  X(16) VALUE SPACES.    02379740
023798         10  FILLER                   PIC  X(01)  VALUE SPACES.   02379840
023799*                                                                 02379965
023800         10  DL3-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02380098
023801         10  FILLER                   PIC  X(01)  VALUE SPACES.   02380198
023802*  <5>                                                            02380240
023803         10  DL3-ARVL-CKIN            PIC  ZZZ.9  VALUE ZERO.     02380340
023804         10  FILLER                   PIC  X(02)  VALUE SPACES.   02380440
023805*  <6>                                                            02380540
023806         10  FILLER                   PIC  X(05)  VALUE SPACES.   02380640
023807         10  FILLER                   PIC  X(02)  VALUE SPACES.   02380740
023808*  <7>                                                            02380840
023809         10  FILLER                   PIC  X(05)  VALUE SPACES.   02380940
023810         10  FILLER                   PIC  X(02)  VALUE SPACES.   02381040
023811*  <8>                                                            02381140
023812         10  FILLER                   PIC  X(05)  VALUE SPACES.   02381240
023813         10  FILLER                   PIC  X(02)  VALUE SPACES.   02381340
023818*  <8.2>                                                          02381858
023819         10  FILLER                   PIC  X(05)  VALUE SPACES.   02381958
023820         10  FILLER                   PIC  X(02)  VALUE SPACES.   02382040
023821*  <8.1>                                                          02382160
023822         10  FILLER                   PIC  X(05)  VALUE SPACES.   02382260
023823         10  FILLER                   PIC  X(02)  VALUE SPACES.   02382360
023824*  <9>                                                            02382461
023825         10  DL3-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02382561
023826         10  FILLER                   PIC  X(02)  VALUE SPACES.   02382661
023827* <10>                                                            02382740
023828         10  DL3-ARVL-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02382840
023829         10  FILLER                   PIC  X(02)  VALUE SPACES.   02382940
023830* <11>                                                            02383040
023831         10  DL3-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02383140
023832         10  FILLER                   PIC  X(02)  VALUE SPACES.   02383240
023833* <11.5>                                                          02383340
023834         10  DL3-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02383440
023835         10  FILLER                   PIC  X(02)  VALUE SPACES.   02383540
023836* <15>                                                            02383640
023837         10  DL3-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02383740
023838         10  FILLER                   PIC  X(02)  VALUE SPACES.   02383840
023839* <16>                                                            02383940
023840         10  DL3-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02384040
023841         10  FILLER                   PIC  X(02)  VALUE SPACES.   02384140
023842* <12>                                                            02384240
023843         10  FILLER                   PIC  X(06)  VALUE SPACES.   02384340
023844         10  FILLER                   PIC  X(01)  VALUE SPACES.   02384440
023845* <13>                                                            02384540
023846         10  FILLER                   PIC  X(06)  VALUE SPACES.   02384640
023847         10  FILLER                   PIC  X(01)  VALUE SPACES.   02384740
023848* <14>                                                            02384840
023849         10  FILLER                   PIC  X(06)  VALUE SPACES.   02384940
023850         10  FILLER                   PIC  X(08)  VALUE SPACES.   02385040
023860                                                                  02386040
023898         10  FILLER                   PIC  X(02)  VALUE SPACES.   02389865
023899                                                                  02389939
023900*** DETAIL LINE 4 IS FOR MASTER CONTAINERS                        02390039
023901*** USER DID NOT WANT .0 TO SHOW IN THE MST CARTONS               02390139
023902*** WANTED BLANKS TO APPEAR                                       02390239
023903                                                                  02390339
023904     05  DETAIL-LINE4.                                            02390439
023905         10  FILLER                   PIC  X(01) VALUE SPACES.    02390542
023906         10  DL4-DC-NBR               PIC  Z(04) VALUE ZEROES.    02390642
023907         10  FILLER                   PIC  X(01) VALUE SPACES.    02390742
023908         10  DL4-DC-NAME              PIC  X(14) VALUE ZEROES.    02390842
023909         10  FILLER                   PIC  X(01) VALUE SPACES.    02390942
023910         10  DL4-SOURCE               PIC  X(16) VALUE SPACES.    02391043
023920         10  FILLER                   PIC  X(01)  VALUE SPACES.   02392042
023921*                                                                 02392165
023922         10  DL4-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02392298
023923         10  FILLER                   PIC  X(01)  VALUE SPACES.   02392398
023930*  <5>                                                            02393042
023940         10  FILLER                   PIC  X(05)  VALUE SPACES.   02394042
023950         10  FILLER                   PIC  X(02)  VALUE SPACES.   02395042
023960*  <6>                                                            02396042
023970         10  DL4-P2L-CKIN-PACK        PIC  ZZZ.9  VALUE ZERO.     02397042
023980         10  FILLER                   PIC  X(02)  VALUE SPACES.   02398042
023990*  <7>                                                            02399042
024000         10  DL4-P2L-ARVL-PACK        PIC  ZZZ.9  VALUE ZERO.     02400042
024010         10  FILLER                   PIC  X(02)  VALUE SPACES.   02401042
024011*  <8>                                                            02401142
024012         10  DL4-P2L-OPEN-CLOSE       PIC  ZZZ.9  VALUE ZERO.     02401242
024013         10  FILLER                   PIC  X(02)  VALUE SPACES.   02401342
024024*  <8.2>                                                          02402460
024025         10  DL4-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02402560
024026         10  FILLER                   PIC  X(02)  VALUE SPACES.   02402660
024027*  <8.1>                                                          02402760
024028         10  FILLER                   PIC  X(05)  VALUE SPACES.   02402860
024029         10  FILLER                   PIC  X(02)  VALUE SPACES.   02402960
024030*  <9>                                                            02403061
024031         10  FILLER                   PIC  X(05)  VALUE SPACES.   02403161
024032         10  FILLER                   PIC  X(02)  VALUE SPACES.   02403261
024033* <10>                                                            02403342
024034         10  FILLER                   PIC  X(05)  VALUE SPACES.   02403442
024035         10  FILLER                   PIC  X(02)  VALUE SPACES.   02403542
024036* <11>                                                            02403642
024037         10  DL4-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02403742
024038         10  FILLER                   PIC  X(02)  VALUE SPACES.   02403842
024039* <11.5>                                                          02403942
024040         10  DL4-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02404042
024041         10  FILLER                   PIC  X(02)  VALUE SPACES.   02404142
024042* <15>                                                            02404242
024043         10  DL4-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02404342
024044         10  FILLER                   PIC  X(02)  VALUE SPACES.   02404442
024045* <16>                                                            02404542
024046         10  DL4-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02404642
024047         10  FILLER                   PIC  X(02)  VALUE SPACES.   02404742
024048* <12>                                                            02404842
024049         10  FILLER                   PIC  X(06)  VALUE SPACES.   02404942
024050         10  FILLER                   PIC  X(01)  VALUE SPACES.   02405042
024051* <13>                                                            02405142
024052         10  FILLER                   PIC  X(06)  VALUE SPACES.   02405242
024053         10  FILLER                   PIC  X(01)  VALUE SPACES.   02405342
024054* <14>                                                            02405442
024055         10  FILLER                   PIC  X(06)  VALUE SPACES.   02405542
024056         10  FILLER                   PIC  X(02)  VALUE SPACES.   02405665
024057                                                                  02405739
024058*** DETAIL LINE 5 IS FOR RDM (IR-IMPORT REPLEN) CARTONS           02405845
024059*** USER DID NOT WANT .0 TO SHOW IN THE P2L CARTONS               02405945
024060*** WANTED BLANKS TO APPEAR                                       02406045
024061                                                                  02406145
024062     05  DETAIL-LINE5.                                            02406246
024063         10  FILLER                   PIC  X(01) VALUE SPACES.    02406345
024064         10  DL5-DC-NBR               PIC  Z(04) VALUE ZEROES.    02406445
024065         10  FILLER                   PIC  X(01) VALUE SPACES.    02406545
024066         10  DL5-DC-NAME              PIC  X(14) VALUE ZEROES.    02406645
024067         10  FILLER                   PIC  X(01) VALUE SPACES.    02406745
024068         10  DL5-SOURCE               PIC  X(16) VALUE SPACES.    02406845
024069         10  FILLER                   PIC  X(01)  VALUE SPACES.   02406945
024070*                                                                 02407065
024071         10  DL5-CRTN-PCNT            PIC  ZZZ.99 VALUE ZERO.     02407198
024072         10  FILLER                   PIC  X(01)  VALUE SPACES.   02407298
024073*  <5>                                                            02407345
024074         10  FILLER                   PIC  X(05)  VALUE SPACES.   02407445
024075         10  FILLER                   PIC  X(02)  VALUE SPACES.   02407545
024076*  <6>                                                            02407645
024077         10  FILLER                   PIC  X(05)  VALUE SPACES.   02407745
024078         10  FILLER                   PIC  X(02)  VALUE SPACES.   02407845
024079*  <7>                                                            02407945
024080         10  FILLER                   PIC  X(05)  VALUE SPACES.   02408045
024081         10  FILLER                   PIC  X(02)  VALUE SPACES.   02408145
024082*  <8>                                                            02408245
024083         10  FILLER                   PIC  X(05)  VALUE SPACES.   02408345
024084         10  FILLER                   PIC  X(02)  VALUE SPACES.   02408445
024085*  <8.2>                                                          02408558
024086         10  FILLER                   PIC  X(05)  VALUE SPACES.   02408658
024087         10  FILLER                   PIC  X(02)  VALUE SPACES.   02408745
024088*  <8.1>                                                          02408860
024089         10  FILLER                   PIC  X(05)  VALUE SPACES.   02408960
024090         10  FILLER                   PIC  X(02)  VALUE SPACES.   02409060
024091*  <9>                                                            02409161
024092         10  DL5-CKIN-OTBND-TRLR      PIC  ZZZ.9  VALUE ZERO.     02409261
024093         10  FILLER                   PIC  X(02)  VALUE SPACES.   02409361
024094* <10>                                                            02409445
024095         10  FILLER                   PIC  X(05)  VALUE SPACES.   02409548
024096         10  FILLER                   PIC  X(02)  VALUE SPACES.   02409645
024097* <11>                                                            02409745
024098         10  DL5-ON-TRLR-TO-CLOSE     PIC  ZZZ.9  VALUE ZERO.     02409845
024099         10  FILLER                   PIC  X(02)  VALUE SPACES.   02409945
024100* <11.5>                                                          02410045
024101         10  DL5-ON-TRLR-TO-SHIP      PIC  ZZZ.9  VALUE ZERO.     02410145
024102         10  FILLER                   PIC  X(02)  VALUE SPACES.   02410245
024103* <15>                                                            02410345
024104         10  DL5-ARVL-TO-TRLR-CLOSE   PIC  ZZZ.9  VALUE ZERO.     02410445
024105         10  FILLER                   PIC  X(02)  VALUE SPACES.   02410545
024106* <16>                                                            02410645
024107         10  DL5-ARVL-TO-TRLR-SHIP    PIC  ZZZ.9  VALUE ZERO.     02410745
024108         10  FILLER                   PIC  X(02)  VALUE SPACES.   02410845
024109* <12>                                                            02410945
024110         10  FILLER                   PIC  X(06)  VALUE SPACES.   02411045
024111         10  FILLER                   PIC  X(01)  VALUE SPACES.   02411145
024112* <13>                                                            02411245
024113         10  FILLER                   PIC  X(06)  VALUE SPACES.   02411345
024114         10  FILLER                   PIC  X(01)  VALUE SPACES.   02411445
024115* <14>                                                            02411545
024116         10  FILLER                   PIC  X(06)  VALUE SPACES.   02411645
024117         10  FILLER                   PIC  X(08)  VALUE SPACES.   02411745
024118                                                                  02411845
024119         10  FILLER                   PIC  X(02)  VALUE SPACES.   02411965
024120*                                                                 02412082
024121*** TOTAL LINE TO SHOW THE NUMBER OF OUTBOUND TRIPS               02412182
024122*                                                                 02412282
024123                                                                  02412382
024124     05  DETAIL-LINE6.                                            02412482
024125         10  FILLER                   PIC  X(01) VALUE SPACES.    02412582
024126         10  DL6-DC-NBR               PIC  Z(04) VALUE ZEROES.    02412682
024127         10  FILLER                   PIC  X(01) VALUE SPACES.    02412782
024128         10  DL6-DC-NAME              PIC  X(14) VALUE ZEROES.    02412882
024129         10  FILLER                   PIC  X(01) VALUE SPACES.    02412982
024130         10  DL6-SOURCE               PIC  X(14) VALUE SPACES.    02413082
024131         10  FILLER                   PIC  X(01)  VALUE SPACES.   02413182
024132*                                                                 02413282
024133         10  DL6-TOTAL-TRIPS          PIC  ZZZ,ZZZ VALUE ZERO.    02413382
024134         10  FILLER                   PIC  X(107) VALUE SPACES.   02413482
024182                                                                  02418245
024183 01  MISCELLANEOUS-LINES.                                         02418300
024184     05  BLANK-LINE.                                              02418400
024185         10  FILLER                  PIC X(150) VALUE SPACES.     02418500
024186                                                                  02418600
024187     05  END-OF-REPORT-LINE.                                      02418700
024188         10  FILLER                  PIC X(44) VALUE SPACES.      02418800
024189         10  FILLER                  PIC X(45) VALUE              02418900
024190             '*******   E N D   O F   R E P O R T   *******'.     02419000
024191         10  FILLER                  PIC X(43) VALUE SPACES.      02419100
024192         10  FILLER                  PIC X(18) VALUE SPACES.      02419200
024193                                                                  02419300
024200     05  NO-DATA-TO-REPORT-LINE.                                  02420000
024300         10  FILLER                  PIC X(40) VALUE SPACES.      02430000
024400         10  FILLER                  PIC  X(52)    VALUE          02440000
024500         '*******  N O   D A T A   T O   R E P O R T   *******'.  02450000
024600         10  FILLER                  PIC  X(40)    VALUE SPACES.  02460000
024700         10  FILLER                  PIC X(18) VALUE SPACES.      02470000
024800                                                                  02480000
024900                                                                  02490000
025000******************************************************************02500000
025100*  USED FOR DB2 ERROR MESSAGE BUILDING                            02510000
025200******************************************************************02520000
025300     COPY DPWS004.                                                02530000
025400                                                                  02540000
025500******************************************************************02550000
025600*   DB2 SQL COMMUNICATION AREA                                    02560000
025700******************************************************************02570000
025800     EXEC SQL                                                     02580000
025900          INCLUDE SQLCA                                           02590000
026000     END-EXEC.                                                    02600000
026100                                                                  02610000
026200*---------------------------------------------------------------* 02620000
026300*  DCLGEN FOR THE LOGISTICS LOCATION TABLE                        02630000
026400*  XLT_LOC                                                        02640000
026500*---------------------------------------------------------------* 02650000
026600     EXEC SQL                                                     02660000
026700          INCLUDE XLT00010                                        02670000
026800     END-EXEC.                                                    02680000
026900                                                                  02690000
027000******************************************************************02700000
027100 PROCEDURE DIVISION.                                              02710000
027200     DISPLAY '**** START OF SUKRP072 ****'.                       02720000
027300                                                                  02730000
027400*OPEN FILES.                                                      02740000
027500     OPEN INPUT  INPUT-FILE                                       02750000
027600                 CONTROL-FILE                                     02760000
027610                 SELECTION-FILE                                   02761096
027700          OUTPUT REPORT-FILE                                      02770019
027800                 OUTPUT-FILE.                                     02780019
027900                                                                  02790000
028000     PERFORM 1000-INITIALIZATION.                                 02800000
028100                                                                  02810000
028200     SET  PS-NOT-END-OF-INPUT   TO  TRUE.                         02820000
028300                                                                  02830000
028400     PERFORM 7000-READ-EXTRACT-FILE.                              02840000
028500                                                                  02850000
028700     MOVE SU129-OPER-UNT-ID     TO  PV-PREV-OPER.                 02870000
028800     MOVE SU129-SML-SRC-CDE     TO  PV-PREV-SOURCE.               02880010
028810     MOVE SU129-REPORT-SORT-SEQ TO  PV-PREV-SEQ.                  02881036
028900                                                                  02890000
029000     IF PS-END-OF-INPUT                                           02900000
029100        ADD +1                  TO PV-PAGE-COUNT                  02910000
029200        MOVE PV-PAGE-COUNT      TO DP150O-PAGE-NUMBER             02920000
029300        WRITE REPORT-RECORD                                       02930000
029400          FROM DP150O-STANDRD-HEADER-150-COLS                     02940000
029500            AFTER ADVANCING PAGE                                  02950000
029600        WRITE REPORT-RECORD                                       02960000
029700          FROM HEADING-LINE1                                      02970000
029800            AFTER ADVANCING 1 LINES                               02980000
029900        WRITE REPORT-RECORD                                       02990000
030000          FROM HEADING-LINE1A                                     03000000
030100            AFTER ADVANCING 1 LINES                               03010000
030500        WRITE REPORT-RECORD                                       03050000
030600          FROM NO-DATA-TO-REPORT-LINE                             03060000
030700            AFTER ADVANCING 2 LINES                               03070000
030800     ELSE                                                         03080000
030900         MOVE SU129-OPER-UNT-ID  TO PV-SAVE-OPER-UNT-ID           03090027
031000         PERFORM 8500-GET-LOCATION-NAME                           03100027
031100         PERFORM 1500-PRINT-HEADINGS                              03110027
031200         PERFORM 2000-PROCESS-INPUT                               03120027
031300           UNTIL PS-END-OF-INPUT                                  03130027
031301         PERFORM 3000-CALC-AREA-AVERAGES                          03130149
031302         PERFORM 3005-CALC-SRC-CRTN-PCNT                          03130266
031303         PERFORM 5000-PRINT-AREA-AVERAGE                          03130366
031310         PERFORM 3010-ACCUM-TRLR-TOTALS                           03131027
031320         PERFORM 3020-CALC-TRIP-AVERAGES                          03132027
031330         PERFORM 5020-PRINT-TRLR-TOTALS                           03133053
031340*                                                                 03134051
031350* CALCULATE/PRINT CORP TOTALS                                     03135051
031360*                                                                 03136051
031361         PERFORM 1500-PRINT-HEADINGS                              03136195
031370***      PERFORM 6000-PRINT-BLANK-LINE                            03137095
031380         PERFORM 3040-CALC-CORP-AVERAGES                          03138053
031400     END-IF.                                                      03140000
031500                                                                  03150000
031550                                                                  03155051
031600*FINISH REPORT.                                                   03160000
031700                                                                  03170000
031800     WRITE REPORT-RECORD                                          03180000
031900       FROM END-OF-REPORT-LINE                                    03190000
032000         AFTER ADVANCING 3 LINES.                                 03200000
032100                                                                  03210000
032200*CLOSE FILES.                                                     03220000
032300     CLOSE INPUT-FILE                                             03230000
032400           CONTROL-FILE                                           03240000
032410           SELECTION-FILE                                         03241096
032500           REPORT-FILE                                            03250019
032600           OUTPUT-FILE.                                           03260019
032700                                                                  03270000
032800     MOVE PV-READ-COUNT TO PV-DISPLAY-READ-COUNT.                 03280000
032900     DISPLAY 'TOTAL INPUT READ ' PV-DISPLAY-READ-COUNT.           03290000
033000                                                                  03300000
033100     MOVE PV-WRITE-COUNT TO PV-DISPLAY-WRITE-COUNT.               03310000
033200     DISPLAY 'TOTAL RECS WRITTEN ' PV-DISPLAY-WRITE-COUNT.        03320000
033300                                                                  03330000
033400     GOBACK.                                                      03340000
033500                                                                  03350000
033600******************************************************************03360000
033700*  PERFORM THE INITIAL PROCESSING FOR THE PROGRAM.               *03370000
033800******************************************************************03380000
033900 1000-INITIALIZATION.                                             03390000
034000     ACCEPT SD-SYSTEM-DATE                                        03400000
034100       FROM DATE.                                                 03410000
034200                                                                  03420000
034300     ACCEPT SD-SYSTEM-TIME                                        03430000
034400       FROM TIME.                                                 03440000
034500                                                                  03450000
034600     MOVE SD-SYSTEM-DATE-MM  TO DP150O-RUN-MONTH.                 03460000
034700     MOVE SD-SYSTEM-DATE-DD  TO DP150O-RUN-DAY.                   03470000
034800     MOVE SD-SYSTEM-DATE-YY  TO DP150O-RUN-YEAR.                  03480000
034900     MOVE SD-SYSTEM-TIME-HH  TO DP150O-RUN-HOUR.                  03490000
035000     MOVE SD-SYSTEM-TIME-MM  TO DP150O-RUN-MINUTE.                03500000
035100                                                                  03510000
035200     MOVE PC-SUKRP072             TO DP150O-PROGRAM-NAME.         03520000
035300     MOVE PC-REPORT-NBR           TO DP150O-REPORT-NUMBER.        03530000
035400     MOVE +0                      TO PV-PAGE-COUNT.               03540000
035500                                                                  03550000
035600     PERFORM 7010-READ-CONTROL-REC.                               03560000
035700     MOVE SU032-FROM-DATE    TO  REPORT-FROM-DATE.                03570000
035800     MOVE SU032-TO-DATE      TO  REPORT-TO-DATE.                  03580000
035900                                                                  03590000
035910     EVALUATE TRUE                                                03591063
035911         WHEN SU032-RPT-TYPE = 'W'                                03591163
035912              MOVE 'WEEK '   TO  H1A-FISCAL-PERIOD                03591264
035913         WHEN SU032-RPT-TYPE = 'M'                                03591363
035914              MOVE 'MONTH'   TO  H1A-FISCAL-PERIOD                03591464
035915         WHEN SU032-RPT-TYPE = 'N'                                03591599
035916              MOVE 'MTD'     TO  H1A-FISCAL-PERIOD                03591699
035917         WHEN SU032-RPT-TYPE = 'T'                                03591763
035918              MOVE ' YTD '   TO  H1A-FISCAL-PERIOD                03591864
035919     END-EVALUATE.                                                03591963
035920                                                                  03592063
035921     PERFORM 7015-READ-SELECTION-REC.                             03592196
035922                                                                  03592263
035930                                                                  03593063
036000******************************************************************03600000
036100**  WRITES REPORT HEADER LINES FOR FIRST PAGE AND ANY SUBSEQUENT  03610000
036200**  PAGES (AS NEEDED).                                            03620000
036300******************************************************************03630000
036400 1500-PRINT-HEADINGS.                                             03640000
036500     ADD +1                  TO PV-PAGE-COUNT.                    03650000
036600     MOVE PV-PAGE-COUNT      TO DP150O-PAGE-NUMBER.               03660000
036700                                                                  03670000
036800     MOVE REPORT-FROM-DATE   TO  HD1A-FROM-DATE.                  03680000
036900     MOVE REPORT-TO-DATE     TO  HD1A-TO-DATE.                    03690000
037000                                                                  03700000
037100     WRITE REPORT-RECORD                                          03710000
037200       FROM DP150O-STANDRD-HEADER-150-COLS                        03720000
037300         AFTER ADVANCING PAGE.                                    03730000
037400                                                                  03740000
037500     WRITE REPORT-RECORD                                          03750000
037600       FROM HEADING-LINE1                                         03760000
037700         AFTER ADVANCING 1 LINES.                                 03770000
037800                                                                  03780000
037900     WRITE REPORT-RECORD                                          03790000
038000       FROM HEADING-LINE1A                                        03800000
038010         AFTER ADVANCING 1 LINES.                                 03801000
038020                                                                  03802000
038070     WRITE REPORT-RECORD                                          03807000
038080       FROM HEADING-LINE3                                         03808000
038090         AFTER ADVANCING 2 LINES.                                 03809000
038100                                                                  03810000
038200     WRITE REPORT-RECORD                                          03820000
038300       FROM HEADING-LINE4                                         03830000
038400         AFTER ADVANCING 1 LINES.                                 03840000
038500                                                                  03850000
038600     WRITE REPORT-RECORD                                          03860000
038700       FROM HEADING-LINE5                                         03870000
038800         AFTER ADVANCING 1 LINES.                                 03880000
038900                                                                  03890000
039000     WRITE REPORT-RECORD                                          03900000
039100       FROM HEADING-LINE6                                         03910000
039200         AFTER ADVANCING 1 LINES.                                 03920000
039300                                                                  03930000
039400     WRITE REPORT-RECORD                                          03940000
039500       FROM HEADING-LINE7                                         03950000
039600         AFTER ADVANCING 1 LINES.                                 03960000
039610                                                                  03961000
039620     WRITE REPORT-RECORD                                          03962000
039630       FROM BLANK-LINE                                            03963000
039640         AFTER ADVANCING 1 LINE.                                  03964000
039650                                                                  03965000
039660     MOVE +07                TO PV-LINE-COUNT.                    03966001
039661     MOVE ZEROES             TO PV-DC-COUNT.                      03966103
039670                                                                  03967000
039729******************************************************************03972905
039730**  READ INPUT-FILE, WHEN DC CHANGES, DO A PAGE BREAK             03973005
039740******************************************************************03974005
039800 2000-PROCESS-INPUT.                                              03980000
039810                                                                  03981010
039900     IF  SU129-SML-SRC-CDE = PV-PREV-SOURCE                       03990010
040000         CONTINUE                                                 04000010
040100     ELSE                                                         04010010
040110         PERFORM 3000-CALC-AREA-AVERAGES                          04011010
040111         PERFORM 3005-CALC-SRC-CRTN-PCNT                          04011166
040112         PERFORM 5000-PRINT-AREA-AVERAGE                          04011266
040120         MOVE SU129-SML-SRC-CDE     TO  PV-PREV-SOURCE            04012036
040130         MOVE SU129-REPORT-SORT-SEQ TO  PV-PREV-SEQ               04013036
040600     END-IF.                                                      04060010
040700                                                                  04070010
040900     IF  SU129-OPER-UNT-ID = PV-PREV-OPER                         04090000
041000         CONTINUE                                                 04100000
041100     ELSE                                                         04110000
041110         PERFORM 3010-ACCUM-TRLR-TOTALS                           04111018
041111         PERFORM 3020-CALC-TRIP-AVERAGES                          04111120
041120         PERFORM 5020-PRINT-TRLR-TOTALS                           04112018
041200         MOVE SU129-OPER-UNT-ID    TO PV-PREV-OPER                04120000
041300         MOVE SU129-OPER-UNT-ID    TO PV-SAVE-OPER-UNT-ID         04130000
041400         PERFORM 8500-GET-LOCATION-NAME                           04140000
041420     END-IF.                                                      04142000
041430                                                                  04143000
041440     PERFORM 2100-ACCUM-SOURCE-TOTALS.                            04144010
041450                                                                  04145000
041460     IF  SU129-SML-SRC-CDE   =  'MST'                             04146000
041470         CONTINUE                                                 04147000
041480     ELSE                                                         04148000
041490         PERFORM 3010-ACCUM-TRLR-TOTALS                           04149000
041500     END-IF.                                                      04150000
041501                                                                  04150100
041504                                                                  04150400
041505     PERFORM 7000-READ-EXTRACT-FILE.                              04150500
041506                                                                  04150600
041507                                                                  04150700
041508****************************************************************  04150810
041509* CALCULATE SOURCE TOTALS                                      *  04150910
041510****************************************************************  04151010
041511 2100-ACCUM-SOURCE-TOTALS.                                        04151110
041580                                                                  04158011
041585     ADD SU129-TRIP-OPEN-TO-CLOSE-MIN                             04158511
041586                 TO  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                04158615
041590     ADD SU129-TRIP-CLOSE-TO-SHIP-MIN                             04159011
041591                 TO  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                04159115
041592     ADD SU129-TRIP-OPEN-TO-SHIP-MIN                              04159211
041593                 TO  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                 04159315
041594*                                                                 04159423
041595     ADD 1                                                        04159523
041596                 TO  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                04159623
041597     ADD 1                                                        04159723
041598                 TO  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                04159823
041599     ADD 1                                                        04159923
041600                 TO  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                 04160023
041601*                                                                 04160123
041602     ADD SU129-INPUT-RECORD-COUNT                                 04160215
041603                 TO  PV-SRC-INPUT-RECORD-COUNT                    04160315
041604                                                                  04160411
041605     ADD SU129-ARRIVE-TO-PRC-MIN                                  04160511
041606                 TO  PV-SRC-ARRIVE-TO-PRC-MIN                     04160615
041607     ADD SU129-ARRIVE-TO-P2L-PKD-MIN                              04160711
041608                 TO  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                 04160815
041609     ADD SU129-PRC-TO-P2L-PKD-MIN                                 04160911
041610                 TO  PV-SRC-PRC-TO-P2L-PKD-MIN                    04161015
041611     ADD SU129-P2L-PKD-TO-CLOSE-MIN                               04161111
041612                 TO  PV-SRC-P2L-PKD-TO-CLOSE-MIN                  04161215
041613     ADD SU129-P2L-OPEN-TO-CLOSE-MIN                              04161311
041614                 TO  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                 04161415
041615     ADD SU129-P2L-OPEN-TO-OTBND-MIN                              04161511
041616                 TO  PV-SRC-P2L-OPEN-TO-OTBND-MIN                 04161615
041617     ADD SU129-P2L-CLOSE-TO-OTBND-MIN                             04161711
041618                 TO  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                04161815
041619     ADD SU129-ARRIVE-TO-OTBND-MIN                                04161911
041620                 TO  PV-SRC-ARRIVE-TO-OTBND-MIN                   04162015
041621     ADD SU129-PRC-TO-OTBND-MIN                                   04162111
041622                 TO  PV-SRC-PRC-TO-OTBND-MIN                      04162215
041623     ADD SU129-ARRIVE-TO-TCLOS-MIN                                04162311
041624                 TO  PV-SRC-ARRIVE-TO-TCLOS-MIN                   04162415
041625     ADD SU129-ARRIVE-TO-SHIP-MIN                                 04162511
041626                 TO  PV-SRC-ARRIVE-TO-SHIP-MIN                    04162615
041627     ADD SU129-P2L-OPEN-TO-TCLOS-MIN                              04162711
041628                 TO  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                 04162815
041629     ADD SU129-P2L-OPEN-TO-SHIP-MIN                               04162911
041630                 TO  PV-SRC-P2L-OPEN-TO-SHIP-MIN                  04163015
041631     ADD SU129-P2L-CLOSE-TO-TCLOS-MIN                             04163111
041632                 TO  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                04163215
041633     ADD SU129-P2L-CLOSE-TO-SHIP-MIN                              04163311
041634                 TO  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                 04163415
041635     ADD SU129-ARRIVE-TO-MSTR-MIN                                 04163511
041636                 TO  PV-SRC-ARRIVE-TO-MSTR-MIN                    04163615
041637     ADD SU129-PRC-TO-MSTR-MIN                                    04163711
041638                 TO  PV-SRC-PRC-TO-MSTR-MIN                       04163815
041639     ADD SU129-ON-OTBND-TO-TCLOS-MIN                              04163911
041640                 TO  PV-SRC-ON-OTBND-TO-TCLOS-MIN                 04164015
041641     ADD SU129-ON-OTBND-TO-TSHIP-MIN                              04164111
041642                 TO  PV-SRC-ON-OTBND-TO-TSHIP-MIN                 04164215
041643     ADD SU129-MSTR-CRE-TO-OTBND-MIN                              04164311
041644                 TO  PV-SRC-MSTR-CRE-TO-OTBND-MIN                 04164415
041645     ADD SU129-MSTR-CRE-TO-TCLOS-MIN                              04164511
041646                 TO  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                 04164615
041647     ADD SU129-MSTR-CRE-TO-SHIP-MIN                               04164711
041648                 TO  PV-SRC-MSTR-CRE-TO-SHIP-MIN                  04164815
041649     ADD SU129-MSTR-FIRST-TO-OTBND-MIN                            04164911
041650                 TO  PV-SRC-MSTR-FIRST-TO-OTBND-MIN               04165015
041651     ADD SU129-MSTR-FIRST-TO-TCLOS-MIN                            04165111
041652                 TO  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN               04165215
041653     ADD SU129-MSTR-FIRST-TO-SHIP-MIN                             04165311
041654                 TO  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                04165415
041655     ADD SU129-MSTR-LAST-TO-OTBND-MIN                             04165511
041656                 TO  PV-SRC-MSTR-LAST-TO-OTBND-MIN                04165615
041657     ADD SU129-MSTR-LAST-TO-TCLOS-MIN                             04165711
041658                 TO  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                04165815
041659     ADD SU129-MSTR-LAST-TO-SHIP-MIN                              04165911
041660                 TO  PV-SRC-MSTR-LAST-TO-SHIP-MIN                 04166015
041661     ADD SU129-ON-OTBND-TO-CLOS-MIN                               04166111
041662                 TO  PV-SRC-ON-OTBND-TO-CLOS-MIN                  04166215
041663     ADD SU129-ON-OTBND-TO-SHIP-MIN                               04166311
041664                 TO  PV-SRC-ON-OTBND-TO-SHIP-MIN                  04166415
041665                                                                  04166511
041666     ADD SU129-ARRIVE-TO-PRC-CNT                                  04166611
041667                 TO  PV-SRC-ARRIVE-TO-PRC-CNT                     04166715
041668     ADD SU129-ARRIVE-TO-P2L-PKD-CNT                              04166811
041669                 TO  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                 04166915
041670     ADD SU129-PRC-TO-P2L-PKD-CNT                                 04167011
041671                 TO  PV-SRC-PRC-TO-P2L-PKD-CNT                    04167115
041672     ADD SU129-P2L-PKD-TO-CLOSE-CNT                               04167211
041673                 TO  PV-SRC-P2L-PKD-TO-CLOSE-CNT                  04167315
041674     ADD SU129-P2L-OPEN-TO-CLOSE-CNT                              04167411
041675                 TO  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                 04167515
041676     ADD SU129-P2L-OPEN-TO-OTBND-CNT                              04167611
041677                 TO  PV-SRC-P2L-OPEN-TO-OTBND-CNT                 04167715
041678     ADD SU129-P2L-CLOSE-TO-OTBND-CNT                             04167811
041679                 TO  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                04167915
041680     ADD SU129-ARRIVE-TO-OTBND-CNT                                04168011
041681                 TO  PV-SRC-ARRIVE-TO-OTBND-CNT                   04168115
041682     ADD SU129-PRC-TO-OTBND-CNT                                   04168211
041683                 TO  PV-SRC-PRC-TO-OTBND-CNT                      04168315
041684     ADD SU129-ARRIVE-TO-TCLOS-CNT                                04168411
041685                 TO  PV-SRC-ARRIVE-TO-TCLOS-CNT                   04168515
041686     ADD SU129-ARRIVE-TO-SHIP-CNT                                 04168611
041687                 TO  PV-SRC-ARRIVE-TO-SHIP-CNT                    04168715
041688     ADD SU129-P2L-OPEN-TO-TCLOS-CNT                              04168811
041689                 TO  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                 04168915
041690     ADD SU129-P2L-OPEN-TO-SHIP-CNT                               04169011
041691                 TO  PV-SRC-P2L-OPEN-TO-SHIP-CNT                  04169115
041692     ADD SU129-P2L-CLOSE-TO-TCLOS-CNT                             04169211
041693                 TO  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                04169315
041694     ADD SU129-P2L-CLOSE-TO-SHIP-CNT                              04169411
041695                 TO  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                 04169515
041696     ADD SU129-ARRIVE-TO-MSTR-CNT                                 04169611
041697                 TO  PV-SRC-ARRIVE-TO-MSTR-CNT                    04169715
041698     ADD SU129-PRC-TO-MSTR-CNT                                    04169811
041699                 TO  PV-SRC-PRC-TO-MSTR-CNT                       04169915
041700     ADD SU129-ON-OTBND-TO-TCLOS-CNT                              04170011
041701                 TO  PV-SRC-ON-OTBND-TO-TCLOS-CNT                 04170115
041702     ADD SU129-ON-OTBND-TO-TSHIP-CNT                              04170211
041703                 TO  PV-SRC-ON-OTBND-TO-TSHIP-CNT                 04170315
041704     ADD SU129-MSTR-CRE-TO-OTBND-CNT                              04170411
041705                 TO  PV-SRC-MSTR-CRE-TO-OTBND-CNT                 04170515
041706     ADD SU129-MSTR-CRE-TO-TCLOS-CNT                              04170611
041707                 TO  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                 04170715
041708     ADD SU129-MSTR-CRE-TO-SHIP-CNT                               04170811
041709                 TO  PV-SRC-MSTR-CRE-TO-SHIP-CNT                  04170915
041710     ADD SU129-MSTR-FIRST-TO-OTBND-CNT                            04171011
041711                 TO  PV-SRC-MSTR-FIRST-TO-OTBND-CNT               04171115
041712     ADD SU129-MSTR-FIRST-TO-TCLOS-CNT                            04171211
041713                 TO  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT               04171315
041714     ADD SU129-MSTR-FIRST-TO-SHIP-CNT                             04171411
041715                 TO  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                04171515
041716     ADD SU129-MSTR-LAST-TO-OTBND-CNT                             04171611
041717                 TO  PV-SRC-MSTR-LAST-TO-OTBND-CNT                04171715
041718     ADD SU129-MSTR-LAST-TO-TCLOS-CNT                             04171811
041719                 TO  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                04171915
041720     ADD SU129-MSTR-LAST-TO-SHIP-CNT                              04172011
041721                 TO  PV-SRC-MSTR-LAST-TO-SHIP-CNT                 04172115
041722     ADD SU129-ON-OTBND-TO-CLOS-CNT                               04172211
041723                 TO  PV-SRC-ON-OTBND-TO-CLOS-CNT                  04172315
041724     ADD SU129-ON-OTBND-TO-SHIP-CNT                               04172411
041725                 TO  PV-SRC-ON-OTBND-TO-SHIP-CNT.                 04172516
041726                                                                  04172610
041730     ADD SU129-TRIP-CARTONS                                       04173066
041731                TO PV-SRC-TRIP-CARTONS.                           04173166
041732     ADD SU129-TRIP-SRC-CARTONS                                   04173266
041733                TO PV-SRC-TRIP-SRC-CARTONS.                       04173366
041734     ADD SU129-TOTAL-TRIPS                                        04173466
041735                TO PV-SRC-TOTAL-TRIPS.                            04173566
041736     ADD SU129-TOTAL-TRIPS                                        04173685
041737                TO PV-OVR-TOTAL-TRIPS.                            04173785
041738     ADD SU129-TOTAL-TRIPS                                        04173891
041739                TO PV-DC-TOTAL-TRIPS.                             04173991
041740     MOVE PV-DC-TOTAL-TRIPS                                       04174091
041741       TO PV-DISP-OVR-TOTAL-TRIPS.                                04174186
041742     MOVE SU129-TRIP-ID                                           04174288
041743       TO PV-DISP-TRIP.                                           04174388
041744                                                                  04174486
041745*DMH DISPLAY ' TRIPS:'            PV-DISP-TRIP                    04174599
041746*DMH         '  -  '              SU129-SML-SRC-CDE               04174699
041747*DMH         '  -  '              PV-DISP-OVR-TOTAL-TRIPS.        04174799
041751                                                                  04175185
041752                                                                  04175285
041753****************************************************************  04175385
041754* CALCULATE THE AVERAGES                                       *  04175485
041755****************************************************************  04175585
041756 3000-CALC-AREA-AVERAGES.                                         04175685
041757                                                                  04175785
041758     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04175885
041759                             PV-TRIP-CLOSE-TO-SHIP-AVG            04175985
041760                             PV-TRIP-OPEN-TO-SHIP-AVG             04176085
041761                             PV-ARRIVE-TO-PRC-AVG                 04176185
041762                             PV-ARRIVE-TO-P2L-PKD-AVG             04176285
041763                             PV-PRC-TO-P2L-PKD-AVG                04176385
041764                             PV-P2L-PKD-TO-CLOSE-AVG              04176485
041770                             PV-P2L-OPEN-TO-CLOSE-AVG             04177066
041800                             PV-P2L-OPEN-TO-OTBND-AVG             04180000
041900                             PV-P2L-CLOSE-TO-OTBND-AVG            04190000
041910                             PV-ARRIVE-TO-OTBND-AVG               04191000
041920                             PV-PRC-TO-OTBND-AVG                  04192000
041921                             PV-ARRIVE-TO-TCLOS-AVG               04192100
041922                             PV-ARRIVE-TO-SHIP-AVG                04192200
041923                             PV-P2L-OPEN-TO-TCLOS-AVG             04192300
041924                             PV-P2L-OPEN-TO-SHIP-AVG              04192400
041925                             PV-P2L-CLOSE-TO-TCLOS-AVG            04192500
041926                             PV-P2L-CLOSE-TO-SHIP-AVG             04192600
041927                             PV-ARRIVE-TO-MSTR-AVG                04192700
041928                             PV-PRC-TO-MSTR-AVG                   04192800
041929                             PV-MSTR-CRE-TO-OTBND-AVG             04192900
041930                             PV-MSTR-CRE-TO-TCLOS-AVG             04193000
041931                             PV-MSTR-CRE-TO-SHIP-AVG              04193100
041932                             PV-MSTR-FIRST-TO-OTBND-AVG           04193200
041933                             PV-MSTR-FIRST-TO-TCLOS-AVG           04193300
041934                             PV-MSTR-FIRST-TO-SHIP-AVG            04193400
041935                             PV-MSTR-LAST-TO-OTBND-AVG            04193500
041936                             PV-MSTR-LAST-TO-TCLOS-AVG            04193600
041937                             PV-MSTR-LAST-TO-SHIP-AVG             04193700
041938                             PV-ON-OTBND-TO-CLOS-AVG              04193800
041939                             PV-ON-OTBND-TO-SHIP-AVG              04193900
041940                             PV-TRIP-OPEN-TO-CLOSE-DAY            04194000
041941                             PV-TRIP-CLOSE-TO-SHIP-DAY            04194100
041942                             PV-TRIP-OPEN-TO-SHIP-DAY             04194200
041943                             PV-ARRIVE-TO-PRC-DAY                 04194300
041944                             PV-ARRIVE-TO-P2L-PKD-DAY             04194400
041945                             PV-PRC-TO-P2L-PKD-DAY                04194500
041946                             PV-P2L-PKD-TO-CLOSE-DAY              04194600
041947                             PV-P2L-OPEN-TO-CLOSE-DAY             04194700
041948                             PV-P2L-OPEN-TO-OTBND-DAY             04194800
041949                             PV-P2L-CLOSE-TO-OTBND-DAY            04194900
041950                             PV-ARRIVE-TO-OTBND-DAY               04195000
041951                             PV-PRC-TO-OTBND-DAY                  04195100
041952                             PV-ARRIVE-TO-TCLOS-DAY               04195200
041953                             PV-ARRIVE-TO-SHIP-DAY                04195300
041954                             PV-P2L-OPEN-TO-TCLOS-DAY             04195400
041955                             PV-P2L-OPEN-TO-SHIP-DAY              04195500
041956                             PV-P2L-CLOSE-TO-TCLOS-DAY            04195600
041957                             PV-P2L-CLOSE-TO-SHIP-DAY             04195700
041958                             PV-ARRIVE-TO-MSTR-DAY                04195800
041959                             PV-PRC-TO-MSTR-DAY                   04195900
041960                             PV-MSTR-CRE-TO-OTBND-DAY             04196000
041961                             PV-MSTR-CRE-TO-TCLOS-DAY             04196100
041962                             PV-MSTR-CRE-TO-SHIP-DAY              04196200
041963                             PV-MSTR-FIRST-TO-OTBND-DAY           04196300
041964                             PV-MSTR-FIRST-TO-TCLOS-DAY           04196400
041965                             PV-MSTR-FIRST-TO-SHIP-DAY            04196500
041966                             PV-MSTR-LAST-TO-OTBND-DAY            04196600
041967                             PV-MSTR-LAST-TO-TCLOS-DAY            04196700
041968                             PV-MSTR-LAST-TO-SHIP-DAY             04196800
041969                             PV-ON-OTBND-TO-CLOS-DAY              04196900
041970                             PV-ON-OTBND-TO-SHIP-DAY.             04197000
041978                                                                  04197857
041979     IF  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04197957
041980         PV-SRC-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04198057
041981         DIVIDE  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                    04198157
041982             BY  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                    04198257
041983         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04198357
041984                 ROUNDED                                          04198457
041985         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04198557
041986             BY  1440                                             04198657
041987         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04198757
041988                 ROUNDED                                          04198857
041989     ELSE                                                         04198957
041990         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04199057
041991                           PV-TRIP-OPEN-TO-CLOSE-DAY              04199157
041992     END-IF.                                                      04199257
041993                                                                  04199357
042002     IF  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04200257
042003         PV-SRC-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04200357
042004         DIVIDE  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                    04200457
042005             BY  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                    04200557
042006         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04200657
042007                 ROUNDED                                          04200757
042008         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04200857
042009             BY  1440                                             04200957
042010         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04201057
042011                 ROUNDED                                          04201157
042012     ELSE                                                         04201257
042013         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04201357
042014                           PV-TRIP-CLOSE-TO-SHIP-DAY              04201457
042015     END-IF.                                                      04201557
042016                                                                  04201657
042017     IF  PV-SRC-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04201757
042018         PV-SRC-TRIP-OPEN-TO-SHIP-CNT  >  0                       04201857
042019         DIVIDE  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                     04201957
042020             BY  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                     04202057
042021         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04202157
042022                 ROUNDED                                          04202257
042023         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04202357
042024             BY  1440                                             04202457
042025         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04202557
042026                 ROUNDED                                          04202657
042027     ELSE                                                         04202757
042028         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04202857
042029                           PV-TRIP-OPEN-TO-SHIP-DAY               04202957
042030     END-IF.                                                      04203057
042031                                                                  04203157
042032                                                                  04203257
042033     IF  PV-SRC-ARRIVE-TO-PRC-MIN  >  0  AND                      04203357
042034         PV-SRC-ARRIVE-TO-PRC-CNT  >  0                           04203457
042035         DIVIDE PV-SRC-ARRIVE-TO-PRC-MIN                          04203557
042036             BY PV-SRC-ARRIVE-TO-PRC-CNT                          04203657
042037         GIVING PV-ARRIVE-TO-PRC-AVG                              04203757
042038                 ROUNDED                                          04203857
042039         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04203957
042040             BY 1440                                              04204057
042041         GIVING PV-ARRIVE-TO-PRC-DAY                              04204157
042042                 ROUNDED                                          04204257
042043     ELSE                                                         04204357
042044         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04204457
042045                           PV-ARRIVE-TO-PRC-DAY                   04204557
042046     END-IF.                                                      04204657
042047                                                                  04204757
042048     IF  PV-SRC-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04204857
042049         PV-SRC-ARRIVE-TO-P2L-PKD-CNT  >  0                       04204957
042050         DIVIDE PV-SRC-ARRIVE-TO-P2L-PKD-MIN                      04205057
042051             BY PV-SRC-ARRIVE-TO-P2L-PKD-CNT                      04205157
042052         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04205257
042053                 ROUNDED                                          04205357
042054         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04205457
042055             BY 1440                                              04205557
042056         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04205657
042057                 ROUNDED                                          04205757
042058     ELSE                                                         04205857
042059         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04205957
042060                           PV-ARRIVE-TO-P2L-PKD-DAY               04206057
042061     END-IF.                                                      04206157
042062                                                                  04206257
042063                                                                  04206357
042064     IF  PV-SRC-PRC-TO-P2L-PKD-MIN  >  0  AND                     04206457
042065         PV-SRC-PRC-TO-P2L-PKD-CNT  >  0                          04206557
042066         DIVIDE PV-SRC-PRC-TO-P2L-PKD-MIN                         04206657
042067             BY PV-SRC-PRC-TO-P2L-PKD-CNT                         04206757
042068         GIVING PV-PRC-TO-P2L-PKD-AVG                             04206857
042069                 ROUNDED                                          04206957
042070         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04207057
042071             BY 1440                                              04207157
042072         GIVING PV-PRC-TO-P2L-PKD-DAY                             04207257
042073                 ROUNDED                                          04207357
042074     ELSE                                                         04207457
042075         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04207557
042076                           PV-PRC-TO-P2L-PKD-DAY                  04207657
042077     END-IF.                                                      04207757
042078                                                                  04207857
042079     IF  PV-SRC-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04207957
042080         PV-SRC-P2L-PKD-TO-CLOSE-CNT  >  0                        04208057
042081         DIVIDE PV-SRC-P2L-PKD-TO-CLOSE-MIN                       04208157
042082             BY PV-SRC-P2L-PKD-TO-CLOSE-CNT                       04208257
042083         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04208357
042084                 ROUNDED                                          04208457
042085         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04208557
042086             BY 1440                                              04208657
042087         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04208757
042088                 ROUNDED                                          04208857
042089     ELSE                                                         04208957
042090         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04209057
042091                           PV-P2L-PKD-TO-CLOSE-DAY                04209157
042092     END-IF.                                                      04209257
042093                                                                  04209357
042094     IF  PV-SRC-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04209457
042095         PV-SRC-P2L-OPEN-TO-CLOSE-CNT  >  0                       04209557
042096         DIVIDE PV-SRC-P2L-OPEN-TO-CLOSE-MIN                      04209657
042097             BY PV-SRC-P2L-OPEN-TO-CLOSE-CNT                      04209757
042098         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04209857
042099                 ROUNDED                                          04209957
042100         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04210057
042101             BY 1440                                              04210157
042102         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04210257
042103                 ROUNDED                                          04210357
042104     ELSE                                                         04210457
042105         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04210557
042106                           PV-P2L-OPEN-TO-CLOSE-DAY               04210657
042107     END-IF.                                                      04210757
042108                                                                  04210857
042109     IF  PV-SRC-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04210957
042110         PV-SRC-P2L-OPEN-TO-OTBND-CNT  >  0                       04211057
042111         DIVIDE PV-SRC-P2L-OPEN-TO-OTBND-MIN                      04211157
042112             BY PV-SRC-P2L-OPEN-TO-OTBND-CNT                      04211257
042113         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04211357
042114                 ROUNDED                                          04211457
042115         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04211557
042116             BY 1440                                              04211657
042117         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04211757
042118                 ROUNDED                                          04211857
042119     ELSE                                                         04211957
042120         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04212057
042121                           PV-P2L-OPEN-TO-OTBND-DAY               04212157
042122     END-IF.                                                      04212257
042123                                                                  04212357
042124     IF  PV-SRC-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04212457
042125         PV-SRC-P2L-CLOSE-TO-OTBND-CNT  >  0                      04212557
042126         DIVIDE PV-SRC-P2L-CLOSE-TO-OTBND-MIN                     04212657
042127             BY PV-SRC-P2L-CLOSE-TO-OTBND-CNT                     04212757
042128         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04212857
042129                 ROUNDED                                          04212957
042130         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04213057
042131             BY 1440                                              04213157
042132         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04213257
042133                 ROUNDED                                          04213357
042134     ELSE                                                         04213457
042135         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04213557
042136                           PV-P2L-CLOSE-TO-OTBND-DAY              04213657
042137     END-IF.                                                      04213757
042138                                                                  04213857
042139     IF  PV-SRC-ARRIVE-TO-OTBND-MIN  >  0  AND                    04213957
042140         PV-SRC-ARRIVE-TO-OTBND-CNT  >  0                         04214057
042141         DIVIDE PV-SRC-ARRIVE-TO-OTBND-MIN                        04214157
042142             BY PV-SRC-ARRIVE-TO-OTBND-CNT                        04214257
042143         GIVING PV-ARRIVE-TO-OTBND-AVG                            04214357
042144                 ROUNDED                                          04214457
042145         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04214557
042146             BY 1440                                              04214657
042147         GIVING PV-ARRIVE-TO-OTBND-DAY                            04214757
042148                 ROUNDED                                          04214857
042149     ELSE                                                         04214957
042150         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04215057
042151                           PV-ARRIVE-TO-OTBND-DAY                 04215157
042152     END-IF.                                                      04215257
042153                                                                  04215357
042154     IF  PV-SRC-PRC-TO-OTBND-MIN  >  0  AND                       04215457
042155         PV-SRC-PRC-TO-OTBND-CNT  >  0                            04215557
042156         DIVIDE PV-SRC-PRC-TO-OTBND-MIN                           04215657
042157             BY PV-SRC-PRC-TO-OTBND-CNT                           04215757
042158         GIVING PV-PRC-TO-OTBND-AVG                               04215857
042159                 ROUNDED                                          04215957
042160         DIVIDE PV-PRC-TO-OTBND-AVG                               04216057
042161             BY 1440                                              04216157
042162         GIVING PV-PRC-TO-OTBND-DAY                               04216257
042163                 ROUNDED                                          04216357
042164     ELSE                                                         04216457
042165         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04216557
042166                           PV-PRC-TO-OTBND-DAY                    04216657
042167     END-IF.                                                      04216757
042168                                                                  04216857
042169     IF  PV-SRC-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04216957
042170         PV-SRC-ARRIVE-TO-TCLOS-CNT  >  0                         04217057
042171         DIVIDE PV-SRC-ARRIVE-TO-TCLOS-MIN                        04217157
042172             BY PV-SRC-ARRIVE-TO-TCLOS-CNT                        04217257
042173         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04217357
042174                 ROUNDED                                          04217457
042175         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04217557
042176             BY 1440                                              04217657
042177         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04217757
042178                 ROUNDED                                          04217857
042179     ELSE                                                         04217957
042180         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04218057
042181                           PV-ARRIVE-TO-TCLOS-DAY                 04218157
042182     END-IF.                                                      04218257
042183                                                                  04218357
042184     IF  PV-SRC-ARRIVE-TO-SHIP-MIN  >  0  AND                     04218457
042185         PV-SRC-ARRIVE-TO-SHIP-CNT  >  0                          04218557
042186         DIVIDE PV-SRC-ARRIVE-TO-SHIP-MIN                         04218657
042187             BY PV-SRC-ARRIVE-TO-SHIP-CNT                         04218757
042188         GIVING PV-ARRIVE-TO-SHIP-AVG                             04218857
042189                 ROUNDED                                          04218957
042190         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04219057
042191             BY 1440                                              04219157
042192         GIVING PV-ARRIVE-TO-SHIP-DAY                             04219257
042193                 ROUNDED                                          04219357
042194     ELSE                                                         04219457
042195         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04219557
042196                           PV-ARRIVE-TO-SHIP-DAY                  04219657
042197     END-IF.                                                      04219757
042198                                                                  04219857
042199     IF  PV-SRC-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04219957
042200         PV-SRC-P2L-OPEN-TO-TCLOS-CNT  >  0                       04220057
042201         DIVIDE PV-SRC-P2L-OPEN-TO-TCLOS-MIN                      04220157
042202             BY PV-SRC-P2L-OPEN-TO-TCLOS-CNT                      04220257
042203         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04220357
042204                 ROUNDED                                          04220457
042205         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04220557
042206             BY 1440                                              04220657
042207         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04220757
042208                 ROUNDED                                          04220857
042209     ELSE                                                         04220957
042210         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04221057
042211                           PV-P2L-OPEN-TO-TCLOS-DAY               04221157
042212     END-IF.                                                      04221257
042213                                                                  04221357
042214     IF  PV-SRC-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04221457
042215         PV-SRC-P2L-OPEN-TO-SHIP-CNT  >  0                        04221557
042216         DIVIDE PV-SRC-P2L-OPEN-TO-SHIP-MIN                       04221657
042217             BY PV-SRC-P2L-OPEN-TO-SHIP-CNT                       04221757
042218         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04221857
042219                 ROUNDED                                          04221957
042220         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04222057
042221             BY 1440                                              04222157
042222         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04222257
042223                 ROUNDED                                          04222357
042224     ELSE                                                         04222457
042225         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04222557
042226                           PV-P2L-OPEN-TO-SHIP-DAY                04222657
042227     END-IF.                                                      04222757
042228                                                                  04222857
042229     IF  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04222957
042230         PV-SRC-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04223057
042231         DIVIDE PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                     04223157
042232             BY PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                     04223257
042233         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04223357
042234                 ROUNDED                                          04223457
042235         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04223557
042236             BY 1440                                              04223657
042237         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04223757
042238                 ROUNDED                                          04223857
042239     ELSE                                                         04223957
042240         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04224057
042241                           PV-P2L-CLOSE-TO-TCLOS-DAY              04224157
042242     END-IF.                                                      04224257
042243                                                                  04224357
042244     IF  PV-SRC-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04224457
042245         PV-SRC-P2L-CLOSE-TO-SHIP-CNT  >  0                       04224557
042246         DIVIDE PV-SRC-P2L-CLOSE-TO-SHIP-MIN                      04224657
042247             BY PV-SRC-P2L-CLOSE-TO-SHIP-CNT                      04224757
042248         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04224857
042249                 ROUNDED                                          04224957
042250         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04225057
042251             BY 1440                                              04225157
042252         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04225257
042253                 ROUNDED                                          04225357
042254     ELSE                                                         04225457
042255         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04225557
042256                           PV-P2L-CLOSE-TO-SHIP-DAY               04225657
042257     END-IF.                                                      04225757
042258                                                                  04225857
042259     IF  PV-SRC-ARRIVE-TO-MSTR-MIN  >  0  AND                     04225957
042260         PV-SRC-ARRIVE-TO-MSTR-CNT  >  0                          04226057
042261         DIVIDE PV-SRC-ARRIVE-TO-MSTR-MIN                         04226157
042262             BY PV-SRC-ARRIVE-TO-MSTR-CNT                         04226257
042263         GIVING PV-ARRIVE-TO-MSTR-AVG                             04226357
042264                 ROUNDED                                          04226457
042265         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04226557
042266             BY 1440                                              04226657
042267         GIVING PV-ARRIVE-TO-MSTR-DAY                             04226757
042268                 ROUNDED                                          04226857
042269     ELSE                                                         04226957
042270         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04227057
042271                           PV-ARRIVE-TO-MSTR-DAY                  04227157
042272     END-IF.                                                      04227257
042273                                                                  04227357
042274     IF  PV-SRC-PRC-TO-MSTR-MIN  >  0  AND                        04227457
042275         PV-SRC-PRC-TO-MSTR-CNT  >  0                             04227557
042276         DIVIDE PV-SRC-PRC-TO-MSTR-MIN                            04227657
042277             BY PV-SRC-PRC-TO-MSTR-CNT                            04227757
042278         GIVING PV-PRC-TO-MSTR-AVG                                04227857
042279                 ROUNDED                                          04227957
042280         DIVIDE PV-PRC-TO-MSTR-AVG                                04228057
042281             BY 1440                                              04228157
042282         GIVING PV-PRC-TO-MSTR-DAY                                04228257
042283                 ROUNDED                                          04228357
042284     ELSE                                                         04228457
042285         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04228557
042286                           PV-PRC-TO-MSTR-DAY                     04228657
042287     END-IF.                                                      04228757
042288                                                                  04228857
042289     IF  PV-SRC-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04228957
042290         PV-SRC-ON-OTBND-TO-CLOS-CNT  >  0                        04229057
042291         DIVIDE PV-SRC-ON-OTBND-TO-CLOS-MIN                       04229157
042292             BY PV-SRC-ON-OTBND-TO-CLOS-CNT                       04229257
042293         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04229357
042294                 ROUNDED                                          04229457
042295         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04229557
042296             BY 1440                                              04229657
042297         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04229757
042298                 ROUNDED                                          04229857
042299     ELSE                                                         04229957
042300         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04230057
042301                           PV-ON-OTBND-TO-CLOS-DAY                04230157
042302     END-IF.                                                      04230257
042303                                                                  04230357
042304     IF  PV-SRC-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04230457
042305         PV-SRC-ON-OTBND-TO-SHIP-CNT  >  0                        04230557
042306         DIVIDE PV-SRC-ON-OTBND-TO-SHIP-MIN                       04230657
042307             BY PV-SRC-ON-OTBND-TO-SHIP-CNT                       04230757
042308         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04230857
042309                 ROUNDED                                          04230957
042310         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04231057
042311             BY 1440                                              04231157
042312         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04231257
042313                 ROUNDED                                          04231357
042314     ELSE                                                         04231457
042315         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04231557
042316                           PV-ON-OTBND-TO-SHIP-DAY                04231657
042317     END-IF.                                                      04231757
042318                                                                  04231857
042319     IF  PV-SRC-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04231957
042320         PV-SRC-MSTR-CRE-TO-OTBND-CNT  >  0                       04232057
042321         DIVIDE PV-SRC-MSTR-CRE-TO-OTBND-MIN                      04232157
042322             BY PV-SRC-MSTR-CRE-TO-OTBND-CNT                      04232257
042323         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04232357
042324                 ROUNDED                                          04232457
042325         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04232557
042326             BY 1440                                              04232657
042327         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04232757
042328                 ROUNDED                                          04232857
042329     ELSE                                                         04232957
042330         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04233057
042331                           PV-MSTR-CRE-TO-OTBND-DAY               04233157
042332     END-IF.                                                      04233257
042333                                                                  04233357
042334     IF  PV-SRC-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04233457
042335         PV-SRC-MSTR-CRE-TO-TCLOS-CNT  >  0                       04233557
042336         DIVIDE PV-SRC-MSTR-CRE-TO-TCLOS-MIN                      04233657
042337             BY PV-SRC-MSTR-CRE-TO-TCLOS-CNT                      04233757
042338         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04233857
042339                 ROUNDED                                          04233957
042340         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04234057
042341             BY 1440                                              04234157
042342         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04234257
042343                 ROUNDED                                          04234357
042344     ELSE                                                         04234457
042345         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04234557
042346                           PV-MSTR-CRE-TO-TCLOS-DAY               04234657
042347     END-IF.                                                      04234757
042348                                                                  04234857
042349     IF  PV-SRC-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04234957
042350         PV-SRC-MSTR-CRE-TO-SHIP-CNT  >  0                        04235057
042351         DIVIDE PV-SRC-MSTR-CRE-TO-SHIP-MIN                       04235157
042352             BY PV-SRC-MSTR-CRE-TO-SHIP-CNT                       04235257
042353         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04235357
042354                 ROUNDED                                          04235457
042355         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04235557
042356             BY 1440                                              04235657
042357         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04235757
042358                 ROUNDED                                          04235857
042359     ELSE                                                         04235957
042360         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04236057
042361                           PV-MSTR-CRE-TO-SHIP-DAY                04236157
042362     END-IF.                                                      04236257
042363                                                                  04236357
042364     IF  PV-SRC-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04236457
042365         PV-SRC-MSTR-FIRST-TO-OTBND-CNT  >  0                     04236557
042366         DIVIDE PV-SRC-MSTR-FIRST-TO-OTBND-MIN                    04236657
042367             BY PV-SRC-MSTR-FIRST-TO-OTBND-CNT                    04236757
042368         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04236857
042369                 ROUNDED                                          04236957
042370         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04237057
042371             BY 1440                                              04237157
042372         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04237257
042373                 ROUNDED                                          04237357
042374     ELSE                                                         04237457
042375         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04237557
042376                           PV-MSTR-FIRST-TO-OTBND-DAY             04237657
042377     END-IF.                                                      04237757
042378                                                                  04237857
042379     IF  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04237957
042380         PV-SRC-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04238057
042381         DIVIDE PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                    04238157
042382             BY PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                    04238257
042383         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04238357
042384                 ROUNDED                                          04238457
042385         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04238557
042386             BY 1440                                              04238657
042387         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04238757
042388                 ROUNDED                                          04238857
042389     ELSE                                                         04238957
042390         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04239057
042391                           PV-MSTR-FIRST-TO-TCLOS-DAY             04239157
042392     END-IF.                                                      04239257
042393                                                                  04239357
042394     IF  PV-SRC-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04239457
042395         PV-SRC-MSTR-FIRST-TO-SHIP-CNT  >  0                      04239557
042396         DIVIDE PV-SRC-MSTR-FIRST-TO-SHIP-MIN                     04239657
042397             BY PV-SRC-MSTR-FIRST-TO-SHIP-CNT                     04239757
042398         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04239857
042399                 ROUNDED                                          04239957
042400         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04240057
042401             BY 1440                                              04240157
042402         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04240257
042403                 ROUNDED                                          04240357
042404     ELSE                                                         04240457
042405         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04240557
042406                           PV-MSTR-FIRST-TO-SHIP-DAY              04240657
042407     END-IF.                                                      04240757
042408                                                                  04240857
042409     IF  PV-SRC-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04240957
042410         PV-SRC-MSTR-LAST-TO-OTBND-CNT  >  0                      04241057
042411         DIVIDE PV-SRC-MSTR-LAST-TO-OTBND-MIN                     04241157
042412             BY PV-SRC-MSTR-LAST-TO-OTBND-CNT                     04241257
042413         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04241357
042414                 ROUNDED                                          04241457
042415         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04241557
042416             BY 1440                                              04241657
042417         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04241757
042418                 ROUNDED                                          04241857
042419     ELSE                                                         04241957
042420         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04242057
042421                           PV-MSTR-LAST-TO-OTBND-DAY              04242157
042422     END-IF.                                                      04242257
042423                                                                  04242357
042424     IF  PV-SRC-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04242457
042425         PV-SRC-MSTR-LAST-TO-TCLOS-CNT  >  0                      04242557
042426         DIVIDE PV-SRC-MSTR-LAST-TO-TCLOS-MIN                     04242657
042427             BY PV-SRC-MSTR-LAST-TO-TCLOS-CNT                     04242757
042428         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04242857
042429                 ROUNDED                                          04242957
042430         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04243057
042431             BY 1440                                              04243157
042432         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04243257
042433                 ROUNDED                                          04243357
042434     ELSE                                                         04243457
042435         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04243557
042436                           PV-MSTR-LAST-TO-TCLOS-DAY              04243657
042437     END-IF.                                                      04243757
042438                                                                  04243857
042439     IF  PV-SRC-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04243957
042440         PV-SRC-MSTR-LAST-TO-SHIP-CNT  >  0                       04244057
042441         DIVIDE PV-SRC-MSTR-LAST-TO-SHIP-MIN                      04244157
042442             BY PV-SRC-MSTR-LAST-TO-SHIP-CNT                      04244257
042443         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04244357
042444                 ROUNDED                                          04244457
042445         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04244557
042446             BY 1440                                              04244657
042447         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04244757
042448                 ROUNDED                                          04244857
042449     ELSE                                                         04244957
042450         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04245057
042451                           PV-MSTR-LAST-TO-SHIP-DAY               04245157
042452     END-IF.                                                      04245257
042453                                                                  04245357
042454*                                                                 04245470
042455*** DMH 8/22/16 BEGIN                                             04245570
042456*                                                                 04245670
042457     IF  PV-SRC-TRIP-CARTONS           >  0  AND                  04245770
042458         PV-SRC-TRIP-SRC-CARTONS       >  0                       04245870
042459         DIVIDE PV-SRC-TRIP-SRC-CARTONS                           04245970
042460             BY PV-SRC-TRIP-CARTONS                               04246070
042461         GIVING PV-TRIP-SRC-CRTN                                  04246170
042462                 ROUNDED                                          04246299
042463         MULTIPLY PV-TRIP-SRC-CRTN                                04246370
042464             BY 100                                               04246470
042465         GIVING PV-TRIP-SRC-CRTN-PCNT                             04246570
042467     ELSE                                                         04246770
042468         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN                       04246870
042469                           PV-TRIP-SRC-CRTN-PCNT                  04246970
042470     END-IF.                                                      04247070
042471*                                                                 04247170
042472*** DMH 8/22/16 END                                               04247270
042473*                                                                 04247370
042474     PERFORM 4000-WRITE-SUM-RECORD                                04247470
042475                                                                  04247570
042476     PERFORM 3030-CALCULATE-DC-OVERALL.                           04247670
042477                                                                  04247770
042478     MOVE ZEROES TO  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                04247870
042479                     PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                04247970
042480                     PV-SRC-TRIP-OPEN-TO-SHIP-MIN                 04248070
042481                     PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                04248170
042482                     PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                04248270
042483                     PV-SRC-TRIP-OPEN-TO-SHIP-CNT                 04248370
042484                     PV-SRC-INPUT-RECORD-COUNT                    04248470
042485                     PV-SRC-ARRIVE-TO-PRC-MIN                     04248570
042486                     PV-SRC-ARRIVE-TO-P2L-PKD-MIN                 04248670
042487                     PV-SRC-PRC-TO-P2L-PKD-MIN                    04248770
042488                     PV-SRC-P2L-PKD-TO-CLOSE-MIN                  04248870
042489                     PV-SRC-P2L-OPEN-TO-CLOSE-MIN                 04248970
042490                     PV-SRC-P2L-OPEN-TO-OTBND-MIN                 04249070
042491                     PV-SRC-P2L-CLOSE-TO-OTBND-MIN                04249170
042492                     PV-SRC-ARRIVE-TO-OTBND-MIN                   04249270
042493                     PV-SRC-PRC-TO-OTBND-MIN                      04249370
042494                     PV-SRC-ARRIVE-TO-TCLOS-MIN                   04249470
042495                     PV-SRC-ARRIVE-TO-SHIP-MIN                    04249570
042496                     PV-SRC-P2L-OPEN-TO-TCLOS-MIN                 04249670
042497                     PV-SRC-P2L-OPEN-TO-SHIP-MIN                  04249770
042498                     PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                04249870
042499                     PV-SRC-P2L-CLOSE-TO-SHIP-MIN                 04249970
042500                     PV-SRC-ARRIVE-TO-MSTR-MIN                    04250070
042501                     PV-SRC-PRC-TO-MSTR-MIN                       04250170
042502                     PV-SRC-ON-OTBND-TO-TCLOS-MIN                 04250270
042503                     PV-SRC-ON-OTBND-TO-TSHIP-MIN                 04250370
042504                     PV-SRC-MSTR-CRE-TO-OTBND-MIN                 04250470
042505                     PV-SRC-MSTR-CRE-TO-TCLOS-MIN                 04250570
042506                     PV-SRC-MSTR-CRE-TO-SHIP-MIN                  04250670
042507                     PV-SRC-MSTR-FIRST-TO-OTBND-MIN               04250770
042508                     PV-SRC-MSTR-FIRST-TO-TCLOS-MIN               04250870
042509                     PV-SRC-MSTR-FIRST-TO-SHIP-MIN                04250970
042510                     PV-SRC-MSTR-LAST-TO-OTBND-MIN                04251070
042511                     PV-SRC-MSTR-LAST-TO-TCLOS-MIN                04251170
042512                     PV-SRC-MSTR-LAST-TO-SHIP-MIN                 04251270
042513                     PV-SRC-ON-OTBND-TO-CLOS-MIN                  04251370
042514                     PV-SRC-ON-OTBND-TO-SHIP-MIN                  04251470
042515                     PV-SRC-ARRIVE-TO-PRC-CNT                     04251570
042516                     PV-SRC-ARRIVE-TO-P2L-PKD-CNT                 04251670
042517                     PV-SRC-PRC-TO-P2L-PKD-CNT                    04251770
042518                     PV-SRC-P2L-PKD-TO-CLOSE-CNT                  04251870
042519                     PV-SRC-P2L-OPEN-TO-CLOSE-CNT                 04251970
042520                     PV-SRC-P2L-OPEN-TO-OTBND-CNT                 04252070
042521                     PV-SRC-P2L-CLOSE-TO-OTBND-CNT                04252170
042522                     PV-SRC-ARRIVE-TO-OTBND-CNT                   04252270
042523                     PV-SRC-PRC-TO-OTBND-CNT                      04252370
042524                     PV-SRC-ARRIVE-TO-TCLOS-CNT                   04252470
042525                     PV-SRC-ARRIVE-TO-SHIP-CNT                    04252570
042526                     PV-SRC-P2L-OPEN-TO-TCLOS-CNT                 04252670
042527                     PV-SRC-P2L-OPEN-TO-SHIP-CNT                  04252770
042528                     PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                04252870
042529                     PV-SRC-P2L-CLOSE-TO-SHIP-CNT                 04252970
042530                     PV-SRC-ARRIVE-TO-MSTR-CNT                    04253070
042531                     PV-SRC-PRC-TO-MSTR-CNT                       04253170
042532                     PV-SRC-ON-OTBND-TO-TCLOS-CNT                 04253270
042533                     PV-SRC-ON-OTBND-TO-TSHIP-CNT                 04253370
042534                     PV-SRC-MSTR-CRE-TO-OTBND-CNT                 04253470
042535                     PV-SRC-MSTR-CRE-TO-TCLOS-CNT                 04253570
042536                     PV-SRC-MSTR-CRE-TO-SHIP-CNT                  04253670
042537                     PV-SRC-MSTR-FIRST-TO-OTBND-CNT               04253770
042538                     PV-SRC-MSTR-FIRST-TO-TCLOS-CNT               04253870
042539                     PV-SRC-MSTR-FIRST-TO-SHIP-CNT                04253970
042540                     PV-SRC-MSTR-LAST-TO-OTBND-CNT                04254070
042541                     PV-SRC-MSTR-LAST-TO-TCLOS-CNT                04254170
042542                     PV-SRC-MSTR-LAST-TO-SHIP-CNT                 04254270
042543                     PV-SRC-ON-OTBND-TO-CLOS-CNT                  04254370
042544                     PV-SRC-ON-OTBND-TO-SHIP-CNT.                 04254470
042545                                                                  04254574
042546***  MOVE ZEROES TO  PV-SRC-TRIP-CARTONS                          04254675
042547***                  PV-SRC-TRIP-SRC-CARTONS.                     04254775
042548     MOVE ZEROES TO  PV-SRC-TOTAL-TRIPS.                          04254889
042549                                                                  04254989
042550                                                                  04255089
042551                                                                  04255189
042552****************************************************************  04255289
042553* CALCULATE THE % OF THE CARTONS ON THE TRAILER ARE FOR THE    *  04255389
042554* CARTON SOURCE                                                *  04255489
042555* DMH ADDED 8/19/16                                            *  04255589
042556****************************************************************  04255689
042557 3005-CALC-SRC-CRTN-PCNT.                                         04255789
042558                                                                  04255889
042559     MOVE  ZEROES        TO  PV-TRIP-SRC-CRTN                     04255989
042560                             PV-TRIP-SRC-CRTN-PCNT.               04256089
042561                                                                  04256189
042562     IF  PV-SRC-TRIP-CARTONS            >  0  AND                 04256289
042563         PV-SRC-TRIP-SRC-CARTONS        >  0                      04256389
042564         DIVIDE  PV-SRC-TRIP-SRC-CARTONS                          04256489
042565             BY  PV-SRC-TRIP-CARTONS                              04256589
042566         GIVING  PV-TRIP-SRC-CRTN                                 04256689
042567                   ROUNDED                                        04256799
042568         MULTIPLY  PV-TRIP-SRC-CRTN                               04256889
042569               BY  100                                            04256989
042570           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04257089
042572     ELSE                                                         04257289
042573         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04257389
042574                           PV-TRIP-SRC-CRTN                       04257489
042575     END-IF.                                                      04257589
042576                                                                  04257689
042577     MOVE ZEROES TO  PV-SRC-TRIP-CARTONS                          04257789
042578                     PV-SRC-TRIP-SRC-CARTONS.                     04257889
042579                                                                  04257970
042580                                                                  04258070
042581****************************************************************  04258170
042582* ACCUMULATE TRAILER TOTALS                                    *  04258270
042583****************************************************************  04258370
042584 3010-ACCUM-TRLR-TOTALS.                                          04258470
042585                                                                  04258570
042586     ADD  SU129-TRIP-OPEN-TO-CLOSE-MIN                            04258670
042587       TO PV-TRIP-OPEN-TO-CLOSE-MIN-TOT.                          04258770
042588     ADD  1                                                       04258870
042589       TO PV-TRIP-OPEN-TO-CLOSE-CNT-TOT.                          04258970
042590                                                                  04259070
042591     ADD  SU129-TRIP-CLOSE-TO-SHIP-MIN                            04259170
042592       TO PV-TRIP-CLOSE-TO-SHIP-MIN-TOT.                          04259270
042593     ADD  1                                                       04259370
042594       TO PV-TRIP-CLOSE-TO-SHIP-CNT-TOT.                          04259470
042595                                                                  04259570
042596     ADD  SU129-TRIP-OPEN-TO-SHIP-MIN                             04259670
042597       TO PV-TRIP-OPEN-TO-SHIP-MIN-TOT.                           04259770
042598     ADD  1                                                       04259870
042599       TO PV-TRIP-OPEN-TO-SHIP-CNT-TOT.                           04259970
042600                                                                  04260070
042601     ADD  SU129-INPUT-RECORD-COUNT                                04260170
042602       TO PV-TRIP-INPUT-RECORD-TOTAL.                             04260270
042603                                                                  04260370
042604     ADD SU129-ARRIVE-TO-PRC-MIN                                  04260470
042605      TO PV-TRIP-ARRIVE-TO-PRC-MIN-TOT.                           04260570
042606     ADD SU129-ARRIVE-TO-PRC-CNT                                  04260670
042607      TO PV-TRIP-ARRIVE-TO-PRC-CNT-TOT.                           04260770
042608                                                                  04260870
042609     ADD SU129-ARRIVE-TO-P2L-PKD-MIN                              04260970
042610      TO PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT.                          04261070
042611     ADD SU129-ARRIVE-TO-P2L-PKD-CNT                              04261170
042612      TO PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT.                          04261270
042613                                                                  04261370
042614     ADD SU129-PRC-TO-P2L-PKD-MIN                                 04261470
042615      TO PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT.                          04261570
042616     ADD SU129-PRC-TO-P2L-PKD-CNT                                 04261670
042617      TO PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT.                          04261770
042618                                                                  04261870
042619     ADD SU129-P2L-PKD-TO-CLOSE-MIN                               04261970
042620      TO PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT.                          04262070
042621     ADD SU129-P2L-PKD-TO-CLOSE-CNT                               04262170
042622      TO PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT.                          04262270
042623                                                                  04262370
042624     ADD SU129-P2L-OPEN-TO-CLOSE-MIN                              04262470
042625      TO PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT.                          04262570
042626     ADD SU129-P2L-OPEN-TO-CLOSE-CNT                              04262670
042627      TO PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT.                          04262770
042628                                                                  04262870
042629     ADD SU129-P2L-OPEN-TO-OTBND-MIN                              04262970
042630      TO PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT.                          04263070
042631     ADD SU129-P2L-OPEN-TO-OTBND-CNT                              04263170
042632      TO PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT.                          04263270
042633                                                                  04263370
042634                                                                  04263470
042635     ADD SU129-P2L-CLOSE-TO-OTBND-MIN                             04263570
042636      TO PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT.                          04263670
042637     ADD SU129-P2L-CLOSE-TO-OTBND-CNT                             04263770
042638      TO PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT.                          04263870
042639                                                                  04263970
042640     ADD SU129-ARRIVE-TO-OTBND-MIN                                04264070
042641      TO PV-TRIP-ARRIV-TO-OTBND-MIN-TOT.                          04264170
042642     ADD SU129-ARRIVE-TO-OTBND-CNT                                04264270
042643      TO PV-TRIP-ARRIV-TO-OTBND-CNT-TOT.                          04264370
042644                                                                  04264470
042645     ADD SU129-PRC-TO-OTBND-MIN                                   04264570
042646      TO PV-TRIP-PRC-TO-OTBND-MIN-TOT.                            04264670
042647     ADD SU129-PRC-TO-OTBND-CNT                                   04264770
042648      TO PV-TRIP-PRC-TO-OTBND-CNT-TOT.                            04264870
042649                                                                  04264970
042650     ADD SU129-ARRIVE-TO-TCLOS-MIN                                04265070
042651      TO PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT.                          04265170
042652     ADD SU129-ARRIVE-TO-TCLOS-CNT                                04265270
042653      TO PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT.                          04265370
042654                                                                  04265470
042655     ADD SU129-ARRIVE-TO-SHIP-MIN                                 04265570
042656      TO PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT.                          04265670
042657     ADD SU129-ARRIVE-TO-SHIP-CNT                                 04265770
042658      TO PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT.                          04265870
042659                                                                  04265970
042660     ADD SU129-P2L-OPEN-TO-TCLOS-MIN                              04266070
042661      TO PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT.                          04266170
042662     ADD SU129-P2L-OPEN-TO-TCLOS-CNT                              04266270
042663      TO PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT.                          04266370
042664                                                                  04266470
042665     ADD SU129-P2L-OPEN-TO-SHIP-MIN                               04266570
042666      TO PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT.                          04266670
042667     ADD SU129-P2L-OPEN-TO-SHIP-CNT                               04266770
042668      TO PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT.                          04266870
042669                                                                  04266970
042670     ADD SU129-P2L-CLOSE-TO-TCLOS-MIN                             04267070
042671      TO PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT.                          04267170
042672     ADD SU129-P2L-CLOSE-TO-TCLOS-CNT                             04267270
042673      TO PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT.                          04267370
042674                                                                  04267470
042675     ADD SU129-P2L-CLOSE-TO-SHIP-MIN                              04267570
042676      TO PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT.                          04267670
042677     ADD SU129-P2L-CLOSE-TO-SHIP-CNT                              04267770
042678      TO PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT.                          04267870
042679                                                                  04267970
042680     ADD SU129-ARRIVE-TO-MSTR-MIN                                 04268070
042681      TO PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT.                          04268170
042682     ADD SU129-ARRIVE-TO-MSTR-CNT                                 04268270
042683      TO PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT.                          04268370
042684                                                                  04268470
042685     ADD SU129-PRC-TO-MSTR-MIN                                    04268570
042686      TO PV-TRIP-PRC-TO-MSTR-MIN-TOT.                             04268670
042687     ADD SU129-PRC-TO-MSTR-CNT                                    04268770
042688      TO PV-TRIP-PRC-TO-MSTR-CNT-TOT.                             04268870
042689                                                                  04268970
042690     ADD SU129-ON-OTBND-TO-CLOS-MIN                               04269070
042691      TO PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT.                          04269170
042692     ADD SU129-ON-OTBND-TO-CLOS-CNT                               04269270
042693      TO PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT.                          04269370
042694                                                                  04269470
042695     ADD SU129-ON-OTBND-TO-SHIP-MIN                               04269570
042696      TO PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT.                          04269670
042697     ADD SU129-ON-OTBND-TO-SHIP-CNT                               04269770
042698      TO PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT.                          04269870
042699*                                                                 04269970
042700* DMH 8/19/16 - BEGIN                                             04270070
042701*                                                                 04270170
042702     ADD SU129-TRIP-CARTONS                                       04270270
042703                TO PV-TRIP-TRIP-CARTONS.                          04270370
042704     ADD SU129-TRIP-SRC-CARTONS                                   04270470
042705                TO PV-TRIP-TRIP-SRC-CARTONS.                      04270570
042707*                                                                 04270770
042708* DMH 8/19/16 - END                                               04270870
042709*                                                                 04270970
042710                                                                  04271070
042711                                                                  04271170
042712****************************************************************  04271270
042713* CALCULATE THE AVERAGES                                       *  04271370
042714****************************************************************  04271470
042715 3020-CALC-TRIP-AVERAGES.                                         04271570
042716                                                                  04271670
042717     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04271770
042718                             PV-TRIP-CLOSE-TO-SHIP-AVG            04271870
042719                             PV-TRIP-OPEN-TO-SHIP-AVG             04271970
042720                             PV-ARRIVE-TO-PRC-AVG                 04272070
042721                             PV-ARRIVE-TO-P2L-PKD-AVG             04272100
042722                             PV-PRC-TO-P2L-PKD-AVG                04272200
042730                             PV-P2L-PKD-TO-CLOSE-AVG              04273000
042740                             PV-P2L-OPEN-TO-CLOSE-AVG             04274000
042750                             PV-P2L-OPEN-TO-OTBND-AVG             04275000
042760                             PV-P2L-CLOSE-TO-OTBND-AVG            04276000
042761                             PV-ARRIVE-TO-OTBND-AVG               04276100
042762                             PV-PRC-TO-OTBND-AVG                  04276200
042763                             PV-ARRIVE-TO-TCLOS-AVG               04276300
042764                             PV-ARRIVE-TO-SHIP-AVG                04276400
042765                             PV-P2L-OPEN-TO-TCLOS-AVG             04276500
042766                             PV-P2L-OPEN-TO-SHIP-AVG              04276600
042767                             PV-P2L-CLOSE-TO-TCLOS-AVG            04276700
042768                             PV-P2L-CLOSE-TO-SHIP-AVG             04276800
042769                             PV-ARRIVE-TO-MSTR-AVG                04276900
042770                             PV-PRC-TO-MSTR-AVG                   04277000
042771                             PV-MSTR-CRE-TO-OTBND-AVG             04277100
042772                             PV-MSTR-CRE-TO-TCLOS-AVG             04277200
042773                             PV-MSTR-CRE-TO-SHIP-AVG              04277300
042774                             PV-MSTR-FIRST-TO-OTBND-AVG           04277400
042775                             PV-MSTR-FIRST-TO-TCLOS-AVG           04277500
042776                             PV-MSTR-FIRST-TO-SHIP-AVG            04277600
042777                             PV-MSTR-LAST-TO-OTBND-AVG            04277700
042778                             PV-MSTR-LAST-TO-TCLOS-AVG            04277800
042779                             PV-MSTR-LAST-TO-SHIP-AVG             04277900
042780                             PV-ON-OTBND-TO-CLOS-AVG              04278000
042781                             PV-ON-OTBND-TO-SHIP-AVG              04278100
042782                             PV-TRIP-OPEN-TO-CLOSE-DAY            04278200
042783                             PV-TRIP-CLOSE-TO-SHIP-DAY            04278300
042784                             PV-TRIP-OPEN-TO-SHIP-DAY             04278400
042785                             PV-ARRIVE-TO-PRC-DAY                 04278500
042786                             PV-ARRIVE-TO-P2L-PKD-DAY             04278600
042787                             PV-PRC-TO-P2L-PKD-DAY                04278700
042788                             PV-P2L-PKD-TO-CLOSE-DAY              04278800
042789                             PV-P2L-OPEN-TO-CLOSE-DAY             04278900
042790                             PV-P2L-OPEN-TO-OTBND-DAY             04279000
042791                             PV-P2L-CLOSE-TO-OTBND-DAY            04279100
042792                             PV-ARRIVE-TO-OTBND-DAY               04279200
042793                             PV-PRC-TO-OTBND-DAY                  04279300
042794                             PV-ARRIVE-TO-TCLOS-DAY               04279400
042795                             PV-ARRIVE-TO-SHIP-DAY                04279500
042796                             PV-P2L-OPEN-TO-TCLOS-DAY             04279600
042797                             PV-P2L-OPEN-TO-SHIP-DAY              04279700
042798                             PV-P2L-CLOSE-TO-TCLOS-DAY            04279800
042799                             PV-P2L-CLOSE-TO-SHIP-DAY             04279900
042800                             PV-ARRIVE-TO-MSTR-DAY                04280000
042801                             PV-PRC-TO-MSTR-DAY                   04280100
042802                             PV-MSTR-CRE-TO-OTBND-DAY             04280200
042803                             PV-MSTR-CRE-TO-TCLOS-DAY             04280300
042804                             PV-MSTR-CRE-TO-SHIP-DAY              04280400
042805                             PV-MSTR-FIRST-TO-OTBND-DAY           04280500
042806                             PV-MSTR-FIRST-TO-TCLOS-DAY           04280600
042807                             PV-MSTR-FIRST-TO-SHIP-DAY            04280700
042808                             PV-MSTR-LAST-TO-OTBND-DAY            04280800
042809                             PV-MSTR-LAST-TO-TCLOS-DAY            04280900
042810                             PV-MSTR-LAST-TO-SHIP-DAY             04281000
042811                             PV-ON-OTBND-TO-CLOS-DAY              04281100
042812                             PV-ON-OTBND-TO-SHIP-DAY.             04281200
042813                                                                  04281300
042814                                                                  04281400
042815     IF  PV-TRIP-OPEN-TO-CLOSE-MIN-TOT   >  0  AND                04281523
042816         PV-TRIP-OPEN-TO-CLOSE-CNT-TOT   >  0                     04281623
042817         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-MIN-TOT                    04281723
042818             BY  PV-TRIP-OPEN-TO-CLOSE-CNT-TOT                    04281823
042819         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04281923
042821                 ROUNDED                                          04282123
042822         DIVIDE PV-TRIP-OPEN-TO-CLOSE-AVG                         04282223
042823             BY  1440                                             04282323
042824         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04282423
042825                 ROUNDED                                          04282523
042826     ELSE                                                         04282623
042830         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04283000
042831                           PV-TRIP-OPEN-TO-CLOSE-DAY              04283100
042832     END-IF.                                                      04283200
042833                                                                  04283300
042834     IF  PV-TRIP-CLOSE-TO-SHIP-MIN-TOT   >  0  AND                04283423
042835         PV-TRIP-CLOSE-TO-SHIP-CNT-TOT   >  0                     04283523
042836         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-MIN-TOT                    04283623
042837             BY  PV-TRIP-CLOSE-TO-SHIP-CNT-TOT                    04283723
042838         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04283823
042839                 ROUNDED                                          04283923
042840         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04284023
042841             BY  1440                                             04284123
042842         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04284223
042843                 ROUNDED                                          04284323
042844     ELSE                                                         04284423
042845         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04284523
042846                           PV-TRIP-CLOSE-TO-SHIP-DAY              04284623
042847     END-IF.                                                      04284723
042848                                                                  04284823
042849     IF  PV-TRIP-OPEN-TO-SHIP-MIN-TOT   >  0  AND                 04284923
042850         PV-TRIP-OPEN-TO-SHIP-CNT-TOT   >  0                      04285023
042851         DIVIDE  PV-TRIP-OPEN-TO-SHIP-MIN-TOT                     04285123
042852             BY  PV-TRIP-OPEN-TO-SHIP-CNT-TOT                     04285223
042853         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04285323
042854                 ROUNDED                                          04285423
042855         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04285523
042856             BY  1440                                             04285623
042857         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04285723
042858                 ROUNDED                                          04285823
042859     ELSE                                                         04285923
042860         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04286023
042861                           PV-TRIP-OPEN-TO-SHIP-DAY               04286100
042862     END-IF.                                                      04286200
042863                                                                  04286300
042864     IF  PV-TRIP-ARRIVE-TO-PRC-MIN-TOT  >  0  AND                 04286400
042865         PV-TRIP-ARRIVE-TO-PRC-CNT-TOT  >  0                      04286500
042866         DIVIDE PV-TRIP-ARRIVE-TO-PRC-MIN-TOT                     04286600
042867             BY PV-TRIP-ARRIVE-TO-PRC-CNT-TOT                     04286700
042868         GIVING PV-ARRIVE-TO-PRC-AVG                              04286800
042869                 ROUNDED                                          04286900
042870         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04287000
042871             BY 1440                                              04287100
042872         GIVING PV-ARRIVE-TO-PRC-DAY                              04287200
042873                 ROUNDED                                          04287300
042874     ELSE                                                         04287400
042875         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04287500
042876                           PV-ARRIVE-TO-PRC-DAY                   04287600
042877     END-IF.                                                      04287700
042878                                                                  04287800
042879     IF  PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT   >  0  AND               04287900
042880         PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT   >  0                    04288000
042881         DIVIDE PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT                    04288100
042882             BY PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT                    04288200
042883         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04288300
042884                 ROUNDED                                          04288400
042885         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04288500
042886             BY 1440                                              04288600
042887         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04288700
042888                 ROUNDED                                          04288800
042889     ELSE                                                         04288900
042890         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04289000
042891                           PV-ARRIVE-TO-P2L-PKD-DAY               04289100
042892     END-IF.                                                      04289200
042893                                                                  04289300
042894     IF  PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT >  0  AND                 04289400
042895         PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT >  0                      04289500
042896         DIVIDE PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT                    04289600
042897             BY PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT                    04289700
042898         GIVING PV-PRC-TO-P2L-PKD-AVG                             04289800
042899                 ROUNDED                                          04289900
042900         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04290000
042901             BY 1440                                              04290100
042902         GIVING PV-PRC-TO-P2L-PKD-DAY                             04290200
042903                 ROUNDED                                          04290300
042904     ELSE                                                         04290400
042905         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04290500
042906                           PV-PRC-TO-P2L-PKD-DAY                  04290600
042907     END-IF.                                                      04290700
042908                                                                  04290800
042909     IF  PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT    >  0  AND              04290900
042910         PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT    >  0                   04291000
042911         DIVIDE PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT                    04291100
042912             BY PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT                    04291200
042913         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04291300
042914                 ROUNDED                                          04291400
042915         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04291500
042916             BY 1440                                              04291600
042917         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04291700
042918                 ROUNDED                                          04291800
042919     ELSE                                                         04291900
042920         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04292000
042921                           PV-P2L-PKD-TO-CLOSE-DAY                04292100
042922     END-IF.                                                      04292200
042923                                                                  04292300
042924     IF  PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT    >  0  AND              04292400
042925         PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT    >  0                   04292500
042926         DIVIDE PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT                    04292600
042927             BY PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT                    04292700
042928         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04292800
042929                 ROUNDED                                          04292900
042930         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04293000
042931             BY 1440                                              04293100
042932         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04293200
042933                 ROUNDED                                          04293300
042934     ELSE                                                         04293400
042935         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04293500
042936                           PV-P2L-OPEN-TO-CLOSE-DAY               04293600
042937     END-IF.                                                      04293700
042938                                                                  04293800
042939     IF  PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT    >  0  AND              04293900
042940         PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT    >  0                   04294000
042941         DIVIDE PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT                    04294100
042942             BY PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT                    04294200
042943         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04294300
042944                 ROUNDED                                          04294400
042945         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04294500
042946             BY 1440                                              04294600
042947         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04294700
042948                 ROUNDED                                          04294800
042949     ELSE                                                         04294900
042950         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04295000
042951                           PV-P2L-OPEN-TO-OTBND-DAY               04295100
042952     END-IF.                                                      04295200
042953                                                                  04295300
042954     IF  PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT >  0  AND                 04295400
042955         PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT     >  0                  04295500
042956         DIVIDE PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT                    04295600
042957             BY PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT                    04295700
042958         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04295800
042959                 ROUNDED                                          04295900
042960         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04296000
042961             BY 1440                                              04296100
042962         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04296200
042963                 ROUNDED                                          04296300
042964     ELSE                                                         04296400
042965         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04296500
042966                           PV-P2L-CLOSE-TO-OTBND-DAY              04296600
042967     END-IF.                                                      04296700
042968                                                                  04296800
042969     IF  PV-TRIP-ARRIV-TO-OTBND-MIN-TOT  >  0  AND                04296900
042970         PV-TRIP-ARRIV-TO-OTBND-CNT-TOT   >  0                    04297000
042971         DIVIDE PV-TRIP-ARRIV-TO-OTBND-MIN-TOT                    04297100
042972             BY PV-TRIP-ARRIV-TO-OTBND-CNT-TOT                    04297200
042973         GIVING PV-ARRIVE-TO-OTBND-AVG                            04297300
042974                 ROUNDED                                          04297400
042975         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04297500
042976             BY 1440                                              04297600
042977         GIVING PV-ARRIVE-TO-OTBND-DAY                            04297700
042978                 ROUNDED                                          04297800
042979     ELSE                                                         04297900
042980         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04298000
042981                           PV-ARRIVE-TO-OTBND-DAY                 04298100
042982     END-IF.                                                      04298200
042983                                                                  04298300
042984     IF  PV-TRIP-PRC-TO-OTBND-MIN-TOT >  0  AND                   04298400
042985         PV-TRIP-PRC-TO-OTBND-CNT-TOT >  0                        04298500
042986         DIVIDE PV-TRIP-PRC-TO-OTBND-MIN-TOT                      04298600
042987             BY PV-TRIP-PRC-TO-OTBND-CNT-TOT                      04298700
042988         GIVING PV-PRC-TO-OTBND-AVG                               04298800
042989                 ROUNDED                                          04298900
042990         DIVIDE PV-PRC-TO-OTBND-AVG                               04299000
042991             BY 1440                                              04299100
042992         GIVING PV-PRC-TO-OTBND-DAY                               04299200
042993                 ROUNDED                                          04299300
042994     ELSE                                                         04299400
042995         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04299500
042996                           PV-PRC-TO-OTBND-DAY                    04299600
042997     END-IF.                                                      04299700
042998                                                                  04299800
042999     IF  PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT >  0  AND                 04299900
043000         PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT >  0                      04300000
043001         DIVIDE PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT                    04300100
043002             BY PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT                    04300200
043003         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04300300
043004                 ROUNDED                                          04300400
043005         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04300500
043006             BY 1440                                              04300600
043007         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04300700
043008                 ROUNDED                                          04300800
043009     ELSE                                                         04300900
043010         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04301000
043011                           PV-ARRIVE-TO-TCLOS-DAY                 04301100
043012     END-IF.                                                      04301200
043013                                                                  04301300
043014     IF  PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT >  0  AND                 04301400
043015         PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT >  0                      04301500
043016         DIVIDE PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT                    04301600
043017             BY PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT                    04301700
043018         GIVING PV-ARRIVE-TO-SHIP-AVG                             04301800
043019                 ROUNDED                                          04301900
043020         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04302000
043021             BY 1440                                              04302100
043022         GIVING PV-ARRIVE-TO-SHIP-DAY                             04302200
043023                 ROUNDED                                          04302300
043024     ELSE                                                         04302400
043025         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04302500
043026                           PV-ARRIVE-TO-SHIP-DAY                  04302600
043027     END-IF.                                                      04302700
043028                                                                  04302800
043029     IF  PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT    >  0  AND              04302900
043030         PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT    >  0                   04303000
043031         DIVIDE PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT                    04303100
043032             BY PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT                    04303200
043033         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04303300
043034                 ROUNDED                                          04303400
043035         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04303500
043036             BY 1440                                              04303600
043037         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04303700
043038                 ROUNDED                                          04303800
043039     ELSE                                                         04303900
043040         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04304000
043041                           PV-P2L-OPEN-TO-TCLOS-DAY               04304100
043042     END-IF.                                                      04304200
043043                                                                  04304300
043044     IF  PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT >  0  AND                 04304400
043045         PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT >  0                      04304500
043046         DIVIDE PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT                    04304600
043047             BY PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT                    04304700
043048         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04304800
043049                 ROUNDED                                          04304900
043050         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04305000
043051             BY 1440                                              04305100
043052         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04305200
043053                 ROUNDED                                          04305300
043054     ELSE                                                         04305400
043055         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04305500
043056                           PV-P2L-OPEN-TO-SHIP-DAY                04305600
043057     END-IF.                                                      04305700
043058                                                                  04305800
043059     IF  PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT >  0  AND                 04305900
043060         PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT >  0                      04306000
043061         DIVIDE PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT                    04306100
043062             BY PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT                    04306200
043063         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04306300
043064                 ROUNDED                                          04306400
043065         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04306500
043066             BY 1440                                              04306600
043067         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04306700
043068                 ROUNDED                                          04306800
043069     ELSE                                                         04306900
043070         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04307000
043071                           PV-P2L-CLOSE-TO-TCLOS-DAY              04307100
043072     END-IF.                                                      04307200
043073                                                                  04307300
043074     IF  PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT >  0  AND                 04307400
043075         PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT >  0                      04307500
043076         DIVIDE PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT                    04307600
043077             BY PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT                    04307700
043078         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04307800
043079                 ROUNDED                                          04307900
043080         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04308000
043081             BY 1440                                              04308100
043082         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04308200
043083                 ROUNDED                                          04308300
043084     ELSE                                                         04308400
043085         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04308500
043086                           PV-P2L-CLOSE-TO-SHIP-DAY               04308600
043087     END-IF.                                                      04308700
043088                                                                  04308800
043089     IF  PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT >  0  AND                 04308900
043090         PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT >  0                      04309000
043091         DIVIDE PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT                    04309100
043092             BY PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT                    04309200
043093         GIVING PV-ARRIVE-TO-MSTR-AVG                             04309300
043094                 ROUNDED                                          04309400
043095         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04309500
043096             BY 1440                                              04309600
043097         GIVING PV-ARRIVE-TO-MSTR-DAY                             04309700
043098                 ROUNDED                                          04309800
043099     ELSE                                                         04309900
043100         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04310000
043101                           PV-ARRIVE-TO-MSTR-DAY                  04310100
043102     END-IF.                                                      04310200
043103                                                                  04310300
043104     IF  PV-TRIP-PRC-TO-MSTR-MIN-TOT  > 0  AND                    04310400
043105         PV-TRIP-PRC-TO-MSTR-CNT-TOT  > 0                         04310500
043106         DIVIDE PV-TRIP-PRC-TO-MSTR-MIN-TOT                       04310600
043107             BY PV-TRIP-PRC-TO-MSTR-CNT-TOT                       04310700
043108         GIVING PV-PRC-TO-MSTR-AVG                                04310800
043109                 ROUNDED                                          04310900
043110         DIVIDE PV-PRC-TO-MSTR-AVG                                04311000
043111             BY 1440                                              04311100
043112         GIVING PV-PRC-TO-MSTR-DAY                                04311200
043113                 ROUNDED                                          04311300
043114     ELSE                                                         04311400
043115         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04311500
043116                           PV-PRC-TO-MSTR-DAY                     04311600
043117     END-IF.                                                      04311700
043118                                                                  04311800
043119     IF  PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT >  0  AND                 04311900
043120         PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT >  0                      04312000
043121         DIVIDE PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT                    04312100
043122             BY PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT                    04312200
043123         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04312300
043124                 ROUNDED                                          04312400
043125         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04312500
043126             BY 1440                                              04312600
043127         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04312700
043128                 ROUNDED                                          04312800
043129     ELSE                                                         04312900
043130         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04313000
043131                           PV-ON-OTBND-TO-CLOS-DAY                04313100
043132     END-IF.                                                      04313200
043133                                                                  04313300
043134     IF  PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT  >  0  AND                04313400
043135         PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT  >  0                     04313500
043136         DIVIDE PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT                    04313600
043137             BY PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT                    04313700
043138         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04313800
043139                 ROUNDED                                          04313900
043140         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04314000
043141             BY 1440                                              04314100
043142         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04314200
043143                 ROUNDED                                          04314300
043144     ELSE                                                         04314400
043145         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04314500
043146                           PV-ON-OTBND-TO-SHIP-DAY                04314600
043147     END-IF.                                                      04314700
043148                                                                  04314800
043149     IF  PV-TRIP-MST-CRE-TO-OTB-MIN-TOT >  0  AND                 04314900
043150         PV-TRIP-MST-CRE-TO-OTB-CNT-TOT    >  0                   04315000
043151         DIVIDE PV-TRIP-MST-CRE-TO-OTB-MIN-TOT                    04315100
043152             BY PV-TRIP-MST-CRE-TO-OTB-CNT-TOT                    04315200
043153         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04315300
043154                 ROUNDED                                          04315400
043155         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04315500
043156             BY 1440                                              04315600
043157         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04315700
043158                 ROUNDED                                          04315800
043159     ELSE                                                         04315900
043160         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04316000
043161                           PV-MSTR-CRE-TO-OTBND-DAY               04316100
043162     END-IF.                                                      04316200
043163                                                                  04316300
043164     IF  PV-TRIP-MST-CRE-TO-TCL-MIN-TOT  >  0  AND                04316400
043165         PV-TRIP-MST-CRE-TO-TCL-CNT-TOT  >  0                     04316500
043166         DIVIDE PV-TRIP-MST-CRE-TO-TCL-MIN-TOT                    04316600
043167             BY PV-TRIP-MST-CRE-TO-TCL-CNT-TOT                    04316700
043168         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04316800
043169                 ROUNDED                                          04316900
043170         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04317000
043171             BY 1440                                              04317100
043172         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04317200
043173                 ROUNDED                                          04317300
043174     ELSE                                                         04317400
043175         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04317500
043176                           PV-MSTR-CRE-TO-TCLOS-DAY               04317600
043177     END-IF.                                                      04317700
043178                                                                  04317800
043179     IF  PV-TRIP-MST-CRE-TO-SHP-MIN-TOT  >  0  AND                04317900
043180         PV-TRIP-MST-CRE-TO-SHP-CNT-TOT  >  0                     04318000
043181         DIVIDE PV-TRIP-MST-CRE-TO-SHP-MIN-TOT                    04318100
043182             BY PV-TRIP-MST-CRE-TO-SHP-CNT-TOT                    04318200
043183         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04318300
043184                 ROUNDED                                          04318400
043185         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04318500
043186             BY 1440                                              04318600
043187         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04318700
043188                 ROUNDED                                          04318800
043189     ELSE                                                         04318900
043190         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04319000
043191                           PV-MSTR-CRE-TO-SHIP-DAY                04319100
043192     END-IF.                                                      04319200
043193                                                                  04319300
043194     IF  PV-TRIP-MST-1ST-TO-OTB-MIN-TOT >     0  AND              04319400
043195         PV-TRIP-MST-1ST-TO-OTB-CNT-TOT >     0                   04319500
043196         DIVIDE PV-TRIP-MST-1ST-TO-OTB-MIN-TOT                    04319600
043197             BY PV-TRIP-MST-1ST-TO-OTB-CNT-TOT                    04319700
043198         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04319800
043199                 ROUNDED                                          04319900
043200         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04320000
043201             BY 1440                                              04320100
043202         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04320200
043203                 ROUNDED                                          04320300
043204     ELSE                                                         04320400
043205         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04320500
043206                           PV-MSTR-FIRST-TO-OTBND-DAY             04320600
043207     END-IF.                                                      04320700
043208                                                                  04320800
043209     IF  PV-TRIP-MST-1ST-TO-TCL-MIN-TOT  >     0  AND             04320900
043210         PV-TRIP-MST-1ST-TO-TCL-CNT-TOT >     0                   04321000
043211         DIVIDE PV-TRIP-MST-1ST-TO-TCL-MIN-TOT                    04321100
043212             BY PV-TRIP-MST-1ST-TO-TCL-CNT-TOT                    04321200
043213         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04321300
043214                 ROUNDED                                          04321400
043215         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04321500
043216             BY 1440                                              04321600
043217         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04321700
043218                 ROUNDED                                          04321800
043219     ELSE                                                         04321900
043220         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04322000
043221                           PV-MSTR-FIRST-TO-TCLOS-DAY             04322100
043222     END-IF.                                                      04322200
043223                                                                  04322300
043224     IF  PV-TRIP-MST-1ST-TO-SHP-MIN-TOT  >     0  AND             04322400
043225         PV-TRIP-MST-1ST-TO-SHP-CNT-TOT  >     0                  04322500
043226         DIVIDE PV-TRIP-MST-1ST-TO-SHP-MIN-TOT                    04322600
043227             BY PV-TRIP-MST-1ST-TO-SHP-CNT-TOT                    04322700
043228         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04322800
043229                 ROUNDED                                          04322900
043230         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04323000
043231             BY 1440                                              04323100
043232         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04323200
043233                 ROUNDED                                          04323300
043234     ELSE                                                         04323400
043235         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04323500
043236                           PV-MSTR-FIRST-TO-SHIP-DAY              04323600
043237     END-IF.                                                      04323700
043238                                                                  04323800
043239     IF  PV-TRIP-MST-LST-TO-OTB-MIN-TOT  >    0  AND              04323900
043240         PV-TRIP-MST-LST-TO-OTB-CNT-TOT  >    0                   04324000
043241         DIVIDE PV-TRIP-MST-LST-TO-OTB-MIN-TOT                    04324100
043242             BY PV-TRIP-MST-LST-TO-OTB-CNT-TOT                    04324200
043243         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04324300
043244                 ROUNDED                                          04324400
043245         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04324500
043246             BY 1440                                              04324600
043247         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04324700
043248                 ROUNDED                                          04324800
043249     ELSE                                                         04324900
043250         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04325000
043251                           PV-MSTR-LAST-TO-OTBND-DAY              04325100
043252     END-IF.                                                      04325200
043253                                                                  04325300
043254     IF  PV-TRIP-MST-LST-TO-TCL-MIN-TOT  >    0  AND              04325400
043255         PV-TRIP-MST-LST-TO-TCL-CNT-TOT  >    0                   04325500
043256         DIVIDE PV-TRIP-MST-LST-TO-TCL-MIN-TOT                    04325600
043257             BY PV-TRIP-MST-LST-TO-TCL-CNT-TOT                    04325700
043258         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04325800
043259                 ROUNDED                                          04325900
043260         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04326000
043261             BY 1440                                              04326100
043262         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04326200
043263                 ROUNDED                                          04326300
043264     ELSE                                                         04326400
043265         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04326500
043266                           PV-MSTR-LAST-TO-TCLOS-DAY              04326600
043267     END-IF.                                                      04326700
043268                                                                  04326800
043269     IF  PV-TRIP-MST-LST-TO-SHP-MIN-TOT  >    0  AND              04326900
043270         PV-TRIP-MST-LST-TO-SHP-CNT-TOT  >    0                   04327000
043271         DIVIDE PV-TRIP-MST-LST-TO-SHP-MIN-TOT                    04327100
043272             BY PV-TRIP-MST-LST-TO-SHP-CNT-TOT                    04327200
043273         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04327300
043274                 ROUNDED                                          04327400
043275         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04327500
043276             BY 1440                                              04327600
043277         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04327700
043278                 ROUNDED                                          04327800
043279     ELSE                                                         04327900
043280         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04328000
043281                           PV-MSTR-LAST-TO-SHIP-DAY               04328100
043282     END-IF.                                                      04328200
043283                                                                  04328300
043284*                                                                 04328470
043285*** DMH - 08/19/16 BEGIN                                          04328570
043286*                                                                 04328670
043287     MOVE  ZEROES        TO  PV-TRIP-SRC-CRTN                     04328770
043288                             PV-TRIP-SRC-CRTN-PCNT.               04328870
043289                                                                  04328970
043290     IF  PV-TRIP-TRIP-CARTONS               >  0  AND             04329070
043291         PV-TRIP-TRIP-SRC-CARTONS           >  0                  04329170
043292         DIVIDE  PV-TRIP-TRIP-CARTONS                             04329270
043293             BY  PV-TRIP-TRIP-CARTONS                             04329370
043294         GIVING  PV-TRIP-SRC-CRTN                                 04329470
043295                   ROUNDED                                        04329599
043296         MULTIPLY  PV-TRIP-SRC-CRTN                               04329670
043297               BY  100                                            04329770
043298           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04329870
043300     ELSE                                                         04330070
043301         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04330170
043302                           PV-TRIP-SRC-CRTN                       04330270
043303     END-IF.                                                      04330370
043304*                                                                 04330470
043305*** DMH - 08/19/16 - END                                          04330570
043306*                                                                 04330670
043307                                                                  04330770
043308     PERFORM 4010-WRITE-DC-SUM-RECORD.                            04330820
043309                                                                  04330920
043310     MOVE ZEROES  TO PV-TRIP-OPEN-TO-CLOSE-MIN-TOT                04331023
043311                     PV-TRIP-CLOSE-TO-SHIP-MIN-TOT                04331120
043312                     PV-TRIP-OPEN-TO-SHIP-MIN-TOT                 04331220
043313                     PV-TRIP-OPEN-TO-CLOSE-CNT-TOT                04331323
043314                     PV-TRIP-CLOSE-TO-SHIP-CNT-TOT                04331423
043315                     PV-TRIP-OPEN-TO-SHIP-CNT-TOT                 04331523
043316                                                                  04331620
043317                     PV-TRIP-ARRIVE-TO-PRC-MIN-TOT                04331720
043318                     PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT               04331820
043319                     PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT               04331920
043320                     PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT               04332020
043321                     PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT               04332120
043322                     PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT               04332220
043323                     PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT               04332320
043324                     PV-TRIP-ARRIV-TO-OTBND-MIN-TOT               04332420
043325                     PV-TRIP-PRC-TO-OTBND-MIN-TOT                 04332520
043326                     PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT               04332620
043327                     PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT               04332720
043328                     PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT               04332820
043329                     PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT               04332920
043330                     PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT               04333020
043331                     PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT               04333120
043332                     PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT               04333220
043333                     PV-TRIP-PRC-TO-MSTR-MIN-TOT                  04333320
043334                     PV-TRIP-ON-OTBND-TO-TCLOS-TOT                04333420
043335                     PV-TRIP-ON-OTBND-TO-TSHIP-TOT                04333520
043336                     PV-TRIP-MST-CRE-TO-OTB-MIN-TOT               04333620
043337                     PV-TRIP-MST-CRE-TO-TCL-MIN-TOT               04333720
043338                     PV-TRIP-MST-CRE-TO-SHP-MIN-TOT               04333820
043339                     PV-TRIP-MST-1ST-TO-OTB-MIN-TOT               04333920
043340                     PV-TRIP-MST-1ST-TO-TCL-MIN-TOT               04334020
043341                     PV-TRIP-MST-1ST-TO-SHP-MIN-TOT               04334120
043342                     PV-TRIP-MST-LST-TO-OTB-MIN-TOT               04334220
043343                     PV-TRIP-MST-LST-TO-TCL-MIN-TOT               04334320
043344                     PV-TRIP-MST-LST-TO-SHP-MIN-TOT               04334420
043345                     PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT               04334520
043346                     PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT               04334620
043347                     PV-TRIP-INPUT-RECORD-TOTAL                   04334720
043348                     PV-TRIP-ARRIVE-TO-PRC-CNT-TOT                04334820
043349                     PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT               04334920
043350                     PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT               04335020
043351                     PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT               04335120
043352                     PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT               04335220
043353                     PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT               04335320
043354                     PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT               04335420
043355                     PV-TRIP-ARRIV-TO-OTBND-CNT-TOT               04335520
043356                     PV-TRIP-PRC-TO-OTBND-CNT-TOT                 04335620
043357                     PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT               04335720
043358                     PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT               04335820
043359                     PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT               04335920
043360                     PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT               04336020
043361                     PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT               04336120
043362                     PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT               04336220
043363                     PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT               04336320
043364                     PV-TRIP-PRC-TO-MSTR-CNT-TOT                  04336420
043365                     PV-TRIP-ON-OTB-TO-TCL0-CNT-TOT               04336520
043366                     PV-TRIP-ON-OTB-TO-TSHP-CNT-TOT               04336620
043367                     PV-TRIP-MST-CRE-TO-OTB-CNT-TOT               04336720
043368                     PV-TRIP-MST-CRE-TO-TCL-CNT-TOT               04336820
043369                     PV-TRIP-MST-CRE-TO-SHP-CNT-TOT               04336920
043370                     PV-TRIP-MST-1ST-TO-OTB-CNT-TOT               04337020
043371                     PV-TRIP-MST-1ST-TO-TCL-CNT-TOT               04337120
043372                     PV-TRIP-MST-1ST-TO-SHP-CNT-TOT               04337220
043373                     PV-TRIP-MST-LST-TO-OTB-CNT-TOT               04337320
043374                     PV-TRIP-MST-LST-TO-TCL-CNT-TOT               04337420
043375                     PV-TRIP-MST-LST-TO-SHP-CNT-TOT               04337520
043376                     PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT               04337620
043377                     PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT               04337770
043378* DMH 8/19/16                                                     04337870
043379                     PV-TRIP-TRIP-CARTONS                         04337970
043380                     PV-TRIP-TRIP-SRC-CARTONS.                    04338070
043381                                                                  04338170
043384                                                                  04338466
043385****************************************************************  04338566
043386* CALCULATE DC OVERALL TOTALS                                  *  04338666
043387****************************************************************  04338766
043388 3030-CALCULATE-DC-OVERALL.                                       04338866
043389                                                                  04338966
043390     EVALUATE TRUE                                                04339066
043391         WHEN PV-PREV-SOURCE  =  'ASN'                            04339166
043392              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04339266
043393               TO  PV-ASN-TRIP-OPEN-TO-CLOSE-MIN                  04339366
043394              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04339466
043395               TO  PV-ASN-TRIP-CLOSE-TO-SHIP-MIN                  04339566
043396              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04339666
043397               TO  PV-ASN-TRIP-OPEN-TO-SHIP-MIN                   04339766
043398              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04339866
043399               TO  PV-ASN-TRIP-OPEN-TO-CLOSE-CNT                  04339966
043400              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04340066
043401               TO  PV-ASN-TRIP-CLOSE-TO-SHIP-CNT                  04340166
043402              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04340266
043403               TO  PV-ASN-TRIP-OPEN-TO-SHIP-CNT                   04340366
043404              ADD  PV-SRC-INPUT-RECORD-COUNT                      04340466
043405               TO  PV-ASN-INPUT-RECORD-COUNT                      04340566
043406              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04340666
043407               TO  PV-ASN-ARRIVE-TO-PRC-MIN                       04340766
043408              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04340866
043409               TO  PV-ASN-ARRIVE-TO-P2L-PKD-MIN                   04340966
043410              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04341066
043411               TO  PV-ASN-PRC-TO-P2L-PKD-MIN                      04341166
043412              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04341266
043413               TO  PV-ASN-P2L-PKD-TO-CLOSE-MIN                    04341366
043414              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04341466
043415               TO  PV-ASN-P2L-OPEN-TO-CLOSE-MIN                   04341566
043416              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04341666
043417               TO  PV-ASN-P2L-OPEN-TO-OTBND-MIN                   04341766
043418              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04341866
043419               TO  PV-ASN-P2L-CLOSE-TO-OTBND-MIN                  04341966
043420              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04342066
043421               TO  PV-ASN-ARRIVE-TO-OTBND-MIN                     04342166
043422              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04342266
043423               TO  PV-ASN-PRC-TO-OTBND-MIN                        04342366
043424              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04342466
043425               TO  PV-ASN-ARRIVE-TO-TCLOS-MIN                     04342566
043426              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04342666
043427               TO  PV-ASN-ARRIVE-TO-SHIP-MIN                      04342766
043428              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04342866
043429               TO  PV-ASN-P2L-OPEN-TO-TCLOS-MIN                   04342966
043430              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04343066
043431               TO  PV-ASN-P2L-OPEN-TO-SHIP-MIN                    04343166
043432              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04343266
043433               TO  PV-ASN-P2L-CLOSE-TO-TCLOS-MIN                  04343366
043434              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04343466
043435               TO  PV-ASN-P2L-CLOSE-TO-SHIP-MIN                   04343566
043436              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04343666
043437               TO  PV-ASN-ARRIVE-TO-MSTR-MIN                      04343766
043438              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04343866
043439               TO  PV-ASN-PRC-TO-MSTR-MIN                         04343966
043440              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04344066
043441               TO  PV-ASN-ON-OTBND-TO-TCLOS-MIN                   04344166
043442              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04344266
043443               TO  PV-ASN-ON-OTBND-TO-TSHIP-MIN                   04344366
043444              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04344466
043445               TO  PV-ASN-MSTR-CRE-TO-OTBND-MIN                   04344566
043446              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04344666
043447               TO  PV-ASN-MSTR-CRE-TO-TCLOS-MIN                   04344766
043448              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04344866
043449               TO  PV-ASN-MSTR-CRE-TO-SHIP-MIN                    04344966
043450              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04345066
043451               TO  PV-ASN-MSTR-FIRST-TO-OTBND-MIN                 04345166
043452              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04345266
043453               TO  PV-ASN-MSTR-FIRST-TO-TCLOS-MIN                 04345366
043454              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04345466
043455               TO  PV-ASN-MSTR-FIRST-TO-SHIP-MIN                  04345566
043456              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04345666
043457               TO  PV-ASN-MSTR-LAST-TO-OTBND-MIN                  04345766
043458              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04345866
043459               TO  PV-ASN-MSTR-LAST-TO-TCLOS-MIN                  04345966
043460              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04346066
043461               TO  PV-ASN-MSTR-LAST-TO-SHIP-MIN                   04346166
043462              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04346266
043463               TO  PV-ASN-ON-OTBND-TO-CLOS-MIN                    04346366
043464              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04346466
043465               TO  PV-ASN-ON-OTBND-TO-SHIP-MIN                    04346566
043466              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04346666
043467               TO  PV-ASN-ARRIVE-TO-PRC-CNT                       04346766
043468              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04346866
043469               TO  PV-ASN-ARRIVE-TO-P2L-PKD-CNT                   04346966
043470              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04347066
043471               TO  PV-ASN-PRC-TO-P2L-PKD-CNT                      04347166
043472              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04347266
043473               TO  PV-ASN-P2L-PKD-TO-CLOSE-CNT                    04347366
043474              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04347466
043475               TO  PV-ASN-P2L-OPEN-TO-CLOSE-CNT                   04347566
043476              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04347666
043477               TO  PV-ASN-P2L-OPEN-TO-OTBND-CNT                   04347766
043478              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04347866
043479               TO  PV-ASN-P2L-CLOSE-TO-OTBND-CNT                  04347966
043480              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04348066
043481               TO  PV-ASN-ARRIVE-TO-OTBND-CNT                     04348166
043482              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04348266
043483               TO  PV-ASN-PRC-TO-OTBND-CNT                        04348366
043484              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04348466
043485               TO  PV-ASN-ARRIVE-TO-TCLOS-CNT                     04348566
043486              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04348666
043487               TO  PV-ASN-ARRIVE-TO-SHIP-CNT                      04348766
043488              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04348866
043489               TO  PV-ASN-P2L-OPEN-TO-TCLOS-CNT                   04348966
043490              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04349066
043491               TO  PV-ASN-P2L-OPEN-TO-SHIP-CNT                    04349166
043492              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04349266
043493               TO  PV-ASN-P2L-CLOSE-TO-TCLOS-CNT                  04349366
043494              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04349466
043495               TO  PV-ASN-P2L-CLOSE-TO-SHIP-CNT                   04349566
043496              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04349666
043497               TO  PV-ASN-ARRIVE-TO-MSTR-CNT                      04349766
043498              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04349866
043499               TO  PV-ASN-PRC-TO-MSTR-CNT                         04349966
043500              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04350066
043501               TO  PV-ASN-ON-OTBND-TO-TCLOS-CNT                   04350166
043502              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04350266
043503               TO  PV-ASN-ON-OTBND-TO-TSHIP-CNT                   04350366
043504              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04350466
043505               TO  PV-ASN-MSTR-CRE-TO-OTBND-CNT                   04350566
043506              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04350666
043507               TO  PV-ASN-MSTR-CRE-TO-TCLOS-CNT                   04350766
043508              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04350866
043509               TO  PV-ASN-MSTR-CRE-TO-SHIP-CNT                    04350966
043510              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04351066
043511               TO  PV-ASN-MSTR-FIRST-TO-OTBND-CNT                 04351166
043512              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04351266
043513               TO  PV-ASN-MSTR-FIRST-TO-TCLOS-CNT                 04351366
043514              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04351466
043515               TO  PV-ASN-MSTR-FIRST-TO-SHIP-CNT                  04351566
043516              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04351666
043517               TO  PV-ASN-MSTR-LAST-TO-OTBND-CNT                  04351766
043518              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04351866
043519               TO  PV-ASN-MSTR-LAST-TO-TCLOS-CNT                  04351966
043520              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04352066
043521               TO  PV-ASN-MSTR-LAST-TO-SHIP-CNT                   04352166
043522              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04352266
043523               TO  PV-ASN-ON-OTBND-TO-CLOS-CNT                    04352366
043530              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04353066
043600               TO  PV-ASN-ON-OTBND-TO-SHIP-CNT                    04360050
043601*                                                                 04360166
043602              ADD  PV-SRC-TRIP-CARTONS                            04360266
043603               TO  PV-ASN-TRIP-CARTONS                            04360366
043604              ADD  PV-SRC-TRIP-SRC-CARTONS                        04360466
043605               TO  PV-ASN-TRIP-SRC-CARTONS                        04360566
043606              ADD  PV-SRC-TOTAL-TRIPS                             04360666
043607               TO  PV-ASN-TOTAL-TRIPS                             04360766
043610*                                                                 04361066
043631         WHEN PV-PREV-SOURCE  =  'CPS'                            04363150
043632              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04363250
043633               TO  PV-CPS-TRIP-OPEN-TO-CLOSE-MIN                  04363350
043634              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04363450
043635               TO  PV-CPS-TRIP-CLOSE-TO-SHIP-MIN                  04363550
043636              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04363650
043637               TO  PV-CPS-TRIP-OPEN-TO-SHIP-MIN                   04363750
043638              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04363850
043639               TO  PV-CPS-TRIP-OPEN-TO-CLOSE-CNT                  04363950
043640              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04364050
043641               TO  PV-CPS-TRIP-CLOSE-TO-SHIP-CNT                  04364150
043642              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04364250
043643               TO  PV-CPS-TRIP-OPEN-TO-SHIP-CNT                   04364350
043644              ADD  PV-SRC-INPUT-RECORD-COUNT                      04364450
043645               TO  PV-CPS-INPUT-RECORD-COUNT                      04364550
043646              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04364650
043647               TO  PV-CPS-ARRIVE-TO-PRC-MIN                       04364750
043648              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04364850
043649               TO  PV-CPS-ARRIVE-TO-P2L-PKD-MIN                   04364950
043650              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04365050
043651               TO  PV-CPS-PRC-TO-P2L-PKD-MIN                      04365150
043652              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04365250
043653               TO  PV-CPS-P2L-PKD-TO-CLOSE-MIN                    04365350
043654              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04365450
043655               TO  PV-CPS-P2L-OPEN-TO-CLOSE-MIN                   04365550
043656              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04365650
043657               TO  PV-CPS-P2L-OPEN-TO-OTBND-MIN                   04365750
043658              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04365850
043659               TO  PV-CPS-P2L-CLOSE-TO-OTBND-MIN                  04365950
043660              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04366050
043661               TO  PV-CPS-ARRIVE-TO-OTBND-MIN                     04366150
043662              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04366250
043663               TO  PV-CPS-PRC-TO-OTBND-MIN                        04366350
043664              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04366450
043665               TO  PV-CPS-ARRIVE-TO-TCLOS-MIN                     04366550
043666              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04366650
043667               TO  PV-CPS-ARRIVE-TO-SHIP-MIN                      04366750
043668              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04366850
043669               TO  PV-CPS-P2L-OPEN-TO-TCLOS-MIN                   04366950
043670              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04367050
043671               TO  PV-CPS-P2L-OPEN-TO-SHIP-MIN                    04367150
043672              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04367250
043673               TO  PV-CPS-P2L-CLOSE-TO-TCLOS-MIN                  04367350
043674              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04367450
043675               TO  PV-CPS-P2L-CLOSE-TO-SHIP-MIN                   04367550
043676              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04367650
043677               TO  PV-CPS-ARRIVE-TO-MSTR-MIN                      04367750
043678              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04367850
043679               TO  PV-CPS-PRC-TO-MSTR-MIN                         04367950
043680              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04368050
043681               TO  PV-CPS-ON-OTBND-TO-TCLOS-MIN                   04368150
043682              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04368250
043683               TO  PV-CPS-ON-OTBND-TO-TSHIP-MIN                   04368350
043684              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04368450
043685               TO  PV-CPS-MSTR-CRE-TO-OTBND-MIN                   04368550
043686              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04368650
043687               TO  PV-CPS-MSTR-CRE-TO-TCLOS-MIN                   04368750
043688              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04368850
043689               TO  PV-CPS-MSTR-CRE-TO-SHIP-MIN                    04368950
043690              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04369050
043691               TO  PV-CPS-MSTR-FIRST-TO-OTBND-MIN                 04369150
043692              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04369250
043693               TO  PV-CPS-MSTR-FIRST-TO-TCLOS-MIN                 04369350
043694              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04369450
043695               TO  PV-CPS-MSTR-FIRST-TO-SHIP-MIN                  04369550
043696              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04369650
043697               TO  PV-CPS-MSTR-LAST-TO-OTBND-MIN                  04369750
043698              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04369850
043699               TO  PV-CPS-MSTR-LAST-TO-TCLOS-MIN                  04369950
043700              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04370050
043701               TO  PV-CPS-MSTR-LAST-TO-SHIP-MIN                   04370150
043702              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04370250
043703               TO  PV-CPS-ON-OTBND-TO-CLOS-MIN                    04370350
043704              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04370450
043705               TO  PV-CPS-ON-OTBND-TO-SHIP-MIN                    04370550
043706              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04370650
043707               TO  PV-CPS-ARRIVE-TO-PRC-CNT                       04370750
043708              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04370850
043709               TO  PV-CPS-ARRIVE-TO-P2L-PKD-CNT                   04370950
043710              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04371050
043711               TO  PV-CPS-PRC-TO-P2L-PKD-CNT                      04371150
043712              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04371250
043713               TO  PV-CPS-P2L-PKD-TO-CLOSE-CNT                    04371350
043714              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04371450
043715               TO  PV-CPS-P2L-OPEN-TO-CLOSE-CNT                   04371550
043716              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04371650
043717               TO  PV-CPS-P2L-OPEN-TO-OTBND-CNT                   04371750
043718              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04371850
043719               TO  PV-CPS-P2L-CLOSE-TO-OTBND-CNT                  04371950
043720              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04372050
043721               TO  PV-CPS-ARRIVE-TO-OTBND-CNT                     04372150
043722              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04372250
043723               TO  PV-CPS-PRC-TO-OTBND-CNT                        04372350
043724              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04372450
043725               TO  PV-CPS-ARRIVE-TO-TCLOS-CNT                     04372550
043726              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04372650
043727               TO  PV-CPS-ARRIVE-TO-SHIP-CNT                      04372750
043728              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04372850
043729               TO  PV-CPS-P2L-OPEN-TO-TCLOS-CNT                   04372950
043730              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04373050
043731               TO  PV-CPS-P2L-OPEN-TO-SHIP-CNT                    04373150
043732              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04373250
043733               TO  PV-CPS-P2L-CLOSE-TO-TCLOS-CNT                  04373350
043734              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04373450
043735               TO  PV-CPS-P2L-CLOSE-TO-SHIP-CNT                   04373550
043736              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04373650
043737               TO  PV-CPS-ARRIVE-TO-MSTR-CNT                      04373750
043738              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04373850
043739               TO  PV-CPS-PRC-TO-MSTR-CNT                         04373950
043740              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04374050
043741               TO  PV-CPS-ON-OTBND-TO-TCLOS-CNT                   04374150
043742              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04374250
043743               TO  PV-CPS-ON-OTBND-TO-TSHIP-CNT                   04374350
043744              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04374450
043745               TO  PV-CPS-MSTR-CRE-TO-OTBND-CNT                   04374550
043746              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04374650
043747               TO  PV-CPS-MSTR-CRE-TO-TCLOS-CNT                   04374750
043748              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04374850
043749               TO  PV-CPS-MSTR-CRE-TO-SHIP-CNT                    04374950
043750              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04375050
043751               TO  PV-CPS-MSTR-FIRST-TO-OTBND-CNT                 04375150
043752              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04375250
043753               TO  PV-CPS-MSTR-FIRST-TO-TCLOS-CNT                 04375350
043754              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04375450
043755               TO  PV-CPS-MSTR-FIRST-TO-SHIP-CNT                  04375550
043756              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04375650
043757               TO  PV-CPS-MSTR-LAST-TO-OTBND-CNT                  04375750
043758              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04375850
043759               TO  PV-CPS-MSTR-LAST-TO-TCLOS-CNT                  04375950
043760              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04376050
043761               TO  PV-CPS-MSTR-LAST-TO-SHIP-CNT                   04376150
043762              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04376250
043763               TO  PV-CPS-ON-OTBND-TO-CLOS-CNT                    04376350
043764              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04376450
043765               TO  PV-CPS-ON-OTBND-TO-SHIP-CNT                    04376550
043766*                                                                 04376666
043767              ADD  PV-SRC-TRIP-CARTONS                            04376766
043768               TO  PV-CPS-TRIP-CARTONS                            04376866
043769              ADD  PV-SRC-TRIP-SRC-CARTONS                        04376966
043770               TO  PV-CPS-TRIP-SRC-CARTONS                        04377066
043771              ADD  PV-SRC-TOTAL-TRIPS                             04377166
043772               TO  PV-CPS-TOTAL-TRIPS                             04377266
043773*                                                                 04377366
043774         WHEN PV-PREV-SOURCE  =  'SMO'                            04377450
043775              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04377550
043776               TO  PV-SMO-TRIP-OPEN-TO-CLOSE-MIN                  04377650
043777              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04377750
043778               TO  PV-SMO-TRIP-CLOSE-TO-SHIP-MIN                  04377850
043779              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04377950
043780               TO  PV-SMO-TRIP-OPEN-TO-SHIP-MIN                   04378050
043781              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04378150
043782               TO  PV-SMO-TRIP-OPEN-TO-CLOSE-CNT                  04378250
043783              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04378350
043784               TO  PV-SMO-TRIP-CLOSE-TO-SHIP-CNT                  04378450
043785              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04378550
043786               TO  PV-SMO-TRIP-OPEN-TO-SHIP-CNT                   04378650
043787              ADD  PV-SRC-INPUT-RECORD-COUNT                      04378750
043788               TO  PV-SMO-INPUT-RECORD-COUNT                      04378850
043789              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04378950
043790               TO  PV-SMO-ARRIVE-TO-PRC-MIN                       04379050
043791              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04379150
043792               TO  PV-SMO-ARRIVE-TO-P2L-PKD-MIN                   04379250
043793              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04379350
043794               TO  PV-SMO-PRC-TO-P2L-PKD-MIN                      04379450
043795              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04379550
043796               TO  PV-SMO-P2L-PKD-TO-CLOSE-MIN                    04379650
043797              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04379750
043798               TO  PV-SMO-P2L-OPEN-TO-CLOSE-MIN                   04379850
043799              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04379950
043800               TO  PV-SMO-P2L-OPEN-TO-OTBND-MIN                   04380050
043801              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04380150
043802               TO  PV-SMO-P2L-CLOSE-TO-OTBND-MIN                  04380250
043803              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04380350
043804               TO  PV-SMO-ARRIVE-TO-OTBND-MIN                     04380450
043805              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04380550
043806               TO  PV-SMO-PRC-TO-OTBND-MIN                        04380650
043807              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04380750
043808               TO  PV-SMO-ARRIVE-TO-TCLOS-MIN                     04380850
043809              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04380950
043810               TO  PV-SMO-ARRIVE-TO-SHIP-MIN                      04381050
043811              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04381150
043812               TO  PV-SMO-P2L-OPEN-TO-TCLOS-MIN                   04381250
043813              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04381350
043814               TO  PV-SMO-P2L-OPEN-TO-SHIP-MIN                    04381450
043815              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04381550
043816               TO  PV-SMO-P2L-CLOSE-TO-TCLOS-MIN                  04381650
043817              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04381750
043818               TO  PV-SMO-P2L-CLOSE-TO-SHIP-MIN                   04381850
043819              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04381950
043820               TO  PV-SMO-ARRIVE-TO-MSTR-MIN                      04382050
043821              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04382150
043822               TO  PV-SMO-PRC-TO-MSTR-MIN                         04382250
043823              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04382350
043824               TO  PV-SMO-ON-OTBND-TO-TCLOS-MIN                   04382450
043825              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04382550
043826               TO  PV-SMO-ON-OTBND-TO-TSHIP-MIN                   04382650
043827              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04382750
043828               TO  PV-SMO-MSTR-CRE-TO-OTBND-MIN                   04382850
043829              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04382950
043830               TO  PV-SMO-MSTR-CRE-TO-TCLOS-MIN                   04383050
043831              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04383150
043832               TO  PV-SMO-MSTR-CRE-TO-SHIP-MIN                    04383250
043833              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04383350
043834               TO  PV-SMO-MSTR-FIRST-TO-OTBND-MIN                 04383450
043835              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04383550
043836               TO  PV-SMO-MSTR-FIRST-TO-TCLOS-MIN                 04383650
043837              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04383750
043838               TO  PV-SMO-MSTR-FIRST-TO-SHIP-MIN                  04383850
043839              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04383950
043840               TO  PV-SMO-MSTR-LAST-TO-OTBND-MIN                  04384050
043841              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04384150
043842               TO  PV-SMO-MSTR-LAST-TO-TCLOS-MIN                  04384250
043843              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04384350
043844               TO  PV-SMO-MSTR-LAST-TO-SHIP-MIN                   04384450
043845              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04384550
043846               TO  PV-SMO-ON-OTBND-TO-CLOS-MIN                    04384650
043847              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04384750
043848               TO  PV-SMO-ON-OTBND-TO-SHIP-MIN                    04384850
043849              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04384950
043850               TO  PV-SMO-ARRIVE-TO-PRC-CNT                       04385050
043851              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04385150
043852               TO  PV-SMO-ARRIVE-TO-P2L-PKD-CNT                   04385250
043853              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04385350
043854               TO  PV-SMO-PRC-TO-P2L-PKD-CNT                      04385453
043855              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04385550
043856               TO  PV-SMO-P2L-PKD-TO-CLOSE-CNT                    04385650
043857              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04385750
043858               TO  PV-SMO-P2L-OPEN-TO-CLOSE-CNT                   04385850
043859              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04385950
043860               TO  PV-SMO-P2L-OPEN-TO-OTBND-CNT                   04386050
043861              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04386150
043862               TO  PV-SMO-P2L-CLOSE-TO-OTBND-CNT                  04386250
043863              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04386350
043864               TO  PV-SMO-ARRIVE-TO-OTBND-CNT                     04386450
043865              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04386550
043866               TO  PV-SMO-PRC-TO-OTBND-CNT                        04386650
043867              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04386750
043868               TO  PV-SMO-ARRIVE-TO-TCLOS-CNT                     04386850
043869              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04386950
043870               TO  PV-SMO-ARRIVE-TO-SHIP-CNT                      04387050
043871              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04387150
043872               TO  PV-SMO-P2L-OPEN-TO-TCLOS-CNT                   04387250
043873              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04387350
043874               TO  PV-SMO-P2L-OPEN-TO-SHIP-CNT                    04387450
043875              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04387550
043876               TO  PV-SMO-P2L-CLOSE-TO-TCLOS-CNT                  04387650
043877              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04387750
043878               TO  PV-SMO-P2L-CLOSE-TO-SHIP-CNT                   04387850
043879              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04387950
043880               TO  PV-SMO-ARRIVE-TO-MSTR-CNT                      04388050
043881              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04388150
043882               TO  PV-SMO-PRC-TO-MSTR-CNT                         04388250
043883              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04388350
043884               TO  PV-SMO-ON-OTBND-TO-TCLOS-CNT                   04388450
043885              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04388550
043886               TO  PV-SMO-ON-OTBND-TO-TSHIP-CNT                   04388650
043887              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04388750
043888               TO  PV-SMO-MSTR-CRE-TO-OTBND-CNT                   04388850
043889              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04388950
043890               TO  PV-SMO-MSTR-CRE-TO-TCLOS-CNT                   04389050
043891              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04389150
043892               TO  PV-SMO-MSTR-CRE-TO-SHIP-CNT                    04389250
043893              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04389350
043894               TO  PV-SMO-MSTR-FIRST-TO-OTBND-CNT                 04389450
043895              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04389550
043896               TO  PV-SMO-MSTR-FIRST-TO-TCLOS-CNT                 04389650
043897              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04389750
043898               TO  PV-SMO-MSTR-FIRST-TO-SHIP-CNT                  04389850
043899              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04389950
043900               TO  PV-SMO-MSTR-LAST-TO-OTBND-CNT                  04390050
043901              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04390150
043902               TO  PV-SMO-MSTR-LAST-TO-TCLOS-CNT                  04390250
043903              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04390350
043904               TO  PV-SMO-MSTR-LAST-TO-SHIP-CNT                   04390450
043905              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04390550
043906               TO  PV-SMO-ON-OTBND-TO-CLOS-CNT                    04390650
043910              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04391050
044000               TO  PV-SMO-ON-OTBND-TO-SHIP-CNT                    04400050
044010*                                                                 04401066
044020              ADD  PV-SRC-TRIP-CARTONS                            04402066
044030               TO  PV-SMO-TRIP-CARTONS                            04403066
044031              ADD  PV-SRC-TRIP-SRC-CARTONS                        04403166
044032               TO  PV-SMO-TRIP-SRC-CARTONS                        04403266
044033              ADD  PV-SRC-TOTAL-TRIPS                             04403366
044034               TO  PV-SMO-TOTAL-TRIPS                             04403466
044035*                                                                 04403566
044036         WHEN PV-PREV-SOURCE  =  'JWL'                            04403650
044037              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04403750
044038               TO  PV-JWL-TRIP-OPEN-TO-CLOSE-MIN                  04403850
044039              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04403950
044040               TO  PV-JWL-TRIP-CLOSE-TO-SHIP-MIN                  04404050
044041              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04404150
044050               TO  PV-JWL-TRIP-OPEN-TO-SHIP-MIN                   04405050
044060              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04406050
044070               TO  PV-JWL-TRIP-OPEN-TO-CLOSE-CNT                  04407050
044080              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04408050
044090               TO  PV-JWL-TRIP-CLOSE-TO-SHIP-CNT                  04409050
044100              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04410050
044110               TO  PV-JWL-TRIP-OPEN-TO-SHIP-CNT                   04411050
044120              ADD  PV-SRC-INPUT-RECORD-COUNT                      04412050
044130               TO  PV-JWL-INPUT-RECORD-COUNT                      04413050
044140              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04414050
044150               TO  PV-JWL-ARRIVE-TO-PRC-MIN                       04415050
044160              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04416050
044161               TO  PV-JWL-ARRIVE-TO-P2L-PKD-MIN                   04416150
044162              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04416250
044163               TO  PV-JWL-PRC-TO-P2L-PKD-MIN                      04416350
044164              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04416450
044165               TO  PV-JWL-P2L-PKD-TO-CLOSE-MIN                    04416550
044166              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04416650
044167               TO  PV-JWL-P2L-OPEN-TO-CLOSE-MIN                   04416750
044168              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04416850
044169               TO  PV-JWL-P2L-OPEN-TO-OTBND-MIN                   04416950
044170              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04417050
044171               TO  PV-JWL-P2L-CLOSE-TO-OTBND-MIN                  04417150
044172              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04417250
044173               TO  PV-JWL-ARRIVE-TO-OTBND-MIN                     04417350
044174              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04417450
044175               TO  PV-JWL-PRC-TO-OTBND-MIN                        04417550
044176              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04417650
044177               TO  PV-JWL-ARRIVE-TO-TCLOS-MIN                     04417750
044178              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04417850
044179               TO  PV-JWL-ARRIVE-TO-SHIP-MIN                      04417950
044180              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04418050
044181               TO  PV-JWL-P2L-OPEN-TO-TCLOS-MIN                   04418150
044182              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04418250
044183               TO  PV-JWL-P2L-OPEN-TO-SHIP-MIN                    04418350
044184              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04418450
044185               TO  PV-JWL-P2L-CLOSE-TO-TCLOS-MIN                  04418550
044186              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04418650
044187               TO  PV-JWL-P2L-CLOSE-TO-SHIP-MIN                   04418750
044188              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04418850
044189               TO  PV-JWL-ARRIVE-TO-MSTR-MIN                      04418950
044190              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04419050
044191               TO  PV-JWL-PRC-TO-MSTR-MIN                         04419150
044192              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04419250
044193               TO  PV-JWL-ON-OTBND-TO-TCLOS-MIN                   04419350
044194              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04419450
044195               TO  PV-JWL-ON-OTBND-TO-TSHIP-MIN                   04419550
044196              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04419650
044197               TO  PV-JWL-MSTR-CRE-TO-OTBND-MIN                   04419750
044198              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04419850
044199               TO  PV-JWL-MSTR-CRE-TO-TCLOS-MIN                   04419950
044200              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04420050
044201               TO  PV-JWL-MSTR-CRE-TO-SHIP-MIN                    04420150
044202              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04420250
044203               TO  PV-JWL-MSTR-FIRST-TO-OTBND-MIN                 04420350
044204              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04420450
044205               TO  PV-JWL-MSTR-FIRST-TO-TCLOS-MIN                 04420550
044206              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04420650
044207               TO  PV-JWL-MSTR-FIRST-TO-SHIP-MIN                  04420750
044208              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04420850
044209               TO  PV-JWL-MSTR-LAST-TO-OTBND-MIN                  04420950
044210              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04421050
044211               TO  PV-JWL-MSTR-LAST-TO-TCLOS-MIN                  04421150
044212              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04421250
044213               TO  PV-JWL-MSTR-LAST-TO-SHIP-MIN                   04421350
044214              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04421450
044215               TO  PV-JWL-ON-OTBND-TO-CLOS-MIN                    04421550
044216              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04421650
044217               TO  PV-JWL-ON-OTBND-TO-SHIP-MIN                    04421750
044218              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04421850
044219               TO  PV-JWL-ARRIVE-TO-PRC-CNT                       04421950
044220              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04422050
044221               TO  PV-JWL-ARRIVE-TO-P2L-PKD-CNT                   04422150
044222              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04422250
044223               TO  PV-JWL-PRC-TO-P2L-PKD-CNT                      04422350
044224              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04422450
044225               TO  PV-JWL-P2L-PKD-TO-CLOSE-CNT                    04422550
044226              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04422650
044227               TO  PV-JWL-P2L-OPEN-TO-CLOSE-CNT                   04422750
044228              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04422850
044229               TO  PV-JWL-P2L-OPEN-TO-OTBND-CNT                   04422950
044230              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04423050
044231               TO  PV-JWL-P2L-CLOSE-TO-OTBND-CNT                  04423150
044232              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04423250
044233               TO  PV-JWL-ARRIVE-TO-OTBND-CNT                     04423350
044234              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04423450
044235               TO  PV-JWL-PRC-TO-OTBND-CNT                        04423550
044236              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04423650
044237               TO  PV-JWL-ARRIVE-TO-TCLOS-CNT                     04423750
044238              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04423850
044239               TO  PV-JWL-ARRIVE-TO-SHIP-CNT                      04423950
044240              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04424050
044241               TO  PV-JWL-P2L-OPEN-TO-TCLOS-CNT                   04424150
044242              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04424250
044243               TO  PV-JWL-P2L-OPEN-TO-SHIP-CNT                    04424350
044244              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04424450
044245               TO  PV-JWL-P2L-CLOSE-TO-TCLOS-CNT                  04424550
044246              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04424650
044247               TO  PV-JWL-P2L-CLOSE-TO-SHIP-CNT                   04424750
044248              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04424850
044249               TO  PV-JWL-ARRIVE-TO-MSTR-CNT                      04424950
044250              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04425050
044251               TO  PV-JWL-PRC-TO-MSTR-CNT                         04425150
044252              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04425250
044253               TO  PV-JWL-ON-OTBND-TO-TCLOS-CNT                   04425350
044254              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04425450
044255               TO  PV-JWL-ON-OTBND-TO-TSHIP-CNT                   04425550
044256              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04425650
044257               TO  PV-JWL-MSTR-CRE-TO-OTBND-CNT                   04425750
044258              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04425850
044259               TO  PV-JWL-MSTR-CRE-TO-TCLOS-CNT                   04425950
044260              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04426050
044261               TO  PV-JWL-MSTR-CRE-TO-SHIP-CNT                    04426150
044262              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04426250
044263               TO  PV-JWL-MSTR-FIRST-TO-OTBND-CNT                 04426350
044264              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04426450
044265               TO  PV-JWL-MSTR-FIRST-TO-TCLOS-CNT                 04426550
044266              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04426650
044267               TO  PV-JWL-MSTR-FIRST-TO-SHIP-CNT                  04426750
044268              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04426850
044269               TO  PV-JWL-MSTR-LAST-TO-OTBND-CNT                  04426950
044270              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04427050
044271               TO  PV-JWL-MSTR-LAST-TO-TCLOS-CNT                  04427150
044272              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04427250
044273               TO  PV-JWL-MSTR-LAST-TO-SHIP-CNT                   04427350
044274              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04427450
044275               TO  PV-JWL-ON-OTBND-TO-CLOS-CNT                    04427550
044276              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04427650
044277               TO  PV-JWL-ON-OTBND-TO-SHIP-CNT                    04427750
044278*                                                                 04427866
044279              ADD  PV-SRC-TRIP-CARTONS                            04427966
044280               TO  PV-JWL-TRIP-CARTONS                            04428066
044281              ADD  PV-SRC-TRIP-SRC-CARTONS                        04428166
044282               TO  PV-JWL-TRIP-SRC-CARTONS                        04428266
044283              ADD  PV-SRC-TOTAL-TRIPS                             04428366
044284               TO  PV-JWL-TOTAL-TRIPS                             04428466
044285*                                                                 04428566
044286         WHEN PV-PREV-SOURCE  =  'P2L'                            04428650
044287              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04428750
044288               TO  PV-P2L-TRIP-OPEN-TO-CLOSE-MIN                  04428850
044289              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04428950
044290               TO  PV-P2L-TRIP-CLOSE-TO-SHIP-MIN                  04429050
044291              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04429150
044292               TO  PV-P2L-TRIP-OPEN-TO-SHIP-MIN                   04429250
044293              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04429350
044294               TO  PV-P2L-TRIP-OPEN-TO-CLOSE-CNT                  04429450
044295              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04429550
044296               TO  PV-P2L-TRIP-CLOSE-TO-SHIP-CNT                  04429650
044297              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04429750
044298               TO  PV-P2L-TRIP-OPEN-TO-SHIP-CNT                   04429850
044299              ADD  PV-SRC-INPUT-RECORD-COUNT                      04429950
044300               TO  PV-P2L-INPUT-RECORD-COUNT                      04430050
044301              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04430150
044302               TO  PV-P2L-ARRIVE-TO-PRC-MIN                       04430250
044303              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04430350
044304               TO  PV-P2L-ARRIVE-TO-P2L-PKD-MIN                   04430450
044305              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04430550
044306               TO  PV-P2L-PRC-TO-P2L-PKD-MIN                      04430650
044307              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04430750
044308               TO  PV-P2L-P2L-PKD-TO-CLOSE-MIN                    04430850
044309              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04430950
044310               TO  PV-P2L-P2L-OPEN-TO-CLOSE-MIN                   04431050
044311              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04431150
044312               TO  PV-P2L-P2L-OPEN-TO-OTBND-MIN                   04431250
044313              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04431350
044314               TO  PV-P2L-P2L-CLOSE-TO-OTBND-MIN                  04431450
044315              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04431550
044316               TO  PV-P2L-ARRIVE-TO-OTBND-MIN                     04431650
044317              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04431750
044318               TO  PV-P2L-PRC-TO-OTBND-MIN                        04431850
044319              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04431950
044320               TO  PV-P2L-ARRIVE-TO-TCLOS-MIN                     04432050
044321              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04432150
044322               TO  PV-P2L-ARRIVE-TO-SHIP-MIN                      04432250
044323              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04432350
044324               TO  PV-P2L-P2L-OPEN-TO-TCLOS-MIN                   04432450
044325              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04432550
044326               TO  PV-P2L-P2L-OPEN-TO-SHIP-MIN                    04432650
044327              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04432750
044328               TO  PV-P2L-P2L-CLOSE-TO-TCLOS-MIN                  04432850
044329              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04432950
044330               TO  PV-P2L-P2L-CLOSE-TO-SHIP-MIN                   04433050
044331              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04433150
044332               TO  PV-P2L-ARRIVE-TO-MSTR-MIN                      04433250
044333              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04433350
044334               TO  PV-P2L-PRC-TO-MSTR-MIN                         04433450
044335              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04433550
044336               TO  PV-P2L-ON-OTBND-TO-TCLOS-MIN                   04433650
044337              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04433750
044338               TO  PV-P2L-ON-OTBND-TO-TSHIP-MIN                   04433850
044339              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04433950
044340               TO  PV-P2L-MSTR-CRE-TO-OTBND-MIN                   04434050
044341              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04434150
044342               TO  PV-P2L-MSTR-CRE-TO-TCLOS-MIN                   04434250
044343              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04434350
044344               TO  PV-P2L-MSTR-CRE-TO-SHIP-MIN                    04434450
044345              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04434550
044346               TO  PV-P2L-MSTR-FIRST-TO-OTBND-MIN                 04434650
044347              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04434750
044348               TO  PV-P2L-MSTR-FIRST-TO-TCLOS-MIN                 04434850
044349              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04434950
044350               TO  PV-P2L-MSTR-FIRST-TO-SHIP-MIN                  04435050
044351              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04435150
044352               TO  PV-P2L-MSTR-LAST-TO-OTBND-MIN                  04435250
044353              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04435350
044354               TO  PV-P2L-MSTR-LAST-TO-TCLOS-MIN                  04435450
044355              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04435550
044356               TO  PV-P2L-MSTR-LAST-TO-SHIP-MIN                   04435650
044357              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04435750
044358               TO  PV-P2L-ON-OTBND-TO-CLOS-MIN                    04435850
044359              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04435950
044360               TO  PV-P2L-ON-OTBND-TO-SHIP-MIN                    04436050
044361              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04436150
044362               TO  PV-P2L-ARRIVE-TO-PRC-CNT                       04436250
044363              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04436350
044364               TO  PV-P2L-ARRIVE-TO-P2L-PKD-CNT                   04436450
044365              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04436550
044366               TO  PV-P2L-PRC-TO-P2L-PKD-CNT                      04436650
044367              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04436750
044368               TO  PV-P2L-P2L-PKD-TO-CLOSE-CNT                    04436850
044369              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04436950
044370               TO  PV-P2L-P2L-OPEN-TO-CLOSE-CNT                   04437050
044371              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04437150
044372               TO  PV-P2L-P2L-OPEN-TO-OTBND-CNT                   04437250
044373              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04437350
044374               TO  PV-P2L-P2L-CLOSE-TO-OTBND-CNT                  04437450
044375              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04437550
044376               TO  PV-P2L-ARRIVE-TO-OTBND-CNT                     04437650
044377              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04437750
044378               TO  PV-P2L-PRC-TO-OTBND-CNT                        04437850
044379              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04437950
044380               TO  PV-P2L-ARRIVE-TO-TCLOS-CNT                     04438050
044381              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04438150
044382               TO  PV-P2L-ARRIVE-TO-SHIP-CNT                      04438250
044383              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04438350
044384               TO  PV-P2L-P2L-OPEN-TO-TCLOS-CNT                   04438450
044385              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04438550
044386               TO  PV-P2L-P2L-OPEN-TO-SHIP-CNT                    04438650
044387              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04438750
044388               TO  PV-P2L-P2L-CLOSE-TO-TCLOS-CNT                  04438850
044389              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04438950
044390               TO  PV-P2L-P2L-CLOSE-TO-SHIP-CNT                   04439050
044391              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04439150
044392               TO  PV-P2L-ARRIVE-TO-MSTR-CNT                      04439250
044393              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04439350
044394               TO  PV-P2L-PRC-TO-MSTR-CNT                         04439450
044395              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04439550
044396               TO  PV-P2L-ON-OTBND-TO-TCLOS-CNT                   04439650
044397              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04439750
044398               TO  PV-P2L-ON-OTBND-TO-TSHIP-CNT                   04439850
044399              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04439950
044400               TO  PV-P2L-MSTR-CRE-TO-OTBND-CNT                   04440050
044401              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04440150
044402               TO  PV-P2L-MSTR-CRE-TO-TCLOS-CNT                   04440250
044403              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04440350
044404               TO  PV-P2L-MSTR-CRE-TO-SHIP-CNT                    04440450
044405              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04440550
044406               TO  PV-P2L-MSTR-FIRST-TO-OTBND-CNT                 04440650
044407              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04440750
044408               TO  PV-P2L-MSTR-FIRST-TO-TCLOS-CNT                 04440850
044409              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04440950
044410               TO  PV-P2L-MSTR-FIRST-TO-SHIP-CNT                  04441050
044411              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04441150
044412               TO  PV-P2L-MSTR-LAST-TO-OTBND-CNT                  04441250
044413              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04441350
044414               TO  PV-P2L-MSTR-LAST-TO-TCLOS-CNT                  04441450
044415              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04441550
044416               TO  PV-P2L-MSTR-LAST-TO-SHIP-CNT                   04441650
044417              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04441750
044418               TO  PV-P2L-ON-OTBND-TO-CLOS-CNT                    04441850
044419              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04441950
044420               TO  PV-P2L-ON-OTBND-TO-SHIP-CNT                    04442050
044421*                                                                 04442166
044422              ADD  PV-SRC-TRIP-CARTONS                            04442266
044423               TO  PV-P2L-TRIP-CARTONS                            04442366
044424              ADD  PV-SRC-TRIP-SRC-CARTONS                        04442466
044425               TO  PV-P2L-TRIP-SRC-CARTONS                        04442566
044426              ADD  PV-SRC-TOTAL-TRIPS                             04442666
044427               TO  PV-P2L-TOTAL-TRIPS                             04442766
044428*                                                                 04442866
044429         WHEN PV-PREV-SOURCE  =  'MST'                            04442950
044430              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04443050
044431               TO  PV-MST-TRIP-OPEN-TO-CLOSE-MIN                  04443150
044432              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04443250
044433               TO  PV-MST-TRIP-CLOSE-TO-SHIP-MIN                  04443350
044434              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04443450
044435               TO  PV-MST-TRIP-OPEN-TO-SHIP-MIN                   04443550
044436              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04443650
044437               TO  PV-MST-TRIP-OPEN-TO-CLOSE-CNT                  04443750
044438              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04443850
044439               TO  PV-MST-TRIP-CLOSE-TO-SHIP-CNT                  04443950
044440              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04444050
044441               TO  PV-MST-TRIP-OPEN-TO-SHIP-CNT                   04444150
044442              ADD  PV-SRC-INPUT-RECORD-COUNT                      04444250
044443               TO  PV-MST-INPUT-RECORD-COUNT                      04444350
044444              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04444450
044445               TO  PV-MST-ARRIVE-TO-PRC-MIN                       04444550
044446              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04444650
044447               TO  PV-MST-ARRIVE-TO-P2L-PKD-MIN                   04444750
044448              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04444850
044449               TO  PV-MST-PRC-TO-P2L-PKD-MIN                      04444950
044450              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04445050
044451               TO  PV-MST-P2L-PKD-TO-CLOSE-MIN                    04445150
044452              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04445250
044453               TO  PV-MST-P2L-OPEN-TO-CLOSE-MIN                   04445350
044454              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04445450
044455               TO  PV-MST-P2L-OPEN-TO-OTBND-MIN                   04445550
044456              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04445650
044457               TO  PV-MST-P2L-CLOSE-TO-OTBND-MIN                  04445750
044458              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04445850
044459               TO  PV-MST-ARRIVE-TO-OTBND-MIN                     04445950
044460              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04446050
044461               TO  PV-MST-PRC-TO-OTBND-MIN                        04446150
044462              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04446250
044463               TO  PV-MST-ARRIVE-TO-TCLOS-MIN                     04446350
044464              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04446450
044465               TO  PV-MST-ARRIVE-TO-SHIP-MIN                      04446550
044466              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04446650
044467               TO  PV-MST-P2L-OPEN-TO-TCLOS-MIN                   04446750
044468              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04446850
044469               TO  PV-MST-P2L-OPEN-TO-SHIP-MIN                    04446950
044470              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04447050
044471               TO  PV-MST-P2L-CLOSE-TO-TCLOS-MIN                  04447150
044472              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04447250
044473               TO  PV-MST-P2L-CLOSE-TO-SHIP-MIN                   04447350
044474              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04447450
044475               TO  PV-MST-ARRIVE-TO-MSTR-MIN                      04447550
044476              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04447650
044477               TO  PV-MST-PRC-TO-MSTR-MIN                         04447750
044478              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04447850
044479               TO  PV-MST-ON-OTBND-TO-TCLOS-MIN                   04447950
044480              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04448050
044481               TO  PV-MST-ON-OTBND-TO-TSHIP-MIN                   04448150
044482              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04448250
044483               TO  PV-MST-MSTR-CRE-TO-OTBND-MIN                   04448350
044484              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04448450
044485               TO  PV-MST-MSTR-CRE-TO-TCLOS-MIN                   04448550
044486              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04448650
044487               TO  PV-MST-MSTR-CRE-TO-SHIP-MIN                    04448750
044488              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04448850
044489               TO  PV-MST-MSTR-FIRST-TO-OTBND-MIN                 04448950
044490              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04449050
044491               TO  PV-MST-MSTR-FIRST-TO-TCLOS-MIN                 04449150
044492              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04449250
044493               TO  PV-MST-MSTR-FIRST-TO-SHIP-MIN                  04449350
044494              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04449450
044495               TO  PV-MST-MSTR-LAST-TO-OTBND-MIN                  04449550
044496              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04449650
044497               TO  PV-MST-MSTR-LAST-TO-TCLOS-MIN                  04449750
044498              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04449850
044499               TO  PV-MST-MSTR-LAST-TO-SHIP-MIN                   04449950
044500              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04450050
044501               TO  PV-MST-ON-OTBND-TO-CLOS-MIN                    04450150
044502              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04450250
044503               TO  PV-MST-ON-OTBND-TO-SHIP-MIN                    04450350
044504              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04450450
044505               TO  PV-MST-ARRIVE-TO-PRC-CNT                       04450550
044506              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04450650
044507               TO  PV-MST-ARRIVE-TO-P2L-PKD-CNT                   04450750
044508              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04450850
044509               TO  PV-MST-PRC-TO-P2L-PKD-CNT                      04450950
044510              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04451050
044511               TO  PV-MST-P2L-PKD-TO-CLOSE-CNT                    04451150
044512              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04451250
044513               TO  PV-MST-P2L-OPEN-TO-CLOSE-CNT                   04451350
044514              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04451450
044515               TO  PV-MST-P2L-OPEN-TO-OTBND-CNT                   04451550
044516              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04451650
044517               TO  PV-MST-P2L-CLOSE-TO-OTBND-CNT                  04451750
044518              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04451850
044519               TO  PV-MST-ARRIVE-TO-OTBND-CNT                     04451950
044520              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04452050
044521               TO  PV-MST-PRC-TO-OTBND-CNT                        04452150
044522              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04452250
044523               TO  PV-MST-ARRIVE-TO-TCLOS-CNT                     04452350
044524              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04452450
044525               TO  PV-MST-ARRIVE-TO-SHIP-CNT                      04452550
044526              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04452650
044527               TO  PV-MST-P2L-OPEN-TO-TCLOS-CNT                   04452750
044528              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04452850
044529               TO  PV-MST-P2L-OPEN-TO-SHIP-CNT                    04452950
044530              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04453050
044531               TO  PV-MST-P2L-CLOSE-TO-TCLOS-CNT                  04453150
044532              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04453250
044533               TO  PV-MST-P2L-CLOSE-TO-SHIP-CNT                   04453350
044534              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04453450
044535               TO  PV-MST-ARRIVE-TO-MSTR-CNT                      04453550
044536              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04453650
044537               TO  PV-MST-PRC-TO-MSTR-CNT                         04453750
044538              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04453850
044539               TO  PV-MST-ON-OTBND-TO-TCLOS-CNT                   04453950
044540              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04454050
044541               TO  PV-MST-ON-OTBND-TO-TSHIP-CNT                   04454150
044542              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04454250
044543               TO  PV-MST-MSTR-CRE-TO-OTBND-CNT                   04454350
044544              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04454450
044545               TO  PV-MST-MSTR-CRE-TO-TCLOS-CNT                   04454550
044546              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04454650
044547               TO  PV-MST-MSTR-CRE-TO-SHIP-CNT                    04454750
044548              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04454850
044549               TO  PV-MST-MSTR-FIRST-TO-OTBND-CNT                 04454950
044550              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04455050
044551               TO  PV-MST-MSTR-FIRST-TO-TCLOS-CNT                 04455150
044552              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04455250
044553               TO  PV-MST-MSTR-FIRST-TO-SHIP-CNT                  04455350
044554              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04455450
044555               TO  PV-MST-MSTR-LAST-TO-OTBND-CNT                  04455550
044556              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04455650
044557               TO  PV-MST-MSTR-LAST-TO-TCLOS-CNT                  04455750
044558              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04455850
044559               TO  PV-MST-MSTR-LAST-TO-SHIP-CNT                   04455950
044560              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04456050
044561               TO  PV-MST-ON-OTBND-TO-CLOS-CNT                    04456150
044562              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04456250
044563               TO  PV-MST-ON-OTBND-TO-SHIP-CNT                    04456350
044564*                                                                 04456466
044565              ADD  PV-SRC-TRIP-CARTONS                            04456566
044566               TO  PV-MST-TRIP-CARTONS                            04456666
044567              ADD  PV-SRC-TRIP-SRC-CARTONS                        04456766
044568               TO  PV-MST-TRIP-SRC-CARTONS                        04456866
044569              ADD  PV-SRC-TOTAL-TRIPS                             04456966
044570               TO  PV-MST-TOTAL-TRIPS                             04457066
044571                                                                  04457180
044572* ONLY ADD TOTAL TRIP CARTON WHEN A MST ROW IS READ.              04457280
044573* SAME VALUE IS ON ALL SOURCES FOR TRIP - NEEDED FOR % CALC       04457380
044574* MST IS THE ONLY RECORD THAT WILL BE ON ALL TRIPS                04457480
044575              ADD  PV-SRC-TRIP-CARTONS                            04457580
044576               TO  PV-OVR-TRIP-CARTONS                            04457680
044577              ADD  PV-TRIP-TRIP-CARTONS                           04457790
044578               TO  PV-OVR-TRIP-CARTONS                            04457890
044579*                                                                 04457980
044580         WHEN PV-PREV-SOURCE  =  'RDM'                            04458080
044581              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04458180
044582               TO  PV-RDM-TRIP-OPEN-TO-CLOSE-MIN                  04458280
044583              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04458380
044584               TO  PV-RDM-TRIP-CLOSE-TO-SHIP-MIN                  04458480
044585              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04458580
044586               TO  PV-RDM-TRIP-OPEN-TO-SHIP-MIN                   04458680
044587              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04458780
044588               TO  PV-RDM-TRIP-OPEN-TO-CLOSE-CNT                  04458880
044589              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04458980
044590               TO  PV-RDM-TRIP-CLOSE-TO-SHIP-CNT                  04459080
044591              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04459180
044592               TO  PV-RDM-TRIP-OPEN-TO-SHIP-CNT                   04459280
044593              ADD  PV-SRC-INPUT-RECORD-COUNT                      04459380
044594               TO  PV-RDM-INPUT-RECORD-COUNT                      04459480
044595              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04459580
044596               TO  PV-RDM-ARRIVE-TO-PRC-MIN                       04459680
044597              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04459780
044598               TO  PV-RDM-ARRIVE-TO-P2L-PKD-MIN                   04459880
044599              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04459980
044600               TO  PV-RDM-PRC-TO-P2L-PKD-MIN                      04460080
044601              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04460180
044602               TO  PV-RDM-P2L-PKD-TO-CLOSE-MIN                    04460280
044603              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04460380
044604               TO  PV-RDM-P2L-OPEN-TO-CLOSE-MIN                   04460480
044605              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04460580
044606               TO  PV-RDM-P2L-OPEN-TO-OTBND-MIN                   04460680
044607              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04460780
044608               TO  PV-RDM-P2L-CLOSE-TO-OTBND-MIN                  04460880
044609              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04460980
044610               TO  PV-RDM-ARRIVE-TO-OTBND-MIN                     04461080
044611              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04461180
044612               TO  PV-RDM-PRC-TO-OTBND-MIN                        04461280
044613              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04461380
044614               TO  PV-RDM-ARRIVE-TO-TCLOS-MIN                     04461480
044615              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04461580
044616               TO  PV-RDM-ARRIVE-TO-SHIP-MIN                      04461680
044617              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04461780
044618               TO  PV-RDM-P2L-OPEN-TO-TCLOS-MIN                   04461880
044619              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04461980
044620               TO  PV-RDM-P2L-OPEN-TO-SHIP-MIN                    04462080
044621              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04462180
044622               TO  PV-RDM-P2L-CLOSE-TO-TCLOS-MIN                  04462280
044623              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04462380
044624               TO  PV-RDM-P2L-CLOSE-TO-SHIP-MIN                   04462480
044625              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04462580
044626               TO  PV-RDM-ARRIVE-TO-MSTR-MIN                      04462680
044627              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04462780
044628               TO  PV-RDM-PRC-TO-MSTR-MIN                         04462880
044629              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04462980
044630               TO  PV-RDM-ON-OTBND-TO-TCLOS-MIN                   04463080
044631              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04463180
044632               TO  PV-RDM-ON-OTBND-TO-TSHIP-MIN                   04463280
044633              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04463380
044634               TO  PV-RDM-MSTR-CRE-TO-OTBND-MIN                   04463480
044635              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04463580
044636               TO  PV-RDM-MSTR-CRE-TO-TCLOS-MIN                   04463680
044637              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04463780
044638               TO  PV-RDM-MSTR-CRE-TO-SHIP-MIN                    04463880
044639              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04463980
044640               TO  PV-RDM-MSTR-FIRST-TO-OTBND-MIN                 04464080
044641              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04464180
044642               TO  PV-RDM-MSTR-FIRST-TO-TCLOS-MIN                 04464280
044643              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04464380
044644               TO  PV-RDM-MSTR-FIRST-TO-SHIP-MIN                  04464480
044645              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04464580
044646               TO  PV-RDM-MSTR-LAST-TO-OTBND-MIN                  04464680
044647              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04464780
044648               TO  PV-RDM-MSTR-LAST-TO-TCLOS-MIN                  04464880
044649              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04464980
044650               TO  PV-RDM-MSTR-LAST-TO-SHIP-MIN                   04465080
044651              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04465180
044652               TO  PV-RDM-ON-OTBND-TO-CLOS-MIN                    04465280
044653              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04465380
044654               TO  PV-RDM-ON-OTBND-TO-SHIP-MIN                    04465480
044655              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04465580
044656               TO  PV-RDM-ARRIVE-TO-PRC-CNT                       04465680
044657              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04465780
044658               TO  PV-RDM-ARRIVE-TO-P2L-PKD-CNT                   04465880
044659              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04465980
044660               TO  PV-RDM-PRC-TO-P2L-PKD-CNT                      04466080
044661              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04466180
044662               TO  PV-RDM-P2L-PKD-TO-CLOSE-CNT                    04466280
044663              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04466380
044664               TO  PV-RDM-P2L-OPEN-TO-CLOSE-CNT                   04466480
044665              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04466580
044666               TO  PV-RDM-P2L-OPEN-TO-OTBND-CNT                   04466680
044667              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04466780
044668               TO  PV-RDM-P2L-CLOSE-TO-OTBND-CNT                  04466880
044669              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04466980
044670               TO  PV-RDM-ARRIVE-TO-OTBND-CNT                     04467080
044671              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04467180
044672               TO  PV-RDM-PRC-TO-OTBND-CNT                        04467280
044673              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04467380
044674               TO  PV-RDM-ARRIVE-TO-TCLOS-CNT                     04467480
044675              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04467580
044676               TO  PV-RDM-ARRIVE-TO-SHIP-CNT                      04467680
044677              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04467780
044678               TO  PV-RDM-P2L-OPEN-TO-TCLOS-CNT                   04467880
044679              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04467980
044680               TO  PV-RDM-P2L-OPEN-TO-SHIP-CNT                    04468080
044681              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04468180
044682               TO  PV-RDM-P2L-CLOSE-TO-TCLOS-CNT                  04468280
044683              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04468380
044684               TO  PV-RDM-P2L-CLOSE-TO-SHIP-CNT                   04468480
044685              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04468580
044686               TO  PV-RDM-ARRIVE-TO-MSTR-CNT                      04468680
044687              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04468780
044688               TO  PV-RDM-PRC-TO-MSTR-CNT                         04468880
044689              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04468980
044690               TO  PV-RDM-ON-OTBND-TO-TCLOS-CNT                   04469080
044691              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04469180
044692               TO  PV-RDM-ON-OTBND-TO-TSHIP-CNT                   04469280
044693              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04469380
044694               TO  PV-RDM-MSTR-CRE-TO-OTBND-CNT                   04469480
044695              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04469580
044696               TO  PV-RDM-MSTR-CRE-TO-TCLOS-CNT                   04469680
044697              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04469780
044698               TO  PV-RDM-MSTR-CRE-TO-SHIP-CNT                    04469880
044699              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04469980
044700               TO  PV-RDM-MSTR-FIRST-TO-OTBND-CNT                 04470080
044701              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04470180
044702               TO  PV-RDM-MSTR-FIRST-TO-TCLOS-CNT                 04470280
044703              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04470380
044704               TO  PV-RDM-MSTR-FIRST-TO-SHIP-CNT                  04470480
044705              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04470580
044706               TO  PV-RDM-MSTR-LAST-TO-OTBND-CNT                  04470680
044707              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04470780
044708               TO  PV-RDM-MSTR-LAST-TO-TCLOS-CNT                  04470880
044709              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04470980
044710               TO  PV-RDM-MSTR-LAST-TO-SHIP-CNT                   04471080
044711              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04471180
044712               TO  PV-RDM-ON-OTBND-TO-CLOS-CNT                    04471280
044713              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04471380
044714               TO  PV-RDM-ON-OTBND-TO-SHIP-CNT                    04471480
044715*                                                                 04471580
044716              ADD  PV-SRC-TRIP-CARTONS                            04471680
044717               TO  PV-RDM-TRIP-CARTONS                            04471780
044718              ADD  PV-SRC-TRIP-SRC-CARTONS                        04471880
044719               TO  PV-RDM-TRIP-SRC-CARTONS                        04471980
044720              ADD  PV-SRC-TOTAL-TRIPS                             04472080
044721               TO  PV-RDM-TOTAL-TRIPS                             04472180
044722*                                                                 04472280
044724         WHEN PV-PREV-SOURCE  =  '3WD'                            04472499
044725              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04472599
044726               TO  PV-3WD-TRIP-OPEN-TO-CLOSE-MIN                  04472699
044727              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04472799
044728               TO  PV-3WD-TRIP-CLOSE-TO-SHIP-MIN                  04472899
044729              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04472999
044730               TO  PV-3WD-TRIP-OPEN-TO-SHIP-MIN                   04473099
044731              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04473199
044732               TO  PV-3WD-TRIP-OPEN-TO-CLOSE-CNT                  04473299
044733              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04473399
044734               TO  PV-3WD-TRIP-CLOSE-TO-SHIP-CNT                  04473499
044735              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04473599
044736               TO  PV-3WD-TRIP-OPEN-TO-SHIP-CNT                   04473699
044737              ADD  PV-SRC-INPUT-RECORD-COUNT                      04473799
044738               TO  PV-3WD-INPUT-RECORD-COUNT                      04473899
044739              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04473999
044740               TO  PV-3WD-ARRIVE-TO-PRC-MIN                       04474099
044741              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04474199
044742               TO  PV-3WD-ARRIVE-TO-P2L-PKD-MIN                   04474299
044743              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04474399
044744               TO  PV-3WD-PRC-TO-P2L-PKD-MIN                      04474499
044745              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04474599
044746               TO  PV-3WD-P2L-PKD-TO-CLOSE-MIN                    04474699
044747              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04474799
044748               TO  PV-3WD-P2L-OPEN-TO-CLOSE-MIN                   04474899
044749              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04474999
044750               TO  PV-3WD-P2L-OPEN-TO-OTBND-MIN                   04475099
044751              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04475199
044752               TO  PV-3WD-P2L-CLOSE-TO-OTBND-MIN                  04475299
044753              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04475399
044754               TO  PV-3WD-ARRIVE-TO-OTBND-MIN                     04475499
044755              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04475599
044756               TO  PV-3WD-PRC-TO-OTBND-MIN                        04475699
044757              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04475799
044758               TO  PV-3WD-ARRIVE-TO-TCLOS-MIN                     04475899
044759              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04475999
044760               TO  PV-3WD-ARRIVE-TO-SHIP-MIN                      04476099
044761              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04476199
044762               TO  PV-3WD-P2L-OPEN-TO-TCLOS-MIN                   04476299
044763              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04476399
044764               TO  PV-3WD-P2L-OPEN-TO-SHIP-MIN                    04476499
044765              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04476599
044766               TO  PV-3WD-P2L-CLOSE-TO-TCLOS-MIN                  04476699
044767              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04476799
044768               TO  PV-3WD-P2L-CLOSE-TO-SHIP-MIN                   04476899
044769              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04476999
044770               TO  PV-3WD-ARRIVE-TO-MSTR-MIN                      04477099
044771              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04477199
044772               TO  PV-3WD-PRC-TO-MSTR-MIN                         04477299
044773              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04477399
044774               TO  PV-3WD-ON-OTBND-TO-TCLOS-MIN                   04477499
044775              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04477599
044776               TO  PV-3WD-ON-OTBND-TO-TSHIP-MIN                   04477699
044777              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04477799
044778               TO  PV-3WD-MSTR-CRE-TO-OTBND-MIN                   04477899
044779              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04477999
044780               TO  PV-3WD-MSTR-CRE-TO-TCLOS-MIN                   04478099
044781              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04478199
044782               TO  PV-3WD-MSTR-CRE-TO-SHIP-MIN                    04478299
044783              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04478399
044784               TO  PV-3WD-MSTR-FIRST-TO-OTBND-MIN                 04478499
044785              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04478599
044786               TO  PV-3WD-MSTR-FIRST-TO-TCLOS-MIN                 04478699
044787              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04478799
044788               TO  PV-3WD-MSTR-FIRST-TO-SHIP-MIN                  04478899
044789              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04478999
044790               TO  PV-3WD-MSTR-LAST-TO-OTBND-MIN                  04479099
044791              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04479199
044792               TO  PV-3WD-MSTR-LAST-TO-TCLOS-MIN                  04479299
044793              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04479399
044794               TO  PV-3WD-MSTR-LAST-TO-SHIP-MIN                   04479499
044795              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04479599
044796               TO  PV-3WD-ON-OTBND-TO-CLOS-MIN                    04479699
044797              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04479799
044798               TO  PV-3WD-ON-OTBND-TO-SHIP-MIN                    04479899
044799              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04479999
044800               TO  PV-3WD-ARRIVE-TO-PRC-CNT                       04480099
044801              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04480199
044802               TO  PV-3WD-ARRIVE-TO-P2L-PKD-CNT                   04480299
044803              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04480399
044804               TO  PV-3WD-PRC-TO-P2L-PKD-CNT                      04480499
044805              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04480599
044806               TO  PV-3WD-P2L-PKD-TO-CLOSE-CNT                    04480699
044807              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04480799
044808               TO  PV-3WD-P2L-OPEN-TO-CLOSE-CNT                   04480899
044809              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04480999
044810               TO  PV-3WD-P2L-OPEN-TO-OTBND-CNT                   04481099
044811              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04481199
044812               TO  PV-3WD-P2L-CLOSE-TO-OTBND-CNT                  04481299
044813              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04481399
044814               TO  PV-3WD-ARRIVE-TO-OTBND-CNT                     04481499
044815              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04481599
044816               TO  PV-3WD-PRC-TO-OTBND-CNT                        04481699
044817              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04481799
044818               TO  PV-3WD-ARRIVE-TO-TCLOS-CNT                     04481899
044819              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04481999
044820               TO  PV-3WD-ARRIVE-TO-SHIP-CNT                      04482099
044821              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04482199
044822               TO  PV-3WD-P2L-OPEN-TO-TCLOS-CNT                   04482299
044823              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04482399
044824               TO  PV-3WD-P2L-OPEN-TO-SHIP-CNT                    04482499
044825              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04482599
044826               TO  PV-3WD-P2L-CLOSE-TO-TCLOS-CNT                  04482699
044827              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04482799
044828               TO  PV-3WD-P2L-CLOSE-TO-SHIP-CNT                   04482899
044829              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04482999
044830               TO  PV-3WD-ARRIVE-TO-MSTR-CNT                      04483099
044831              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04483199
044832               TO  PV-3WD-PRC-TO-MSTR-CNT                         04483299
044833              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04483399
044834               TO  PV-3WD-ON-OTBND-TO-TCLOS-CNT                   04483499
044835              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04483599
044836               TO  PV-3WD-ON-OTBND-TO-TSHIP-CNT                   04483699
044837              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04483799
044838               TO  PV-3WD-MSTR-CRE-TO-OTBND-CNT                   04483899
044839              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04483999
044840               TO  PV-3WD-MSTR-CRE-TO-TCLOS-CNT                   04484099
044841              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04484199
044842               TO  PV-3WD-MSTR-CRE-TO-SHIP-CNT                    04484299
044843              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04484399
044844               TO  PV-3WD-MSTR-FIRST-TO-OTBND-CNT                 04484499
044845              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04484599
044846               TO  PV-3WD-MSTR-FIRST-TO-TCLOS-CNT                 04484699
044847              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04484799
044848               TO  PV-3WD-MSTR-FIRST-TO-SHIP-CNT                  04484899
044849              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04484999
044850               TO  PV-3WD-MSTR-LAST-TO-OTBND-CNT                  04485099
044851              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04485199
044852               TO  PV-3WD-MSTR-LAST-TO-TCLOS-CNT                  04485299
044853              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04485399
044854               TO  PV-3WD-MSTR-LAST-TO-SHIP-CNT                   04485499
044855              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04485599
044856               TO  PV-3WD-ON-OTBND-TO-CLOS-CNT                    04485699
044857              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04485799
044858               TO  PV-3WD-ON-OTBND-TO-SHIP-CNT                    04485899
044859*                                                                 04485999
044860              ADD  PV-SRC-TRIP-CARTONS                            04486099
044861               TO  PV-3WD-TRIP-CARTONS                            04486199
044862              ADD  PV-SRC-TRIP-SRC-CARTONS                        04486299
044863               TO  PV-3WD-TRIP-SRC-CARTONS                        04486399
044864              ADD  PV-SRC-TOTAL-TRIPS                             04486499
044865               TO  PV-3WD-TOTAL-TRIPS                             04486599
044866*                                                                 04486699
044867         WHEN OTHER                                               04486780
044868              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                  04486880
044869               TO  PV-OTH-TRIP-OPEN-TO-CLOSE-MIN                  04486980
044870              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                  04487080
044871               TO  PV-OTH-TRIP-CLOSE-TO-SHIP-MIN                  04487180
044872              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                   04487280
044873               TO  PV-OTH-TRIP-OPEN-TO-SHIP-MIN                   04487380
044874              ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                  04487480
044875               TO  PV-OTH-TRIP-OPEN-TO-CLOSE-CNT                  04487580
044876              ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                  04487680
044877               TO  PV-OTH-TRIP-CLOSE-TO-SHIP-CNT                  04487780
044878              ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                   04487880
044879               TO  PV-OTH-TRIP-OPEN-TO-SHIP-CNT                   04487980
044880              ADD  PV-SRC-INPUT-RECORD-COUNT                      04488080
044881               TO  PV-OTH-INPUT-RECORD-COUNT                      04488180
044882              ADD  PV-SRC-ARRIVE-TO-PRC-MIN                       04488280
044883               TO  PV-OTH-ARRIVE-TO-PRC-MIN                       04488380
044884              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                   04488480
044885               TO  PV-OTH-ARRIVE-TO-P2L-PKD-MIN                   04488580
044886              ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                      04488680
044887               TO  PV-OTH-PRC-TO-P2L-PKD-MIN                      04488780
044888              ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                    04488880
044889               TO  PV-OTH-P2L-PKD-TO-CLOSE-MIN                    04488980
044890              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                   04489080
044891               TO  PV-OTH-P2L-OPEN-TO-CLOSE-MIN                   04489180
044892              ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                   04489280
044893               TO  PV-OTH-P2L-OPEN-TO-OTBND-MIN                   04489380
044894              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                  04489480
044895               TO  PV-OTH-P2L-CLOSE-TO-OTBND-MIN                  04489580
044896              ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                     04489680
044897               TO  PV-OTH-ARRIVE-TO-OTBND-MIN                     04489780
044898              ADD  PV-SRC-PRC-TO-OTBND-MIN                        04489880
044899               TO  PV-OTH-PRC-TO-OTBND-MIN                        04489980
044900              ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                     04490080
044901               TO  PV-OTH-ARRIVE-TO-TCLOS-MIN                     04490180
044902              ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                      04490280
044903               TO  PV-OTH-ARRIVE-TO-SHIP-MIN                      04490380
044904              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                   04490480
044905               TO  PV-OTH-P2L-OPEN-TO-TCLOS-MIN                   04490580
044906              ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                    04490680
044907               TO  PV-OTH-P2L-OPEN-TO-SHIP-MIN                    04490780
044908              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                  04490880
044909               TO  PV-OTH-P2L-CLOSE-TO-TCLOS-MIN                  04490980
044910              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                   04491080
044911               TO  PV-OTH-P2L-CLOSE-TO-SHIP-MIN                   04491180
044912              ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                      04491280
044913               TO  PV-OTH-ARRIVE-TO-MSTR-MIN                      04491380
044914              ADD  PV-SRC-PRC-TO-MSTR-MIN                         04491480
044915               TO  PV-OTH-PRC-TO-MSTR-MIN                         04491580
044916              ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                   04491680
044917               TO  PV-OTH-ON-OTBND-TO-TCLOS-MIN                   04491780
044918              ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                   04491880
044919               TO  PV-OTH-ON-OTBND-TO-TSHIP-MIN                   04491980
044920              ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                   04492080
044921               TO  PV-OTH-MSTR-CRE-TO-OTBND-MIN                   04492180
044922              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                   04492280
044923               TO  PV-OTH-MSTR-CRE-TO-TCLOS-MIN                   04492380
044924              ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                    04492480
044925               TO  PV-OTH-MSTR-CRE-TO-SHIP-MIN                    04492580
044926              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                 04492680
044927               TO  PV-OTH-MSTR-FIRST-TO-OTBND-MIN                 04492780
044928              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                 04492880
044929               TO  PV-OTH-MSTR-FIRST-TO-TCLOS-MIN                 04492980
044930              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                  04493080
044931               TO  PV-OTH-MSTR-FIRST-TO-SHIP-MIN                  04493180
044932              ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                  04493280
044933               TO  PV-OTH-MSTR-LAST-TO-OTBND-MIN                  04493380
044934              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                  04493480
044935               TO  PV-OTH-MSTR-LAST-TO-TCLOS-MIN                  04493580
044936              ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                   04493680
044937               TO  PV-OTH-MSTR-LAST-TO-SHIP-MIN                   04493780
044938              ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                    04493880
044939               TO  PV-OTH-ON-OTBND-TO-CLOS-MIN                    04493980
044940              ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                    04494080
044941               TO  PV-OTH-ON-OTBND-TO-SHIP-MIN                    04494180
044942              ADD  PV-SRC-ARRIVE-TO-PRC-CNT                       04494280
044943               TO  PV-OTH-ARRIVE-TO-PRC-CNT                       04494380
044944              ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                   04494480
044945               TO  PV-OTH-ARRIVE-TO-P2L-PKD-CNT                   04494580
044946              ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                      04494680
044947               TO  PV-OTH-PRC-TO-P2L-PKD-CNT                      04494780
044948              ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                    04494880
044949               TO  PV-OTH-P2L-PKD-TO-CLOSE-CNT                    04494980
044950              ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                   04495080
044951               TO  PV-OTH-P2L-OPEN-TO-CLOSE-CNT                   04495180
044952              ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                   04495280
044953               TO  PV-OTH-P2L-OPEN-TO-OTBND-CNT                   04495380
044954              ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                  04495480
044955               TO  PV-OTH-P2L-CLOSE-TO-OTBND-CNT                  04495580
044956              ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                     04495680
044957               TO  PV-OTH-ARRIVE-TO-OTBND-CNT                     04495780
044958              ADD  PV-SRC-PRC-TO-OTBND-CNT                        04495880
044959               TO  PV-OTH-PRC-TO-OTBND-CNT                        04495980
044960              ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                     04496080
044961               TO  PV-OTH-ARRIVE-TO-TCLOS-CNT                     04496180
044962              ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                      04496280
044963               TO  PV-OTH-ARRIVE-TO-SHIP-CNT                      04496380
044964              ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                   04496480
044965               TO  PV-OTH-P2L-OPEN-TO-TCLOS-CNT                   04496580
044966              ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                    04496680
044967               TO  PV-OTH-P2L-OPEN-TO-SHIP-CNT                    04496780
044968              ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                  04496880
044969               TO  PV-OTH-P2L-CLOSE-TO-TCLOS-CNT                  04496980
044970              ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                   04497080
044971               TO  PV-OTH-P2L-CLOSE-TO-SHIP-CNT                   04497180
044972              ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                      04497280
044973               TO  PV-OTH-ARRIVE-TO-MSTR-CNT                      04497380
044974              ADD  PV-SRC-PRC-TO-MSTR-CNT                         04497480
044975               TO  PV-OTH-PRC-TO-MSTR-CNT                         04497580
044976              ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                   04497680
044977               TO  PV-OTH-ON-OTBND-TO-TCLOS-CNT                   04497780
044978              ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                   04497880
044979               TO  PV-OTH-ON-OTBND-TO-TSHIP-CNT                   04497980
044980              ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                   04498080
044981               TO  PV-OTH-MSTR-CRE-TO-OTBND-CNT                   04498180
044982              ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                   04498280
044983               TO  PV-OTH-MSTR-CRE-TO-TCLOS-CNT                   04498380
044984              ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                    04498480
044985               TO  PV-OTH-MSTR-CRE-TO-SHIP-CNT                    04498580
044986              ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                 04498680
044987               TO  PV-OTH-MSTR-FIRST-TO-OTBND-CNT                 04498780
044988              ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                 04498880
044989               TO  PV-OTH-MSTR-FIRST-TO-TCLOS-CNT                 04498980
044990              ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                  04499080
044991               TO  PV-OTH-MSTR-FIRST-TO-SHIP-CNT                  04499180
044992              ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                  04499280
044993               TO  PV-OTH-MSTR-LAST-TO-OTBND-CNT                  04499380
044994              ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                  04499480
044995               TO  PV-OTH-MSTR-LAST-TO-TCLOS-CNT                  04499580
044996              ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                   04499680
044997               TO  PV-OTH-MSTR-LAST-TO-SHIP-CNT                   04499780
044998              ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                    04499880
044999               TO  PV-OTH-ON-OTBND-TO-CLOS-CNT                    04499980
045000              ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                    04500080
045001               TO  PV-OTH-ON-OTBND-TO-SHIP-CNT                    04500180
045002*                                                                 04500280
045003              ADD  PV-SRC-TRIP-CARTONS                            04500380
045004               TO  PV-OTH-TRIP-CARTONS                            04500480
045005              ADD  PV-SRC-TRIP-SRC-CARTONS                        04500580
045006               TO  PV-OTH-TRIP-SRC-CARTONS                        04500680
045007              ADD  PV-SRC-TOTAL-TRIPS                             04500780
045008               TO  PV-OTH-TOTAL-TRIPS                             04500880
045009*                                                                 04500980
045010     END-EVALUATE.                                                04501080
045011                                                                  04501180
045012     ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                           04501280
045013      TO  PV-OVR-TRIP-OPEN-TO-CLOSE-MIN.                          04501380
045014     ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                           04501480
045015      TO  PV-OVR-TRIP-CLOSE-TO-SHIP-MIN.                          04501580
045016     ADD  PV-SRC-TRIP-OPEN-TO-SHIP-MIN                            04501680
045017      TO  PV-OVR-TRIP-OPEN-TO-SHIP-MIN.                           04501780
045018     ADD  PV-SRC-TRIP-OPEN-TO-CLOSE-CNT                           04501880
045019      TO  PV-OVR-TRIP-OPEN-TO-CLOSE-CNT.                          04501980
045020     ADD  PV-SRC-TRIP-CLOSE-TO-SHIP-CNT                           04502080
045021      TO  PV-OVR-TRIP-CLOSE-TO-SHIP-CNT.                          04502180
045022     ADD  PV-SRC-TRIP-OPEN-TO-SHIP-CNT                            04502280
045023      TO  PV-OVR-TRIP-OPEN-TO-SHIP-CNT.                           04502380
045024     ADD  PV-SRC-INPUT-RECORD-COUNT                               04502480
045025      TO  PV-OVR-INPUT-RECORD-COUNT.                              04502580
045026     ADD  PV-SRC-ARRIVE-TO-PRC-MIN                                04502680
045027      TO  PV-OVR-ARRIVE-TO-PRC-MIN.                               04502780
045028     ADD  PV-SRC-ARRIVE-TO-P2L-PKD-MIN                            04502880
045029      TO  PV-OVR-ARRIVE-TO-P2L-PKD-MIN.                           04502980
045030     ADD  PV-SRC-PRC-TO-P2L-PKD-MIN                               04503080
045031      TO  PV-OVR-PRC-TO-P2L-PKD-MIN.                              04503180
045032     ADD  PV-SRC-P2L-PKD-TO-CLOSE-MIN                             04503280
045033      TO  PV-OVR-P2L-PKD-TO-CLOSE-MIN.                            04503380
045034     ADD  PV-SRC-P2L-OPEN-TO-CLOSE-MIN                            04503480
045035      TO  PV-OVR-P2L-OPEN-TO-CLOSE-MIN.                           04503580
045036     ADD  PV-SRC-P2L-OPEN-TO-OTBND-MIN                            04503680
045037      TO  PV-OVR-P2L-OPEN-TO-OTBND-MIN.                           04503780
045038     ADD  PV-SRC-P2L-CLOSE-TO-OTBND-MIN                           04503880
045039      TO  PV-OVR-P2L-CLOSE-TO-OTBND-MIN.                          04503980
045040     ADD  PV-SRC-ARRIVE-TO-OTBND-MIN                              04504080
045041      TO  PV-OVR-ARRIVE-TO-OTBND-MIN.                             04504180
045042     ADD  PV-SRC-PRC-TO-OTBND-MIN                                 04504280
045043      TO  PV-OVR-PRC-TO-OTBND-MIN.                                04504380
045044     ADD  PV-SRC-ARRIVE-TO-TCLOS-MIN                              04504480
045045      TO  PV-OVR-ARRIVE-TO-TCLOS-MIN.                             04504580
045046     ADD  PV-SRC-ARRIVE-TO-SHIP-MIN                               04504680
045047      TO  PV-OVR-ARRIVE-TO-SHIP-MIN.                              04504780
045048     ADD  PV-SRC-P2L-OPEN-TO-TCLOS-MIN                            04504880
045049      TO  PV-OVR-P2L-OPEN-TO-TCLOS-MIN.                           04504980
045050     ADD  PV-SRC-P2L-OPEN-TO-SHIP-MIN                             04505080
045051      TO  PV-OVR-P2L-OPEN-TO-SHIP-MIN.                            04505180
045052     ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                           04505280
045053      TO  PV-OVR-P2L-CLOSE-TO-TCLOS-MIN.                          04505380
045054     ADD  PV-SRC-P2L-CLOSE-TO-SHIP-MIN                            04505480
045055      TO  PV-OVR-P2L-CLOSE-TO-SHIP-MIN.                           04505580
045056     ADD  PV-SRC-ARRIVE-TO-MSTR-MIN                               04505680
045057      TO  PV-OVR-ARRIVE-TO-MSTR-MIN.                              04505780
045058     ADD  PV-SRC-PRC-TO-MSTR-MIN                                  04505880
045059      TO  PV-OVR-PRC-TO-MSTR-MIN.                                 04505980
045060     ADD  PV-SRC-ON-OTBND-TO-TCLOS-MIN                            04506080
045061      TO  PV-OVR-ON-OTBND-TO-TCLOS-MIN.                           04506180
045062     ADD  PV-SRC-ON-OTBND-TO-TSHIP-MIN                            04506280
045063      TO  PV-OVR-ON-OTBND-TO-TSHIP-MIN.                           04506380
045064     ADD  PV-SRC-MSTR-CRE-TO-OTBND-MIN                            04506480
045065      TO  PV-OVR-MSTR-CRE-TO-OTBND-MIN.                           04506580
045066     ADD  PV-SRC-MSTR-CRE-TO-TCLOS-MIN                            04506680
045067      TO  PV-OVR-MSTR-CRE-TO-TCLOS-MIN.                           04506780
045068     ADD  PV-SRC-MSTR-CRE-TO-SHIP-MIN                             04506880
045069      TO  PV-OVR-MSTR-CRE-TO-SHIP-MIN.                            04506980
045070     ADD  PV-SRC-MSTR-FIRST-TO-OTBND-MIN                          04507080
045071      TO  PV-OVR-MSTR-FIRST-TO-OTBND-MIN.                         04507180
045072     ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                          04507280
045073      TO  PV-OVR-MSTR-FIRST-TO-TCLOS-MIN.                         04507380
045074     ADD  PV-SRC-MSTR-FIRST-TO-SHIP-MIN                           04507480
045075      TO  PV-OVR-MSTR-FIRST-TO-SHIP-MIN.                          04507580
045076     ADD  PV-SRC-MSTR-LAST-TO-OTBND-MIN                           04507680
045077      TO  PV-OVR-MSTR-LAST-TO-OTBND-MIN.                          04507780
045078     ADD  PV-SRC-MSTR-LAST-TO-TCLOS-MIN                           04507880
045079      TO  PV-OVR-MSTR-LAST-TO-TCLOS-MIN.                          04507980
045080     ADD  PV-SRC-MSTR-LAST-TO-SHIP-MIN                            04508080
045081      TO  PV-OVR-MSTR-LAST-TO-SHIP-MIN.                           04508180
045082     ADD  PV-SRC-ON-OTBND-TO-CLOS-MIN                             04508280
045083      TO  PV-OVR-ON-OTBND-TO-CLOS-MIN.                            04508380
045084     ADD  PV-SRC-ON-OTBND-TO-SHIP-MIN                             04508480
045085      TO  PV-OVR-ON-OTBND-TO-SHIP-MIN.                            04508580
045086     ADD  PV-SRC-ARRIVE-TO-PRC-CNT                                04508680
045087      TO  PV-OVR-ARRIVE-TO-PRC-CNT.                               04508780
045088     ADD  PV-SRC-ARRIVE-TO-P2L-PKD-CNT                            04508880
045089      TO  PV-OVR-ARRIVE-TO-P2L-PKD-CNT.                           04508980
045090     ADD  PV-SRC-PRC-TO-P2L-PKD-CNT                               04509080
045091      TO  PV-OVR-PRC-TO-P2L-PKD-CNT.                              04509180
045092     ADD  PV-SRC-P2L-PKD-TO-CLOSE-CNT                             04509280
045093      TO  PV-OVR-P2L-PKD-TO-CLOSE-CNT.                            04509380
045094     ADD  PV-SRC-P2L-OPEN-TO-CLOSE-CNT                            04509480
045095      TO  PV-OVR-P2L-OPEN-TO-CLOSE-CNT.                           04509580
045096     ADD  PV-SRC-P2L-OPEN-TO-OTBND-CNT                            04509680
045097      TO  PV-OVR-P2L-OPEN-TO-OTBND-CNT.                           04509780
045098     ADD  PV-SRC-P2L-CLOSE-TO-OTBND-CNT                           04509880
045099      TO  PV-OVR-P2L-CLOSE-TO-OTBND-CNT.                          04509980
045100     ADD  PV-SRC-ARRIVE-TO-OTBND-CNT                              04510080
045101      TO  PV-OVR-ARRIVE-TO-OTBND-CNT.                             04510180
045102     ADD  PV-SRC-PRC-TO-OTBND-CNT                                 04510280
045103      TO  PV-OVR-PRC-TO-OTBND-CNT.                                04510380
045104     ADD  PV-SRC-ARRIVE-TO-TCLOS-CNT                              04510480
045105      TO  PV-OVR-ARRIVE-TO-TCLOS-CNT.                             04510580
045106     ADD  PV-SRC-ARRIVE-TO-SHIP-CNT                               04510680
045107      TO  PV-OVR-ARRIVE-TO-SHIP-CNT.                              04510780
045108     ADD  PV-SRC-P2L-OPEN-TO-TCLOS-CNT                            04510880
045109      TO  PV-OVR-P2L-OPEN-TO-TCLOS-CNT.                           04510980
045110     ADD  PV-SRC-P2L-OPEN-TO-SHIP-CNT                             04511080
045111      TO  PV-OVR-P2L-OPEN-TO-SHIP-CNT.                            04511180
045112     ADD  PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                           04511280
045113      TO  PV-OVR-P2L-CLOSE-TO-TCLOS-CNT.                          04511380
045114     ADD  PV-SRC-P2L-CLOSE-TO-SHIP-CNT                            04511480
045115      TO  PV-OVR-P2L-CLOSE-TO-SHIP-CNT.                           04511580
045116     ADD  PV-SRC-ARRIVE-TO-MSTR-CNT                               04511680
045117      TO  PV-OVR-ARRIVE-TO-MSTR-CNT.                              04511780
045118     ADD  PV-SRC-PRC-TO-MSTR-CNT                                  04511880
045119      TO  PV-OVR-PRC-TO-MSTR-CNT.                                 04511980
045120     ADD  PV-SRC-ON-OTBND-TO-TCLOS-CNT                            04512080
045121      TO  PV-OVR-ON-OTBND-TO-TCLOS-CNT.                           04512180
045122     ADD  PV-SRC-ON-OTBND-TO-TSHIP-CNT                            04512280
045123      TO  PV-OVR-ON-OTBND-TO-TSHIP-CNT.                           04512380
045124     ADD  PV-SRC-MSTR-CRE-TO-OTBND-CNT                            04512480
045125      TO  PV-OVR-MSTR-CRE-TO-OTBND-CNT.                           04512580
045126     ADD  PV-SRC-MSTR-CRE-TO-TCLOS-CNT                            04512680
045127      TO  PV-OVR-MSTR-CRE-TO-TCLOS-CNT.                           04512780
045128     ADD  PV-SRC-MSTR-CRE-TO-SHIP-CNT                             04512880
045129      TO  PV-OVR-MSTR-CRE-TO-SHIP-CNT.                            04512980
045130     ADD  PV-SRC-MSTR-FIRST-TO-OTBND-CNT                          04513080
045131      TO  PV-OVR-MSTR-FIRST-TO-OTBND-CNT.                         04513180
045132     ADD  PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                          04513280
045133      TO  PV-OVR-MSTR-FIRST-TO-TCLOS-CNT.                         04513380
045134     ADD  PV-SRC-MSTR-FIRST-TO-SHIP-CNT                           04513480
045135      TO  PV-OVR-MSTR-FIRST-TO-SHIP-CNT.                          04513580
045136     ADD  PV-SRC-MSTR-LAST-TO-OTBND-CNT                           04513680
045137      TO  PV-OVR-MSTR-LAST-TO-OTBND-CNT.                          04513780
045138     ADD  PV-SRC-MSTR-LAST-TO-TCLOS-CNT                           04513880
045139      TO  PV-OVR-MSTR-LAST-TO-TCLOS-CNT.                          04513980
045140     ADD  PV-SRC-MSTR-LAST-TO-SHIP-CNT                            04514080
045141      TO  PV-OVR-MSTR-LAST-TO-SHIP-CNT.                           04514180
045142     ADD  PV-SRC-ON-OTBND-TO-CLOS-CNT                             04514280
045143      TO  PV-OVR-ON-OTBND-TO-CLOS-CNT.                            04514380
045144     ADD  PV-SRC-ON-OTBND-TO-SHIP-CNT                             04514480
045145      TO  PV-OVR-ON-OTBND-TO-SHIP-CNT.                            04514580
045146*                                                                 04514680
045147     ADD  PV-SRC-TRIP-SRC-CARTONS                                 04514766
045148      TO  PV-OVR-TRIP-SRC-CARTONS.                                04514899
045149*    ADD  PV-SRC-TOTAL-TRIPS                                      04514999
045150*     TO  PV-OVR-TOTAL-TRIPS.                                     04515099
045151                                                                  04515177
045152*    MOVE PV-OVR-TOTAL-TRIPS                                      04515281
045153*      TO PV-DISP-OVR-TOTAL-TRIPS.                                04515381
045154*    MOVE PV-OVR-TRIP-CARTONS                                     04515481
045155*      TO PV-DISP-OVR-TRIP-CARTONS.                               04515581
045156*    MOVE PV-OVR-TRIP-SRC-CARTONS                                 04515681
045157*      TO PV-DISP-OVR-TRIP-SRC-CARTONS.                           04515781
045158*                                                                 04515877
045159*    DISPLAY ' TRIPS:'            PV-DISP-OVR-TOTAL-TRIPS         04515981
045160*            '    TRIP CRTNS:'    PV-DISP-OVR-TRIP-CARTONS        04516081
045161*            '    SOURCE CRTNS:'  PV-DISP-OVR-TRIP-SRC-CARTONS.   04516181
045162                                                                  04516277
045163****************************************************************  04516377
045164* CALCULATE CORPORATE OVERALL TOTALS                           *  04516477
045165****************************************************************  04516577
045166 3040-CALC-CORP-AVERAGES.                                         04516677
045167                                                                  04516777
045168     PERFORM 3050-CALC-ASN-AVERAGES.                              04516877
045169     PERFORM 3055-CALC-CPS-AVERAGES.                              04516977
045170     PERFORM 3060-CALC-SMO-AVERAGES.                              04517077
045171     PERFORM 3065-CALC-JWL-AVERAGES.                              04517177
045172     PERFORM 3070-CALC-P2L-AVERAGES.                              04517277
045173     PERFORM 3075-CALC-MST-AVERAGES.                              04517377
045174     PERFORM 3080-CALC-RDM-AVERAGES.                              04517477
045175     PERFORM 3083-CALC-3WD-AVERAGES.                              04517599
045176     IF  PV-OTH-INPUT-RECORD-COUNT   >  0                         04517699
045177         PERFORM 3085-CALC-OTH-AVERAGES                           04517799
045178     END-IF.                                                      04517899
045179     PERFORM 3090-CALC-OVR-AVERAGES.                              04517999
045180                                                                  04518099
045181                                                                  04518199
045182****************************************************************  04518299
045183* CALCULATE ASN-AVERAGES                                       *  04518399
045184****************************************************************  04518499
045185 3050-CALC-ASN-AVERAGES.                                          04518599
045186                                                                  04518699
045187     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04518799
045188                             PV-TRIP-CLOSE-TO-SHIP-AVG            04518899
045189                             PV-TRIP-OPEN-TO-SHIP-AVG             04518999
045190                             PV-ARRIVE-TO-PRC-AVG                 04519099
045191                             PV-ARRIVE-TO-P2L-PKD-AVG             04519199
045192                             PV-PRC-TO-P2L-PKD-AVG                04519299
045193                             PV-P2L-PKD-TO-CLOSE-AVG              04519399
045194                             PV-P2L-OPEN-TO-CLOSE-AVG             04519499
045200                             PV-P2L-OPEN-TO-OTBND-AVG             04520051
045300                             PV-P2L-CLOSE-TO-OTBND-AVG            04530051
045400                             PV-ARRIVE-TO-OTBND-AVG               04540051
045500                             PV-PRC-TO-OTBND-AVG                  04550051
045510                             PV-ARRIVE-TO-TCLOS-AVG               04551051
045520                             PV-ARRIVE-TO-SHIP-AVG                04552051
045530                             PV-P2L-OPEN-TO-TCLOS-AVG             04553051
045540                             PV-P2L-OPEN-TO-SHIP-AVG              04554051
045550                             PV-P2L-CLOSE-TO-TCLOS-AVG            04555051
045560                             PV-P2L-CLOSE-TO-SHIP-AVG             04556051
045570                             PV-ARRIVE-TO-MSTR-AVG                04557051
045571                             PV-PRC-TO-MSTR-AVG                   04557151
045572                             PV-MSTR-CRE-TO-OTBND-AVG             04557251
045573                             PV-MSTR-CRE-TO-TCLOS-AVG             04557351
045574                             PV-MSTR-CRE-TO-SHIP-AVG              04557451
045575                             PV-MSTR-FIRST-TO-OTBND-AVG           04557551
045576                             PV-MSTR-FIRST-TO-TCLOS-AVG           04557651
045577                             PV-MSTR-FIRST-TO-SHIP-AVG            04557751
045578                             PV-MSTR-LAST-TO-OTBND-AVG            04557851
045579                             PV-MSTR-LAST-TO-TCLOS-AVG            04557951
045580                             PV-MSTR-LAST-TO-SHIP-AVG             04558051
045581                             PV-ON-OTBND-TO-CLOS-AVG              04558151
045582                             PV-ON-OTBND-TO-SHIP-AVG              04558251
045583                             PV-TRIP-OPEN-TO-CLOSE-DAY            04558351
045584                             PV-TRIP-CLOSE-TO-SHIP-DAY            04558451
045585                             PV-TRIP-OPEN-TO-SHIP-DAY             04558551
045586                             PV-ARRIVE-TO-PRC-DAY                 04558651
045587                             PV-ARRIVE-TO-P2L-PKD-DAY             04558751
045588                             PV-PRC-TO-P2L-PKD-DAY                04558851
045589                             PV-P2L-PKD-TO-CLOSE-DAY              04558951
045590                             PV-P2L-OPEN-TO-CLOSE-DAY             04559051
045591                             PV-P2L-OPEN-TO-OTBND-DAY             04559151
045592                             PV-P2L-CLOSE-TO-OTBND-DAY            04559251
045593                             PV-ARRIVE-TO-OTBND-DAY               04559351
045594                             PV-PRC-TO-OTBND-DAY                  04559451
045595                             PV-ARRIVE-TO-TCLOS-DAY               04559551
045596                             PV-ARRIVE-TO-SHIP-DAY                04559651
045597                             PV-P2L-OPEN-TO-TCLOS-DAY             04559751
045598                             PV-P2L-OPEN-TO-SHIP-DAY              04559851
045599                             PV-P2L-CLOSE-TO-TCLOS-DAY            04559951
045600                             PV-P2L-CLOSE-TO-SHIP-DAY             04560051
045601                             PV-ARRIVE-TO-MSTR-DAY                04560151
045602                             PV-PRC-TO-MSTR-DAY                   04560251
045603                             PV-MSTR-CRE-TO-OTBND-DAY             04560351
045604                             PV-MSTR-CRE-TO-TCLOS-DAY             04560451
045605                             PV-MSTR-CRE-TO-SHIP-DAY              04560551
045606                             PV-MSTR-FIRST-TO-OTBND-DAY           04560651
045607                             PV-MSTR-FIRST-TO-TCLOS-DAY           04560751
045608                             PV-MSTR-FIRST-TO-SHIP-DAY            04560851
045609                             PV-MSTR-LAST-TO-OTBND-DAY            04560951
045610                             PV-MSTR-LAST-TO-TCLOS-DAY            04561051
045611                             PV-MSTR-LAST-TO-SHIP-DAY             04561151
045612                             PV-ON-OTBND-TO-CLOS-DAY              04561251
045613                             PV-ON-OTBND-TO-SHIP-DAY.             04561351
045614                                                                  04561451
045615     IF  PV-ASN-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04561551
045616         PV-ASN-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04561651
045617         DIVIDE  PV-ASN-TRIP-OPEN-TO-CLOSE-MIN                    04561751
045618             BY  PV-ASN-TRIP-OPEN-TO-CLOSE-CNT                    04561851
045619         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04561951
045620                 ROUNDED                                          04562051
045621         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04562151
045622             BY  1440                                             04562251
045623         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04562351
045624                 ROUNDED                                          04562451
045625     ELSE                                                         04562551
045626         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04562651
045627                           PV-TRIP-OPEN-TO-CLOSE-DAY              04562751
045628     END-IF.                                                      04562851
045629                                                                  04562951
045630     IF  PV-ASN-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04563051
045631         PV-ASN-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04563151
045632         DIVIDE  PV-ASN-TRIP-CLOSE-TO-SHIP-MIN                    04563251
045633             BY  PV-ASN-TRIP-CLOSE-TO-SHIP-CNT                    04563351
045634         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04563451
045635                 ROUNDED                                          04563551
045636         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04563651
045637             BY  1440                                             04563751
045638         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04563851
045639                 ROUNDED                                          04563951
045640     ELSE                                                         04564051
045641         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04564151
045642                           PV-TRIP-CLOSE-TO-SHIP-DAY              04564251
045643     END-IF.                                                      04564351
045644                                                                  04564451
045645     IF  PV-ASN-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04564551
045646         PV-ASN-TRIP-OPEN-TO-SHIP-CNT  >  0                       04564651
045647         DIVIDE  PV-ASN-TRIP-OPEN-TO-SHIP-MIN                     04564751
045648             BY  PV-ASN-TRIP-OPEN-TO-SHIP-CNT                     04564851
045649         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04564951
045650                 ROUNDED                                          04565051
045651         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04565151
045652             BY  1440                                             04565251
045653         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04565351
045654                 ROUNDED                                          04565451
045655     ELSE                                                         04565551
045656         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04565651
045657                           PV-TRIP-OPEN-TO-SHIP-DAY               04565751
045658     END-IF.                                                      04565851
045659                                                                  04565951
045660                                                                  04566051
045661     IF  PV-ASN-ARRIVE-TO-PRC-MIN  >  0  AND                      04566151
045662         PV-ASN-ARRIVE-TO-PRC-CNT  >  0                           04566251
045663         DIVIDE PV-ASN-ARRIVE-TO-PRC-MIN                          04566351
045664             BY PV-ASN-ARRIVE-TO-PRC-CNT                          04566451
045665         GIVING PV-ARRIVE-TO-PRC-AVG                              04566551
045666                 ROUNDED                                          04566651
045667         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04566751
045668             BY 1440                                              04566851
045669         GIVING PV-ARRIVE-TO-PRC-DAY                              04566951
045670                 ROUNDED                                          04567051
045671     ELSE                                                         04567151
045672         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04567251
045673                           PV-ARRIVE-TO-PRC-DAY                   04567351
045674     END-IF.                                                      04567451
045675                                                                  04567551
045676     IF  PV-ASN-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04567651
045677         PV-ASN-ARRIVE-TO-P2L-PKD-CNT  >  0                       04567751
045678         DIVIDE PV-ASN-ARRIVE-TO-P2L-PKD-MIN                      04567851
045679             BY PV-ASN-ARRIVE-TO-P2L-PKD-CNT                      04567951
045680         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04568051
045681                 ROUNDED                                          04568151
045682         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04568251
045683             BY 1440                                              04568351
045684         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04568451
045685                 ROUNDED                                          04568551
045686     ELSE                                                         04568651
045687         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04568751
045688                           PV-ARRIVE-TO-P2L-PKD-DAY               04568851
045689     END-IF.                                                      04568951
045690                                                                  04569051
045691                                                                  04569151
045692     IF  PV-ASN-PRC-TO-P2L-PKD-MIN  >  0  AND                     04569251
045693         PV-ASN-PRC-TO-P2L-PKD-CNT  >  0                          04569351
045694         DIVIDE PV-ASN-PRC-TO-P2L-PKD-MIN                         04569451
045695             BY PV-ASN-PRC-TO-P2L-PKD-CNT                         04569551
045696         GIVING PV-PRC-TO-P2L-PKD-AVG                             04569651
045697                 ROUNDED                                          04569751
045698         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04569851
045699             BY 1440                                              04569951
045700         GIVING PV-PRC-TO-P2L-PKD-DAY                             04570051
045701                 ROUNDED                                          04570151
045702     ELSE                                                         04570251
045703         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04570351
045704                           PV-PRC-TO-P2L-PKD-DAY                  04570451
045705     END-IF.                                                      04570551
045706                                                                  04570651
045707     IF  PV-ASN-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04570751
045708         PV-ASN-P2L-PKD-TO-CLOSE-CNT  >  0                        04570851
045709         DIVIDE PV-ASN-P2L-PKD-TO-CLOSE-MIN                       04570951
045710             BY PV-ASN-P2L-PKD-TO-CLOSE-CNT                       04571051
045711         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04571151
045712                 ROUNDED                                          04571251
045713         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04571351
045714             BY 1440                                              04571451
045715         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04571551
045716                 ROUNDED                                          04571651
045717     ELSE                                                         04571751
045718         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04571851
045719                           PV-P2L-PKD-TO-CLOSE-DAY                04571951
045720     END-IF.                                                      04572051
045721                                                                  04572151
045722     IF  PV-ASN-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04572251
045723         PV-ASN-P2L-OPEN-TO-CLOSE-CNT  >  0                       04572351
045724         DIVIDE PV-ASN-P2L-OPEN-TO-CLOSE-MIN                      04572451
045725             BY PV-ASN-P2L-OPEN-TO-CLOSE-CNT                      04572551
045726         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04572651
045727                 ROUNDED                                          04572751
045728         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04572851
045729             BY 1440                                              04572951
045730         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04573051
045731                 ROUNDED                                          04573151
045732     ELSE                                                         04573251
045733         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04573351
045734                           PV-P2L-OPEN-TO-CLOSE-DAY               04573451
045735     END-IF.                                                      04573551
045736                                                                  04573651
045737     IF  PV-ASN-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04573751
045738         PV-ASN-P2L-OPEN-TO-OTBND-CNT  >  0                       04573851
045739         DIVIDE PV-ASN-P2L-OPEN-TO-OTBND-MIN                      04573951
045740             BY PV-ASN-P2L-OPEN-TO-OTBND-CNT                      04574051
045741         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04574151
045742                 ROUNDED                                          04574251
045743         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04574351
045744             BY 1440                                              04574451
045745         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04574551
045746                 ROUNDED                                          04574651
045747     ELSE                                                         04574751
045748         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04574851
045749                           PV-P2L-OPEN-TO-OTBND-DAY               04574951
045750     END-IF.                                                      04575051
045751                                                                  04575151
045752     IF  PV-ASN-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04575251
045753         PV-ASN-P2L-CLOSE-TO-OTBND-CNT  >  0                      04575351
045754         DIVIDE PV-ASN-P2L-CLOSE-TO-OTBND-MIN                     04575451
045755             BY PV-ASN-P2L-CLOSE-TO-OTBND-CNT                     04575551
045756         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04575651
045757                 ROUNDED                                          04575751
045758         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04575851
045759             BY 1440                                              04575951
045760         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04576051
045761                 ROUNDED                                          04576151
045762     ELSE                                                         04576251
045763         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04576351
045764                           PV-P2L-CLOSE-TO-OTBND-DAY              04576451
045765     END-IF.                                                      04576551
045766                                                                  04576651
045767     IF  PV-ASN-ARRIVE-TO-OTBND-MIN  >  0  AND                    04576751
045768         PV-ASN-ARRIVE-TO-OTBND-CNT  >  0                         04576851
045769         DIVIDE PV-ASN-ARRIVE-TO-OTBND-MIN                        04576951
045770             BY PV-ASN-ARRIVE-TO-OTBND-CNT                        04577051
045771         GIVING PV-ARRIVE-TO-OTBND-AVG                            04577151
045772                 ROUNDED                                          04577251
045773         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04577351
045774             BY 1440                                              04577451
045775         GIVING PV-ARRIVE-TO-OTBND-DAY                            04577551
045776                 ROUNDED                                          04577651
045777     ELSE                                                         04577751
045778         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04577851
045779                           PV-ARRIVE-TO-OTBND-DAY                 04577951
045780     END-IF.                                                      04578051
045781                                                                  04578151
045782     IF  PV-ASN-PRC-TO-OTBND-MIN  >  0  AND                       04578251
045783         PV-ASN-PRC-TO-OTBND-CNT  >  0                            04578351
045784         DIVIDE PV-ASN-PRC-TO-OTBND-MIN                           04578451
045785             BY PV-ASN-PRC-TO-OTBND-CNT                           04578551
045786         GIVING PV-PRC-TO-OTBND-AVG                               04578651
045787                 ROUNDED                                          04578751
045788         DIVIDE PV-PRC-TO-OTBND-AVG                               04578851
045789             BY 1440                                              04578951
045790         GIVING PV-PRC-TO-OTBND-DAY                               04579051
045791                 ROUNDED                                          04579151
045792     ELSE                                                         04579251
045793         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04579351
045794                           PV-PRC-TO-OTBND-DAY                    04579451
045795     END-IF.                                                      04579551
045796                                                                  04579651
045797     IF  PV-ASN-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04579751
045798         PV-ASN-ARRIVE-TO-TCLOS-CNT  >  0                         04579851
045799         DIVIDE PV-ASN-ARRIVE-TO-TCLOS-MIN                        04579951
045800             BY PV-ASN-ARRIVE-TO-TCLOS-CNT                        04580051
045801         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04580151
045802                 ROUNDED                                          04580251
045803         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04580351
045804             BY 1440                                              04580451
045805         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04580551
045806                 ROUNDED                                          04580651
045807     ELSE                                                         04580751
045808         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04580851
045809                           PV-ARRIVE-TO-TCLOS-DAY                 04580951
045810     END-IF.                                                      04581051
045811                                                                  04581151
045812     IF  PV-ASN-ARRIVE-TO-SHIP-MIN  >  0  AND                     04581251
045813         PV-ASN-ARRIVE-TO-SHIP-CNT  >  0                          04581351
045814         DIVIDE PV-ASN-ARRIVE-TO-SHIP-MIN                         04581451
045815             BY PV-ASN-ARRIVE-TO-SHIP-CNT                         04581551
045816         GIVING PV-ARRIVE-TO-SHIP-AVG                             04581651
045817                 ROUNDED                                          04581751
045818         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04581851
045819             BY 1440                                              04581951
045820         GIVING PV-ARRIVE-TO-SHIP-DAY                             04582051
045821                 ROUNDED                                          04582151
045822     ELSE                                                         04582251
045823         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04582351
045824                           PV-ARRIVE-TO-SHIP-DAY                  04582451
045825     END-IF.                                                      04582551
045826                                                                  04582651
045827     IF  PV-ASN-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04582751
045828         PV-ASN-P2L-OPEN-TO-TCLOS-CNT  >  0                       04582851
045829         DIVIDE PV-ASN-P2L-OPEN-TO-TCLOS-MIN                      04582951
045830             BY PV-ASN-P2L-OPEN-TO-TCLOS-CNT                      04583051
045831         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04583151
045832                 ROUNDED                                          04583251
045833         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04583351
045834             BY 1440                                              04583451
045835         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04583551
045836                 ROUNDED                                          04583651
045837     ELSE                                                         04583751
045838         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04583851
045839                           PV-P2L-OPEN-TO-TCLOS-DAY               04583951
045840     END-IF.                                                      04584051
045841                                                                  04584151
045842     IF  PV-ASN-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04584251
045843         PV-ASN-P2L-OPEN-TO-SHIP-CNT  >  0                        04584351
045844         DIVIDE PV-ASN-P2L-OPEN-TO-SHIP-MIN                       04584451
045845             BY PV-ASN-P2L-OPEN-TO-SHIP-CNT                       04584551
045846         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04584651
045847                 ROUNDED                                          04584751
045848         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04584851
045849             BY 1440                                              04584951
045850         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04585051
045851                 ROUNDED                                          04585151
045852     ELSE                                                         04585251
045853         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04585351
045854                           PV-P2L-OPEN-TO-SHIP-DAY                04585451
045855     END-IF.                                                      04585551
045856                                                                  04585651
045857     IF  PV-ASN-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04585751
045858         PV-ASN-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04585851
045859         DIVIDE PV-ASN-P2L-CLOSE-TO-TCLOS-MIN                     04585951
045860             BY PV-ASN-P2L-CLOSE-TO-TCLOS-CNT                     04586051
045861         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04586151
045862                 ROUNDED                                          04586251
045863         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04586351
045864             BY 1440                                              04586451
045865         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04586551
045866                 ROUNDED                                          04586651
045867     ELSE                                                         04586751
045868         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04586851
045869                           PV-P2L-CLOSE-TO-TCLOS-DAY              04586951
045870     END-IF.                                                      04587051
045871                                                                  04587151
045872     IF  PV-ASN-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04587251
045873         PV-ASN-P2L-CLOSE-TO-SHIP-CNT  >  0                       04587351
045874         DIVIDE PV-ASN-P2L-CLOSE-TO-SHIP-MIN                      04587451
045875             BY PV-ASN-P2L-CLOSE-TO-SHIP-CNT                      04587551
045876         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04587651
045877                 ROUNDED                                          04587751
045878         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04587851
045879             BY 1440                                              04587951
045880         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04588051
045881                 ROUNDED                                          04588151
045882     ELSE                                                         04588251
045883         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04588351
045884                           PV-P2L-CLOSE-TO-SHIP-DAY               04588451
045885     END-IF.                                                      04588551
045886                                                                  04588651
045887     IF  PV-ASN-ARRIVE-TO-MSTR-MIN  >  0  AND                     04588751
045888         PV-ASN-ARRIVE-TO-MSTR-CNT  >  0                          04588851
045889         DIVIDE PV-ASN-ARRIVE-TO-MSTR-MIN                         04588951
045890             BY PV-ASN-ARRIVE-TO-MSTR-CNT                         04589051
045891         GIVING PV-ARRIVE-TO-MSTR-AVG                             04589151
045892                 ROUNDED                                          04589251
045893         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04589351
045894             BY 1440                                              04589451
045895         GIVING PV-ARRIVE-TO-MSTR-DAY                             04589551
045896                 ROUNDED                                          04589651
045897     ELSE                                                         04589751
045898         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04589851
045899                           PV-ARRIVE-TO-MSTR-DAY                  04589951
045900     END-IF.                                                      04590051
045901                                                                  04590151
045902     IF  PV-ASN-PRC-TO-MSTR-MIN  >  0  AND                        04590251
045903         PV-ASN-PRC-TO-MSTR-CNT  >  0                             04590351
045904         DIVIDE PV-ASN-PRC-TO-MSTR-MIN                            04590451
045905             BY PV-ASN-PRC-TO-MSTR-CNT                            04590551
045906         GIVING PV-PRC-TO-MSTR-AVG                                04590651
045907                 ROUNDED                                          04590751
045908         DIVIDE PV-PRC-TO-MSTR-AVG                                04590851
045909             BY 1440                                              04590951
045910         GIVING PV-PRC-TO-MSTR-DAY                                04591051
045911                 ROUNDED                                          04591151
045912     ELSE                                                         04591251
045913         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04591351
045914                           PV-PRC-TO-MSTR-DAY                     04591451
045915     END-IF.                                                      04591551
045916                                                                  04591651
045917     IF  PV-ASN-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04591751
045918         PV-ASN-ON-OTBND-TO-CLOS-CNT  >  0                        04591851
045919         DIVIDE PV-ASN-ON-OTBND-TO-CLOS-MIN                       04591951
045920             BY PV-ASN-ON-OTBND-TO-CLOS-CNT                       04592051
045921         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04592151
045922                 ROUNDED                                          04592251
045923         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04592351
045924             BY 1440                                              04592451
045925         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04592551
045926                 ROUNDED                                          04592651
045927     ELSE                                                         04592751
045928         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04592851
045929                           PV-ON-OTBND-TO-CLOS-DAY                04592951
045930     END-IF.                                                      04593051
045931                                                                  04593151
045932     IF  PV-ASN-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04593251
045933         PV-ASN-ON-OTBND-TO-SHIP-CNT  >  0                        04593351
045934         DIVIDE PV-ASN-ON-OTBND-TO-SHIP-MIN                       04593451
045935             BY PV-ASN-ON-OTBND-TO-SHIP-CNT                       04593551
045936         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04593651
045937                 ROUNDED                                          04593751
045938         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04593851
045939             BY 1440                                              04593951
045940         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04594051
045941                 ROUNDED                                          04594151
045942     ELSE                                                         04594251
045943         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04594351
045944                           PV-ON-OTBND-TO-SHIP-DAY                04594451
045945     END-IF.                                                      04594551
045946                                                                  04594651
045947     IF  PV-ASN-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04594751
045948         PV-ASN-MSTR-CRE-TO-OTBND-CNT  >  0                       04594851
045949         DIVIDE PV-ASN-MSTR-CRE-TO-OTBND-MIN                      04594951
045950             BY PV-ASN-MSTR-CRE-TO-OTBND-CNT                      04595051
045951         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04595151
045952                 ROUNDED                                          04595251
045953         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04595351
045954             BY 1440                                              04595451
045955         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04595551
045956                 ROUNDED                                          04595651
045957     ELSE                                                         04595751
045958         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04595851
045959                           PV-MSTR-CRE-TO-OTBND-DAY               04595951
045960     END-IF.                                                      04596051
045961                                                                  04596151
045962     IF  PV-ASN-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04596251
045963         PV-ASN-MSTR-CRE-TO-TCLOS-CNT  >  0                       04596351
045964         DIVIDE PV-ASN-MSTR-CRE-TO-TCLOS-MIN                      04596451
045965             BY PV-ASN-MSTR-CRE-TO-TCLOS-CNT                      04596551
045966         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04596651
045967                 ROUNDED                                          04596751
045968         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04596851
045969             BY 1440                                              04596951
045970         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04597051
045971                 ROUNDED                                          04597151
045972     ELSE                                                         04597251
045973         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04597351
045974                           PV-MSTR-CRE-TO-TCLOS-DAY               04597451
045975     END-IF.                                                      04597551
045976                                                                  04597651
045977     IF  PV-ASN-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04597751
045978         PV-ASN-MSTR-CRE-TO-SHIP-CNT  >  0                        04597851
045979         DIVIDE PV-ASN-MSTR-CRE-TO-SHIP-MIN                       04597951
045980             BY PV-ASN-MSTR-CRE-TO-SHIP-CNT                       04598051
045981         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04598151
045982                 ROUNDED                                          04598251
045983         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04598351
045984             BY 1440                                              04598451
045985         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04598551
045986                 ROUNDED                                          04598651
045987     ELSE                                                         04598751
045988         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04598851
045989                           PV-MSTR-CRE-TO-SHIP-DAY                04598951
045990     END-IF.                                                      04599051
045991                                                                  04599151
045992     IF  PV-ASN-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04599251
045993         PV-ASN-MSTR-FIRST-TO-OTBND-CNT  >  0                     04599351
045994         DIVIDE PV-ASN-MSTR-FIRST-TO-OTBND-MIN                    04599451
045995             BY PV-ASN-MSTR-FIRST-TO-OTBND-CNT                    04599551
045996         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04599651
045997                 ROUNDED                                          04599751
045998         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04599851
045999             BY 1440                                              04599951
046000         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04600051
046001                 ROUNDED                                          04600151
046002     ELSE                                                         04600251
046003         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04600351
046004                           PV-MSTR-FIRST-TO-OTBND-DAY             04600451
046005     END-IF.                                                      04600551
046006                                                                  04600651
046007     IF  PV-ASN-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04600751
046008         PV-ASN-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04600851
046009         DIVIDE PV-ASN-MSTR-FIRST-TO-TCLOS-MIN                    04600951
046010             BY PV-ASN-MSTR-FIRST-TO-TCLOS-CNT                    04601051
046011         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04601151
046012                 ROUNDED                                          04601251
046013         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04601351
046014             BY 1440                                              04601451
046015         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04601551
046016                 ROUNDED                                          04601651
046017     ELSE                                                         04601751
046018         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04601851
046019                           PV-MSTR-FIRST-TO-TCLOS-DAY             04601951
046020     END-IF.                                                      04602051
046021                                                                  04602151
046022     IF  PV-ASN-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04602251
046023         PV-ASN-MSTR-FIRST-TO-SHIP-CNT  >  0                      04602351
046024         DIVIDE PV-ASN-MSTR-FIRST-TO-SHIP-MIN                     04602451
046025             BY PV-ASN-MSTR-FIRST-TO-SHIP-CNT                     04602551
046026         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04602651
046027                 ROUNDED                                          04602751
046028         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04602851
046029             BY 1440                                              04602951
046030         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04603051
046031                 ROUNDED                                          04603151
046032     ELSE                                                         04603251
046033         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04603351
046034                           PV-MSTR-FIRST-TO-SHIP-DAY              04603451
046035     END-IF.                                                      04603551
046036                                                                  04603651
046037     IF  PV-ASN-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04603751
046038         PV-ASN-MSTR-LAST-TO-OTBND-CNT  >  0                      04603851
046039         DIVIDE PV-ASN-MSTR-LAST-TO-OTBND-MIN                     04603951
046040             BY PV-ASN-MSTR-LAST-TO-OTBND-CNT                     04604051
046041         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04604151
046042                 ROUNDED                                          04604251
046043         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04604351
046044             BY 1440                                              04604451
046045         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04604551
046046                 ROUNDED                                          04604651
046047     ELSE                                                         04604751
046048         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04604851
046049                           PV-MSTR-LAST-TO-OTBND-DAY              04604951
046050     END-IF.                                                      04605051
046051                                                                  04605151
046052     IF  PV-ASN-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04605251
046053         PV-ASN-MSTR-LAST-TO-TCLOS-CNT  >  0                      04605351
046054         DIVIDE PV-ASN-MSTR-LAST-TO-TCLOS-MIN                     04605451
046055             BY PV-ASN-MSTR-LAST-TO-TCLOS-CNT                     04605551
046056         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04605651
046057                 ROUNDED                                          04605751
046058         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04605851
046059             BY 1440                                              04605951
046060         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04606051
046061                 ROUNDED                                          04606151
046062     ELSE                                                         04606251
046063         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04606351
046064                           PV-MSTR-LAST-TO-TCLOS-DAY              04606451
046065     END-IF.                                                      04606551
046066                                                                  04606651
046067     IF  PV-ASN-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04606751
046068         PV-ASN-MSTR-LAST-TO-SHIP-CNT  >  0                       04606851
046069         DIVIDE PV-ASN-MSTR-LAST-TO-SHIP-MIN                      04606951
046070             BY PV-ASN-MSTR-LAST-TO-SHIP-CNT                      04607051
046071         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04607151
046072                 ROUNDED                                          04607251
046073         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04607351
046074             BY 1440                                              04607451
046075         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04607551
046076                 ROUNDED                                          04607651
046077     ELSE                                                         04607751
046078         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04607851
046079                           PV-MSTR-LAST-TO-SHIP-DAY               04607951
046080     END-IF.                                                      04608051
046081                                                                  04608173
046082     MOVE  ZEROES        TO  PV-TRIP-SRC-CRTN                     04608273
046083                             PV-TRIP-SRC-CRTN-PCNT.               04608373
046084                                                                  04608473
046085*                                                                 04608573
046086*** 8/19                                                          04608673
046087*                                                                 04608773
046088     IF  PV-ASN-TRIP-CARTONS            >  0  AND                 04608873
046089         PV-ASN-TRIP-SRC-CARTONS        >  0                      04608973
046090         DIVIDE  PV-ASN-TRIP-SRC-CARTONS                          04609073
046091             BY  PV-ASN-TRIP-CARTONS                              04609173
046092         GIVING  PV-TRIP-SRC-CRTN                                 04609273
046093                   ROUNDED                                        04609399
046094         MULTIPLY  PV-TRIP-SRC-CRTN                               04609473
046095               BY  100                                            04609573
046096           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04609673
046098     ELSE                                                         04609873
046099         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04609973
046100                           PV-TRIP-SRC-CRTN                       04610073
046101     END-IF.                                                      04610173
046102                                                                  04610273
046103                                                                  04610351
046104     MOVE ZEROES                TO DL3-DC-NBR                     04610455
046105     MOVE 'CORP OVERALL    '    TO DL3-DC-NAME                    04610555
046106     MOVE 'SCAN BASED XDOCK'    TO DL3-SOURCE                     04610656
046107     PERFORM 5050-PRINT-CORP-TOTALS.                              04610755
046108                                                                  04610855
046109                                                                  04610951
046110****************************************************************  04611051
046111* CALCULATE CPS-AVERAGES                                       *  04611151
046112****************************************************************  04611251
046113 3055-CALC-CPS-AVERAGES.                                          04611351
046114                                                                  04611451
046115     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04611551
046116                             PV-TRIP-CLOSE-TO-SHIP-AVG            04611651
046117                             PV-TRIP-OPEN-TO-SHIP-AVG             04611751
046118                             PV-ARRIVE-TO-PRC-AVG                 04611851
046119                             PV-ARRIVE-TO-P2L-PKD-AVG             04611951
046120                             PV-PRC-TO-P2L-PKD-AVG                04612051
046121                             PV-P2L-PKD-TO-CLOSE-AVG              04612151
046122                             PV-P2L-OPEN-TO-CLOSE-AVG             04612251
046123                             PV-P2L-OPEN-TO-OTBND-AVG             04612351
046124                             PV-P2L-CLOSE-TO-OTBND-AVG            04612451
046125                             PV-ARRIVE-TO-OTBND-AVG               04612551
046126                             PV-PRC-TO-OTBND-AVG                  04612651
046127                             PV-ARRIVE-TO-TCLOS-AVG               04612751
046128                             PV-ARRIVE-TO-SHIP-AVG                04612851
046129                             PV-P2L-OPEN-TO-TCLOS-AVG             04612951
046130                             PV-P2L-OPEN-TO-SHIP-AVG              04613051
046131                             PV-P2L-CLOSE-TO-TCLOS-AVG            04613151
046132                             PV-P2L-CLOSE-TO-SHIP-AVG             04613251
046133                             PV-ARRIVE-TO-MSTR-AVG                04613351
046134                             PV-PRC-TO-MSTR-AVG                   04613451
046135                             PV-MSTR-CRE-TO-OTBND-AVG             04613551
046136                             PV-MSTR-CRE-TO-TCLOS-AVG             04613651
046137                             PV-MSTR-CRE-TO-SHIP-AVG              04613751
046138                             PV-MSTR-FIRST-TO-OTBND-AVG           04613851
046139                             PV-MSTR-FIRST-TO-TCLOS-AVG           04613951
046140                             PV-MSTR-FIRST-TO-SHIP-AVG            04614051
046141                             PV-MSTR-LAST-TO-OTBND-AVG            04614151
046142                             PV-MSTR-LAST-TO-TCLOS-AVG            04614251
046143                             PV-MSTR-LAST-TO-SHIP-AVG             04614351
046144                             PV-ON-OTBND-TO-CLOS-AVG              04614451
046145                             PV-ON-OTBND-TO-SHIP-AVG              04614551
046146                             PV-TRIP-OPEN-TO-CLOSE-DAY            04614651
046147                             PV-TRIP-CLOSE-TO-SHIP-DAY            04614751
046148                             PV-TRIP-OPEN-TO-SHIP-DAY             04614851
046149                             PV-ARRIVE-TO-PRC-DAY                 04614951
046150                             PV-ARRIVE-TO-P2L-PKD-DAY             04615051
046151                             PV-PRC-TO-P2L-PKD-DAY                04615151
046152                             PV-P2L-PKD-TO-CLOSE-DAY              04615251
046153                             PV-P2L-OPEN-TO-CLOSE-DAY             04615351
046154                             PV-P2L-OPEN-TO-OTBND-DAY             04615451
046155                             PV-P2L-CLOSE-TO-OTBND-DAY            04615551
046156                             PV-ARRIVE-TO-OTBND-DAY               04615651
046157                             PV-PRC-TO-OTBND-DAY                  04615751
046158                             PV-ARRIVE-TO-TCLOS-DAY               04615851
046159                             PV-ARRIVE-TO-SHIP-DAY                04615951
046160                             PV-P2L-OPEN-TO-TCLOS-DAY             04616051
046161                             PV-P2L-OPEN-TO-SHIP-DAY              04616151
046162                             PV-P2L-CLOSE-TO-TCLOS-DAY            04616251
046163                             PV-P2L-CLOSE-TO-SHIP-DAY             04616351
046164                             PV-ARRIVE-TO-MSTR-DAY                04616451
046165                             PV-PRC-TO-MSTR-DAY                   04616551
046166                             PV-MSTR-CRE-TO-OTBND-DAY             04616651
046167                             PV-MSTR-CRE-TO-TCLOS-DAY             04616751
046168                             PV-MSTR-CRE-TO-SHIP-DAY              04616851
046169                             PV-MSTR-FIRST-TO-OTBND-DAY           04616951
046170                             PV-MSTR-FIRST-TO-TCLOS-DAY           04617051
046171                             PV-MSTR-FIRST-TO-SHIP-DAY            04617151
046172                             PV-MSTR-LAST-TO-OTBND-DAY            04617251
046173                             PV-MSTR-LAST-TO-TCLOS-DAY            04617351
046174                             PV-MSTR-LAST-TO-SHIP-DAY             04617451
046175                             PV-ON-OTBND-TO-CLOS-DAY              04617551
046176                             PV-ON-OTBND-TO-SHIP-DAY.             04617651
046177                                                                  04617751
046178     IF  PV-CPS-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04617851
046179         PV-CPS-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04617951
046180         DIVIDE  PV-CPS-TRIP-OPEN-TO-CLOSE-MIN                    04618051
046181             BY  PV-CPS-TRIP-OPEN-TO-CLOSE-CNT                    04618151
046182         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04618251
046183                 ROUNDED                                          04618351
046184         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04618451
046185             BY  1440                                             04618551
046186         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04618651
046187                 ROUNDED                                          04618751
046188     ELSE                                                         04618851
046189         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04618951
046190                           PV-TRIP-OPEN-TO-CLOSE-DAY              04619051
046191     END-IF.                                                      04619151
046192                                                                  04619251
046193     IF  PV-CPS-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04619351
046194         PV-CPS-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04619451
046195         DIVIDE  PV-CPS-TRIP-CLOSE-TO-SHIP-MIN                    04619551
046196             BY  PV-CPS-TRIP-CLOSE-TO-SHIP-CNT                    04619651
046197         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04619751
046198                 ROUNDED                                          04619851
046199         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04619951
046200             BY  1440                                             04620051
046201         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04620151
046202                 ROUNDED                                          04620251
046203     ELSE                                                         04620351
046204         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04620451
046205                           PV-TRIP-CLOSE-TO-SHIP-DAY              04620551
046206     END-IF.                                                      04620651
046207                                                                  04620751
046208     IF  PV-CPS-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04620851
046209         PV-CPS-TRIP-OPEN-TO-SHIP-CNT  >  0                       04620951
046210         DIVIDE  PV-CPS-TRIP-OPEN-TO-SHIP-MIN                     04621051
046211             BY  PV-CPS-TRIP-OPEN-TO-SHIP-CNT                     04621151
046212         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04621251
046213                 ROUNDED                                          04621351
046214         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04621451
046215             BY  1440                                             04621551
046216         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04621651
046217                 ROUNDED                                          04621751
046218     ELSE                                                         04621851
046219         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04621951
046220                           PV-TRIP-OPEN-TO-SHIP-DAY               04622051
046221     END-IF.                                                      04622151
046222                                                                  04622251
046223                                                                  04622351
046224     IF  PV-CPS-ARRIVE-TO-PRC-MIN  >  0  AND                      04622451
046225         PV-CPS-ARRIVE-TO-PRC-CNT  >  0                           04622551
046226         DIVIDE PV-CPS-ARRIVE-TO-PRC-MIN                          04622651
046227             BY PV-CPS-ARRIVE-TO-PRC-CNT                          04622751
046228         GIVING PV-ARRIVE-TO-PRC-AVG                              04622851
046229                 ROUNDED                                          04622951
046230         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04623051
046231             BY 1440                                              04623151
046232         GIVING PV-ARRIVE-TO-PRC-DAY                              04623251
046233                 ROUNDED                                          04623351
046234     ELSE                                                         04623451
046235         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04623551
046236                           PV-ARRIVE-TO-PRC-DAY                   04623651
046237     END-IF.                                                      04623751
046238                                                                  04623851
046239     IF  PV-CPS-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04623951
046240         PV-CPS-ARRIVE-TO-P2L-PKD-CNT  >  0                       04624051
046241         DIVIDE PV-CPS-ARRIVE-TO-P2L-PKD-MIN                      04624151
046242             BY PV-CPS-ARRIVE-TO-P2L-PKD-CNT                      04624251
046243         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04624351
046244                 ROUNDED                                          04624451
046245         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04624551
046246             BY 1440                                              04624651
046247         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04624751
046248                 ROUNDED                                          04624851
046249     ELSE                                                         04624951
046250         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04625051
046251                           PV-ARRIVE-TO-P2L-PKD-DAY               04625151
046252     END-IF.                                                      04625251
046253                                                                  04625351
046254                                                                  04625451
046255     IF  PV-CPS-PRC-TO-P2L-PKD-MIN  >  0  AND                     04625551
046256         PV-CPS-PRC-TO-P2L-PKD-CNT  >  0                          04625651
046257         DIVIDE PV-CPS-PRC-TO-P2L-PKD-MIN                         04625751
046258             BY PV-CPS-PRC-TO-P2L-PKD-CNT                         04625851
046259         GIVING PV-PRC-TO-P2L-PKD-AVG                             04625951
046260                 ROUNDED                                          04626051
046261         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04626151
046262             BY 1440                                              04626251
046263         GIVING PV-PRC-TO-P2L-PKD-DAY                             04626351
046264                 ROUNDED                                          04626451
046265     ELSE                                                         04626551
046266         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04626651
046267                           PV-PRC-TO-P2L-PKD-DAY                  04626751
046268     END-IF.                                                      04626851
046269                                                                  04626951
046270     IF  PV-CPS-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04627051
046271         PV-CPS-P2L-PKD-TO-CLOSE-CNT  >  0                        04627151
046272         DIVIDE PV-CPS-P2L-PKD-TO-CLOSE-MIN                       04627251
046273             BY PV-CPS-P2L-PKD-TO-CLOSE-CNT                       04627351
046274         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04627451
046275                 ROUNDED                                          04627551
046276         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04627651
046277             BY 1440                                              04627751
046278         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04627851
046279                 ROUNDED                                          04627951
046280     ELSE                                                         04628051
046281         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04628151
046282                           PV-P2L-PKD-TO-CLOSE-DAY                04628251
046283     END-IF.                                                      04628351
046284                                                                  04628451
046285     IF  PV-CPS-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04628551
046286         PV-CPS-P2L-OPEN-TO-CLOSE-CNT  >  0                       04628651
046287         DIVIDE PV-CPS-P2L-OPEN-TO-CLOSE-MIN                      04628751
046288             BY PV-CPS-P2L-OPEN-TO-CLOSE-CNT                      04628851
046289         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04628951
046290                 ROUNDED                                          04629051
046291         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04629151
046292             BY 1440                                              04629251
046293         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04629351
046294                 ROUNDED                                          04629451
046295     ELSE                                                         04629551
046296         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04629651
046297                           PV-P2L-OPEN-TO-CLOSE-DAY               04629751
046298     END-IF.                                                      04629851
046299                                                                  04629951
046300     IF  PV-CPS-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04630051
046301         PV-CPS-P2L-OPEN-TO-OTBND-CNT  >  0                       04630151
046302         DIVIDE PV-CPS-P2L-OPEN-TO-OTBND-MIN                      04630251
046303             BY PV-CPS-P2L-OPEN-TO-OTBND-CNT                      04630351
046304         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04630451
046305                 ROUNDED                                          04630551
046306         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04630651
046307             BY 1440                                              04630751
046308         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04630851
046309                 ROUNDED                                          04630951
046310     ELSE                                                         04631051
046311         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04631151
046312                           PV-P2L-OPEN-TO-OTBND-DAY               04631251
046313     END-IF.                                                      04631351
046314                                                                  04631451
046315     IF  PV-CPS-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04631551
046316         PV-CPS-P2L-CLOSE-TO-OTBND-CNT  >  0                      04631651
046317         DIVIDE PV-CPS-P2L-CLOSE-TO-OTBND-MIN                     04631751
046318             BY PV-CPS-P2L-CLOSE-TO-OTBND-CNT                     04631851
046319         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04631951
046320                 ROUNDED                                          04632051
046321         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04632151
046322             BY 1440                                              04632251
046323         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04632351
046324                 ROUNDED                                          04632451
046325     ELSE                                                         04632551
046326         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04632651
046327                           PV-P2L-CLOSE-TO-OTBND-DAY              04632751
046328     END-IF.                                                      04632851
046329                                                                  04632951
046330     IF  PV-CPS-ARRIVE-TO-OTBND-MIN  >  0  AND                    04633051
046331         PV-CPS-ARRIVE-TO-OTBND-CNT  >  0                         04633151
046332         DIVIDE PV-CPS-ARRIVE-TO-OTBND-MIN                        04633251
046333             BY PV-CPS-ARRIVE-TO-OTBND-CNT                        04633351
046334         GIVING PV-ARRIVE-TO-OTBND-AVG                            04633451
046335                 ROUNDED                                          04633551
046336         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04633651
046337             BY 1440                                              04633751
046338         GIVING PV-ARRIVE-TO-OTBND-DAY                            04633851
046339                 ROUNDED                                          04633951
046340     ELSE                                                         04634051
046341         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04634151
046342                           PV-ARRIVE-TO-OTBND-DAY                 04634251
046343     END-IF.                                                      04634351
046344                                                                  04634451
046345     IF  PV-CPS-PRC-TO-OTBND-MIN  >  0  AND                       04634551
046346         PV-CPS-PRC-TO-OTBND-CNT  >  0                            04634651
046347         DIVIDE PV-CPS-PRC-TO-OTBND-MIN                           04634751
046348             BY PV-CPS-PRC-TO-OTBND-CNT                           04634851
046349         GIVING PV-PRC-TO-OTBND-AVG                               04634951
046350                 ROUNDED                                          04635051
046351         DIVIDE PV-PRC-TO-OTBND-AVG                               04635151
046352             BY 1440                                              04635251
046353         GIVING PV-PRC-TO-OTBND-DAY                               04635351
046354                 ROUNDED                                          04635451
046355     ELSE                                                         04635551
046356         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04635651
046357                           PV-PRC-TO-OTBND-DAY                    04635751
046358     END-IF.                                                      04635851
046359                                                                  04635951
046360     IF  PV-CPS-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04636051
046361         PV-CPS-ARRIVE-TO-TCLOS-CNT  >  0                         04636151
046362         DIVIDE PV-CPS-ARRIVE-TO-TCLOS-MIN                        04636251
046363             BY PV-CPS-ARRIVE-TO-TCLOS-CNT                        04636351
046364         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04636451
046365                 ROUNDED                                          04636551
046366         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04636651
046367             BY 1440                                              04636751
046368         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04636851
046369                 ROUNDED                                          04636951
046370     ELSE                                                         04637051
046371         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04637151
046372                           PV-ARRIVE-TO-TCLOS-DAY                 04637251
046373     END-IF.                                                      04637351
046374                                                                  04637451
046375     IF  PV-CPS-ARRIVE-TO-SHIP-MIN  >  0  AND                     04637551
046376         PV-CPS-ARRIVE-TO-SHIP-CNT  >  0                          04637651
046377         DIVIDE PV-CPS-ARRIVE-TO-SHIP-MIN                         04637751
046378             BY PV-CPS-ARRIVE-TO-SHIP-CNT                         04637851
046379         GIVING PV-ARRIVE-TO-SHIP-AVG                             04637951
046380                 ROUNDED                                          04638051
046381         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04638151
046382             BY 1440                                              04638251
046383         GIVING PV-ARRIVE-TO-SHIP-DAY                             04638351
046384                 ROUNDED                                          04638451
046385     ELSE                                                         04638551
046386         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04638651
046387                           PV-ARRIVE-TO-SHIP-DAY                  04638751
046388     END-IF.                                                      04638851
046389                                                                  04638951
046390     IF  PV-CPS-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04639051
046391         PV-CPS-P2L-OPEN-TO-TCLOS-CNT  >  0                       04639151
046392         DIVIDE PV-CPS-P2L-OPEN-TO-TCLOS-MIN                      04639251
046393             BY PV-CPS-P2L-OPEN-TO-TCLOS-CNT                      04639351
046394         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04639451
046395                 ROUNDED                                          04639551
046396         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04639651
046397             BY 1440                                              04639751
046398         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04639851
046399                 ROUNDED                                          04639951
046400     ELSE                                                         04640051
046401         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04640151
046402                           PV-P2L-OPEN-TO-TCLOS-DAY               04640251
046403     END-IF.                                                      04640351
046404                                                                  04640451
046405     IF  PV-CPS-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04640551
046406         PV-CPS-P2L-OPEN-TO-SHIP-CNT  >  0                        04640651
046407         DIVIDE PV-CPS-P2L-OPEN-TO-SHIP-MIN                       04640751
046408             BY PV-CPS-P2L-OPEN-TO-SHIP-CNT                       04640851
046409         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04640951
046410                 ROUNDED                                          04641051
046411         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04641151
046412             BY 1440                                              04641251
046413         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04641351
046414                 ROUNDED                                          04641451
046415     ELSE                                                         04641551
046416         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04641651
046417                           PV-P2L-OPEN-TO-SHIP-DAY                04641751
046418     END-IF.                                                      04641851
046419                                                                  04641951
046420     IF  PV-CPS-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04642051
046421         PV-CPS-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04642151
046422         DIVIDE PV-CPS-P2L-CLOSE-TO-TCLOS-MIN                     04642251
046423             BY PV-CPS-P2L-CLOSE-TO-TCLOS-CNT                     04642351
046424         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04642451
046425                 ROUNDED                                          04642551
046426         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04642651
046427             BY 1440                                              04642751
046428         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04642851
046429                 ROUNDED                                          04642951
046430     ELSE                                                         04643051
046431         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04643151
046432                           PV-P2L-CLOSE-TO-TCLOS-DAY              04643251
046433     END-IF.                                                      04643351
046434                                                                  04643451
046435     IF  PV-CPS-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04643551
046436         PV-CPS-P2L-CLOSE-TO-SHIP-CNT  >  0                       04643651
046437         DIVIDE PV-CPS-P2L-CLOSE-TO-SHIP-MIN                      04643751
046438             BY PV-CPS-P2L-CLOSE-TO-SHIP-CNT                      04643851
046439         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04643951
046440                 ROUNDED                                          04644051
046441         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04644151
046442             BY 1440                                              04644251
046443         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04644351
046444                 ROUNDED                                          04644451
046445     ELSE                                                         04644551
046446         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04644651
046447                           PV-P2L-CLOSE-TO-SHIP-DAY               04644751
046448     END-IF.                                                      04644851
046449                                                                  04644951
046450     IF  PV-CPS-ARRIVE-TO-MSTR-MIN  >  0  AND                     04645051
046451         PV-CPS-ARRIVE-TO-MSTR-CNT  >  0                          04645151
046452         DIVIDE PV-CPS-ARRIVE-TO-MSTR-MIN                         04645251
046453             BY PV-CPS-ARRIVE-TO-MSTR-CNT                         04645351
046454         GIVING PV-ARRIVE-TO-MSTR-AVG                             04645451
046455                 ROUNDED                                          04645551
046456         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04645651
046457             BY 1440                                              04645751
046458         GIVING PV-ARRIVE-TO-MSTR-DAY                             04645851
046459                 ROUNDED                                          04645951
046460     ELSE                                                         04646051
046461         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04646151
046462                           PV-ARRIVE-TO-MSTR-DAY                  04646251
046463     END-IF.                                                      04646351
046464                                                                  04646451
046465     IF  PV-CPS-PRC-TO-MSTR-MIN  >  0  AND                        04646551
046466         PV-CPS-PRC-TO-MSTR-CNT  >  0                             04646651
046467         DIVIDE PV-CPS-PRC-TO-MSTR-MIN                            04646751
046468             BY PV-CPS-PRC-TO-MSTR-CNT                            04646851
046469         GIVING PV-PRC-TO-MSTR-AVG                                04646951
046470                 ROUNDED                                          04647051
046471         DIVIDE PV-PRC-TO-MSTR-AVG                                04647151
046472             BY 1440                                              04647251
046473         GIVING PV-PRC-TO-MSTR-DAY                                04647351
046474                 ROUNDED                                          04647451
046475     ELSE                                                         04647551
046476         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04647651
046477                           PV-PRC-TO-MSTR-DAY                     04647751
046478     END-IF.                                                      04647851
046479                                                                  04647951
046480     IF  PV-CPS-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04648051
046481         PV-CPS-ON-OTBND-TO-CLOS-CNT  >  0                        04648151
046482         DIVIDE PV-CPS-ON-OTBND-TO-CLOS-MIN                       04648251
046483             BY PV-CPS-ON-OTBND-TO-CLOS-CNT                       04648351
046484         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04648451
046485                 ROUNDED                                          04648551
046486         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04648651
046487             BY 1440                                              04648751
046488         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04648851
046489                 ROUNDED                                          04648951
046490     ELSE                                                         04649051
046491         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04649151
046492                           PV-ON-OTBND-TO-CLOS-DAY                04649251
046493     END-IF.                                                      04649351
046494                                                                  04649451
046495     IF  PV-CPS-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04649551
046496         PV-CPS-ON-OTBND-TO-SHIP-CNT  >  0                        04649651
046497         DIVIDE PV-CPS-ON-OTBND-TO-SHIP-MIN                       04649751
046498             BY PV-CPS-ON-OTBND-TO-SHIP-CNT                       04649851
046499         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04649951
046500                 ROUNDED                                          04650051
046501         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04650151
046502             BY 1440                                              04650251
046503         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04650351
046504                 ROUNDED                                          04650451
046505     ELSE                                                         04650551
046506         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04650651
046507                           PV-ON-OTBND-TO-SHIP-DAY                04650751
046508     END-IF.                                                      04650851
046509                                                                  04650951
046510     IF  PV-CPS-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04651051
046511         PV-CPS-MSTR-CRE-TO-OTBND-CNT  >  0                       04651151
046512         DIVIDE PV-CPS-MSTR-CRE-TO-OTBND-MIN                      04651251
046513             BY PV-CPS-MSTR-CRE-TO-OTBND-CNT                      04651351
046514         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04651451
046515                 ROUNDED                                          04651551
046516         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04651651
046517             BY 1440                                              04651751
046518         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04651851
046519                 ROUNDED                                          04651951
046520     ELSE                                                         04652051
046521         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04652151
046522                           PV-MSTR-CRE-TO-OTBND-DAY               04652251
046523     END-IF.                                                      04652351
046524                                                                  04652451
046525     IF  PV-CPS-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04652551
046526         PV-CPS-MSTR-CRE-TO-TCLOS-CNT  >  0                       04652651
046527         DIVIDE PV-CPS-MSTR-CRE-TO-TCLOS-MIN                      04652751
046528             BY PV-CPS-MSTR-CRE-TO-TCLOS-CNT                      04652851
046529         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04652951
046530                 ROUNDED                                          04653051
046531         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04653151
046532             BY 1440                                              04653251
046533         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04653351
046534                 ROUNDED                                          04653451
046535     ELSE                                                         04653551
046536         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04653651
046537                           PV-MSTR-CRE-TO-TCLOS-DAY               04653751
046538     END-IF.                                                      04653851
046539                                                                  04653951
046540     IF  PV-CPS-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04654051
046541         PV-CPS-MSTR-CRE-TO-SHIP-CNT  >  0                        04654151
046542         DIVIDE PV-CPS-MSTR-CRE-TO-SHIP-MIN                       04654251
046543             BY PV-CPS-MSTR-CRE-TO-SHIP-CNT                       04654351
046544         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04654451
046545                 ROUNDED                                          04654551
046546         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04654651
046547             BY 1440                                              04654751
046548         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04654851
046549                 ROUNDED                                          04654951
046550     ELSE                                                         04655051
046551         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04655151
046552                           PV-MSTR-CRE-TO-SHIP-DAY                04655251
046553     END-IF.                                                      04655351
046554                                                                  04655451
046555     IF  PV-CPS-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04655551
046556         PV-CPS-MSTR-FIRST-TO-OTBND-CNT  >  0                     04655651
046557         DIVIDE PV-CPS-MSTR-FIRST-TO-OTBND-MIN                    04655751
046558             BY PV-CPS-MSTR-FIRST-TO-OTBND-CNT                    04655851
046559         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04655951
046560                 ROUNDED                                          04656051
046561         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04656151
046562             BY 1440                                              04656251
046563         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04656351
046564                 ROUNDED                                          04656451
046565     ELSE                                                         04656551
046566         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04656651
046567                           PV-MSTR-FIRST-TO-OTBND-DAY             04656751
046568     END-IF.                                                      04656851
046569                                                                  04656951
046570     IF  PV-CPS-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04657051
046571         PV-CPS-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04657151
046572         DIVIDE PV-CPS-MSTR-FIRST-TO-TCLOS-MIN                    04657251
046573             BY PV-CPS-MSTR-FIRST-TO-TCLOS-CNT                    04657351
046574         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04657451
046575                 ROUNDED                                          04657551
046576         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04657651
046577             BY 1440                                              04657751
046578         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04657851
046579                 ROUNDED                                          04657951
046580     ELSE                                                         04658051
046581         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04658151
046582                           PV-MSTR-FIRST-TO-TCLOS-DAY             04658251
046583     END-IF.                                                      04658351
046584                                                                  04658451
046585     IF  PV-CPS-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04658551
046586         PV-CPS-MSTR-FIRST-TO-SHIP-CNT  >  0                      04658651
046587         DIVIDE PV-CPS-MSTR-FIRST-TO-SHIP-MIN                     04658751
046588             BY PV-CPS-MSTR-FIRST-TO-SHIP-CNT                     04658851
046589         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04658951
046590                 ROUNDED                                          04659051
046591         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04659151
046592             BY 1440                                              04659251
046593         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04659351
046594                 ROUNDED                                          04659451
046595     ELSE                                                         04659551
046596         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04659651
046597                           PV-MSTR-FIRST-TO-SHIP-DAY              04659751
046598     END-IF.                                                      04659851
046599                                                                  04659951
046600     IF  PV-CPS-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04660051
046601         PV-CPS-MSTR-LAST-TO-OTBND-CNT  >  0                      04660151
046602         DIVIDE PV-CPS-MSTR-LAST-TO-OTBND-MIN                     04660251
046603             BY PV-CPS-MSTR-LAST-TO-OTBND-CNT                     04660351
046604         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04660451
046605                 ROUNDED                                          04660551
046606         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04660651
046607             BY 1440                                              04660751
046608         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04660851
046609                 ROUNDED                                          04660951
046610     ELSE                                                         04661051
046611         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04661151
046612                           PV-MSTR-LAST-TO-OTBND-DAY              04661251
046613     END-IF.                                                      04661351
046614                                                                  04661451
046615     IF  PV-CPS-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04661551
046616         PV-CPS-MSTR-LAST-TO-TCLOS-CNT  >  0                      04661651
046617         DIVIDE PV-CPS-MSTR-LAST-TO-TCLOS-MIN                     04661751
046618             BY PV-CPS-MSTR-LAST-TO-TCLOS-CNT                     04661851
046619         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04661951
046620                 ROUNDED                                          04662051
046621         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04662151
046622             BY 1440                                              04662251
046623         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04662351
046624                 ROUNDED                                          04662451
046625     ELSE                                                         04662551
046626         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04662651
046627                           PV-MSTR-LAST-TO-TCLOS-DAY              04662751
046628     END-IF.                                                      04662851
046629                                                                  04662951
046630     IF  PV-CPS-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04663051
046631         PV-CPS-MSTR-LAST-TO-SHIP-CNT  >  0                       04663151
046632         DIVIDE PV-CPS-MSTR-LAST-TO-SHIP-MIN                      04663251
046633             BY PV-CPS-MSTR-LAST-TO-SHIP-CNT                      04663351
046634         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04663451
046635                 ROUNDED                                          04663551
046636         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04663651
046637             BY 1440                                              04663751
046638         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04663851
046639                 ROUNDED                                          04663951
046640     ELSE                                                         04664051
046641         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04664151
046642                           PV-MSTR-LAST-TO-SHIP-DAY               04664251
046643     END-IF.                                                      04664351
046644*                                                                 04664473
046645*** 8/19                                                          04664573
046646*                                                                 04664673
046647     IF  PV-CPS-TRIP-CARTONS            >  0  AND                 04664773
046648         PV-CPS-TRIP-SRC-CARTONS        >  0                      04664873
046649         DIVIDE  PV-CPS-TRIP-SRC-CARTONS                          04664973
046650             BY  PV-CPS-TRIP-CARTONS                              04665073
046651         GIVING  PV-TRIP-SRC-CRTN                                 04665173
046652                   ROUNDED                                        04665299
046653         MULTIPLY  PV-TRIP-SRC-CRTN                               04665373
046654               BY  100                                            04665473
046655           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04665573
046657     ELSE                                                         04665773
046658         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04665873
046659                           PV-TRIP-SRC-CRTN                       04665973
046660     END-IF.                                                      04666073
046661                                                                  04666173
046662                                                                  04666251
046663     MOVE ZEROES                TO DL3-DC-NBR                     04666355
046664     MOVE 'CORP OVERALL    '    TO DL3-DC-NAME                    04666453
046665     MOVE 'MANUAL XDOCX    '    TO DL3-SOURCE                     04666553
046666     PERFORM 5050-PRINT-CORP-TOTALS.                              04666653
046667                                                                  04666753
046668                                                                  04666853
046669****************************************************************  04666953
046670* CALCULATE SMO-AVERAGES                                       *  04667053
046671****************************************************************  04667153
046672 3060-CALC-SMO-AVERAGES.                                          04667253
046673                                                                  04667353
046674     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04667453
046675                             PV-TRIP-CLOSE-TO-SHIP-AVG            04667553
046676                             PV-TRIP-OPEN-TO-SHIP-AVG             04667653
046677                             PV-ARRIVE-TO-PRC-AVG                 04667753
046678                             PV-ARRIVE-TO-P2L-PKD-AVG             04667853
046679                             PV-PRC-TO-P2L-PKD-AVG                04667953
046680                             PV-P2L-PKD-TO-CLOSE-AVG              04668053
046681                             PV-P2L-OPEN-TO-CLOSE-AVG             04668153
046682                             PV-P2L-OPEN-TO-OTBND-AVG             04668253
046683                             PV-P2L-CLOSE-TO-OTBND-AVG            04668353
046684                             PV-ARRIVE-TO-OTBND-AVG               04668453
046685                             PV-PRC-TO-OTBND-AVG                  04668553
046686                             PV-ARRIVE-TO-TCLOS-AVG               04668653
046687                             PV-ARRIVE-TO-SHIP-AVG                04668753
046688                             PV-P2L-OPEN-TO-TCLOS-AVG             04668853
046689                             PV-P2L-OPEN-TO-SHIP-AVG              04668953
046690                             PV-P2L-CLOSE-TO-TCLOS-AVG            04669053
046691                             PV-P2L-CLOSE-TO-SHIP-AVG             04669153
046692                             PV-ARRIVE-TO-MSTR-AVG                04669253
046693                             PV-PRC-TO-MSTR-AVG                   04669353
046694                             PV-MSTR-CRE-TO-OTBND-AVG             04669453
046695                             PV-MSTR-CRE-TO-TCLOS-AVG             04669553
046696                             PV-MSTR-CRE-TO-SHIP-AVG              04669653
046697                             PV-MSTR-FIRST-TO-OTBND-AVG           04669753
046698                             PV-MSTR-FIRST-TO-TCLOS-AVG           04669853
046699                             PV-MSTR-FIRST-TO-SHIP-AVG            04669953
046700                             PV-MSTR-LAST-TO-OTBND-AVG            04670053
046701                             PV-MSTR-LAST-TO-TCLOS-AVG            04670153
046702                             PV-MSTR-LAST-TO-SHIP-AVG             04670253
046703                             PV-ON-OTBND-TO-CLOS-AVG              04670353
046704                             PV-ON-OTBND-TO-SHIP-AVG              04670453
046705                             PV-TRIP-OPEN-TO-CLOSE-DAY            04670553
046706                             PV-TRIP-CLOSE-TO-SHIP-DAY            04670653
046707                             PV-TRIP-OPEN-TO-SHIP-DAY             04670753
046708                             PV-ARRIVE-TO-PRC-DAY                 04670853
046709                             PV-ARRIVE-TO-P2L-PKD-DAY             04670953
046710                             PV-PRC-TO-P2L-PKD-DAY                04671053
046711                             PV-P2L-PKD-TO-CLOSE-DAY              04671153
046712                             PV-P2L-OPEN-TO-CLOSE-DAY             04671253
046713                             PV-P2L-OPEN-TO-OTBND-DAY             04671353
046714                             PV-P2L-CLOSE-TO-OTBND-DAY            04671453
046715                             PV-ARRIVE-TO-OTBND-DAY               04671553
046716                             PV-PRC-TO-OTBND-DAY                  04671653
046717                             PV-ARRIVE-TO-TCLOS-DAY               04671753
046718                             PV-ARRIVE-TO-SHIP-DAY                04671853
046719                             PV-P2L-OPEN-TO-TCLOS-DAY             04671953
046720                             PV-P2L-OPEN-TO-SHIP-DAY              04672053
046721                             PV-P2L-CLOSE-TO-TCLOS-DAY            04672153
046722                             PV-P2L-CLOSE-TO-SHIP-DAY             04672253
046723                             PV-ARRIVE-TO-MSTR-DAY                04672353
046724                             PV-PRC-TO-MSTR-DAY                   04672453
046725                             PV-MSTR-CRE-TO-OTBND-DAY             04672553
046726                             PV-MSTR-CRE-TO-TCLOS-DAY             04672653
046727                             PV-MSTR-CRE-TO-SHIP-DAY              04672753
046728                             PV-MSTR-FIRST-TO-OTBND-DAY           04672853
046729                             PV-MSTR-FIRST-TO-TCLOS-DAY           04672953
046730                             PV-MSTR-FIRST-TO-SHIP-DAY            04673053
046731                             PV-MSTR-LAST-TO-OTBND-DAY            04673153
046732                             PV-MSTR-LAST-TO-TCLOS-DAY            04673253
046733                             PV-MSTR-LAST-TO-SHIP-DAY             04673353
046734                             PV-ON-OTBND-TO-CLOS-DAY              04673453
046735                             PV-ON-OTBND-TO-SHIP-DAY.             04673553
046736                                                                  04673653
046737     IF  PV-SMO-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04673753
046738         PV-SMO-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04673853
046739         DIVIDE  PV-SMO-TRIP-OPEN-TO-CLOSE-MIN                    04673953
046740             BY  PV-SMO-TRIP-OPEN-TO-CLOSE-CNT                    04674053
046741         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04674153
046742                 ROUNDED                                          04674253
046743         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04674353
046744             BY  1440                                             04674453
046745         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04674553
046746                 ROUNDED                                          04674653
046747     ELSE                                                         04674753
046748         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04674853
046749                           PV-TRIP-OPEN-TO-CLOSE-DAY              04674953
046750     END-IF.                                                      04675053
046751                                                                  04675153
046752     IF  PV-SMO-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04675253
046753         PV-SMO-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04675353
046754         DIVIDE  PV-SMO-TRIP-CLOSE-TO-SHIP-MIN                    04675453
046755             BY  PV-SMO-TRIP-CLOSE-TO-SHIP-CNT                    04675553
046756         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04675653
046757                 ROUNDED                                          04675753
046758         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04675853
046759             BY  1440                                             04675953
046760         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04676053
046761                 ROUNDED                                          04676153
046762     ELSE                                                         04676253
046763         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04676353
046764                           PV-TRIP-CLOSE-TO-SHIP-DAY              04676453
046765     END-IF.                                                      04676553
046766                                                                  04676653
046767     IF  PV-SMO-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04676753
046768         PV-SMO-TRIP-OPEN-TO-SHIP-CNT  >  0                       04676853
046769         DIVIDE  PV-SMO-TRIP-OPEN-TO-SHIP-MIN                     04676953
046770             BY  PV-SMO-TRIP-OPEN-TO-SHIP-CNT                     04677053
046771         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04677153
046772                 ROUNDED                                          04677253
046773         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04677353
046774             BY  1440                                             04677453
046775         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04677553
046776                 ROUNDED                                          04677653
046777     ELSE                                                         04677753
046778         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04677853
046779                           PV-TRIP-OPEN-TO-SHIP-DAY               04677953
046780     END-IF.                                                      04678053
046781                                                                  04678153
046782                                                                  04678253
046783     IF  PV-SMO-ARRIVE-TO-PRC-MIN  >  0  AND                      04678353
046784         PV-SMO-ARRIVE-TO-PRC-CNT  >  0                           04678453
046785         DIVIDE PV-SMO-ARRIVE-TO-PRC-MIN                          04678553
046786             BY PV-SMO-ARRIVE-TO-PRC-CNT                          04678653
046787         GIVING PV-ARRIVE-TO-PRC-AVG                              04678753
046788                 ROUNDED                                          04678853
046789         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04678953
046790             BY 1440                                              04679053
046791         GIVING PV-ARRIVE-TO-PRC-DAY                              04679153
046792                 ROUNDED                                          04679253
046793     ELSE                                                         04679353
046794         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04679453
046795                           PV-ARRIVE-TO-PRC-DAY                   04679553
046796     END-IF.                                                      04679653
046797                                                                  04679753
046798     IF  PV-SMO-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04679853
046799         PV-SMO-ARRIVE-TO-P2L-PKD-CNT  >  0                       04679953
046800         DIVIDE PV-SMO-ARRIVE-TO-P2L-PKD-MIN                      04680053
046801             BY PV-SMO-ARRIVE-TO-P2L-PKD-CNT                      04680153
046802         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04680253
046803                 ROUNDED                                          04680353
046804         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04680453
046805             BY 1440                                              04680553
046806         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04680653
046807                 ROUNDED                                          04680753
046808     ELSE                                                         04680853
046809         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04680953
046810                           PV-ARRIVE-TO-P2L-PKD-DAY               04681053
046811     END-IF.                                                      04681153
046812                                                                  04681253
046813                                                                  04681353
046814     IF  PV-SMO-PRC-TO-P2L-PKD-MIN  >  0  AND                     04681453
046815         PV-SMO-PRC-TO-P2L-PKD-CNT  >  0                          04681553
046816         DIVIDE PV-SMO-PRC-TO-P2L-PKD-MIN                         04681653
046817             BY PV-SMO-PRC-TO-P2L-PKD-CNT                         04681753
046818         GIVING PV-PRC-TO-P2L-PKD-AVG                             04681853
046819                 ROUNDED                                          04681953
046820         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04682053
046821             BY 1440                                              04682153
046822         GIVING PV-PRC-TO-P2L-PKD-DAY                             04682253
046823                 ROUNDED                                          04682353
046824     ELSE                                                         04682453
046825         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04682553
046826                           PV-PRC-TO-P2L-PKD-DAY                  04682653
046827     END-IF.                                                      04682753
046828                                                                  04682853
046829     IF  PV-SMO-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04682953
046830         PV-SMO-P2L-PKD-TO-CLOSE-CNT  >  0                        04683053
046831         DIVIDE PV-SMO-P2L-PKD-TO-CLOSE-MIN                       04683153
046832             BY PV-SMO-P2L-PKD-TO-CLOSE-CNT                       04683253
046833         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04683353
046834                 ROUNDED                                          04683453
046835         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04683553
046836             BY 1440                                              04683653
046837         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04683753
046838                 ROUNDED                                          04683853
046839     ELSE                                                         04683953
046840         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04684053
046841                           PV-P2L-PKD-TO-CLOSE-DAY                04684153
046842     END-IF.                                                      04684253
046843                                                                  04684353
046844     IF  PV-SMO-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04684453
046845         PV-SMO-P2L-OPEN-TO-CLOSE-CNT  >  0                       04684553
046846         DIVIDE PV-SMO-P2L-OPEN-TO-CLOSE-MIN                      04684653
046847             BY PV-SMO-P2L-OPEN-TO-CLOSE-CNT                      04684753
046848         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04684853
046849                 ROUNDED                                          04684953
046850         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04685053
046851             BY 1440                                              04685153
046852         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04685253
046853                 ROUNDED                                          04685353
046854     ELSE                                                         04685453
046855         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04685553
046856                           PV-P2L-OPEN-TO-CLOSE-DAY               04685653
046857     END-IF.                                                      04685753
046858                                                                  04685853
046859     IF  PV-SMO-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04685953
046860         PV-SMO-P2L-OPEN-TO-OTBND-CNT  >  0                       04686053
046861         DIVIDE PV-SMO-P2L-OPEN-TO-OTBND-MIN                      04686153
046862             BY PV-SMO-P2L-OPEN-TO-OTBND-CNT                      04686253
046863         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04686353
046864                 ROUNDED                                          04686453
046865         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04686553
046866             BY 1440                                              04686653
046867         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04686753
046868                 ROUNDED                                          04686853
046869     ELSE                                                         04686953
046870         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04687053
046871                           PV-P2L-OPEN-TO-OTBND-DAY               04687153
046872     END-IF.                                                      04687253
046873                                                                  04687353
046874     IF  PV-SMO-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04687453
046875         PV-SMO-P2L-CLOSE-TO-OTBND-CNT  >  0                      04687553
046876         DIVIDE PV-SMO-P2L-CLOSE-TO-OTBND-MIN                     04687653
046877             BY PV-SMO-P2L-CLOSE-TO-OTBND-CNT                     04687753
046878         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04687853
046879                 ROUNDED                                          04687953
046880         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04688053
046881             BY 1440                                              04688153
046882         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04688253
046883                 ROUNDED                                          04688353
046884     ELSE                                                         04688453
046885         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04688553
046886                           PV-P2L-CLOSE-TO-OTBND-DAY              04688653
046887     END-IF.                                                      04688753
046888                                                                  04688853
046889     IF  PV-SMO-ARRIVE-TO-OTBND-MIN  >  0  AND                    04688953
046890         PV-SMO-ARRIVE-TO-OTBND-CNT  >  0                         04689053
046891         DIVIDE PV-SMO-ARRIVE-TO-OTBND-MIN                        04689153
046892             BY PV-SMO-ARRIVE-TO-OTBND-CNT                        04689253
046893         GIVING PV-ARRIVE-TO-OTBND-AVG                            04689353
046894                 ROUNDED                                          04689453
046895         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04689553
046896             BY 1440                                              04689653
046897         GIVING PV-ARRIVE-TO-OTBND-DAY                            04689753
046898                 ROUNDED                                          04689853
046899     ELSE                                                         04689953
046900         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04690053
046901                           PV-ARRIVE-TO-OTBND-DAY                 04690153
046902     END-IF.                                                      04690253
046903                                                                  04690353
046904     IF  PV-SMO-PRC-TO-OTBND-MIN  >  0  AND                       04690453
046905         PV-SMO-PRC-TO-OTBND-CNT  >  0                            04690553
046906         DIVIDE PV-SMO-PRC-TO-OTBND-MIN                           04690653
046907             BY PV-SMO-PRC-TO-OTBND-CNT                           04690753
046908         GIVING PV-PRC-TO-OTBND-AVG                               04690853
046909                 ROUNDED                                          04690953
046910         DIVIDE PV-PRC-TO-OTBND-AVG                               04691053
046911             BY 1440                                              04691153
046912         GIVING PV-PRC-TO-OTBND-DAY                               04691253
046913                 ROUNDED                                          04691353
046914     ELSE                                                         04691453
046915         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04691553
046916                           PV-PRC-TO-OTBND-DAY                    04691653
046917     END-IF.                                                      04691753
046918                                                                  04691853
046919     IF  PV-SMO-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04691953
046920         PV-SMO-ARRIVE-TO-TCLOS-CNT  >  0                         04692053
046921         DIVIDE PV-SMO-ARRIVE-TO-TCLOS-MIN                        04692153
046922             BY PV-SMO-ARRIVE-TO-TCLOS-CNT                        04692253
046923         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04692353
046924                 ROUNDED                                          04692453
046925         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04692553
046926             BY 1440                                              04692653
046927         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04692753
046928                 ROUNDED                                          04692853
046929     ELSE                                                         04692953
046930         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04693053
046931                           PV-ARRIVE-TO-TCLOS-DAY                 04693153
046932     END-IF.                                                      04693253
046933                                                                  04693353
046934     IF  PV-SMO-ARRIVE-TO-SHIP-MIN  >  0  AND                     04693453
046935         PV-SMO-ARRIVE-TO-SHIP-CNT  >  0                          04693553
046936         DIVIDE PV-SMO-ARRIVE-TO-SHIP-MIN                         04693653
046937             BY PV-SMO-ARRIVE-TO-SHIP-CNT                         04693753
046938         GIVING PV-ARRIVE-TO-SHIP-AVG                             04693853
046939                 ROUNDED                                          04693953
046940         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04694053
046941             BY 1440                                              04694153
046942         GIVING PV-ARRIVE-TO-SHIP-DAY                             04694253
046943                 ROUNDED                                          04694353
046944     ELSE                                                         04694453
046945         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04694553
046946                           PV-ARRIVE-TO-SHIP-DAY                  04694653
046947     END-IF.                                                      04694753
046948                                                                  04694853
046949     IF  PV-SMO-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04694953
046950         PV-SMO-P2L-OPEN-TO-TCLOS-CNT  >  0                       04695053
046951         DIVIDE PV-SMO-P2L-OPEN-TO-TCLOS-MIN                      04695153
046952             BY PV-SMO-P2L-OPEN-TO-TCLOS-CNT                      04695253
046953         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04695353
046954                 ROUNDED                                          04695453
046955         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04695553
046956             BY 1440                                              04695653
046957         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04695753
046958                 ROUNDED                                          04695853
046959     ELSE                                                         04695953
046960         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04696053
046961                           PV-P2L-OPEN-TO-TCLOS-DAY               04696153
046962     END-IF.                                                      04696253
046963                                                                  04696353
046964     IF  PV-SMO-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04696453
046965         PV-SMO-P2L-OPEN-TO-SHIP-CNT  >  0                        04696553
046966         DIVIDE PV-SMO-P2L-OPEN-TO-SHIP-MIN                       04696653
046967             BY PV-SMO-P2L-OPEN-TO-SHIP-CNT                       04696753
046968         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04696853
046969                 ROUNDED                                          04696953
046970         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04697053
046971             BY 1440                                              04697153
046972         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04697253
046973                 ROUNDED                                          04697353
046974     ELSE                                                         04697453
046975         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04697553
046976                           PV-P2L-OPEN-TO-SHIP-DAY                04697653
046977     END-IF.                                                      04697753
046978                                                                  04697853
046979     IF  PV-SMO-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04697953
046980         PV-SMO-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04698053
046981         DIVIDE PV-SMO-P2L-CLOSE-TO-TCLOS-MIN                     04698153
046982             BY PV-SMO-P2L-CLOSE-TO-TCLOS-CNT                     04698253
046983         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04698353
046984                 ROUNDED                                          04698453
046985         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04698553
046986             BY 1440                                              04698653
046987         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04698753
046988                 ROUNDED                                          04698853
046989     ELSE                                                         04698953
046990         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04699053
046991                           PV-P2L-CLOSE-TO-TCLOS-DAY              04699153
046992     END-IF.                                                      04699253
046993                                                                  04699353
046994     IF  PV-SMO-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04699453
046995         PV-SMO-P2L-CLOSE-TO-SHIP-CNT  >  0                       04699553
046996         DIVIDE PV-SMO-P2L-CLOSE-TO-SHIP-MIN                      04699653
046997             BY PV-SMO-P2L-CLOSE-TO-SHIP-CNT                      04699753
046998         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04699853
046999                 ROUNDED                                          04699953
047000         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04700053
047001             BY 1440                                              04700153
047002         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04700253
047003                 ROUNDED                                          04700353
047004     ELSE                                                         04700453
047005         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04700553
047006                           PV-P2L-CLOSE-TO-SHIP-DAY               04700653
047007     END-IF.                                                      04700753
047008                                                                  04700853
047009     IF  PV-SMO-ARRIVE-TO-MSTR-MIN  >  0  AND                     04700953
047010         PV-SMO-ARRIVE-TO-MSTR-CNT  >  0                          04701053
047011         DIVIDE PV-SMO-ARRIVE-TO-MSTR-MIN                         04701153
047012             BY PV-SMO-ARRIVE-TO-MSTR-CNT                         04701253
047013         GIVING PV-ARRIVE-TO-MSTR-AVG                             04701353
047014                 ROUNDED                                          04701453
047015         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04701553
047016             BY 1440                                              04701653
047017         GIVING PV-ARRIVE-TO-MSTR-DAY                             04701753
047018                 ROUNDED                                          04701853
047019     ELSE                                                         04701953
047020         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04702053
047021                           PV-ARRIVE-TO-MSTR-DAY                  04702153
047022     END-IF.                                                      04702253
047023                                                                  04702353
047024     IF  PV-SMO-PRC-TO-MSTR-MIN  >  0  AND                        04702453
047025         PV-SMO-PRC-TO-MSTR-CNT  >  0                             04702553
047026         DIVIDE PV-SMO-PRC-TO-MSTR-MIN                            04702653
047027             BY PV-SMO-PRC-TO-MSTR-CNT                            04702753
047028         GIVING PV-PRC-TO-MSTR-AVG                                04702853
047029                 ROUNDED                                          04702953
047030         DIVIDE PV-PRC-TO-MSTR-AVG                                04703053
047031             BY 1440                                              04703153
047032         GIVING PV-PRC-TO-MSTR-DAY                                04703253
047033                 ROUNDED                                          04703353
047034     ELSE                                                         04703453
047035         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04703553
047036                           PV-PRC-TO-MSTR-DAY                     04703653
047037     END-IF.                                                      04703753
047038                                                                  04703853
047039     IF  PV-SMO-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04703953
047040         PV-SMO-ON-OTBND-TO-CLOS-CNT  >  0                        04704053
047041         DIVIDE PV-SMO-ON-OTBND-TO-CLOS-MIN                       04704153
047042             BY PV-SMO-ON-OTBND-TO-CLOS-CNT                       04704253
047043         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04704353
047044                 ROUNDED                                          04704453
047045         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04704553
047046             BY 1440                                              04704653
047047         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04704753
047048                 ROUNDED                                          04704853
047049     ELSE                                                         04704953
047050         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04705053
047051                           PV-ON-OTBND-TO-CLOS-DAY                04705153
047052     END-IF.                                                      04705253
047053                                                                  04705353
047054     IF  PV-SMO-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04705453
047055         PV-SMO-ON-OTBND-TO-SHIP-CNT  >  0                        04705553
047056         DIVIDE PV-SMO-ON-OTBND-TO-SHIP-MIN                       04705653
047057             BY PV-SMO-ON-OTBND-TO-SHIP-CNT                       04705753
047058         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04705853
047059                 ROUNDED                                          04705953
047060         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04706053
047061             BY 1440                                              04706153
047062         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04706253
047063                 ROUNDED                                          04706353
047064     ELSE                                                         04706453
047065         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04706553
047066                           PV-ON-OTBND-TO-SHIP-DAY                04706653
047067     END-IF.                                                      04706753
047068                                                                  04706853
047069     IF  PV-SMO-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04706953
047070         PV-SMO-MSTR-CRE-TO-OTBND-CNT  >  0                       04707053
047071         DIVIDE PV-SMO-MSTR-CRE-TO-OTBND-MIN                      04707153
047072             BY PV-SMO-MSTR-CRE-TO-OTBND-CNT                      04707253
047073         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04707353
047074                 ROUNDED                                          04707453
047075         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04707553
047076             BY 1440                                              04707653
047077         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04707753
047078                 ROUNDED                                          04707853
047079     ELSE                                                         04707953
047080         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04708053
047081                           PV-MSTR-CRE-TO-OTBND-DAY               04708153
047082     END-IF.                                                      04708253
047083                                                                  04708353
047084     IF  PV-SMO-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04708453
047085         PV-SMO-MSTR-CRE-TO-TCLOS-CNT  >  0                       04708553
047086         DIVIDE PV-SMO-MSTR-CRE-TO-TCLOS-MIN                      04708653
047087             BY PV-SMO-MSTR-CRE-TO-TCLOS-CNT                      04708753
047088         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04708853
047089                 ROUNDED                                          04708953
047090         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04709053
047091             BY 1440                                              04709153
047092         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04709253
047093                 ROUNDED                                          04709353
047094     ELSE                                                         04709453
047095         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04709553
047096                           PV-MSTR-CRE-TO-TCLOS-DAY               04709653
047097     END-IF.                                                      04709753
047098                                                                  04709853
047099     IF  PV-SMO-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04709953
047100         PV-SMO-MSTR-CRE-TO-SHIP-CNT  >  0                        04710053
047101         DIVIDE PV-SMO-MSTR-CRE-TO-SHIP-MIN                       04710153
047102             BY PV-SMO-MSTR-CRE-TO-SHIP-CNT                       04710253
047103         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04710353
047104                 ROUNDED                                          04710453
047105         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04710553
047106             BY 1440                                              04710653
047107         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04710753
047108                 ROUNDED                                          04710853
047109     ELSE                                                         04710953
047110         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04711053
047111                           PV-MSTR-CRE-TO-SHIP-DAY                04711153
047112     END-IF.                                                      04711253
047113                                                                  04711353
047114     IF  PV-SMO-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04711453
047115         PV-SMO-MSTR-FIRST-TO-OTBND-CNT  >  0                     04711553
047116         DIVIDE PV-SMO-MSTR-FIRST-TO-OTBND-MIN                    04711653
047117             BY PV-SMO-MSTR-FIRST-TO-OTBND-CNT                    04711753
047118         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04711853
047119                 ROUNDED                                          04711953
047120         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04712053
047121             BY 1440                                              04712153
047122         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04712253
047123                 ROUNDED                                          04712353
047124     ELSE                                                         04712453
047125         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04712553
047126                           PV-MSTR-FIRST-TO-OTBND-DAY             04712653
047127     END-IF.                                                      04712753
047128                                                                  04712853
047129     IF  PV-SMO-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04712953
047130         PV-SMO-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04713053
047131         DIVIDE PV-SMO-MSTR-FIRST-TO-TCLOS-MIN                    04713153
047132             BY PV-SMO-MSTR-FIRST-TO-TCLOS-CNT                    04713253
047133         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04713353
047134                 ROUNDED                                          04713453
047135         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04713553
047136             BY 1440                                              04713653
047137         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04713753
047138                 ROUNDED                                          04713853
047139     ELSE                                                         04713953
047140         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04714053
047141                           PV-MSTR-FIRST-TO-TCLOS-DAY             04714153
047142     END-IF.                                                      04714253
047143                                                                  04714353
047144     IF  PV-SMO-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04714453
047145         PV-SMO-MSTR-FIRST-TO-SHIP-CNT  >  0                      04714553
047146         DIVIDE PV-SMO-MSTR-FIRST-TO-SHIP-MIN                     04714653
047147             BY PV-SMO-MSTR-FIRST-TO-SHIP-CNT                     04714753
047148         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04714853
047149                 ROUNDED                                          04714953
047150         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04715053
047151             BY 1440                                              04715153
047152         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04715253
047153                 ROUNDED                                          04715353
047154     ELSE                                                         04715453
047155         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04715553
047156                           PV-MSTR-FIRST-TO-SHIP-DAY              04715653
047157     END-IF.                                                      04715753
047158                                                                  04715853
047159     IF  PV-SMO-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04715953
047160         PV-SMO-MSTR-LAST-TO-OTBND-CNT  >  0                      04716053
047161         DIVIDE PV-SMO-MSTR-LAST-TO-OTBND-MIN                     04716153
047162             BY PV-SMO-MSTR-LAST-TO-OTBND-CNT                     04716253
047163         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04716353
047164                 ROUNDED                                          04716453
047165         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04716553
047166             BY 1440                                              04716653
047167         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04716753
047168                 ROUNDED                                          04716853
047169     ELSE                                                         04716953
047170         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04717053
047171                           PV-MSTR-LAST-TO-OTBND-DAY              04717153
047172     END-IF.                                                      04717253
047173                                                                  04717353
047174     IF  PV-SMO-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04717453
047175         PV-SMO-MSTR-LAST-TO-TCLOS-CNT  >  0                      04717553
047176         DIVIDE PV-SMO-MSTR-LAST-TO-TCLOS-MIN                     04717653
047177             BY PV-SMO-MSTR-LAST-TO-TCLOS-CNT                     04717753
047178         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04717853
047179                 ROUNDED                                          04717953
047180         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04718053
047181             BY 1440                                              04718153
047182         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04718253
047183                 ROUNDED                                          04718353
047184     ELSE                                                         04718453
047185         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04718553
047186                           PV-MSTR-LAST-TO-TCLOS-DAY              04718653
047187     END-IF.                                                      04718753
047188                                                                  04718853
047189     IF  PV-SMO-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04718953
047190         PV-SMO-MSTR-LAST-TO-SHIP-CNT  >  0                       04719053
047191         DIVIDE PV-SMO-MSTR-LAST-TO-SHIP-MIN                      04719153
047192             BY PV-SMO-MSTR-LAST-TO-SHIP-CNT                      04719253
047193         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04719353
047194                 ROUNDED                                          04719453
047195         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04719553
047196             BY 1440                                              04719653
047197         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04719753
047198                 ROUNDED                                          04719853
047199     ELSE                                                         04719953
047200         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04720053
047201                           PV-MSTR-LAST-TO-SHIP-DAY               04720153
047202     END-IF.                                                      04720253
047203*                                                                 04720373
047204*** 8/19                                                          04720473
047205*                                                                 04720573
047206     IF  PV-SMO-TRIP-CARTONS            >  0  AND                 04720673
047207         PV-SMO-TRIP-SRC-CARTONS        >  0                      04720773
047208         DIVIDE  PV-SMO-TRIP-SRC-CARTONS                          04720873
047209             BY  PV-SMO-TRIP-CARTONS                              04720973
047210         GIVING  PV-TRIP-SRC-CRTN                                 04721073
047211                   ROUNDED                                        04721199
047212         MULTIPLY  PV-TRIP-SRC-CRTN                               04721273
047213               BY  100                                            04721373
047214           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04721473
047216     ELSE                                                         04721673
047217         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04721773
047218                           PV-TRIP-SRC-CRTN                       04721873
047219     END-IF.                                                      04721973
047220                                                                  04722073
047221                                                                  04722153
047222     MOVE ZEROES                TO DL3-DC-NBR                     04722255
047223     MOVE 'CORP OVERALL    '    TO DL3-DC-NAME                    04722353
047224     MOVE 'PBS MANUAL XDOCK'    TO DL3-SOURCE                     04722453
047225                                                                  04722599
047226     IF   SU134-EFC-STORES  AND                                   04722699
047229          PV-SMO-TRIP-SRC-CARTONS  =   0                          04722999
047230             CONTINUE                                             04723099
047231     ELSE                                                         04723199
047232     IF   SU134-LFC-STORES  AND                                   04723299
047234          PV-SMO-TRIP-SRC-CARTONS  =   0                          04723499
047235             CONTINUE                                             04723599
047236     ELSE                                                         04723699
047237         PERFORM 5050-PRINT-CORP-TOTALS                           04723799
047238     END-IF                                                       04723899
047239     END-IF.                                                      04723999
047240                                                                  04724099
047241                                                                  04724199
047242****************************************************************  04724299
047243* CALCULATE JWL-AVERAGES                                       *  04724399
047244****************************************************************  04724499
047245 3065-CALC-JWL-AVERAGES.                                          04724599
047246                                                                  04724699
047247     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04724799
047248                             PV-TRIP-CLOSE-TO-SHIP-AVG            04724899
047249                             PV-TRIP-OPEN-TO-SHIP-AVG             04724999
047250                             PV-ARRIVE-TO-PRC-AVG                 04725099
047251                             PV-ARRIVE-TO-P2L-PKD-AVG             04725199
047252                             PV-PRC-TO-P2L-PKD-AVG                04725299
047253                             PV-P2L-PKD-TO-CLOSE-AVG              04725399
047254                             PV-P2L-OPEN-TO-CLOSE-AVG             04725499
047255                             PV-P2L-OPEN-TO-OTBND-AVG             04725599
047256                             PV-P2L-CLOSE-TO-OTBND-AVG            04725699
047257                             PV-ARRIVE-TO-OTBND-AVG               04725799
047258                             PV-PRC-TO-OTBND-AVG                  04725899
047259                             PV-ARRIVE-TO-TCLOS-AVG               04725999
047260                             PV-ARRIVE-TO-SHIP-AVG                04726099
047261                             PV-P2L-OPEN-TO-TCLOS-AVG             04726199
047262                             PV-P2L-OPEN-TO-SHIP-AVG              04726299
047263                             PV-P2L-CLOSE-TO-TCLOS-AVG            04726399
047264                             PV-P2L-CLOSE-TO-SHIP-AVG             04726499
047265                             PV-ARRIVE-TO-MSTR-AVG                04726599
047266                             PV-PRC-TO-MSTR-AVG                   04726699
047267                             PV-MSTR-CRE-TO-OTBND-AVG             04726799
047268                             PV-MSTR-CRE-TO-TCLOS-AVG             04726899
047269                             PV-MSTR-CRE-TO-SHIP-AVG              04726999
047270                             PV-MSTR-FIRST-TO-OTBND-AVG           04727099
047271                             PV-MSTR-FIRST-TO-TCLOS-AVG           04727199
047272                             PV-MSTR-FIRST-TO-SHIP-AVG            04727299
047273                             PV-MSTR-LAST-TO-OTBND-AVG            04727399
047274                             PV-MSTR-LAST-TO-TCLOS-AVG            04727499
047275                             PV-MSTR-LAST-TO-SHIP-AVG             04727599
047276                             PV-ON-OTBND-TO-CLOS-AVG              04727699
047277                             PV-ON-OTBND-TO-SHIP-AVG              04727799
047278                             PV-TRIP-OPEN-TO-CLOSE-DAY            04727899
047279                             PV-TRIP-CLOSE-TO-SHIP-DAY            04727999
047280                             PV-TRIP-OPEN-TO-SHIP-DAY             04728099
047281                             PV-ARRIVE-TO-PRC-DAY                 04728199
047282                             PV-ARRIVE-TO-P2L-PKD-DAY             04728299
047283                             PV-PRC-TO-P2L-PKD-DAY                04728399
047284                             PV-P2L-PKD-TO-CLOSE-DAY              04728499
047285                             PV-P2L-OPEN-TO-CLOSE-DAY             04728599
047286                             PV-P2L-OPEN-TO-OTBND-DAY             04728699
047287                             PV-P2L-CLOSE-TO-OTBND-DAY            04728799
047288                             PV-ARRIVE-TO-OTBND-DAY               04728899
047289                             PV-PRC-TO-OTBND-DAY                  04728999
047290                             PV-ARRIVE-TO-TCLOS-DAY               04729099
047291                             PV-ARRIVE-TO-SHIP-DAY                04729199
047292                             PV-P2L-OPEN-TO-TCLOS-DAY             04729299
047293                             PV-P2L-OPEN-TO-SHIP-DAY              04729399
047294                             PV-P2L-CLOSE-TO-TCLOS-DAY            04729499
047295                             PV-P2L-CLOSE-TO-SHIP-DAY             04729599
047296                             PV-ARRIVE-TO-MSTR-DAY                04729699
047297                             PV-PRC-TO-MSTR-DAY                   04729799
047298                             PV-MSTR-CRE-TO-OTBND-DAY             04729899
047299                             PV-MSTR-CRE-TO-TCLOS-DAY             04729999
047300                             PV-MSTR-CRE-TO-SHIP-DAY              04730099
047301                             PV-MSTR-FIRST-TO-OTBND-DAY           04730199
047302                             PV-MSTR-FIRST-TO-TCLOS-DAY           04730299
047303                             PV-MSTR-FIRST-TO-SHIP-DAY            04730399
047304                             PV-MSTR-LAST-TO-OTBND-DAY            04730499
047305                             PV-MSTR-LAST-TO-TCLOS-DAY            04730599
047306                             PV-MSTR-LAST-TO-SHIP-DAY             04730699
047307                             PV-ON-OTBND-TO-CLOS-DAY              04730799
047308                             PV-ON-OTBND-TO-SHIP-DAY.             04730899
047309                                                                  04730999
047310     IF  PV-JWL-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04731099
047311         PV-JWL-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04731199
047312         DIVIDE  PV-JWL-TRIP-OPEN-TO-CLOSE-MIN                    04731299
047313             BY  PV-JWL-TRIP-OPEN-TO-CLOSE-CNT                    04731399
047314         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04731499
047315                 ROUNDED                                          04731599
047316         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04731699
047317             BY  1440                                             04731799
047318         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04731899
047319                 ROUNDED                                          04731999
047320     ELSE                                                         04732099
047321         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04732199
047322                           PV-TRIP-OPEN-TO-CLOSE-DAY              04732299
047323     END-IF.                                                      04732399
047324                                                                  04732499
047325     IF  PV-JWL-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04732599
047326         PV-JWL-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04732699
047327         DIVIDE  PV-JWL-TRIP-CLOSE-TO-SHIP-MIN                    04732799
047328             BY  PV-JWL-TRIP-CLOSE-TO-SHIP-CNT                    04732899
047329         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04732999
047330                 ROUNDED                                          04733099
047331         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04733199
047332             BY  1440                                             04733299
047333         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04733399
047334                 ROUNDED                                          04733499
047335     ELSE                                                         04733599
047336         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04733699
047337                           PV-TRIP-CLOSE-TO-SHIP-DAY              04733799
047338     END-IF.                                                      04733899
047339                                                                  04733999
047340     IF  PV-JWL-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04734099
047341         PV-JWL-TRIP-OPEN-TO-SHIP-CNT  >  0                       04734199
047342         DIVIDE  PV-JWL-TRIP-OPEN-TO-SHIP-MIN                     04734299
047343             BY  PV-JWL-TRIP-OPEN-TO-SHIP-CNT                     04734399
047344         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04734499
047345                 ROUNDED                                          04734599
047346         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04734699
047347             BY  1440                                             04734799
047348         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04734899
047349                 ROUNDED                                          04734999
047350     ELSE                                                         04735099
047351         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04735199
047352                           PV-TRIP-OPEN-TO-SHIP-DAY               04735299
047353     END-IF.                                                      04735399
047354                                                                  04735499
047355                                                                  04735599
047356     IF  PV-JWL-ARRIVE-TO-PRC-MIN  >  0  AND                      04735699
047357         PV-JWL-ARRIVE-TO-PRC-CNT  >  0                           04735799
047358         DIVIDE PV-JWL-ARRIVE-TO-PRC-MIN                          04735899
047359             BY PV-JWL-ARRIVE-TO-PRC-CNT                          04735999
047360         GIVING PV-ARRIVE-TO-PRC-AVG                              04736099
047361                 ROUNDED                                          04736199
047362         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04736299
047363             BY 1440                                              04736399
047364         GIVING PV-ARRIVE-TO-PRC-DAY                              04736499
047365                 ROUNDED                                          04736599
047366     ELSE                                                         04736699
047367         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04736799
047368                           PV-ARRIVE-TO-PRC-DAY                   04736899
047369     END-IF.                                                      04736999
047370                                                                  04737099
047371     IF  PV-JWL-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04737199
047372         PV-JWL-ARRIVE-TO-P2L-PKD-CNT  >  0                       04737299
047373         DIVIDE PV-JWL-ARRIVE-TO-P2L-PKD-MIN                      04737399
047374             BY PV-JWL-ARRIVE-TO-P2L-PKD-CNT                      04737499
047375         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04737599
047376                 ROUNDED                                          04737699
047377         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04737799
047378             BY 1440                                              04737899
047379         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04737999
047380                 ROUNDED                                          04738099
047381     ELSE                                                         04738199
047382         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04738299
047383                           PV-ARRIVE-TO-P2L-PKD-DAY               04738399
047384     END-IF.                                                      04738499
047385                                                                  04738599
047386                                                                  04738699
047387     IF  PV-JWL-PRC-TO-P2L-PKD-MIN  >  0  AND                     04738799
047388         PV-JWL-PRC-TO-P2L-PKD-CNT  >  0                          04738899
047389         DIVIDE PV-JWL-PRC-TO-P2L-PKD-MIN                         04738999
047390             BY PV-JWL-PRC-TO-P2L-PKD-CNT                         04739099
047391         GIVING PV-PRC-TO-P2L-PKD-AVG                             04739199
047392                 ROUNDED                                          04739299
047393         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04739399
047394             BY 1440                                              04739499
047395         GIVING PV-PRC-TO-P2L-PKD-DAY                             04739599
047396                 ROUNDED                                          04739699
047397     ELSE                                                         04739799
047398         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04739899
047399                           PV-PRC-TO-P2L-PKD-DAY                  04739999
047400     END-IF.                                                      04740099
047401                                                                  04740199
047402     IF  PV-JWL-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04740299
047403         PV-JWL-P2L-PKD-TO-CLOSE-CNT  >  0                        04740399
047404         DIVIDE PV-JWL-P2L-PKD-TO-CLOSE-MIN                       04740499
047405             BY PV-JWL-P2L-PKD-TO-CLOSE-CNT                       04740599
047406         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04740699
047407                 ROUNDED                                          04740799
047408         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04740899
047409             BY 1440                                              04740999
047410         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04741099
047411                 ROUNDED                                          04741199
047412     ELSE                                                         04741299
047413         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04741399
047414                           PV-P2L-PKD-TO-CLOSE-DAY                04741499
047415     END-IF.                                                      04741599
047416                                                                  04741699
047417     IF  PV-JWL-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04741799
047418         PV-JWL-P2L-OPEN-TO-CLOSE-CNT  >  0                       04741899
047419         DIVIDE PV-JWL-P2L-OPEN-TO-CLOSE-MIN                      04741999
047420             BY PV-JWL-P2L-OPEN-TO-CLOSE-CNT                      04742099
047421         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04742199
047422                 ROUNDED                                          04742299
047423         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04742399
047424             BY 1440                                              04742499
047425         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04742599
047426                 ROUNDED                                          04742699
047427     ELSE                                                         04742799
047428         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04742899
047429                           PV-P2L-OPEN-TO-CLOSE-DAY               04742999
047430     END-IF.                                                      04743099
047431                                                                  04743199
047432     IF  PV-JWL-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04743299
047433         PV-JWL-P2L-OPEN-TO-OTBND-CNT  >  0                       04743399
047434         DIVIDE PV-JWL-P2L-OPEN-TO-OTBND-MIN                      04743499
047435             BY PV-JWL-P2L-OPEN-TO-OTBND-CNT                      04743599
047436         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04743699
047437                 ROUNDED                                          04743799
047438         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04743899
047439             BY 1440                                              04743999
047440         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04744099
047441                 ROUNDED                                          04744199
047442     ELSE                                                         04744299
047443         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04744399
047444                           PV-P2L-OPEN-TO-OTBND-DAY               04744499
047445     END-IF.                                                      04744599
047446                                                                  04744699
047447     IF  PV-JWL-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04744799
047448         PV-JWL-P2L-CLOSE-TO-OTBND-CNT  >  0                      04744899
047449         DIVIDE PV-JWL-P2L-CLOSE-TO-OTBND-MIN                     04744999
047450             BY PV-JWL-P2L-CLOSE-TO-OTBND-CNT                     04745099
047451         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04745199
047452                 ROUNDED                                          04745299
047453         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04745399
047454             BY 1440                                              04745499
047455         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04745599
047456                 ROUNDED                                          04745699
047457     ELSE                                                         04745799
047458         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04745899
047459                           PV-P2L-CLOSE-TO-OTBND-DAY              04745999
047460     END-IF.                                                      04746099
047461                                                                  04746199
047462     IF  PV-JWL-ARRIVE-TO-OTBND-MIN  >  0  AND                    04746299
047463         PV-JWL-ARRIVE-TO-OTBND-CNT  >  0                         04746399
047464         DIVIDE PV-JWL-ARRIVE-TO-OTBND-MIN                        04746499
047465             BY PV-JWL-ARRIVE-TO-OTBND-CNT                        04746599
047466         GIVING PV-ARRIVE-TO-OTBND-AVG                            04746699
047467                 ROUNDED                                          04746799
047468         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04746899
047469             BY 1440                                              04746999
047470         GIVING PV-ARRIVE-TO-OTBND-DAY                            04747099
047471                 ROUNDED                                          04747199
047472     ELSE                                                         04747299
047473         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04747399
047474                           PV-ARRIVE-TO-OTBND-DAY                 04747499
047475     END-IF.                                                      04747599
047476                                                                  04747699
047477     IF  PV-JWL-PRC-TO-OTBND-MIN  >  0  AND                       04747799
047478         PV-JWL-PRC-TO-OTBND-CNT  >  0                            04747899
047479         DIVIDE PV-JWL-PRC-TO-OTBND-MIN                           04747999
047480             BY PV-JWL-PRC-TO-OTBND-CNT                           04748099
047481         GIVING PV-PRC-TO-OTBND-AVG                               04748199
047482                 ROUNDED                                          04748299
047483         DIVIDE PV-PRC-TO-OTBND-AVG                               04748399
047484             BY 1440                                              04748499
047485         GIVING PV-PRC-TO-OTBND-DAY                               04748599
047486                 ROUNDED                                          04748699
047487     ELSE                                                         04748799
047488         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04748899
047489                           PV-PRC-TO-OTBND-DAY                    04748999
047490     END-IF.                                                      04749099
047491                                                                  04749199
047492     IF  PV-JWL-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04749299
047493         PV-JWL-ARRIVE-TO-TCLOS-CNT  >  0                         04749399
047494         DIVIDE PV-JWL-ARRIVE-TO-TCLOS-MIN                        04749499
047495             BY PV-JWL-ARRIVE-TO-TCLOS-CNT                        04749599
047496         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04749699
047497                 ROUNDED                                          04749799
047498         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04749899
047499             BY 1440                                              04749999
047500         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04750099
047501                 ROUNDED                                          04750199
047502     ELSE                                                         04750299
047503         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04750399
047504                           PV-ARRIVE-TO-TCLOS-DAY                 04750499
047505     END-IF.                                                      04750599
047506                                                                  04750699
047507     IF  PV-JWL-ARRIVE-TO-SHIP-MIN  >  0  AND                     04750799
047508         PV-JWL-ARRIVE-TO-SHIP-CNT  >  0                          04750899
047509         DIVIDE PV-JWL-ARRIVE-TO-SHIP-MIN                         04750999
047510             BY PV-JWL-ARRIVE-TO-SHIP-CNT                         04751099
047511         GIVING PV-ARRIVE-TO-SHIP-AVG                             04751199
047512                 ROUNDED                                          04751299
047513         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04751399
047514             BY 1440                                              04751499
047515         GIVING PV-ARRIVE-TO-SHIP-DAY                             04751599
047516                 ROUNDED                                          04751699
047517     ELSE                                                         04751799
047518         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04751899
047519                           PV-ARRIVE-TO-SHIP-DAY                  04751999
047520     END-IF.                                                      04752099
047521                                                                  04752199
047522     IF  PV-JWL-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04752299
047523         PV-JWL-P2L-OPEN-TO-TCLOS-CNT  >  0                       04752399
047524         DIVIDE PV-JWL-P2L-OPEN-TO-TCLOS-MIN                      04752499
047525             BY PV-JWL-P2L-OPEN-TO-TCLOS-CNT                      04752599
047526         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04752699
047527                 ROUNDED                                          04752799
047528         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04752899
047529             BY 1440                                              04752999
047530         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04753099
047531                 ROUNDED                                          04753199
047532     ELSE                                                         04753299
047533         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04753399
047534                           PV-P2L-OPEN-TO-TCLOS-DAY               04753499
047535     END-IF.                                                      04753599
047536                                                                  04753699
047537     IF  PV-JWL-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04753799
047538         PV-JWL-P2L-OPEN-TO-SHIP-CNT  >  0                        04753899
047539         DIVIDE PV-JWL-P2L-OPEN-TO-SHIP-MIN                       04753999
047540             BY PV-JWL-P2L-OPEN-TO-SHIP-CNT                       04754099
047541         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04754199
047542                 ROUNDED                                          04754299
047543         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04754399
047544             BY 1440                                              04754499
047545         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04754599
047546                 ROUNDED                                          04754699
047547     ELSE                                                         04754799
047548         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04754899
047549                           PV-P2L-OPEN-TO-SHIP-DAY                04754999
047550     END-IF.                                                      04755099
047551                                                                  04755199
047552     IF  PV-JWL-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04755299
047553         PV-JWL-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04755399
047554         DIVIDE PV-JWL-P2L-CLOSE-TO-TCLOS-MIN                     04755499
047555             BY PV-JWL-P2L-CLOSE-TO-TCLOS-CNT                     04755599
047556         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04755699
047557                 ROUNDED                                          04755799
047558         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04755899
047559             BY 1440                                              04755999
047560         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04756099
047561                 ROUNDED                                          04756199
047562     ELSE                                                         04756299
047563         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04756399
047564                           PV-P2L-CLOSE-TO-TCLOS-DAY              04756499
047565     END-IF.                                                      04756599
047566                                                                  04756699
047567     IF  PV-JWL-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04756799
047568         PV-JWL-P2L-CLOSE-TO-SHIP-CNT  >  0                       04756899
047569         DIVIDE PV-JWL-P2L-CLOSE-TO-SHIP-MIN                      04756999
047570             BY PV-JWL-P2L-CLOSE-TO-SHIP-CNT                      04757099
047571         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04757199
047572                 ROUNDED                                          04757299
047573         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04757399
047574             BY 1440                                              04757499
047575         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04757599
047576                 ROUNDED                                          04757699
047577     ELSE                                                         04757799
047578         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04757899
047579                           PV-P2L-CLOSE-TO-SHIP-DAY               04757999
047580     END-IF.                                                      04758099
047581                                                                  04758199
047582     IF  PV-JWL-ARRIVE-TO-MSTR-MIN  >  0  AND                     04758299
047583         PV-JWL-ARRIVE-TO-MSTR-CNT  >  0                          04758399
047584         DIVIDE PV-JWL-ARRIVE-TO-MSTR-MIN                         04758499
047585             BY PV-JWL-ARRIVE-TO-MSTR-CNT                         04758599
047586         GIVING PV-ARRIVE-TO-MSTR-AVG                             04758699
047587                 ROUNDED                                          04758799
047588         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04758899
047589             BY 1440                                              04758999
047590         GIVING PV-ARRIVE-TO-MSTR-DAY                             04759099
047591                 ROUNDED                                          04759199
047592     ELSE                                                         04759299
047593         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04759399
047594                           PV-ARRIVE-TO-MSTR-DAY                  04759499
047595     END-IF.                                                      04759599
047596                                                                  04759699
047597     IF  PV-JWL-PRC-TO-MSTR-MIN  >  0  AND                        04759799
047598         PV-JWL-PRC-TO-MSTR-CNT  >  0                             04759899
047599         DIVIDE PV-JWL-PRC-TO-MSTR-MIN                            04759999
047600             BY PV-JWL-PRC-TO-MSTR-CNT                            04760099
047601         GIVING PV-PRC-TO-MSTR-AVG                                04760199
047602                 ROUNDED                                          04760299
047603         DIVIDE PV-PRC-TO-MSTR-AVG                                04760399
047604             BY 1440                                              04760499
047605         GIVING PV-PRC-TO-MSTR-DAY                                04760599
047606                 ROUNDED                                          04760699
047607     ELSE                                                         04760799
047608         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04760899
047609                           PV-PRC-TO-MSTR-DAY                     04760999
047610     END-IF.                                                      04761099
047611                                                                  04761199
047612     IF  PV-JWL-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04761299
047613         PV-JWL-ON-OTBND-TO-CLOS-CNT  >  0                        04761399
047614         DIVIDE PV-JWL-ON-OTBND-TO-CLOS-MIN                       04761499
047615             BY PV-JWL-ON-OTBND-TO-CLOS-CNT                       04761599
047616         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04761699
047617                 ROUNDED                                          04761799
047618         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04761899
047619             BY 1440                                              04761999
047620         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04762099
047621                 ROUNDED                                          04762199
047622     ELSE                                                         04762299
047623         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04762399
047624                           PV-ON-OTBND-TO-CLOS-DAY                04762499
047625     END-IF.                                                      04762599
047626                                                                  04762699
047627     IF  PV-JWL-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04762799
047628         PV-JWL-ON-OTBND-TO-SHIP-CNT  >  0                        04762899
047629         DIVIDE PV-JWL-ON-OTBND-TO-SHIP-MIN                       04762999
047630             BY PV-JWL-ON-OTBND-TO-SHIP-CNT                       04763099
047631         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04763199
047632                 ROUNDED                                          04763299
047633         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04763399
047634             BY 1440                                              04763499
047635         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04763599
047636                 ROUNDED                                          04763699
047637     ELSE                                                         04763799
047638         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04763899
047639                           PV-ON-OTBND-TO-SHIP-DAY                04763999
047640     END-IF.                                                      04764099
047641                                                                  04764199
047642     IF  PV-JWL-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04764299
047643         PV-JWL-MSTR-CRE-TO-OTBND-CNT  >  0                       04764399
047644         DIVIDE PV-JWL-MSTR-CRE-TO-OTBND-MIN                      04764499
047645             BY PV-JWL-MSTR-CRE-TO-OTBND-CNT                      04764599
047646         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04764699
047647                 ROUNDED                                          04764799
047648         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04764899
047649             BY 1440                                              04764999
047650         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04765099
047651                 ROUNDED                                          04765199
047652     ELSE                                                         04765299
047653         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04765399
047654                           PV-MSTR-CRE-TO-OTBND-DAY               04765499
047655     END-IF.                                                      04765599
047656                                                                  04765699
047657     IF  PV-JWL-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04765799
047658         PV-JWL-MSTR-CRE-TO-TCLOS-CNT  >  0                       04765899
047659         DIVIDE PV-JWL-MSTR-CRE-TO-TCLOS-MIN                      04765999
047660             BY PV-JWL-MSTR-CRE-TO-TCLOS-CNT                      04766099
047661         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04766199
047662                 ROUNDED                                          04766299
047663         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04766399
047664             BY 1440                                              04766499
047665         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04766599
047666                 ROUNDED                                          04766699
047667     ELSE                                                         04766799
047668         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04766899
047669                           PV-MSTR-CRE-TO-TCLOS-DAY               04766999
047670     END-IF.                                                      04767099
047671                                                                  04767199
047672     IF  PV-JWL-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04767299
047673         PV-JWL-MSTR-CRE-TO-SHIP-CNT  >  0                        04767399
047674         DIVIDE PV-JWL-MSTR-CRE-TO-SHIP-MIN                       04767499
047675             BY PV-JWL-MSTR-CRE-TO-SHIP-CNT                       04767599
047676         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04767699
047677                 ROUNDED                                          04767799
047678         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04767899
047679             BY 1440                                              04767999
047680         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04768099
047681                 ROUNDED                                          04768199
047682     ELSE                                                         04768299
047683         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04768399
047684                           PV-MSTR-CRE-TO-SHIP-DAY                04768499
047685     END-IF.                                                      04768599
047686                                                                  04768699
047687     IF  PV-JWL-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04768799
047688         PV-JWL-MSTR-FIRST-TO-OTBND-CNT  >  0                     04768899
047689         DIVIDE PV-JWL-MSTR-FIRST-TO-OTBND-MIN                    04768999
047690             BY PV-JWL-MSTR-FIRST-TO-OTBND-CNT                    04769099
047691         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04769199
047692                 ROUNDED                                          04769299
047693         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04769399
047694             BY 1440                                              04769499
047695         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04769599
047696                 ROUNDED                                          04769699
047697     ELSE                                                         04769799
047698         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04769899
047699                           PV-MSTR-FIRST-TO-OTBND-DAY             04769999
047700     END-IF.                                                      04770099
047701                                                                  04770199
047702     IF  PV-JWL-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04770299
047703         PV-JWL-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04770399
047704         DIVIDE PV-JWL-MSTR-FIRST-TO-TCLOS-MIN                    04770499
047705             BY PV-JWL-MSTR-FIRST-TO-TCLOS-CNT                    04770599
047706         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04770699
047707                 ROUNDED                                          04770799
047708         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04770899
047709             BY 1440                                              04770999
047710         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04771099
047711                 ROUNDED                                          04771199
047712     ELSE                                                         04771299
047713         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04771399
047714                           PV-MSTR-FIRST-TO-TCLOS-DAY             04771499
047715     END-IF.                                                      04771599
047716                                                                  04771699
047717     IF  PV-JWL-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04771799
047718         PV-JWL-MSTR-FIRST-TO-SHIP-CNT  >  0                      04771899
047719         DIVIDE PV-JWL-MSTR-FIRST-TO-SHIP-MIN                     04771999
047720             BY PV-JWL-MSTR-FIRST-TO-SHIP-CNT                     04772099
047721         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04772199
047722                 ROUNDED                                          04772299
047723         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04772399
047724             BY 1440                                              04772499
047725         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04772599
047726                 ROUNDED                                          04772699
047727     ELSE                                                         04772799
047728         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04772899
047729                           PV-MSTR-FIRST-TO-SHIP-DAY              04772999
047730     END-IF.                                                      04773099
047731                                                                  04773199
047732     IF  PV-JWL-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04773299
047733         PV-JWL-MSTR-LAST-TO-OTBND-CNT  >  0                      04773399
047734         DIVIDE PV-JWL-MSTR-LAST-TO-OTBND-MIN                     04773499
047735             BY PV-JWL-MSTR-LAST-TO-OTBND-CNT                     04773599
047736         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04773699
047737                 ROUNDED                                          04773799
047738         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04773899
047739             BY 1440                                              04773999
047740         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04774099
047741                 ROUNDED                                          04774199
047742     ELSE                                                         04774299
047743         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04774399
047744                           PV-MSTR-LAST-TO-OTBND-DAY              04774499
047745     END-IF.                                                      04774599
047746                                                                  04774699
047747     IF  PV-JWL-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04774799
047748         PV-JWL-MSTR-LAST-TO-TCLOS-CNT  >  0                      04774899
047749         DIVIDE PV-JWL-MSTR-LAST-TO-TCLOS-MIN                     04774999
047750             BY PV-JWL-MSTR-LAST-TO-TCLOS-CNT                     04775099
047751         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04775199
047752                 ROUNDED                                          04775299
047753         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04775399
047754             BY 1440                                              04775499
047755         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04775599
047756                 ROUNDED                                          04775699
047757     ELSE                                                         04775799
047758         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04775899
047759                           PV-MSTR-LAST-TO-TCLOS-DAY              04775999
047760     END-IF.                                                      04776099
047761                                                                  04776199
047762     IF  PV-JWL-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04776299
047763         PV-JWL-MSTR-LAST-TO-SHIP-CNT  >  0                       04776399
047764         DIVIDE PV-JWL-MSTR-LAST-TO-SHIP-MIN                      04776499
047765             BY PV-JWL-MSTR-LAST-TO-SHIP-CNT                      04776599
047766         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04776699
047767                 ROUNDED                                          04776799
047768         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04776899
047769             BY 1440                                              04776999
047770         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04777099
047771                 ROUNDED                                          04777199
047772     ELSE                                                         04777299
047773         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04777399
047774                           PV-MSTR-LAST-TO-SHIP-DAY               04777499
047775     END-IF.                                                      04777599
047776*                                                                 04777699
047777*** 8/19                                                          04777799
047778*                                                                 04777899
047779     IF  PV-JWL-TRIP-CARTONS            >  0  AND                 04777999
047780         PV-JWL-TRIP-SRC-CARTONS        >  0                      04778099
047781         DIVIDE  PV-JWL-TRIP-SRC-CARTONS                          04778199
047782             BY  PV-JWL-TRIP-CARTONS                              04778299
047783         GIVING  PV-TRIP-SRC-CRTN                                 04778399
047784                   ROUNDED                                        04778499
047785         MULTIPLY  PV-TRIP-SRC-CRTN                               04778599
047786               BY  100                                            04778699
047787           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04778799
047788     ELSE                                                         04778899
047789         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04778999
047790                           PV-TRIP-SRC-CRTN                       04779099
047791     END-IF.                                                      04779199
047792                                                                  04779299
047793                                                                  04779399
047794     MOVE ZEROES                TO DL1-DC-NBR                     04779499
047795     MOVE 'CORP OVERALL    '    TO DL1-DC-NAME                    04779599
047796     MOVE 'P2L JEWELRY     '    TO DL1-SOURCE                     04779699
047797                                                                  04779799
047798     IF   SU134-EFC-STORES  AND                                   04779899
047799          PV-JWL-TRIP-SRC-CARTONS  =   0                          04779999
047800             CONTINUE                                             04780099
047801     ELSE                                                         04780199
047802     IF   SU134-LFC-STORES  AND                                   04780299
047803          PV-JWL-TRIP-SRC-CARTONS  =   0                          04780399
047804             CONTINUE                                             04780499
047805     ELSE                                                         04780599
047806         PERFORM 5030-PRINT-CORP-TOTALS                           04780699
047807     END-IF                                                       04780799
047808     END-IF.                                                      04780899
047809                                                                  04780999
047810                                                                  04781099
047811****************************************************************  04781199
047812* CALCULATE P2L-AVERAGES                                       *  04781299
047813****************************************************************  04781399
047814 3070-CALC-P2L-AVERAGES.                                          04781499
047815                                                                  04781599
047816     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04781699
047817                             PV-TRIP-CLOSE-TO-SHIP-AVG            04781799
047818                             PV-TRIP-OPEN-TO-SHIP-AVG             04781899
047819                             PV-ARRIVE-TO-PRC-AVG                 04781999
047820                             PV-ARRIVE-TO-P2L-PKD-AVG             04782099
047821                             PV-PRC-TO-P2L-PKD-AVG                04782199
047822                             PV-P2L-PKD-TO-CLOSE-AVG              04782299
047823                             PV-P2L-OPEN-TO-CLOSE-AVG             04782399
047824                             PV-P2L-OPEN-TO-OTBND-AVG             04782499
047825                             PV-P2L-CLOSE-TO-OTBND-AVG            04782599
047826                             PV-ARRIVE-TO-OTBND-AVG               04782699
047827                             PV-PRC-TO-OTBND-AVG                  04782799
047828                             PV-ARRIVE-TO-TCLOS-AVG               04782899
047829                             PV-ARRIVE-TO-SHIP-AVG                04782999
047830                             PV-P2L-OPEN-TO-TCLOS-AVG             04783099
047831                             PV-P2L-OPEN-TO-SHIP-AVG              04783199
047832                             PV-P2L-CLOSE-TO-TCLOS-AVG            04783299
047833                             PV-P2L-CLOSE-TO-SHIP-AVG             04783399
047834                             PV-ARRIVE-TO-MSTR-AVG                04783499
047835                             PV-PRC-TO-MSTR-AVG                   04783599
047836                             PV-MSTR-CRE-TO-OTBND-AVG             04783699
047837                             PV-MSTR-CRE-TO-TCLOS-AVG             04783799
047838                             PV-MSTR-CRE-TO-SHIP-AVG              04783899
047839                             PV-MSTR-FIRST-TO-OTBND-AVG           04783999
047840                             PV-MSTR-FIRST-TO-TCLOS-AVG           04784099
047841                             PV-MSTR-FIRST-TO-SHIP-AVG            04784199
047842                             PV-MSTR-LAST-TO-OTBND-AVG            04784299
047843                             PV-MSTR-LAST-TO-TCLOS-AVG            04784399
047844                             PV-MSTR-LAST-TO-SHIP-AVG             04784499
047845                             PV-ON-OTBND-TO-CLOS-AVG              04784599
047846                             PV-ON-OTBND-TO-SHIP-AVG              04784699
047847                             PV-TRIP-OPEN-TO-CLOSE-DAY            04784799
047848                             PV-TRIP-CLOSE-TO-SHIP-DAY            04784899
047849                             PV-TRIP-OPEN-TO-SHIP-DAY             04784999
047850                             PV-ARRIVE-TO-PRC-DAY                 04785099
047851                             PV-ARRIVE-TO-P2L-PKD-DAY             04785199
047852                             PV-PRC-TO-P2L-PKD-DAY                04785299
047853                             PV-P2L-PKD-TO-CLOSE-DAY              04785399
047854                             PV-P2L-OPEN-TO-CLOSE-DAY             04785499
047855                             PV-P2L-OPEN-TO-OTBND-DAY             04785599
047856                             PV-P2L-CLOSE-TO-OTBND-DAY            04785699
047857                             PV-ARRIVE-TO-OTBND-DAY               04785799
047858                             PV-PRC-TO-OTBND-DAY                  04785899
047859                             PV-ARRIVE-TO-TCLOS-DAY               04785999
047860                             PV-ARRIVE-TO-SHIP-DAY                04786099
047861                             PV-P2L-OPEN-TO-TCLOS-DAY             04786199
047862                             PV-P2L-OPEN-TO-SHIP-DAY              04786299
047863                             PV-P2L-CLOSE-TO-TCLOS-DAY            04786399
047864                             PV-P2L-CLOSE-TO-SHIP-DAY             04786499
047865                             PV-ARRIVE-TO-MSTR-DAY                04786599
047866                             PV-PRC-TO-MSTR-DAY                   04786699
047867                             PV-MSTR-CRE-TO-OTBND-DAY             04786799
047868                             PV-MSTR-CRE-TO-TCLOS-DAY             04786899
047869                             PV-MSTR-CRE-TO-SHIP-DAY              04786999
047870                             PV-MSTR-FIRST-TO-OTBND-DAY           04787099
047871                             PV-MSTR-FIRST-TO-TCLOS-DAY           04787199
047872                             PV-MSTR-FIRST-TO-SHIP-DAY            04787299
047873                             PV-MSTR-LAST-TO-OTBND-DAY            04787399
047874                             PV-MSTR-LAST-TO-TCLOS-DAY            04787499
047875                             PV-MSTR-LAST-TO-SHIP-DAY             04787599
047876                             PV-ON-OTBND-TO-CLOS-DAY              04787699
047877                             PV-ON-OTBND-TO-SHIP-DAY.             04787799
047878                                                                  04787899
047879     IF  PV-P2L-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04787999
047880         PV-P2L-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04788099
047881         DIVIDE  PV-P2L-TRIP-OPEN-TO-CLOSE-MIN                    04788199
047882             BY  PV-P2L-TRIP-OPEN-TO-CLOSE-CNT                    04788299
047883         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04788399
047884                 ROUNDED                                          04788499
047885         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04788599
047886             BY  1440                                             04788699
047887         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04788799
047888                 ROUNDED                                          04788899
047889     ELSE                                                         04788999
047890         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04789099
047891                           PV-TRIP-OPEN-TO-CLOSE-DAY              04789199
047892     END-IF.                                                      04789299
047893                                                                  04789399
047894     IF  PV-P2L-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04789499
047895         PV-P2L-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04789599
047896         DIVIDE  PV-P2L-TRIP-CLOSE-TO-SHIP-MIN                    04789699
047897             BY  PV-P2L-TRIP-CLOSE-TO-SHIP-CNT                    04789799
047898         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04789899
047899                 ROUNDED                                          04789999
047900         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04790099
047901             BY  1440                                             04790199
047902         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04790299
047903                 ROUNDED                                          04790399
047904     ELSE                                                         04790499
047905         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04790599
047906                           PV-TRIP-CLOSE-TO-SHIP-DAY              04790699
047907     END-IF.                                                      04790799
047908                                                                  04790899
047909     IF  PV-P2L-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04790999
047910         PV-P2L-TRIP-OPEN-TO-SHIP-CNT  >  0                       04791099
047911         DIVIDE  PV-P2L-TRIP-OPEN-TO-SHIP-MIN                     04791199
047912             BY  PV-P2L-TRIP-OPEN-TO-SHIP-CNT                     04791299
047913         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04791399
047914                 ROUNDED                                          04791499
047915         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04791599
047916             BY  1440                                             04791699
047917         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04791799
047918                 ROUNDED                                          04791899
047919     ELSE                                                         04791999
047920         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04792099
047921                           PV-TRIP-OPEN-TO-SHIP-DAY               04792199
047922     END-IF.                                                      04792299
047923                                                                  04792399
047924                                                                  04792499
047925     IF  PV-P2L-ARRIVE-TO-PRC-MIN  >  0  AND                      04792599
047926         PV-P2L-ARRIVE-TO-PRC-CNT  >  0                           04792699
047927         DIVIDE PV-P2L-ARRIVE-TO-PRC-MIN                          04792799
047928             BY PV-P2L-ARRIVE-TO-PRC-CNT                          04792899
047929         GIVING PV-ARRIVE-TO-PRC-AVG                              04792999
047930                 ROUNDED                                          04793099
047931         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04793199
047932             BY 1440                                              04793299
047933         GIVING PV-ARRIVE-TO-PRC-DAY                              04793399
047934                 ROUNDED                                          04793499
047935     ELSE                                                         04793599
047936         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04793699
047937                           PV-ARRIVE-TO-PRC-DAY                   04793799
047938     END-IF.                                                      04793899
047939                                                                  04793999
047940     IF  PV-P2L-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04794099
047941         PV-P2L-ARRIVE-TO-P2L-PKD-CNT  >  0                       04794199
047942         DIVIDE PV-P2L-ARRIVE-TO-P2L-PKD-MIN                      04794299
047943             BY PV-P2L-ARRIVE-TO-P2L-PKD-CNT                      04794399
047944         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04794499
047945                 ROUNDED                                          04794599
047946         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04794699
047947             BY 1440                                              04794799
047948         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04794899
047949                 ROUNDED                                          04794999
047950     ELSE                                                         04795099
047951         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04795199
047952                           PV-ARRIVE-TO-P2L-PKD-DAY               04795299
047953     END-IF.                                                      04795399
047954                                                                  04795499
047955                                                                  04795599
047956     IF  PV-P2L-PRC-TO-P2L-PKD-MIN  >  0  AND                     04795699
047957         PV-P2L-PRC-TO-P2L-PKD-CNT  >  0                          04795799
047958         DIVIDE PV-P2L-PRC-TO-P2L-PKD-MIN                         04795899
047959             BY PV-P2L-PRC-TO-P2L-PKD-CNT                         04795999
047960         GIVING PV-PRC-TO-P2L-PKD-AVG                             04796099
047961                 ROUNDED                                          04796199
047962         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04796299
047963             BY 1440                                              04796399
047964         GIVING PV-PRC-TO-P2L-PKD-DAY                             04796499
047965                 ROUNDED                                          04796599
047966     ELSE                                                         04796699
047967         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04796799
047968                           PV-PRC-TO-P2L-PKD-DAY                  04796899
047969     END-IF.                                                      04796999
047970                                                                  04797099
047971     IF  PV-P2L-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04797199
047972         PV-P2L-P2L-PKD-TO-CLOSE-CNT  >  0                        04797299
047973         DIVIDE PV-P2L-P2L-PKD-TO-CLOSE-MIN                       04797399
047974             BY PV-P2L-P2L-PKD-TO-CLOSE-CNT                       04797499
047975         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04797599
047976                 ROUNDED                                          04797699
047977         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04797799
047978             BY 1440                                              04797899
047979         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04797999
047980                 ROUNDED                                          04798099
047981     ELSE                                                         04798199
047982         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04798299
047983                           PV-P2L-PKD-TO-CLOSE-DAY                04798399
047984     END-IF.                                                      04798499
047985                                                                  04798599
047986     IF  PV-P2L-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04798699
047987         PV-P2L-P2L-OPEN-TO-CLOSE-CNT  >  0                       04798799
047988         DIVIDE PV-P2L-P2L-OPEN-TO-CLOSE-MIN                      04798899
047989             BY PV-P2L-P2L-OPEN-TO-CLOSE-CNT                      04798999
047990         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04799099
047991                 ROUNDED                                          04799199
047992         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04799299
047993             BY 1440                                              04799399
047994         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04799499
047995                 ROUNDED                                          04799599
047996     ELSE                                                         04799699
047997         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04799799
047998                           PV-P2L-OPEN-TO-CLOSE-DAY               04799899
047999     END-IF.                                                      04799999
048000                                                                  04800099
048001     IF  PV-P2L-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04800199
048002         PV-P2L-P2L-OPEN-TO-OTBND-CNT  >  0                       04800299
048003         DIVIDE PV-P2L-P2L-OPEN-TO-OTBND-MIN                      04800399
048004             BY PV-P2L-P2L-OPEN-TO-OTBND-CNT                      04800499
048005         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04800599
048006                 ROUNDED                                          04800699
048007         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04800799
048008             BY 1440                                              04800899
048009         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04800999
048010                 ROUNDED                                          04801099
048011     ELSE                                                         04801199
048012         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04801299
048013                           PV-P2L-OPEN-TO-OTBND-DAY               04801399
048014     END-IF.                                                      04801499
048015                                                                  04801599
048016     IF  PV-P2L-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04801699
048017         PV-P2L-P2L-CLOSE-TO-OTBND-CNT  >  0                      04801799
048018         DIVIDE PV-P2L-P2L-CLOSE-TO-OTBND-MIN                     04801899
048019             BY PV-P2L-P2L-CLOSE-TO-OTBND-CNT                     04801999
048020         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04802099
048021                 ROUNDED                                          04802199
048022         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04802299
048023             BY 1440                                              04802399
048024         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04802499
048025                 ROUNDED                                          04802599
048026     ELSE                                                         04802699
048027         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04802799
048028                           PV-P2L-CLOSE-TO-OTBND-DAY              04802899
048029     END-IF.                                                      04802999
048030                                                                  04803099
048031     IF  PV-P2L-ARRIVE-TO-OTBND-MIN  >  0  AND                    04803199
048032         PV-P2L-ARRIVE-TO-OTBND-CNT  >  0                         04803299
048033         DIVIDE PV-P2L-ARRIVE-TO-OTBND-MIN                        04803399
048034             BY PV-P2L-ARRIVE-TO-OTBND-CNT                        04803499
048035         GIVING PV-ARRIVE-TO-OTBND-AVG                            04803599
048036                 ROUNDED                                          04803699
048037         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04803799
048038             BY 1440                                              04803899
048039         GIVING PV-ARRIVE-TO-OTBND-DAY                            04803999
048040                 ROUNDED                                          04804099
048041     ELSE                                                         04804199
048042         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04804299
048043                           PV-ARRIVE-TO-OTBND-DAY                 04804399
048044     END-IF.                                                      04804499
048045                                                                  04804599
048046     IF  PV-P2L-PRC-TO-OTBND-MIN  >  0  AND                       04804699
048047         PV-P2L-PRC-TO-OTBND-CNT  >  0                            04804799
048048         DIVIDE PV-P2L-PRC-TO-OTBND-MIN                           04804899
048049             BY PV-P2L-PRC-TO-OTBND-CNT                           04804999
048050         GIVING PV-PRC-TO-OTBND-AVG                               04805099
048051                 ROUNDED                                          04805199
048052         DIVIDE PV-PRC-TO-OTBND-AVG                               04805299
048053             BY 1440                                              04805399
048054         GIVING PV-PRC-TO-OTBND-DAY                               04805499
048055                 ROUNDED                                          04805599
048056     ELSE                                                         04805699
048057         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04805799
048058                           PV-PRC-TO-OTBND-DAY                    04805899
048059     END-IF.                                                      04805999
048060                                                                  04806099
048061     IF  PV-P2L-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04806199
048062         PV-P2L-ARRIVE-TO-TCLOS-CNT  >  0                         04806299
048063         DIVIDE PV-P2L-ARRIVE-TO-TCLOS-MIN                        04806399
048064             BY PV-P2L-ARRIVE-TO-TCLOS-CNT                        04806499
048065         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04806599
048066                 ROUNDED                                          04806699
048067         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04806799
048068             BY 1440                                              04806899
048069         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04806999
048070                 ROUNDED                                          04807099
048071     ELSE                                                         04807199
048072         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04807299
048073                           PV-ARRIVE-TO-TCLOS-DAY                 04807399
048074     END-IF.                                                      04807499
048075                                                                  04807599
048076     IF  PV-P2L-ARRIVE-TO-SHIP-MIN  >  0  AND                     04807699
048077         PV-P2L-ARRIVE-TO-SHIP-CNT  >  0                          04807799
048078         DIVIDE PV-P2L-ARRIVE-TO-SHIP-MIN                         04807899
048079             BY PV-P2L-ARRIVE-TO-SHIP-CNT                         04807999
048080         GIVING PV-ARRIVE-TO-SHIP-AVG                             04808099
048081                 ROUNDED                                          04808199
048082         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04808299
048083             BY 1440                                              04808399
048084         GIVING PV-ARRIVE-TO-SHIP-DAY                             04808499
048085                 ROUNDED                                          04808599
048086     ELSE                                                         04808699
048087         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04808799
048088                           PV-ARRIVE-TO-SHIP-DAY                  04808899
048089     END-IF.                                                      04808999
048090                                                                  04809099
048091     IF  PV-P2L-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04809199
048092         PV-P2L-P2L-OPEN-TO-TCLOS-CNT  >  0                       04809299
048093         DIVIDE PV-P2L-P2L-OPEN-TO-TCLOS-MIN                      04809399
048094             BY PV-P2L-P2L-OPEN-TO-TCLOS-CNT                      04809499
048095         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04809599
048096                 ROUNDED                                          04809699
048097         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04809799
048098             BY 1440                                              04809899
048099         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04809999
048100                 ROUNDED                                          04810099
048101     ELSE                                                         04810199
048102         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04810299
048103                           PV-P2L-OPEN-TO-TCLOS-DAY               04810399
048104     END-IF.                                                      04810499
048105                                                                  04810599
048106     IF  PV-P2L-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04810699
048107         PV-P2L-P2L-OPEN-TO-SHIP-CNT  >  0                        04810799
048108         DIVIDE PV-P2L-P2L-OPEN-TO-SHIP-MIN                       04810899
048109             BY PV-P2L-P2L-OPEN-TO-SHIP-CNT                       04810999
048110         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04811099
048111                 ROUNDED                                          04811199
048112         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04811299
048113             BY 1440                                              04811399
048114         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04811499
048115                 ROUNDED                                          04811599
048116     ELSE                                                         04811699
048117         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04811799
048118                           PV-P2L-OPEN-TO-SHIP-DAY                04811899
048119     END-IF.                                                      04811999
048120                                                                  04812099
048121     IF  PV-P2L-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04812199
048122         PV-P2L-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04812299
048123         DIVIDE PV-P2L-P2L-CLOSE-TO-TCLOS-MIN                     04812399
048124             BY PV-P2L-P2L-CLOSE-TO-TCLOS-CNT                     04812499
048125         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04812599
048126                 ROUNDED                                          04812699
048127         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04812799
048128             BY 1440                                              04812899
048129         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04812999
048130                 ROUNDED                                          04813099
048131     ELSE                                                         04813199
048132         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04813299
048133                           PV-P2L-CLOSE-TO-TCLOS-DAY              04813399
048134     END-IF.                                                      04813499
048135                                                                  04813599
048136     IF  PV-P2L-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04813699
048137         PV-P2L-P2L-CLOSE-TO-SHIP-CNT  >  0                       04813799
048138         DIVIDE PV-P2L-P2L-CLOSE-TO-SHIP-MIN                      04813899
048139             BY PV-P2L-P2L-CLOSE-TO-SHIP-CNT                      04813999
048140         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04814099
048141                 ROUNDED                                          04814199
048142         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04814299
048143             BY 1440                                              04814399
048144         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04814499
048145                 ROUNDED                                          04814599
048146     ELSE                                                         04814699
048147         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04814799
048148                           PV-P2L-CLOSE-TO-SHIP-DAY               04814899
048149     END-IF.                                                      04814999
048150                                                                  04815099
048151     IF  PV-P2L-ARRIVE-TO-MSTR-MIN  >  0  AND                     04815199
048152         PV-P2L-ARRIVE-TO-MSTR-CNT  >  0                          04815299
048153         DIVIDE PV-P2L-ARRIVE-TO-MSTR-MIN                         04815399
048154             BY PV-P2L-ARRIVE-TO-MSTR-CNT                         04815499
048155         GIVING PV-ARRIVE-TO-MSTR-AVG                             04815599
048156                 ROUNDED                                          04815699
048157         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04815799
048158             BY 1440                                              04815899
048159         GIVING PV-ARRIVE-TO-MSTR-DAY                             04815999
048160                 ROUNDED                                          04816099
048161     ELSE                                                         04816199
048162         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04816299
048163                           PV-ARRIVE-TO-MSTR-DAY                  04816399
048164     END-IF.                                                      04816499
048165                                                                  04816599
048166     IF  PV-P2L-PRC-TO-MSTR-MIN  >  0  AND                        04816699
048167         PV-P2L-PRC-TO-MSTR-CNT  >  0                             04816799
048168         DIVIDE PV-P2L-PRC-TO-MSTR-MIN                            04816899
048169             BY PV-P2L-PRC-TO-MSTR-CNT                            04816999
048170         GIVING PV-PRC-TO-MSTR-AVG                                04817099
048171                 ROUNDED                                          04817199
048172         DIVIDE PV-PRC-TO-MSTR-AVG                                04817299
048173             BY 1440                                              04817399
048174         GIVING PV-PRC-TO-MSTR-DAY                                04817499
048175                 ROUNDED                                          04817599
048176     ELSE                                                         04817699
048177         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04817799
048178                           PV-PRC-TO-MSTR-DAY                     04817899
048179     END-IF.                                                      04817999
048180                                                                  04818099
048181     IF  PV-P2L-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04818199
048182         PV-P2L-ON-OTBND-TO-CLOS-CNT  >  0                        04818299
048183         DIVIDE PV-P2L-ON-OTBND-TO-CLOS-MIN                       04818399
048184             BY PV-P2L-ON-OTBND-TO-CLOS-CNT                       04818499
048185         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04818599
048186                 ROUNDED                                          04818699
048187         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04818799
048188             BY 1440                                              04818899
048189         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04818999
048190                 ROUNDED                                          04819099
048191     ELSE                                                         04819199
048192         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04819299
048193                           PV-ON-OTBND-TO-CLOS-DAY                04819399
048194     END-IF.                                                      04819499
048195                                                                  04819599
048196     IF  PV-P2L-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04819699
048197         PV-P2L-ON-OTBND-TO-SHIP-CNT  >  0                        04819799
048198         DIVIDE PV-P2L-ON-OTBND-TO-SHIP-MIN                       04819899
048199             BY PV-P2L-ON-OTBND-TO-SHIP-CNT                       04819999
048200         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04820099
048201                 ROUNDED                                          04820199
048202         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04820299
048203             BY 1440                                              04820399
048204         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04820499
048205                 ROUNDED                                          04820599
048206     ELSE                                                         04820699
048207         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04820799
048208                           PV-ON-OTBND-TO-SHIP-DAY                04820899
048209     END-IF.                                                      04820999
048210                                                                  04821099
048211     IF  PV-P2L-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04821199
048212         PV-P2L-MSTR-CRE-TO-OTBND-CNT  >  0                       04821299
048213         DIVIDE PV-P2L-MSTR-CRE-TO-OTBND-MIN                      04821399
048214             BY PV-P2L-MSTR-CRE-TO-OTBND-CNT                      04821499
048215         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04821599
048216                 ROUNDED                                          04821699
048217         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04821799
048218             BY 1440                                              04821899
048219         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04821999
048220                 ROUNDED                                          04822099
048221     ELSE                                                         04822199
048222         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04822299
048223                           PV-MSTR-CRE-TO-OTBND-DAY               04822399
048224     END-IF.                                                      04822499
048225                                                                  04822599
048226     IF  PV-P2L-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04822699
048227         PV-P2L-MSTR-CRE-TO-TCLOS-CNT  >  0                       04822799
048228         DIVIDE PV-P2L-MSTR-CRE-TO-TCLOS-MIN                      04822899
048229             BY PV-P2L-MSTR-CRE-TO-TCLOS-CNT                      04822999
048230         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04823099
048231                 ROUNDED                                          04823199
048232         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04823299
048233             BY 1440                                              04823399
048234         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04823499
048235                 ROUNDED                                          04823599
048236     ELSE                                                         04823699
048237         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04823799
048238                           PV-MSTR-CRE-TO-TCLOS-DAY               04823899
048239     END-IF.                                                      04823999
048240                                                                  04824099
048241     IF  PV-P2L-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04824199
048242         PV-P2L-MSTR-CRE-TO-SHIP-CNT  >  0                        04824299
048243         DIVIDE PV-P2L-MSTR-CRE-TO-SHIP-MIN                       04824399
048244             BY PV-P2L-MSTR-CRE-TO-SHIP-CNT                       04824499
048245         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04824599
048246                 ROUNDED                                          04824699
048247         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04824799
048248             BY 1440                                              04824899
048249         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04824999
048250                 ROUNDED                                          04825099
048251     ELSE                                                         04825199
048252         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04825299
048253                           PV-MSTR-CRE-TO-SHIP-DAY                04825399
048254     END-IF.                                                      04825499
048255                                                                  04825599
048256     IF  PV-P2L-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04825699
048257         PV-P2L-MSTR-FIRST-TO-OTBND-CNT  >  0                     04825799
048258         DIVIDE PV-P2L-MSTR-FIRST-TO-OTBND-MIN                    04825899
048259             BY PV-P2L-MSTR-FIRST-TO-OTBND-CNT                    04825999
048260         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04826099
048261                 ROUNDED                                          04826199
048262         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04826299
048263             BY 1440                                              04826399
048264         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04826499
048265                 ROUNDED                                          04826599
048266     ELSE                                                         04826699
048267         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04826799
048268                           PV-MSTR-FIRST-TO-OTBND-DAY             04826899
048269     END-IF.                                                      04826999
048270                                                                  04827099
048271     IF  PV-P2L-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04827199
048272         PV-P2L-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04827299
048273         DIVIDE PV-P2L-MSTR-FIRST-TO-TCLOS-MIN                    04827399
048274             BY PV-P2L-MSTR-FIRST-TO-TCLOS-CNT                    04827499
048275         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04827599
048276                 ROUNDED                                          04827699
048277         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04827799
048278             BY 1440                                              04827899
048279         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04827999
048280                 ROUNDED                                          04828099
048281     ELSE                                                         04828199
048282         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04828299
048283                           PV-MSTR-FIRST-TO-TCLOS-DAY             04828399
048284     END-IF.                                                      04828499
048285                                                                  04828599
048286     IF  PV-P2L-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04828699
048287         PV-P2L-MSTR-FIRST-TO-SHIP-CNT  >  0                      04828799
048288         DIVIDE PV-P2L-MSTR-FIRST-TO-SHIP-MIN                     04828899
048289             BY PV-P2L-MSTR-FIRST-TO-SHIP-CNT                     04828999
048290         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04829099
048291                 ROUNDED                                          04829199
048292         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04829299
048293             BY 1440                                              04829399
048294         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04829499
048295                 ROUNDED                                          04829599
048296     ELSE                                                         04829699
048297         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04829799
048298                           PV-MSTR-FIRST-TO-SHIP-DAY              04829899
048299     END-IF.                                                      04829999
048300                                                                  04830099
048301     IF  PV-P2L-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04830199
048302         PV-P2L-MSTR-LAST-TO-OTBND-CNT  >  0                      04830299
048303         DIVIDE PV-P2L-MSTR-LAST-TO-OTBND-MIN                     04830399
048304             BY PV-P2L-MSTR-LAST-TO-OTBND-CNT                     04830499
048305         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04830599
048306                 ROUNDED                                          04830699
048307         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04830799
048308             BY 1440                                              04830899
048309         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04830999
048310                 ROUNDED                                          04831099
048311     ELSE                                                         04831199
048312         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04831299
048313                           PV-MSTR-LAST-TO-OTBND-DAY              04831399
048314     END-IF.                                                      04831499
048315                                                                  04831599
048316     IF  PV-P2L-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04831699
048317         PV-P2L-MSTR-LAST-TO-TCLOS-CNT  >  0                      04831799
048318         DIVIDE PV-P2L-MSTR-LAST-TO-TCLOS-MIN                     04831899
048319             BY PV-P2L-MSTR-LAST-TO-TCLOS-CNT                     04831999
048320         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04832099
048321                 ROUNDED                                          04832199
048322         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04832299
048323             BY 1440                                              04832399
048324         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04832499
048325                 ROUNDED                                          04832599
048326     ELSE                                                         04832699
048327         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04832799
048328                           PV-MSTR-LAST-TO-TCLOS-DAY              04832899
048329     END-IF.                                                      04832999
048330                                                                  04833099
048331     IF  PV-P2L-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04833199
048332         PV-P2L-MSTR-LAST-TO-SHIP-CNT  >  0                       04833299
048333         DIVIDE PV-P2L-MSTR-LAST-TO-SHIP-MIN                      04833399
048334             BY PV-P2L-MSTR-LAST-TO-SHIP-CNT                      04833499
048335         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04833599
048336                 ROUNDED                                          04833699
048337         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04833799
048338             BY 1440                                              04833899
048339         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04833999
048340                 ROUNDED                                          04834099
048341     ELSE                                                         04834199
048342         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04834299
048343                           PV-MSTR-LAST-TO-SHIP-DAY               04834399
048344     END-IF.                                                      04834499
048345*                                                                 04834599
048346*** 8/19                                                          04834699
048347*                                                                 04834799
048348     IF  PV-P2L-TRIP-CARTONS            >  0  AND                 04834899
048349         PV-P2L-TRIP-SRC-CARTONS        >  0                      04834999
048350         DIVIDE  PV-P2L-TRIP-SRC-CARTONS                          04835099
048351             BY  PV-P2L-TRIP-CARTONS                              04835199
048352         GIVING  PV-TRIP-SRC-CRTN                                 04835299
048353                   ROUNDED                                        04835399
048354         MULTIPLY  PV-TRIP-SRC-CRTN                               04835499
048355               BY  100                                            04835599
048356           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04835699
048357     ELSE                                                         04835799
048358         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04835899
048359                           PV-TRIP-SRC-CRTN                       04835999
048360     END-IF.                                                      04836099
048361                                                                  04836199
048362                                                                  04836299
048363     MOVE ZEROES                TO DL1-DC-NBR                     04836399
048364     MOVE 'CORP OVERALL    '    TO DL1-DC-NAME                    04836499
048365     MOVE 'PACK-TO-LIGHT   '    TO DL1-SOURCE                     04836599
048366                                                                  04836699
048367     IF   SU134-EFC-STORES  AND                                   04836799
048368          PV-P2L-TRIP-SRC-CARTONS  =   0                          04836899
048369             CONTINUE                                             04836999
048370     ELSE                                                         04837099
048371     IF   SU134-LFC-STORES  AND                                   04837199
048372          PV-P2L-TRIP-SRC-CARTONS  =   0                          04837299
048373             CONTINUE                                             04837399
048374     ELSE                                                         04837499
048375         PERFORM 5030-PRINT-CORP-TOTALS                           04837599
048376     END-IF                                                       04837699
048377     END-IF.                                                      04837799
048378                                                                  04837899
048379                                                                  04837999
048380****************************************************************  04838099
048381* CALCULATE MST-AVERAGES                                       *  04838199
048382****************************************************************  04838299
048383 3075-CALC-MST-AVERAGES.                                          04838399
048384                                                                  04838499
048385     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04838599
048386                             PV-TRIP-CLOSE-TO-SHIP-AVG            04838699
048387                             PV-TRIP-OPEN-TO-SHIP-AVG             04838799
048388                             PV-ARRIVE-TO-PRC-AVG                 04838899
048389                             PV-ARRIVE-TO-P2L-PKD-AVG             04838999
048390                             PV-PRC-TO-P2L-PKD-AVG                04839099
048391                             PV-P2L-PKD-TO-CLOSE-AVG              04839199
048392                             PV-P2L-OPEN-TO-CLOSE-AVG             04839299
048393                             PV-P2L-OPEN-TO-OTBND-AVG             04839399
048394                             PV-P2L-CLOSE-TO-OTBND-AVG            04839499
048395                             PV-ARRIVE-TO-OTBND-AVG               04839599
048396                             PV-PRC-TO-OTBND-AVG                  04839699
048397                             PV-ARRIVE-TO-TCLOS-AVG               04839799
048398                             PV-ARRIVE-TO-SHIP-AVG                04839899
048399                             PV-P2L-OPEN-TO-TCLOS-AVG             04839999
048400                             PV-P2L-OPEN-TO-SHIP-AVG              04840099
048401                             PV-P2L-CLOSE-TO-TCLOS-AVG            04840199
048402                             PV-P2L-CLOSE-TO-SHIP-AVG             04840299
048403                             PV-ARRIVE-TO-MSTR-AVG                04840399
048404                             PV-PRC-TO-MSTR-AVG                   04840499
048405                             PV-MSTR-CRE-TO-OTBND-AVG             04840599
048406                             PV-MSTR-CRE-TO-TCLOS-AVG             04840699
048407                             PV-MSTR-CRE-TO-SHIP-AVG              04840799
048408                             PV-MSTR-FIRST-TO-OTBND-AVG           04840899
048409                             PV-MSTR-FIRST-TO-TCLOS-AVG           04840999
048410                             PV-MSTR-FIRST-TO-SHIP-AVG            04841099
048411                             PV-MSTR-LAST-TO-OTBND-AVG            04841199
048412                             PV-MSTR-LAST-TO-TCLOS-AVG            04841299
048413                             PV-MSTR-LAST-TO-SHIP-AVG             04841399
048414                             PV-ON-OTBND-TO-CLOS-AVG              04841499
048415                             PV-ON-OTBND-TO-SHIP-AVG              04841599
048416                             PV-TRIP-OPEN-TO-CLOSE-DAY            04841699
048417                             PV-TRIP-CLOSE-TO-SHIP-DAY            04841799
048418                             PV-TRIP-OPEN-TO-SHIP-DAY             04841899
048419                             PV-ARRIVE-TO-PRC-DAY                 04841999
048420                             PV-ARRIVE-TO-P2L-PKD-DAY             04842099
048421                             PV-PRC-TO-P2L-PKD-DAY                04842199
048422                             PV-P2L-PKD-TO-CLOSE-DAY              04842299
048423                             PV-P2L-OPEN-TO-CLOSE-DAY             04842399
048424                             PV-P2L-OPEN-TO-OTBND-DAY             04842499
048425                             PV-P2L-CLOSE-TO-OTBND-DAY            04842599
048426                             PV-ARRIVE-TO-OTBND-DAY               04842699
048427                             PV-PRC-TO-OTBND-DAY                  04842799
048428                             PV-ARRIVE-TO-TCLOS-DAY               04842899
048429                             PV-ARRIVE-TO-SHIP-DAY                04842999
048430                             PV-P2L-OPEN-TO-TCLOS-DAY             04843099
048431                             PV-P2L-OPEN-TO-SHIP-DAY              04843199
048432                             PV-P2L-CLOSE-TO-TCLOS-DAY            04843299
048433                             PV-P2L-CLOSE-TO-SHIP-DAY             04843399
048434                             PV-ARRIVE-TO-MSTR-DAY                04843499
048435                             PV-PRC-TO-MSTR-DAY                   04843599
048436                             PV-MSTR-CRE-TO-OTBND-DAY             04843699
048437                             PV-MSTR-CRE-TO-TCLOS-DAY             04843799
048438                             PV-MSTR-CRE-TO-SHIP-DAY              04843899
048439                             PV-MSTR-FIRST-TO-OTBND-DAY           04843999
048440                             PV-MSTR-FIRST-TO-TCLOS-DAY           04844099
048441                             PV-MSTR-FIRST-TO-SHIP-DAY            04844199
048442                             PV-MSTR-LAST-TO-OTBND-DAY            04844299
048443                             PV-MSTR-LAST-TO-TCLOS-DAY            04844399
048444                             PV-MSTR-LAST-TO-SHIP-DAY             04844499
048445                             PV-ON-OTBND-TO-CLOS-DAY              04844599
048446                             PV-ON-OTBND-TO-SHIP-DAY.             04844699
048447                                                                  04844799
048448     IF  PV-MST-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04844899
048449         PV-MST-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04844999
048450         DIVIDE  PV-MST-TRIP-OPEN-TO-CLOSE-MIN                    04845099
048451             BY  PV-MST-TRIP-OPEN-TO-CLOSE-CNT                    04845199
048452         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04845299
048453                 ROUNDED                                          04845399
048454         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04845499
048455             BY  1440                                             04845599
048456         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04845699
048457                 ROUNDED                                          04845799
048458     ELSE                                                         04845899
048459         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04845999
048460                           PV-TRIP-OPEN-TO-CLOSE-DAY              04846099
048461     END-IF.                                                      04846199
048462                                                                  04846299
048463     IF  PV-MST-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04846399
048464         PV-MST-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04846499
048465         DIVIDE  PV-MST-TRIP-CLOSE-TO-SHIP-MIN                    04846599
048466             BY  PV-MST-TRIP-CLOSE-TO-SHIP-CNT                    04846699
048467         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04846799
048468                 ROUNDED                                          04846899
048469         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04846999
048470             BY  1440                                             04847099
048471         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04847199
048472                 ROUNDED                                          04847299
048473     ELSE                                                         04847399
048474         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04847499
048475                           PV-TRIP-CLOSE-TO-SHIP-DAY              04847599
048476     END-IF.                                                      04847699
048477                                                                  04847799
048478     IF  PV-MST-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04847899
048479         PV-MST-TRIP-OPEN-TO-SHIP-CNT  >  0                       04847999
048480         DIVIDE  PV-MST-TRIP-OPEN-TO-SHIP-MIN                     04848099
048481             BY  PV-MST-TRIP-OPEN-TO-SHIP-CNT                     04848199
048482         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04848299
048483                 ROUNDED                                          04848399
048484         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04848499
048485             BY  1440                                             04848599
048486         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04848699
048487                 ROUNDED                                          04848799
048488     ELSE                                                         04848899
048489         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04848999
048490                           PV-TRIP-OPEN-TO-SHIP-DAY               04849099
048491     END-IF.                                                      04849199
048492                                                                  04849299
048493                                                                  04849399
048494     IF  PV-MST-ARRIVE-TO-PRC-MIN  >  0  AND                      04849499
048495         PV-MST-ARRIVE-TO-PRC-CNT  >  0                           04849599
048496         DIVIDE PV-MST-ARRIVE-TO-PRC-MIN                          04849699
048497             BY PV-MST-ARRIVE-TO-PRC-CNT                          04849799
048498         GIVING PV-ARRIVE-TO-PRC-AVG                              04849899
048499                 ROUNDED                                          04849999
048500         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04850099
048501             BY 1440                                              04850199
048502         GIVING PV-ARRIVE-TO-PRC-DAY                              04850299
048503                 ROUNDED                                          04850399
048504     ELSE                                                         04850499
048505         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04850599
048506                           PV-ARRIVE-TO-PRC-DAY                   04850699
048507     END-IF.                                                      04850799
048508                                                                  04850899
048509     IF  PV-MST-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04850999
048510         PV-MST-ARRIVE-TO-P2L-PKD-CNT  >  0                       04851099
048511         DIVIDE PV-MST-ARRIVE-TO-P2L-PKD-MIN                      04851199
048512             BY PV-MST-ARRIVE-TO-P2L-PKD-CNT                      04851299
048513         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04851399
048514                 ROUNDED                                          04851499
048515         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04851599
048516             BY 1440                                              04851699
048517         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04851799
048518                 ROUNDED                                          04851899
048519     ELSE                                                         04851999
048520         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04852099
048521                           PV-ARRIVE-TO-P2L-PKD-DAY               04852199
048522     END-IF.                                                      04852299
048523                                                                  04852399
048524                                                                  04852499
048525     IF  PV-MST-PRC-TO-P2L-PKD-MIN  >  0  AND                     04852599
048526         PV-MST-PRC-TO-P2L-PKD-CNT  >  0                          04852699
048527         DIVIDE PV-MST-PRC-TO-P2L-PKD-MIN                         04852799
048528             BY PV-MST-PRC-TO-P2L-PKD-CNT                         04852899
048529         GIVING PV-PRC-TO-P2L-PKD-AVG                             04852999
048530                 ROUNDED                                          04853099
048531         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04853199
048532             BY 1440                                              04853299
048533         GIVING PV-PRC-TO-P2L-PKD-DAY                             04853399
048534                 ROUNDED                                          04853499
048535     ELSE                                                         04853599
048536         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04853699
048537                           PV-PRC-TO-P2L-PKD-DAY                  04853799
048538     END-IF.                                                      04853899
048539                                                                  04853999
048540     IF  PV-MST-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04854099
048541         PV-MST-P2L-PKD-TO-CLOSE-CNT  >  0                        04854199
048542         DIVIDE PV-MST-P2L-PKD-TO-CLOSE-MIN                       04854299
048543             BY PV-MST-P2L-PKD-TO-CLOSE-CNT                       04854399
048544         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04854499
048545                 ROUNDED                                          04854599
048546         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04854699
048547             BY 1440                                              04854799
048548         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04854899
048549                 ROUNDED                                          04854999
048550     ELSE                                                         04855099
048551         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04855199
048552                           PV-P2L-PKD-TO-CLOSE-DAY                04855299
048553     END-IF.                                                      04855399
048554                                                                  04855499
048555     IF  PV-MST-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04855599
048556         PV-MST-P2L-OPEN-TO-CLOSE-CNT  >  0                       04855699
048557         DIVIDE PV-MST-P2L-OPEN-TO-CLOSE-MIN                      04855799
048558             BY PV-MST-P2L-OPEN-TO-CLOSE-CNT                      04855899
048559         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04855999
048560                 ROUNDED                                          04856099
048561         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04856199
048562             BY 1440                                              04856299
048563         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04856399
048564                 ROUNDED                                          04856499
048565     ELSE                                                         04856599
048566         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04856699
048567                           PV-P2L-OPEN-TO-CLOSE-DAY               04856799
048568     END-IF.                                                      04856899
048569                                                                  04856999
048570     IF  PV-MST-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04857099
048571         PV-MST-P2L-OPEN-TO-OTBND-CNT  >  0                       04857199
048572         DIVIDE PV-MST-P2L-OPEN-TO-OTBND-MIN                      04857299
048573             BY PV-MST-P2L-OPEN-TO-OTBND-CNT                      04857399
048574         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04857499
048575                 ROUNDED                                          04857599
048576         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04857699
048577             BY 1440                                              04857799
048578         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04857899
048579                 ROUNDED                                          04857999
048580     ELSE                                                         04858099
048581         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04858199
048582                           PV-P2L-OPEN-TO-OTBND-DAY               04858299
048583     END-IF.                                                      04858399
048584                                                                  04858499
048585     IF  PV-MST-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04858599
048586         PV-MST-P2L-CLOSE-TO-OTBND-CNT  >  0                      04858699
048587         DIVIDE PV-MST-P2L-CLOSE-TO-OTBND-MIN                     04858799
048588             BY PV-MST-P2L-CLOSE-TO-OTBND-CNT                     04858899
048589         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04858999
048590                 ROUNDED                                          04859099
048591         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04859199
048592             BY 1440                                              04859299
048593         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04859399
048594                 ROUNDED                                          04859499
048595     ELSE                                                         04859599
048596         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04859699
048597                           PV-P2L-CLOSE-TO-OTBND-DAY              04859799
048598     END-IF.                                                      04859899
048599                                                                  04859999
048600     IF  PV-MST-ARRIVE-TO-OTBND-MIN  >  0  AND                    04860099
048601         PV-MST-ARRIVE-TO-OTBND-CNT  >  0                         04860199
048602         DIVIDE PV-MST-ARRIVE-TO-OTBND-MIN                        04860299
048603             BY PV-MST-ARRIVE-TO-OTBND-CNT                        04860399
048604         GIVING PV-ARRIVE-TO-OTBND-AVG                            04860499
048605                 ROUNDED                                          04860599
048606         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04860699
048607             BY 1440                                              04860799
048608         GIVING PV-ARRIVE-TO-OTBND-DAY                            04860899
048609                 ROUNDED                                          04860999
048610     ELSE                                                         04861099
048611         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04861199
048612                           PV-ARRIVE-TO-OTBND-DAY                 04861299
048613     END-IF.                                                      04861399
048614                                                                  04861499
048615     IF  PV-MST-PRC-TO-OTBND-MIN  >  0  AND                       04861599
048616         PV-MST-PRC-TO-OTBND-CNT  >  0                            04861699
048617         DIVIDE PV-MST-PRC-TO-OTBND-MIN                           04861799
048618             BY PV-MST-PRC-TO-OTBND-CNT                           04861899
048619         GIVING PV-PRC-TO-OTBND-AVG                               04861999
048620                 ROUNDED                                          04862099
048621         DIVIDE PV-PRC-TO-OTBND-AVG                               04862199
048622             BY 1440                                              04862299
048623         GIVING PV-PRC-TO-OTBND-DAY                               04862399
048624                 ROUNDED                                          04862499
048625     ELSE                                                         04862599
048626         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04862699
048627                           PV-PRC-TO-OTBND-DAY                    04862799
048628     END-IF.                                                      04862899
048629                                                                  04862999
048630     IF  PV-MST-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04863099
048631         PV-MST-ARRIVE-TO-TCLOS-CNT  >  0                         04863199
048632         DIVIDE PV-MST-ARRIVE-TO-TCLOS-MIN                        04863299
048633             BY PV-MST-ARRIVE-TO-TCLOS-CNT                        04863399
048634         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04863499
048635                 ROUNDED                                          04863599
048636         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04863699
048637             BY 1440                                              04863799
048638         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04863899
048639                 ROUNDED                                          04863999
048640     ELSE                                                         04864099
048641         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04864199
048642                           PV-ARRIVE-TO-TCLOS-DAY                 04864299
048643     END-IF.                                                      04864399
048644                                                                  04864499
048645     IF  PV-MST-ARRIVE-TO-SHIP-MIN  >  0  AND                     04864599
048646         PV-MST-ARRIVE-TO-SHIP-CNT  >  0                          04864699
048647         DIVIDE PV-MST-ARRIVE-TO-SHIP-MIN                         04864799
048648             BY PV-MST-ARRIVE-TO-SHIP-CNT                         04864899
048649         GIVING PV-ARRIVE-TO-SHIP-AVG                             04864999
048650                 ROUNDED                                          04865099
048651         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04865199
048652             BY 1440                                              04865299
048653         GIVING PV-ARRIVE-TO-SHIP-DAY                             04865399
048654                 ROUNDED                                          04865499
048655     ELSE                                                         04865599
048656         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04865699
048657                           PV-ARRIVE-TO-SHIP-DAY                  04865799
048658     END-IF.                                                      04865899
048659                                                                  04865999
048660     IF  PV-MST-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04866099
048661         PV-MST-P2L-OPEN-TO-TCLOS-CNT  >  0                       04866199
048662         DIVIDE PV-MST-P2L-OPEN-TO-TCLOS-MIN                      04866299
048663             BY PV-MST-P2L-OPEN-TO-TCLOS-CNT                      04866399
048664         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04866499
048665                 ROUNDED                                          04866599
048666         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04866699
048667             BY 1440                                              04866799
048668         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04866899
048669                 ROUNDED                                          04866999
048670     ELSE                                                         04867099
048671         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04867199
048672                           PV-P2L-OPEN-TO-TCLOS-DAY               04867299
048673     END-IF.                                                      04867399
048674                                                                  04867499
048675     IF  PV-MST-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04867599
048676         PV-MST-P2L-OPEN-TO-SHIP-CNT  >  0                        04867699
048677         DIVIDE PV-MST-P2L-OPEN-TO-SHIP-MIN                       04867799
048678             BY PV-MST-P2L-OPEN-TO-SHIP-CNT                       04867899
048679         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04867999
048680                 ROUNDED                                          04868099
048681         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04868199
048682             BY 1440                                              04868299
048683         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04868399
048684                 ROUNDED                                          04868499
048685     ELSE                                                         04868599
048686         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04868699
048687                           PV-P2L-OPEN-TO-SHIP-DAY                04868799
048688     END-IF.                                                      04868899
048689                                                                  04868999
048690     IF  PV-MST-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04869099
048691         PV-MST-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04869199
048692         DIVIDE PV-MST-P2L-CLOSE-TO-TCLOS-MIN                     04869299
048693             BY PV-MST-P2L-CLOSE-TO-TCLOS-CNT                     04869399
048694         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04869499
048695                 ROUNDED                                          04869599
048696         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04869699
048697             BY 1440                                              04869799
048698         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04869899
048699                 ROUNDED                                          04869999
048700     ELSE                                                         04870099
048701         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04870199
048702                           PV-P2L-CLOSE-TO-TCLOS-DAY              04870299
048703     END-IF.                                                      04870399
048704                                                                  04870499
048705     IF  PV-MST-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04870599
048706         PV-MST-P2L-CLOSE-TO-SHIP-CNT  >  0                       04870699
048707         DIVIDE PV-MST-P2L-CLOSE-TO-SHIP-MIN                      04870799
048708             BY PV-MST-P2L-CLOSE-TO-SHIP-CNT                      04870899
048709         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04870999
048710                 ROUNDED                                          04871099
048711         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04871199
048712             BY 1440                                              04871299
048713         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04871399
048714                 ROUNDED                                          04871499
048715     ELSE                                                         04871599
048716         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04871699
048717                           PV-P2L-CLOSE-TO-SHIP-DAY               04871799
048718     END-IF.                                                      04871899
048719                                                                  04871999
048720     IF  PV-MST-ARRIVE-TO-MSTR-MIN  >  0  AND                     04872099
048721         PV-MST-ARRIVE-TO-MSTR-CNT  >  0                          04872199
048722         DIVIDE PV-MST-ARRIVE-TO-MSTR-MIN                         04872299
048723             BY PV-MST-ARRIVE-TO-MSTR-CNT                         04872399
048724         GIVING PV-ARRIVE-TO-MSTR-AVG                             04872499
048725                 ROUNDED                                          04872599
048726         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04872699
048727             BY 1440                                              04872799
048728         GIVING PV-ARRIVE-TO-MSTR-DAY                             04872899
048729                 ROUNDED                                          04872999
048730     ELSE                                                         04873099
048731         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04873199
048732                           PV-ARRIVE-TO-MSTR-DAY                  04873299
048733     END-IF.                                                      04873399
048734                                                                  04873499
048735     IF  PV-MST-PRC-TO-MSTR-MIN  >  0  AND                        04873599
048736         PV-MST-PRC-TO-MSTR-CNT  >  0                             04873699
048737         DIVIDE PV-MST-PRC-TO-MSTR-MIN                            04873799
048738             BY PV-MST-PRC-TO-MSTR-CNT                            04873899
048739         GIVING PV-PRC-TO-MSTR-AVG                                04873999
048740                 ROUNDED                                          04874099
048741         DIVIDE PV-PRC-TO-MSTR-AVG                                04874199
048742             BY 1440                                              04874299
048743         GIVING PV-PRC-TO-MSTR-DAY                                04874399
048744                 ROUNDED                                          04874499
048745     ELSE                                                         04874599
048746         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04874699
048747                           PV-PRC-TO-MSTR-DAY                     04874799
048748     END-IF.                                                      04874899
048749                                                                  04874999
048750     IF  PV-MST-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04875099
048751         PV-MST-ON-OTBND-TO-CLOS-CNT  >  0                        04875199
048752         DIVIDE PV-MST-ON-OTBND-TO-CLOS-MIN                       04875299
048753             BY PV-MST-ON-OTBND-TO-CLOS-CNT                       04875399
048754         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04875499
048755                 ROUNDED                                          04875599
048756         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04875699
048757             BY 1440                                              04875799
048758         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04875899
048759                 ROUNDED                                          04875999
048760     ELSE                                                         04876099
048761         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04876199
048762                           PV-ON-OTBND-TO-CLOS-DAY                04876299
048763     END-IF.                                                      04876399
048764                                                                  04876499
048765     IF  PV-MST-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04876599
048766         PV-MST-ON-OTBND-TO-SHIP-CNT  >  0                        04876699
048767         DIVIDE PV-MST-ON-OTBND-TO-SHIP-MIN                       04876799
048768             BY PV-MST-ON-OTBND-TO-SHIP-CNT                       04876899
048769         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04876999
048770                 ROUNDED                                          04877099
048771         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04877199
048772             BY 1440                                              04877299
048773         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04877399
048774                 ROUNDED                                          04877499
048775     ELSE                                                         04877599
048776         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04877699
048777                           PV-ON-OTBND-TO-SHIP-DAY                04877799
048778     END-IF.                                                      04877899
048779                                                                  04877999
048780     IF  PV-MST-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04878099
048781         PV-MST-MSTR-CRE-TO-OTBND-CNT  >  0                       04878199
048782         DIVIDE PV-MST-MSTR-CRE-TO-OTBND-MIN                      04878299
048783             BY PV-MST-MSTR-CRE-TO-OTBND-CNT                      04878399
048784         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04878499
048785                 ROUNDED                                          04878599
048786         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04878699
048787             BY 1440                                              04878799
048788         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04878899
048789                 ROUNDED                                          04878999
048790     ELSE                                                         04879099
048791         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04879199
048792                           PV-MSTR-CRE-TO-OTBND-DAY               04879299
048793     END-IF.                                                      04879399
048794                                                                  04879499
048795     IF  PV-MST-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04879599
048796         PV-MST-MSTR-CRE-TO-TCLOS-CNT  >  0                       04879699
048797         DIVIDE PV-MST-MSTR-CRE-TO-TCLOS-MIN                      04879799
048798             BY PV-MST-MSTR-CRE-TO-TCLOS-CNT                      04879899
048799         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04879999
048800                 ROUNDED                                          04880099
048801         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04880199
048802             BY 1440                                              04880299
048803         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04880399
048804                 ROUNDED                                          04880499
048805     ELSE                                                         04880599
048806         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04880699
048807                           PV-MSTR-CRE-TO-TCLOS-DAY               04880799
048808     END-IF.                                                      04880899
048809                                                                  04880999
048810     IF  PV-MST-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04881099
048811         PV-MST-MSTR-CRE-TO-SHIP-CNT  >  0                        04881199
048812         DIVIDE PV-MST-MSTR-CRE-TO-SHIP-MIN                       04881299
048813             BY PV-MST-MSTR-CRE-TO-SHIP-CNT                       04881399
048814         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04881499
048815                 ROUNDED                                          04881599
048816         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04881699
048817             BY 1440                                              04881799
048818         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04881899
048819                 ROUNDED                                          04881999
048820     ELSE                                                         04882099
048821         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04882199
048822                           PV-MSTR-CRE-TO-SHIP-DAY                04882299
048823     END-IF.                                                      04882399
048824                                                                  04882499
048825     IF  PV-MST-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04882599
048826         PV-MST-MSTR-FIRST-TO-OTBND-CNT  >  0                     04882699
048827         DIVIDE PV-MST-MSTR-FIRST-TO-OTBND-MIN                    04882799
048828             BY PV-MST-MSTR-FIRST-TO-OTBND-CNT                    04882899
048829         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04882999
048830                 ROUNDED                                          04883099
048831         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04883199
048832             BY 1440                                              04883299
048833         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04883399
048834                 ROUNDED                                          04883499
048835     ELSE                                                         04883599
048836         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04883699
048837                           PV-MSTR-FIRST-TO-OTBND-DAY             04883799
048838     END-IF.                                                      04883899
048839                                                                  04883999
048840     IF  PV-MST-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04884099
048841         PV-MST-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04884199
048842         DIVIDE PV-MST-MSTR-FIRST-TO-TCLOS-MIN                    04884299
048843             BY PV-MST-MSTR-FIRST-TO-TCLOS-CNT                    04884399
048844         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04884499
048845                 ROUNDED                                          04884599
048846         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04884699
048847             BY 1440                                              04884799
048848         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04884899
048849                 ROUNDED                                          04884999
048850     ELSE                                                         04885099
048851         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04885199
048852                           PV-MSTR-FIRST-TO-TCLOS-DAY             04885299
048853     END-IF.                                                      04885399
048854                                                                  04885499
048855     IF  PV-MST-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04885599
048856         PV-MST-MSTR-FIRST-TO-SHIP-CNT  >  0                      04885699
048857         DIVIDE PV-MST-MSTR-FIRST-TO-SHIP-MIN                     04885799
048858             BY PV-MST-MSTR-FIRST-TO-SHIP-CNT                     04885899
048859         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04885999
048860                 ROUNDED                                          04886099
048861         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04886199
048862             BY 1440                                              04886299
048863         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04886399
048864                 ROUNDED                                          04886499
048865     ELSE                                                         04886599
048866         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04886699
048867                           PV-MSTR-FIRST-TO-SHIP-DAY              04886799
048868     END-IF.                                                      04886899
048869                                                                  04886999
048870     IF  PV-MST-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04887099
048871         PV-MST-MSTR-LAST-TO-OTBND-CNT  >  0                      04887199
048872         DIVIDE PV-MST-MSTR-LAST-TO-OTBND-MIN                     04887299
048873             BY PV-MST-MSTR-LAST-TO-OTBND-CNT                     04887399
048874         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04887499
048875                 ROUNDED                                          04887599
048876         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04887699
048877             BY 1440                                              04887799
048878         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04887899
048879                 ROUNDED                                          04887999
048880     ELSE                                                         04888099
048881         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04888199
048882                           PV-MSTR-LAST-TO-OTBND-DAY              04888299
048883     END-IF.                                                      04888399
048884                                                                  04888499
048885     IF  PV-MST-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04888599
048886         PV-MST-MSTR-LAST-TO-TCLOS-CNT  >  0                      04888699
048887         DIVIDE PV-MST-MSTR-LAST-TO-TCLOS-MIN                     04888799
048888             BY PV-MST-MSTR-LAST-TO-TCLOS-CNT                     04888899
048889         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04888999
048890                 ROUNDED                                          04889099
048891         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04889199
048892             BY 1440                                              04889299
048893         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04889399
048894                 ROUNDED                                          04889499
048895     ELSE                                                         04889599
048896         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04889699
048897                           PV-MSTR-LAST-TO-TCLOS-DAY              04889799
048898     END-IF.                                                      04889899
048899                                                                  04889999
048900     IF  PV-MST-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04890099
048901         PV-MST-MSTR-LAST-TO-SHIP-CNT  >  0                       04890199
048902         DIVIDE PV-MST-MSTR-LAST-TO-SHIP-MIN                      04890299
048903             BY PV-MST-MSTR-LAST-TO-SHIP-CNT                      04890399
048904         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04890499
048905                 ROUNDED                                          04890599
048906         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04890699
048907             BY 1440                                              04890799
048908         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04890899
048909                 ROUNDED                                          04890999
048910     ELSE                                                         04891099
048911         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04891199
048912                           PV-MSTR-LAST-TO-SHIP-DAY               04891299
048913     END-IF.                                                      04891399
048914*                                                                 04891499
048915*** 8/19                                                          04891599
048916*                                                                 04891699
048917     IF  PV-MST-TRIP-CARTONS            >  0  AND                 04891799
048918         PV-MST-TRIP-SRC-CARTONS        >  0                      04891899
048919         DIVIDE  PV-MST-TRIP-SRC-CARTONS                          04891999
048920             BY  PV-MST-TRIP-CARTONS                              04892099
048921         GIVING  PV-TRIP-SRC-CRTN                                 04892199
048922                   ROUNDED                                        04892299
048923         MULTIPLY  PV-TRIP-SRC-CRTN                               04892399
048924               BY  100                                            04892499
048925           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04892599
048926     ELSE                                                         04892699
048927         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04892799
048928                           PV-TRIP-SRC-CRTN                       04892899
048929     END-IF.                                                      04892999
048930                                                                  04893099
048931                                                                  04893199
048932     MOVE ZEROES                TO DL4-DC-NBR                     04893299
048933     MOVE 'CORP OVERALL    '    TO DL4-DC-NAME                    04893399
048934     MOVE 'MASTER CONTAINER'    TO DL4-SOURCE                     04893499
048935     PERFORM 5060-PRINT-CORP-TOTALS.                              04893599
048936                                                                  04893699
048937                                                                  04893799
048938****************************************************************  04893899
048939* CALCULATE RDM-AVERAGES                                       *  04893999
048940****************************************************************  04894099
048941 3080-CALC-RDM-AVERAGES.                                          04894199
048942                                                                  04894299
048943     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04894399
048944                             PV-TRIP-CLOSE-TO-SHIP-AVG            04894499
048945                             PV-TRIP-OPEN-TO-SHIP-AVG             04894599
048946                             PV-ARRIVE-TO-PRC-AVG                 04894699
048947                             PV-ARRIVE-TO-P2L-PKD-AVG             04894799
048948                             PV-PRC-TO-P2L-PKD-AVG                04894899
048949                             PV-P2L-PKD-TO-CLOSE-AVG              04894999
048950                             PV-P2L-OPEN-TO-CLOSE-AVG             04895099
048951                             PV-P2L-OPEN-TO-OTBND-AVG             04895199
048952                             PV-P2L-CLOSE-TO-OTBND-AVG            04895299
048953                             PV-ARRIVE-TO-OTBND-AVG               04895399
048954                             PV-PRC-TO-OTBND-AVG                  04895499
048955                             PV-ARRIVE-TO-TCLOS-AVG               04895599
048956                             PV-ARRIVE-TO-SHIP-AVG                04895699
048957                             PV-P2L-OPEN-TO-TCLOS-AVG             04895799
048958                             PV-P2L-OPEN-TO-SHIP-AVG              04895899
048959                             PV-P2L-CLOSE-TO-TCLOS-AVG            04895999
048960                             PV-P2L-CLOSE-TO-SHIP-AVG             04896099
048961                             PV-ARRIVE-TO-MSTR-AVG                04896199
048962                             PV-PRC-TO-MSTR-AVG                   04896299
048963                             PV-MSTR-CRE-TO-OTBND-AVG             04896399
048964                             PV-MSTR-CRE-TO-TCLOS-AVG             04896499
048965                             PV-MSTR-CRE-TO-SHIP-AVG              04896599
048966                             PV-MSTR-FIRST-TO-OTBND-AVG           04896699
048967                             PV-MSTR-FIRST-TO-TCLOS-AVG           04896799
048968                             PV-MSTR-FIRST-TO-SHIP-AVG            04896899
048969                             PV-MSTR-LAST-TO-OTBND-AVG            04896999
048970                             PV-MSTR-LAST-TO-TCLOS-AVG            04897099
048971                             PV-MSTR-LAST-TO-SHIP-AVG             04897199
048972                             PV-ON-OTBND-TO-CLOS-AVG              04897299
048973                             PV-ON-OTBND-TO-SHIP-AVG              04897399
048974                             PV-TRIP-OPEN-TO-CLOSE-DAY            04897499
048975                             PV-TRIP-CLOSE-TO-SHIP-DAY            04897599
048976                             PV-TRIP-OPEN-TO-SHIP-DAY             04897699
048977                             PV-ARRIVE-TO-PRC-DAY                 04897799
048978                             PV-ARRIVE-TO-P2L-PKD-DAY             04897899
048979                             PV-PRC-TO-P2L-PKD-DAY                04897999
048980                             PV-P2L-PKD-TO-CLOSE-DAY              04898099
048981                             PV-P2L-OPEN-TO-CLOSE-DAY             04898199
048982                             PV-P2L-OPEN-TO-OTBND-DAY             04898299
048983                             PV-P2L-CLOSE-TO-OTBND-DAY            04898399
048984                             PV-ARRIVE-TO-OTBND-DAY               04898499
048985                             PV-PRC-TO-OTBND-DAY                  04898599
048986                             PV-ARRIVE-TO-TCLOS-DAY               04898699
048987                             PV-ARRIVE-TO-SHIP-DAY                04898799
048988                             PV-P2L-OPEN-TO-TCLOS-DAY             04898899
048989                             PV-P2L-OPEN-TO-SHIP-DAY              04898999
048990                             PV-P2L-CLOSE-TO-TCLOS-DAY            04899099
048991                             PV-P2L-CLOSE-TO-SHIP-DAY             04899199
048992                             PV-ARRIVE-TO-MSTR-DAY                04899299
048993                             PV-PRC-TO-MSTR-DAY                   04899399
048994                             PV-MSTR-CRE-TO-OTBND-DAY             04899499
048995                             PV-MSTR-CRE-TO-TCLOS-DAY             04899599
048996                             PV-MSTR-CRE-TO-SHIP-DAY              04899699
048997                             PV-MSTR-FIRST-TO-OTBND-DAY           04899799
048998                             PV-MSTR-FIRST-TO-TCLOS-DAY           04899899
048999                             PV-MSTR-FIRST-TO-SHIP-DAY            04899999
049000                             PV-MSTR-LAST-TO-OTBND-DAY            04900099
049001                             PV-MSTR-LAST-TO-TCLOS-DAY            04900199
049002                             PV-MSTR-LAST-TO-SHIP-DAY             04900299
049003                             PV-ON-OTBND-TO-CLOS-DAY              04900399
049004                             PV-ON-OTBND-TO-SHIP-DAY.             04900499
049005                                                                  04900599
049006     IF  PV-RDM-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04900699
049007         PV-RDM-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04900799
049008         DIVIDE  PV-RDM-TRIP-OPEN-TO-CLOSE-MIN                    04900899
049009             BY  PV-RDM-TRIP-OPEN-TO-CLOSE-CNT                    04900999
049010         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04901099
049011                 ROUNDED                                          04901199
049012         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04901299
049013             BY  1440                                             04901399
049014         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04901499
049015                 ROUNDED                                          04901599
049016     ELSE                                                         04901699
049017         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04901799
049018                           PV-TRIP-OPEN-TO-CLOSE-DAY              04901899
049019     END-IF.                                                      04901999
049020                                                                  04902099
049021     IF  PV-RDM-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04902199
049022         PV-RDM-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04902299
049023         DIVIDE  PV-RDM-TRIP-CLOSE-TO-SHIP-MIN                    04902399
049024             BY  PV-RDM-TRIP-CLOSE-TO-SHIP-CNT                    04902499
049025         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04902599
049026                 ROUNDED                                          04902699
049027         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04902799
049028             BY  1440                                             04902899
049029         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04902999
049030                 ROUNDED                                          04903099
049031     ELSE                                                         04903199
049032         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04903299
049033                           PV-TRIP-CLOSE-TO-SHIP-DAY              04903399
049034     END-IF.                                                      04903499
049035                                                                  04903599
049036     IF  PV-RDM-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04903699
049037         PV-RDM-TRIP-OPEN-TO-SHIP-CNT  >  0                       04903799
049038         DIVIDE  PV-RDM-TRIP-OPEN-TO-SHIP-MIN                     04903899
049039             BY  PV-RDM-TRIP-OPEN-TO-SHIP-CNT                     04903999
049040         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04904099
049041                 ROUNDED                                          04904199
049042         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04904299
049043             BY  1440                                             04904399
049044         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04904499
049045                 ROUNDED                                          04904599
049046     ELSE                                                         04904699
049047         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04904799
049048                           PV-TRIP-OPEN-TO-SHIP-DAY               04904899
049049     END-IF.                                                      04904999
049050                                                                  04905099
049051                                                                  04905199
049052     IF  PV-RDM-ARRIVE-TO-PRC-MIN  >  0  AND                      04905299
049053         PV-RDM-ARRIVE-TO-PRC-CNT  >  0                           04905399
049054         DIVIDE PV-RDM-ARRIVE-TO-PRC-MIN                          04905499
049055             BY PV-RDM-ARRIVE-TO-PRC-CNT                          04905599
049056         GIVING PV-ARRIVE-TO-PRC-AVG                              04905699
049057                 ROUNDED                                          04905799
049058         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04905899
049059             BY 1440                                              04905999
049060         GIVING PV-ARRIVE-TO-PRC-DAY                              04906099
049061                 ROUNDED                                          04906199
049062     ELSE                                                         04906299
049063         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04906399
049064                           PV-ARRIVE-TO-PRC-DAY                   04906499
049065     END-IF.                                                      04906599
049066                                                                  04906699
049067     IF  PV-RDM-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04906799
049068         PV-RDM-ARRIVE-TO-P2L-PKD-CNT  >  0                       04906899
049069         DIVIDE PV-RDM-ARRIVE-TO-P2L-PKD-MIN                      04906999
049070             BY PV-RDM-ARRIVE-TO-P2L-PKD-CNT                      04907099
049071         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04907199
049072                 ROUNDED                                          04907299
049073         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04907399
049074             BY 1440                                              04907499
049075         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04907599
049076                 ROUNDED                                          04907699
049077     ELSE                                                         04907799
049078         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04907899
049079                           PV-ARRIVE-TO-P2L-PKD-DAY               04907999
049080     END-IF.                                                      04908099
049081                                                                  04908199
049082                                                                  04908299
049083     IF  PV-RDM-PRC-TO-P2L-PKD-MIN  >  0  AND                     04908399
049084         PV-RDM-PRC-TO-P2L-PKD-CNT  >  0                          04908499
049085         DIVIDE PV-RDM-PRC-TO-P2L-PKD-MIN                         04908599
049086             BY PV-RDM-PRC-TO-P2L-PKD-CNT                         04908699
049087         GIVING PV-PRC-TO-P2L-PKD-AVG                             04908799
049088                 ROUNDED                                          04908899
049089         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04908999
049090             BY 1440                                              04909099
049091         GIVING PV-PRC-TO-P2L-PKD-DAY                             04909199
049092                 ROUNDED                                          04909299
049093     ELSE                                                         04909399
049094         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04909499
049095                           PV-PRC-TO-P2L-PKD-DAY                  04909599
049096     END-IF.                                                      04909699
049097                                                                  04909799
049098     IF  PV-RDM-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04909899
049099         PV-RDM-P2L-PKD-TO-CLOSE-CNT  >  0                        04909999
049100         DIVIDE PV-RDM-P2L-PKD-TO-CLOSE-MIN                       04910099
049101             BY PV-RDM-P2L-PKD-TO-CLOSE-CNT                       04910199
049102         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04910299
049103                 ROUNDED                                          04910399
049104         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04910499
049105             BY 1440                                              04910599
049106         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04910699
049107                 ROUNDED                                          04910799
049108     ELSE                                                         04910899
049109         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04910999
049110                           PV-P2L-PKD-TO-CLOSE-DAY                04911099
049111     END-IF.                                                      04911199
049112                                                                  04911299
049113     IF  PV-RDM-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04911399
049114         PV-RDM-P2L-OPEN-TO-CLOSE-CNT  >  0                       04911499
049115         DIVIDE PV-RDM-P2L-OPEN-TO-CLOSE-MIN                      04911599
049116             BY PV-RDM-P2L-OPEN-TO-CLOSE-CNT                      04911699
049117         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04911799
049118                 ROUNDED                                          04911899
049119         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04911999
049120             BY 1440                                              04912099
049121         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04912199
049122                 ROUNDED                                          04912299
049123     ELSE                                                         04912399
049124         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04912499
049125                           PV-P2L-OPEN-TO-CLOSE-DAY               04912599
049126     END-IF.                                                      04912699
049127                                                                  04912799
049128     IF  PV-RDM-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04912899
049129         PV-RDM-P2L-OPEN-TO-OTBND-CNT  >  0                       04912999
049130         DIVIDE PV-RDM-P2L-OPEN-TO-OTBND-MIN                      04913099
049131             BY PV-RDM-P2L-OPEN-TO-OTBND-CNT                      04913199
049132         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04913299
049133                 ROUNDED                                          04913399
049134         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04913499
049135             BY 1440                                              04913599
049136         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04913699
049137                 ROUNDED                                          04913799
049138     ELSE                                                         04913899
049139         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04913999
049140                           PV-P2L-OPEN-TO-OTBND-DAY               04914099
049141     END-IF.                                                      04914199
049142                                                                  04914299
049143     IF  PV-RDM-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04914399
049144         PV-RDM-P2L-CLOSE-TO-OTBND-CNT  >  0                      04914499
049145         DIVIDE PV-RDM-P2L-CLOSE-TO-OTBND-MIN                     04914599
049146             BY PV-RDM-P2L-CLOSE-TO-OTBND-CNT                     04914699
049147         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04914799
049148                 ROUNDED                                          04914899
049149         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04914999
049150             BY 1440                                              04915099
049151         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04915199
049152                 ROUNDED                                          04915299
049153     ELSE                                                         04915399
049154         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04915499
049155                           PV-P2L-CLOSE-TO-OTBND-DAY              04915599
049156     END-IF.                                                      04915699
049157                                                                  04915799
049158     IF  PV-RDM-ARRIVE-TO-OTBND-MIN  >  0  AND                    04915899
049159         PV-RDM-ARRIVE-TO-OTBND-CNT  >  0                         04915999
049160         DIVIDE PV-RDM-ARRIVE-TO-OTBND-MIN                        04916099
049161             BY PV-RDM-ARRIVE-TO-OTBND-CNT                        04916199
049162         GIVING PV-ARRIVE-TO-OTBND-AVG                            04916299
049163                 ROUNDED                                          04916399
049164         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04916499
049165             BY 1440                                              04916599
049166         GIVING PV-ARRIVE-TO-OTBND-DAY                            04916699
049167                 ROUNDED                                          04916799
049168     ELSE                                                         04916899
049169         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04916999
049170                           PV-ARRIVE-TO-OTBND-DAY                 04917099
049171     END-IF.                                                      04917199
049172                                                                  04917299
049173     IF  PV-RDM-PRC-TO-OTBND-MIN  >  0  AND                       04917399
049174         PV-RDM-PRC-TO-OTBND-CNT  >  0                            04917499
049175         DIVIDE PV-RDM-PRC-TO-OTBND-MIN                           04917599
049176             BY PV-RDM-PRC-TO-OTBND-CNT                           04917699
049177         GIVING PV-PRC-TO-OTBND-AVG                               04917799
049178                 ROUNDED                                          04917899
049179         DIVIDE PV-PRC-TO-OTBND-AVG                               04917999
049180             BY 1440                                              04918099
049181         GIVING PV-PRC-TO-OTBND-DAY                               04918199
049182                 ROUNDED                                          04918299
049183     ELSE                                                         04918399
049184         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04918499
049185                           PV-PRC-TO-OTBND-DAY                    04918599
049186     END-IF.                                                      04918699
049187                                                                  04918799
049188     IF  PV-RDM-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04918899
049189         PV-RDM-ARRIVE-TO-TCLOS-CNT  >  0                         04918999
049190         DIVIDE PV-RDM-ARRIVE-TO-TCLOS-MIN                        04919099
049191             BY PV-RDM-ARRIVE-TO-TCLOS-CNT                        04919199
049192         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04919299
049193                 ROUNDED                                          04919399
049194         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04919499
049195             BY 1440                                              04919599
049196         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04919699
049197                 ROUNDED                                          04919799
049198     ELSE                                                         04919899
049199         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04919999
049200                           PV-ARRIVE-TO-TCLOS-DAY                 04920099
049201     END-IF.                                                      04920199
049202                                                                  04920299
049203     IF  PV-RDM-ARRIVE-TO-SHIP-MIN  >  0  AND                     04920399
049204         PV-RDM-ARRIVE-TO-SHIP-CNT  >  0                          04920499
049205         DIVIDE PV-RDM-ARRIVE-TO-SHIP-MIN                         04920599
049206             BY PV-RDM-ARRIVE-TO-SHIP-CNT                         04920699
049207         GIVING PV-ARRIVE-TO-SHIP-AVG                             04920799
049208                 ROUNDED                                          04920899
049209         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04920999
049210             BY 1440                                              04921099
049211         GIVING PV-ARRIVE-TO-SHIP-DAY                             04921199
049212                 ROUNDED                                          04921299
049213     ELSE                                                         04921399
049214         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04921499
049215                           PV-ARRIVE-TO-SHIP-DAY                  04921599
049216     END-IF.                                                      04921699
049217                                                                  04921799
049218     IF  PV-RDM-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04921899
049219         PV-RDM-P2L-OPEN-TO-TCLOS-CNT  >  0                       04921999
049220         DIVIDE PV-RDM-P2L-OPEN-TO-TCLOS-MIN                      04922099
049221             BY PV-RDM-P2L-OPEN-TO-TCLOS-CNT                      04922199
049222         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04922299
049223                 ROUNDED                                          04922399
049224         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04922499
049225             BY 1440                                              04922599
049226         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04922699
049227                 ROUNDED                                          04922799
049228     ELSE                                                         04922899
049229         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04922999
049230                           PV-P2L-OPEN-TO-TCLOS-DAY               04923099
049231     END-IF.                                                      04923199
049232                                                                  04923299
049233     IF  PV-RDM-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04923399
049234         PV-RDM-P2L-OPEN-TO-SHIP-CNT  >  0                        04923499
049235         DIVIDE PV-RDM-P2L-OPEN-TO-SHIP-MIN                       04923599
049236             BY PV-RDM-P2L-OPEN-TO-SHIP-CNT                       04923699
049237         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04923799
049238                 ROUNDED                                          04923899
049239         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04923999
049240             BY 1440                                              04924099
049241         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04924199
049242                 ROUNDED                                          04924299
049243     ELSE                                                         04924399
049244         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04924499
049245                           PV-P2L-OPEN-TO-SHIP-DAY                04924599
049246     END-IF.                                                      04924699
049247                                                                  04924799
049248     IF  PV-RDM-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04924899
049249         PV-RDM-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04924999
049250         DIVIDE PV-RDM-P2L-CLOSE-TO-TCLOS-MIN                     04925099
049251             BY PV-RDM-P2L-CLOSE-TO-TCLOS-CNT                     04925199
049252         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04925299
049253                 ROUNDED                                          04925399
049254         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04925499
049255             BY 1440                                              04925599
049256         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04925699
049257                 ROUNDED                                          04925799
049258     ELSE                                                         04925899
049259         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04925999
049260                           PV-P2L-CLOSE-TO-TCLOS-DAY              04926099
049261     END-IF.                                                      04926199
049262                                                                  04926299
049263     IF  PV-RDM-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04926399
049264         PV-RDM-P2L-CLOSE-TO-SHIP-CNT  >  0                       04926499
049265         DIVIDE PV-RDM-P2L-CLOSE-TO-SHIP-MIN                      04926599
049266             BY PV-RDM-P2L-CLOSE-TO-SHIP-CNT                      04926699
049267         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04926799
049268                 ROUNDED                                          04926899
049269         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04926999
049270             BY 1440                                              04927099
049271         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04927199
049272                 ROUNDED                                          04927299
049273     ELSE                                                         04927399
049274         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04927499
049275                           PV-P2L-CLOSE-TO-SHIP-DAY               04927599
049276     END-IF.                                                      04927699
049277                                                                  04927799
049278     IF  PV-RDM-ARRIVE-TO-MSTR-MIN  >  0  AND                     04927899
049279         PV-RDM-ARRIVE-TO-MSTR-CNT  >  0                          04927999
049280         DIVIDE PV-RDM-ARRIVE-TO-MSTR-MIN                         04928099
049281             BY PV-RDM-ARRIVE-TO-MSTR-CNT                         04928199
049282         GIVING PV-ARRIVE-TO-MSTR-AVG                             04928299
049283                 ROUNDED                                          04928399
049284         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04928499
049285             BY 1440                                              04928599
049286         GIVING PV-ARRIVE-TO-MSTR-DAY                             04928699
049287                 ROUNDED                                          04928799
049288     ELSE                                                         04928899
049289         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04928999
049290                           PV-ARRIVE-TO-MSTR-DAY                  04929099
049291     END-IF.                                                      04929199
049292                                                                  04929299
049293     IF  PV-RDM-PRC-TO-MSTR-MIN  >  0  AND                        04929399
049294         PV-RDM-PRC-TO-MSTR-CNT  >  0                             04929499
049295         DIVIDE PV-RDM-PRC-TO-MSTR-MIN                            04929599
049296             BY PV-RDM-PRC-TO-MSTR-CNT                            04929699
049297         GIVING PV-PRC-TO-MSTR-AVG                                04929799
049298                 ROUNDED                                          04929899
049299         DIVIDE PV-PRC-TO-MSTR-AVG                                04929999
049300             BY 1440                                              04930099
049301         GIVING PV-PRC-TO-MSTR-DAY                                04930199
049302                 ROUNDED                                          04930299
049303     ELSE                                                         04930399
049304         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04930499
049305                           PV-PRC-TO-MSTR-DAY                     04930599
049306     END-IF.                                                      04930699
049307                                                                  04930799
049308     IF  PV-RDM-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04930899
049309         PV-RDM-ON-OTBND-TO-CLOS-CNT  >  0                        04930999
049310         DIVIDE PV-RDM-ON-OTBND-TO-CLOS-MIN                       04931099
049311             BY PV-RDM-ON-OTBND-TO-CLOS-CNT                       04931199
049312         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04931299
049313                 ROUNDED                                          04931399
049314         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04931499
049315             BY 1440                                              04931599
049316         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04931699
049317                 ROUNDED                                          04931799
049318     ELSE                                                         04931899
049319         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04931999
049320                           PV-ON-OTBND-TO-CLOS-DAY                04932099
049321     END-IF.                                                      04932199
049322                                                                  04932299
049323     IF  PV-RDM-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04932399
049324         PV-RDM-ON-OTBND-TO-SHIP-CNT  >  0                        04932499
049325         DIVIDE PV-RDM-ON-OTBND-TO-SHIP-MIN                       04932599
049326             BY PV-RDM-ON-OTBND-TO-SHIP-CNT                       04932699
049327         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04932799
049328                 ROUNDED                                          04932899
049329         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04932999
049330             BY 1440                                              04933099
049331         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04933199
049332                 ROUNDED                                          04933299
049333     ELSE                                                         04933399
049334         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04933499
049335                           PV-ON-OTBND-TO-SHIP-DAY                04933599
049336     END-IF.                                                      04933699
049337                                                                  04933799
049338     IF  PV-RDM-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04933899
049339         PV-RDM-MSTR-CRE-TO-OTBND-CNT  >  0                       04933999
049340         DIVIDE PV-RDM-MSTR-CRE-TO-OTBND-MIN                      04934099
049341             BY PV-RDM-MSTR-CRE-TO-OTBND-CNT                      04934199
049342         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04934299
049343                 ROUNDED                                          04934399
049344         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04934499
049345             BY 1440                                              04934599
049346         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04934699
049347                 ROUNDED                                          04934799
049348     ELSE                                                         04934899
049349         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04934999
049350                           PV-MSTR-CRE-TO-OTBND-DAY               04935099
049351     END-IF.                                                      04935199
049352                                                                  04935299
049353     IF  PV-RDM-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04935399
049354         PV-RDM-MSTR-CRE-TO-TCLOS-CNT  >  0                       04935499
049355         DIVIDE PV-RDM-MSTR-CRE-TO-TCLOS-MIN                      04935599
049356             BY PV-RDM-MSTR-CRE-TO-TCLOS-CNT                      04935699
049357         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04935799
049358                 ROUNDED                                          04935899
049359         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04935999
049360             BY 1440                                              04936099
049361         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04936199
049362                 ROUNDED                                          04936299
049363     ELSE                                                         04936399
049364         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04936499
049365                           PV-MSTR-CRE-TO-TCLOS-DAY               04936599
049366     END-IF.                                                      04936699
049367                                                                  04936799
049368     IF  PV-RDM-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04936899
049369         PV-RDM-MSTR-CRE-TO-SHIP-CNT  >  0                        04936999
049370         DIVIDE PV-RDM-MSTR-CRE-TO-SHIP-MIN                       04937099
049371             BY PV-RDM-MSTR-CRE-TO-SHIP-CNT                       04937199
049372         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04937299
049373                 ROUNDED                                          04937399
049374         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04937499
049375             BY 1440                                              04937599
049376         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04937699
049377                 ROUNDED                                          04937799
049378     ELSE                                                         04937899
049379         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04937999
049380                           PV-MSTR-CRE-TO-SHIP-DAY                04938099
049381     END-IF.                                                      04938199
049382                                                                  04938299
049383     IF  PV-RDM-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04938399
049384         PV-RDM-MSTR-FIRST-TO-OTBND-CNT  >  0                     04938499
049385         DIVIDE PV-RDM-MSTR-FIRST-TO-OTBND-MIN                    04938599
049386             BY PV-RDM-MSTR-FIRST-TO-OTBND-CNT                    04938699
049387         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04938799
049388                 ROUNDED                                          04938899
049389         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04938999
049390             BY 1440                                              04939099
049391         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04939199
049392                 ROUNDED                                          04939299
049393     ELSE                                                         04939399
049394         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04939499
049395                           PV-MSTR-FIRST-TO-OTBND-DAY             04939599
049396     END-IF.                                                      04939699
049397                                                                  04939799
049398     IF  PV-RDM-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04939899
049399         PV-RDM-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04939999
049400         DIVIDE PV-RDM-MSTR-FIRST-TO-TCLOS-MIN                    04940099
049401             BY PV-RDM-MSTR-FIRST-TO-TCLOS-CNT                    04940199
049402         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04940299
049403                 ROUNDED                                          04940399
049404         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04940499
049405             BY 1440                                              04940599
049406         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04940699
049407                 ROUNDED                                          04940799
049408     ELSE                                                         04940899
049409         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04940999
049410                           PV-MSTR-FIRST-TO-TCLOS-DAY             04941099
049411     END-IF.                                                      04941199
049412                                                                  04941299
049413     IF  PV-RDM-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04941399
049414         PV-RDM-MSTR-FIRST-TO-SHIP-CNT  >  0                      04941499
049415         DIVIDE PV-RDM-MSTR-FIRST-TO-SHIP-MIN                     04941599
049416             BY PV-RDM-MSTR-FIRST-TO-SHIP-CNT                     04941699
049417         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04941799
049418                 ROUNDED                                          04941899
049419         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04941999
049420             BY 1440                                              04942099
049421         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04942199
049422                 ROUNDED                                          04942299
049423     ELSE                                                         04942399
049424         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04942499
049425                           PV-MSTR-FIRST-TO-SHIP-DAY              04942599
049426     END-IF.                                                      04942699
049427                                                                  04942799
049428     IF  PV-RDM-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04942899
049429         PV-RDM-MSTR-LAST-TO-OTBND-CNT  >  0                      04942999
049430         DIVIDE PV-RDM-MSTR-LAST-TO-OTBND-MIN                     04943099
049431             BY PV-RDM-MSTR-LAST-TO-OTBND-CNT                     04943199
049432         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         04943299
049433                 ROUNDED                                          04943399
049434         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         04943499
049435             BY 1440                                              04943599
049436         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         04943699
049437                 ROUNDED                                          04943799
049438     ELSE                                                         04943899
049439         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              04943999
049440                           PV-MSTR-LAST-TO-OTBND-DAY              04944099
049441     END-IF.                                                      04944199
049442                                                                  04944299
049443     IF  PV-RDM-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 04944399
049444         PV-RDM-MSTR-LAST-TO-TCLOS-CNT  >  0                      04944499
049445         DIVIDE PV-RDM-MSTR-LAST-TO-TCLOS-MIN                     04944599
049446             BY PV-RDM-MSTR-LAST-TO-TCLOS-CNT                     04944699
049447         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         04944799
049448                 ROUNDED                                          04944899
049449         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         04944999
049450             BY 1440                                              04945099
049451         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         04945199
049452                 ROUNDED                                          04945299
049453     ELSE                                                         04945399
049454         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              04945499
049455                           PV-MSTR-LAST-TO-TCLOS-DAY              04945599
049456     END-IF.                                                      04945699
049457                                                                  04945799
049458     IF  PV-RDM-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  04945899
049459         PV-RDM-MSTR-LAST-TO-SHIP-CNT  >  0                       04945999
049460         DIVIDE PV-RDM-MSTR-LAST-TO-SHIP-MIN                      04946099
049461             BY PV-RDM-MSTR-LAST-TO-SHIP-CNT                      04946199
049462         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          04946299
049463                 ROUNDED                                          04946399
049464         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          04946499
049465             BY 1440                                              04946599
049466         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          04946699
049467                 ROUNDED                                          04946799
049468     ELSE                                                         04946899
049469         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               04946999
049470                           PV-MSTR-LAST-TO-SHIP-DAY               04947099
049471     END-IF.                                                      04947199
049472*                                                                 04947299
049473*** 8/19                                                          04947399
049474*                                                                 04947499
049475     IF  PV-RDM-TRIP-CARTONS            >  0  AND                 04947599
049476         PV-RDM-TRIP-SRC-CARTONS        >  0                      04947699
049477         DIVIDE  PV-RDM-TRIP-SRC-CARTONS                          04947799
049478             BY  PV-RDM-TRIP-CARTONS                              04947899
049479         GIVING  PV-TRIP-SRC-CRTN                                 04947999
049480                   ROUNDED                                        04948099
049481         MULTIPLY  PV-TRIP-SRC-CRTN                               04948199
049482               BY  100                                            04948299
049483           GIVING  PV-TRIP-SRC-CRTN-PCNT                          04948399
049484     ELSE                                                         04948499
049485         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  04948599
049486                           PV-TRIP-SRC-CRTN                       04948699
049487     END-IF.                                                      04948799
049488                                                                  04948899
049489                                                                  04948999
049490     MOVE ZEROES                TO DL5-DC-NBR                     04949099
049491     MOVE 'CORP OVERALL    '    TO DL5-DC-NAME                    04949199
049492     MOVE 'IMPORT REPLEN   '    TO DL5-SOURCE                     04949299
049493                                                                  04949399
049494     IF   SU134-EFC-STORES  AND                                   04949499
049495          PV-RDM-TRIP-SRC-CARTONS  =   0                          04949599
049496             CONTINUE                                             04949699
049497     ELSE                                                         04949799
049498     IF   SU134-LFC-STORES  AND                                   04949899
049499          PV-RDM-TRIP-SRC-CARTONS  =   0                          04949999
049500             CONTINUE                                             04950099
049501     ELSE                                                         04950199
049502         PERFORM 5070-PRINT-CORP-TOTALS                           04950299
049503     END-IF                                                       04950399
049504     END-IF.                                                      04950499
049505                                                                  04950599
049506                                                                  04950699
049507****************************************************************  04950799
049508* CALCULATE 3WD-AVERAGES                                       *  04950899
049509****************************************************************  04950999
049510 3083-CALC-3WD-AVERAGES.                                          04951099
049511                                                                  04951199
049512     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            04951299
049513                             PV-TRIP-CLOSE-TO-SHIP-AVG            04951399
049514                             PV-TRIP-OPEN-TO-SHIP-AVG             04951499
049515                             PV-ARRIVE-TO-PRC-AVG                 04951599
049516                             PV-ARRIVE-TO-P2L-PKD-AVG             04951699
049517                             PV-PRC-TO-P2L-PKD-AVG                04951799
049518                             PV-P2L-PKD-TO-CLOSE-AVG              04951899
049519                             PV-P2L-OPEN-TO-CLOSE-AVG             04951999
049520                             PV-P2L-OPEN-TO-OTBND-AVG             04952099
049521                             PV-P2L-CLOSE-TO-OTBND-AVG            04952199
049522                             PV-ARRIVE-TO-OTBND-AVG               04952299
049523                             PV-PRC-TO-OTBND-AVG                  04952399
049524                             PV-ARRIVE-TO-TCLOS-AVG               04952499
049525                             PV-ARRIVE-TO-SHIP-AVG                04952599
049526                             PV-P2L-OPEN-TO-TCLOS-AVG             04952699
049527                             PV-P2L-OPEN-TO-SHIP-AVG              04952799
049528                             PV-P2L-CLOSE-TO-TCLOS-AVG            04952899
049529                             PV-P2L-CLOSE-TO-SHIP-AVG             04952999
049530                             PV-ARRIVE-TO-MSTR-AVG                04953099
049531                             PV-PRC-TO-MSTR-AVG                   04953199
049532                             PV-MSTR-CRE-TO-OTBND-AVG             04953299
049533                             PV-MSTR-CRE-TO-TCLOS-AVG             04953399
049534                             PV-MSTR-CRE-TO-SHIP-AVG              04953499
049535                             PV-MSTR-FIRST-TO-OTBND-AVG           04953599
049536                             PV-MSTR-FIRST-TO-TCLOS-AVG           04953699
049537                             PV-MSTR-FIRST-TO-SHIP-AVG            04953799
049538                             PV-MSTR-LAST-TO-OTBND-AVG            04953899
049539                             PV-MSTR-LAST-TO-TCLOS-AVG            04953999
049540                             PV-MSTR-LAST-TO-SHIP-AVG             04954099
049541                             PV-ON-OTBND-TO-CLOS-AVG              04954199
049542                             PV-ON-OTBND-TO-SHIP-AVG              04954299
049543                             PV-TRIP-OPEN-TO-CLOSE-DAY            04954399
049544                             PV-TRIP-CLOSE-TO-SHIP-DAY            04954499
049545                             PV-TRIP-OPEN-TO-SHIP-DAY             04954599
049546                             PV-ARRIVE-TO-PRC-DAY                 04954699
049547                             PV-ARRIVE-TO-P2L-PKD-DAY             04954799
049548                             PV-PRC-TO-P2L-PKD-DAY                04954899
049549                             PV-P2L-PKD-TO-CLOSE-DAY              04954999
049550                             PV-P2L-OPEN-TO-CLOSE-DAY             04955099
049551                             PV-P2L-OPEN-TO-OTBND-DAY             04955199
049552                             PV-P2L-CLOSE-TO-OTBND-DAY            04955299
049553                             PV-ARRIVE-TO-OTBND-DAY               04955399
049554                             PV-PRC-TO-OTBND-DAY                  04955499
049555                             PV-ARRIVE-TO-TCLOS-DAY               04955599
049556                             PV-ARRIVE-TO-SHIP-DAY                04955699
049557                             PV-P2L-OPEN-TO-TCLOS-DAY             04955799
049558                             PV-P2L-OPEN-TO-SHIP-DAY              04955899
049559                             PV-P2L-CLOSE-TO-TCLOS-DAY            04955999
049560                             PV-P2L-CLOSE-TO-SHIP-DAY             04956099
049561                             PV-ARRIVE-TO-MSTR-DAY                04956199
049562                             PV-PRC-TO-MSTR-DAY                   04956299
049563                             PV-MSTR-CRE-TO-OTBND-DAY             04956399
049564                             PV-MSTR-CRE-TO-TCLOS-DAY             04956499
049565                             PV-MSTR-CRE-TO-SHIP-DAY              04956599
049566                             PV-MSTR-FIRST-TO-OTBND-DAY           04956699
049567                             PV-MSTR-FIRST-TO-TCLOS-DAY           04956799
049568                             PV-MSTR-FIRST-TO-SHIP-DAY            04956899
049569                             PV-MSTR-LAST-TO-OTBND-DAY            04956999
049570                             PV-MSTR-LAST-TO-TCLOS-DAY            04957099
049571                             PV-MSTR-LAST-TO-SHIP-DAY             04957199
049572                             PV-ON-OTBND-TO-CLOS-DAY              04957299
049573                             PV-ON-OTBND-TO-SHIP-DAY.             04957399
049574                                                                  04957499
049575     IF  PV-3WD-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 04957599
049576         PV-3WD-TRIP-OPEN-TO-CLOSE-CNT  >  0                      04957699
049577         DIVIDE  PV-3WD-TRIP-OPEN-TO-CLOSE-MIN                    04957799
049578             BY  PV-3WD-TRIP-OPEN-TO-CLOSE-CNT                    04957899
049579         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        04957999
049580                 ROUNDED                                          04958099
049581         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        04958199
049582             BY  1440                                             04958299
049583         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        04958399
049584                 ROUNDED                                          04958499
049585     ELSE                                                         04958599
049586         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              04958699
049587                           PV-TRIP-OPEN-TO-CLOSE-DAY              04958799
049588     END-IF.                                                      04958899
049589                                                                  04958999
049590     IF  PV-3WD-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 04959099
049591         PV-3WD-TRIP-CLOSE-TO-SHIP-CNT  >  0                      04959199
049592         DIVIDE  PV-3WD-TRIP-CLOSE-TO-SHIP-MIN                    04959299
049593             BY  PV-3WD-TRIP-CLOSE-TO-SHIP-CNT                    04959399
049594         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        04959499
049595                 ROUNDED                                          04959599
049596         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        04959699
049597             BY  1440                                             04959799
049598         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        04959899
049599                 ROUNDED                                          04959999
049600     ELSE                                                         04960099
049601         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              04960199
049602                           PV-TRIP-CLOSE-TO-SHIP-DAY              04960299
049603     END-IF.                                                      04960399
049604                                                                  04960499
049605     IF  PV-3WD-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  04960599
049606         PV-3WD-TRIP-OPEN-TO-SHIP-CNT  >  0                       04960699
049607         DIVIDE  PV-3WD-TRIP-OPEN-TO-SHIP-MIN                     04960799
049608             BY  PV-3WD-TRIP-OPEN-TO-SHIP-CNT                     04960899
049609         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         04960999
049610                 ROUNDED                                          04961099
049611         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         04961199
049612             BY  1440                                             04961299
049613         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         04961399
049614                 ROUNDED                                          04961499
049615     ELSE                                                         04961599
049616         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               04961699
049617                           PV-TRIP-OPEN-TO-SHIP-DAY               04961799
049618     END-IF.                                                      04961899
049619                                                                  04961999
049620                                                                  04962099
049621     IF  PV-3WD-ARRIVE-TO-PRC-MIN  >  0  AND                      04962199
049622         PV-3WD-ARRIVE-TO-PRC-CNT  >  0                           04962299
049623         DIVIDE PV-3WD-ARRIVE-TO-PRC-MIN                          04962399
049624             BY PV-3WD-ARRIVE-TO-PRC-CNT                          04962499
049625         GIVING PV-ARRIVE-TO-PRC-AVG                              04962599
049626                 ROUNDED                                          04962699
049627         DIVIDE PV-ARRIVE-TO-PRC-AVG                              04962799
049628             BY 1440                                              04962899
049629         GIVING PV-ARRIVE-TO-PRC-DAY                              04962999
049630                 ROUNDED                                          04963099
049631     ELSE                                                         04963199
049632         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   04963299
049633                           PV-ARRIVE-TO-PRC-DAY                   04963399
049634     END-IF.                                                      04963499
049635                                                                  04963599
049636     IF  PV-3WD-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  04963699
049637         PV-3WD-ARRIVE-TO-P2L-PKD-CNT  >  0                       04963799
049638         DIVIDE PV-3WD-ARRIVE-TO-P2L-PKD-MIN                      04963899
049639             BY PV-3WD-ARRIVE-TO-P2L-PKD-CNT                      04963999
049640         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          04964099
049641                 ROUNDED                                          04964199
049642         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          04964299
049643             BY 1440                                              04964399
049644         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          04964499
049645                 ROUNDED                                          04964599
049646     ELSE                                                         04964699
049647         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               04964799
049648                           PV-ARRIVE-TO-P2L-PKD-DAY               04964899
049649     END-IF.                                                      04964999
049650                                                                  04965099
049651                                                                  04965199
049652     IF  PV-3WD-PRC-TO-P2L-PKD-MIN  >  0  AND                     04965299
049653         PV-3WD-PRC-TO-P2L-PKD-CNT  >  0                          04965399
049654         DIVIDE PV-3WD-PRC-TO-P2L-PKD-MIN                         04965499
049655             BY PV-3WD-PRC-TO-P2L-PKD-CNT                         04965599
049656         GIVING PV-PRC-TO-P2L-PKD-AVG                             04965699
049657                 ROUNDED                                          04965799
049658         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             04965899
049659             BY 1440                                              04965999
049660         GIVING PV-PRC-TO-P2L-PKD-DAY                             04966099
049661                 ROUNDED                                          04966199
049662     ELSE                                                         04966299
049663         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  04966399
049664                           PV-PRC-TO-P2L-PKD-DAY                  04966499
049665     END-IF.                                                      04966599
049666                                                                  04966699
049667     IF  PV-3WD-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   04966799
049668         PV-3WD-P2L-PKD-TO-CLOSE-CNT  >  0                        04966899
049669         DIVIDE PV-3WD-P2L-PKD-TO-CLOSE-MIN                       04966999
049670             BY PV-3WD-P2L-PKD-TO-CLOSE-CNT                       04967099
049671         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           04967199
049672                 ROUNDED                                          04967299
049673         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           04967399
049674             BY 1440                                              04967499
049675         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           04967599
049676                 ROUNDED                                          04967699
049677     ELSE                                                         04967799
049678         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                04967899
049679                           PV-P2L-PKD-TO-CLOSE-DAY                04967999
049680     END-IF.                                                      04968099
049681                                                                  04968199
049682     IF  PV-3WD-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  04968299
049683         PV-3WD-P2L-OPEN-TO-CLOSE-CNT  >  0                       04968399
049684         DIVIDE PV-3WD-P2L-OPEN-TO-CLOSE-MIN                      04968499
049685             BY PV-3WD-P2L-OPEN-TO-CLOSE-CNT                      04968599
049686         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          04968699
049687                 ROUNDED                                          04968799
049688         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          04968899
049689             BY 1440                                              04968999
049690         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          04969099
049691                 ROUNDED                                          04969199
049692     ELSE                                                         04969299
049693         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               04969399
049694                           PV-P2L-OPEN-TO-CLOSE-DAY               04969499
049695     END-IF.                                                      04969599
049696                                                                  04969699
049697     IF  PV-3WD-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  04969799
049698         PV-3WD-P2L-OPEN-TO-OTBND-CNT  >  0                       04969899
049699         DIVIDE PV-3WD-P2L-OPEN-TO-OTBND-MIN                      04969999
049700             BY PV-3WD-P2L-OPEN-TO-OTBND-CNT                      04970099
049701         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          04970199
049702                 ROUNDED                                          04970299
049703         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          04970399
049704             BY 1440                                              04970499
049705         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          04970599
049706                 ROUNDED                                          04970699
049707     ELSE                                                         04970799
049708         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               04970899
049709                           PV-P2L-OPEN-TO-OTBND-DAY               04970999
049710     END-IF.                                                      04971099
049711                                                                  04971199
049712     IF  PV-3WD-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 04971299
049713         PV-3WD-P2L-CLOSE-TO-OTBND-CNT  >  0                      04971399
049714         DIVIDE PV-3WD-P2L-CLOSE-TO-OTBND-MIN                     04971499
049715             BY PV-3WD-P2L-CLOSE-TO-OTBND-CNT                     04971599
049716         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         04971699
049717                 ROUNDED                                          04971799
049718         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         04971899
049719             BY 1440                                              04971999
049720         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         04972099
049721                 ROUNDED                                          04972199
049722     ELSE                                                         04972299
049723         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              04972399
049724                           PV-P2L-CLOSE-TO-OTBND-DAY              04972499
049725     END-IF.                                                      04972599
049726                                                                  04972699
049727     IF  PV-3WD-ARRIVE-TO-OTBND-MIN  >  0  AND                    04972799
049728         PV-3WD-ARRIVE-TO-OTBND-CNT  >  0                         04972899
049729         DIVIDE PV-3WD-ARRIVE-TO-OTBND-MIN                        04972999
049730             BY PV-3WD-ARRIVE-TO-OTBND-CNT                        04973099
049731         GIVING PV-ARRIVE-TO-OTBND-AVG                            04973199
049732                 ROUNDED                                          04973299
049733         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            04973399
049734             BY 1440                                              04973499
049735         GIVING PV-ARRIVE-TO-OTBND-DAY                            04973599
049736                 ROUNDED                                          04973699
049737     ELSE                                                         04973799
049738         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 04973899
049739                           PV-ARRIVE-TO-OTBND-DAY                 04973999
049740     END-IF.                                                      04974099
049741                                                                  04974199
049742     IF  PV-3WD-PRC-TO-OTBND-MIN  >  0  AND                       04974299
049743         PV-3WD-PRC-TO-OTBND-CNT  >  0                            04974399
049744         DIVIDE PV-3WD-PRC-TO-OTBND-MIN                           04974499
049745             BY PV-3WD-PRC-TO-OTBND-CNT                           04974599
049746         GIVING PV-PRC-TO-OTBND-AVG                               04974699
049747                 ROUNDED                                          04974799
049748         DIVIDE PV-PRC-TO-OTBND-AVG                               04974899
049749             BY 1440                                              04974999
049750         GIVING PV-PRC-TO-OTBND-DAY                               04975099
049751                 ROUNDED                                          04975199
049752     ELSE                                                         04975299
049753         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    04975399
049754                           PV-PRC-TO-OTBND-DAY                    04975499
049755     END-IF.                                                      04975599
049756                                                                  04975699
049757     IF  PV-3WD-ARRIVE-TO-TCLOS-MIN  >  0  AND                    04975799
049758         PV-3WD-ARRIVE-TO-TCLOS-CNT  >  0                         04975899
049759         DIVIDE PV-3WD-ARRIVE-TO-TCLOS-MIN                        04975999
049760             BY PV-3WD-ARRIVE-TO-TCLOS-CNT                        04976099
049761         GIVING PV-ARRIVE-TO-TCLOS-AVG                            04976199
049762                 ROUNDED                                          04976299
049763         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            04976399
049764             BY 1440                                              04976499
049765         GIVING PV-ARRIVE-TO-TCLOS-DAY                            04976599
049766                 ROUNDED                                          04976699
049767     ELSE                                                         04976799
049768         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 04976899
049769                           PV-ARRIVE-TO-TCLOS-DAY                 04976999
049770     END-IF.                                                      04977099
049771                                                                  04977199
049772     IF  PV-3WD-ARRIVE-TO-SHIP-MIN  >  0  AND                     04977299
049773         PV-3WD-ARRIVE-TO-SHIP-CNT  >  0                          04977399
049774         DIVIDE PV-3WD-ARRIVE-TO-SHIP-MIN                         04977499
049775             BY PV-3WD-ARRIVE-TO-SHIP-CNT                         04977599
049776         GIVING PV-ARRIVE-TO-SHIP-AVG                             04977699
049777                 ROUNDED                                          04977799
049778         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             04977899
049779             BY 1440                                              04977999
049780         GIVING PV-ARRIVE-TO-SHIP-DAY                             04978099
049781                 ROUNDED                                          04978199
049782     ELSE                                                         04978299
049783         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  04978399
049784                           PV-ARRIVE-TO-SHIP-DAY                  04978499
049785     END-IF.                                                      04978599
049786                                                                  04978699
049787     IF  PV-3WD-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  04978799
049788         PV-3WD-P2L-OPEN-TO-TCLOS-CNT  >  0                       04978899
049789         DIVIDE PV-3WD-P2L-OPEN-TO-TCLOS-MIN                      04978999
049790             BY PV-3WD-P2L-OPEN-TO-TCLOS-CNT                      04979099
049791         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          04979199
049792                 ROUNDED                                          04979299
049793         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          04979399
049794             BY 1440                                              04979499
049795         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          04979599
049796                 ROUNDED                                          04979699
049797     ELSE                                                         04979799
049798         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               04979899
049799                           PV-P2L-OPEN-TO-TCLOS-DAY               04979999
049800     END-IF.                                                      04980099
049801                                                                  04980199
049802     IF  PV-3WD-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   04980299
049803         PV-3WD-P2L-OPEN-TO-SHIP-CNT  >  0                        04980399
049804         DIVIDE PV-3WD-P2L-OPEN-TO-SHIP-MIN                       04980499
049805             BY PV-3WD-P2L-OPEN-TO-SHIP-CNT                       04980599
049806         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           04980699
049807                 ROUNDED                                          04980799
049808         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           04980899
049809             BY 1440                                              04980999
049810         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           04981099
049811                 ROUNDED                                          04981199
049812     ELSE                                                         04981299
049813         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                04981399
049814                           PV-P2L-OPEN-TO-SHIP-DAY                04981499
049815     END-IF.                                                      04981599
049816                                                                  04981699
049817     IF  PV-3WD-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 04981799
049818         PV-3WD-P2L-CLOSE-TO-TCLOS-CNT  >  0                      04981899
049819         DIVIDE PV-3WD-P2L-CLOSE-TO-TCLOS-MIN                     04981999
049820             BY PV-3WD-P2L-CLOSE-TO-TCLOS-CNT                     04982099
049821         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         04982199
049822                 ROUNDED                                          04982299
049823         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         04982399
049824             BY 1440                                              04982499
049825         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         04982599
049826                 ROUNDED                                          04982699
049827     ELSE                                                         04982799
049828         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              04982899
049829                           PV-P2L-CLOSE-TO-TCLOS-DAY              04982999
049830     END-IF.                                                      04983099
049831                                                                  04983199
049832     IF  PV-3WD-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  04983299
049833         PV-3WD-P2L-CLOSE-TO-SHIP-CNT  >  0                       04983399
049834         DIVIDE PV-3WD-P2L-CLOSE-TO-SHIP-MIN                      04983499
049835             BY PV-3WD-P2L-CLOSE-TO-SHIP-CNT                      04983599
049836         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          04983699
049837                 ROUNDED                                          04983799
049838         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          04983899
049839             BY 1440                                              04983999
049840         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          04984099
049841                 ROUNDED                                          04984199
049842     ELSE                                                         04984299
049843         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               04984399
049844                           PV-P2L-CLOSE-TO-SHIP-DAY               04984499
049845     END-IF.                                                      04984599
049846                                                                  04984699
049847     IF  PV-3WD-ARRIVE-TO-MSTR-MIN  >  0  AND                     04984799
049848         PV-3WD-ARRIVE-TO-MSTR-CNT  >  0                          04984899
049849         DIVIDE PV-3WD-ARRIVE-TO-MSTR-MIN                         04984999
049850             BY PV-3WD-ARRIVE-TO-MSTR-CNT                         04985099
049851         GIVING PV-ARRIVE-TO-MSTR-AVG                             04985199
049852                 ROUNDED                                          04985299
049853         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             04985399
049854             BY 1440                                              04985499
049855         GIVING PV-ARRIVE-TO-MSTR-DAY                             04985599
049856                 ROUNDED                                          04985699
049857     ELSE                                                         04985799
049858         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  04985899
049859                           PV-ARRIVE-TO-MSTR-DAY                  04985999
049860     END-IF.                                                      04986099
049861                                                                  04986199
049862     IF  PV-3WD-PRC-TO-MSTR-MIN  >  0  AND                        04986299
049863         PV-3WD-PRC-TO-MSTR-CNT  >  0                             04986399
049864         DIVIDE PV-3WD-PRC-TO-MSTR-MIN                            04986499
049865             BY PV-3WD-PRC-TO-MSTR-CNT                            04986599
049866         GIVING PV-PRC-TO-MSTR-AVG                                04986699
049867                 ROUNDED                                          04986799
049868         DIVIDE PV-PRC-TO-MSTR-AVG                                04986899
049869             BY 1440                                              04986999
049870         GIVING PV-PRC-TO-MSTR-DAY                                04987099
049871                 ROUNDED                                          04987199
049872     ELSE                                                         04987299
049873         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     04987399
049874                           PV-PRC-TO-MSTR-DAY                     04987499
049875     END-IF.                                                      04987599
049876                                                                  04987699
049877     IF  PV-3WD-ON-OTBND-TO-CLOS-MIN  >  0  AND                   04987799
049878         PV-3WD-ON-OTBND-TO-CLOS-CNT  >  0                        04987899
049879         DIVIDE PV-3WD-ON-OTBND-TO-CLOS-MIN                       04987999
049880             BY PV-3WD-ON-OTBND-TO-CLOS-CNT                       04988099
049881         GIVING PV-ON-OTBND-TO-CLOS-AVG                           04988199
049882                 ROUNDED                                          04988299
049883         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           04988399
049884             BY 1440                                              04988499
049885         GIVING PV-ON-OTBND-TO-CLOS-DAY                           04988599
049886                 ROUNDED                                          04988699
049887     ELSE                                                         04988799
049888         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                04988899
049889                           PV-ON-OTBND-TO-CLOS-DAY                04988999
049890     END-IF.                                                      04989099
049891                                                                  04989199
049892     IF  PV-3WD-ON-OTBND-TO-SHIP-MIN  >  0  AND                   04989299
049893         PV-3WD-ON-OTBND-TO-SHIP-CNT  >  0                        04989399
049894         DIVIDE PV-3WD-ON-OTBND-TO-SHIP-MIN                       04989499
049895             BY PV-3WD-ON-OTBND-TO-SHIP-CNT                       04989599
049896         GIVING PV-ON-OTBND-TO-SHIP-AVG                           04989699
049897                 ROUNDED                                          04989799
049898         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           04989899
049899             BY 1440                                              04989999
049900         GIVING PV-ON-OTBND-TO-SHIP-DAY                           04990099
049901                 ROUNDED                                          04990199
049902     ELSE                                                         04990299
049903         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                04990399
049904                           PV-ON-OTBND-TO-SHIP-DAY                04990499
049905     END-IF.                                                      04990599
049906                                                                  04990699
049907     IF  PV-3WD-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  04990799
049908         PV-3WD-MSTR-CRE-TO-OTBND-CNT  >  0                       04990899
049909         DIVIDE PV-3WD-MSTR-CRE-TO-OTBND-MIN                      04990999
049910             BY PV-3WD-MSTR-CRE-TO-OTBND-CNT                      04991099
049911         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          04991199
049912                 ROUNDED                                          04991299
049913         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          04991399
049914             BY 1440                                              04991499
049915         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          04991599
049916                 ROUNDED                                          04991699
049917     ELSE                                                         04991799
049918         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               04991899
049919                           PV-MSTR-CRE-TO-OTBND-DAY               04991999
049920     END-IF.                                                      04992099
049921                                                                  04992199
049922     IF  PV-3WD-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  04992299
049923         PV-3WD-MSTR-CRE-TO-TCLOS-CNT  >  0                       04992399
049924         DIVIDE PV-3WD-MSTR-CRE-TO-TCLOS-MIN                      04992499
049925             BY PV-3WD-MSTR-CRE-TO-TCLOS-CNT                      04992599
049926         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          04992699
049927                 ROUNDED                                          04992799
049928         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          04992899
049929             BY 1440                                              04992999
049930         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          04993099
049931                 ROUNDED                                          04993199
049932     ELSE                                                         04993299
049933         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               04993399
049934                           PV-MSTR-CRE-TO-TCLOS-DAY               04993499
049935     END-IF.                                                      04993599
049936                                                                  04993699
049937     IF  PV-3WD-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   04993799
049938         PV-3WD-MSTR-CRE-TO-SHIP-CNT  >  0                        04993899
049939         DIVIDE PV-3WD-MSTR-CRE-TO-SHIP-MIN                       04993999
049940             BY PV-3WD-MSTR-CRE-TO-SHIP-CNT                       04994099
049941         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           04994199
049942                 ROUNDED                                          04994299
049943         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           04994399
049944             BY 1440                                              04994499
049945         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           04994599
049946                 ROUNDED                                          04994699
049947     ELSE                                                         04994799
049948         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                04994899
049949                           PV-MSTR-CRE-TO-SHIP-DAY                04994999
049950     END-IF.                                                      04995099
049951                                                                  04995199
049952     IF  PV-3WD-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                04995299
049953         PV-3WD-MSTR-FIRST-TO-OTBND-CNT  >  0                     04995399
049954         DIVIDE PV-3WD-MSTR-FIRST-TO-OTBND-MIN                    04995499
049955             BY PV-3WD-MSTR-FIRST-TO-OTBND-CNT                    04995599
049956         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        04995699
049957                 ROUNDED                                          04995799
049958         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        04995899
049959             BY 1440                                              04995999
049960         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        04996099
049961                 ROUNDED                                          04996199
049962     ELSE                                                         04996299
049963         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             04996399
049964                           PV-MSTR-FIRST-TO-OTBND-DAY             04996499
049965     END-IF.                                                      04996599
049966                                                                  04996699
049967     IF  PV-3WD-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                04996799
049968         PV-3WD-MSTR-FIRST-TO-TCLOS-CNT  >  0                     04996899
049969         DIVIDE PV-3WD-MSTR-FIRST-TO-TCLOS-MIN                    04996999
049970             BY PV-3WD-MSTR-FIRST-TO-TCLOS-CNT                    04997099
049971         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        04997199
049972                 ROUNDED                                          04997299
049973         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        04997399
049974             BY 1440                                              04997499
049975         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        04997599
049976                 ROUNDED                                          04997699
049977     ELSE                                                         04997799
049978         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             04997899
049979                           PV-MSTR-FIRST-TO-TCLOS-DAY             04997999
049980     END-IF.                                                      04998099
049981                                                                  04998199
049982     IF  PV-3WD-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 04998299
049983         PV-3WD-MSTR-FIRST-TO-SHIP-CNT  >  0                      04998399
049984         DIVIDE PV-3WD-MSTR-FIRST-TO-SHIP-MIN                     04998499
049985             BY PV-3WD-MSTR-FIRST-TO-SHIP-CNT                     04998599
049986         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         04998699
049987                 ROUNDED                                          04998799
049988         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         04998899
049989             BY 1440                                              04998999
049990         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         04999099
049991                 ROUNDED                                          04999199
049992     ELSE                                                         04999299
049993         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              04999399
049994                           PV-MSTR-FIRST-TO-SHIP-DAY              04999499
049995     END-IF.                                                      04999599
049996                                                                  04999699
049997     IF  PV-3WD-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 04999799
049998         PV-3WD-MSTR-LAST-TO-OTBND-CNT  >  0                      04999899
049999         DIVIDE PV-3WD-MSTR-LAST-TO-OTBND-MIN                     04999999
050000             BY PV-3WD-MSTR-LAST-TO-OTBND-CNT                     05000099
050001         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         05000199
050002                 ROUNDED                                          05000299
050003         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         05000399
050004             BY 1440                                              05000499
050005         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         05000599
050006                 ROUNDED                                          05000699
050007     ELSE                                                         05000799
050008         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              05000899
050009                           PV-MSTR-LAST-TO-OTBND-DAY              05000999
050010     END-IF.                                                      05001099
050011                                                                  05001199
050012     IF  PV-3WD-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 05001299
050013         PV-3WD-MSTR-LAST-TO-TCLOS-CNT  >  0                      05001399
050014         DIVIDE PV-3WD-MSTR-LAST-TO-TCLOS-MIN                     05001499
050015             BY PV-3WD-MSTR-LAST-TO-TCLOS-CNT                     05001599
050016         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         05001699
050017                 ROUNDED                                          05001799
050018         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         05001899
050019             BY 1440                                              05001999
050020         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         05002099
050021                 ROUNDED                                          05002199
050022     ELSE                                                         05002299
050023         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              05002399
050024                           PV-MSTR-LAST-TO-TCLOS-DAY              05002499
050025     END-IF.                                                      05002599
050026                                                                  05002699
050027     IF  PV-3WD-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  05002799
050028         PV-3WD-MSTR-LAST-TO-SHIP-CNT  >  0                       05002899
050029         DIVIDE PV-3WD-MSTR-LAST-TO-SHIP-MIN                      05002999
050030             BY PV-3WD-MSTR-LAST-TO-SHIP-CNT                      05003099
050031         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          05003199
050032                 ROUNDED                                          05003299
050033         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          05003399
050034             BY 1440                                              05003499
050035         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          05003599
050036                 ROUNDED                                          05003699
050037     ELSE                                                         05003799
050038         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               05003899
050039                           PV-MSTR-LAST-TO-SHIP-DAY               05003999
050040     END-IF.                                                      05004099
050041*                                                                 05004199
050042*** 8/19                                                          05004299
050043*                                                                 05004399
050044     IF  PV-3WD-TRIP-CARTONS            >  0  AND                 05004499
050045         PV-3WD-TRIP-SRC-CARTONS        >  0                      05004599
050046         DIVIDE  PV-3WD-TRIP-SRC-CARTONS                          05004699
050047             BY  PV-3WD-TRIP-CARTONS                              05004799
050048         GIVING  PV-TRIP-SRC-CRTN                                 05004899
050049                   ROUNDED                                        05004999
050050         MULTIPLY  PV-TRIP-SRC-CRTN                               05005099
050051               BY  100                                            05005199
050052           GIVING  PV-TRIP-SRC-CRTN-PCNT                          05005299
050053     ELSE                                                         05005399
050054         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  05005499
050055                           PV-TRIP-SRC-CRTN                       05005599
050056     END-IF.                                                      05005699
050057                                                                  05005799
050058                                                                  05005899
050059     MOVE ZEROES                TO DL5-DC-NBR                     05005999
050060     MOVE 'CORP OVERALL    '    TO DL5-DC-NAME                    05006099
050061     MOVE '3PRTY WHSE DISTR'    TO DL5-SOURCE                     05006199
050062                                                                  05006299
050063     IF   SU134-EFC-STORES  AND                                   05006399
050064          PV-3WD-TRIP-SRC-CARTONS  =   0                          05006499
050065             CONTINUE                                             05006599
050066     ELSE                                                         05006699
050067     IF   SU134-LFC-STORES  AND                                   05006799
050068          PV-3WD-TRIP-SRC-CARTONS  =   0                          05006899
050069             CONTINUE                                             05006999
050070     ELSE                                                         05007099
050071         PERFORM 5070-PRINT-CORP-TOTALS                           05007199
050072     END-IF                                                       05007299
050073     END-IF.                                                      05007399
050074                                                                  05007499
050075                                                                  05007599
050076****************************************************************  05007699
050077* CALCULATE OTH-AVERAGES                                       *  05007799
050078****************************************************************  05007899
050079 3085-CALC-OTH-AVERAGES.                                          05007999
050080                                                                  05008099
050081     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            05008199
050082                             PV-TRIP-CLOSE-TO-SHIP-AVG            05008299
050083                             PV-TRIP-OPEN-TO-SHIP-AVG             05008399
050084                             PV-ARRIVE-TO-PRC-AVG                 05008499
050085                             PV-ARRIVE-TO-P2L-PKD-AVG             05008599
050086                             PV-PRC-TO-P2L-PKD-AVG                05008699
050087                             PV-P2L-PKD-TO-CLOSE-AVG              05008799
050088                             PV-P2L-OPEN-TO-CLOSE-AVG             05008899
050089                             PV-P2L-OPEN-TO-OTBND-AVG             05008999
050090                             PV-P2L-CLOSE-TO-OTBND-AVG            05009099
050091                             PV-ARRIVE-TO-OTBND-AVG               05009199
050092                             PV-PRC-TO-OTBND-AVG                  05009299
050093                             PV-ARRIVE-TO-TCLOS-AVG               05009399
050094                             PV-ARRIVE-TO-SHIP-AVG                05009499
050095                             PV-P2L-OPEN-TO-TCLOS-AVG             05009599
050096                             PV-P2L-OPEN-TO-SHIP-AVG              05009699
050097                             PV-P2L-CLOSE-TO-TCLOS-AVG            05009799
050098                             PV-P2L-CLOSE-TO-SHIP-AVG             05009899
050099                             PV-ARRIVE-TO-MSTR-AVG                05009999
050100                             PV-PRC-TO-MSTR-AVG                   05010099
050101                             PV-MSTR-CRE-TO-OTBND-AVG             05010199
050102                             PV-MSTR-CRE-TO-TCLOS-AVG             05010299
050103                             PV-MSTR-CRE-TO-SHIP-AVG              05010399
050104                             PV-MSTR-FIRST-TO-OTBND-AVG           05010499
050105                             PV-MSTR-FIRST-TO-TCLOS-AVG           05010599
050106                             PV-MSTR-FIRST-TO-SHIP-AVG            05010699
050107                             PV-MSTR-LAST-TO-OTBND-AVG            05010799
050108                             PV-MSTR-LAST-TO-TCLOS-AVG            05010899
050109                             PV-MSTR-LAST-TO-SHIP-AVG             05010999
050110                             PV-ON-OTBND-TO-CLOS-AVG              05011099
050111                             PV-ON-OTBND-TO-SHIP-AVG              05011199
050112                             PV-TRIP-OPEN-TO-CLOSE-DAY            05011299
050113                             PV-TRIP-CLOSE-TO-SHIP-DAY            05011399
050114                             PV-TRIP-OPEN-TO-SHIP-DAY             05011499
050115                             PV-ARRIVE-TO-PRC-DAY                 05011599
050116                             PV-ARRIVE-TO-P2L-PKD-DAY             05011699
050117                             PV-PRC-TO-P2L-PKD-DAY                05011799
050118                             PV-P2L-PKD-TO-CLOSE-DAY              05011899
050119                             PV-P2L-OPEN-TO-CLOSE-DAY             05011999
050120                             PV-P2L-OPEN-TO-OTBND-DAY             05012099
050121                             PV-P2L-CLOSE-TO-OTBND-DAY            05012199
050122                             PV-ARRIVE-TO-OTBND-DAY               05012299
050123                             PV-PRC-TO-OTBND-DAY                  05012399
050124                             PV-ARRIVE-TO-TCLOS-DAY               05012499
050125                             PV-ARRIVE-TO-SHIP-DAY                05012599
050126                             PV-P2L-OPEN-TO-TCLOS-DAY             05012699
050127                             PV-P2L-OPEN-TO-SHIP-DAY              05012799
050128                             PV-P2L-CLOSE-TO-TCLOS-DAY            05012899
050129                             PV-P2L-CLOSE-TO-SHIP-DAY             05012999
050130                             PV-ARRIVE-TO-MSTR-DAY                05013099
050131                             PV-PRC-TO-MSTR-DAY                   05013199
050132                             PV-MSTR-CRE-TO-OTBND-DAY             05013299
050133                             PV-MSTR-CRE-TO-TCLOS-DAY             05013399
050134                             PV-MSTR-CRE-TO-SHIP-DAY              05013499
050135                             PV-MSTR-FIRST-TO-OTBND-DAY           05013599
050136                             PV-MSTR-FIRST-TO-TCLOS-DAY           05013699
050137                             PV-MSTR-FIRST-TO-SHIP-DAY            05013799
050138                             PV-MSTR-LAST-TO-OTBND-DAY            05013899
050139                             PV-MSTR-LAST-TO-TCLOS-DAY            05013999
050140                             PV-MSTR-LAST-TO-SHIP-DAY             05014099
050141                             PV-ON-OTBND-TO-CLOS-DAY              05014199
050142                             PV-ON-OTBND-TO-SHIP-DAY.             05014299
050143                                                                  05014399
050144     IF  PV-OTH-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 05014499
050145         PV-OTH-TRIP-OPEN-TO-CLOSE-CNT  >  0                      05014599
050146         DIVIDE  PV-OTH-TRIP-OPEN-TO-CLOSE-MIN                    05014699
050147             BY  PV-OTH-TRIP-OPEN-TO-CLOSE-CNT                    05014799
050148         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        05014899
050149                 ROUNDED                                          05014999
050150         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        05015099
050151             BY  1440                                             05015199
050152         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        05015299
050153                 ROUNDED                                          05015399
050154     ELSE                                                         05015499
050155         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              05015599
050156                           PV-TRIP-OPEN-TO-CLOSE-DAY              05015699
050157     END-IF.                                                      05015799
050158                                                                  05015899
050159     IF  PV-OTH-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 05015999
050160         PV-OTH-TRIP-CLOSE-TO-SHIP-CNT  >  0                      05016099
050161         DIVIDE  PV-OTH-TRIP-CLOSE-TO-SHIP-MIN                    05016199
050162             BY  PV-OTH-TRIP-CLOSE-TO-SHIP-CNT                    05016299
050163         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        05016399
050164                 ROUNDED                                          05016499
050165         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        05016599
050166             BY  1440                                             05016699
050167         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        05016799
050168                 ROUNDED                                          05016899
050169     ELSE                                                         05016999
050170         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              05017099
050171                           PV-TRIP-CLOSE-TO-SHIP-DAY              05017199
050172     END-IF.                                                      05017299
050173                                                                  05017399
050174     IF  PV-OTH-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  05017499
050175         PV-OTH-TRIP-OPEN-TO-SHIP-CNT  >  0                       05017599
050176         DIVIDE  PV-OTH-TRIP-OPEN-TO-SHIP-MIN                     05017699
050177             BY  PV-OTH-TRIP-OPEN-TO-SHIP-CNT                     05017799
050178         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         05017899
050179                 ROUNDED                                          05017999
050180         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         05018099
050181             BY  1440                                             05018199
050182         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         05018299
050183                 ROUNDED                                          05018399
050184     ELSE                                                         05018499
050185         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               05018599
050186                           PV-TRIP-OPEN-TO-SHIP-DAY               05018699
050187     END-IF.                                                      05018799
050188                                                                  05018899
050189                                                                  05018999
050190     IF  PV-OTH-ARRIVE-TO-PRC-MIN  >  0  AND                      05019099
050191         PV-OTH-ARRIVE-TO-PRC-CNT  >  0                           05019199
050192         DIVIDE PV-OTH-ARRIVE-TO-PRC-MIN                          05019299
050193             BY PV-OTH-ARRIVE-TO-PRC-CNT                          05019399
050194         GIVING PV-ARRIVE-TO-PRC-AVG                              05019499
050195                 ROUNDED                                          05019599
050196         DIVIDE PV-ARRIVE-TO-PRC-AVG                              05019699
050197             BY 1440                                              05019799
050198         GIVING PV-ARRIVE-TO-PRC-DAY                              05019899
050199                 ROUNDED                                          05019999
050200     ELSE                                                         05020099
050201         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   05020199
050202                           PV-ARRIVE-TO-PRC-DAY                   05020299
050203     END-IF.                                                      05020399
050204                                                                  05020499
050205     IF  PV-OTH-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  05020599
050206         PV-OTH-ARRIVE-TO-P2L-PKD-CNT  >  0                       05020699
050207         DIVIDE PV-OTH-ARRIVE-TO-P2L-PKD-MIN                      05020799
050208             BY PV-OTH-ARRIVE-TO-P2L-PKD-CNT                      05020899
050209         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          05020999
050210                 ROUNDED                                          05021099
050211         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          05021199
050212             BY 1440                                              05021299
050213         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          05021399
050214                 ROUNDED                                          05021499
050215     ELSE                                                         05021599
050216         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               05021699
050217                           PV-ARRIVE-TO-P2L-PKD-DAY               05021799
050218     END-IF.                                                      05021899
050219                                                                  05021999
050220                                                                  05022099
050221     IF  PV-OTH-PRC-TO-P2L-PKD-MIN  >  0  AND                     05022199
050222         PV-OTH-PRC-TO-P2L-PKD-CNT  >  0                          05022299
050223         DIVIDE PV-OTH-PRC-TO-P2L-PKD-MIN                         05022399
050224             BY PV-OTH-PRC-TO-P2L-PKD-CNT                         05022499
050225         GIVING PV-PRC-TO-P2L-PKD-AVG                             05022599
050226                 ROUNDED                                          05022699
050227         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             05022799
050228             BY 1440                                              05022899
050229         GIVING PV-PRC-TO-P2L-PKD-DAY                             05022999
050230                 ROUNDED                                          05023099
050231     ELSE                                                         05023199
050232         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  05023299
050233                           PV-PRC-TO-P2L-PKD-DAY                  05023399
050234     END-IF.                                                      05023499
050235                                                                  05023599
050236     IF  PV-OTH-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   05023699
050237         PV-OTH-P2L-PKD-TO-CLOSE-CNT  >  0                        05023799
050238         DIVIDE PV-OTH-P2L-PKD-TO-CLOSE-MIN                       05023899
050239             BY PV-OTH-P2L-PKD-TO-CLOSE-CNT                       05023999
050240         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           05024099
050241                 ROUNDED                                          05024199
050242         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           05024299
050243             BY 1440                                              05024399
050244         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           05024499
050245                 ROUNDED                                          05024599
050246     ELSE                                                         05024699
050247         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                05024799
050248                           PV-P2L-PKD-TO-CLOSE-DAY                05024899
050249     END-IF.                                                      05024999
050250                                                                  05025099
050251     IF  PV-OTH-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  05025199
050252         PV-OTH-P2L-OPEN-TO-CLOSE-CNT  >  0                       05025299
050253         DIVIDE PV-OTH-P2L-OPEN-TO-CLOSE-MIN                      05025399
050254             BY PV-OTH-P2L-OPEN-TO-CLOSE-CNT                      05025499
050255         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          05025599
050256                 ROUNDED                                          05025699
050257         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          05025799
050258             BY 1440                                              05025899
050259         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          05025999
050260                 ROUNDED                                          05026099
050261     ELSE                                                         05026199
050262         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               05026299
050263                           PV-P2L-OPEN-TO-CLOSE-DAY               05026399
050264     END-IF.                                                      05026499
050265                                                                  05026599
050266     IF  PV-OTH-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  05026699
050267         PV-OTH-P2L-OPEN-TO-OTBND-CNT  >  0                       05026799
050268         DIVIDE PV-OTH-P2L-OPEN-TO-OTBND-MIN                      05026899
050269             BY PV-OTH-P2L-OPEN-TO-OTBND-CNT                      05026999
050270         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          05027099
050271                 ROUNDED                                          05027199
050272         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          05027299
050273             BY 1440                                              05027399
050274         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          05027499
050275                 ROUNDED                                          05027599
050276     ELSE                                                         05027699
050277         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               05027799
050278                           PV-P2L-OPEN-TO-OTBND-DAY               05027899
050279     END-IF.                                                      05027999
050280                                                                  05028099
050281     IF  PV-OTH-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 05028199
050282         PV-OTH-P2L-CLOSE-TO-OTBND-CNT  >  0                      05028299
050283         DIVIDE PV-OTH-P2L-CLOSE-TO-OTBND-MIN                     05028399
050284             BY PV-OTH-P2L-CLOSE-TO-OTBND-CNT                     05028499
050285         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         05028599
050286                 ROUNDED                                          05028699
050287         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         05028799
050288             BY 1440                                              05028899
050289         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         05028999
050290                 ROUNDED                                          05029099
050291     ELSE                                                         05029199
050292         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              05029299
050293                           PV-P2L-CLOSE-TO-OTBND-DAY              05029399
050294     END-IF.                                                      05029499
050295                                                                  05029599
050296     IF  PV-OTH-ARRIVE-TO-OTBND-MIN  >  0  AND                    05029699
050297         PV-OTH-ARRIVE-TO-OTBND-CNT  >  0                         05029799
050298         DIVIDE PV-OTH-ARRIVE-TO-OTBND-MIN                        05029899
050299             BY PV-OTH-ARRIVE-TO-OTBND-CNT                        05029999
050300         GIVING PV-ARRIVE-TO-OTBND-AVG                            05030099
050301                 ROUNDED                                          05030199
050302         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            05030299
050303             BY 1440                                              05030399
050304         GIVING PV-ARRIVE-TO-OTBND-DAY                            05030499
050305                 ROUNDED                                          05030599
050306     ELSE                                                         05030699
050307         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 05030799
050308                           PV-ARRIVE-TO-OTBND-DAY                 05030899
050309     END-IF.                                                      05030999
050310                                                                  05031099
050311     IF  PV-OTH-PRC-TO-OTBND-MIN  >  0  AND                       05031199
050312         PV-OTH-PRC-TO-OTBND-CNT  >  0                            05031299
050313         DIVIDE PV-OTH-PRC-TO-OTBND-MIN                           05031399
050314             BY PV-OTH-PRC-TO-OTBND-CNT                           05031499
050315         GIVING PV-PRC-TO-OTBND-AVG                               05031599
050316                 ROUNDED                                          05031699
050317         DIVIDE PV-PRC-TO-OTBND-AVG                               05031799
050318             BY 1440                                              05031899
050319         GIVING PV-PRC-TO-OTBND-DAY                               05031999
050320                 ROUNDED                                          05032099
050321     ELSE                                                         05032199
050322         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    05032299
050323                           PV-PRC-TO-OTBND-DAY                    05032399
050324     END-IF.                                                      05032499
050325                                                                  05032599
050326     IF  PV-OTH-ARRIVE-TO-TCLOS-MIN  >  0  AND                    05032699
050327         PV-OTH-ARRIVE-TO-TCLOS-CNT  >  0                         05032799
050328         DIVIDE PV-OTH-ARRIVE-TO-TCLOS-MIN                        05032899
050329             BY PV-OTH-ARRIVE-TO-TCLOS-CNT                        05032999
050330         GIVING PV-ARRIVE-TO-TCLOS-AVG                            05033099
050331                 ROUNDED                                          05033199
050332         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            05033299
050333             BY 1440                                              05033399
050334         GIVING PV-ARRIVE-TO-TCLOS-DAY                            05033499
050335                 ROUNDED                                          05033599
050336     ELSE                                                         05033699
050337         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 05033799
050338                           PV-ARRIVE-TO-TCLOS-DAY                 05033899
050339     END-IF.                                                      05033999
050340                                                                  05034099
050341     IF  PV-OTH-ARRIVE-TO-SHIP-MIN  >  0  AND                     05034199
050342         PV-OTH-ARRIVE-TO-SHIP-CNT  >  0                          05034299
050343         DIVIDE PV-OTH-ARRIVE-TO-SHIP-MIN                         05034399
050344             BY PV-OTH-ARRIVE-TO-SHIP-CNT                         05034499
050345         GIVING PV-ARRIVE-TO-SHIP-AVG                             05034599
050346                 ROUNDED                                          05034699
050347         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             05034799
050348             BY 1440                                              05034899
050349         GIVING PV-ARRIVE-TO-SHIP-DAY                             05034999
050350                 ROUNDED                                          05035099
050351     ELSE                                                         05035199
050352         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  05035299
050353                           PV-ARRIVE-TO-SHIP-DAY                  05035399
050354     END-IF.                                                      05035499
050355                                                                  05035599
050356     IF  PV-OTH-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  05035699
050357         PV-OTH-P2L-OPEN-TO-TCLOS-CNT  >  0                       05035799
050358         DIVIDE PV-OTH-P2L-OPEN-TO-TCLOS-MIN                      05035899
050359             BY PV-OTH-P2L-OPEN-TO-TCLOS-CNT                      05035999
050360         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          05036099
050361                 ROUNDED                                          05036199
050362         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          05036299
050363             BY 1440                                              05036399
050364         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          05036499
050365                 ROUNDED                                          05036599
050366     ELSE                                                         05036699
050367         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               05036799
050368                           PV-P2L-OPEN-TO-TCLOS-DAY               05036899
050369     END-IF.                                                      05036999
050370                                                                  05037099
050371     IF  PV-OTH-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   05037199
050372         PV-OTH-P2L-OPEN-TO-SHIP-CNT  >  0                        05037299
050373         DIVIDE PV-OTH-P2L-OPEN-TO-SHIP-MIN                       05037399
050374             BY PV-OTH-P2L-OPEN-TO-SHIP-CNT                       05037499
050375         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           05037599
050376                 ROUNDED                                          05037699
050377         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           05037799
050378             BY 1440                                              05037899
050379         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           05037999
050380                 ROUNDED                                          05038099
050381     ELSE                                                         05038199
050382         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                05038299
050383                           PV-P2L-OPEN-TO-SHIP-DAY                05038399
050384     END-IF.                                                      05038499
050385                                                                  05038599
050386     IF  PV-OTH-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 05038699
050387         PV-OTH-P2L-CLOSE-TO-TCLOS-CNT  >  0                      05038799
050388         DIVIDE PV-OTH-P2L-CLOSE-TO-TCLOS-MIN                     05038899
050389             BY PV-OTH-P2L-CLOSE-TO-TCLOS-CNT                     05038999
050390         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         05039099
050391                 ROUNDED                                          05039199
050392         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         05039299
050393             BY 1440                                              05039399
050394         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         05039499
050395                 ROUNDED                                          05039599
050396     ELSE                                                         05039699
050397         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              05039799
050398                           PV-P2L-CLOSE-TO-TCLOS-DAY              05039899
050399     END-IF.                                                      05039999
050400                                                                  05040099
050401     IF  PV-OTH-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  05040199
050402         PV-OTH-P2L-CLOSE-TO-SHIP-CNT  >  0                       05040299
050403         DIVIDE PV-OTH-P2L-CLOSE-TO-SHIP-MIN                      05040399
050404             BY PV-OTH-P2L-CLOSE-TO-SHIP-CNT                      05040499
050405         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          05040599
050406                 ROUNDED                                          05040699
050407         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          05040799
050408             BY 1440                                              05040899
050409         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          05040999
050410                 ROUNDED                                          05041099
050411     ELSE                                                         05041199
050412         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               05041299
050413                           PV-P2L-CLOSE-TO-SHIP-DAY               05041399
050414     END-IF.                                                      05041499
050415                                                                  05041599
050416     IF  PV-OTH-ARRIVE-TO-MSTR-MIN  >  0  AND                     05041699
050417         PV-OTH-ARRIVE-TO-MSTR-CNT  >  0                          05041799
050418         DIVIDE PV-OTH-ARRIVE-TO-MSTR-MIN                         05041899
050419             BY PV-OTH-ARRIVE-TO-MSTR-CNT                         05041999
050420         GIVING PV-ARRIVE-TO-MSTR-AVG                             05042099
050421                 ROUNDED                                          05042199
050422         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             05042299
050423             BY 1440                                              05042399
050424         GIVING PV-ARRIVE-TO-MSTR-DAY                             05042499
050425                 ROUNDED                                          05042599
050426     ELSE                                                         05042699
050427         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  05042799
050428                           PV-ARRIVE-TO-MSTR-DAY                  05042899
050429     END-IF.                                                      05042999
050430                                                                  05043099
050431     IF  PV-OTH-PRC-TO-MSTR-MIN  >  0  AND                        05043199
050432         PV-OTH-PRC-TO-MSTR-CNT  >  0                             05043299
050433         DIVIDE PV-OTH-PRC-TO-MSTR-MIN                            05043399
050434             BY PV-OTH-PRC-TO-MSTR-CNT                            05043499
050435         GIVING PV-PRC-TO-MSTR-AVG                                05043599
050436                 ROUNDED                                          05043699
050437         DIVIDE PV-PRC-TO-MSTR-AVG                                05043799
050438             BY 1440                                              05043899
050439         GIVING PV-PRC-TO-MSTR-DAY                                05043999
050440                 ROUNDED                                          05044099
050441     ELSE                                                         05044199
050442         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     05044299
050443                           PV-PRC-TO-MSTR-DAY                     05044399
050444     END-IF.                                                      05044499
050445                                                                  05044599
050446     IF  PV-OTH-ON-OTBND-TO-CLOS-MIN  >  0  AND                   05044699
050447         PV-OTH-ON-OTBND-TO-CLOS-CNT  >  0                        05044799
050448         DIVIDE PV-OTH-ON-OTBND-TO-CLOS-MIN                       05044899
050449             BY PV-OTH-ON-OTBND-TO-CLOS-CNT                       05044999
050450         GIVING PV-ON-OTBND-TO-CLOS-AVG                           05045099
050451                 ROUNDED                                          05045199
050452         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           05045299
050453             BY 1440                                              05045399
050454         GIVING PV-ON-OTBND-TO-CLOS-DAY                           05045499
050455                 ROUNDED                                          05045599
050456     ELSE                                                         05045699
050457         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                05045799
050458                           PV-ON-OTBND-TO-CLOS-DAY                05045899
050459     END-IF.                                                      05045999
050460                                                                  05046099
050461     IF  PV-OTH-ON-OTBND-TO-SHIP-MIN  >  0  AND                   05046199
050462         PV-OTH-ON-OTBND-TO-SHIP-CNT  >  0                        05046299
050463         DIVIDE PV-OTH-ON-OTBND-TO-SHIP-MIN                       05046399
050464             BY PV-OTH-ON-OTBND-TO-SHIP-CNT                       05046499
050465         GIVING PV-ON-OTBND-TO-SHIP-AVG                           05046599
050466                 ROUNDED                                          05046699
050467         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           05046799
050468             BY 1440                                              05046899
050469         GIVING PV-ON-OTBND-TO-SHIP-DAY                           05046999
050470                 ROUNDED                                          05047099
050471     ELSE                                                         05047199
050472         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                05047299
050473                           PV-ON-OTBND-TO-SHIP-DAY                05047399
050474     END-IF.                                                      05047499
050475                                                                  05047599
050476     IF  PV-OTH-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  05047699
050477         PV-OTH-MSTR-CRE-TO-OTBND-CNT  >  0                       05047799
050478         DIVIDE PV-OTH-MSTR-CRE-TO-OTBND-MIN                      05047899
050479             BY PV-OTH-MSTR-CRE-TO-OTBND-CNT                      05047999
050480         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          05048099
050481                 ROUNDED                                          05048199
050482         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          05048299
050483             BY 1440                                              05048399
050484         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          05048499
050485                 ROUNDED                                          05048599
050486     ELSE                                                         05048699
050487         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               05048799
050488                           PV-MSTR-CRE-TO-OTBND-DAY               05048899
050489     END-IF.                                                      05048999
050490                                                                  05049099
050491     IF  PV-OTH-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  05049199
050492         PV-OTH-MSTR-CRE-TO-TCLOS-CNT  >  0                       05049299
050493         DIVIDE PV-OTH-MSTR-CRE-TO-TCLOS-MIN                      05049399
050494             BY PV-OTH-MSTR-CRE-TO-TCLOS-CNT                      05049499
050495         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          05049599
050496                 ROUNDED                                          05049699
050497         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          05049799
050498             BY 1440                                              05049899
050499         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          05049999
050500                 ROUNDED                                          05050099
050501     ELSE                                                         05050199
050502         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               05050299
050503                           PV-MSTR-CRE-TO-TCLOS-DAY               05050399
050504     END-IF.                                                      05050499
050505                                                                  05050599
050506     IF  PV-OTH-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   05050699
050507         PV-OTH-MSTR-CRE-TO-SHIP-CNT  >  0                        05050799
050508         DIVIDE PV-OTH-MSTR-CRE-TO-SHIP-MIN                       05050899
050509             BY PV-OTH-MSTR-CRE-TO-SHIP-CNT                       05050999
050510         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           05051099
050511                 ROUNDED                                          05051199
050512         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           05051299
050513             BY 1440                                              05051399
050514         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           05051499
050515                 ROUNDED                                          05051599
050516     ELSE                                                         05051699
050517         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                05051799
050518                           PV-MSTR-CRE-TO-SHIP-DAY                05051899
050519     END-IF.                                                      05051999
050520                                                                  05052099
050521     IF  PV-OTH-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                05052199
050522         PV-OTH-MSTR-FIRST-TO-OTBND-CNT  >  0                     05052299
050523         DIVIDE PV-OTH-MSTR-FIRST-TO-OTBND-MIN                    05052399
050524             BY PV-OTH-MSTR-FIRST-TO-OTBND-CNT                    05052499
050525         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        05052599
050526                 ROUNDED                                          05052699
050527         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        05052799
050528             BY 1440                                              05052899
050529         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        05052999
050530                 ROUNDED                                          05053099
050531     ELSE                                                         05053199
050532         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             05053299
050533                           PV-MSTR-FIRST-TO-OTBND-DAY             05053399
050534     END-IF.                                                      05053499
050535                                                                  05053599
050536     IF  PV-OTH-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                05053699
050537         PV-OTH-MSTR-FIRST-TO-TCLOS-CNT  >  0                     05053799
050538         DIVIDE PV-OTH-MSTR-FIRST-TO-TCLOS-MIN                    05053899
050539             BY PV-OTH-MSTR-FIRST-TO-TCLOS-CNT                    05053999
050540         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        05054099
050541                 ROUNDED                                          05054199
050542         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        05054299
050543             BY 1440                                              05054399
050544         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        05054499
050545                 ROUNDED                                          05054599
050546     ELSE                                                         05054699
050547         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             05054799
050548                           PV-MSTR-FIRST-TO-TCLOS-DAY             05054899
050549     END-IF.                                                      05054999
050550                                                                  05055099
050551     IF  PV-OTH-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 05055199
050552         PV-OTH-MSTR-FIRST-TO-SHIP-CNT  >  0                      05055299
050553         DIVIDE PV-OTH-MSTR-FIRST-TO-SHIP-MIN                     05055399
050554             BY PV-OTH-MSTR-FIRST-TO-SHIP-CNT                     05055499
050555         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         05055599
050556                 ROUNDED                                          05055699
050557         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         05055799
050558             BY 1440                                              05055899
050559         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         05055999
050560                 ROUNDED                                          05056099
050561     ELSE                                                         05056199
050562         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              05056299
050563                           PV-MSTR-FIRST-TO-SHIP-DAY              05056399
050564     END-IF.                                                      05056499
050565                                                                  05056599
050566     IF  PV-OTH-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 05056699
050567         PV-OTH-MSTR-LAST-TO-OTBND-CNT  >  0                      05056799
050568         DIVIDE PV-OTH-MSTR-LAST-TO-OTBND-MIN                     05056899
050569             BY PV-OTH-MSTR-LAST-TO-OTBND-CNT                     05056999
050570         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         05057099
050571                 ROUNDED                                          05057199
050572         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         05057299
050573             BY 1440                                              05057399
050574         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         05057499
050575                 ROUNDED                                          05057599
050576     ELSE                                                         05057699
050577         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              05057799
050578                           PV-MSTR-LAST-TO-OTBND-DAY              05057899
050579     END-IF.                                                      05057999
050580                                                                  05058099
050581     IF  PV-OTH-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 05058199
050582         PV-OTH-MSTR-LAST-TO-TCLOS-CNT  >  0                      05058299
050583         DIVIDE PV-OTH-MSTR-LAST-TO-TCLOS-MIN                     05058399
050584             BY PV-OTH-MSTR-LAST-TO-TCLOS-CNT                     05058499
050585         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         05058599
050586                 ROUNDED                                          05058699
050587         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         05058799
050588             BY 1440                                              05058899
050589         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         05058999
050590                 ROUNDED                                          05059099
050591     ELSE                                                         05059199
050592         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              05059299
050593                           PV-MSTR-LAST-TO-TCLOS-DAY              05059399
050594     END-IF.                                                      05059499
050595                                                                  05059599
050596     IF  PV-OTH-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  05059699
050597         PV-OTH-MSTR-LAST-TO-SHIP-CNT  >  0                       05059799
050598         DIVIDE PV-OTH-MSTR-LAST-TO-SHIP-MIN                      05059899
050599             BY PV-OTH-MSTR-LAST-TO-SHIP-CNT                      05059999
050600         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          05060099
050601                 ROUNDED                                          05060199
050602         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          05060299
050603             BY 1440                                              05060399
050604         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          05060499
050605                 ROUNDED                                          05060599
050606     ELSE                                                         05060699
050607         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               05060799
050608                           PV-MSTR-LAST-TO-SHIP-DAY               05060899
050609     END-IF.                                                      05060999
050610*                                                                 05061099
050611*** 8/19                                                          05061199
050612*                                                                 05061299
050613     IF  PV-OTH-TRIP-CARTONS            >  0  AND                 05061399
050614         PV-OTH-TRIP-SRC-CARTONS        >  0                      05061499
050615         DIVIDE  PV-OTH-TRIP-SRC-CARTONS                          05061599
050616             BY  PV-OTH-TRIP-CARTONS                              05061699
050617         GIVING  PV-TRIP-SRC-CRTN                                 05061799
050618                   ROUNDED                                        05061899
050619         MULTIPLY  PV-TRIP-SRC-CRTN                               05061999
050620               BY  100                                            05062099
050621           GIVING  PV-TRIP-SRC-CRTN-PCNT                          05062199
050622     ELSE                                                         05062299
050623         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  05062399
050624                           PV-TRIP-SRC-CRTN                       05062499
050625     END-IF.                                                      05062599
050626                                                                  05062699
050627                                                                  05062799
050628     MOVE ZEROES                TO DL1-DC-NBR                     05062899
050629     MOVE 'CORP OVERALL    '    TO DL1-DC-NAME                    05062999
050630     MOVE 'OTHER           '    TO DL1-SOURCE                     05063099
050631                                                                  05063199
050632     IF   SU134-EFC-STORES  AND                                   05063299
050633          PV-OTH-TRIP-SRC-CARTONS  =   0                          05063399
050634             CONTINUE                                             05063499
050635     ELSE                                                         05063599
050636     IF   SU134-LFC-STORES  AND                                   05063699
050637          PV-OTH-TRIP-SRC-CARTONS  =   0                          05063799
050638             CONTINUE                                             05063899
050639     ELSE                                                         05063999
050640         PERFORM 5030-PRINT-CORP-TOTALS                           05064099
050641     END-IF                                                       05064199
050642     END-IF.                                                      05064299
050643                                                                  05064399
050644                                                                  05064499
050645****************************************************************  05064599
050646* CALCULATE CORPORATE OVERALL TOTALS                           *  05064699
050647****************************************************************  05064799
050648 3090-CALC-OVR-AVERAGES.                                          05064899
050649                                                                  05064999
050650     MOVE  ZEROES        TO  PV-TRIP-OPEN-TO-CLOSE-AVG            05065099
050651                             PV-TRIP-CLOSE-TO-SHIP-AVG            05065199
050652                             PV-TRIP-OPEN-TO-SHIP-AVG             05065299
050653                             PV-ARRIVE-TO-PRC-AVG                 05065399
050654                             PV-ARRIVE-TO-P2L-PKD-AVG             05065499
050655                             PV-PRC-TO-P2L-PKD-AVG                05065599
050656                             PV-P2L-PKD-TO-CLOSE-AVG              05065699
050657                             PV-P2L-OPEN-TO-CLOSE-AVG             05065799
050658                             PV-P2L-OPEN-TO-OTBND-AVG             05065899
050659                             PV-P2L-CLOSE-TO-OTBND-AVG            05065999
050660                             PV-ARRIVE-TO-OTBND-AVG               05066099
050661                             PV-PRC-TO-OTBND-AVG                  05066199
050662                             PV-ARRIVE-TO-TCLOS-AVG               05066299
050663                             PV-ARRIVE-TO-SHIP-AVG                05066399
050664                             PV-P2L-OPEN-TO-TCLOS-AVG             05066499
050665                             PV-P2L-OPEN-TO-SHIP-AVG              05066599
050666                             PV-P2L-CLOSE-TO-TCLOS-AVG            05066699
050667                             PV-P2L-CLOSE-TO-SHIP-AVG             05066799
050668                             PV-ARRIVE-TO-MSTR-AVG                05066899
050669                             PV-PRC-TO-MSTR-AVG                   05066999
050670                             PV-MSTR-CRE-TO-OTBND-AVG             05067099
050671                             PV-MSTR-CRE-TO-TCLOS-AVG             05067199
050672                             PV-MSTR-CRE-TO-SHIP-AVG              05067299
050673                             PV-MSTR-FIRST-TO-OTBND-AVG           05067399
050674                             PV-MSTR-FIRST-TO-TCLOS-AVG           05067499
050675                             PV-MSTR-FIRST-TO-SHIP-AVG            05067599
050676                             PV-MSTR-LAST-TO-OTBND-AVG            05067699
050677                             PV-MSTR-LAST-TO-TCLOS-AVG            05067799
050678                             PV-MSTR-LAST-TO-SHIP-AVG             05067899
050679                             PV-ON-OTBND-TO-CLOS-AVG              05067999
050680                             PV-ON-OTBND-TO-SHIP-AVG              05068099
050681                             PV-TRIP-OPEN-TO-CLOSE-DAY            05068199
050682                             PV-TRIP-CLOSE-TO-SHIP-DAY            05068299
050683                             PV-TRIP-OPEN-TO-SHIP-DAY             05068399
050684                             PV-ARRIVE-TO-PRC-DAY                 05068499
050685                             PV-ARRIVE-TO-P2L-PKD-DAY             05068599
050686                             PV-PRC-TO-P2L-PKD-DAY                05068699
050687                             PV-P2L-PKD-TO-CLOSE-DAY              05068799
050688                             PV-P2L-OPEN-TO-CLOSE-DAY             05068899
050689                             PV-P2L-OPEN-TO-OTBND-DAY             05068999
050690                             PV-P2L-CLOSE-TO-OTBND-DAY            05069099
050691                             PV-ARRIVE-TO-OTBND-DAY               05069199
050692                             PV-PRC-TO-OTBND-DAY                  05069299
050693                             PV-ARRIVE-TO-TCLOS-DAY               05069399
050694                             PV-ARRIVE-TO-SHIP-DAY                05069499
050695                             PV-P2L-OPEN-TO-TCLOS-DAY             05069599
050696                             PV-P2L-OPEN-TO-SHIP-DAY              05069699
050697                             PV-P2L-CLOSE-TO-TCLOS-DAY            05069799
050698                             PV-P2L-CLOSE-TO-SHIP-DAY             05069899
050699                             PV-ARRIVE-TO-MSTR-DAY                05069999
050700                             PV-PRC-TO-MSTR-DAY                   05070099
050701                             PV-MSTR-CRE-TO-OTBND-DAY             05070199
050702                             PV-MSTR-CRE-TO-TCLOS-DAY             05070299
050703                             PV-MSTR-CRE-TO-SHIP-DAY              05070399
050704                             PV-MSTR-FIRST-TO-OTBND-DAY           05070499
050705                             PV-MSTR-FIRST-TO-TCLOS-DAY           05070599
050706                             PV-MSTR-FIRST-TO-SHIP-DAY            05070699
050707                             PV-MSTR-LAST-TO-OTBND-DAY            05070799
050708                             PV-MSTR-LAST-TO-TCLOS-DAY            05070899
050709                             PV-MSTR-LAST-TO-SHIP-DAY             05070999
050710                             PV-ON-OTBND-TO-CLOS-DAY              05071099
050711                             PV-ON-OTBND-TO-SHIP-DAY.             05071199
050712                                                                  05071299
050713     IF  PV-OVR-TRIP-OPEN-TO-CLOSE-MIN  >  0  AND                 05071399
050714         PV-OVR-TRIP-OPEN-TO-CLOSE-CNT  >  0                      05071499
050715         DIVIDE  PV-OVR-TRIP-OPEN-TO-CLOSE-MIN                    05071599
050716             BY  PV-OVR-TRIP-OPEN-TO-CLOSE-CNT                    05071699
050717         GIVING  PV-TRIP-OPEN-TO-CLOSE-AVG                        05071799
050718                 ROUNDED                                          05071899
050719         DIVIDE  PV-TRIP-OPEN-TO-CLOSE-AVG                        05071999
050720             BY  1440                                             05072099
050721         GIVING  PV-TRIP-OPEN-TO-CLOSE-DAY                        05072199
050722                 ROUNDED                                          05072299
050723     ELSE                                                         05072399
050724         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-CLOSE-AVG              05072499
050725                           PV-TRIP-OPEN-TO-CLOSE-DAY              05072599
050726     END-IF.                                                      05072699
050727                                                                  05072799
050728     IF  PV-OVR-TRIP-CLOSE-TO-SHIP-MIN  >  0  AND                 05072899
050729         PV-OVR-TRIP-CLOSE-TO-SHIP-CNT  >  0                      05072999
050730         DIVIDE  PV-OVR-TRIP-CLOSE-TO-SHIP-MIN                    05073099
050731             BY  PV-OVR-TRIP-CLOSE-TO-SHIP-CNT                    05073199
050732         GIVING  PV-TRIP-CLOSE-TO-SHIP-AVG                        05073299
050733                 ROUNDED                                          05073399
050734         DIVIDE  PV-TRIP-CLOSE-TO-SHIP-AVG                        05073499
050735             BY  1440                                             05073599
050736         GIVING  PV-TRIP-CLOSE-TO-SHIP-DAY                        05073699
050737                 ROUNDED                                          05073799
050738     ELSE                                                         05073899
050739         MOVE  ZEROES  TO  PV-TRIP-CLOSE-TO-SHIP-AVG              05073999
050740                           PV-TRIP-CLOSE-TO-SHIP-DAY              05074099
050741     END-IF.                                                      05074199
050742                                                                  05074299
050743     IF  PV-OVR-TRIP-OPEN-TO-SHIP-MIN  >  0  AND                  05074399
050744         PV-OVR-TRIP-OPEN-TO-SHIP-CNT  >  0                       05074499
050745         DIVIDE  PV-OVR-TRIP-OPEN-TO-SHIP-MIN                     05074599
050746             BY  PV-OVR-TRIP-OPEN-TO-SHIP-CNT                     05074699
050747         GIVING  PV-TRIP-OPEN-TO-SHIP-AVG                         05074799
050748                 ROUNDED                                          05074899
050749         DIVIDE  PV-TRIP-OPEN-TO-SHIP-AVG                         05074999
050750             BY  1440                                             05075099
050751         GIVING  PV-TRIP-OPEN-TO-SHIP-DAY                         05075199
050752                 ROUNDED                                          05075299
050753     ELSE                                                         05075399
050754         MOVE  ZEROES  TO  PV-TRIP-OPEN-TO-SHIP-AVG               05075499
050755                           PV-TRIP-OPEN-TO-SHIP-DAY               05075599
050756     END-IF.                                                      05075699
050757                                                                  05075799
050758                                                                  05075899
050759     IF  PV-OVR-ARRIVE-TO-PRC-MIN  >  0  AND                      05075999
050760         PV-OVR-ARRIVE-TO-PRC-CNT  >  0                           05076099
050761         DIVIDE PV-OVR-ARRIVE-TO-PRC-MIN                          05076199
050762             BY PV-OVR-ARRIVE-TO-PRC-CNT                          05076299
050763         GIVING PV-ARRIVE-TO-PRC-AVG                              05076399
050764                 ROUNDED                                          05076499
050765         DIVIDE PV-ARRIVE-TO-PRC-AVG                              05076599
050766             BY 1440                                              05076699
050767         GIVING PV-ARRIVE-TO-PRC-DAY                              05076799
050768                 ROUNDED                                          05076899
050769     ELSE                                                         05076999
050770         MOVE  ZEROES  TO  PV-ARRIVE-TO-PRC-AVG                   05077099
050771                           PV-ARRIVE-TO-PRC-DAY                   05077199
050772     END-IF.                                                      05077299
050773                                                                  05077399
050774     IF  PV-OVR-ARRIVE-TO-P2L-PKD-MIN  >  0  AND                  05077499
050775         PV-OVR-ARRIVE-TO-P2L-PKD-CNT  >  0                       05077599
050776         DIVIDE PV-OVR-ARRIVE-TO-P2L-PKD-MIN                      05077699
050777             BY PV-OVR-ARRIVE-TO-P2L-PKD-CNT                      05077799
050778         GIVING PV-ARRIVE-TO-P2L-PKD-AVG                          05077899
050779                 ROUNDED                                          05077999
050780         DIVIDE PV-ARRIVE-TO-P2L-PKD-AVG                          05078099
050781             BY 1440                                              05078199
050782         GIVING PV-ARRIVE-TO-P2L-PKD-DAY                          05078299
050783                 ROUNDED                                          05078399
050784     ELSE                                                         05078499
050785         MOVE  ZEROES  TO  PV-ARRIVE-TO-P2L-PKD-AVG               05078599
050786                           PV-ARRIVE-TO-P2L-PKD-DAY               05078699
050787     END-IF.                                                      05078799
050788                                                                  05078899
050789                                                                  05078999
050790     IF  PV-OVR-PRC-TO-P2L-PKD-MIN  >  0  AND                     05079099
050791         PV-OVR-PRC-TO-P2L-PKD-CNT  >  0                          05079199
050792         DIVIDE PV-OVR-PRC-TO-P2L-PKD-MIN                         05079299
050793             BY PV-OVR-PRC-TO-P2L-PKD-CNT                         05079399
050794         GIVING PV-PRC-TO-P2L-PKD-AVG                             05079499
050795                 ROUNDED                                          05079599
050796         DIVIDE PV-PRC-TO-P2L-PKD-AVG                             05079699
050797             BY 1440                                              05079799
050798         GIVING PV-PRC-TO-P2L-PKD-DAY                             05079899
050799                 ROUNDED                                          05079999
050800     ELSE                                                         05080099
050801         MOVE  ZEROES  TO  PV-PRC-TO-P2L-PKD-AVG                  05080199
050802                           PV-PRC-TO-P2L-PKD-DAY                  05080299
050803     END-IF.                                                      05080399
050804                                                                  05080499
050805     IF  PV-OVR-P2L-PKD-TO-CLOSE-MIN  >  0  AND                   05080599
050806         PV-OVR-P2L-PKD-TO-CLOSE-CNT  >  0                        05080699
050807         DIVIDE PV-OVR-P2L-PKD-TO-CLOSE-MIN                       05080799
050808             BY PV-OVR-P2L-PKD-TO-CLOSE-CNT                       05080899
050809         GIVING PV-P2L-PKD-TO-CLOSE-AVG                           05080999
050810                 ROUNDED                                          05081099
050811         DIVIDE PV-P2L-PKD-TO-CLOSE-AVG                           05081199
050812             BY 1440                                              05081299
050813         GIVING PV-P2L-PKD-TO-CLOSE-DAY                           05081399
050814                 ROUNDED                                          05081499
050815     ELSE                                                         05081599
050816         MOVE  ZEROES  TO  PV-P2L-PKD-TO-CLOSE-AVG                05081699
050817                           PV-P2L-PKD-TO-CLOSE-DAY                05081799
050818     END-IF.                                                      05081899
050819                                                                  05081999
050820     IF  PV-OVR-P2L-OPEN-TO-CLOSE-MIN  >  0  AND                  05082099
050821         PV-OVR-P2L-OPEN-TO-CLOSE-CNT  >  0                       05082199
050822         DIVIDE PV-OVR-P2L-OPEN-TO-CLOSE-MIN                      05082299
050823             BY PV-OVR-P2L-OPEN-TO-CLOSE-CNT                      05082399
050824         GIVING PV-P2L-OPEN-TO-CLOSE-AVG                          05082499
050825                 ROUNDED                                          05082599
050826         DIVIDE PV-P2L-OPEN-TO-CLOSE-AVG                          05082699
050827             BY 1440                                              05082799
050828         GIVING PV-P2L-OPEN-TO-CLOSE-DAY                          05082899
050829                 ROUNDED                                          05082999
050830     ELSE                                                         05083099
050831         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-CLOSE-AVG               05083199
050832                           PV-P2L-OPEN-TO-CLOSE-DAY               05083299
050833     END-IF.                                                      05083399
050834                                                                  05083499
050835     IF  PV-OVR-P2L-OPEN-TO-OTBND-MIN  >  0  AND                  05083599
050836         PV-OVR-P2L-OPEN-TO-OTBND-CNT  >  0                       05083699
050837         DIVIDE PV-OVR-P2L-OPEN-TO-OTBND-MIN                      05083799
050838             BY PV-OVR-P2L-OPEN-TO-OTBND-CNT                      05083899
050839         GIVING PV-P2L-OPEN-TO-OTBND-AVG                          05083999
050840                 ROUNDED                                          05084099
050841         DIVIDE PV-P2L-OPEN-TO-OTBND-AVG                          05084199
050842             BY 1440                                              05084299
050843         GIVING PV-P2L-OPEN-TO-OTBND-DAY                          05084399
050844                 ROUNDED                                          05084499
050845     ELSE                                                         05084599
050846         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-OTBND-AVG               05084699
050847                           PV-P2L-OPEN-TO-OTBND-DAY               05084799
050848     END-IF.                                                      05084899
050849                                                                  05084999
050850     IF  PV-OVR-P2L-CLOSE-TO-OTBND-MIN  >  0  AND                 05085099
050851         PV-OVR-P2L-CLOSE-TO-OTBND-CNT  >  0                      05085199
050852         DIVIDE PV-OVR-P2L-CLOSE-TO-OTBND-MIN                     05085299
050853             BY PV-OVR-P2L-CLOSE-TO-OTBND-CNT                     05085399
050854         GIVING PV-P2L-CLOSE-TO-OTBND-AVG                         05085499
050855                 ROUNDED                                          05085599
050856         DIVIDE PV-P2L-CLOSE-TO-OTBND-AVG                         05085699
050857             BY 1440                                              05085799
050858         GIVING PV-P2L-CLOSE-TO-OTBND-DAY                         05085899
050859                 ROUNDED                                          05085999
050860     ELSE                                                         05086099
050861         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-OTBND-AVG              05086199
050862                           PV-P2L-CLOSE-TO-OTBND-DAY              05086299
050863     END-IF.                                                      05086399
050864                                                                  05086499
050865     IF  PV-OVR-ARRIVE-TO-OTBND-MIN  >  0  AND                    05086599
050866         PV-OVR-ARRIVE-TO-OTBND-CNT  >  0                         05086699
050867         DIVIDE PV-OVR-ARRIVE-TO-OTBND-MIN                        05086799
050868             BY PV-OVR-ARRIVE-TO-OTBND-CNT                        05086899
050869         GIVING PV-ARRIVE-TO-OTBND-AVG                            05086999
050870                 ROUNDED                                          05087099
050871         DIVIDE PV-ARRIVE-TO-OTBND-AVG                            05087199
050872             BY 1440                                              05087299
050873         GIVING PV-ARRIVE-TO-OTBND-DAY                            05087399
050874                 ROUNDED                                          05087499
050875     ELSE                                                         05087599
050876         MOVE  ZEROES  TO  PV-ARRIVE-TO-OTBND-AVG                 05087699
050877                           PV-ARRIVE-TO-OTBND-DAY                 05087799
050878     END-IF.                                                      05087899
050879                                                                  05087999
050880     IF  PV-OVR-PRC-TO-OTBND-MIN  >  0  AND                       05088099
050881         PV-OVR-PRC-TO-OTBND-CNT  >  0                            05088199
050882         DIVIDE PV-OVR-PRC-TO-OTBND-MIN                           05088299
050883             BY PV-OVR-PRC-TO-OTBND-CNT                           05088399
050884         GIVING PV-PRC-TO-OTBND-AVG                               05088499
050885                 ROUNDED                                          05088599
050886         DIVIDE PV-PRC-TO-OTBND-AVG                               05088699
050887             BY 1440                                              05088799
050888         GIVING PV-PRC-TO-OTBND-DAY                               05088899
050889                 ROUNDED                                          05088999
050890     ELSE                                                         05089099
050891         MOVE  ZEROES  TO  PV-PRC-TO-OTBND-AVG                    05089199
050892                           PV-PRC-TO-OTBND-DAY                    05089299
050893     END-IF.                                                      05089399
050894                                                                  05089499
050895     IF  PV-OVR-ARRIVE-TO-TCLOS-MIN  >  0  AND                    05089599
050896         PV-OVR-ARRIVE-TO-TCLOS-CNT  >  0                         05089699
050897         DIVIDE PV-OVR-ARRIVE-TO-TCLOS-MIN                        05089799
050898             BY PV-OVR-ARRIVE-TO-TCLOS-CNT                        05089899
050899         GIVING PV-ARRIVE-TO-TCLOS-AVG                            05089999
050900                 ROUNDED                                          05090099
050901         DIVIDE PV-ARRIVE-TO-TCLOS-AVG                            05090199
050902             BY 1440                                              05090299
050903         GIVING PV-ARRIVE-TO-TCLOS-DAY                            05090399
050904                 ROUNDED                                          05090499
050905     ELSE                                                         05090599
050906         MOVE  ZEROES  TO  PV-ARRIVE-TO-TCLOS-AVG                 05090699
050907                           PV-ARRIVE-TO-TCLOS-DAY                 05090799
050908     END-IF.                                                      05090899
050909                                                                  05090999
050910     IF  PV-OVR-ARRIVE-TO-SHIP-MIN  >  0  AND                     05091099
050911         PV-OVR-ARRIVE-TO-SHIP-CNT  >  0                          05091199
050912         DIVIDE PV-OVR-ARRIVE-TO-SHIP-MIN                         05091299
050913             BY PV-OVR-ARRIVE-TO-SHIP-CNT                         05091399
050914         GIVING PV-ARRIVE-TO-SHIP-AVG                             05091499
050915                 ROUNDED                                          05091599
050916         DIVIDE PV-ARRIVE-TO-SHIP-AVG                             05091699
050917             BY 1440                                              05091799
050918         GIVING PV-ARRIVE-TO-SHIP-DAY                             05091899
050919                 ROUNDED                                          05091999
050920     ELSE                                                         05092099
050921         MOVE  ZEROES  TO  PV-ARRIVE-TO-SHIP-AVG                  05092199
050922                           PV-ARRIVE-TO-SHIP-DAY                  05092299
050923     END-IF.                                                      05092399
050924                                                                  05092499
050925     IF  PV-OVR-P2L-OPEN-TO-TCLOS-MIN  >  0  AND                  05092599
050926         PV-OVR-P2L-OPEN-TO-TCLOS-CNT  >  0                       05092699
050927         DIVIDE PV-OVR-P2L-OPEN-TO-TCLOS-MIN                      05092799
050928             BY PV-OVR-P2L-OPEN-TO-TCLOS-CNT                      05092899
050929         GIVING PV-P2L-OPEN-TO-TCLOS-AVG                          05092999
050930                 ROUNDED                                          05093099
050931         DIVIDE PV-P2L-OPEN-TO-TCLOS-AVG                          05093199
050932             BY 1440                                              05093299
050933         GIVING PV-P2L-OPEN-TO-TCLOS-DAY                          05093399
050934                 ROUNDED                                          05093499
050935     ELSE                                                         05093599
050936         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-TCLOS-AVG               05093699
050937                           PV-P2L-OPEN-TO-TCLOS-DAY               05093799
050938     END-IF.                                                      05093899
050939                                                                  05093999
050940     IF  PV-OVR-P2L-OPEN-TO-SHIP-MIN  >  0  AND                   05094099
050941         PV-OVR-P2L-OPEN-TO-SHIP-CNT  >  0                        05094199
050942         DIVIDE PV-OVR-P2L-OPEN-TO-SHIP-MIN                       05094299
050943             BY PV-OVR-P2L-OPEN-TO-SHIP-CNT                       05094399
050944         GIVING PV-P2L-OPEN-TO-SHIP-AVG                           05094499
050945                 ROUNDED                                          05094599
050946         DIVIDE PV-P2L-OPEN-TO-SHIP-AVG                           05094699
050947             BY 1440                                              05094799
050948         GIVING PV-P2L-OPEN-TO-SHIP-DAY                           05094899
050949                 ROUNDED                                          05094999
050950     ELSE                                                         05095099
050951         MOVE  ZEROES  TO  PV-P2L-OPEN-TO-SHIP-AVG                05095199
050952                           PV-P2L-OPEN-TO-SHIP-DAY                05095299
050953     END-IF.                                                      05095399
050954                                                                  05095499
050955     IF  PV-OVR-P2L-CLOSE-TO-TCLOS-MIN  >  0  AND                 05095599
050956         PV-OVR-P2L-CLOSE-TO-TCLOS-CNT  >  0                      05095699
050957         DIVIDE PV-OVR-P2L-CLOSE-TO-TCLOS-MIN                     05095799
050958             BY PV-OVR-P2L-CLOSE-TO-TCLOS-CNT                     05095899
050959         GIVING PV-P2L-CLOSE-TO-TCLOS-AVG                         05095999
050960                 ROUNDED                                          05096099
050961         DIVIDE PV-P2L-CLOSE-TO-TCLOS-AVG                         05096199
050962             BY 1440                                              05096299
050963         GIVING PV-P2L-CLOSE-TO-TCLOS-DAY                         05096399
050964                 ROUNDED                                          05096499
050965     ELSE                                                         05096599
050966         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-TCLOS-AVG              05096699
050967                           PV-P2L-CLOSE-TO-TCLOS-DAY              05096799
050968     END-IF.                                                      05096899
050969                                                                  05096999
050970     IF  PV-OVR-P2L-CLOSE-TO-SHIP-MIN  >  0  AND                  05097099
050971         PV-OVR-P2L-CLOSE-TO-SHIP-CNT  >  0                       05097199
050972         DIVIDE PV-OVR-P2L-CLOSE-TO-SHIP-MIN                      05097299
050973             BY PV-OVR-P2L-CLOSE-TO-SHIP-CNT                      05097399
050974         GIVING PV-P2L-CLOSE-TO-SHIP-AVG                          05097499
050975                 ROUNDED                                          05097599
050976         DIVIDE PV-P2L-CLOSE-TO-SHIP-AVG                          05097699
050977             BY 1440                                              05097799
050978         GIVING PV-P2L-CLOSE-TO-SHIP-DAY                          05097899
050979                 ROUNDED                                          05097999
050980     ELSE                                                         05098099
050981         MOVE  ZEROES  TO  PV-P2L-CLOSE-TO-SHIP-AVG               05098199
050982                           PV-P2L-CLOSE-TO-SHIP-DAY               05098299
050983     END-IF.                                                      05098399
050984                                                                  05098499
050985     IF  PV-OVR-ARRIVE-TO-MSTR-MIN  >  0  AND                     05098599
050986         PV-OVR-ARRIVE-TO-MSTR-CNT  >  0                          05098699
050987         DIVIDE PV-OVR-ARRIVE-TO-MSTR-MIN                         05098799
050988             BY PV-OVR-ARRIVE-TO-MSTR-CNT                         05098899
050989         GIVING PV-ARRIVE-TO-MSTR-AVG                             05098999
050990                 ROUNDED                                          05099099
050991         DIVIDE PV-ARRIVE-TO-MSTR-AVG                             05099199
050992             BY 1440                                              05099299
050993         GIVING PV-ARRIVE-TO-MSTR-DAY                             05099399
050994                 ROUNDED                                          05099499
050995     ELSE                                                         05099599
050996         MOVE  ZEROES  TO  PV-ARRIVE-TO-MSTR-AVG                  05099699
050997                           PV-ARRIVE-TO-MSTR-DAY                  05099799
050998     END-IF.                                                      05099899
050999                                                                  05099999
051000     IF  PV-OVR-PRC-TO-MSTR-MIN  >  0  AND                        05100099
051001         PV-OVR-PRC-TO-MSTR-CNT  >  0                             05100199
051002         DIVIDE PV-OVR-PRC-TO-MSTR-MIN                            05100299
051003             BY PV-OVR-PRC-TO-MSTR-CNT                            05100399
051004         GIVING PV-PRC-TO-MSTR-AVG                                05100499
051005                 ROUNDED                                          05100599
051006         DIVIDE PV-PRC-TO-MSTR-AVG                                05100699
051007             BY 1440                                              05100799
051008         GIVING PV-PRC-TO-MSTR-DAY                                05100899
051009                 ROUNDED                                          05100999
051010     ELSE                                                         05101099
051011         MOVE  ZEROES  TO  PV-PRC-TO-MSTR-AVG                     05101199
051012                           PV-PRC-TO-MSTR-DAY                     05101299
051013     END-IF.                                                      05101399
051014                                                                  05101499
051015     IF  PV-OVR-ON-OTBND-TO-CLOS-MIN  >  0  AND                   05101599
051016         PV-OVR-ON-OTBND-TO-CLOS-CNT  >  0                        05101699
051017         DIVIDE PV-OVR-ON-OTBND-TO-CLOS-MIN                       05101799
051018             BY PV-OVR-ON-OTBND-TO-CLOS-CNT                       05101899
051019         GIVING PV-ON-OTBND-TO-CLOS-AVG                           05101999
051020                 ROUNDED                                          05102099
051021         DIVIDE PV-ON-OTBND-TO-CLOS-AVG                           05102199
051022             BY 1440                                              05102299
051023         GIVING PV-ON-OTBND-TO-CLOS-DAY                           05102399
051024                 ROUNDED                                          05102499
051025     ELSE                                                         05102599
051026         MOVE  ZEROES  TO  PV-ON-OTBND-TO-CLOS-AVG                05102699
051027                           PV-ON-OTBND-TO-CLOS-DAY                05102799
051028     END-IF.                                                      05102899
051029                                                                  05102999
051030     IF  PV-OVR-ON-OTBND-TO-SHIP-MIN  >  0  AND                   05103099
051031         PV-OVR-ON-OTBND-TO-SHIP-CNT  >  0                        05103199
051032         DIVIDE PV-OVR-ON-OTBND-TO-SHIP-MIN                       05103299
051033             BY PV-OVR-ON-OTBND-TO-SHIP-CNT                       05103399
051034         GIVING PV-ON-OTBND-TO-SHIP-AVG                           05103499
051035                 ROUNDED                                          05103599
051036         DIVIDE PV-ON-OTBND-TO-SHIP-AVG                           05103699
051037             BY 1440                                              05103799
051038         GIVING PV-ON-OTBND-TO-SHIP-DAY                           05103899
051039                 ROUNDED                                          05103999
051040     ELSE                                                         05104099
051041         MOVE  ZEROES  TO  PV-ON-OTBND-TO-SHIP-AVG                05104199
051042                           PV-ON-OTBND-TO-SHIP-DAY                05104299
051043     END-IF.                                                      05104399
051044                                                                  05104499
051045     IF  PV-OVR-MSTR-CRE-TO-OTBND-MIN  >  0  AND                  05104599
051046         PV-OVR-MSTR-CRE-TO-OTBND-CNT  >  0                       05104699
051047         DIVIDE PV-OVR-MSTR-CRE-TO-OTBND-MIN                      05104799
051048             BY PV-OVR-MSTR-CRE-TO-OTBND-CNT                      05104899
051049         GIVING PV-MSTR-CRE-TO-OTBND-AVG                          05104999
051050                 ROUNDED                                          05105099
051051         DIVIDE PV-MSTR-CRE-TO-OTBND-AVG                          05105199
051052             BY 1440                                              05105299
051053         GIVING PV-MSTR-CRE-TO-OTBND-DAY                          05105399
051054                 ROUNDED                                          05105499
051055     ELSE                                                         05105599
051056         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-OTBND-AVG               05105699
051057                           PV-MSTR-CRE-TO-OTBND-DAY               05105799
051058     END-IF.                                                      05105899
051059                                                                  05105999
051060     IF  PV-OVR-MSTR-CRE-TO-TCLOS-MIN  >  0  AND                  05106099
051061         PV-OVR-MSTR-CRE-TO-TCLOS-CNT  >  0                       05106199
051062         DIVIDE PV-OVR-MSTR-CRE-TO-TCLOS-MIN                      05106299
051063             BY PV-OVR-MSTR-CRE-TO-TCLOS-CNT                      05106399
051064         GIVING PV-MSTR-CRE-TO-TCLOS-AVG                          05106499
051065                 ROUNDED                                          05106599
051066         DIVIDE PV-MSTR-CRE-TO-TCLOS-AVG                          05106699
051067             BY 1440                                              05106799
051068         GIVING PV-MSTR-CRE-TO-TCLOS-DAY                          05106899
051069                 ROUNDED                                          05106999
051070     ELSE                                                         05107099
051071         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-TCLOS-AVG               05107199
051072                           PV-MSTR-CRE-TO-TCLOS-DAY               05107299
051073     END-IF.                                                      05107399
051074                                                                  05107499
051075     IF  PV-OVR-MSTR-CRE-TO-SHIP-MIN  >  0  AND                   05107599
051076         PV-OVR-MSTR-CRE-TO-SHIP-CNT  >  0                        05107699
051077         DIVIDE PV-OVR-MSTR-CRE-TO-SHIP-MIN                       05107799
051078             BY PV-OVR-MSTR-CRE-TO-SHIP-CNT                       05107899
051079         GIVING PV-MSTR-CRE-TO-SHIP-AVG                           05107999
051080                 ROUNDED                                          05108099
051081         DIVIDE PV-MSTR-CRE-TO-SHIP-AVG                           05108199
051082             BY 1440                                              05108299
051083         GIVING PV-MSTR-CRE-TO-SHIP-DAY                           05108399
051084                 ROUNDED                                          05108499
051085     ELSE                                                         05108599
051086         MOVE  ZEROES  TO  PV-MSTR-CRE-TO-SHIP-AVG                05108699
051087                           PV-MSTR-CRE-TO-SHIP-DAY                05108799
051088     END-IF.                                                      05108899
051089                                                                  05108999
051090     IF  PV-OVR-MSTR-FIRST-TO-OTBND-MIN  >  0  AND                05109099
051091         PV-OVR-MSTR-FIRST-TO-OTBND-CNT  >  0                     05109199
051092         DIVIDE PV-OVR-MSTR-FIRST-TO-OTBND-MIN                    05109299
051093             BY PV-OVR-MSTR-FIRST-TO-OTBND-CNT                    05109399
051094         GIVING PV-MSTR-FIRST-TO-OTBND-AVG                        05109499
051095                 ROUNDED                                          05109599
051096         DIVIDE PV-MSTR-FIRST-TO-OTBND-AVG                        05109699
051097             BY 1440                                              05109799
051098         GIVING PV-MSTR-FIRST-TO-OTBND-DAY                        05109899
051099                 ROUNDED                                          05109999
051100     ELSE                                                         05110099
051101         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-OTBND-AVG             05110199
051102                           PV-MSTR-FIRST-TO-OTBND-DAY             05110299
051103     END-IF.                                                      05110399
051104                                                                  05110499
051105     IF  PV-OVR-MSTR-FIRST-TO-TCLOS-MIN  >  0  AND                05110599
051106         PV-OVR-MSTR-FIRST-TO-TCLOS-CNT  >  0                     05110699
051107         DIVIDE PV-OVR-MSTR-FIRST-TO-TCLOS-MIN                    05110799
051108             BY PV-OVR-MSTR-FIRST-TO-TCLOS-CNT                    05110899
051109         GIVING PV-MSTR-FIRST-TO-TCLOS-AVG                        05110999
051110                 ROUNDED                                          05111099
051111         DIVIDE PV-MSTR-FIRST-TO-TCLOS-AVG                        05111199
051112             BY 1440                                              05111299
051113         GIVING PV-MSTR-FIRST-TO-TCLOS-DAY                        05111399
051114                 ROUNDED                                          05111499
051115     ELSE                                                         05111599
051116         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-TCLOS-AVG             05111699
051117                           PV-MSTR-FIRST-TO-TCLOS-DAY             05111799
051118     END-IF.                                                      05111899
051119                                                                  05111999
051120     IF  PV-OVR-MSTR-FIRST-TO-SHIP-MIN  >  0  AND                 05112099
051121         PV-OVR-MSTR-FIRST-TO-SHIP-CNT  >  0                      05112199
051122         DIVIDE PV-OVR-MSTR-FIRST-TO-SHIP-MIN                     05112299
051123             BY PV-OVR-MSTR-FIRST-TO-SHIP-CNT                     05112399
051124         GIVING PV-MSTR-FIRST-TO-SHIP-AVG                         05112499
051125                 ROUNDED                                          05112599
051126         DIVIDE PV-MSTR-FIRST-TO-SHIP-AVG                         05112699
051127             BY 1440                                              05112799
051128         GIVING PV-MSTR-FIRST-TO-SHIP-DAY                         05112899
051129                 ROUNDED                                          05112999
051130     ELSE                                                         05113099
051131         MOVE  ZEROES  TO  PV-MSTR-FIRST-TO-SHIP-AVG              05113199
051132                           PV-MSTR-FIRST-TO-SHIP-DAY              05113299
051133     END-IF.                                                      05113399
051134                                                                  05113499
051135     IF  PV-OVR-MSTR-LAST-TO-OTBND-MIN  >  0  AND                 05113599
051136         PV-OVR-MSTR-LAST-TO-OTBND-CNT  >  0                      05113699
051137         DIVIDE PV-OVR-MSTR-LAST-TO-OTBND-MIN                     05113799
051138             BY PV-OVR-MSTR-LAST-TO-OTBND-CNT                     05113899
051139         GIVING PV-MSTR-LAST-TO-OTBND-AVG                         05113999
051140                 ROUNDED                                          05114099
051141         DIVIDE PV-MSTR-LAST-TO-OTBND-AVG                         05114199
051142             BY 1440                                              05114299
051143         GIVING PV-MSTR-LAST-TO-OTBND-DAY                         05114399
051144                 ROUNDED                                          05114499
051145     ELSE                                                         05114599
051146         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-OTBND-AVG              05114699
051147                           PV-MSTR-LAST-TO-OTBND-DAY              05114799
051148     END-IF.                                                      05114899
051149                                                                  05114999
051150     IF  PV-OVR-MSTR-LAST-TO-TCLOS-MIN  >  0  AND                 05115099
051151         PV-OVR-MSTR-LAST-TO-TCLOS-CNT  >  0                      05115199
051152         DIVIDE PV-OVR-MSTR-LAST-TO-TCLOS-MIN                     05115299
051153             BY PV-OVR-MSTR-LAST-TO-TCLOS-CNT                     05115399
051154         GIVING PV-MSTR-LAST-TO-TCLOS-AVG                         05115499
051155                 ROUNDED                                          05115599
051156         DIVIDE PV-MSTR-LAST-TO-TCLOS-AVG                         05115699
051157             BY 1440                                              05115799
051158         GIVING PV-MSTR-LAST-TO-TCLOS-DAY                         05115899
051159                 ROUNDED                                          05115999
051160     ELSE                                                         05116099
051161         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-TCLOS-AVG              05116199
051162                           PV-MSTR-LAST-TO-TCLOS-DAY              05116299
051163     END-IF.                                                      05116399
051164                                                                  05116499
051165     IF  PV-OVR-MSTR-LAST-TO-SHIP-MIN  >  0  AND                  05116599
051166         PV-OVR-MSTR-LAST-TO-SHIP-CNT  >  0                       05116699
051167         DIVIDE PV-OVR-MSTR-LAST-TO-SHIP-MIN                      05116799
051168             BY PV-OVR-MSTR-LAST-TO-SHIP-CNT                      05116899
051169         GIVING PV-MSTR-LAST-TO-SHIP-AVG                          05116999
051170                 ROUNDED                                          05117099
051171         DIVIDE PV-MSTR-LAST-TO-SHIP-AVG                          05117199
051172             BY 1440                                              05117299
051173         GIVING PV-MSTR-LAST-TO-SHIP-DAY                          05117399
051174                 ROUNDED                                          05117499
051175     ELSE                                                         05117599
051176         MOVE  ZEROES  TO  PV-MSTR-LAST-TO-SHIP-AVG               05117699
051177                           PV-MSTR-LAST-TO-SHIP-DAY               05117799
051178     END-IF.                                                      05117899
051179                                                                  05117999
051180*                                                                 05118099
051181*** 8/19                                                          05118199
051182*                                                                 05118299
051183     IF  PV-OVR-TRIP-CARTONS            >  0  AND                 05118399
051184         PV-OVR-TRIP-SRC-CARTONS        >  0                      05118499
051185         DIVIDE  PV-OVR-TRIP-CARTONS                              05118599
051186             BY  PV-OVR-TRIP-CARTONS                              05118699
051187         GIVING  PV-TRIP-SRC-CRTN                                 05118799
051188                   ROUNDED                                        05118899
051189         MULTIPLY  PV-TRIP-SRC-CRTN                               05118999
051190               BY  100                                            05119099
051191           GIVING  PV-TRIP-SRC-CRTN-PCNT                          05119199
051192     ELSE                                                         05119299
051193         MOVE  ZEROES  TO  PV-TRIP-SRC-CRTN-PCNT                  05119399
051194                           PV-TRIP-SRC-CRTN                       05119499
051195     END-IF.                                                      05119599
051196                                                                  05119699
051197     MOVE ZEROES                TO DL2-DC-NBR                     05119799
051198                                   DL6-DC-NBR                     05119899
051199     MOVE 'CORP OVERALL    '    TO DL2-DC-NAME                    05119999
051200                                   DL6-DC-NAME                    05120099
051201     MOVE 'CORP OVERALL    '    TO DL2-SOURCE                     05120199
051202     MOVE 'TOTAL TRIPS     '    TO DL6-SOURCE                     05120299
051203     PERFORM 5040-PRINT-CORP-TOTALS.                              05120399
051204     PERFORM 5080-PRINT-CORP-TOTALS.                              05120499
051205                                                                  05120599
051206                                                                  05120699
051207****************************************************************  05120799
051208* MOVE THE AREA TOTALS TO OUTPUT FILE   COMMA DELIMITED        *  05120899
051209****************************************************************  05120999
051210 4000-WRITE-SUM-RECORD.                                           05121099
051211                                                                  05121199
051212     MOVE SPACES  TO  SU130-EXTRACT-RECORD.                       05121299
051213*                                                                 05121399
051214     MOVE PV-PREV-OPER   TO SU130-OPER-UNT-ID.                    05121499
051215     MOVE PV-PREV-SOURCE TO SU130-SML-SRC-CDE.                    05121599
051216     MOVE PV-PREV-SEQ    TO SU130-REPORT-SORT-SEQ.                05121699
051217                                                                  05121799
051218     MOVE PV-SRC-INPUT-RECORD-COUNT                               05121899
051219               TO  SU130-INPUT-RECORD-COUNT.                      05121999
051220     MOVE PV-SRC-TRIP-OPEN-TO-CLOSE-MIN                           05122099
051221               TO  SU130-TRIP-OPEN-TO-CLOSE-MIN.                  05122199
051222     MOVE PV-SRC-TRIP-CLOSE-TO-SHIP-MIN                           05122299
051223               TO  SU130-TRIP-CLOSE-TO-SHIP-MIN.                  05122399
051224     MOVE PV-SRC-TRIP-OPEN-TO-SHIP-MIN                            05122499
051225               TO  SU130-TRIP-OPEN-TO-SHIP-MIN.                   05122599
051226     MOVE PV-SRC-ARRIVE-TO-PRC-MIN                                05122699
051227               TO  SU130-ARRIVE-TO-PRC-MIN.                       05122799
051228     MOVE PV-SRC-ARRIVE-TO-P2L-PKD-MIN                            05122899
051229               TO  SU130-ARRIVE-TO-P2L-PKD-MIN.                   05122999
051230     MOVE PV-SRC-PRC-TO-P2L-PKD-MIN                               05123099
051231               TO  SU130-PRC-TO-P2L-PKD-MIN.                      05123199
051232     MOVE PV-SRC-P2L-PKD-TO-CLOSE-MIN                             05123299
051233               TO  SU130-P2L-PKD-TO-CLOSE-MIN.                    05123399
051234     MOVE PV-SRC-P2L-OPEN-TO-CLOSE-MIN                            05123499
051235               TO  SU130-P2L-OPEN-TO-CLOSE-MIN.                   05123599
051236     MOVE PV-SRC-P2L-OPEN-TO-OTBND-MIN                            05123699
051237               TO  SU130-P2L-OPEN-TO-OTBND-MIN.                   05123799
051238     MOVE PV-SRC-P2L-CLOSE-TO-OTBND-MIN                           05123899
051239               TO  SU130-P2L-CLOSE-TO-OTBND-MIN.                  05123999
051240     MOVE PV-SRC-ARRIVE-TO-OTBND-MIN                              05124099
051241               TO  SU130-ARRIVE-TO-OTBND-MIN.                     05124199
051242     MOVE PV-SRC-PRC-TO-OTBND-MIN                                 05124299
051243               TO  SU130-PRC-TO-OTBND-MIN.                        05124399
051244     MOVE PV-SRC-ARRIVE-TO-TCLOS-MIN                              05124499
051245               TO  SU130-ARRIVE-TO-TCLOS-MIN.                     05124599
051246     MOVE PV-SRC-ARRIVE-TO-SHIP-MIN                               05124699
051247               TO  SU130-ARRIVE-TO-SHIP-MIN.                      05124799
051248     MOVE PV-SRC-P2L-OPEN-TO-TCLOS-MIN                            05124899
051249               TO  SU130-P2L-OPEN-TO-TCLOS-MIN.                   05124999
051250     MOVE PV-SRC-P2L-OPEN-TO-SHIP-MIN                             05125099
051251               TO  SU130-P2L-OPEN-TO-SHIP-MIN.                    05125199
051252     MOVE PV-SRC-P2L-CLOSE-TO-TCLOS-MIN                           05125299
051253               TO  SU130-P2L-CLOSE-TO-TCLOS-MIN.                  05125399
051254     MOVE PV-SRC-P2L-CLOSE-TO-SHIP-MIN                            05125499
051255               TO  SU130-P2L-CLOSE-TO-SHIP-MIN.                   05125599
051256     MOVE PV-SRC-ARRIVE-TO-MSTR-MIN                               05125699
051257               TO  SU130-ARRIVE-TO-MSTR-MIN.                      05125799
051258     MOVE PV-SRC-PRC-TO-MSTR-MIN                                  05125899
051259               TO  SU130-PRC-TO-MSTR-MIN.                         05125999
051260     MOVE PV-SRC-MSTR-CRE-TO-OTBND-MIN                            05126099
051261               TO  SU130-MSTR-CRE-TO-OTBND-MIN.                   05126199
051262     MOVE PV-SRC-MSTR-CRE-TO-TCLOS-MIN                            05126299
051263               TO  SU130-MSTR-CRE-TO-TCLOS-MIN.                   05126399
051264     MOVE PV-SRC-MSTR-CRE-TO-SHIP-MIN                             05126499
051265               TO  SU130-MSTR-CRE-TO-SHIP-MIN.                    05126599
051266     MOVE PV-SRC-MSTR-FIRST-TO-OTBND-MIN                          05126699
051267               TO  SU130-MSTR-FIRST-TO-OTBND-MIN.                 05126799
051268     MOVE PV-SRC-MSTR-FIRST-TO-TCLOS-MIN                          05126899
051269               TO  SU130-MSTR-FIRST-TO-TCLOS-MIN.                 05126999
051270     MOVE PV-SRC-MSTR-FIRST-TO-SHIP-MIN                           05127099
051271               TO  SU130-MSTR-FIRST-TO-SHIP-MIN.                  05127199
051272     MOVE PV-SRC-MSTR-LAST-TO-OTBND-MIN                           05127299
051273               TO  SU130-MSTR-LAST-TO-OTBND-MIN.                  05127399
051274     MOVE PV-SRC-MSTR-LAST-TO-TCLOS-MIN                           05127499
051275               TO  SU130-MSTR-LAST-TO-TCLOS-MIN.                  05127599
051276     MOVE PV-SRC-MSTR-LAST-TO-SHIP-MIN                            05127699
051277               TO  SU130-MSTR-LAST-TO-SHIP-MIN.                   05127799
051278     MOVE PV-SRC-ON-OTBND-TO-CLOS-MIN                             05127899
051279               TO  SU130-ON-OTBND-TO-CLOS-MIN.                    05127999
051280     MOVE PV-SRC-ON-OTBND-TO-SHIP-MIN                             05128099
051281               TO  SU130-ON-OTBND-TO-SHIP-MIN.                    05128199
051282                                                                  05128299
051283     MOVE PV-SRC-ARRIVE-TO-PRC-CNT                                05128399
051284               TO  SU130-ARRIVE-TO-PRC-CNT.                       05128499
051285     MOVE PV-SRC-ARRIVE-TO-P2L-PKD-CNT                            05128599
051286               TO  SU130-ARRIVE-TO-P2L-PKD-CNT.                   05128699
051287     MOVE PV-SRC-PRC-TO-P2L-PKD-CNT                               05128799
051288               TO  SU130-PRC-TO-P2L-PKD-CNT.                      05128899
051289     MOVE PV-SRC-P2L-PKD-TO-CLOSE-CNT                             05128999
051290               TO  SU130-P2L-PKD-TO-CLOSE-CNT.                    05129099
051291     MOVE PV-SRC-P2L-OPEN-TO-CLOSE-CNT                            05129199
051292               TO  SU130-P2L-OPEN-TO-CLOSE-CNT.                   05129299
051293     MOVE PV-SRC-P2L-OPEN-TO-OTBND-CNT                            05129399
051294               TO  SU130-P2L-OPEN-TO-OTBND-CNT.                   05129499
051295     MOVE PV-SRC-P2L-CLOSE-TO-OTBND-CNT                           05129599
051296               TO  SU130-P2L-CLOSE-TO-OTBND-CNT.                  05129699
051297     MOVE PV-SRC-ARRIVE-TO-OTBND-CNT                              05129799
051298               TO  SU130-ARRIVE-TO-OTBND-CNT.                     05129899
051299     MOVE PV-SRC-PRC-TO-OTBND-CNT                                 05129999
051300               TO  SU130-PRC-TO-OTBND-CNT.                        05130099
051301     MOVE PV-SRC-ARRIVE-TO-TCLOS-CNT                              05130199
051302               TO  SU130-ARRIVE-TO-TCLOS-CNT.                     05130299
051303     MOVE PV-SRC-ARRIVE-TO-SHIP-CNT                               05130399
051304               TO  SU130-ARRIVE-TO-SHIP-CNT.                      05130499
051305     MOVE PV-SRC-P2L-OPEN-TO-TCLOS-CNT                            05130599
051306               TO  SU130-P2L-OPEN-TO-TCLOS-CNT.                   05130699
051307     MOVE PV-SRC-P2L-OPEN-TO-SHIP-CNT                             05130799
051308               TO  SU130-P2L-OPEN-TO-SHIP-CNT.                    05130899
051309     MOVE PV-SRC-P2L-CLOSE-TO-TCLOS-CNT                           05130999
051310               TO  SU130-P2L-CLOSE-TO-TCLOS-CNT.                  05131099
051311     MOVE PV-SRC-P2L-CLOSE-TO-SHIP-CNT                            05131199
051312               TO  SU130-P2L-CLOSE-TO-SHIP-CNT.                   05131299
051313     MOVE PV-SRC-ARRIVE-TO-MSTR-CNT                               05131399
051314               TO  SU130-ARRIVE-TO-MSTR-CNT.                      05131499
051315     MOVE PV-SRC-PRC-TO-MSTR-CNT                                  05131599
051316               TO  SU130-PRC-TO-MSTR-CNT.                         05131699
051317     MOVE PV-SRC-MSTR-CRE-TO-OTBND-CNT                            05131799
051318               TO  SU130-MSTR-CRE-TO-OTBND-CNT.                   05131899
051319     MOVE PV-SRC-MSTR-CRE-TO-TCLOS-CNT                            05131999
051320               TO  SU130-MSTR-CRE-TO-TCLOS-CNT.                   05132099
051321     MOVE PV-SRC-MSTR-CRE-TO-SHIP-CNT                             05132199
051322               TO  SU130-MSTR-CRE-TO-SHIP-CNT.                    05132299
051323     MOVE PV-SRC-MSTR-FIRST-TO-OTBND-CNT                          05132399
051324               TO  SU130-MSTR-FIRST-TO-OTBND-CNT.                 05132499
051325     MOVE PV-SRC-MSTR-FIRST-TO-TCLOS-CNT                          05132599
051326               TO  SU130-MSTR-FIRST-TO-TCLOS-CNT.                 05132699
051327     MOVE PV-SRC-MSTR-FIRST-TO-SHIP-CNT                           05132799
051328               TO  SU130-MSTR-FIRST-TO-SHIP-CNT.                  05132899
051329     MOVE PV-SRC-MSTR-LAST-TO-OTBND-CNT                           05132999
051330               TO  SU130-MSTR-LAST-TO-OTBND-CNT.                  05133099
051331     MOVE PV-SRC-MSTR-LAST-TO-TCLOS-CNT                           05133199
051332               TO  SU130-MSTR-LAST-TO-TCLOS-CNT.                  05133299
051333     MOVE PV-SRC-MSTR-LAST-TO-SHIP-CNT                            05133399
051334               TO  SU130-MSTR-LAST-TO-SHIP-CNT.                   05133499
051335     MOVE PV-SRC-ON-OTBND-TO-CLOS-CNT                             05133599
051336               TO  SU130-ON-OTBND-TO-CLOS-CNT.                    05133699
051337     MOVE PV-SRC-ON-OTBND-TO-SHIP-CNT                             05133799
051338               TO  SU130-ON-OTBND-TO-SHIP-CNT.                    05133899
051339                                                                  05133999
051340     MOVE ','  TO  SU130-COMMA-001                                05134099
051341                   SU130-COMMA-002                                05134199
051342                   SU130-COMMA-003                                05134299
051343                   SU130-COMMA-004                                05134399
051344                   SU130-COMMA-005                                05134499
051345                   SU130-COMMA-006                                05134599
051346                   SU130-COMMA-007                                05134699
051347                   SU130-COMMA-008                                05134799
051348                   SU130-COMMA-009                                05134899
051349                   SU130-COMMA-010                                05134999
051350                   SU130-COMMA-011                                05135099
051351                   SU130-COMMA-012                                05135199
051352                   SU130-COMMA-013                                05135299
051353                   SU130-COMMA-014                                05135399
051354                   SU130-COMMA-015                                05135499
051355                   SU130-COMMA-016                                05135599
051356                   SU130-COMMA-017                                05135699
051357                   SU130-COMMA-018                                05135799
051358                   SU130-COMMA-019                                05135899
051359                   SU130-COMMA-020                                05135999
051360                   SU130-COMMA-021                                05136099
051361                   SU130-COMMA-022                                05136199
051362                   SU130-COMMA-023                                05136299
051363                   SU130-COMMA-024                                05136399
051364                   SU130-COMMA-025                                05136499
051365                   SU130-COMMA-026                                05136599
051366                   SU130-COMMA-027                                05136699
051367                   SU130-COMMA-028                                05136799
051368                   SU130-COMMA-029                                05136899
051369                   SU130-COMMA-030                                05136999
051370                   SU130-COMMA-031                                05137099
051371                   SU130-COMMA-032                                05137199
051372                   SU130-COMMA-033                                05137299
051373                   SU130-COMMA-034                                05137399
051374                   SU130-COMMA-035                                05137499
051375                   SU130-COMMA-036                                05137599
051376                   SU130-COMMA-037                                05137699
051377                   SU130-COMMA-038                                05137799
051378                   SU130-COMMA-039                                05137899
051379                   SU130-COMMA-030                                05137999
051380                   SU130-COMMA-041                                05138099
051381                   SU130-COMMA-042                                05138199
051382                   SU130-COMMA-043                                05138299
051383                   SU130-COMMA-044                                05138399
051384                   SU130-COMMA-045                                05138499
051385                   SU130-COMMA-046                                05138599
051386                   SU130-COMMA-047                                05138699
051387                   SU130-COMMA-048                                05138799
051388                   SU130-COMMA-049                                05138899
051389                   SU130-COMMA-050                                05138999
051390                   SU130-COMMA-051                                05139099
051391                   SU130-COMMA-052                                05139199
051392                   SU130-COMMA-053                                05139299
051393                   SU130-COMMA-054                                05139399
051394                   SU130-COMMA-055                                05139499
051395                   SU130-COMMA-056                                05139599
051396                   SU130-COMMA-057                                05139699
051397                   SU130-COMMA-058                                05139799
051398                   SU130-COMMA-059                                05139899
051399                   SU130-COMMA-060                                05139999
051400                   SU130-COMMA-061                                05140099
051401                   SU130-COMMA-062                                05140199
051402                   SU130-COMMA-063                                05140299
051403                   SU130-COMMA-064                                05140399
051404                   SU130-COMMA-065.                               05140499
051405                                                                  05140599
051406     WRITE OUTPUT-RECORD                                          05140699
051407           FROM SU130-EXTRACT-RECORD                              05140799
051408     END-WRITE.                                                   05140899
051409                                                                  05140999
051410                                                                  05141099
051411****************************************************************  05141199
051412* MOVE THE DC LEVEL TOTALS TO OUTPUT FILE                      *  05141299
051413****************************************************************  05141399
051414  4010-WRITE-DC-SUM-RECORD.                                       05141499
051415                                                                  05141599
051416     MOVE SPACES  TO  SU130-EXTRACT-RECORD.                       05141699
051417*                                                                 05141799
051418* DC   TOTAL MINUTES                                              05141899
051419                                                                  05141999
051420     MOVE PV-PREV-OPER   TO SU130-OPER-UNT-ID.                    05142099
051421     MOVE 'ZZZ'          TO SU130-SML-SRC-CDE.                    05142199
051422*                                                                 05142299
051423     MOVE  PV-TRIP-INPUT-RECORD-TOTAL                             05142399
051424                 TO  SU130-INPUT-RECORD-COUNT.                    05142499
051425     MOVE  PV-TRIP-OPEN-TO-CLOSE-MIN-TOT                          05142599
051426                 TO  SU130-TRIP-OPEN-TO-CLOSE-MIN.                05142699
051427     MOVE  PV-TRIP-CLOSE-TO-SHIP-MIN-TOT                          05142799
051428                 TO  SU130-TRIP-CLOSE-TO-SHIP-MIN.                05142899
051429     MOVE  PV-TRIP-OPEN-TO-SHIP-MIN-TOT                           05142999
051430                 TO  SU130-TRIP-OPEN-TO-SHIP-MIN.                 05143099
051431                                                                  05143199
051432     MOVE  PV-TRIP-OPEN-TO-CLOSE-CNT-TOT                          05143299
051433                 TO  SU130-TRIP-OPEN-TO-CLOSE-CNT.                05143399
051434     MOVE  PV-TRIP-CLOSE-TO-SHIP-CNT-TOT                          05143499
051435                 TO  SU130-TRIP-CLOSE-TO-SHIP-CNT.                05143599
051436     MOVE  PV-TRIP-OPEN-TO-SHIP-CNT-TOT                           05143699
051437                 TO  SU130-TRIP-OPEN-TO-SHIP-CNT.                 05143799
051438                                                                  05143899
051439     MOVE  PV-TRIP-ARRIVE-TO-PRC-MIN-TOT                          05143999
051440                 TO  SU130-ARRIVE-TO-PRC-MIN.                     05144099
051441     MOVE  PV-TRIP-ARV-TO-P2L-PKD-MIN-TOT                         05144199
051442                 TO  SU130-ARRIVE-TO-P2L-PKD-MIN.                 05144299
051443     MOVE  PV-TRIP-PRC-TO-P2L-PKD-MIN-TOT                         05144399
051444                 TO  SU130-PRC-TO-P2L-PKD-MIN.                    05144499
051445     MOVE  PV-TRIP-P2L-PKD-TO-CLO-MIN-TOT                         05144599
051446                 TO  SU130-P2L-PKD-TO-CLOSE-MIN.                  05144699
051447     MOVE  PV-TRIP-P2L-OPN-TO-CLO-MIN-TOT                         05144799
051448                 TO  SU130-P2L-OPEN-TO-CLOSE-MIN.                 05144899
051449     MOVE  PV-TRIP-P2L-OPN-TO-OTB-MIN-TOT                         05144999
051450                 TO  SU130-P2L-OPEN-TO-OTBND-MIN.                 05145099
051451     MOVE  PV-TRIP-P2L-CLO-TO-OTB-MIN-TOT                         05145199
051452                 TO  SU130-P2L-CLOSE-TO-OTBND-MIN.                05145299
051453     MOVE  PV-TRIP-ARRIV-TO-OTBND-MIN-TOT                         05145399
051454                 TO  SU130-ARRIVE-TO-OTBND-MIN.                   05145499
051455     MOVE  PV-TRIP-PRC-TO-OTBND-MIN-TOT                           05145599
051456                 TO  SU130-PRC-TO-OTBND-MIN.                      05145699
051457     MOVE  PV-TRIP-ARRIV-TO-TCLOS-MIN-TOT                         05145799
051458                 TO  SU130-ARRIVE-TO-TCLOS-MIN.                   05145899
051459     MOVE  PV-TRIP-ARRIVE-TO-SHIP-MIN-TOT                         05145999
051460                 TO  SU130-ARRIVE-TO-SHIP-MIN.                    05146099
051461     MOVE  PV-TRIP-P2L-OPN-TO-TCL-MIN-TOT                         05146199
051462                 TO  SU130-P2L-OPEN-TO-TCLOS-MIN.                 05146299
051463     MOVE  PV-TRIP-P2L-OPN-TO-SHP-MIN-TOT                         05146399
051464                 TO  SU130-P2L-OPEN-TO-SHIP-MIN.                  05146499
051465     MOVE  PV-TRIP-P2L-CLO-TO-TCL-MIN-TOT                         05146599
051466                 TO  SU130-P2L-CLOSE-TO-TCLOS-MIN.                05146699
051467     MOVE  PV-TRIP-P2L-CLO-TO-SHP-MIN-TOT                         05146799
051468                 TO  SU130-P2L-CLOSE-TO-SHIP-MIN.                 05146899
051469     MOVE  PV-TRIP-ARRIVE-TO-MSTR-MIN-TOT                         05146999
051470                 TO  SU130-ARRIVE-TO-MSTR-MIN.                    05147099
051471     MOVE  PV-TRIP-PRC-TO-MSTR-MIN-TOT                            05147199
051472                 TO  SU130-PRC-TO-MSTR-MIN.                       05147299
051473     MOVE  PV-TRIP-MST-CRE-TO-OTB-MIN-TOT                         05147399
051474                 TO  SU130-MSTR-CRE-TO-OTBND-MIN.                 05147499
051475     MOVE  PV-TRIP-MST-CRE-TO-TCL-MIN-TOT                         05147599
051476                 TO  SU130-MSTR-CRE-TO-TCLOS-MIN.                 05147699
051477     MOVE  PV-TRIP-MST-CRE-TO-SHP-MIN-TOT                         05147799
051478                 TO  SU130-MSTR-CRE-TO-SHIP-MIN.                  05147899
051479     MOVE  PV-TRIP-MST-1ST-TO-OTB-MIN-TOT                         05147999
051480                 TO  SU130-MSTR-FIRST-TO-OTBND-MIN.               05148099
051481     MOVE  PV-TRIP-MST-1ST-TO-TCL-MIN-TOT                         05148199
051482                 TO  SU130-MSTR-FIRST-TO-TCLOS-MIN.               05148299
051483     MOVE  PV-TRIP-MST-1ST-TO-SHP-MIN-TOT                         05148399
051484                 TO  SU130-MSTR-FIRST-TO-SHIP-MIN.                05148499
051485     MOVE  PV-TRIP-MST-LST-TO-OTB-MIN-TOT                         05148599
051486                 TO  SU130-MSTR-LAST-TO-OTBND-MIN.                05148699
051487     MOVE  PV-TRIP-MST-LST-TO-TCL-MIN-TOT                         05148799
051488                 TO  SU130-MSTR-LAST-TO-TCLOS-MIN.                05148899
051489     MOVE  PV-TRIP-MST-LST-TO-SHP-MIN-TOT                         05148999
051490                 TO  SU130-MSTR-LAST-TO-SHIP-MIN.                 05149099
051491     MOVE  PV-TRIP-ON-OTB-TO-CLOS-MIN-TOT                         05149199
051492                 TO  SU130-ON-OTBND-TO-CLOS-MIN.                  05149299
051493     MOVE  PV-TRIP-ON-OTB-TO-SHIP-MIN-TOT                         05149399
051494                 TO  SU130-ON-OTBND-TO-SHIP-MIN.                  05149499
051495                                                                  05149599
051496     MOVE  PV-TRIP-ARRIVE-TO-PRC-CNT-TOT                          05149699
051497                 TO  SU130-ARRIVE-TO-PRC-CNT.                     05149799
051498     MOVE  PV-TRIP-PRC-TO-P2L-PKD-CNT-TOT                         05149899
051499                 TO  SU130-ARRIVE-TO-P2L-PKD-CNT.                 05149999
051500     MOVE  PV-TRIP-ARR-TO-P2L-PKD-CNT-TOT                         05150099
051501                 TO  SU130-PRC-TO-P2L-PKD-CNT.                    05150199
051502     MOVE  PV-TRIP-P2L-PKD-TO-CLO-CNT-TOT                         05150299
051503                 TO  SU130-P2L-PKD-TO-CLOSE-CNT.                  05150399
051504     MOVE  PV-TRIP-P2L-OPN-TO-CLO-CNT-TOT                         05150499
051505                 TO  SU130-P2L-OPEN-TO-CLOSE-CNT.                 05150599
051506     MOVE  PV-TRIP-P2L-OPN-TO-OTB-CNT-TOT                         05150699
051507                 TO  SU130-P2L-OPEN-TO-OTBND-CNT.                 05150799
051508     MOVE  PV-TRIP-P2L-CLO-TO-OTB-CNT-TOT                         05150899
051509                 TO  SU130-P2L-CLOSE-TO-OTBND-CNT.                05150999
051510     MOVE  PV-TRIP-ARRIV-TO-OTBND-CNT-TOT                         05151099
051511                 TO  SU130-ARRIVE-TO-OTBND-CNT.                   05151199
051512     MOVE  PV-TRIP-PRC-TO-OTBND-CNT-TOT                           05151299
051513                 TO  SU130-PRC-TO-OTBND-CNT.                      05151399
051514     MOVE  PV-TRIP-ARRIV-TO-TCLOS-CNT-TOT                         05151499
051515                 TO  SU130-ARRIVE-TO-TCLOS-CNT.                   05151599
051516     MOVE  PV-TRIP-ARRIVE-TO-SHIP-CNT-TOT                         05151699
051517                 TO  SU130-ARRIVE-TO-SHIP-CNT.                    05151799
051518     MOVE  PV-TRIP-P2L-OPN-TO-TCL-CNT-TOT                         05151899
051519                 TO  SU130-P2L-OPEN-TO-TCLOS-CNT.                 05151999
051520     MOVE  PV-TRIP-P2L-OPN-TO-SHP-CNT-TOT                         05152099
051521                 TO  SU130-P2L-OPEN-TO-SHIP-CNT.                  05152199
051522     MOVE  PV-TRIP-P2L-CLO-TO-TCL-CNT-TOT                         05152299
051523                 TO  SU130-P2L-CLOSE-TO-TCLOS-CNT.                05152399
051524     MOVE  PV-TRIP-P2L-CLO-TO-SHP-CNT-TOT                         05152499
051525                 TO  SU130-P2L-CLOSE-TO-SHIP-CNT.                 05152599
051526     MOVE  PV-TRIP-ARRIVE-TO-MSTR-CNT-TOT                         05152699
051527                 TO  SU130-ARRIVE-TO-MSTR-CNT.                    05152799
051528     MOVE  PV-TRIP-PRC-TO-MSTR-CNT-TOT                            05152899
051529                 TO  SU130-PRC-TO-MSTR-CNT.                       05152999
051530     MOVE  PV-TRIP-MST-CRE-TO-OTB-CNT-TOT                         05153099
051531                 TO  SU130-MSTR-CRE-TO-OTBND-CNT.                 05153199
051532     MOVE  PV-TRIP-MST-CRE-TO-TCL-CNT-TOT                         05153299
051533                 TO  SU130-MSTR-CRE-TO-TCLOS-CNT.                 05153399
051534     MOVE  PV-TRIP-MST-CRE-TO-SHP-CNT-TOT                         05153499
051535                 TO  SU130-MSTR-CRE-TO-SHIP-CNT.                  05153599
051536     MOVE  PV-TRIP-MST-1ST-TO-OTB-CNT-TOT                         05153699
051537                 TO  SU130-MSTR-FIRST-TO-OTBND-CNT.               05153799
051538     MOVE  PV-TRIP-MST-1ST-TO-SHP-CNT-TOT                         05153899
051539                 TO  SU130-MSTR-FIRST-TO-TCLOS-CNT.               05153999
051540     MOVE  PV-TRIP-MST-1ST-TO-TCL-CNT-TOT                         05154099
051541                 TO  SU130-MSTR-FIRST-TO-SHIP-CNT.                05154199
051542     MOVE  PV-TRIP-MST-LST-TO-OTB-CNT-TOT                         05154299
051543                 TO  SU130-MSTR-LAST-TO-OTBND-CNT.                05154399
051544     MOVE  PV-TRIP-MST-LST-TO-TCL-CNT-TOT                         05154499
051545                 TO  SU130-MSTR-LAST-TO-TCLOS-CNT.                05154599
051546     MOVE  PV-TRIP-MST-LST-TO-SHP-CNT-TOT                         05154699
051547                 TO  SU130-MSTR-LAST-TO-SHIP-CNT.                 05154799
051548     MOVE  PV-TRIP-ON-OTB-TO-CLOS-CNT-TOT                         05154899
051549                 TO  SU130-ON-OTBND-TO-CLOS-CNT.                  05154999
051550     MOVE  PV-TRIP-ON-OTB-TO-SHIP-CNT-TOT                         05155099
051551                 TO  SU130-ON-OTBND-TO-SHIP-CNT.                  05155199
051552     MOVE ','  TO  SU130-COMMA-001                                05155299
051553                   SU130-COMMA-002                                05155399
051554                   SU130-COMMA-003                                05155499
051555                   SU130-COMMA-004                                05155599
051556                   SU130-COMMA-005                                05155699
051557                   SU130-COMMA-006                                05155799
051558                   SU130-COMMA-007                                05155899
051559                   SU130-COMMA-008                                05155999
051560                   SU130-COMMA-009                                05156099
051561                   SU130-COMMA-010                                05156199
051562                   SU130-COMMA-011                                05156299
051563                   SU130-COMMA-012                                05156399
051564                   SU130-COMMA-013                                05156499
051565                   SU130-COMMA-014                                05156599
051566                   SU130-COMMA-015                                05156699
051567                   SU130-COMMA-016                                05156799
051568                   SU130-COMMA-017                                05156899
051569                   SU130-COMMA-018                                05156999
051570                   SU130-COMMA-019                                05157099
051571                   SU130-COMMA-020                                05157199
051572                   SU130-COMMA-021                                05157299
051573                   SU130-COMMA-022                                05157399
051574                   SU130-COMMA-023                                05157499
051575                   SU130-COMMA-024                                05157599
051576                   SU130-COMMA-025                                05157699
051577                   SU130-COMMA-026                                05157799
051578                   SU130-COMMA-027                                05157899
051579                   SU130-COMMA-028                                05157999
051580                   SU130-COMMA-029                                05158099
051581                   SU130-COMMA-030                                05158199
051582                   SU130-COMMA-031                                05158299
051583                   SU130-COMMA-032                                05158399
051584                   SU130-COMMA-033                                05158499
051585                   SU130-COMMA-034                                05158599
051586                   SU130-COMMA-035                                05158699
051587                   SU130-COMMA-036                                05158799
051588                   SU130-COMMA-037                                05158899
051589                   SU130-COMMA-038                                05158999
051590                   SU130-COMMA-039                                05159099
051591                   SU130-COMMA-030                                05159199
051592                   SU130-COMMA-041                                05159299
051593                   SU130-COMMA-042                                05159399
051594                   SU130-COMMA-043                                05159499
051595                   SU130-COMMA-044                                05159599
051596                   SU130-COMMA-045                                05159699
051597                   SU130-COMMA-046                                05159799
051598                   SU130-COMMA-047                                05159899
051599                   SU130-COMMA-048                                05159999
051600                   SU130-COMMA-049                                05160099
051601                   SU130-COMMA-050                                05160199
051602                   SU130-COMMA-051                                05160299
051603                   SU130-COMMA-052                                05160399
051604                   SU130-COMMA-053                                05160499
051605                   SU130-COMMA-054                                05160599
051606                   SU130-COMMA-055                                05160699
051607                   SU130-COMMA-056                                05160799
051608                   SU130-COMMA-057                                05160899
051609                   SU130-COMMA-058                                05160999
051610                   SU130-COMMA-059                                05161099
051611                   SU130-COMMA-060                                05161199
051612                   SU130-COMMA-061                                05161299
051613                   SU130-COMMA-062                                05161399
051614                   SU130-COMMA-063                                05161499
051615                   SU130-COMMA-064                                05161599
051616                   SU130-COMMA-065                                05161699
051617                   SU130-COMMA-066.                               05161799
051618                                                                  05161899
051619     WRITE OUTPUT-RECORD                                          05161999
051620           FROM SU130-EXTRACT-RECORD                              05162099
051621     END-WRITE.                                                   05162199
051622                                                                  05162299
051623                                                                  05162399
051624                                                                  05162499
051625****************************************************************  05162599
051626* MOVE THE DETAILS TO REPORT LINE.                             *  05162699
051627****************************************************************  05162799
051628 5000-PRINT-AREA-AVERAGE.                                         05162899
051629                                                                  05162999
051630     MOVE PV-PREV-OPER              TO DL1-DC-NBR                 05163099
051631                                       DL2-DC-NBR                 05163199
051632                                       DL3-DC-NBR                 05163299
051633                                       DL4-DC-NBR                 05163399
051634                                       DL5-DC-NBR                 05163499
051635                                       DL6-DC-NBR.                05163599
051636     MOVE XLT00010-LOC-10-ABBR-NM   TO DL1-DC-NAME                05163699
051637                                       DL2-DC-NAME                05163799
051638                                       DL3-DC-NAME                05163899
051639                                       DL4-DC-NAME                05163999
051640                                       DL5-DC-NAME                05164099
051641                                       DL6-DC-NAME.               05164199
051642                                                                  05164299
051643     IF  PV-PREV-SOURCE      =  'ASN'                             05164399
051644         MOVE 'SCAN BASED XDOCK'    TO DL1-SOURCE                 05164499
051645                                       DL3-SOURCE                 05164599
051646                                       DL4-SOURCE                 05164699
051647                                       DL5-SOURCE                 05164799
051648     ELSE                                                         05164899
051649     IF  PV-PREV-SOURCE      =  'CPS'                             05164999
051650         MOVE 'MANUAL XDOCK    '    TO DL1-SOURCE                 05165099
051651                                       DL3-SOURCE                 05165199
051652                                       DL4-SOURCE                 05165299
051653                                       DL5-SOURCE                 05165399
051654     ELSE                                                         05165499
051655     IF  PV-PREV-SOURCE      =  'P2L'                             05165599
051656         MOVE 'PACK-TO-LIGHT   '    TO DL1-SOURCE                 05165699
051657                                       DL3-SOURCE                 05165799
051658                                       DL4-SOURCE                 05165899
051659                                       DL5-SOURCE                 05165999
051660     ELSE                                                         05166099
051661     IF  PV-PREV-SOURCE      =  'RDM'                             05166199
051662         MOVE 'IMPORT REPLEN   '    TO DL1-SOURCE                 05166299
051663                                       DL3-SOURCE                 05166399
051664                                       DL4-SOURCE                 05166499
051665                                       DL5-SOURCE                 05166599
051666     ELSE                                                         05166699
051667     IF  PV-PREV-SOURCE      =  '3WD'                             05166799
051668         MOVE '3PRTY WHSE DISTR'    TO DL1-SOURCE                 05166899
051669                                       DL3-SOURCE                 05166999
051670                                       DL4-SOURCE                 05167099
051671                                       DL5-SOURCE                 05167199
051672     ELSE                                                         05167299
051673     IF  PV-PREV-SOURCE      =  'JWL'                             05167399
051674         MOVE 'P2L JEWELRY     '    TO DL1-SOURCE                 05167499
051675                                       DL3-SOURCE                 05167599
051676                                       DL4-SOURCE                 05167699
051677                                       DL5-SOURCE                 05167799
051678     ELSE                                                         05167899
051679     IF  PV-PREV-SOURCE      =  'MST'                             05167999
051680         MOVE 'MASTER CONTAINER'    TO DL1-SOURCE                 05168099
051681                                       DL3-SOURCE                 05168199
051682                                       DL4-SOURCE                 05168299
051683                                       DL5-SOURCE                 05168399
051684     ELSE                                                         05168499
051685     IF  PV-PREV-SOURCE      =  'SMO'                             05168599
051686         MOVE 'PBS MANUAL XDOCK'    TO DL1-SOURCE                 05168699
051687                                       DL3-SOURCE                 05168799
051688                                       DL4-SOURCE                 05168899
051689                                       DL5-SOURCE                 05168999
051690     ELSE                                                         05169099
051691         MOVE PV-PREV-SOURCE        TO DL1-SOURCE                 05169199
051692                                       DL3-SOURCE                 05169299
051693                                       DL4-SOURCE                 05169399
051694                                       DL5-SOURCE                 05169499
051695     END-IF.                                                      05169599
051696                                                                  05169699
051697* DMH 8/19/16 BEGIN                                               05169799
051698     MOVE  PV-TRIP-SRC-CRTN-PCNT        TO DL1-CRTN-PCNT          05169899
051699                                           DL2-CRTN-PCNT          05169999
051700                                           DL3-CRTN-PCNT          05170099
051701                                           DL4-CRTN-PCNT          05170199
051702                                           DL5-CRTN-PCNT          05170299
051703* DMH 8/19/16 END                                                 05170399
051704                                                                  05170499
051705     IF  PV-PREV-SOURCE      =  'MST'                             05170599
051706*  <5>                                                            05170699
051707         MOVE ZEROES                    TO DL1-ARVL-CKIN          05170799
051708*  <6>                                                            05170899
051709         MOVE PV-PRC-TO-MSTR-DAY        TO DL1-P2L-CKIN-PACK      05170999
051710                                           DL4-P2L-CKIN-PACK      05171099
051711*  <7>                                                            05171199
051712         MOVE PV-ARRIVE-TO-MSTR-DAY     TO DL1-P2L-ARVL-PACK      05171299
051713                                           DL4-P2L-ARVL-PACK      05171399
051714*  <8>                                                            05171499
051715         MOVE PV-MSTR-FIRST-TO-OTBND-DAY TO DL1-P2L-OPEN-CLOSE    05171599
051716                                            DL4-P2L-OPEN-CLOSE    05171699
051717*  <8.1>                                                          05171799
051718         MOVE ZEROES                    TO DL1-P2L-OPEN-TRLR      05171899
051719*  <8.2>                                                          05171999
051720         MOVE ZEROES                    TO DL1-P2L-CLOSE-TRLR     05172099
051721*  <9>                                                            05172199
051722         MOVE PV-MSTR-CRE-TO-OTBND-DAY  TO DL1-CKIN-OTBND-TRLR    05172299
051723                                           DL4-CKIN-OTBND-TRLR    05172399
051724* <10>                                                            05172499
051725*        MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL1-ARVL-OTBND-TRLR    05172599
051726* <11>                                                            05172699
051727         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL1-ON-TRLR-TO-CLOSE   05172799
051728                                           DL4-ON-TRLR-TO-CLOSE   05172899
051729* <11.5>                                                          05172999
051730         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL1-ON-TRLR-TO-SHIP    05173099
051731                                           DL4-ON-TRLR-TO-SHIP    05173199
051732* <12>                                                            05173299
051733*        MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL1-TRLR-CLOSE-TO-SHIP 05173399
051734* <13>                                                            05173499
051735*        MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL1-TRLR-OPEN-TO-CLOSE 05173599
051736* <14>                                                            05173699
051737*        MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL1-TRLR-OPEN-TO-SHIP  05173799
051738* <15>                                                            05173899
051739         MOVE PV-MSTR-CRE-TO-TCLOS-DAY  TO DL1-ARVL-TO-TRLR-CLOSE 05173999
051740                                           DL4-ARVL-TO-TRLR-CLOSE 05174099
051741* <16>                                                            05174199
051742         MOVE PV-MSTR-CRE-TO-SHIP-DAY   TO DL1-ARVL-TO-TRLR-SHIP  05174299
051743                                           DL4-ARVL-TO-TRLR-SHIP  05174399
051744     ELSE                                                         05174499
051745*  <5>                                                            05174599
051746         MOVE PV-ARRIVE-TO-PRC-DAY      TO DL1-ARVL-CKIN          05174699
051747                                           DL3-ARVL-CKIN          05174799
051748*  <6>                                                            05174899
051749         MOVE PV-PRC-TO-P2L-PKD-DAY     TO DL1-P2L-CKIN-PACK      05174999
051750*  <7>                                                            05175099
051751         MOVE PV-ARRIVE-TO-P2L-PKD-DAY  TO DL1-P2L-ARVL-PACK      05175199
051752*  <8>                                                            05175299
051753         MOVE PV-P2L-OPEN-TO-CLOSE-DAY  TO DL1-P2L-OPEN-CLOSE     05175399
051754*  <8.1>                                                          05175499
051755         MOVE PV-P2L-OPEN-TO-OTBND-DAY  TO DL1-P2L-OPEN-TRLR      05175599
051756*  <8.2>                                                          05175699
051757         MOVE PV-P2L-CLOSE-TO-OTBND-DAY TO DL1-P2L-CLOSE-TRLR     05175799
051758*  <9>                                                            05175899
051759         MOVE PV-PRC-TO-OTBND-DAY       TO DL1-CKIN-OTBND-TRLR    05175999
051760                                           DL3-CKIN-OTBND-TRLR    05176099
051761                                           DL5-CKIN-OTBND-TRLR    05176199
051762* <10>                                                            05176299
051763         MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL1-ARVL-OTBND-TRLR    05176399
051764                                           DL3-ARVL-OTBND-TRLR    05176499
051765* <11>                                                            05176599
051766         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL1-ON-TRLR-TO-CLOSE   05176699
051767                                           DL3-ON-TRLR-TO-CLOSE   05176799
051768                                           DL5-ON-TRLR-TO-CLOSE   05176899
051769* <11.5>                                                          05176999
051770         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL1-ON-TRLR-TO-SHIP    05177099
051771         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL1-ON-TRLR-TO-SHIP    05177199
051772                                           DL3-ON-TRLR-TO-SHIP    05177299
051773                                           DL5-ON-TRLR-TO-SHIP    05177399
051774* <12>                                                            05177499
051775*        MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL1-TRLR-CLOSE-TO-SHIP 05177599
051776* <13>                                                            05177699
051777*        MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL1-TRLR-OPEN-TO-CLOSE 05177799
051778* <14>                                                            05177899
051779*        MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL1-TRLR-OPEN-TO-SHIP  05177999
051780* <15>                                                            05178099
051781         MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL1-ARVL-TO-TRLR-CLOSE 05178199
051782                                           DL3-ARVL-TO-TRLR-CLOSE 05178299
051783                                           DL5-ARVL-TO-TRLR-CLOSE 05178399
051784* <16>                                                            05178499
051785         MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL1-ARVL-TO-TRLR-SHIP  05178599
051786                                           DL3-ARVL-TO-TRLR-SHIP  05178699
051787                                           DL5-ARVL-TO-TRLR-SHIP  05178799
051788     END-IF.                                                      05178899
051789                                                                  05178999
051790     IF  PV-PREV-SOURCE      =  'ASN'  OR                         05179099
051791         PV-PREV-SOURCE      =  'CPS'  OR                         05179199
051792         PV-PREV-SOURCE      =  'SMO'                             05179299
051793         WRITE REPORT-RECORD                                      05179399
051794          FROM DETAIL-LINE3                                       05179499
051795         AFTER ADVANCING 1 LINES                                  05179599
051796     ELSE                                                         05179699
051797         IF  PV-PREV-SOURCE      =  'MST'                         05179799
051798             WRITE REPORT-RECORD                                  05179899
051799              FROM DETAIL-LINE4                                   05179999
051800             AFTER ADVANCING 1 LINES                              05180099
051801         ELSE                                                     05180199
051802             IF  PV-PREV-SOURCE      =  'RDM'  OR                 05180299
051803                 PV-PREV-SOURCE      =  '3WD'                     05180399
051804                 WRITE REPORT-RECORD                              05180499
051805                  FROM DETAIL-LINE5                               05180599
051806                 AFTER ADVANCING 1 LINES                          05180699
051807             ELSE                                                 05180799
051808                 WRITE REPORT-RECORD                              05180899
051809                  FROM DETAIL-LINE1                               05180999
051810                 AFTER ADVANCING 1 LINES                          05181099
051811             END-IF                                               05181199
051812         END-IF                                                   05181299
051813     END-IF.                                                      05181399
051814                                                                  05181499
051815     ADD  1                  TO PV-LINE-COUNT.                    05181599
051816     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        05181699
051817         PERFORM 1500-PRINT-HEADINGS                              05181799
051818     END-IF.                                                      05181899
051819                                                                  05181999
051820                                                                  05182099
051821****************************************************************  05182199
051822* PRINT TRAILER TOTALS                                            05182299
051823****************************************************************  05182399
051824 5020-PRINT-TRLR-TOTALS.                                          05182499
051825                                                                  05182599
051826     MOVE 'DC OVERALL      '    TO DL2-SOURCE                     05182699
051827*                                                                 05182799
051828     MOVE PV-TRIP-SRC-CRTN-PCNT     TO DL2-CRTN-PCNT              05182899
051829*  <5>                                                            05182999
051830     MOVE PV-ARRIVE-TO-PRC-DAY      TO DL2-ARVL-CKIN              05183099
051831*  <6>                                                            05183199
051832     MOVE PV-PRC-TO-P2L-PKD-DAY     TO DL2-P2L-CKIN-PACK          05183299
051833*  <7>                                                            05183399
051834     MOVE PV-ARRIVE-TO-P2L-PKD-DAY  TO DL2-P2L-ARVL-PACK          05183499
051835*  <8>                                                            05183599
051836     MOVE PV-P2L-OPEN-TO-CLOSE-DAY  TO DL2-P2L-OPEN-CLOSE         05183699
051837*  <8.1>                                                          05183799
051838     MOVE PV-P2L-OPEN-TO-OTBND-DAY  TO DL2-P2L-OPEN-TRLR          05183899
051839*  <8.2>                                                          05183999
051840     MOVE PV-P2L-CLOSE-TO-OTBND-DAY TO DL2-P2L-CLOSE-TRLR         05184099
051841*  <9>                                                            05184199
051842     MOVE PV-PRC-TO-OTBND-DAY       TO DL2-CKIN-OTBND-TRLR        05184299
051843* <10>                                                            05184399
051844     MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL2-ARVL-OTBND-TRLR        05184499
051845* <11>                                                            05184599
051846     MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL2-ON-TRLR-TO-CLOSE       05184699
051847* <11.5>                                                          05184799
051848     MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL2-ON-TRLR-TO-SHIP        05184899
051849* <12>                                                            05184999
051850     MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL2-TRLR-CLOSE-TO-SHIP     05185099
051851* <13>                                                            05185199
051852     MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL2-TRLR-OPEN-TO-CLOSE     05185299
051853* <14>                                                            05185399
051854     MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL2-TRLR-OPEN-TO-SHIP      05185499
051855* <15>                                                            05185599
051856     MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL2-ARVL-TO-TRLR-CLOSE     05185699
051857* <16>                                                            05185799
051858     MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL2-ARVL-TO-TRLR-SHIP      05185899
051859                                                                  05185999
051860     WRITE REPORT-RECORD                                          05186099
051861       FROM DETAIL-LINE2                                          05186199
051862         AFTER ADVANCING 1 LINES.                                 05186299
051863                                                                  05186399
051864*                                                                 05186499
051865* DMH 6/19                                                        05186599
051866*                                                                 05186699
051867     MOVE 'DC TOTAL TRIPS  '    TO DL6-SOURCE                     05186799
051868*                                                                 05186899
051869     MOVE  PV-DC-TOTAL-TRIPS     TO DL6-TOTAL-TRIPS               05186999
051870                                                                  05187099
051871     WRITE REPORT-RECORD                                          05187199
051872       FROM DETAIL-LINE6                                          05187299
051873         AFTER ADVANCING 1 LINES.                                 05187399
051874                                                                  05187499
051875     MOVE ZEROES  TO  PV-DC-TOTAL-TRIPS.                          05187599
051876*                                                                 05187699
051877* DMH 6/19                                                        05187799
051878*                                                                 05187899
051879                                                                  05187999
051880     ADD  2                  TO PV-LINE-COUNT.                    05188099
051881     ADD  1                  TO PV-DC-COUNT.                      05188199
051882     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE  OR                    05188299
051883         PV-DC-COUNT    > PV-DC-ON-PAGE                           05188399
051884         PERFORM 1500-PRINT-HEADINGS                              05188499
051885     ELSE                                                         05188599
051886         MOVE  SPACES TO REPORT-RECORD                            05188699
051887         WRITE REPORT-RECORD                                      05188799
051888             AFTER ADVANCING 1 LINES                              05188899
051889         ADD  1              TO PV-LINE-COUNT                     05188999
051890         IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                    05189099
051891             PERFORM 1500-PRINT-HEADINGS                          05189199
051892         END-IF                                                   05189299
051893     END-IF.                                                      05189399
051894****************************************************************  05189499
051895* PRINT CORPORATE TOTALS  USING PRINT LINE 1                      05189599
051896****************************************************************  05189699
051897 5030-PRINT-CORP-TOTALS.                                          05189799
051898                                                                  05189899
051899*                                                                 05189999
051900         MOVE PV-TRIP-SRC-CRTN-PCNT     TO DL1-CRTN-PCNT          05190099
051901*  <5>                                                            05190199
051902         MOVE PV-ARRIVE-TO-PRC-DAY      TO DL1-ARVL-CKIN          05190299
051903*  <6>                                                            05190399
051904         MOVE PV-PRC-TO-P2L-PKD-DAY     TO DL1-P2L-CKIN-PACK      05190499
051905*  <7>                                                            05190599
051906         MOVE PV-ARRIVE-TO-P2L-PKD-DAY  TO DL1-P2L-ARVL-PACK      05190699
051907*  <8>                                                            05190799
051908         MOVE PV-P2L-OPEN-TO-CLOSE-DAY  TO DL1-P2L-OPEN-CLOSE     05190899
051909*  <8.1>                                                          05190999
051910         MOVE PV-P2L-OPEN-TO-OTBND-DAY  TO DL1-P2L-OPEN-TRLR      05191099
051911*  <8.2>                                                          05191199
051912         MOVE PV-P2L-CLOSE-TO-OTBND-DAY TO DL1-P2L-CLOSE-TRLR     05191299
051913*  <9>                                                            05191399
051914         MOVE PV-PRC-TO-OTBND-DAY       TO DL1-CKIN-OTBND-TRLR    05191499
051915* <10>                                                            05191599
051916         MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL1-ARVL-OTBND-TRLR    05191699
051917* <11>                                                            05191799
051918         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL1-ON-TRLR-TO-CLOSE   05191899
051919* <11.5>                                                          05191999
051920         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL1-ON-TRLR-TO-SHIP    05192099
051921         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL1-ON-TRLR-TO-SHIP    05192199
051922* <12>                                                            05192299
051923*        MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL1-TRLR-CLOSE-TO-SHIP 05192399
051924* <13>                                                            05192499
051925*        MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL1-TRLR-OPEN-TO-CLOSE 05192599
051926* <14>                                                            05192699
051927*        MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL1-TRLR-OPEN-TO-SHIP  05192799
051928* <15>                                                            05192899
051929         MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL1-ARVL-TO-TRLR-CLOSE 05192999
051930* <16>                                                            05193099
051931         MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL1-ARVL-TO-TRLR-SHIP  05193199
051932                                                                  05193299
051933     WRITE REPORT-RECORD                                          05193399
051934      FROM DETAIL-LINE1                                           05193499
051935     AFTER ADVANCING 1 LINES.                                     05193599
051936                                                                  05193699
051937     ADD  1                  TO PV-LINE-COUNT.                    05193799
051938     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        05193899
051939         PERFORM 1500-PRINT-HEADINGS                              05193999
051940     END-IF.                                                      05194099
051941                                                                  05194199
051942****************************************************************  05194299
051943* PRINT CORPORATE TOTALS  USING PRINT LINE 2                      05194399
051944****************************************************************  05194499
051945 5040-PRINT-CORP-TOTALS.                                          05194599
051946                                                                  05194699
051947*                                                                 05194799
051948     MOVE PV-TRIP-SRC-CRTN-PCNT     TO DL2-CRTN-PCNT              05194899
051949*  <5>                                                            05194999
051950     MOVE PV-ARRIVE-TO-PRC-DAY      TO DL2-ARVL-CKIN              05195099
051951*  <6>                                                            05195199
051952     MOVE PV-PRC-TO-P2L-PKD-DAY     TO DL2-P2L-CKIN-PACK          05195299
051953*  <7>                                                            05195399
051954     MOVE PV-ARRIVE-TO-P2L-PKD-DAY  TO DL2-P2L-ARVL-PACK          05195499
051955*  <8>                                                            05195599
051956     MOVE PV-P2L-OPEN-TO-CLOSE-DAY  TO DL2-P2L-OPEN-CLOSE         05195699
051957*  <8.1>                                                          05195799
051958     MOVE PV-P2L-OPEN-TO-OTBND-DAY  TO DL2-P2L-OPEN-TRLR          05195899
051959*  <8.2>                                                          05195999
051960     MOVE PV-P2L-CLOSE-TO-OTBND-DAY TO DL2-P2L-CLOSE-TRLR         05196099
051961*  <9>                                                            05196199
051962     MOVE PV-PRC-TO-OTBND-DAY       TO DL2-CKIN-OTBND-TRLR        05196299
051963* <10>                                                            05196399
051964     MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL2-ARVL-OTBND-TRLR        05196499
051965* <11>                                                            05196599
051966     MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL2-ON-TRLR-TO-CLOSE       05196699
051967* <11.5>                                                          05196799
051968     MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL2-ON-TRLR-TO-SHIP        05196899
051969* <12>                                                            05196999
051970     MOVE PV-TRIP-CLOSE-TO-SHIP-DAY TO DL2-TRLR-CLOSE-TO-SHIP     05197099
051971* <13>                                                            05197199
051972     MOVE PV-TRIP-OPEN-TO-CLOSE-DAY TO DL2-TRLR-OPEN-TO-CLOSE     05197299
051973* <14>                                                            05197399
051974     MOVE PV-TRIP-OPEN-TO-SHIP-DAY  TO DL2-TRLR-OPEN-TO-SHIP      05197499
051975* <15>                                                            05197599
051976     MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL2-ARVL-TO-TRLR-CLOSE     05197699
051977* <16>                                                            05197799
051978     MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL2-ARVL-TO-TRLR-SHIP      05197899
051979                                                                  05197999
051980     WRITE REPORT-RECORD                                          05198099
051981       FROM DETAIL-LINE2                                          05198199
051982         AFTER ADVANCING 1 LINES.                                 05198299
051983                                                                  05198399
051984     ADD  1                  TO PV-LINE-COUNT.                    05198499
051985     ADD  1                  TO PV-DC-COUNT.                      05198599
051986     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE  OR                    05198699
051987         PV-DC-COUNT    > PV-DC-ON-PAGE                           05198799
051988         PERFORM 1500-PRINT-HEADINGS                              05198899
051989     END-IF.                                                      05198999
051990                                                                  05199099
051991****************************************************************  05199199
051992* PRINT CORPORATE TOTALS - USING PRINT LINE 3                     05199299
051993****************************************************************  05199399
051994 5050-PRINT-CORP-TOTALS.                                          05199499
051995                                                                  05199599
051996*                                                                 05199699
051997         MOVE PV-TRIP-SRC-CRTN-PCNT     TO DL3-CRTN-PCNT          05199799
051998*  <5>                                                            05199899
051999         MOVE PV-ARRIVE-TO-PRC-DAY      TO DL3-ARVL-CKIN          05199999
052000*  <9>                                                            05200099
052001         MOVE PV-PRC-TO-OTBND-DAY       TO DL3-CKIN-OTBND-TRLR    05200199
052002* <10>                                                            05200299
052003         MOVE PV-ARRIVE-TO-OTBND-DAY    TO DL3-ARVL-OTBND-TRLR    05200399
052004* <11>                                                            05200499
052005         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL3-ON-TRLR-TO-CLOSE   05200599
052006* <11.5>                                                          05200699
052007         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL3-ON-TRLR-TO-SHIP    05200799
052008* <15>                                                            05200899
052009         MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL3-ARVL-TO-TRLR-CLOSE 05200999
052010* <16>                                                            05201099
052011         MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL3-ARVL-TO-TRLR-SHIP  05201199
052012                                                                  05201299
052013     WRITE REPORT-RECORD                                          05201399
052014      FROM DETAIL-LINE3                                           05201499
052015     AFTER ADVANCING 1 LINES.                                     05201599
052016                                                                  05201699
052017     ADD  1                  TO PV-LINE-COUNT.                    05201799
052018     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        05201899
052019         PERFORM 1500-PRINT-HEADINGS                              05201999
052020     END-IF.                                                      05202099
052021                                                                  05202199
052022****************************************************************  05202299
052023* PRINT CORPORATE TOTALS - USING LINE 4                           05202399
052024****************************************************************  05202499
052025 5060-PRINT-CORP-TOTALS.                                          05202599
052026                                                                  05202699
052027*                                                                 05202799
052028         MOVE PV-TRIP-SRC-CRTN-PCNT     TO DL4-CRTN-PCNT          05202899
052029*  <6>                                                            05202999
052030         MOVE PV-PRC-TO-MSTR-DAY        TO DL4-P2L-CKIN-PACK      05203099
052031*  <7>                                                            05203199
052032         MOVE PV-ARRIVE-TO-MSTR-DAY     TO DL4-P2L-ARVL-PACK      05203299
052033*  <8>                                                            05203399
052034         MOVE PV-MSTR-FIRST-TO-OTBND-DAY TO DL4-P2L-OPEN-CLOSE    05203499
052035*  <9>                                                            05203599
052036         MOVE PV-MSTR-CRE-TO-OTBND-DAY  TO DL4-CKIN-OTBND-TRLR    05203699
052037* <11>                                                            05203799
052038         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL4-ON-TRLR-TO-CLOSE   05203899
052039* <11.5>                                                          05203999
052040         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL4-ON-TRLR-TO-SHIP    05204099
052041* <15>                                                            05204199
052042         MOVE PV-MSTR-CRE-TO-TCLOS-DAY  TO DL4-ARVL-TO-TRLR-CLOSE 05204299
052043* <16>                                                            05204399
052044         MOVE PV-MSTR-CRE-TO-SHIP-DAY   TO DL4-ARVL-TO-TRLR-SHIP  05204499
052045                                                                  05204599
052046     WRITE REPORT-RECORD                                          05204699
052047      FROM DETAIL-LINE4                                           05204799
052048     AFTER ADVANCING 1 LINES.                                     05204899
052049                                                                  05204999
052050     ADD  1                  TO PV-LINE-COUNT.                    05205099
052051     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        05205199
052052         PERFORM 1500-PRINT-HEADINGS                              05205299
052053     END-IF.                                                      05205399
052054                                                                  05205499
052055****************************************************************  05205599
052056* PRINT CORPORATE TOTALS - USING LINE 5                           05205699
052057****************************************************************  05205799
052058 5070-PRINT-CORP-TOTALS.                                          05205899
052059                                                                  05205999
052060*                                                                 05206099
052061         MOVE PV-TRIP-SRC-CRTN-PCNT     TO DL5-CRTN-PCNT          05206199
052062*  <9>                                                            05206299
052063         MOVE PV-PRC-TO-OTBND-DAY       TO DL5-CKIN-OTBND-TRLR    05206399
052064* <11>                                                            05206499
052065         MOVE PV-ON-OTBND-TO-CLOS-DAY   TO DL5-ON-TRLR-TO-CLOSE   05206599
052066* <11.5>                                                          05206699
052067         MOVE PV-ON-OTBND-TO-SHIP-DAY   TO DL5-ON-TRLR-TO-SHIP    05206799
052068* <15>                                                            05206899
052069         MOVE PV-ARRIVE-TO-TCLOS-DAY    TO DL5-ARVL-TO-TRLR-CLOSE 05206999
052070* <16>                                                            05207099
052071         MOVE PV-ARRIVE-TO-SHIP-DAY     TO DL5-ARVL-TO-TRLR-SHIP  05207199
052072                                                                  05207299
052073     WRITE REPORT-RECORD                                          05207399
052074      FROM DETAIL-LINE5                                           05207499
052075     AFTER ADVANCING 1 LINES.                                     05207599
052076                                                                  05207699
052077     ADD  1                  TO PV-LINE-COUNT.                    05207799
052078     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        05207899
052079         PERFORM 1500-PRINT-HEADINGS                              05207999
052080     END-IF.                                                      05208099
052081                                                                  05208199
052082                                                                  05208299
052083****************************************************************  05208399
052084* PRINT CORPORATE TOTALS - USING LINE 6                           05208499
052085****************************************************************  05208599
052086 5080-PRINT-CORP-TOTALS.                                          05208699
052087                                                                  05208799
052088*                                                                 05208899
052089     MOVE PV-OVR-TOTAL-TRIPS        TO DL6-TOTAL-TRIPS            05208999
052090                                                                  05209099
052091     WRITE REPORT-RECORD                                          05209199
052092      FROM DETAIL-LINE6                                           05209299
052093     AFTER ADVANCING 1 LINES.                                     05209399
052094                                                                  05209499
052095     ADD  1                  TO PV-LINE-COUNT.                    05209599
052096     IF  PV-LINE-COUNT  > PV-LINES-ON-PAGE                        05209699
052097         PERFORM 1500-PRINT-HEADINGS                              05209799
052098     END-IF.                                                      05209899
052099                                                                  05209999
052100                                                                  05210099
052101****************************************************************  05210199
052102* PRINTS A BLANK LINE                                          *  05210299
052103****************************************************************  05210399
052104 6000-PRINT-BLANK-LINE.                                           05210499
052105                                                                  05210599
052106        WRITE REPORT-RECORD                                       05210699
052107          FROM BLANK-LINE                                         05210799
052108            AFTER ADVANCING 1 LINE                                05210899
052109                                                                  05210999
052110     ADD +1 TO PV-LINE-COUNT.                                     05211099
052111                                                                  05211199
052112******************************************************************05211299
052113*  READ A RECORD FROM THE MANIFESTED NOT LOADED FILE             *05211399
052114******************************************************************05211499
052115 7000-READ-EXTRACT-FILE.                                          05211599
052116     READ INPUT-FILE                                              05211699
052117          INTO SU129-EXTRACT-RECORD                               05211799
052118         AT END                                                   05211899
052119             SET PS-END-OF-INPUT TO TRUE                          05211999
052120         NOT AT END                                               05212099
052121             ADD +1 TO PV-READ-COUNT                              05212199
052122     END-READ.                                                    05212299
052123                                                                  05212399
052124*-----------------------------------------------------------------05212499
052125*  READ DATE CONTROL RECORD                                       05212599
052126*-----------------------------------------------------------------05212699
052127 7010-READ-CONTROL-REC.                                           05212799
052128                                                                  05212899
052129     MOVE SPACES  TO  SU032-DATE-CONTROL-REC.                     05212999
052130                                                                  05213099
052131     READ CONTROL-FILE     INTO                                   05213199
052132           SU032-DATE-CONTROL-REC                                 05213299
052133     AT END                                                       05213399
052134         DISPLAY 'PROGRAM:  SUKRP072'                             05213499
052135         DISPLAY 'NO DATE CONTROL CARD'                           05213599
052136         DISPLAY ' '                                              05213699
052137     NOT AT END                                                   05213799
052138         DISPLAY 'PROGRAM:  SUKRP072'                             05213899
052139         DISPLAY 'DATE CONTROL CARD:'                             05213999
052140                 SU032-FROM-DATE ' '                              05214099
052141                 SU032-TO-DATE   ' '                              05214199
052142                 SU032-RPT-TYPE                                   05214299
052143         DISPLAY ' '                                              05214399
052144     END-READ.                                                    05214499
052145                                                                  05214599
052146*-----------------------------------------------------------------05214699
052147*  READ DATE SELECTION RECORD                                     05214799
052148*-----------------------------------------------------------------05214899
052149 7015-READ-SELECTION-REC.                                         05214999
052150                                                                  05215099
052151     MOVE SPACES  TO  SU134-SELECTION-REC.                        05215199
052152                                                                  05215299
052153     READ SELECTION-FILE     INTO                                 05215399
052154           SU134-SELECTION-REC                                    05215499
052155     AT END                                                       05215599
052156         DISPLAY 'PROGRAM:  SUKRP072'                             05215699
052157         DISPLAY 'NO DATE SELECTION CARD'                         05215799
052158         DISPLAY ' '                                              05215899
052159     NOT AT END                                                   05215999
052160         DISPLAY 'PROGRAM:  SUKRP072'                             05216099
052161         DISPLAY 'DATE CONTROL CARD:'                             05216199
052162                 SU032-FROM-DATE ' '                              05216299
052163                 SU032-TO-DATE   ' '                              05216399
052164                 SU032-RPT-TYPE                                   05216499
052165         DISPLAY ' '                                              05216599
052166     END-READ.                                                    05216699
052167                                                                  05216799
052168     IF  SU134-EFC-STORES                                         05216899
052169         SET  HL1-EFC-STORES   TO  TRUE                           05216999
052170     ELSE                                                         05217099
052171     IF  SU134-LFC-STORES                                         05217199
052172          SET  HL1-LFC-STORES  TO  TRUE                           05217299
052173     ELSE                                                         05217399
052174          SET  HL1-RDC-STORES  TO  TRUE                           05217499
052175     END-IF                                                       05217599
052176     END-IF.                                                      05217699
052177                                                                  05217799
052178                                                                  05217899
052179******************************************************************05217999
052180 8500-GET-LOCATION-NAME.                                          05218099
052181******************************************************************05218199
052182                                                                  05218299
052183     MOVE SU129-OPER-UNT-ID    TO  XLT00010-LOC-NBR.              05218399
052184                                                                  05218499
052185     EXEC SQL                                                     05218599
052186         SELECT   LOC_10_ABBR_NM                                  05218699
052187           INTO  :XLT00010-LOC-10-ABBR-NM                         05218799
052188           FROM   XLT_LOC                                         05218899
052189          WHERE   LOC_NBR  =  :XLT00010-LOC-NBR                   05218999
052190     END-EXEC.                                                    05219099
052191                                                                  05219199
052192     EVALUATE TRUE                                                05219299
052193         WHEN SQLCODE = +0                                        05219399
052194              CONTINUE                                            05219499
052195         WHEN OTHER                                               05219599
052196              MOVE SQLCODE           TO  PV-SQLCODE               05219699
052197              MOVE XLT00010-LOC-NBR  TO  PV-DISP-OPER             05219799
052198              DISPLAY 'SUKRP072 - 8500 - '                        05219899
052199                      'OPER:' PV-DISP-OPER                        05219999
052200                      ' SQL:' PV-SQLCODE                          05220099
052201              CONTINUE                                            05220199
052202     END-EVALUATE.                                                05220299
052203                                                                  05220399
052204******************************************************************05220499
052205*  ABEND ROUTINE                                                 *05220599
052206******************************************************************05220699
052207 9900-DB2-ABEND.                                                  05220799
052208                                                                  05220899
052209     MOVE SQLCODE TO PV-SQLCODE.                                  05220999
052210     DISPLAY '*** DB2 ERROR '.                                    05221099
052211     DISPLAY '*** SQLCODE   = ' PV-SQLCODE.                       05221199
052212     DISPLAY '*** PROGRAM   = ' PV-ABEND-PROGRAM.                 05221299
052213     DISPLAY '*** PARAGRAPH = ' PV-ABEND-PARAGRAPH.               05221399
052214     DISPLAY '*** OPERATION = ' PV-ABEND-OPERATION.               05221499
052215     DISPLAY '*** MESSAGE   = ' PV-DB2-OPERATION-MESSAGE-1.       05221599
052216     DISPLAY '***           = ' PV-DB2-OPERATION-MESSAGE-2.       05221699
052217     DISPLAY '*** TABLE 1   = ' PV-DB2-TABLE-NAME-1.              05221799
052218     DISPLAY '*** TABLE 2   = ' PV-DB2-TABLE-NAME-2.              05221899
052219                                                                  05221999
052220     COPY DPPD004.                                                05222099
052221                                                                  05222199
052222     MOVE +4013 TO PV-ABEND-CODE.                                 05222299
052223     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         05222399
052224                                                                  05222499
052225 9999-ABEND.                                                      05222599
052226                                                                  05222699
052227     DISPLAY '***************'.                                   05222799
052228     DISPLAY '** ABEND     **'.                                   05222899
052229     DISPLAY '** PROGRAM   ** = ' PV-ABEND-PROGRAM.               05222999
052230     DISPLAY '** PARAGRAPH ** = ' PV-ABEND-PARAGRAPH.             05223099
052231     DISPLAY '***************'.                                   05223199
052232                                                                  05223299
052233     MOVE +4008                  TO PV-ABEND-CODE.                05223399
052234     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         05223499
052235                                                                  05223599
052236******************************************************************05223699
052240*                 E N D   O F   P R O G R A M                    *05224000
052300******************************************************************05230000
