000100***************************************************************** 00010003
000200 IDENTIFICATION DIVISION.                                         00020003
000300***************************************************************** 00030003
000400 PROGRAM-ID.             SUKRP032.                                00040003
000500 AUTHOR.                 LYNN MCADAMS.                            00050003
000600 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00060003
000700 DATE-WRITTEN.           SEPTEMBER, 2004.                         00070003
000800 DATE-COMPILED.                                                   00080003
000900***************************************************************** 00090003
001000*                                                               * 00100003
001100*********  MANIFESTED CARTON EXCEPTION REPORT  ****************** 00110007
001200*                                                               * 00120044
001300*  DISPLAYS CARTONS BUILT BUT NEVER LOADED TO A TRAILER.        * 00130007
001400*                                                               * 00140003
001500*  THE INPUT FILE IS FROM THE SURD046 RECORD LAYOUT, PRODUCED   * 00150007
001600*  FROM THE SUKUT091 EXTRACT PROGRAM.                           * 00160007
001700*                                                               * 00170007
001800*  THE REPORT BREAKS AT THE DC LEVEL.                           * 00180007
001900***************************************************************** 00190003
002000*                                                                 00200003
002100***************************************************************** 00210003
002200 ENVIRONMENT DIVISION.                                            00220003
002300***************************************************************** 00230003
002400 CONFIGURATION SECTION.                                           00240003
002500                                                                  00250003
002600 SOURCE-COMPUTER.        IBM-3090.                                00260003
002700 OBJECT-COMPUTER.        IBM-3090.                                00270003
002800                                                                  00280003
002900***************************************************************** 00290003
003000 INPUT-OUTPUT SECTION.                                            00300003
003100                                                                  00310003
003200 FILE-CONTROL.                                                    00320003
003300                                                                  00330003
003400     SELECT INPUT-FILE                                            00340004
003500         ASSIGN TO INP01.                                         00350004
003600                                                                  00360004
003700     SELECT REPORT-FILE                                           00370004
003800         ASSIGN TO RPT01.                                         00380003
003900                                                                  00390003
004000***************************************************************** 00400003
004100 DATA DIVISION.                                                   00410003
004200***************************************************************** 00420003
004300 FILE SECTION.                                                    00430003
004400                                                                  00440004
004500 FD  INPUT-FILE                                                   00450004
004600     RECORDING MODE IS F                                          00460004
004700     LABEL RECORDS ARE STANDARD                                   00470004
004800     BLOCK CONTAINS 0 RECORDS.                                    00480004
004900 01  INPUT-RECORD                    PIC  X(200).                 00490060
005000                                                                  00500004
005100 FD  REPORT-FILE                                                  00510004
005200     RECORDING MODE IS F                                          00520003
005300     BLOCK CONTAINS 0  RECORDS.                                   00530003
005400 01  REPORT-RECORD                   PIC X(132).                  00540004
005500                                                                  00550003
005600***************************************************************** 00560003
005700 WORKING-STORAGE SECTION.                                         00570003
005800                                                                  00580003
005900 01  PROGRAM-SWITCHES.                                            00590003
006000     05  PS-END-OF-INPUT-FILE-SW     PIC X(01) VALUE 'N'.         00600004
006100         88  PS-END-OF-INPUT                   VALUE 'Y'.         00610004
006200         88  PS-NOT-END-OF-INPUT               VALUE 'N'.         00620004
006300                                                                  00630003
006400 01  PC-PROGRAM-CONSTANTS.                                        00640003
006500     05  PC-SUKRP032                 PIC X(08) VALUE              00650004
006600                                               'SUKRP032'.        00660004
006700     05  PC-REPORT-NBR               PIC X(02) VALUE '-1'.        00670003
006800     05  PC-MAX-LINE-COUNT           PIC S9(3) VALUE +60          00680003
006900                                               COMP-3.            00690003
007000     05  PC-DEFAULT-TMST             PIC X(26)  VALUE             00700003
007100                                    '9999-09-09-09.09.09.999999'. 00710003
007200     05  PC-SLASH                    PIC X(01) VALUE '/'.         00720007
007300     05  PC-DASH                     PIC X(01) VALUE '-'.         00730007
007400     05  PC-SOME                     PIC X(04) VALUE 'SOME'.      00740020
007500     05  PC-ALL                      PIC X(04) VALUE ' ALL'.      00750020
007600     05  PC-NONE                     PIC X(04) VALUE 'NONE'.      00760020
007700     05  PC-0                        PIC X(06) VALUE '  0.00'.    00770058
007800                                                                  00780007
007900 01  SD-DATE-TIME.                                                00790007
008000     05  SD-SYSTEM-DATE.                                          00800007
008100         10  SD-SYSTEM-DATE-YY       PIC 9(02) VALUE ZERO.        00810007
008200         10  SD-SYSTEM-DATE-MM       PIC 9(02) VALUE ZERO.        00820007
008300         10  SD-SYSTEM-DATE-DD       PIC 9(02) VALUE ZERO.        00830007
008400     05  SD-SYSTEM-TIME.                                          00840007
008500         10  SD-SYSTEM-TIME-HH       PIC 9(02) VALUE ZERO.        00850007
008600         10  SD-SYSTEM-TIME-MM       PIC 9(02) VALUE ZERO.        00860007
008700         10  SD-SYSTEM-TIME-SS       PIC 9(02) VALUE ZERO.        00870007
008800         10  FILLER                  PIC 9(02) VALUE ZERO.        00880007
008900                                                                  00890003
009000 01  PV-PROGRAM-VARIABLES.                                        00900003
009100     05  PV-READ-COUNT                PIC S9(7) COMP-3            00910004
009200                                                VALUE ZERO.       00920004
009300     05  PV-WRITE-COUNT               PIC S9(7) COMP-3            00930004
009400                                                VALUE ZERO.       00940004
009500     05  PV-DB2-COUNT                PIC S9(9) VALUE +0           00950003
009600                                               COMP-3.            00960003
009700     05  PV-NULL-IND                 PIC S9(04) VALUE +0          00970003
009800                                               COMP SYNC.         00980003
009900     05  PV-DB2-TMST.                                             00990003
010000         10 PV-DB2-TMST-CCYY          PIC  9(04).                 01000003
010100         10 FILLER                    PIC  X(01).                 01010003
010200         10 PV-DB2-TMST-MM            PIC  9(02).                 01020003
010300         10 FILLER                    PIC  X(01).                 01030003
010400         10 PV-DB2-TMST-DD            PIC  9(02).                 01040003
010500         10 FILLER                    PIC  X(01).                 01050003
010600         10 PV-DB2-TMST-HH            PIC  9(02).                 01060003
010700         10 FILLER                    PIC  X(01).                 01070003
010800         10 PV-DB2-TMST-MN            PIC  9(02).                 01080003
010900         10 FILLER                    PIC  X(01).                 01090003
011000         10 PV-DB2-TMST-SS            PIC  9(02).                 01100003
011100         10 FILLER                    PIC  X(07).                 01110003
011200     05  PV-FORMAT-DATE.                                          01120003
011300         10 PV-FORMAT-DATE-MM         PIC  9(02).                 01130003
011400         10 FILLER                    PIC  X(01) VALUE '/'.       01140003
011500         10 PV-FORMAT-DATE-DD         PIC  9(02).                 01150003
011600         10 FILLER                    PIC  X(01) VALUE '/'.       01160003
011700         10 PV-FORMAT-DATE-YY         PIC  9(02).                 01170099
011710     05  PV-VERIFY-DATE.                                          01171099
011720         10 PV-VERIFY-DATE-CC         PIC  9(02).                 01172099
011721         10 PV-VERIFY-DATE-YY         PIC  9(02).                 01172199
011730         10 FILLER                    PIC  X(01).                 01173099
011740         10 PV-VERIFY-DATE-MM         PIC  9(02).                 01174099
011750         10 FILLER                    PIC  X(01).                 01175099
011760         10 PV-VERIFY-DATE-DD         PIC  9(02).                 01176099
011800                                                                  01180007
011900     05  PV-SQLCODE                  PIC 9(09) VALUE ZERO.        01190003
012000     05  PV-PAGE-COUNT               PIC S9(4) VALUE ZERO         01200003
012100                                               COMP-3.            01210003
012200     05  PV-LINE-COUNT               PIC S9(3) VALUE ZERO         01220003
012300                                               COMP-3.            01230003
012400     05  PV-FORMAT-FXR-X.                                         01240099
012500         10  FILLER                  PIC X(03) VALUE SPACES.      01250099
012600         10  PV-FORMAT-FXR           PIC Z(09) VALUE ZERO.        01260099
012900                                                                  01290003
013000     05  PV-TODAYS-DATE.                                          01300003
013100         10  PV-TODAYS-DATE-YY       PIC 9(02) VALUE ZERO.        01310003
013200         10  PV-TODAYS-DATE-MM       PIC 9(02) VALUE ZERO.        01320003
013300         10  PV-TODAYS-DATE-DD       PIC 9(02) VALUE ZERO.        01330003
013400     05  PV-TODAYS-DATE-YYYY.                                     01340003
013500         10  PV-TODAYS-DATE-CC       PIC 9(02) VALUE 20.          01350003
013600         10  PV-TODAYS-DATE-Y2       PIC 9(02) VALUE ZERO.        01360003
013700                                                                  01370003
013800     05  PV-TODAYS-TIME.                                          01380003
013900         10  PV-TODAYS-TIME-HH       PIC 9(02) VALUE ZERO.        01390003
014000         10  PV-TODAYS-TIME-MM       PIC 9(02) VALUE ZERO.        01400003
014100         10  PV-TODAYS-TIME-SS       PIC 9(02) VALUE ZERO.        01410003
014200         10  FILLER                  PIC 9(02) VALUE ZERO.        01420003
014300                                                                  01430003
014400 01  PV-ABEND-FIELDS.                                             01440003
014500     05  PV-ABEND-CODE               PIC S9(4) VALUE +0           01450003
014600                                               COMP SYNC.         01460003
014700     05  PV-ABEND-PROGRAM            PIC X(08) VALUE 'SUKRP032'.  01470004
014800     05  PV-ABEND-PARAGRAPH          PIC X(50) VALUE SPACES.      01480003
014900     05  PV-ABEND-OPERATION          PIC X(50) VALUE SPACES.      01490003
015000     05  PV-ABEND-STRUCTURE-1        PIC X(08) VALUE SPACES.      01500003
015100     05  PV-DB2-OPERATION-MESSAGE-1  PIC X(79) VALUE SPACES.      01510003
015200     05  PV-DB2-OPERATION-MESSAGE-2  PIC X(79) VALUE SPACES.      01520003
015300     05  PV-DB2-OPERATION-MESSAGE-3  PIC X(79) VALUE SPACES.      01530003
015400     05  PV-DB2-OPERATION-MESSAGE-4  PIC X(79) VALUE SPACES.      01540003
015500     05  PV-DB2-TABLE-NAME-1         PIC X(08) VALUE SPACES.      01550003
015600     05  PV-DB2-TABLE-NAME-2         PIC X(08) VALUE SPACES.      01560003
015700                                                                  01570003
015800     05  PV-DISPLAY-PO-NBR              PIC  9(08) VALUE ZEROES.  01580003
015900     05  PV-DISPLAY-RCVR-SEQ-NBR        PIC  9(03) VALUE ZEROES.  01590003
016000     05  PV-DISPLAY-OPER                PIC  9(04) VALUE ZEROES.  01600003
016010     05  PV-DISPLAY-SQLCODE             PIC  9(03)- VALUE ZEROES. 01601069
016020     05  PV-DB2-TABLE-NAME1             PIC  X(15) VALUE SPACES.  01602069
016100                                                                  01610003
016200     05  PV-DISPLAY-READ-COUNT       PIC ZZZ,ZZZ,ZZ9.             01620004
016300     05  PV-DISPLAY-WRITE-COUNT      PIC ZZZ,ZZZ,ZZ9.             01630004
016400                                                                  01640011
016500     05  PV-PO-RCVR.                                              01650022
016600         10  PV-PO                   PIC Z(08).                   01660099
016700         10  PV-PO-X REDEFINES PV-PO PIC X(08).                   01670099
016800         10  PV-DASH                 PIC X(01).                   01680022
016900         10  PV-RCVR                 PIC 9(04).                   01690022
017000         10  PV-RCVR-X REDEFINES PV-RCVR PIC X(04).               01700022
017100                                                                  01710022
017200     05  PV-ATTACH-TO-TRLR           PIC 9(09) VALUE ZEROES.      01720075
017210     05  PV-PERCENT-MFSTD            PIC Z(03).99.                01721075
017220     05  PV-RETAIL-AMT               PIC Z(07).99.                01722084
017230     05  PV-TTL-RETAIL-AMT           PIC Z(11).99.                01723099
017240     05  PV-TTL-RETAIL-CUM           PIC 9(11)V99.                01724099
017300                                                                  01730041
017400     05  PV-DIVIDEND                 PIC  9(03)V9999.             01740041
017500                                                                  01750033
017600     05  PV-CARTONS-MFSTD        PIC S9(05)  VALUE ZEROES         01760047
017700                                                 COMP.            01770047
017800     05  PV-CARTONS-VRFD         PIC S9(05)  VALUE ZEROES         01780047
017900                                                 COMP.            01790047
018000                                                                  01800042
018100 01  PV-SAVE-FIELDS.                                              01810011
018200     05  PV-SAVE-OPER-UNT-ID          PIC S9(04) COMP             01820011
018300                                                 VALUE +0.        01830006
018400 01  DK-DB-KEYS.                                                  01840004
018500     05  DK-OPER-UNT-ID              PIC S9(4) COMP.              01850004
018600     05  DK-PO-NBR                   PIC S9(09)  COMP SYNC.       01860004
018700     05  DK-REC-SEQ-NBR              PIC S9(09)  COMP SYNC.       01870004
018800                                                                  01880006
018900******************************************************************01890004
019000* RECORD LAYOUT FOR THE INPUT FILE.                               01900004
019100******************************************************************01910004
019200     COPY SURD046.                                                01920004
019300                                                                  01930004
019400******************************************************************01940008
019500*  WORK FIELDS FOR PRINTING A 132 CHARACTER REPORT.               01950008
019600******************************************************************01960008
019700     COPY DPWS132O.                                               01970008
019800                                                                  01980003
019900 01  WS-BATCH-PROC-DATE.                                          01990003
020000     05  WS-BATCH-PROC-CC            PIC X(02) VALUE SPACES.      02000003
020100     05  WS-BATCH-PROC-YY            PIC X(02) VALUE SPACES.      02010003
020200     05  FILLER                      PIC X(01) VALUE SPACES.      02020003
020300     05  WS-BATCH-PROC-MM            PIC X(02) VALUE SPACES.      02030003
020400     05  FILLER                      PIC X(01) VALUE SPACES.      02040003
020500     05  WS-BATCH-PROC-DD            PIC X(02) VALUE SPACES.      02050003
020600*                                                                 02060003
020700 01  HEADING-LINES.                                               02070003
020800     05  HEADING-LINE1.                                           02080024
020900         10  FILLER                  PIC X(51) VALUE SPACES.      02090004
021000         10  FILLER                  PIC X(34) VALUE              02100010
021100                      'MANIFESTED CARTON EXCEPTION REPORT'.       02110010
021200         10  FILLER                  PIC X(48) VALUE SPACES.      02120010
021300                                                                  02130003
021400     05  HEADING-LINE2.                                           02140024
021500         10  FILLER                  PIC X(46) VALUE SPACES.      02150004
021600         10  FILLER                  PIC X(43) VALUE              02160004
021700             'CARTONS BUILT BUT NEVER LOADED TO A TRAILER'.       02170004
021800         10  FILLER                  PIC X(44) VALUE SPACES.      02180004
021900                                                                  02190003
022600     05  HEADING-LINE4.                                           02260024
022700         10  FILLER                  PIC X(01) VALUE SPACES.      02270003
022800         10  FILLER                  PIC X(08) VALUE              02280004
022900                                     'OPER ID:'.                  02290004
023000         10  FILLER                  PIC X(01) VALUE SPACES.      02300004
023100         10  HL4-DC-NBR              PIC Z(04) VALUE ZEROES.      02310004
023200         10  FILLER                  PIC X(01) VALUE SPACES.      02320004
023300         10  HL4-DC-DESC             PIC X(20) VALUE SPACES.      02330048
023400         10  FILLER                  PIC X(98) VALUE SPACES.      02340048
023500                                                                  02350003
023600     05  HEADING-LINE5.                                           02360024
023700         10  FILLER                  PIC X(73) VALUE SPACES.      02370099
023800         10  FILLER                  PIC X(22) VALUE              02380099
023900                     '-------VERIFIED-------'.                    02390096
024000         10  FILLER                  PIC X(10) VALUE SPACES.      02400099
024100         10  FILLER                  PIC X(06) VALUE 'NBR OF'.    02410064
024200         10  FILLER                  PIC X(04) VALUE SPACES.      02420099
024500         10  FILLER                  PIC X(07) VALUE 'NBR NOT'.   02450071
024600         10  FILLER                  PIC X(03) VALUE SPACES.      02460099
024610         10  FILLER                  PIC X(07) VALUE 'PERCENT'.   02461081
024620         10  FILLER                  PIC X(01) VALUE SPACES.      02462099
024700                                                                  02470003
024800     05  HEADING-LINE6.                                           02480024
024900         10  FILLER            PIC X(49) VALUE SPACES.            02490099
025000         10  FILLER            PIC X(03) VALUE 'CRE'.             02500099
025200         10  FILLER            PIC X(10) VALUE SPACES.            02520099
025210         10  FILLER            PIC X(03) VALUE 'SET'.             02521096
025220         10  FILLER            PIC X(03) VALUE SPACES.            02522096
025230         10  FILLER            PIC X(03) VALUE 'NEW'.             02523096
025240         10  FILLER            PIC X(04) VALUE SPACES.            02524099
025300         10  FILLER            PIC X(04) VALUE 'DATE'.            02530096
025500         10  FILLER            PIC X(04) VALUE SPACES.            02550099
025600         10  FILLER            PIC X(06) VALUE 'PROCSS'.          02560096
025800         10  FILLER            PIC X(02) VALUE SPACES.            02580099
025810         10  FILLER            PIC X(04) VALUE 'LINE'.            02581081
025820         10  FILLER            PIC X(03) VALUE SPACES.            02582099
025900         10  FILLER            PIC X(03) VALUE 'LOC'.             02590081
026100         10  FILLER            PIC X(04) VALUE SPACES.            02610099
026200         10  FILLER            PIC X(07) VALUE 'CARTONS'.         02620081
026400         10  FILLER            PIC X(02) VALUE SPACES.            02640099
026800         10  FILLER            PIC X(07) VALUE ' LOADED'.         02680081
027000         10  FILLER            PIC X(04) VALUE SPACES.            02700099
027310         10  FILLER            PIC X(07) VALUE 'MANFSTD'.         02731099
027400                                                                  02740004
027500     05  HEADING-LINE7.                                           02750024
027600         10  FILLER            PIC X(05) VALUE ' OPER'.           02760081
027620         10  FILLER            PIC X(04) VALUE SPACES.            02762081
027700         10  FILLER            PIC X(11) VALUE 'VENDOR NAME'.     02770081
027900         10  FILLER            PIC X(04) VALUE SPACES.            02790099
028000         10  FILLER            PIC X(11) VALUE 'PO/RECEIVER'.     02800081
028200         10  FILLER            PIC X(06) VALUE SPACES.            02820099
028300         10  FILLER            PIC X(06) VALUE 'RETAIL'.          02830084
028400         10  FILLER            PIC X(02) VALUE SPACES.            02840099
028410         10  FILLER            PIC X(04) VALUE 'SRCE'.            02841099
028500         10  FILLER            PIC X(02) VALUE SPACES.            02850099
028600         10  FILLER            PIC X(01) VALUE '*'.               02860099
028700         10  FILLER            PIC X(01) VALUE SPACES.            02870099
028710         10  FILLER            PIC X(04) VALUE 'TRBL'.            02871099
028800         10  FILLER            PIC X(01) VALUE SPACES.            02880096
028810         10  FILLER            PIC X(04) VALUE 'NAME'.            02881096
028820         10  FILLER            PIC X(02) VALUE SPACES.            02882096
028830         10  FILLER            PIC X(03) VALUE 'STR'.             02883096
028840         10  FILLER            PIC X(04) VALUE SPACES.            02884099
028900         10  FILLER            PIC X(04) VALUE 'VRFD'.            02890099
029100         10  FILLER            PIC X(05) VALUE SPACES.            02910099
029200         10  FILLER            PIC X(04) VALUE 'AREA'.            02920081
029400         10  FILLER            PIC X(03) VALUE SPACES.            02940099
029500         10  FILLER            PIC X(04) VALUE 'STAT'.            02950081
029700         10  FILLER            PIC X(03) VALUE SPACES.            02970081
029800         10  FILLER            PIC X(04) VALUE 'CODE'.            02980081
030000         10  FILLER            PIC X(03) VALUE SPACES.            03000099
030400         10  FILLER            PIC X(08) VALUE 'MANIFSTD'.        03040081
030600         10  FILLER            PIC X(02) VALUE SPACES.            03060099
030700         10  FILLER            PIC X(07) VALUE 'ON TRLR'.         03070081
030900         10  FILLER            PIC X(03) VALUE SPACES.            03090099
031000         10  FILLER            PIC X(07) VALUE 'TO TRLR'.         03100088
031300                                                                  03130004
031310     05  HEADING-LINE8.                                           03131099
031320         10  FILLER                  PIC X(55) VALUE SPACES.      03132099
031330         10  FILLER                  PIC X(52) VALUE              03133099
031340     '* = F (FLAT), P (P2L), J (JWL), O (OTHER), M (MULTI)'.      03134099
031350         10  FILLER                  PIC X(75) VALUE SPACES.      03135099
031360                                                                  03136099
031400 01  DETAIL-LINES.                                                03140004
031500     05  DETAIL-LINE1.                                            03150012
031600         10  FILLER                  PIC X(01) VALUE SPACES.      03160003
031700         10  DL1-OPER-UNT-ID         PIC Z(04) VALUE SPACES.      03170072
031710         10  FILLER                  PIC X(02) VALUE SPACES.      03171072
031720         10  DL1-VENDOR-NAME         PIC X(15) VALUE SPACES.      03172072
031800         10  FILLER                  PIC X(01) VALUE SPACES.      03180099
031900         10  DL1-PO-RCVR             PIC X(13) VALUE SPACES.      03190023
032000         10  FILLER                  PIC X(01) VALUE SPACES.      03200084
032100         10  DL1-RETAIL-AMT          PIC ZZZ,ZZ9.99.              03210094
032110         10  FILLER                  PIC X(02) VALUE SPACES.      03211099
032120         10  DL1-CARTON-SRC          PIC X(03) VALUE SPACES.      03212099
032200         10  FILLER                  PIC X(03) VALUE SPACES.      03220099
032300         10  DL1-TYP-CDE             PIC X(01) VALUE SPACES.      03230099
032310         10  FILLER                  PIC X(03) VALUE SPACES.      03231099
032320         10  DL1-TRBL-IND            PIC X(01) VALUE SPACES.      03232099
032400         10  FILLER                  PIC X(02) VALUE SPACES.      03240099
032410         10  DL1-SET-NAME            PIC X(05) VALUE SPACES.      03241096
032420         10  FILLER                  PIC X(02) VALUE SPACES.      03242096
032430         10  DL1-NEW-STR             PIC X(01) VALUE SPACES.      03243096
032440         10  FILLER                  PIC X(03) VALUE SPACES.      03244099
032500         10  DL1-VERIFIED-DATE       PIC X(08) VALUE SPACES.      03250096
032600         10  FILLER                  PIC X(02) VALUE SPACES.      03260096
032900         10  DL1-PROCESS-AREA        PIC X(06) VALUE SPACES.      03290004
033000         10  FILLER                  PIC X(02) VALUE SPACES.      03300023
033100         10  DL1-VRFD-STATUS         PIC X(05) VALUE SPACES.      03310007
033200         10  FILLER                  PIC X(02) VALUE SPACES.      03320004
033300         10  DL1-LOC-CDE             PIC X(05) VALUE SPACES.      03330004
033400         10  FILLER                  PIC X(03) VALUE SPACES.      03340072
033700         10  DL1-CARTONS-MFSTD       PIC ZZZ,ZZ9.                 03370026
033800         10  FILLER                  PIC X(02) VALUE SPACES.      03380099
033900         10  DL1-CARTONS-MISSING     PIC ZZZ,ZZ9.                 03390026
034000         10  FILLER                  PIC X(04) VALUE SPACES.      03400099
034100         10  DL1-PERCENT-MFSTD       PIC X(06) VALUE SPACES.      03410058
034200         10  FILLER                  PIC X(09) VALUE SPACES.      03420072
034300                                                                  03430004
034310 01  TOTAL-LINES.                                                 03431099
034320     05  TOTAL-LINE1.                                             03432099
034330         10  FILLER                  PIC X(10) VALUE SPACES.      03433099
034340         10  FILLER                  PIC X(06) VALUE 'TOTAL'.     03434099
034350         10  FILLER                  PIC X(18) VALUE SPACES.      03435099
034391         10  TL1-RETAIL-AMT          PIC $$,$$$,$$9.99.           03439199
034400                                                                  03440004
034500 01  MISCELLANEOUS-LINES.                                         03450004
034600     05  BLANK-LINE.                                              03460004
034700         10  FILLER                  PIC X(132) VALUE SPACES.     03470004
034800                                                                  03480004
034900     05  END-OF-REPORT-LINE.                                      03490004
035000         10  FILLER                  PIC X(44) VALUE SPACES.      03500004
035100         10  FILLER                  PIC X(45) VALUE              03510004
035200             '*******   E N D   O F   R E P O R T   *******'.     03520004
035300         10  FILLER                  PIC X(43) VALUE SPACES.      03530004
035400                                                                  03540004
035500     05  NO-DATA-TO-REPORT-LINE.                                  03550004
035600         10  FILLER                  PIC X(40) VALUE SPACES.      03560004
035700         10  FILLER                  PIC  X(52)    VALUE          03570004
035800         '*******  N O   D A T A   T O   R E P O R T   *******'.  03580004
035900         10  FILLER                  PIC  X(40)    VALUE SPACES.  03590004
036000                                                                  03600004
036100                                                                  03610004
036700******************************************************************03670004
036800*  USED FOR DB2 ERROR MESSAGE BUILDING                            03680004
036900******************************************************************03690004
037000     COPY DPWS004.                                                03700004
037100                                                                  03710004
037200******************************************************************03720004
037300*   DB2 SQL COMMUNICATION AREA                                    03730004
037400******************************************************************03740004
037500     EXEC SQL                                                     03750004
037600          INCLUDE SQLCA                                           03760004
037700     END-EXEC.                                                    03770004
037800                                                                  03780004
037900*---------------------------------------------------------------* 03790004
038000*  DCLGEN FOR THE LOGISTICS LOCATION TABLE                        03800004
038100*  XLT_LOC                                                        03810004
038200*---------------------------------------------------------------* 03820004
038300     EXEC SQL                                                     03830004
038400          INCLUDE XLT00010                                        03840004
038500     END-EXEC.                                                    03850004
038600                                                                  03860004
038700                                                                  03870004
038800******************************************************************03880004
038900 PROCEDURE DIVISION.                                              03890004
039000     DISPLAY '**** START OF SUKRP032 ****'.                       03900004
039100                                                                  03910004
039200*OPEN FILES.                                                      03920004
039300     OPEN INPUT  INPUT-FILE                                       03930004
039400          OUTPUT REPORT-FILE.                                     03940004
039500                                                                  03950004
039600     PERFORM 1000-INITIALIZATION.                                 03960005
039700                                                                  03970005
039800*READ FIRST RECORD.                                               03980005
039900     PERFORM 7000-READ-EXTRACT-FILE                               03990005
040000         MOVE SU046-ORGN-LOC-NBR        TO PV-SAVE-OPER-UNT-ID    04000011
040100                                                                  04010005
040200*PROCESS INPUT FILE.                                              04020005
040300     IF PS-END-OF-INPUT                                           04030005
040400        ADD +1                  TO PV-PAGE-COUNT                  04040014
040500        MOVE PV-PAGE-COUNT      TO DP132O-PAGE-NUMBER             04050014
040600        WRITE REPORT-RECORD                                       04060014
040700          FROM DP132O-STANDRD-HEADER-132-COLS                     04070014
040800            AFTER ADVANCING PAGE                                  04080014
040900        WRITE REPORT-RECORD                                       04090014
041000          FROM HEADING-LINE1                                      04100024
041100            AFTER ADVANCING 1 LINES                               04110072
041200        WRITE REPORT-RECORD                                       04120014
041300          FROM HEADING-LINE2                                      04130024
041400            AFTER ADVANCING 1 LINE                                04140014
041800        WRITE REPORT-RECORD                                       04180014
041900          FROM NO-DATA-TO-REPORT-LINE                             04190014
042000            AFTER ADVANCING 2 LINES                               04200014
042100     ELSE                                                         04210005
042200        MOVE SU046-ORGN-LOC-NBR TO PV-SAVE-OPER-UNT-ID            04220014
042300        PERFORM 8500-GET-LOCATION-NAME                            04230068
042400        PERFORM 1500-PRINT-HEADINGS                               04240014
042500        PERFORM 2000-PROCESS-INPUT UNTIL PS-END-OF-INPUT          04250014
043100     END-IF.                                                      04310005
043200                                                                  04320005
043300*FINISH REPORT.                                                   04330005
043310     PERFORM 2200-PRINT-TOTAL-LINE.                               04331099
043400     WRITE REPORT-RECORD                                          04340005
043500       FROM END-OF-REPORT-LINE                                    04350005
043600         AFTER ADVANCING 2 LINES.                                 04360005
043700                                                                  04370005
043800*CLOSE FILES.                                                     04380005
043900     CLOSE INPUT-FILE                                             04390005
044000           REPORT-FILE.                                           04400005
044100                                                                  04410005
044200     MOVE PV-READ-COUNT TO PV-DISPLAY-READ-COUNT.                 04420005
044300     DISPLAY 'TOTAL RECS READ ' PV-DISPLAY-READ-COUNT.            04430005
044400                                                                  04440005
044500     MOVE PV-WRITE-COUNT TO PV-DISPLAY-WRITE-COUNT.               04450005
044600     DISPLAY 'TOTAL RECS WRITTEN ' PV-DISPLAY-WRITE-COUNT.        04460005
044700                                                                  04470005
044800     GOBACK.                                                      04480005
044900                                                                  04490004
045000******************************************************************04500004
045100*  PERFORM THE INITIAL PROCESSING FOR THE PROGRAM.               *04510004
045200******************************************************************04520004
045300 1000-INITIALIZATION.                                             04530005
045400     ACCEPT SD-SYSTEM-DATE                                        04540007
045500       FROM DATE.                                                 04550007
045600                                                                  04560007
045700     ACCEPT SD-SYSTEM-TIME                                        04570007
045800       FROM TIME.                                                 04580007
045900                                                                  04590007
046000     MOVE SD-SYSTEM-DATE-MM  TO DP132O-RUN-MONTH.                 04600007
046100     MOVE SD-SYSTEM-DATE-DD  TO DP132O-RUN-DAY.                   04610007
046200     MOVE SD-SYSTEM-DATE-YY  TO DP132O-RUN-YEAR.                  04620007
046300     MOVE SD-SYSTEM-TIME-HH  TO DP132O-RUN-HOUR.                  04630007
046400     MOVE SD-SYSTEM-TIME-MM  TO DP132O-RUN-MINUTE.                04640007
046500                                                                  04650007
046600     MOVE PC-SUKRP032             TO DP132O-PROGRAM-NAME.         04660007
046700     MOVE PC-REPORT-NBR           TO DP132O-REPORT-NUMBER.        04670015
046800     MOVE +0                      TO PV-PAGE-COUNT.               04680007
046900                                                                  04690004
047000******************************************************************04700007
047100**  WRITES REPORT HEADER LINES FOR FIRST PAGE AND ANY SUBSEQUENT  04710007
047200**  PAGES (AS NEEDED).                                            04720007
047300******************************************************************04730007
047400 1500-PRINT-HEADINGS.                                             04740007
047500     ADD +1                  TO PV-PAGE-COUNT.                    04750007
047600     MOVE PV-PAGE-COUNT      TO DP132O-PAGE-NUMBER.               04760007
047700                                                                  04770007
047800     WRITE REPORT-RECORD                                          04780007
047900       FROM DP132O-STANDRD-HEADER-132-COLS                        04790007
048000         AFTER ADVANCING PAGE.                                    04800007
048100                                                                  04810007
048200     WRITE REPORT-RECORD                                          04820007
048300       FROM HEADING-LINE1                                         04830024
048400         AFTER ADVANCING 1 LINES.                                 04840072
048500                                                                  04850007
048600     WRITE REPORT-RECORD                                          04860007
048700       FROM HEADING-LINE2                                         04870024
048800         AFTER ADVANCING 1 LINE.                                  04880007
048900                                                                  04890007
049400     WRITE REPORT-RECORD                                          04940007
049500       FROM HEADING-LINE4                                         04950024
049600         AFTER ADVANCING 1 LINES.                                 04960072
049700                                                                  04970007
049800     WRITE REPORT-RECORD                                          04980017
049900       FROM BLANK-LINE                                            04990017
050000         AFTER ADVANCING 2 LINES.                                 05000017
050100                                                                  05010017
050200     WRITE REPORT-RECORD                                          05020007
050300       FROM HEADING-LINE5                                         05030024
050400         AFTER ADVANCING 1 LINES.                                 05040017
050500                                                                  05050007
050600     WRITE REPORT-RECORD                                          05060007
050700       FROM HEADING-LINE6                                         05070024
050800         AFTER ADVANCING 1 LINE.                                  05080007
050900                                                                  05090007
051000     WRITE REPORT-RECORD                                          05100007
051100       FROM HEADING-LINE7                                         05110024
051200         AFTER ADVANCING 1 LINE.                                  05120007
051300                                                                  05130007
051310     WRITE REPORT-RECORD                                          05131099
051320       FROM HEADING-LINE8                                         05132099
051330         AFTER ADVANCING 2 LINE.                                  05133099
051340                                                                  05134099
051400     WRITE REPORT-RECORD                                          05140007
051500       FROM BLANK-LINE                                            05150007
051600         AFTER ADVANCING 1 LINE.                                  05160007
051700                                                                  05170007
051800     MOVE +10                TO PV-LINE-COUNT.                    05180099
051900                                                                  05190007
052000******************************************************************05200006
052100**  READ INPUT-FILE, WHEN DC CHANGES, DO A PAGE BREAK             05210006
052200******************************************************************05220006
052300 2000-PROCESS-INPUT.                                              05230006
052400     IF SU046-ORGN-LOC-NBR         = PV-SAVE-OPER-UNT-ID          05240092
052500        PERFORM 2100-PRINT-DETAIL-LINE                            05250014
052600     ELSE                                                         05260007
052610        PERFORM 2200-PRINT-TOTAL-LINE                             05261099
052700        MOVE SU046-ORGN-LOC-NBR   TO PV-SAVE-OPER-UNT-ID          05270007
052900                                                                  05290006
053000        PERFORM 2500-PRINT-BLANK-LINE                             05300007
053100        PERFORM 8500-GET-LOCATION-NAME                            05310068
053200                                                                  05320007
053210        MOVE ZEROES  TO  PV-PAGE-COUNT                            05321082
053300        PERFORM 1500-PRINT-HEADINGS                               05330007
053310        PERFORM 2100-PRINT-DETAIL-LINE                            05331092
053400     END-IF                                                       05340006
053500                                                                  05350006
053600     PERFORM 7000-READ-EXTRACT-FILE.                              05360006
053700                                                                  05370006
053800******************************************************************05380004
053900*  FILL AND DETAIL REPORT LINE.                                  *05390004
054000******************************************************************05400004
054100 2100-PRINT-DETAIL-LINE.                                          05410006
054200                                                                  05420006
054300     MOVE SU046-ORGN-LOC-NBR           TO DL1-OPER-UNT-ID         05430072
054310     MOVE SU046-VENDOR-NAME            TO DL1-VENDOR-NAME         05431072
054400     IF SU046-CARTON-SOURCE = 'FXR'                               05440099
054410         MOVE SU046-TRN-NBR            TO PV-FORMAT-FXR           05441099
054411         MOVE PV-FORMAT-FXR-X          TO DL1-PO-RCVR             05441199
054420     ELSE                                                         05442099
054430         MOVE SU046-TRN-NBR            TO PV-PO                   05443099
054500         MOVE PC-DASH                  TO PV-DASH                 05450099
054600         MOVE SU046-RCVR-SEQ-NBR       TO PV-RCVR                 05460099
054700         MOVE PV-PO-RCVR               TO DL1-PO-RCVR             05470099
054701     END-IF.                                                      05470199
054702     MOVE SU046-RETAIL-AMT             TO PV-RETAIL-AMT           05470284
054703     MOVE PV-RETAIL-AMT                TO DL1-RETAIL-AMT          05470384
054704     ADD SU046-RETAIL-AMT              TO PV-TTL-RETAIL-CUM.      05470499
054710                                                                  05471073
054711     EVALUATE SU046-CARTON-SOURCE                                 05471173
054712         WHEN 'ASN'                                               05471274
054713              MOVE 'CKN'               TO DL1-CARTON-SRC          05471399
054735         WHEN OTHER                                               05473574
054736              MOVE SU046-CARTON-SOURCE TO DL1-CARTON-SRC          05473674
054737     END-EVALUATE.                                                05473773
054750                                                                  05475073
055000     IF SU046-TRBL-IND = 'N'                                      05500043
055100        MOVE SPACES TO DL1-TRBL-IND                               05510043
055200     ELSE                                                         05520043
055300        MOVE SU046-TRBL-IND               TO DL1-TRBL-IND         05530043
055400     END-IF                                                       05540043
055500                                                                  05550043
055600     MOVE SU046-SEASET-NAME            TO DL1-SET-NAME            05560098
055610     IF SU046-NEW-STR-YES                                         05561098
055620         MOVE SU046-NEW-STR-IND        TO DL1-NEW-STR             05562099
055630     ELSE                                                         05563097
055640         MOVE SPACES                   TO DL1-NEW-STR             05564097
055650     END-IF.                                                      05565097
055660     IF SU046-VERIFY-DATE NOT = SPACES                            05566099
055700         MOVE SU046-VERIFY-DATE        TO PV-VERIFY-DATE          05570099
055701         MOVE PV-VERIFY-DATE-YY        TO PV-FORMAT-DATE-YY       05570199
055702         MOVE PV-VERIFY-DATE-MM        TO PV-FORMAT-DATE-MM       05570299
055703         MOVE PV-VERIFY-DATE-DD        TO PV-FORMAT-DATE-DD       05570399
055710         MOVE PV-FORMAT-DATE           TO DL1-VERIFIED-DATE       05571099
055720     ELSE                                                         05572099
055721         MOVE SPACES                   TO DL1-VERIFIED-DATE       05572199
055730     END-IF.                                                      05573099
055800     MOVE SU046-PRC-AREA-ID            TO DL1-PROCESS-AREA.       05580099
055810     MOVE SU046-TYP-CDE                TO DL1-TYP-CDE.            05581099
055900                                                                  05590020
056810     EVALUATE TRUE                                                05681099
056820        WHEN SU046-VRFD-STATUS = 'S'                              05682099
056830           MOVE PC-SOME                   TO DL1-VRFD-STATUS      05683099
056840        WHEN SU046-VRFD-STATUS = 'A'                              05684099
056850           MOVE PC-ALL                    TO DL1-VRFD-STATUS      05685099
056860        WHEN SU046-VRFD-STATUS = 'N'                              05686099
056870           MOVE PC-NONE                   TO DL1-VRFD-STATUS      05687099
056880     END-EVALUATE                                                 05688099
056890                                                                  05689099
056900     MOVE SU046-LNE-LOC-CDE            TO DL1-LOC-CDE             05690007
057100     MOVE SU046-NBR-CRTNS-MFSTD        TO DL1-CARTONS-MFSTD       05710007
057200     MOVE SU046-NBR-CRTNS-NO-TRLR      TO DL1-CARTONS-MISSING     05720059
057300                                                                  05730032
057400*PERCENT OF VERIFIED CARTONS MANIFESTED TO A TRAILER              05740032
057500     IF SU046-NBR-CRTNS-MFSTD    > ZERO AND                       05750072
057600        SU046-NBR-CRTNS-NO-TRLR  > ZERO                           05760072
057900                                                                  05790042
057910        SUBTRACT SU046-NBR-CRTNS-NO-TRLR                          05791077
057920            FROM SU046-NBR-CRTNS-MFSTD                            05792079
057930          GIVING PV-ATTACH-TO-TRLR                                05793075
057940                                                                  05794075
057950         IF  PV-ATTACH-TO-TRLR     >  0  AND                      05795080
057960             SU046-NBR-CRTNS-MFSTD > 0                            05796080
058000             DIVIDE PV-ATTACH-TO-TRLR                             05800078
058100                 BY SU046-NBR-CRTNS-MFSTD                         05810080
058200                GIVING PV-DIVIDEND ROUNDED                        05820078
058300             MULTIPLY PV-DIVIDEND BY 100                          05830078
058400                GIVING PV-PERCENT-MFSTD                           05840078
058500                MOVE PV-PERCENT-MFSTD     TO DL1-PERCENT-MFSTD    05850078
058510         ELSE                                                     05851078
058520             MOVE ZEROES TO PV-DIVIDEND                           05852078
058530             MOVE PC-0   TO DL1-PERCENT-MFSTD                     05853078
058600         END-IF                                                   05860078
058610     ELSE                                                         05861078
058700        MOVE ZEROES TO PV-DIVIDEND                                05870034
058800        MOVE PC-0   TO DL1-PERCENT-MFSTD                          05880057
058900     END-IF                                                       05890034
059000                                                                  05900032
059100*CHECK FOR OVERFLOW                                               05910014
059200*ADD +2 TO LINE COUNT SINCE RPT IS DOUBLE SPACED                  05920046
059300                                                                  05930046
059400     ADD +2 TO PV-LINE-COUNT.                                     05940046
059500     IF PV-LINE-COUNT > PC-MAX-LINE-COUNT                         05950007
059600         PERFORM 1500-PRINT-HEADINGS                              05960007
059700     END-IF.                                                      05970006
059800                                                                  05980006
059900     WRITE REPORT-RECORD                                          05990006
060000       FROM DETAIL-LINE1                                          06000006
060100         AFTER ADVANCING 2 LINES.                                 06010032
060200     ADD +1 TO PV-WRITE-COUNT.                                    06020006
060300                                                                  06030006
060301     ADD +2 TO PV-LINE-COUNT.                                     06030199
060302                                                                  06030299
060310******************************************************************06031099
060320*  FILL AND TOTAL REPORT LINE.                                  * 06032099
060330******************************************************************06033099
060340 2200-PRINT-TOTAL-LINE.                                           06034099
060350                                                                  06035099
060393     MOVE PV-TTL-RETAIL-CUM     TO PV-TTL-RETAIL-AMT.             06039399
060394     MOVE PV-TTL-RETAIL-AMT     TO TL1-RETAIL-AMT.                06039499
060395     INITIALIZE PV-TTL-RETAIL-CUM.                                06039599
060396                                                                  06039699
060397     WRITE REPORT-RECORD                                          06039799
060398       FROM TOTAL-LINE1                                           06039899
060399         AFTER ADVANCING 2 LINES.                                 06039999
060400                                                                  06040099
060401     ADD +2 TO PV-LINE-COUNT.                                     06040199
060402                                                                  06040299
060410****************************************************************  06041007
060500* PRINTS A BLANK LINE                                          *  06050007
060600****************************************************************  06060007
060700 2500-PRINT-BLANK-LINE.                                           06070007
060800                                                                  06080007
060900        WRITE REPORT-RECORD                                       06090007
061000          FROM BLANK-LINE                                         06100007
061100            AFTER ADVANCING 1 LINE                                06110007
061200                                                                  06120007
061300     ADD +1 TO PV-LINE-COUNT.                                     06130007
061400                                                                  06140007
061500******************************************************************06150004
061600*  READ A RECORD FROM THE TRAILER SUSPENSE UNLOAD FILE.          *06160004
061700******************************************************************06170004
061800 7000-READ-EXTRACT-FILE.                                          06180004
061900     READ INPUT-FILE INTO SU046-EXTRACT-RECORD                    06190007
062000         AT END                                                   06200004
062100             SET PS-END-OF-INPUT TO TRUE                          06210004
062200         NOT AT END                                               06220004
062300             ADD +1 TO PV-READ-COUNT                              06230004
062400     END-READ.                                                    06240004
062500                                                                  06250007
062600******************************************************************06260006
062700 8500-GET-LOCATION-NAME.                                          06270068
062800******************************************************************06280007
062801                                                                  06280168
062802     MOVE PV-SAVE-OPER-UNT-ID  TO  XLT00010-LOC-NBR.              06280268
062803                                                                  06280368
062810     EXEC SQL                                                     06281068
062820         SELECT   LOC_NM                                          06282068
062830           INTO  :XLT00010-LOC-NM                                 06283068
062840           FROM   XLT_LOC                                         06284068
062860          WHERE   LOC_NBR  =  :XLT00010-LOC-NBR                   06286068
062870        WITH UR                                                   06287099
062892     END-EXEC.                                                    06289268
062893                                                                  06289368
062894     EVALUATE TRUE                                                06289468
062895         WHEN SQLCODE = +0                                        06289568
062896             MOVE PV-SAVE-OPER-UNT-ID TO HL4-DC-NBR               06289668
062897             MOVE XLT00010-LOC-NM     TO HL4-DC-DESC              06289769
062907                                                                  06290768
062911         WHEN OTHER                                               06291168
062912              MOVE SQLCODE             TO PV-DISPLAY-SQLCODE      06291268
062915              MOVE XLT00010-LOC-NBR    TO  PV-DISPLAY-OPER        06291569
062916              MOVE '8500-GET-LOCATION-NAME'                       06291668
062917                                       TO  PV-ABEND-PARAGRAPH     06291768
062918              MOVE 'XLT_LOC'           TO  PV-DB2-TABLE-NAME1     06291868
062920                                                                  06292068
062921              DISPLAY '** ABEND **'                               06292168
062922              DISPLAY '** PROGRAM ** = ' PC-SUKRP032              06292268
062924              DISPLAY '** OPER    ** = ' PV-DISPLAY-OPER          06292469
062932                                                                  06293268
062933              DISPLAY '** PARAGRAPH ** = ' PV-ABEND-PARAGRAPH     06293368
062935              DISPLAY '** DB2 TABLE ** = ' PV-DB2-TABLE-NAME1     06293568
062937              DISPLAY '** SQLCODE   ** = ' PV-DISPLAY-SQLCODE     06293768
062938                                                                  06293868
062939              MOVE +4013                  TO PV-ABEND-CODE        06293968
062940              CALL 'ILBOABN0' USING PV-ABEND-CODE                 06294068
062941     END-EVALUATE.                                                06294168
062943                                                                  06294368
066400                                                                  06640068
066500******************************************************************06650006
066600*  ABEND ROUTINE                                                 *06660006
066700******************************************************************06670006
066800 9900-DB2-ABEND.                                                  06680006
066900                                                                  06690006
067000     MOVE SQLCODE TO PV-SQLCODE.                                  06700006
067100     DISPLAY '*** DB2 ERROR '.                                    06710006
067200     DISPLAY '*** SQLCODE   = ' PV-SQLCODE.                       06720006
067300     DISPLAY '*** PROGRAM   = ' PV-ABEND-PROGRAM.                 06730006
067400     DISPLAY '*** PARAGRAPH = ' PV-ABEND-PARAGRAPH.               06740006
067500     DISPLAY '*** OPERATION = ' PV-ABEND-OPERATION.               06750006
067600     DISPLAY '*** MESSAGE   = ' PV-DB2-OPERATION-MESSAGE-1.       06760006
067700     DISPLAY '***           = ' PV-DB2-OPERATION-MESSAGE-2.       06770006
067800     DISPLAY '*** TABLE 1   = ' PV-DB2-TABLE-NAME-1.              06780006
067900     DISPLAY '*** TABLE 2   = ' PV-DB2-TABLE-NAME-2.              06790006
068000                                                                  06800006
068100     DISPLAY 'PURCH ORDER   = ' PV-DISPLAY-PO-NBR                 06810006
068200     DISPLAY 'REC SEQ NBR   = ' PV-DISPLAY-RCVR-SEQ-NBR           06820006
068300     DISPLAY 'OPER UNT ID   = ' PV-DISPLAY-OPER                   06830006
068400     COPY DPPD004.                                                06840006
068500                                                                  06850006
068600     MOVE +4013 TO PV-ABEND-CODE.                                 06860006
068700     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         06870006
068800                                                                  06880006
068900 9999-ABEND.                                                      06890006
069000                                                                  06900006
069100     DISPLAY '***************'.                                   06910006
069200     DISPLAY '** ABEND     **'.                                   06920006
069300     DISPLAY '** PROGRAM   ** = ' PV-ABEND-PROGRAM.               06930006
069400     DISPLAY '** PARAGRAPH ** = ' PV-ABEND-PARAGRAPH.             06940006
069500     DISPLAY '***************'.                                   06950006
069600                                                                  06960006
069700     MOVE +4008                  TO PV-ABEND-CODE.                06970006
069800     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         06980006
069900                                                                  06990006
070000******************************************************************07000006
070100*                 E N D   O F   P R O G R A M                    *07010006
070200******************************************************************07020006
