000100***************************************************************** 00010001
000200 IDENTIFICATION DIVISION.                                         00020001
000300***************************************************************** 00030001
000400*                                                                 00040001
000500 PROGRAM-ID.             SUKRP048.                                00050001
000600 AUTHOR.                 LARRY SCHLEICHER.                        00060001
000700 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00070001
000800 DATE-WRITTEN.           MARCH 2006.                              00080001
000900 DATE-COMPILED.                                                   00090001
001000*                                                                 00100001
001100***************************************************************** 00110001
001200*  THIS PROGRAM WILL BE USED TO CREATE A REPORT LISTING ALL OF THE00120001
001300*  INACTIVE CARTONS LOADED TO OUTBOUND TRAILER.                   00130001
001400***************************************************************** 00140001
001500 ENVIRONMENT DIVISION.                                            00150001
001600***************************************************************** 00160001
001700 CONFIGURATION SECTION.                                           00170001
001800 SOURCE-COMPUTER.                        IBM-3090.                00180001
001900 OBJECT-COMPUTER.                        IBM-3090.                00190001
002000 INPUT-OUTPUT SECTION.                                            00200001
002100 FILE-CONTROL.                                                    00210001
002200                                                                  00220001
002300     SELECT EXTRACT-FILE                                          00230001
002400         ASSIGN TO INP01.                                         00240001
002500                                                                  00250001
002600     SELECT REPORT-FILE-1                                         00260001
002700         ASSIGN TO RPT01.                                         00270001
002800                                                                  00280001
002900***************************************************************** 00290001
003000 DATA DIVISION.                                                   00300001
003100***************************************************************** 00310001
003200 FILE SECTION.                                                    00320001
003300                                                                  00330001
003400 FD  EXTRACT-FILE                                                 00340001
003500     RECORDING MODE IS F                                          00350001
003600     LABEL RECORDS ARE STANDARD                                   00360001
003700     BLOCK CONTAINS 0 RECORDS.                                    00370001
003800 01  EXTRACT-RECORD                   PIC X(100).                 00380004
003900                                                                  00390001
004000 FD  REPORT-FILE-1                                                00400001
004100     RECORDING MODE IS F                                          00410001
004200     BLOCK CONTAINS 0 RECORDS.                                    00420001
004300 01  REPORT-RECORD-1                  PIC X(132).                 00430001
004400                                                                  00440001
004500/                                                                 00450001
004600***************************************************************** 00460001
004700 WORKING-STORAGE SECTION.                                         00470001
004800***************************************************************** 00480001
004900                                                                  00490001
005000 01  PS-SWITCHES.                                                 00500001
005100     05  PS-PRINT-DETAILS-SW          PIC X(01) VALUE 'N'.        00510001
005200         88  PS-PRINT-DETAILS                   VALUE 'Y'.        00520001
005300         88  PS-NOT-PRINT-DETAILS               VALUE 'N'.        00530001
005400     05  PS-END-OF-INPUT-FILE-SW      PIC X(01) VALUE 'N'.        00540001
005500         88  PS-END-OF-INPUT                    VALUE 'Y'.        00550001
005600         88  PS-NOT-END-OF-INPUT                VALUE 'N'.        00560001
005700     05  PS-PAGE-SW                   PIC X(01) VALUE 'N'.        00570001
005800         88  PS-NEW-PAGE                        VALUE 'Y'.        00580001
005900         88  PS-SAME-PAGE                       VALUE 'N'.        00590001
006000     05  PS-SAME-KEY-SW               PIC X(01) VALUE 'N'.        00600001
006100         88  PS-SAME-KEY                        VALUE 'Y'.        00610001
006200         88  PS-NOT-SAME-KEY                    VALUE 'N'.        00620001
006300                                                                  00630001
006400 01  DK-DB2-KEYS.                                                 00640001
006500     05  DK-RUN-DATE                  PIC X(10).                  00650001
006600     05  DK-WEEK-END-DATE             PIC X(10).                  00660001
006700     05  DK-OPER-ID                   PIC S9(4) COMP.             00670001
006800     05  DK-DB2-TMST-1                PIC X(26).                  00680001
006900     05  DK-DB2-TMST-2                PIC X(26).                  00690001
007000                                                                  00700001
007100 01  DN-NULL-INDICATORS.                                          00710001
007200     05  DN-LOC-NULL                  PIC S9(04) COMP VALUE ZERO. 00720001
007300     05  DN-CART-NULL                 PIC S9(04) COMP VALUE ZERO. 00730001
007400     05  DN-DOOR-NULL                 PIC S9(04) COMP VALUE ZERO. 00740001
007500                                                                  00750001
007600 01  PV-DATE-RECORD.                                              00760001
007700     05  PV-FROM-DATE                 PIC X(10) VALUE SPACES.     00770001
007800     05  FILLER                       PIC X(01) VALUE SPACES.     00780001
007900     05  PV-TO-DATE                   PIC X(10) VALUE SPACES.     00790001
008000                                                                  00800001
008100 01  SD-SYSTEM-DATE.                                              00810001
008200     05  SD-SYSTEM-DATE-YY          PIC  9(02)   VALUE ZERO.      00820001
008300     05  SD-SYSTEM-DATE-MM          PIC  9(02)   VALUE ZERO.      00830001
008400     05  SD-SYSTEM-DATE-DD          PIC  9(02)   VALUE ZERO.      00840001
008500                                                                  00850001
008600 01  ST-SYSTEM-TIME.                                              00860001
008700     05  ST-SYSTEM-HOUR             PIC  9(02)   VALUE ZERO.      00870001
008800     05  ST-SYSTEM-MINUTE           PIC  9(02)   VALUE ZERO.      00880001
008900     05  FILLER                     PIC  9(04)   VALUE ZERO.      00890001
009000                                                                  00900001
009100 01  PV-VARIABLES.                                                00910001
009200     05  PV-SCAN-OFF-TMST             PIC X(26).                  00920001
009300     05  PV-READ-COUNT                PIC S9(7) COMP-3            00930001
009400                                                VALUE ZERO.       00940001
009700     05  PV-REC-READ-QTY              PIC S9(7) COMP-3            00970001
009800                                                VALUE ZERO.       00980001
009900     05  PV-WRITE-COUNT               PIC S9(7) COMP-3            00990001
010000                                                VALUE ZERO.       01000001
010100     05  PV-PAGE-COUNT                PIC S9(3) COMP-3            01010001
010200                                                VALUE ZERO.       01020001
010300     05  PV-LINE-COUNT                PIC S9(04) VALUE ZERO       01030001
010400                                                 COMP SYNC.       01040001
010500     05  PV-TRANS-QTY                 PIC S9(07) VALUE ZERO       01050001
010600                                                 COMP SYNC.       01060001
010700     05  PV-DC-TRANS-QTY              PIC S9(07) VALUE ZERO       01070001
010800                                                 COMP SYNC.       01080001
010900                                                                  01090001
011000***************************************************************   01100001
011100     05  PV-TOTAL-DIVERTS            PIC S9(07) VALUE ZERO        01110001
011200                                                 COMP SYNC.       01120001
011300     05  PV-SHIPPING-DOOR             PIC S9(07) VALUE ZERO       01130001
011400                                                 COMP SYNC.       01140001
011500     05  PV-STORAGE-DOOR              PIC S9(07) VALUE ZERO       01150001
011600                                                 COMP SYNC.       01160001
011700     05  PV-SHUTTLE-DOOR              PIC S9(07) VALUE ZERO       01170001
011800                                                 COMP SYNC.       01180001
011900     05  PV-OTHER                     PIC S9(07) VALUE ZERO       01190001
012000                                                 COMP SYNC.       01200001
012100     05  PV-DUPLICATE-DIVERTS         PIC S9(07) VALUE ZERO       01210001
012200                                                 COMP SYNC.       01220001
012300     05  PV-NO-INFO-DIVERTS           PIC S9(07) VALUE ZERO       01230001
012400                                                 COMP SYNC.       01240001
012500     05  PV-INACTIVE-DIVERTS          PIC S9(07) VALUE ZERO       01250001
012600                                                 COMP SYNC.       01260001
012700                                                                  01270001
012800***************************************************************   01280001
012900     05  PV-DISPLAY-COUNT             PIC ZZZ,ZZZ,ZZ9.            01290001
013000     05  PV-STORE-NBR                 PIC S9(4) COMP.             01300001
013100     05  PV-STORE-NAME                PIC X(25) VALUE SPACES.     01310001
013200     05  PV-LOCATION-NBR              PIC 9(04) VALUE ZEROS.      01320001
013300     05  PV-OPER-ID                   PIC S9(04) COMP.            01330001
013400     05  PV-PREV-OPER-ID              PIC S9(04) COMP.            01340001
013500     05  PV-PO-NBR                    PIC S9(09) COMP.            01350001
013600     05  PV-PREV-PO-NBR               PIC S9(09) COMP.            01360001
013700     05  PV-RCVR-SEQ                  PIC S9(04) COMP.            01370001
013800     05  PV-PREV-RCVR-SEQ             PIC S9(04) COMP.            01380001
013900     05  PV-SHIPT-UNT-ID              PIC S9(18) COMP-3           01390001
014000                                                VALUE ZERO.       01400001
014100     05  PV-PREV-SHIPT-UNT-ID         PIC S9(18) COMP-3           01410001
014200                                                VALUE ZERO.       01420001
014300     05  PV-DISP-SHIPT-UNT-ID.                                    01430001
014400         10  PV-DISP-SHIPT-UNT-ID-N   PIC 9(18) VALUE ZERO.       01440001
014500     05  PV-PREV-ERR-CDE              PIC X(03) VALUE SPACES.     01450001
014700                                                                  01470001
014800     05  PV-DB2-FUNCTION              PIC X(30) VALUE SPACES.     01480001
014900     05  PV-DB2-TABLE-NAME            PIC X(30) VALUE SPACES.     01490001
015000     05  PV-PARAGRAPH                 PIC X(30) VALUE SPACES.     01500001
015100     05  PV-DISPLAY-HOST-VAR          PIC X(18) VALUE SPACES.     01510001
015200     05  PV-DISP-NUMBER               PIC Z,ZZZ,ZZ9.              01520001
015300     05  PV-DISP-OPER-ID              PIC  9(4).                  01530001
015400                                                                  01540001
015500     05  PV-RUN-DATE                  PIC X(10) VALUE SPACES.     01550001
015600     05  PV-SAVE-START-DATE           PIC X(10) VALUE SPACES.     01560001
015700     05  PV-ERROR-MESSAGE-1           PIC X(60)  VALUE SPACES.    01570001
015800     05  PV-ERROR-MESSAGE-2           PIC X(60)  VALUE SPACES.    01580001
015900     05  PV-DB2-YEAR                  PIC S9(08) COMP             01590001
016000                                          VALUE ZERO.             01600001
016100     05  PV-DB2-MONTH                 PIC S9(08) COMP             01610001
016200                                          VALUE ZERO.             01620001
016300     05  PV-DB2-DAY                   PIC S9(08) COMP             01630001
016400                                          VALUE ZERO.             01640001
016500     05  PV-DB2-HOUR                  PIC S9(08) COMP             01650001
016600                                          VALUE ZERO.             01660001
016700     05  PV-DB2-MINUTE                PIC S9(08) COMP             01670001
016800                                          VALUE ZERO.             01680001
016900     05  PV-DB2-SECOND                PIC S9(08) COMP             01690001
017000                                          VALUE ZERO.             01700001
017100                                                                  01710001
017200     05  PV-DOOR.                                                 01720022
               10  FILLER                   PIC X(05) VALUE 'DOOR-'.    01721022
               10  PV-DIVERT-DOOR           PIC X(04).                  01722023
517300                                                                  01730022
017400******************************************************************01740001
017500 01  PV-DATE-FIELD.                                               01750001
017600     05  PV-DB2-TMST.                                             01760001
017700         10 PV-DB2-TMST-CCYY          PIC  9(04).                 01770001
017800         10 FILLER                    PIC  X(01).                 01780001
017900         10 PV-DB2-TMST-MM            PIC  9(02).                 01790001
018000         10 FILLER                    PIC  X(01).                 01800001
018100         10 PV-DB2-TMST-DD            PIC  9(02).                 01810001
018200         10 FILLER                    PIC  X(01).                 01820001
018300         10 PV-DB2-TMST-HH            PIC  9(02).                 01830001
018400         10 FILLER                    PIC  X(01).                 01840001
018500         10 PV-DB2-TMST-MN            PIC  9(02).                 01850001
018600         10 FILLER                    PIC  X(01).                 01860001
018700         10 PV-DB2-TMST-SS            PIC  9(02).                 01870001
018800         10 FILLER                    PIC  X(07).                 01880001
018900     05  PV-FORMAT-DATE.                                          01890001
019000         10 PV-FORMAT-DATE-MM         PIC  9(02).                 01900001
019100         10 FILLER                    PIC  X(01) VALUE '/'.       01910001
019200         10 PV-FORMAT-DATE-DD         PIC  9(02).                 01920001
019300         10 FILLER                    PIC  X(01) VALUE '/'.       01930001
019400         10 PV-FORMAT-DATE-CCYY       PIC  9(04).                 01940001
019500                                                                  01950001
019600     05  PV-DB2-TMST-1.                                           01960001
019700         10  PV-DB2-DATE-1                PIC X(10) VALUE SPACES. 01970001
019800         10  FILLER                       PIC X(16) VALUE         01980001
019900                              '-00.00.00.000000'.                 01990001
020000     05  PV-DB2-TMST-2.                                           02000001
020100         10  PV-DB2-DATE-2                PIC X(10) VALUE SPACES. 02010001
020200         10  FILLER                       PIC X(16) VALUE         02020001
020300                              '-23.59.59.999999'.                 02030001
020400                                                                  02040001
020500                                                                  02050001
020600 01  PV-ABEND-FIELDS.                                             02060001
020700     05  PV-ABEND-CODE                PIC S9(04) VALUE +0         02070001
020800                                                 COMP SYNC.       02080001
020900     05  PV-ABEND-PROGRAM             PIC  X(08) VALUE 'SUKRP048'.02090003
021000     05  PV-ABEND-PARAGRAPH           PIC  X(50) VALUE SPACES.    02100001
021100     05  PV-ABEND-OPERATION           PIC  X(51) VALUE SPACES.    02110001
021200     05  PV-ABEND-STRUCTURE-1         PIC X(8)   VALUE SPACES.    02120001
021300     05  PV-ABEND-STRUCTURE-2         PIC X(8)   VALUE SPACES.    02130001
021400     05  PV-ABEND-STRUCTURE-3         PIC X(8)   VALUE SPACES.    02140001
021500     05  PV-DB2-OPERATION-MESSAGE-1   PIC  X(79) VALUE SPACES.    02150001
021600     05  PV-DB2-OPERATION-MESSAGE-2   PIC  X(79) VALUE SPACES.    02160001
021700     05  PV-DB2-OPERATION-MESSAGE-3   PIC  X(79) VALUE SPACES.    02170001
021800     05  PV-DB2-OPERATION-ATTEMPTED   PIC  X(30)  VALUE SPACE.    02180001
021900/                                                                 02190001
022000 01  PC-CONSTANTS.                                                02200001
022100     05  PC-SUKRP048                  PIC X(08) VALUE 'SUKRP048'. 02210001
022200     05  PC-CURRENT-PROGRAM-NAME      PIC X(08) VALUE 'SUKRP048'. 02220001
022300     05  PC-END-OF-PAGE               PIC S9(3) COMP-3 VALUE +60. 02230001
022400     05  PC-MAX-LINE-COUNT            PIC S9(3) VALUE +60         02240001
022500                                                COMP-3.           02250001
022600/                                                                 02260001
022700******************************************************************02270001
022800*  WORK FIELDS FOR PRINTING A 132 CHARACTER REPORT.               02280001
022900******************************************************************02290001
023000     COPY DPWS132O.                                               02300001
023100*                                                                 02310001
023200 01  HL-HEADING-LINE-1.                                           02320001
023300     05  FILLER                      PIC  X(41).                  02330001
023400     05  FILLER                      PIC  X(50)  VALUE            02340001
023500      'DAILY - INACTIVE CARTON LOADED TO OUTBOUND TRAILER'.       02350001
023600                                                                  02360001
023700 01  HL-HEADING-LINE-2.                                           02370001
023800     05  FILLER                      PIC  X(16)  VALUE            02380001
023900            '  DC LOCATION:  '.                                   02390001
024000     05  HL2-LOCATION.                                            02400001
024100         10  HL2-OPER-ID             PIC  X(04) VALUE SPACES.     02410001
024200         10  FILLER                  PIC  X(01) VALUE SPACES.     02420001
024300         10  FILLER                  PIC  X(01) VALUE '-'.        02430001
024400         10  FILLER                  PIC  X(01) VALUE SPACES.     02440001
024500         10  HL2-LOC-DESC            PIC  X(25) VALUE SPACES.     02450001
024600                                                                  02460001
024700 01  HL-HEADING-LINE-3.                                           02470001
024800     05  FILLER                      PIC  X(38)  VALUE            02480005
024900      '  PURCHASE RCVR                       '.                   02490005
025000     05  FILLER                      PIC  X(55)  VALUE            02500001
025100      'OUTBOUND   CRE  INACTIVE  INACTIVE     ACTIVE  INACTIVE'.  02510001
025200     05  FILLER                      PIC  X(40)  VALUE            02520005
025300      '   STR LINE       SUB                   '.                 02530005
025400                                                                  02540001
025500 01  HL-HEADING-LINE-4.                                           02550001
025600     05  FILLER                      PIC  X(38)  VALUE            02560005
025700      '   ORDER    NBR  SML NUMBER           '.                   02570005
025800     05  FILLER                      PIC  X(55)  VALUE            02580001
025900      '  TRIP     SRC  USER ID    REASON     CARTONS  CARTONS '.  02590001
026000     05  FILLER                      PIC  X(40)  VALUE            02600005
026100      '   NBR  NBR  DEPT CLS   SKU     UNITS   '.                 02610005
026200                                                                  02620001
026300 01  DL-DETAIL-LINE-1.                                            02630001
026400     05  FILLER                       PIC X(01) VALUE SPACES.     02640001
026500     05  DL1-PO-NBR                   PIC Z(09).                  02650001
026600     05  FILLER                       PIC X(01) VALUE SPACES.     02660001
026700     05  DL1-RCVR-SEQ                 PIC Z(04).                  02670001
026800     05  FILLER                       PIC X(02) VALUE SPACES.     02680001
026900     05  DL1-SHIPT-UNT-ID             PIC 9(20).                  02690006
027000     05  FILLER                       PIC X(01) VALUE SPACES.     02700001
027100     05  DL1-OUTBOUND-TRIP            PIC Z(09).                  02710001
027100     05  DL1-DOOR REDEFINES DL1-OUTBOUND-TRIP                     02711021
027200                                      PIC X(09).                  02720021
027200     05  FILLER                       PIC X(02) VALUE SPACES.     02721021
027300     05  DL1-SRC-ID                   PIC X(03).                  02730001
027400     05  FILLER                       PIC X(02) VALUE SPACES.     02740001
027500     05  DL1-INACTIVE-USER-ID         PIC X(08).                  02750001
027600     05  FILLER                       PIC X(01) VALUE SPACES.     02760001
027700     05  DL1-INACTIVE-REASON          PIC X(12).                  02770001
027800     05  FILLER                       PIC X(01) VALUE SPACES.     02780001
027900     05  DL1-ACTIVE-CARTONS           PIC ZZZ,ZZ9.                02790001
028000     05  FILLER                       PIC X(02) VALUE SPACES.     02800001
028100     05  DL1-INACTIVE-CARTONS         PIC ZZZ,ZZ9.                02810001
028200     05  FILLER                       PIC X(03) VALUE SPACES.     02820001
028300     05  DL1-DEST-OPER-UNIT-ID        PIC ZZZZ.                   02830001
028400     05  FILLER                       PIC X(01) VALUE SPACES.     02840001
028500     05  DL1-LINE-NBR                 PIC ZZZZ.                   02850001
028600     05  FILLER                       PIC X(02) VALUE SPACES.     02860001
028700     05  DL1-DEPT-NUMBER              PIC ZZZZ.                   02870001
028800     05  FILLER                       PIC X(01) VALUE SPACES.     02880001
028900     05  DL1-SUB-CLASS                PIC ZZ.                     02890001
029000     05  FILLER                       PIC X(02) VALUE SPACES.     02900001
029100     05  DL1-SKU                      PIC Z(08).                  02910001
029200     05  FILLER                       PIC X(02) VALUE SPACES.     02920001
029300     05  DL1-UNIT-COUNT               PIC ZZZZ.                   02930001
029400     05  FILLER                       PIC X(02) VALUE SPACES.     02940001
029500                                                                  02950001
029600 01  DL-DETAIL-LINE-2.                                            02960001
029700     05  FILLER                       PIC X(100) VALUE SPACES.    02970016
029800     05  DL2-LINE-NBR                 PIC ZZZZ.                   02980001
029900     05  FILLER                       PIC X(02) VALUE SPACES.     02990001
030000     05  DL2-DEPT-NUMBER              PIC ZZZZ.                   03000001
030100     05  FILLER                       PIC X(01) VALUE SPACES.     03010001
030200     05  DL2-SUB-CLASS                PIC ZZ.                     03020001
030300     05  FILLER                       PIC X(02) VALUE SPACES.     03030001
030400     05  DL2-SKU                      PIC Z(08).                  03040001
030500     05  FILLER                       PIC X(02) VALUE SPACES.     03050001
030600     05  DL2-UNIT-COUNT               PIC ZZZZ.                   03060001
030700     05  FILLER                       PIC X(03) VALUE SPACES.     03070016
030800                                                                  03080001
030900 01  ER-END-OF-REPORT-LINE.                                       03090001
031000     05  FILLER                       PIC X(19)  VALUE            03100001
031100         '** END OF REPORT **'.                                   03110001
031200     05  FILLER                       PIC X(113)  VALUE SPACES.   03120001
031300                                                                  03130001
031400 01  EP-EMPTY-REPORT-LINE.                                        03140001
031500     05  FILLER                       PIC X(34)  VALUE SPACES.    03150001
031600     05  FILLER                       PIC X(52)  VALUE            03160001
031700      '*************** EMPTY INPUT FILE *******************'.     03170001
031800     05  FILLER                       PIC X(49)  VALUE SPACES.    03180001
031900                                                                  03190001
032000 01  DL-BLANK-LINE                    PIC X(132) VALUE SPACES.    03200001
032100                                                                  03210001
032200 01  EL1-ERROR-LINE-1P.                                           03220001
032300     05  FILLER                      PIC  X(02)     VALUE SPACES. 03230001
032400     05  FILLER                      PIC  X(48)     VALUE         03240001
032500         'A PROBLEM WAS ENCOUNTERED DURING THE PROCESS OF '.      03250001
032600     05  FILLER                      PIC  X(49)     VALUE         03260001
032700         'CREATING YOUR REPORT.   THIS REPORT COULD NOT BE '.     03270001
032800     05  FILLER                      PIC  X(33)     VALUE         03280001
032900         'COMPLETED.                       '.                     03290001
033000                                                                  03300001
033100 01  EL2-ERROR-LINE-2F.                                           03310001
033200     05  FILLER                      PIC  X(02)     VALUE SPACES. 03320001
033300     05  FILLER                      PIC  X(36)     VALUE         03330001
033400         'NONE OF YOUR REPORTS WERE CREATED.  '.                  03340001
033500     05  FILLER                      PIC  X(36)     VALUE         03350001
033600         'PLEASE RE-SUBMIT YOUR REQUEST AGAIN.'.                  03360001
033700     05  FILLER                      PIC  X(58)     VALUE SPACES. 03370001
033800                                                                  03380001
033900 01  EL3-ERROR-LINE-3.                                            03390001
034000     05  FILLER                      PIC  X(02)     VALUE SPACES. 03400001
034100     05  FILLER                      PIC  X(50)     VALUE         03410001
034200         'YOUR REQUEST WAS AS FOLLOWS:                      '.    03420001
034300     05  FILLER                      PIC  X(81)     VALUE SPACES. 03430001
034400                                                                  03440001
034500 01  EL4-ERROR-LINE-4.                                            03450001
034600     05  FILLER                      PIC  X(02)     VALUE SPACES. 03460001
034700     05  FILLER                      PIC  X(18)     VALUE         03470001
034800         'REQUESTOR       : '.                                    03480001
034900     05  EL4-REQUESTOR-ID            PIC  X(10)     VALUE SPACES. 03490001
035000     05  FILLER                      PIC  X(07)     VALUE SPACES. 03500001
035100     05  FILLER                      PIC  X(21)     VALUE         03510001
035200         'PRINTER DESTINATION: '.                                 03520001
035300     05  EL4-PRINTER-ID              PIC  X(10)     VALUE SPACES. 03530001
035400     05  FILLER                      PIC  X(65)     VALUE SPACES. 03540001
035500                                                                  03550001
035600 01  EL5-ERROR-LINE-5B.                                           03560001
035700     05  FILLER                      PIC  X(02)     VALUE SPACES. 03570001
035800     05  FILLER                      PIC  X(18)     VALUE         03580001
035900         'START DATE RANGE: '.                                    03590001
036000     05  EL5-START-DATE-RANGE        PIC  X(10).                  03600001
036100     05  FILLER                      PIC  X(07)     VALUE SPACES. 03610001
036200     05  FILLER                      PIC  X(21)     VALUE         03620001
036300         'END DATE RANGE     : '.                                 03630001
036400     05  EL5-END-DATE-RANGE          PIC  X(10).                  03640001
036500     05  FILLER                      PIC  X(20)     VALUE SPACES. 03650001
036600/                                                                 03660001
036700******************************************************************03670001
036800*  RECORD LAYOUT FOR INPUT FILE                                   03680001
036900******************************************************************03690001
037000     COPY SURD068.                                                03700002
037100/                                                                 03710001
037200*  LOGISTICS DOMAIN LOCATION MODULE                               03720001
037300*                                                                 03730001
037400     COPY XLWS071.                                                03740001
037500******************************************************************03750001
037600*  COPYBOOK USED BY MBS SYSTEM                                    03760001
037700******************************************************************03770001
037800     COPY DPWS003.                                                03780001
037900*                                                                 03790001
038000******************************************************************03800001
038100*  WORKING STORAGE AREA FOR NAME REFORMAT DPPD024                 03810001
038200******************************************************************03820001
038300     COPY DPWS024.                                                03830001
038400/                                                                 03840001
038500******************************************************************03850001
038600*  DB2 FORMATTED MESSAGE AREA                                     03860001
038700******************************************************************03870001
038800     COPY DPWS004.                                                03880001
038900/                                                                 03890001
039000******************************************************************03900001
039100* CORPORATE DATE ROUTINES                                         03910001
039200******************************************************************03920001
039300     COPY DPWS500.                                                03930001
039400/                                                                 03940001
039500******************************************************************03950001
039600*   DB2 SQL COMMUNICATION AREA                                    03960001
039700******************************************************************03970001
039800     EXEC SQL                                                     03980001
039900         INCLUDE SQLCA                                            03990001
040000     END-EXEC.                                                    04000001
040100*                                                                 04010001
040200     COPY SQLCA2.                                                 04020001
040300*                                                                 04030001
040400******************************************************************04040001
040500*  COBOL DECLARATION AND DCLGEN MEMBER FOR THE COMPANY CONTROL    04050001
040600*  TABLE                                                          04060001
040700******************************************************************04070001
040800     EXEC SQL                                                     04080001
040900          INCLUDE TCOCNTL                                         04090001
041000     END-EXEC.                                                    04100001
041100*                                                                 04110001
041200*                                                                 04120001
041300******************************************************************04130001
041400 PROCEDURE DIVISION.                                              04140001
041500******************************************************************04150001
041600 0000-MAINLINE.                                                   04160001
041700                                                                  04170001
041800     OPEN INPUT  EXTRACT-FILE                                     04180001
041900     OPEN OUTPUT REPORT-FILE-1.                                   04190001
042000                                                                  04200001
042100     PERFORM 2100-READ-EXTRACT.                                   04210001
042200     PERFORM 1000-INITIALIZE.                                     04220001
042300     IF PS-END-OF-INPUT                                           04230001
042400         PERFORM 1300-NO-DETAIL-LINE                              04240001
042500     ELSE                                                         04250001
042600         MOVE PV-OPER-ID  TO DK-OPER-ID                           04260001
066400         PERFORM 1200-SELECT-OPER-DESC                            04261018
042700         PERFORM 8000-WRITE-MAIN-HEADINGS                         04270001
042800         PERFORM 2000-PROCESS-EXTRACT                             04280001
042900             UNTIL PS-END-OF-INPUT                                04290001
               MOVE PV-WRITE-COUNT TO PV-DISPLAY-COUNT                  04301014
               DISPLAY 'REPORT DETAIL LINES COUNT: ' PV-DISPLAY-COUNT   04302014
043100     END-IF.                                                      04310001
043200                                                                  04320001
043300     PERFORM 9000-EOJ.                                            04330001
043400                                                                  04340001
043500     GOBACK.                                                      04350001
043600                                                                  04360001
043700******************************************************************04370001
043800 1000-INITIALIZE.                                                 04380001
043900******************************************************************04390001
044000*                                                                 04400001
044100* LOAD SYSTEM DATE INTO HEADINGS                                  04410001
044200     ACCEPT SD-SYSTEM-DATE FROM DATE.                             04420001
044300     ACCEPT ST-SYSTEM-TIME FROM TIME.                             04430001
044400                                                                  04440001
044500     MOVE SD-SYSTEM-DATE-YY      TO DP132O-RUN-YEAR.              04450001
044600     MOVE SD-SYSTEM-DATE-MM      TO DP132O-RUN-MONTH.             04460001
044700     MOVE SD-SYSTEM-DATE-DD      TO DP132O-RUN-DAY.               04470001
044800     MOVE ST-SYSTEM-HOUR         TO DP132O-RUN-HOUR.              04480001
044900     MOVE ST-SYSTEM-MINUTE       TO DP132O-RUN-MINUTE.            04490001
045000                                                                  04500001
045100     MOVE PC-CURRENT-PROGRAM-NAME                                 04510001
045200                                 TO DP132O-PROGRAM-NAME.          04520001
045300     MOVE 1                      TO DP132O-REPORT-NUMBER          04530001
045400                                    DP132O-PAGE-NUMBER.           04540001
045500                                                                  04550001
045600     MOVE PV-OPER-ID          TO PV-PREV-OPER-ID.                 04560001
046000*                                                                 04600001
046100***************************************************************** 04610001
046200 1200-SELECT-OPER-DESC.                                           04620001
046300***************************************************************** 04630001
046400*                                                                 04640001
046500     INITIALIZE XL071-COMMAREA-REC.                               04650001
046600     MOVE DK-OPER-ID            TO XL071-LOCATION-NUMBER          04660001
046700                                                                  04670001
046800     CALL XL071-LOCATION-MODULE USING XL071-COMMAREA-REC.         04680001
046900                                                                  04690001
047000     EVALUATE TRUE                                                04700001
047100     WHEN XL071-NO-ERRORS                                         04710001
047200         MOVE XL071-LOC-NM          TO PV-STORE-NAME              04720001
047300     WHEN XL071-LOC-NOT-FOUND                                     04730001
047400     WHEN XL071-DC-ASGMT-NOT-FND                                  04740001
047500         MOVE 'UNKNOWN'             TO PV-STORE-NAME              04750001
047600     WHEN XL071-BAD-DB2-RETURN                                    04760001
047700         DISPLAY '1200-SELECT-OPER-DESC'                          04770001
047800         DISPLAY 'CALL LOCATION MOD '                             04780001
047900         DISPLAY 'XLT00010'                                       04790001
048000         MOVE XL071-SQLCA             TO SQLCA                    04800001
048100         PERFORM 9200-SQL-ABEND                                   04810001
048200     END-EVALUATE.                                                04820001
048300*                                                                 04830001
048400******************************************************************04840001
048500*  PRINT A 'NO INPUT' REPORT LINE.                                04850001
048600******************************************************************04860001
048700 1300-NO-DETAIL-LINE.                                             04870001
048800*                                                                 04880001
048900     PERFORM 8000-WRITE-MAIN-HEADINGS.                            04890001
049000                                                                  04900001
049100     WRITE REPORT-RECORD-1                                        04910001
049200       FROM EP-EMPTY-REPORT-LINE                                  04920001
049300         AFTER ADVANCING 3 LINES.                                 04930001
049400*                                                                 04940001
049500******************************************************************04950001
049600 1400-SELECT-TCOCNTL.                                             04960001
049700******************************************************************04970001
049800*                                                                 04980001
049900     EXEC SQL                                                     04990001
050000         SELECT                                                   05000001
050100                (BTCH_PRC_DTE - 1 DAYS)                           05010001
050200         INTO  :COCNTL-BTCH-PRC-DTE                               05020001
050300         FROM TCOCNTL                                             05030001
050400         WHERE OPER_UNT_ID = 90                                   05040001
050500     END-EXEC.                                                    05050001
050600                                                                  05060001
050700*    TEST                                                         05070001
050800*    MOVE '2005-02-27'    TO COCNTL-BTCH-PRC-DTE                  05080001
050900*    TEST                                                         05090001
051000                                                                  05100001
051100     EVALUATE TRUE                                                05110001
051200         WHEN SQLCODE = +0                                        05120001
051300         WHEN SQLCODE = +100                                      05130001
051400         WHEN SQLCODE = -811                                      05140001
051500             MOVE COCNTL-BTCH-PRC-DTE TO PV-DB2-TMST              05150001
051600                                         PV-DB2-DATE-1            05160001
051700                                         PV-DB2-DATE-2            05170001
051800             MOVE PV-DB2-TMST-MM      TO PV-FORMAT-DATE-MM        05180001
051900             MOVE PV-DB2-TMST-DD      TO PV-FORMAT-DATE-DD        05190001
052000             MOVE PV-DB2-TMST-CCYY    TO PV-FORMAT-DATE-CCYY      05200001
052100         WHEN SQLCODE < ZERO                                      05210001
052200             MOVE '1400-SELECT-TCOCNTL'                           05220001
052300                                        TO PV-ABEND-PARAGRAPH     05230001
052400             MOVE 'SELECT'         TO PV-DB2-FUNCTION             05240001
052500             MOVE 'TCOCNTL        '   TO PV-DB2-TABLE-NAME        05250001
052600             PERFORM 9200-SQL-ABEND                               05260001
052700         WHEN SQLCODE > ZERO                                      05270001
052800         WHEN SQLWARN0 NOT = SPACES                               05280001
052900             MOVE '1400-SELECT-TCOCNTL'                           05290001
053000                                      TO PV-ABEND-PARAGRAPH       05300001
053100             MOVE 'SELECT'         TO PV-DB2-FUNCTION             05310001
053200             PERFORM 9300-SQL-WARNING                             05320001
053300     END-EVALUATE.                                                05330001
053400/                                                                 05340001
054800******************************************************************05480001
054900 2000-PROCESS-EXTRACT.                                            05490001
055000******************************************************************05500001
055100*                                                                 05510001
055200     IF PV-OPER-ID  = PV-PREV-OPER-ID                             05520001
055700         PERFORM 3000-PRINT-DETAILS                               05570015
056300     ELSE                                                         05630001
056500         MOVE PV-OPER-ID  TO PV-PREV-OPER-ID                      05650015
056600                             DK-OPER-ID                           05660015
056700         PERFORM 1200-SELECT-OPER-DESC                            05670018
               MOVE ZERO             TO PV-PAGE-COUNT                   05671024
056800         PERFORM 8000-WRITE-MAIN-HEADINGS                         05680015
056900         INITIALIZE  PV-DC-TRANS-QTY                              05690015
057300         INITIALIZE  PV-TRANS-QTY                                 05730015
057400         MOVE 0                TO PV-TOTAL-DIVERTS                05740015
057500                                  PV-SHIPPING-DOOR                05750015
057600                                  PV-SHUTTLE-DOOR                 05760015
057700                                  PV-STORAGE-DOOR                 05770015
056400         PERFORM 3000-PRINT-DETAILS                               05771015
057800     END-IF.                                                      05780001
057900                                                                  05790001
058000     ADD 1                  TO PV-TRANS-QTY                       05800001
058100                               PV-DC-TRANS-QTY.                   05810001
058200     PERFORM 2100-READ-EXTRACT.                                   05820001
058300*                                                                 05830001
058400******************************************************************05840001
058500*  READ NEXT INPUT FILE RECORD.                                   05850001
058600******************************************************************05860001
058700 2100-READ-EXTRACT.                                               05870001
058800                                                                  05880001
058900     READ EXTRACT-FILE INTO SU068-EXTRACT-RECORD                  05890001
059000        AT END                                                    05900001
059100           SET PS-END-OF-INPUT TO TRUE                            05910001
059200        NOT AT END                                                05920001
059300           ADD +1                   TO PV-READ-COUNT              05930001
059400           MOVE SU068-LOC-NBR       TO PV-OPER-ID                 05940001
059500           MOVE SU068-PO-NBR        TO PV-PO-NBR                  05950001
059600           MOVE SU068-RCVR-SEQ      TO PV-RCVR-SEQ                05960001
059700           MOVE SU068-SHIPT-UNT-ID  TO PV-SHIPT-UNT-ID            05970001
059800     END-READ.                                                    05980001
059900*                                                                 05990001
060000******************************************************************06000001
060100*  FILL AND PRINT DETAIL REPORT LINE.                             06010001
060200******************************************************************06020001
060300 3000-PRINT-DETAILS.                                              06030001
060400                                                                  06040001
060500*CHECK FOR OVERFLOW.                                              06050001
060600*    ADD 1 TO PV-LINE-COUNT                                       06060019
           ADD 1 TO PV-WRITE-COUNT.                                     06061019
060700     IF PV-LINE-COUNT > PC-MAX-LINE-COUNT                         06070001
060900         PERFORM 8000-WRITE-MAIN-HEADINGS                         06090001
061000     END-IF.                                                      06100001
061100                                                                  06110001
061400     IF PS-SAME-PAGE AND                                          06161012
061700        PV-PO-NBR         = PV-PREV-PO-NBR AND                    06170012
061800        PV-RCVR-SEQ       = PV-PREV-RCVR-SEQ AND                  06180002
061900        PV-SHIPT-UNT-ID   = PV-PREV-SHIPT-UNT-ID                  06190001
062000         MOVE SU068-LINE-NBR          TO DL2-LINE-NBR             06200001
062100         MOVE SU068-DEPT-NUMBER       TO DL2-DEPT-NUMBER          06210001
062200         MOVE SU068-SUB-CLASS         TO DL2-SUB-CLASS            06220001
062300         MOVE SU068-SKU               TO DL2-SKU                  06230001
062400         MOVE SU068-UNIT-COUNT        TO DL2-UNIT-COUNT           06240001
062500         WRITE REPORT-RECORD-1                                    06250001
062600           FROM DL-DETAIL-LINE-2                                  06260001
062700             AFTER ADVANCING 1 LINES                              06270001
062800         ADD 1                   TO PV-LINE-COUNT                 06280001
062900     ELSE                                                         06290001
063000         MOVE SU068-PO-NBR            TO DL1-PO-NBR               06300001
063100         MOVE SU068-RCVR-SEQ          TO DL1-RCVR-SEQ             06310001
063200         MOVE SU068-SHIPT-UNT-ID      TO DL1-SHIPT-UNT-ID         06320001
063400         MOVE SU068-SRC-ID            TO DL1-SRC-ID               06340001
063500         MOVE SU068-INACTIVE-USER-ID  TO DL1-INACTIVE-USER-ID     06350001
063600         MOVE SU068-INACTIVE-REASON   TO DL1-INACTIVE-REASON      06360001
063700         MOVE SU068-ACTIVE-CARTONS    TO DL1-ACTIVE-CARTONS       06370001
063800         MOVE SU068-INACTIVE-CARTONS  TO DL1-INACTIVE-CARTONS     06380001
063900         MOVE SU068-DEST-OPER-UNIT-ID TO DL1-DEST-OPER-UNIT-ID    06390001
064000         MOVE SU068-LINE-NBR          TO DL1-LINE-NBR             06400001
064100         MOVE SU068-DEPT-NUMBER       TO DL1-DEPT-NUMBER          06410001
064200         MOVE SU068-SUB-CLASS         TO DL1-SUB-CLASS            06420001
064300         MOVE SU068-SKU               TO DL1-SKU                  06430001
064400         MOVE SU068-UNIT-COUNT        TO DL1-UNIT-COUNT           06440001
      * * * DL1-DOOR REDEFINES DL1-OUTBOUND-TRIP                        06440123
063300         IF SU068-OUTBOUND-TRIP > ZERO                            06440223
063300             MOVE SU068-OUTBOUND-TRIP TO DL1-OUTBOUND-TRIP        06440323
               ELSE                                                     06440423
                   MOVE SU068-DIVERT-DOOR   TO PV-DIVERT-DOOR           06440523
                   MOVE PV-DOOR             TO DL1-DOOR                 06440623
               END-IF                                                   06440723
061400         IF PS-SAME-PAGE                                          06441013
064500             WRITE REPORT-RECORD-1                                06450012
064600               FROM DL-BLANK-LINE                                 06460012
064700                 AFTER ADVANCING 1 LINE                           06470012
065200             ADD 1                   TO PV-LINE-COUNT             06470112
               END-IF                                                   06471012
064800                                                                  06480001
064900         WRITE REPORT-RECORD-1                                    06490001
065000           FROM DL-DETAIL-LINE-1                                  06500001
065100             AFTER ADVANCING 1 LINES                              06510001
065200         ADD 1                   TO PV-LINE-COUNT                 06520012
055800         MOVE PV-PO-NBR          TO PV-PREV-PO-NBR                06521010
055900         MOVE PV-RCVR-SEQ        TO PV-PREV-RCVR-SEQ              06522010
056000         MOVE PV-SHIPT-UNT-ID    TO PV-PREV-SHIPT-UNT-ID          06523010
065300     END-IF.                                                      06530001
061300     IF PS-NEW-PAGE                                               06531012
061400         SET PS-SAME-PAGE             TO TRUE                     06532012
061500     END-IF.                                                      06533012
065400                                                                  06540001
065500                                                                  06550001
065600*                                                                 06560001
065700******************************************************************06570001
065800 8000-WRITE-MAIN-HEADINGS.                                        06580001
065900******************************************************************06590001
066000*                                                                 06600001
060800     SET PS-NEW-PAGE TO TRUE                                      06601012
066100     IF PS-END-OF-INPUT                                           06610001
066200         PERFORM 1400-SELECT-TCOCNTL                              06620001
066300     ELSE                                                         06630001
066500         MOVE PV-STORE-NAME            TO HL2-LOC-DESC            06650001
066600         MOVE PV-OPER-ID               TO HL2-OPER-ID             06660001
066700     END-IF.                                                      06670001
066800                                                                  06680001
066900     ADD 1                         TO PV-PAGE-COUNT.              06690001
067000     MOVE PV-PAGE-COUNT            TO DP132O-PAGE-NUMBER.         06700001
067100     MOVE ZERO                     TO PV-LINE-COUNT.              06710001
067200                                                                  06720001
067300     WRITE REPORT-RECORD-1 FROM                                   06730001
067400         DP132O-STANDRD-HEADER-132-COLS                           06740001
067500         AFTER ADVANCING PAGE.                                    06750001
067600                                                                  06760001
067700     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     06770001
067800         AFTER ADVANCING 1 LINE                                   06780001
067900                                                                  06790001
068000     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-1                 06800001
068100        AFTER ADVANCING 1 LINES.                                  06810001
068200                                                                  06820001
068300     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     06830001
068400         AFTER ADVANCING 1 LINE                                   06840001
068500                                                                  06850001
068600     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-2                 06860001
068700        AFTER ADVANCING 1 LINES.                                  06870001
068800                                                                  06880001
068900     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     06890001
069000         AFTER ADVANCING 1 LINE                                   06900001
069100                                                                  06910001
069200     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-3                 06920001
069300        AFTER ADVANCING 1 LINES.                                  06930001
069400                                                                  06940001
069500     WRITE REPORT-RECORD-1 FROM HL-HEADING-LINE-4                 06950001
069600        AFTER ADVANCING 1 LINES.                                  06960001
069700                                                                  06970001
069800     WRITE REPORT-RECORD-1 FROM DL-BLANK-LINE                     06980001
069900         AFTER ADVANCING 1 LINE                                   06990001
070000                                                                  07000001
070100     ADD 8                            TO PV-LINE-COUNT.           07010001
070200*                                                                 07020001
070300******************************************************************07030001
070400 9000-EOJ.                                                        07040001
070500******************************************************************07050001
070600*                                                                 07060001
070700     WRITE REPORT-RECORD-1 FROM ER-END-OF-REPORT-LINE             07070001
070800        AFTER ADVANCING 2 LINES                                   07080001
070900                                                                  07090001
071000*CLOSE FILES.                                                     07100001
071100     CLOSE EXTRACT-FILE                                           07110001
071300           REPORT-FILE-1.                                         07130003
071400                                                                  07140001
071500     MOVE PV-READ-COUNT      TO PV-DISPLAY-COUNT.                 07150001
071600     DISPLAY 'TOTAL INPUT RECORDS READ ' PV-DISPLAY-COUNT.        07160001
071700                                                                  07170001
072100/                                                                 07210001
072200******************************************************************07220001
072300 9200-SQL-ABEND.                                                  07230001
072400******************************************************************07240001
072500                                                                  07250001
072600     MOVE SQLCODE                     TO SQLCODE2.                07260001
072700     MOVE SQLERRD(3)                  TO SQLERRD3.                07270001
072800                                                                  07280001
072900     DISPLAY '** ABEND **         ** = SQLERROR'.                 07290001
073000     DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME.        07300001
073100     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH.                   07310001
073200     DISPLAY '** TABLE NAME * = ' PV-DB2-TABLE-NAME.              07320001
073300     DISPLAY '** OPERATION ** = ' PV-DB2-FUNCTION.                07330001
073400     DISPLAY '*** MESSAGE     = ' PV-DB2-OPERATION-MESSAGE-1.     07340001
073500     DISPLAY '***             = ' PV-DB2-OPERATION-MESSAGE-2.     07350001
073600     DISPLAY '***             = ' PV-DB2-OPERATION-MESSAGE-3.     07360001
073700     DISPLAY '** HOST VARIABLE= ' PV-DISPLAY-HOST-VAR             07370001
073800                                                                  07380001
073900     DISPLAY '** SQLCODE          ** = ' SQLCODE2.                07390001
074000     DISPLAY '** ROWS PROCESSED   ** = ' SQLERRD3.                07400001
074100     DISPLAY '** SQLERRM          ** = ' SQLERRM.                 07410001
074200     DISPLAY '** SQLERRMC         ** = ' SQLERRMC.                07420001
074300                                                                  07430001
074400                                                                  07440001
074500     MOVE +4013                       TO PV-ABEND-CODE.           07450001
074600     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         07460001
074700                                                                  07470001
074800******************************************************************07480001
074900 9300-SQL-WARNING.                                                07490001
075000******************************************************************07500001
075100                                                                  07510001
075200     DISPLAY '9300-SQL-WARNING'.                                  07520001
075300     DISPLAY '** PROGRAM   ** = ' PC-CURRENT-PROGRAM-NAME.        07530001
075400     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH.                   07540001
075500     DISPLAY '** OPERATION ** = ' PV-DB2-FUNCTION.                07550001
075600                                                                  07560001
075700     MOVE SQLCODE                     TO SQLCODE2.                07570001
075800     MOVE SQLERRD(3)                  TO SQLERRD3.                07580001
075900     DISPLAY '** ABEND **       ** = SQLWARNING'.                 07590001
076000     DISPLAY '** SQLCODE        ** = ' SQLCODE2.                  07600001
076100     DISPLAY '** ROWS PROCESSED ** = ' SQLERRD3.                  07610001
076200     DISPLAY '** SQLWARN0       ** = ' SQLWARN0.                  07620001
076300     DISPLAY '** SQLWARN1       ** = ' SQLWARN1.                  07630001
076400     DISPLAY '** SQLWARN2       ** = ' SQLWARN2.                  07640001
076500     DISPLAY '** SQLWARN3       ** = ' SQLWARN3.                  07650001
076600     DISPLAY '** SQLWARN4       ** = ' SQLWARN4.                  07660001
076700     DISPLAY '** SQLWARN5       ** = ' SQLWARN5.                  07670001
076800     DISPLAY '** SQLWARN6       ** = ' SQLWARN6.                  07680001
076900     DISPLAY '** SQLWARN7       ** = ' SQLWARN7.                  07690001
077000                                                                  07700001
077100     MOVE +4013                       TO PV-ABEND-CODE.           07710001
077200     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         07720001
077300*                                                                 07730001
