000100 IDENTIFICATION DIVISION.                                         00010001
000200                                                                  00020001
000300 PROGRAM-ID.             SUKRP046.                                00030001
000400 AUTHOR.                 DENISE HAHN.                             00040001
000500 INSTALLATION.           KOHLS DEPARTMENT STORES.                 00050001
000600 DATE-WRITTEN            MAY, 2006.                               00060001
000700 DATE-COMPILED.                                                   00070001
000800***************************************************************** 00080001
000900* CREATE 'DAILY - TRAILER SUMMARY REPORT'                       * 00090001
001000*                                                               * 00100001
001100* DIVIDE TOTAL NUMBER OF CARTONS BY 4, GIVING THE BREAKDOWN OF  * 00110001
001200* THE CARTONS FOR EACH 1/4 OF THE TRAILER - AS THEY WERE LOADED * 00120001
001300* ONTO THE TRAILER.                                             * 00130001
001400* COUNTS FOR EACH 1/4 FOR # CARTONS, # SKUS, # UNITS            * 00140001
001500* HARD/SOFT COLUMNS WILL = COLUMN TOTALS                        * 00150001
001600* 1/4 COUNTS (CARTON/UNIT/SKU) WILL TOTAL LINE TOTALS AT END    * 00160001
001700***************************************************************** 00170001
001800 ENVIRONMENT DIVISION.                                            00180001
001900                                                                  00190001
002000 CONFIGURATION SECTION.                                           00200001
002100                                                                  00210001
002200 SOURCE-COMPUTER.        IBM-3090.                                00220001
002300 OBJECT-COMPUTER.        IBM-3090.                                00230001
002400                                                                  00240001
002500 INPUT-OUTPUT SECTION.                                            00250001
002600                                                                  00260001
002700 FILE-CONTROL.                                                    00270001
002800                                                                  00280001
002900     SELECT TRIP-FILE                                             00290001
003000         ASSIGN TO INP01.                                         00300001
003100                                                                  00310001
003200     SELECT REPORT-FILE                                           00320001
003300         ASSIGN TO RPT01.                                         00330001
003400                                                                  00340001
003500     SELECT OUTPUT-FILE                                           00350099
003600         ASSIGN TO OUT01.                                         00360099
003700                                                                  00370099
003800 DATA DIVISION.                                                   00380001
003900                                                                  00390001
004000 FILE SECTION.                                                    00400001
004100*                                                                 00410001
004200 FD  TRIP-FILE                                                    00420001
004300     RECORDING MODE IS F                                          00430001
004400     LABEL RECORDS ARE STANDARD                                   00440001
004500     BLOCK CONTAINS 0 RECORDS.                                    00450001
004600 01  TRIP-RECORD                     PIC X(100).                  00460001
004700*                                                                 00470001
004800 FD  REPORT-FILE                                                  00480001
004900     RECORDING MODE IS F                                          00490001
005000     LABEL RECORDS ARE STANDARD                                   00500001
005100     BLOCK CONTAINS 0 RECORDS.                                    00510001
005200 01  REPORT-RECORD                   PIC X(132).                  00520001
005300                                                                  00530001
005400 FD  OUTPUT-FILE                                                  00540099
005500     RECORDING MODE IS F                                          00550099
005600     BLOCK CONTAINS 0  RECORDS.                                   00560099
005700 01  OUTPUT-RECORD                   PIC X(280).                  00570099
005800*                                                                 00580099
005900 WORKING-STORAGE SECTION.                                         00590001
      *                                                                 00591099
      *** NULL INDICATORS                                               00592099
      *                                                                 00593099
       01  DN-DB2-NULL-INDICATORS.                                      00594099
           05  DN-DIST-NBR                  PIC S9(04) COMP VALUE ZERO. 00595099
006000*                                                                 00600004
006100*** PROGRAM SWITCHES                                              00610004
006200*                                                                 00620004
006300 01  PROGRAM-SWITCHES.                                            00630001
006400     05  PS-TRLR-QUARTER-SW           PIC 9(01) VALUE ZERO.       00640012
006500         88  PS-TRLR-1ST-QUARTER                VALUE 1.          00650004
006600         88  PS-TRLR-2ND-QUARTER                VALUE 2.          00660010
006700         88  PS-TRLR-3RD-QUARTER                VALUE 3.          00670010
006800         88  PS-TRLR-4TH-QUARTER                VALUE 4.          00680010
006900     05  PS-DATA-SW                   PIC X(01) VALUE 'N'.        00690097
007000         88  PS-DATA-NO                         VALUE 'N'.        00700097
007100         88  PS-DATA-YES                        VALUE 'Y'.        00710097
007200     05  PS-EOF-INPUT-SW              PIC X(01) VALUE 'N'.        00720097
007300         88  PS-EOF-INPUT-YES                   VALUE 'Y'.        00730097
007400         88  PS-EOF-INPUT-NO                    VALUE 'N'.        00740097
007500     05  PS-DISTRICT-ON-HAND-SW       PIC X(01) VALUE 'N'.        00750004
007600         88  PS-DISTRICT-ON-HAND-YES            VALUE 'Y'.        00760004
007700         88  PS-DISTRICT-ON-HAND-NO             VALUE 'N'.        00770004
007800     05  PS-PROCESS-STORE-SW          PIC X(01) VALUE 'N'.        00780004
007900         88  PS-PROCESS-STORE-YES               VALUE 'Y'.        00790004
008000         88  PS-PROCESS-STORE-NO                VALUE 'N'.        00800004
008100     05  PS-TRIP-SML-CSR-SW           PIC X(01) VALUE 'N'.        00810008
008200         88  PS-TRIP-SML-EOF-YES                VALUE 'Y'.        00820008
008300         88  PS-TRIP-SML-EOF-NO                 VALUE 'N'.        00830008
008400     05  PS-CARTON-HARD-SOFT-SW       PIC X(01) VALUE ' '.        00840010
008500         88  PS-HARDLINE-CARTON                 VALUE 'H'.        00850010
008600         88  PS-SOFTLINE-CARTON                 VALUE 'S'.        00860010
008700         88  PS-HARD-SOFT-NO                    VALUE ' '.        00870037
008800     05  PS-CARTON-HANG-FOLD-SW       PIC X(01) VALUE ' '.        00880037
008900         88  PS-HANG-CARTON                     VALUE 'H'.        00890037
009000         88  PS-FOLD-CARTON                     VALUE 'F'.        00900037
009100         88  PS-HANG-FOLD-NO                    VALUE ' '.        00910037
009200                                                                  00920004
009300                                                                  00930003
009400                                                                  00940003
009500 01  PV-PROGRAM-VARIABLES.                                        00950003
009600                                                                  00960093
009700     05  PC-CURRENT-PROGRAM-NAME     PIC  X(08)    VALUE          00970093
009800         'SUKRP046'.                                              00980093
009801                                                                  00980199
009810     05  PC-DEFAULT-TMST             PIC X(26)  VALUE             00981099
009820                                     '0001-01-01-01.01.01.000000'.00982099
009830     05  PC-BEGIN-TMST               PIC X(26)  VALUE             00983099
009840                                     '2006-08-13-01.01.01.000000'.00984099
009900                                                                  00990093
010000     05  PV-PAGE-COUNT               PIC S9(04)   VALUE ZERO      01000093
010100                                                  COMP-3.         01010093
010200     05  PV-LINE-COUNT               PIC S9(03)   VALUE ZERO      01020093
010300                                                  COMP-3.         01030093
010400                                                                  01040093
010500     05  PV-TODAYS-DATE.                                          01050093
010600         10  PV-TODAYS-DATE-CCYY     PIC  9(04)    VALUE ZEROS.   01060093
010700         10  PV-TODAYS-DATE-MM       PIC  9(02)    VALUE ZEROS.   01070093
010800         10  PV-TODAYS-DATE-DD       PIC  9(02)    VALUE ZEROS.   01080093
010900     05  PV-TODAYS-TIME.                                          01090093
011000         10  PV-TODAYS-TIME-HH       PIC  9(02)    VALUE ZEROS.   01100093
011100         10  PV-TODAYS-TIME-MM       PIC  9(02)    VALUE ZEROS.   01110093
011200         10  PV-TODAYS-TIME-SS       PIC  9(02)    VALUE ZEROS.   01120093
011300         10  FILLER                  PIC  9(02)    VALUE ZEROS.   01130093
011400     05  PV-FORMAT-DATE.                                          01140093
011500         10  PV-FORMAT-DATE-MM       PIC  X(02)    VALUE SPACES.  01150093
011600         10  FILLER                  PIC  X(01)    VALUE '/'.     01160093
011700         10  PV-FORMAT-DATE-DD       PIC  X(02)    VALUE SPACES.  01170093
011800         10  FILLER                  PIC  X(01)    VALUE '/'.     01180093
011900         10  PV-FORMAT-DATE-YYYY     PIC  X(04)    VALUE SPACES.  01190093
012000                                                                  01200093
012100     05  PV-DISP-STORE          PIC  Z(04)     VALUE ZEROES.      01210004
012200     05  PV-DISP-DC             PIC  Z(04)     VALUE ZEROES.      01220004
012300     05  PV-DISP-TRIP           PIC  Z(09)     VALUE ZEROES.      01230004
012400     05  PV-DISP-ORCNCE         PIC  Z(09)     VALUE ZEROES.      01240014
012500     05  PV-DISP-TRLR-SRL       PIC  Z(09)     VALUE ZEROES.      01250004
012600     05  PV-DISP-DISTRICT       PIC  Z(04)     VALUE ZEROES.      01260004
012700     05  PV-DISP-UNITS          PIC  Z(09)     VALUE ZEROES.      01270045
012800     05  PV-DISP-SQLCODE        PIC  -999.                        01280004
012900     05  PV-DISP-SML            PIC  X(18).                       01290055
013000     05  PV-DISP-SKU            PIC  9(08).                       01300051
013100*                                                                 01310004
013200     05  PV-TRIP-ID             PIC S9(09)      VALUE ZEROES.     01320077
013300     05  PV-TRIP-OCRNC          PIC S9(09)      VALUE ZEROES.     01330085
013400     05  PV-STORE-DEST          PIC  9(04)      VALUE ZEROES.     01340093
013500     05  PV-STORE-NUMBER        PIC  9(04)      VALUE ZEROES.     01350093
013600     05  PV-STORE-NAME          PIC  X(40)      VALUE SPACES.     01360017
013700     05  PV-DC-NUMBER           PIC S9(04) COMP VALUE ZEROES.     01370013
013800     05  PV-DC-NAME             PIC  X(40)      VALUE SPACES.     01380017
013900     05  PV-DC-SCAC             PIC  X(04)      VALUE SPACES.     01390017
014000     05  PV-DC-TRLR-ID          PIC  X(12)      VALUE SPACES.     01400017
014100     05  PV-PREV-STORE          PIC  9(04)      VALUE ZEROES.     01410013
014200     05  PV-PREV-DC             PIC  9(04)      VALUE ZEROES.     01420013
014300     05  PV-PREV-TRIP           PIC  9(09)      VALUE ZEROES.     01430013
014400     05  PV-PREV-ORCNC          PIC  9(09)      VALUE ZEROES.     01440013
014500     05  PV-TRIP-STATUS         PIC  X(30)      VALUE SPACES.     01450013
014600     05  PV-PREV-SML            PIC  9(18)      VALUE ZEROES.     01460013
014700     05  PV-PREV-DIVERT         PIC  9(26)      VALUE ZEROES.     01470064
014800     05  PV-TABLE-1             PIC  X(30)      VALUE SPACES.     01480013
014900     05  PV-TABLE-2             PIC  X(30)      VALUE SPACES.     01490013
015000     05  PV-TABLE-3             PIC  X(30)      VALUE SPACES.     01500013
015100     05  PV-TRIP-BEGIN-TMST     PIC  X(26)      VALUE SPACES.     01510013
015200     05  PV-TRIP-END-TMST       PIC  X(26)      VALUE SPACES.     01520013
015300     05  PV-QUARTER-BEGIN-TMST  PIC  X(26)      VALUE SPACES.     01530013
015400     05  PV-QUARTER-END-TMST    PIC  X(26)      VALUE SPACES.     01540013
015500                                                                  01550010
015600     05  PV-TRIP-CARTON-COUNT   PIC  9(09)      VALUE ZEROS.      01560025
015700     05  PV-DISP-TRIP-COUNT     PIC  Z(09)      VALUE ZEROS.      01570099
015800     05  PV-DISP-QUART-COUNT    PIC  Z(06)     VALUE ZEROES.      01580099
015900     05  PV-DISP-CART-REMAIN    PIC  Z(06)     VALUE ZEROES.      01590099
016000     05  PV-HARDLINE-UNITS      PIC S9(09) COMP VALUE ZEROS.      01600025
016100     05  PV-SOFTLINE-UNITS      PIC S9(09) COMP VALUE ZEROS.      01610010
016200     05  PV-HANG-UNITS          PIC S9(09) COMP VALUE ZEROS.      01620037
016300     05  PV-FOLD-UNITS          PIC S9(09) COMP VALUE ZEROS.      01630037
016400     05  PV-NULL-IND-1          PIC S9(04)      VALUE ZEROS       01640010
016500                                                COMP SYNC.        01650010
016600     05  PV-NULL-IND-2          PIC S9(04)      VALUE ZEROS       01660010
016700                                                COMP SYNC.        01670010
016800*                                                                 01680004
016900     05  PV-WORK-TMST           PIC  X(26)     VALUE SPACES.      01690004
017000     05  PV-WORK-TMST-R REDEFINES PV-WORK-TMST.                   01700004
017100         10  PV-WORK-TMST-YY    PIC  9(04).                       01710004
017200         10  FILLER             PIC  X(01).                       01720004
017300         10  PV-WORK-TMST-MM    PIC  9(02).                       01730004
017400         10  FILLER             PIC  X(01).                       01740004
017500         10  PV-WORK-TMST-DD    PIC  9(02).                       01750004
017600         10  PV-FILLER          PIC  X(16).                       01760004
017700*                                                                 01770004
017800     05  PV-WORK-DATE           PIC  9(08).                       01780004
017900     05  PV-WORK-DATE-R REDEFINES PV-WORK-DATE.                   01790004
018000         10  PV-WORK-DATE-YY    PIC  9(04).                       01800004
018100         10  PV-WORK-DATE-MM    PIC  9(02).                       01810004
018200         10  PV-WORK-DATE-DD    PIC  9(02).                       01820004
018300*                                                                 01830021
018400     05  PV-WORK-OPEN           PIC  X(10)     VALUE SPACES.      01840021
018500     05  PV-WORK-OPEN-R REDEFINES PV-WORK-OPEN.                   01850021
018600         10  PV-WORK-OPEN-YY    PIC  9(04).                       01860021
018700         10  FILLER             PIC  X(01).                       01870021
018800         10  PV-WORK-OPEN-MM    PIC  9(02).                       01880021
018900         10  FILLER             PIC  X(01).                       01890021
019000         10  PV-WORK-OPEN-DD    PIC  9(02).                       01900021
019100*                                                                 01910021
019200     05  PV-WORK-OPEN-DATE         PIC  9(08).                    01920021
019300     05  PV-WORK-OPEN-DATE-R REDEFINES PV-WORK-OPEN-DATE.         01930021
019400         10  PV-WORK-OPEN-DATE-YY  PIC  9(04).                    01940021
019500         10  PV-WORK-OPEN-DATE-MM  PIC  9(02).                    01950021
019600         10  PV-WORK-OPEN-DATE-DD  PIC  9(02).                    01960021
019700                                                                  01970004
019800*                                                                 01980004
019900     05  PV-HARD-SKU-COUNT         PIC S9(09)  COMP.              01990011
020000     05  PV-SOFT-SKU-COUNT         PIC S9(09)  COMP.              02000011
020100     05  PV-HANG-SKU-COUNT         PIC S9(09)  COMP.              02010011
020200     05  PV-FOLD-SKU-COUNT         PIC S9(09)  COMP.              02020011
020300     05  PV-OH-R-SKU-COUNT         PIC S9(09)  COMP.              02030011
020400     05  PV-OH-N-SKU-COUNT         PIC S9(09)  COMP.              02040011
020500     05  PV-EAS-SKU-COUNT          PIC S9(09)  COMP.              02050011
020600     05  PV-CLEAR-SKU-COUNT        PIC S9(09)  COMP.              02060011
020700     05  PV-TOTAL-SKU-COUNT        PIC S9(09)  COMP.              02070013
020800*                                                                 02080004
020900     05  PV-CRTNS-ON-TRLR          PIC  9(06)     VALUE ZEROES.   02090008
021000     05  PV-CRTNS-PER-QUARTER      PIC  9(06)     VALUE ZEROES.   02100008
021100     05  PV-CRTNS-PER-QUARTER-REM  PIC  9(06)     VALUE ZEROES.   02110008
021200     05  PV-CRTNS-1ST-QUART        PIC  9(06)     VALUE ZEROES.   02120008
021300     05  PV-CRTNS-2ND-QUART        PIC  9(06)     VALUE ZEROES.   02130008
021400     05  PV-CRTNS-3RD-QUART        PIC  9(06)     VALUE ZEROES.   02140008
021500     05  PV-CRTNS-4TH-QUART        PIC  9(06)     VALUE ZEROES.   02150008
021600     05  PV-CURRENT-QUART-COUNT    PIC  9(06)     VALUE ZEROES.   02160009
021700                                                                  02170013
021800     05  PV-PARAGRAPH-NAME         PIC  X(30)     VALUE SPACE.    02180013
021900     05  PV-ERROR-MESSAGE-1        PIC  X(50)     VALUE SPACE.    02190013
022000     05  PV-ERROR-MESSAGE-2        PIC  X(50)     VALUE SPACE.    02200013
022100     05  PV-ABEND-CODE             PIC S9(04)     VALUE ZERO.     02210013
022200                                                                  02220013
022300*                                                                 02230004
022400* HARDLINE ACCUMULATORS                                           02240004
022500*                                                                 02250004
022600 01  PV-HARD-VARIABLES.                                           02260011
022700     05  PV-HARD-1ST-CRTNS       PIC  9(05)    VALUE ZEROES.      02270004
022800     05  PV-HARD-1ST-SKUS        PIC  9(05)    VALUE ZEROES.      02280003
022900     05  PV-HARD-1ST-UNITS       PIC  9(05)    VALUE ZEROES.      02290003
023000     05  PV-HARD-2ND-CRTNS       PIC  9(05)    VALUE ZEROES.      02300003
023100     05  PV-HARD-2ND-SKUS        PIC  9(05)    VALUE ZEROES.      02310003
023200     05  PV-HARD-2ND-UNITS       PIC  9(05)    VALUE ZEROES.      02320003
023300     05  PV-HARD-3RD-CRTNS       PIC  9(05)    VALUE ZEROES.      02330003
023400     05  PV-HARD-3RD-SKUS        PIC  9(05)    VALUE ZEROES.      02340003
023500     05  PV-HARD-3RD-UNITS       PIC  9(05)    VALUE ZEROES.      02350003
023600     05  PV-HARD-4TH-CRTNS       PIC  9(05)    VALUE ZEROES.      02360003
023700     05  PV-HARD-4TH-SKUS        PIC  9(05)    VALUE ZEROES.      02370003
023800     05  PV-HARD-4TH-UNITS       PIC  9(05)    VALUE ZEROES.      02380003
023900     05  PV-HARD-TOT-CRTNS       PIC  9(05)    VALUE ZEROES.      02390003
024000     05  PV-HARD-TOT-SKUS        PIC  9(05)    VALUE ZEROES.      02400003
024100     05  PV-HARD-TOT-UNITS       PIC  9(05)    VALUE ZEROES.      02410003
024200*                                                                 02420003
024300* SOFTLINE ACCUMULATORS                                           02430003
024400*                                                                 02440011
024500 01  PV-SOFT-VARIABLES.                                           02450011
024600     05  PV-SOFT-1ST-CRTNS       PIC  9(05)    VALUE ZEROES.      02460003
024700     05  PV-SOFT-1ST-SKUS        PIC  9(05)    VALUE ZEROES.      02470003
024800     05  PV-SOFT-1ST-UNITS       PIC  9(05)    VALUE ZEROES.      02480003
024900     05  PV-SOFT-2ND-CRTNS       PIC  9(05)    VALUE ZEROES.      02490003
025000     05  PV-SOFT-2ND-SKUS        PIC  9(05)    VALUE ZEROES.      02500003
025100     05  PV-SOFT-2ND-UNITS       PIC  9(05)    VALUE ZEROES.      02510003
025200     05  PV-SOFT-3RD-CRTNS       PIC  9(05)    VALUE ZEROES.      02520003
025300     05  PV-SOFT-3RD-SKUS        PIC  9(05)    VALUE ZEROES.      02530003
025400     05  PV-SOFT-3RD-UNITS       PIC  9(05)    VALUE ZEROES.      02540003
025500     05  PV-SOFT-4TH-CRTNS       PIC  9(05)    VALUE ZEROES.      02550003
025600     05  PV-SOFT-4TH-SKUS        PIC  9(05)    VALUE ZEROES.      02560003
025700     05  PV-SOFT-4TH-UNITS       PIC  9(05)    VALUE ZEROES.      02570003
025800     05  PV-SOFT-TOT-CRTNS       PIC  9(05)    VALUE ZEROES.      02580003
025900     05  PV-SOFT-TOT-SKUS        PIC  9(05)    VALUE ZEROES.      02590003
026000     05  PV-SOFT-TOT-UNITS       PIC  9(05)    VALUE ZEROES.      02600003
026100*                                                                 02610003
026200* HANG ACCUMULATORS                                               02620003
026300*                                                                 02630003
026400 01  PV-HANG-VARIABLES.                                           02640011
026500     05  PV-HANG-1ST-CRTNS       PIC  9(05)    VALUE ZEROES.      02650003
026600     05  PV-HANG-1ST-SKUS        PIC  9(05)    VALUE ZEROES.      02660003
026700     05  PV-HANG-1ST-UNITS       PIC  9(05)    VALUE ZEROES.      02670003
026800     05  PV-HANG-2ND-CRTNS       PIC  9(05)    VALUE ZEROES.      02680003
026900     05  PV-HANG-2ND-SKUS        PIC  9(05)    VALUE ZEROES.      02690003
027000     05  PV-HANG-2ND-UNITS       PIC  9(05)    VALUE ZEROES.      02700003
027100     05  PV-HANG-3RD-CRTNS       PIC  9(05)    VALUE ZEROES.      02710003
027200     05  PV-HANG-3RD-SKUS        PIC  9(05)    VALUE ZEROES.      02720003
027300     05  PV-HANG-3RD-UNITS       PIC  9(05)    VALUE ZEROES.      02730003
027400     05  PV-HANG-4TH-CRTNS       PIC  9(05)    VALUE ZEROES.      02740003
027500     05  PV-HANG-4TH-SKUS        PIC  9(05)    VALUE ZEROES.      02750003
027600     05  PV-HANG-4TH-UNITS       PIC  9(05)    VALUE ZEROES.      02760003
027700     05  PV-HANG-TOT-CRTNS       PIC  9(05)    VALUE ZEROES.      02770003
027800     05  PV-HANG-TOT-SKUS        PIC  9(05)    VALUE ZEROES.      02780003
027900     05  PV-HANG-TOT-UNITS       PIC  9(05)    VALUE ZEROES.      02790003
028000*                                                                 02800003
028100* FOLD ACCUMULATORS                                               02810003
028200*                                                                 02820003
028300 01  PV-FOLD-VARIABLES.                                           02830011
028400     05  PV-FOLD-1ST-CRTNS       PIC  9(05)    VALUE ZEROES.      02840003
028500     05  PV-FOLD-1ST-SKUS        PIC  9(05)    VALUE ZEROES.      02850003
028600     05  PV-FOLD-1ST-UNITS       PIC  9(05)    VALUE ZEROES.      02860003
028700     05  PV-FOLD-2ND-CRTNS       PIC  9(05)    VALUE ZEROES.      02870003
028800     05  PV-FOLD-2ND-SKUS        PIC  9(05)    VALUE ZEROES.      02880003
028900     05  PV-FOLD-2ND-UNITS       PIC  9(05)    VALUE ZEROES.      02890003
029000     05  PV-FOLD-3RD-CRTNS       PIC  9(05)    VALUE ZEROES.      02900003
029100     05  PV-FOLD-3RD-SKUS        PIC  9(05)    VALUE ZEROES.      02910003
029200     05  PV-FOLD-3RD-UNITS       PIC  9(05)    VALUE ZEROES.      02920003
029300     05  PV-FOLD-4TH-CRTNS       PIC  9(05)    VALUE ZEROES.      02930003
029400     05  PV-FOLD-4TH-SKUS        PIC  9(05)    VALUE ZEROES.      02940003
029500     05  PV-FOLD-4TH-UNITS       PIC  9(05)    VALUE ZEROES.      02950003
029600     05  PV-FOLD-TOT-CRTNS       PIC  9(05)    VALUE ZEROES.      02960003
029700     05  PV-FOLD-TOT-SKUS        PIC  9(05)    VALUE ZEROES.      02970003
029800     05  PV-FOLD-TOT-UNITS       PIC  9(05)    VALUE ZEROES.      02980003
029900*                                                                 02990003
030000* ZERO ON HAND - REPLENISHMENT ACCUMULATORS                       03000003
030100*                                                                 03010003
030200 01  PV-OH-R-VARIABLES.                                           03020013
030300     05  PV-OH-R-1ST-CRTNS       PIC  9(05)    VALUE ZEROES.      03030003
030400     05  PV-OH-R-1ST-SKUS        PIC  9(05)    VALUE ZEROES.      03040003
030500     05  PV-OH-R-1ST-UNITS       PIC  9(05)    VALUE ZEROES.      03050003
030600     05  PV-OH-R-2ND-CRTNS       PIC  9(05)    VALUE ZEROES.      03060003
030700     05  PV-OH-R-2ND-SKUS        PIC  9(05)    VALUE ZEROES.      03070003
030800     05  PV-OH-R-2ND-UNITS       PIC  9(05)    VALUE ZEROES.      03080003
030900     05  PV-OH-R-3RD-CRTNS       PIC  9(05)    VALUE ZEROES.      03090003
031000     05  PV-OH-R-3RD-SKUS        PIC  9(05)    VALUE ZEROES.      03100003
031100     05  PV-OH-R-3RD-UNITS       PIC  9(05)    VALUE ZEROES.      03110003
031200     05  PV-OH-R-4TH-CRTNS       PIC  9(05)    VALUE ZEROES.      03120003
031300     05  PV-OH-R-4TH-SKUS        PIC  9(05)    VALUE ZEROES.      03130003
031400     05  PV-OH-R-4TH-UNITS       PIC  9(05)    VALUE ZEROES.      03140003
031500     05  PV-OH-R-TOT-CRTNS       PIC  9(05)    VALUE ZEROES.      03150003
031600     05  PV-OH-R-TOT-SKUS        PIC  9(05)    VALUE ZEROES.      03160003
031700     05  PV-OH-R-TOT-UNITS       PIC  9(05)    VALUE ZEROES.      03170003
031800*                                                                 03180003
031900* ZERO ON HAND - NEW ACCUMULATORS                                 03190003
032000*                                                                 03200003
032100 01  PV-OH-N-VARIABLES.                                           03210013
032200     05  PV-OH-N-1ST-CRTNS       PIC  9(05)    VALUE ZEROES.      03220003
032300     05  PV-OH-N-1ST-SKUS        PIC  9(05)    VALUE ZEROES.      03230003
032400     05  PV-OH-N-1ST-UNITS       PIC  9(05)    VALUE ZEROES.      03240003
032500     05  PV-OH-N-2ND-CRTNS       PIC  9(05)    VALUE ZEROES.      03250003
032600     05  PV-OH-N-2ND-SKUS        PIC  9(05)    VALUE ZEROES.      03260003
032700     05  PV-OH-N-2ND-UNITS       PIC  9(05)    VALUE ZEROES.      03270003
032800     05  PV-OH-N-3RD-CRTNS       PIC  9(05)    VALUE ZEROES.      03280003
032900     05  PV-OH-N-3RD-SKUS        PIC  9(05)    VALUE ZEROES.      03290003
033000     05  PV-OH-N-3RD-UNITS       PIC  9(05)    VALUE ZEROES.      03300003
033100     05  PV-OH-N-4TH-CRTNS       PIC  9(05)    VALUE ZEROES.      03310003
033200     05  PV-OH-N-4TH-SKUS        PIC  9(05)    VALUE ZEROES.      03320003
033300     05  PV-OH-N-4TH-UNITS       PIC  9(05)    VALUE ZEROES.      03330003
033400     05  PV-OH-N-TOT-CRTNS       PIC  9(05)    VALUE ZEROES.      03340003
033500     05  PV-OH-N-TOT-SKUS        PIC  9(05)    VALUE ZEROES.      03350003
033600     05  PV-OH-N-TOT-UNITS       PIC  9(05)    VALUE ZEROES.      03360003
033700*                                                                 03370003
033800* EAS SECURITY TAG NEEDED - ACCUMULATORS                          03380003
033900*                                                                 03390003
034000 01  PV-EAS-VARIABLES.                                            03400011
034100     05  PV-EAS-1ST-CRTNS        PIC  9(05)    VALUE ZEROES.      03410003
034200     05  PV-EAS-1ST-SKUS         PIC  9(05)    VALUE ZEROES.      03420003
034300     05  PV-EAS-1ST-UNITS        PIC  9(05)    VALUE ZEROES.      03430003
034400     05  PV-EAS-2ND-CRTNS        PIC  9(05)    VALUE ZEROES.      03440003
034500     05  PV-EAS-2ND-SKUS         PIC  9(05)    VALUE ZEROES.      03450003
034600     05  PV-EAS-2ND-UNITS        PIC  9(05)    VALUE ZEROES.      03460003
034700     05  PV-EAS-3RD-CRTNS        PIC  9(05)    VALUE ZEROES.      03470003
034800     05  PV-EAS-3RD-SKUS         PIC  9(05)    VALUE ZEROES.      03480003
034900     05  PV-EAS-3RD-UNITS        PIC  9(05)    VALUE ZEROES.      03490003
035000     05  PV-EAS-4TH-CRTNS        PIC  9(05)    VALUE ZEROES.      03500003
035100     05  PV-EAS-4TH-SKUS         PIC  9(05)    VALUE ZEROES.      03510003
035200     05  PV-EAS-4TH-UNITS        PIC  9(05)    VALUE ZEROES.      03520003
035300     05  PV-EAS-TOT-CRTNS        PIC  9(05)    VALUE ZEROES.      03530003
035400     05  PV-EAS-TOT-SKUS         PIC  9(05)    VALUE ZEROES.      03540003
035500     05  PV-EAS-TOT-UNITS        PIC  9(05)    VALUE ZEROES.      03550003
035600*                                                                 03560003
035700* CLEARANCE - ACCUMULATORS                                        03570003
035800*                                                                 03580003
035900 01  PV-CLEAR-VARIABLES.                                          03590011
036000     05  PV-CLRNC-1ST-CRTNS      PIC  9(05)    VALUE ZEROES.      03600003
036100     05  PV-CLRNC-1ST-SKUS       PIC  9(05)    VALUE ZEROES.      03610003
036200     05  PV-CLRNC-1ST-UNITS      PIC  9(05)    VALUE ZEROES.      03620003
036300     05  PV-CLRNC-2ND-CRTNS      PIC  9(05)    VALUE ZEROES.      03630003
036400     05  PV-CLRNC-2ND-SKUS       PIC  9(05)    VALUE ZEROES.      03640003
036500     05  PV-CLRNC-2ND-UNITS      PIC  9(05)    VALUE ZEROES.      03650003
036600     05  PV-CLRNC-3RD-CRTNS      PIC  9(05)    VALUE ZEROES.      03660003
036700     05  PV-CLRNC-3RD-SKUS       PIC  9(05)    VALUE ZEROES.      03670003
036800     05  PV-CLRNC-3RD-UNITS      PIC  9(05)    VALUE ZEROES.      03680003
036900     05  PV-CLRNC-4TH-CRTNS      PIC  9(05)    VALUE ZEROES.      03690003
037000     05  PV-CLRNC-4TH-SKUS       PIC  9(05)    VALUE ZEROES.      03700003
037100     05  PV-CLRNC-4TH-UNITS      PIC  9(05)    VALUE ZEROES.      03710003
037200     05  PV-CLRNC-TOT-CRTNS      PIC  9(05)    VALUE ZEROES.      03720003
037300     05  PV-CLRNC-TOT-SKUS       PIC  9(05)    VALUE ZEROES.      03730003
037400     05  PV-CLRNC-TOT-UNITS      PIC  9(05)    VALUE ZEROES.      03740003
037500*                                                                 03750003
037600* FINAL TOTAL - ACCUMULATORS                                      03760003
037700*                                                                 03770003
037800 01  PV-FINAL-VARIABLES.                                          03780011
037900     05  PV-GRAND-1ST-CRTNS      PIC  9(05)    VALUE ZEROES.      03790003
038000     05  PV-GRAND-1ST-SKUS       PIC  9(05)    VALUE ZEROES.      03800003
038100     05  PV-GRAND-1ST-UNITS      PIC  9(05)    VALUE ZEROES.      03810003
038200     05  PV-GRAND-2ND-CRTNS      PIC  9(05)    VALUE ZEROES.      03820003
038300     05  PV-GRAND-2ND-SKUS       PIC  9(05)    VALUE ZEROES.      03830003
038400     05  PV-GRAND-2ND-UNITS      PIC  9(05)    VALUE ZEROES.      03840003
038500     05  PV-GRAND-3RD-CRTNS      PIC  9(05)    VALUE ZEROES.      03850003
038600     05  PV-GRAND-3RD-SKUS       PIC  9(05)    VALUE ZEROES.      03860003
038700     05  PV-GRAND-3RD-UNITS      PIC  9(05)    VALUE ZEROES.      03870003
038800     05  PV-GRAND-4TH-CRTNS      PIC  9(05)    VALUE ZEROES.      03880003
038900     05  PV-GRAND-4TH-SKUS       PIC  9(05)    VALUE ZEROES.      03890003
039000     05  PV-GRAND-4TH-UNITS      PIC  9(05)    VALUE ZEROES.      03900003
039100     05  PV-GRAND-TOT-CRTNS      PIC  9(05)    VALUE ZEROES.      03910003
039200     05  PV-GRAND-TOT-SKUS       PIC  9(05)    VALUE ZEROES.      03920003
039300     05  PV-GRAND-TOT-UNITS      PIC  9(05)    VALUE ZEROES.      03930003
039400                                                                  03940003
039500                                                                  03950003
039600                                                                  03960003
039700*                                                                 03970001
039800*    05  PV-DB2-FUNCTION             PIC X(30) VALUE SPACE.       03980001
039900*                                                                 03990001
040000*                                                  COMP SYNC.     04000001
040100*    05  PV-ABEND-PARA-NAME          PIC X(30)     VALUE SPACES.  04010001
040200*    05  PV-DB2-OPERATION-MSG-1      PIC X(40)     VALUE SPACES.  04020001
040300*    05  PV-DB2-OPERATION-MSG-2      PIC X(40)     VALUE SPACES.  04030001
040400*    05  PV-DB2-TABLE-NAME           PIC X(12)     VALUE SPACES.  04040001
040500*    05  PV-PERCENT                   PIC S9(4)V9(3) COMP-3       04050001
040600*                                                    VALUE ZERO.  04060001
040700                                                                  04070001
040800                                                                  04080001
040900*    TRIP SUMMARY - INPUT FILE LAYOUT                             04090001
041000     COPY SURD069.                                                04100001
041100                                                                  04110001
041200/                                                                 04120001
041300*STANDARD REPORT HEADER FOR 132 COLUMN REPORT                     04130001
041400     COPY DPWS132.                                                04140001
041500                                                                  04150001
041600*                                                                 04160002
041700*** HEADING LINES                                                 04170002
041800*                                                                 04180002
041900 01  HEADING-LINE1.                                               04190001
042000     05  FILLER                  PIC  X(53)    VALUE SPACE.       04200002
042100     05  FILLER                  PIC  X(23)    VALUE              04210002
042200         'DAILY - TRAILER SUMMARY'.                               04220002
042300     05  FILLER                  PIC  X(56)    VALUE SPACE.       04230002
042400                                                                  04240001
042500 01  HEADING-LINE2.                                               04250001
042600     05  FILLER                  PIC  X(08)    VALUE 'STORE - '.  04260012
042700     05  HL2-STORE-NBR           PIC  9(04)    VALUE ZEROES.      04270099
042800     05  FILLER                  PIC  X(02)    VALUE SPACES.      04280077
042900     05  HL2-STORE-NAME          PIC  X(40)    VALUE SPACES.      04290041
043000     05  FILLER                  PIC  X(68)    VALUE SPACE.       04300077
043100                                                                  04310001
043200 01  HEADING-LINE3.                                               04320002
043300     05  FILLER                  PIC  X(08)    VALUE 'DC    - '.  04330012
043400     05  HL3-DC-NBR              PIC  Z(04)    VALUE ZEROES.      04340002
043500     05  FILLER                  PIC  X(02)    VALUE SPACES.      04350077
043600     05  HL3-DC-NAME             PIC  X(40)    VALUE SPACES.      04360041
043700     05  FILLER                  PIC  X(68)    VALUE SPACE.       04370077
043800                                                                  04380002
043900 01  HEADING-LINE4.                                               04390001
044000     05  FILLER                  PIC  X(17)    VALUE              04400002
044100                                 'TRAILER STATUS:  '.             04410002
044200     05  HL4-TRLR-STATUS         PIC  X(30)    VALUE SPACES.      04420041
044300     05  FILLER                  PIC  X(85)    VALUE SPACES.      04430041
044400                                                                  04440001
044500 01  HEADING-LINE5.                                               04450003
044600     05  FILLER                  PIC  X(17)    VALUE              04460002
044700                                 'SCAC:            '.             04470003
044800     05  HL5-SCAC                PIC  X(04)    VALUE SPACES.      04480005
044900     05  FILLER                  PIC  X(111)   VALUE SPACES.      04490003
045000                                                                  04500002
045100 01  HEADING-LINE6.                                               04510003
045200     05  FILLER                  PIC  X(17)    VALUE              04520003
045300                                 'TRAILER ID:      '.             04530003
045400     05  HL6-TRLR-ID             PIC  X(12)    VALUE SPACES.      04540005
045500     05  FILLER                  PIC  X(103)   VALUE SPACES.      04550003
045600                                                                  04560003
045700 01  HEADING-LINE7.                                               04570003
045800     05  FILLER                  PIC  X(17)    VALUE              04580003
045900                                 'TRAILER SERIAL:  '.             04590003
046000     05  HL7-TRLR-SRL            PIC  Z(09)    VALUE ZEROES.      04600017
046100     05  FILLER                  PIC  X(106)   VALUE SPACES.      04610003
046200                                                                  04620003
046300 01  HEADING-LINE8.                                               04630003
046400     05  FILLER                  PIC  X(14)    VALUE SPACES.      04640003
046500     05  FILLER                  PIC  X(08)    VALUE '1ST 25% '.  04650003
046600     05  FILLER                  PIC  X(08)    VALUE '1ST 25% '.  04660003
046700     05  FILLER                  PIC  X(08)    VALUE '1ST 25% '.  04670003
046800     05  FILLER                  PIC  X(08)    VALUE '2ND 25% '.  04680003
046900     05  FILLER                  PIC  X(08)    VALUE '2ND 25% '.  04690003
047000     05  FILLER                  PIC  X(08)    VALUE '2ND 25% '.  04700003
047100     05  FILLER                  PIC  X(08)    VALUE '3RD 25% '.  04710003
047200     05  FILLER                  PIC  X(08)    VALUE '3RD 25% '.  04720003
047300     05  FILLER                  PIC  X(08)    VALUE '3RD 25% '.  04730003
047400     05  FILLER                  PIC  X(08)    VALUE '4TH 25% '.  04740003
047500     05  FILLER                  PIC  X(08)    VALUE '4TH 25% '.  04750003
047600     05  FILLER                  PIC  X(08)    VALUE '4TH 25% '.  04760003
047700     05  FILLER                  PIC  X(07)    VALUE ' TOTAL '.   04770003
047800     05  FILLER                  PIC  X(07)    VALUE ' TOTAL '.   04780003
047900     05  FILLER                  PIC  X(08)    VALUE ' TOTAL  '.  04790003
048000     05  FILLER                  PIC  X(36)    VALUE SPACES.      04800012
048100                                                                  04810003
048200 01  HEADING-LINE9.                                               04820003
048300     05  FILLER                  PIC  X(14)    VALUE SPACES.      04830003
048400     05  FILLER                  PIC  X(08)    VALUE 'CARTONS '.  04840003
048500     05  FILLER                  PIC  X(08)    VALUE '  SKUS  '.  04850003
048600     05  FILLER                  PIC  X(08)    VALUE ' UNITS  '.  04860003
048700     05  FILLER                  PIC  X(08)    VALUE 'CARTONS '.  04870003
048800     05  FILLER                  PIC  X(08)    VALUE '  SKUS  '.  04880003
048900     05  FILLER                  PIC  X(08)    VALUE ' UNITS  '.  04890003
049000     05  FILLER                  PIC  X(08)    VALUE 'CARTONS '.  04900003
049100     05  FILLER                  PIC  X(08)    VALUE '  SKUS  '.  04910003
049200     05  FILLER                  PIC  X(08)    VALUE ' UNITS  '.  04920003
049300     05  FILLER                  PIC  X(08)    VALUE 'CARTONS '.  04930003
049400     05  FILLER                  PIC  X(08)    VALUE '  SKUS  '.  04940003
049500     05  FILLER                  PIC  X(08)    VALUE ' UNITS  '.  04950003
049600     05  FILLER                  PIC  X(07)    VALUE '  CTNS '.   04960003
049700     05  FILLER                  PIC  X(07)    VALUE '  SKUS '.   04970003
049800     05  FILLER                  PIC  X(08)    VALUE ' UNITS  '.  04980003
049900     05  FILLER                  PIC  X(36)    VALUE SPACES.      04990012
050000                                                                  05000003
050100                                                                  05010099
050200*                                                                 05020099
050300*** HARDLINE TOTALS                                               05030003
050400*                                                                 05040003
050500 01  TOTAL-LINE1.                                                 05050003
050600     05  FILLER                  PIC  X(14)    VALUE              05060003
050700                                 'HARDLINES     '.                05070003
050800     05  TL1-HARD-1ST-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05080003
050900     05  FILLER                  PIC  X(02)    VALUE SPACES.      05090003
051000     05  TL1-HARD-1ST-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05100003
051100     05  FILLER                  PIC  X(02)    VALUE SPACES.      05110003
051200     05  TL1-HARD-1ST-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05120003
051300     05  FILLER                  PIC  X(02)    VALUE SPACES.      05130003
051400     05  TL1-HARD-2ND-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05140003
051500     05  FILLER                  PIC  X(02)    VALUE SPACES.      05150003
051600     05  TL1-HARD-2ND-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05160003
051700     05  FILLER                  PIC  X(02)    VALUE SPACES.      05170003
051800     05  TL1-HARD-2ND-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05180003
051900     05  FILLER                  PIC  X(02)    VALUE SPACES.      05190003
052000     05  TL1-HARD-3RD-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05200003
052100     05  FILLER                  PIC  X(02)    VALUE SPACES.      05210003
052200     05  TL1-HARD-3RD-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05220003
052300     05  FILLER                  PIC  X(02)    VALUE SPACES.      05230003
052400     05  TL1-HARD-3RD-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05240003
052500     05  FILLER                  PIC  X(02)    VALUE SPACES.      05250003
052600     05  TL1-HARD-4TH-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05260003
052700     05  FILLER                  PIC  X(02)    VALUE SPACES.      05270003
052800     05  TL1-HARD-4TH-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05280003
052900     05  FILLER                  PIC  X(02)    VALUE SPACES.      05290003
053000     05  TL1-HARD-4TH-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05300003
053100     05  FILLER                  PIC  X(02)    VALUE SPACES.      05310003
053200     05  TL1-HARD-TOT-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05320003
053300     05  FILLER                  PIC  X(02)    VALUE SPACES.      05330003
053400     05  TL1-HARD-TOT-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05340003
053500     05  FILLER                  PIC  X(02)    VALUE SPACES.      05350003
053600     05  TL1-HARD-TOT-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05360003
053700     05  FILLER                  PIC  X(02)    VALUE SPACES.      05370003
053800                                                                  05380001
053900*                                                                 05390003
054000*** SOFTLINE TOTALS                                               05400003
054100*                                                                 05410003
054200 01  TOTAL-LINE2.                                                 05420003
054300     05  FILLER                  PIC  X(14)    VALUE              05430003
054400                                 'SOFTLINES     '.                05440003
054500     05  TL2-SOFT-1ST-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05450003
054600     05  FILLER                  PIC  X(02)    VALUE SPACES.      05460003
054700     05  TL2-SOFT-1ST-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05470003
054800     05  FILLER                  PIC  X(02)    VALUE SPACES.      05480003
054900     05  TL2-SOFT-1ST-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05490003
055000     05  FILLER                  PIC  X(02)    VALUE SPACES.      05500003
055100     05  TL2-SOFT-2ND-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05510003
055200     05  FILLER                  PIC  X(02)    VALUE SPACES.      05520003
055300     05  TL2-SOFT-2ND-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05530003
055400     05  FILLER                  PIC  X(02)    VALUE SPACES.      05540003
055500     05  TL2-SOFT-2ND-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05550003
055600     05  FILLER                  PIC  X(02)    VALUE SPACES.      05560003
055700     05  TL2-SOFT-3RD-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05570003
055800     05  FILLER                  PIC  X(02)    VALUE SPACES.      05580003
055900     05  TL2-SOFT-3RD-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05590003
056000     05  FILLER                  PIC  X(02)    VALUE SPACES.      05600003
056100     05  TL2-SOFT-3RD-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05610003
056200     05  FILLER                  PIC  X(02)    VALUE SPACES.      05620003
056300     05  TL2-SOFT-4TH-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05630003
056400     05  FILLER                  PIC  X(02)    VALUE SPACES.      05640003
056500     05  TL2-SOFT-4TH-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05650003
056600     05  FILLER                  PIC  X(02)    VALUE SPACES.      05660003
056700     05  TL2-SOFT-4TH-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05670003
056800     05  FILLER                  PIC  X(02)    VALUE SPACES.      05680003
056900     05  TL2-SOFT-TOT-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05690003
057000     05  FILLER                  PIC  X(02)    VALUE SPACES.      05700003
057100     05  TL2-SOFT-TOT-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05710003
057200     05  FILLER                  PIC  X(02)    VALUE SPACES.      05720003
057300     05  TL2-SOFT-TOT-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05730003
057400     05  FILLER                  PIC  X(02)    VALUE SPACES.      05740003
057500                                                                  05750003
057600*                                                                 05760003
057700*** HANG TOTALS                                                   05770003
057800*                                                                 05780003
057900 01  TOTAL-LINE3.                                                 05790003
058000     05  FILLER                  PIC  X(14)    VALUE              05800003
058100                                 'HANG          '.                05810003
058200     05  TL3-HANG-1ST-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05820003
058300     05  FILLER                  PIC  X(02)    VALUE SPACES.      05830003
058400     05  TL3-HANG-1ST-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05840003
058500     05  FILLER                  PIC  X(02)    VALUE SPACES.      05850003
058600     05  TL3-HANG-1ST-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05860003
058700     05  FILLER                  PIC  X(02)    VALUE SPACES.      05870003
058800     05  TL3-HANG-2ND-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05880003
058900     05  FILLER                  PIC  X(02)    VALUE SPACES.      05890003
059000     05  TL3-HANG-2ND-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05900003
059100     05  FILLER                  PIC  X(02)    VALUE SPACES.      05910003
059200     05  TL3-HANG-2ND-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05920003
059300     05  FILLER                  PIC  X(02)    VALUE SPACES.      05930003
059400     05  TL3-HANG-3RD-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      05940003
059500     05  FILLER                  PIC  X(02)    VALUE SPACES.      05950003
059600     05  TL3-HANG-3RD-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      05960003
059700     05  FILLER                  PIC  X(02)    VALUE SPACES.      05970003
059800     05  TL3-HANG-3RD-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      05980003
059900     05  FILLER                  PIC  X(02)    VALUE SPACES.      05990003
060000     05  TL3-HANG-4TH-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06000003
060100     05  FILLER                  PIC  X(02)    VALUE SPACES.      06010003
060200     05  TL3-HANG-4TH-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06020003
060300     05  FILLER                  PIC  X(02)    VALUE SPACES.      06030003
060400     05  TL3-HANG-4TH-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06040003
060500     05  FILLER                  PIC  X(02)    VALUE SPACES.      06050003
060600     05  TL3-HANG-TOT-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06060003
060700     05  FILLER                  PIC  X(02)    VALUE SPACES.      06070003
060800     05  TL3-HANG-TOT-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06080003
060900     05  FILLER                  PIC  X(02)    VALUE SPACES.      06090003
061000     05  TL3-HANG-TOT-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06100003
061100     05  FILLER                  PIC  X(02)    VALUE SPACES.      06110003
061200                                                                  06120003
061300*                                                                 06130003
061400*** FOLD TOTALS                                                   06140003
061500*                                                                 06150003
061600 01  TOTAL-LINE4.                                                 06160003
061700     05  FILLER                  PIC  X(14)    VALUE              06170003
061800                                 'FOLD          '.                06180003
061900     05  TL4-FOLD-1ST-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06190003
062000     05  FILLER                  PIC  X(02)    VALUE SPACES.      06200003
062100     05  TL4-FOLD-1ST-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06210003
062200     05  FILLER                  PIC  X(02)    VALUE SPACES.      06220003
062300     05  TL4-FOLD-1ST-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06230003
062400     05  FILLER                  PIC  X(02)    VALUE SPACES.      06240003
062500     05  TL4-FOLD-2ND-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06250003
062600     05  FILLER                  PIC  X(02)    VALUE SPACES.      06260003
062700     05  TL4-FOLD-2ND-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06270003
062800     05  FILLER                  PIC  X(02)    VALUE SPACES.      06280003
062900     05  TL4-FOLD-2ND-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06290003
063000     05  FILLER                  PIC  X(02)    VALUE SPACES.      06300003
063100     05  TL4-FOLD-3RD-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06310003
063200     05  FILLER                  PIC  X(02)    VALUE SPACES.      06320003
063300     05  TL4-FOLD-3RD-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06330003
063400     05  FILLER                  PIC  X(02)    VALUE SPACES.      06340003
063500     05  TL4-FOLD-3RD-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06350003
063600     05  FILLER                  PIC  X(02)    VALUE SPACES.      06360003
063700     05  TL4-FOLD-4TH-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06370003
063800     05  FILLER                  PIC  X(02)    VALUE SPACES.      06380003
063900     05  TL4-FOLD-4TH-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06390003
064000     05  FILLER                  PIC  X(02)    VALUE SPACES.      06400003
064100     05  TL4-FOLD-4TH-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06410003
064200     05  FILLER                  PIC  X(02)    VALUE SPACES.      06420003
064300     05  TL4-FOLD-TOT-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06430003
064400     05  FILLER                  PIC  X(02)    VALUE SPACES.      06440003
064500     05  TL4-FOLD-TOT-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06450003
064600     05  FILLER                  PIC  X(02)    VALUE SPACES.      06460003
064700     05  TL4-FOLD-TOT-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06470003
064800     05  FILLER                  PIC  X(02)    VALUE SPACES.      06480003
064900                                                                  06490003
065000*                                                                 06500003
065100*** ZERO ON HAND - REPLENISHMENT TOTALS                           06510003
065200*                                                                 06520003
065300 01  TOTAL-LINE5.                                                 06530003
065400     05  FILLER                  PIC  X(14)    VALUE              06540003
065500                                 '0-ON-HND REPL '.                06550003
065600     05  TL5-OH-R-1ST-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06560003
065700     05  FILLER                  PIC  X(02)    VALUE SPACES.      06570003
065800     05  TL5-OH-R-1ST-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06580003
065900     05  FILLER                  PIC  X(02)    VALUE SPACES.      06590003
066000     05  TL5-OH-R-1ST-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06600003
066100     05  FILLER                  PIC  X(02)    VALUE SPACES.      06610003
066200     05  TL5-OH-R-2ND-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06620003
066300     05  FILLER                  PIC  X(02)    VALUE SPACES.      06630003
066400     05  TL5-OH-R-2ND-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06640003
066500     05  FILLER                  PIC  X(02)    VALUE SPACES.      06650003
066600     05  TL5-OH-R-2ND-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06660003
066700     05  FILLER                  PIC  X(02)    VALUE SPACES.      06670003
066800     05  TL5-OH-R-3RD-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06680003
066900     05  FILLER                  PIC  X(02)    VALUE SPACES.      06690003
067000     05  TL5-OH-R-3RD-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06700003
067100     05  FILLER                  PIC  X(02)    VALUE SPACES.      06710003
067200     05  TL5-OH-R-3RD-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06720003
067300     05  FILLER                  PIC  X(02)    VALUE SPACES.      06730003
067400     05  TL5-OH-R-4TH-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06740003
067500     05  FILLER                  PIC  X(02)    VALUE SPACES.      06750003
067600     05  TL5-OH-R-4TH-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06760003
067700     05  FILLER                  PIC  X(02)    VALUE SPACES.      06770003
067800     05  TL5-OH-R-4TH-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06780003
067900     05  FILLER                  PIC  X(02)    VALUE SPACES.      06790003
068000     05  TL5-OH-R-TOT-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06800003
068100     05  FILLER                  PIC  X(02)    VALUE SPACES.      06810003
068200     05  TL5-OH-R-TOT-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06820003
068300     05  FILLER                  PIC  X(02)    VALUE SPACES.      06830003
068400     05  TL5-OH-R-TOT-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06840003
068500     05  FILLER                  PIC  X(02)    VALUE SPACES.      06850003
068600                                                                  06860003
068700*                                                                 06870003
068800*** ZERO ON HAND - NEW TOTALS                                     06880003
068900*                                                                 06890003
069000 01  TOTAL-LINE6.                                                 06900003
069100     05  FILLER                  PIC  X(14)    VALUE              06910003
069200                                 '0-ON-HND NEW  '.                06920003
069300     05  TL6-OH-N-1ST-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06930003
069400     05  FILLER                  PIC  X(02)    VALUE SPACES.      06940003
069500     05  TL6-OH-N-1ST-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      06950003
069600     05  FILLER                  PIC  X(02)    VALUE SPACES.      06960003
069700     05  TL6-OH-N-1ST-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      06970003
069800     05  FILLER                  PIC  X(02)    VALUE SPACES.      06980003
069900     05  TL6-OH-N-2ND-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      06990003
070000     05  FILLER                  PIC  X(02)    VALUE SPACES.      07000003
070100     05  TL6-OH-N-2ND-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      07010003
070200     05  FILLER                  PIC  X(02)    VALUE SPACES.      07020003
070300     05  TL6-OH-N-2ND-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      07030003
070400     05  FILLER                  PIC  X(02)    VALUE SPACES.      07040003
070500     05  TL6-OH-N-3RD-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      07050003
070600     05  FILLER                  PIC  X(02)    VALUE SPACES.      07060003
070700     05  TL6-OH-N-3RD-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      07070003
070800     05  FILLER                  PIC  X(02)    VALUE SPACES.      07080003
070900     05  TL6-OH-N-3RD-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      07090003
071000     05  FILLER                  PIC  X(02)    VALUE SPACES.      07100003
071100     05  TL6-OH-N-4TH-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      07110003
071200     05  FILLER                  PIC  X(02)    VALUE SPACES.      07120003
071300     05  TL6-OH-N-4TH-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      07130003
071400     05  FILLER                  PIC  X(02)    VALUE SPACES.      07140003
071500     05  TL6-OH-N-4TH-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      07150003
071600     05  FILLER                  PIC  X(02)    VALUE SPACES.      07160003
071700     05  TL6-OH-N-TOT-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.      07170003
071800     05  FILLER                  PIC  X(02)    VALUE SPACES.      07180003
071900     05  TL6-OH-N-TOT-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.      07190003
072000     05  FILLER                  PIC  X(02)    VALUE SPACES.      07200003
072100     05  TL6-OH-N-TOT-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.      07210003
072200     05  FILLER                  PIC  X(02)    VALUE SPACES.      07220003
072300                                                                  07230003
072400*                                                                 07240003
072500*** EAS SECURITY TAG NEEDED - TOTALS                              07250003
072600*                                                                 07260003
072700 01  TOTAL-LINE7.                                                 07270003
072800     05  FILLER                  PIC  X(14)    VALUE              07280003
072900                                 'EAS TAG       '.                07290003
073000     05  TL7-EAS-1ST-CRTNS       PIC ZZ,ZZ9    VALUE ZEROES.      07300003
073100     05  FILLER                  PIC  X(02)    VALUE SPACES.      07310003
073200     05  TL7-EAS-1ST-SKUS        PIC ZZ,ZZ9    VALUE ZEROES.      07320003
073300     05  FILLER                  PIC  X(02)    VALUE SPACES.      07330003
073400     05  TL7-EAS-1ST-UNITS       PIC ZZ,ZZ9    VALUE ZEROES.      07340003
073500     05  FILLER                  PIC  X(02)    VALUE SPACES.      07350003
073600     05  TL7-EAS-2ND-CRTNS       PIC ZZ,ZZ9    VALUE ZEROES.      07360003
073700     05  FILLER                  PIC  X(02)    VALUE SPACES.      07370003
073800     05  TL7-EAS-2ND-SKUS        PIC ZZ,ZZ9    VALUE ZEROES.      07380003
073900     05  FILLER                  PIC  X(02)    VALUE SPACES.      07390003
074000     05  TL7-EAS-2ND-UNITS       PIC ZZ,ZZ9    VALUE ZEROES.      07400003
074100     05  FILLER                  PIC  X(02)    VALUE SPACES.      07410003
074200     05  TL7-EAS-3RD-CRTNS       PIC ZZ,ZZ9    VALUE ZEROES.      07420003
074300     05  FILLER                  PIC  X(02)    VALUE SPACES.      07430003
074400     05  TL7-EAS-3RD-SKUS        PIC ZZ,ZZ9    VALUE ZEROES.      07440003
074500     05  FILLER                  PIC  X(02)    VALUE SPACES.      07450003
074600     05  TL7-EAS-3RD-UNITS       PIC ZZ,ZZ9    VALUE ZEROES.      07460003
074700     05  FILLER                  PIC  X(02)    VALUE SPACES.      07470003
074800     05  TL7-EAS-4TH-CRTNS       PIC ZZ,ZZ9    VALUE ZEROES.      07480003
074900     05  FILLER                  PIC  X(02)    VALUE SPACES.      07490003
075000     05  TL7-EAS-4TH-SKUS        PIC ZZ,ZZ9    VALUE ZEROES.      07500003
075100     05  FILLER                  PIC  X(02)    VALUE SPACES.      07510003
075200     05  TL7-EAS-4TH-UNITS       PIC ZZ,ZZ9    VALUE ZEROES.      07520003
075300     05  FILLER                  PIC  X(02)    VALUE SPACES.      07530003
075400     05  TL7-EAS-TOT-CRTNS       PIC ZZ,ZZ9    VALUE ZEROES.      07540003
075500     05  FILLER                  PIC  X(02)    VALUE SPACES.      07550003
075600     05  TL7-EAS-TOT-SKUS        PIC ZZ,ZZ9    VALUE ZEROES.      07560003
075700     05  FILLER                  PIC  X(02)    VALUE SPACES.      07570003
075800     05  TL7-EAS-TOT-UNITS       PIC ZZ,ZZ9    VALUE ZEROES.      07580003
075900     05  FILLER                  PIC  X(02)    VALUE SPACES.      07590003
076000                                                                  07600003
076100*                                                                 07610003
076200*** CLEARANCE - TOTALS                                            07620003
076300*                                                                 07630003
076400 01  TOTAL-LINE8.                                                 07640003
076500     05  FILLER                  PIC  X(14)    VALUE              07650003
076600                                 'CLEARANCE     '.                07660003
076700     05  TL8-CLRNC-1ST-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      07670003
076800     05  FILLER                  PIC  X(02)    VALUE SPACES.      07680003
076900     05  TL8-CLRNC-1ST-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      07690003
077000     05  FILLER                  PIC  X(02)    VALUE SPACES.      07700003
077100     05  TL8-CLRNC-1ST-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      07710003
077200     05  FILLER                  PIC  X(02)    VALUE SPACES.      07720003
077300     05  TL8-CLRNC-2ND-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      07730003
077400     05  FILLER                  PIC  X(02)    VALUE SPACES.      07740003
077500     05  TL8-CLRNC-2ND-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      07750003
077600     05  FILLER                  PIC  X(02)    VALUE SPACES.      07760003
077700     05  TL8-CLRNC-2ND-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      07770003
077800     05  FILLER                  PIC  X(02)    VALUE SPACES.      07780003
077900     05  TL8-CLRNC-3RD-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      07790003
078000     05  FILLER                  PIC  X(02)    VALUE SPACES.      07800003
078100     05  TL8-CLRNC-3RD-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      07810003
078200     05  FILLER                  PIC  X(02)    VALUE SPACES.      07820003
078300     05  TL8-CLRNC-3RD-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      07830003
078400     05  FILLER                  PIC  X(02)    VALUE SPACES.      07840003
078500     05  TL8-CLRNC-4TH-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      07850003
078600     05  FILLER                  PIC  X(02)    VALUE SPACES.      07860003
078700     05  TL8-CLRNC-4TH-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      07870003
078800     05  FILLER                  PIC  X(02)    VALUE SPACES.      07880003
078900     05  TL8-CLRNC-4TH-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      07890003
079000     05  FILLER                  PIC  X(02)    VALUE SPACES.      07900003
079100     05  TL8-CLRNC-TOT-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      07910003
079200     05  FILLER                  PIC  X(02)    VALUE SPACES.      07920003
079300     05  TL8-CLRNC-TOT-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      07930003
079400     05  FILLER                  PIC  X(02)    VALUE SPACES.      07940003
079500     05  TL8-CLRNC-TOT-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      07950003
079600     05  FILLER                  PIC  X(02)    VALUE SPACES.      07960003
079700                                                                  07970003
079800*                                                                 07980003
079900*** GRAND - TOTALS                                                07990003
080000*                                                                 08000003
080100 01  TOTAL-LINE9.                                                 08010003
080200     05  FILLER                  PIC  X(14)    VALUE              08020003
080300                                 'TOTALS        '.                08030003
080400     05  TL9-GRAND-1ST-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      08040003
080500     05  FILLER                  PIC  X(02)    VALUE SPACES.      08050003
080600     05  TL9-GRAND-1ST-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      08060003
080700     05  FILLER                  PIC  X(02)    VALUE SPACES.      08070003
080800     05  TL9-GRAND-1ST-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      08080003
080900     05  FILLER                  PIC  X(02)    VALUE SPACES.      08090003
081000     05  TL9-GRAND-2ND-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      08100003
081100     05  FILLER                  PIC  X(02)    VALUE SPACES.      08110003
081200     05  TL9-GRAND-2ND-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      08120003
081300     05  FILLER                  PIC  X(02)    VALUE SPACES.      08130003
081400     05  TL9-GRAND-2ND-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      08140003
081500     05  FILLER                  PIC  X(02)    VALUE SPACES.      08150003
081600     05  TL9-GRAND-3RD-CRTNS     PIC ZZ,ZZ9    VALUE ZEROES.      08160003
081700     05  FILLER                  PIC  X(02)    VALUE SPACES.      08170003
081800     05  TL9-GRAND-3RD-SKUS      PIC ZZ,ZZ9    VALUE ZEROES.      08180003
081900     05  FILLER                  PIC  X(02)    VALUE SPACES.      08190003
082000     05  TL9-GRAND-3RD-UNITS     PIC ZZ,ZZ9    VALUE ZEROES.      08200003
082100     05  FILLER                  PIC  X(02)    VALUE SPACES.      08210003
082200     05  TL9-GRAND-4TH-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.     08220003
082300     05  FILLER                  PIC  X(02)    VALUE SPACES.      08230003
082400     05  TL9-GRAND-4TH-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.     08240003
082500     05  FILLER                  PIC  X(02)    VALUE SPACES.      08250003
082600     05  TL9-GRAND-4TH-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.     08260003
082700     05  FILLER                  PIC  X(02)    VALUE SPACES.      08270003
082800     05  TL9-GRAND-TOT-CRTNS      PIC ZZ,ZZ9    VALUE ZEROES.     08280003
082900     05  FILLER                  PIC  X(02)    VALUE SPACES.      08290003
083000     05  TL9-GRAND-TOT-SKUS       PIC ZZ,ZZ9    VALUE ZEROES.     08300003
083100     05  FILLER                  PIC  X(02)    VALUE SPACES.      08310003
083200     05  TL9-GRAND-TOT-UNITS      PIC ZZ,ZZ9    VALUE ZEROES.     08320003
083300     05  FILLER                  PIC  X(02)    VALUE SPACES.      08330003
083400                                                                  08340003
083500*                                                                 08350003
083600*** MISCELLANEOUS LINES                                           08360003
083700*                                                                 08370003
083800 01  MISCELLANEOUS-LINES.                                         08380001
083900     05  END-OF-REPORT-LINE.                                      08390001
084000         10  FILLER                  PIC  X(44)    VALUE SPACES.  08400001
084100         10  FILLER                  PIC  X(45)    VALUE          08410001
084200             '*******   E N D   O F   R E P O R T   *******'.     08420001
084300         10  FILLER                  PIC  X(43)    VALUE SPACES.  08430001
084400     05  NO-DATA-TO-REPORT-LINE.                                  08440001
084500         10  FILLER                  PIC  X(40)    VALUE SPACES.  08450001
084600         10  FILLER                  PIC  X(52)    VALUE          08460001
084700         '*******  N O   D A T A   T O   R E P O R T   *******'.  08470001
084800         10  FILLER                  PIC  X(40)    VALUE SPACES.  08480001
084900     05  BL-BLANK-LINE               PIC X(132)    VALUE SPACE.   08490001
085000                                                                  08500001
085100*                                                                 08510004
085200*  COPY BOOK FOR XLT_LOC DATABASE                                 08520004
085300*                                                                 08530004
085400     EXEC SQL                                                     08540004
085500          INCLUDE XLT00010                                        08550004
085600     END-EXEC.                                                    08560004
085700*                                                                 08570004
085800*  COPY BOOK FOR TKRPRPM DATABASE (PARAMETERS)                    08580004
085900*                                                                 08590004
086000     EXEC SQL                                                     08600004
086100          INCLUDE TKRPRPM                                         08610004
086200     END-EXEC.                                                    08620004
086300*                                                                 08630005
086400*  COPY BOOK FOR TRAILER ID TABLE                                 08640005
086500*                                                                 08650005
086600     EXEC SQL                                                     08660005
086700          INCLUDE TCNTRID                                         08670005
086800     END-EXEC.                                                    08680005
086900*                                                                 08690005
087000*  COPY BOOK FOR STATUS CODE TABLE                                08700005
087100*                                                                 08710005
087200     EXEC SQL                                                     08720005
087300          INCLUDE TSUOBSC                                         08730005
087400     END-EXEC.                                                    08740005
087500*                                                                 08750012
087600*  COPY BOOK FOR SUM_TRIP_DTL_SUM                                 08760012
087700*                                                                 08770012
087800     EXEC SQL                                                     08780012
087900          INCLUDE SUT00095                                        08790012
088000     END-EXEC.                                                    08800012
088100*                                                                 08810025
088200*  COPY BOOK FOR SUM_TRIP_SUM                                     08820025
088300*                                                                 08830025
088400     EXEC SQL                                                     08840025
088500          INCLUDE SUT00007                                        08850025
088600     END-EXEC.                                                    08860025
088700*                                                                 08870013
088800*  COPY BOOK FOR OUTBOUND TRIP TABLE                              08880013
088900*                                                                 08890013
089000     EXEC SQL                                                     08900013
089100          INCLUDE TSUOBTR                                         08910013
089200     END-EXEC.                                                    08920013
089300                                                                  08930012
089400***************************************************************** 08940012
089500*  DB2 COMMUNICATION AREA                                         08950012
089600***************************************************************** 08960012
089700     EXEC SQL                                                     08970012
089800         INCLUDE SQLCA                                            08980012
089900     END-EXEC.                                                    08990012
090000                                                                  09000012
090100*---------------------------------------------------------------* 09010008
090200*   TRIP CURSOR - BRINGS BACK ALL SML/SKUS FOR A GIVEN TRIP     * 09020008
090300*---------------------------------------------------------------* 09030008
090400     EXEC SQL                                                     09040008
090500          DECLARE TRIP_SML_CSR CURSOR FOR                         09050008
090600              SELECT TRIP_OCRNC_ID                                09060008
090700                    ,DIVERT_TMST                                  09070008
090800                    ,SHIPT_UNT_ID                                 09080008
090900                    ,SKU_NBR                                      09090008
091000                    ,MDSE_LNE_CDE                                 09100008
091100                    ,HNG_FOLD_SEQ_NBR                             09110008
091200                    ,PRC_MSG_CDE                                  09120008
091300                    ,EAS_TAG_IND                                  09130008
091400                    ,UNT_QTY                                      09140008
091500                FROM SUT_TRIP_DTL_SUM                             09150008
091600               WHERE TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID    09160008
091700          ORDER BY                                                09170008
091800                DIVERT_TMST DESC                                  09180099
091900               ,SHIPT_UNT_ID                                      09190008
092000               ,SKU_NBR                                           09200008
092100     END-EXEC.                                                    09210008
092200                                                                  09220008
092300                                                                  09230008
092400*                                                                 09240008
092500                                                                  09250001
092600*    COPY DPWS004.                                                09260004
092700                                                                  09270001
092800     COPY SURD074.                                                09280099
092900/                                                                 09290001
093000 PROCEDURE DIVISION.                                              09300001
093100                                                                  09310001
093200******************************************************************09320006
093300*                                                                 09330006
093400******************************************************************09340006
093500 0000-MAINLINE.                                                   09350001
093600***  DISPLAY '0000-MAINLINE              '.                       09360048
093700                                                                  09370018
093800     PERFORM 1000-INITIALIZE.                                     09380001
093900                                                                  09390001
094000     PERFORM 2000-MAIN-PROCESS                                    09400001
094100         UNTIL PS-EOF-INPUT-YES                                   09410012
094200                                                                  09420001
094300**   PERFORM 9000-END-PROCESS.                                    09430013
094400                                                                  09440001
094500     GOBACK.                                                      09450001
094600                                                                  09460006
094700******************************************************************09470006
094800*                                                                 09480006
094900******************************************************************09490006
095000 1000-INITIALIZE.                                                 09500001
095100***  DISPLAY '1000-INITIALIZE            '.                       09510048
095200     OPEN INPUT  TRIP-FILE                                        09520001
095300          OUTPUT REPORT-FILE                                      09530099
095400                 OUTPUT-FILE.                                     09540099
095500                                                                  09550004
095600     ACCEPT PV-TODAYS-DATE FROM DATE YYYYMMDD.                    09560093
095700     ACCEPT PV-TODAYS-TIME FROM TIME.                             09570093
095800                                                                  09580093
095900     MOVE PV-TODAYS-DATE-MM        TO DP132-RUN-MONTH             09590099
096000                                      SU074-RUN-MONTH             09600099
096100     MOVE PV-TODAYS-DATE-DD        TO DP132-RUN-DAY               09610099
096200                                      SU074-RUN-DAY               09620099
096300     MOVE PV-TODAYS-DATE-CCYY      TO DP132-RUN-YEAR              09630099
096400                                                                  09640099
096500     MOVE PV-TODAYS-DATE-CCYY(3:2) TO SU074-RUN-YEAR              09650099
096600                                                                  09660099
096700     MOVE PV-TODAYS-TIME-HH        TO DP132-RUN-HOUR              09670099
096800                                      SU074-RUN-HOUR              09680099
096900     MOVE PV-TODAYS-TIME-MM        TO DP132-RUN-MINUTE            09690099
097000                                      SU074-RUN-MINUTES           09700099
097100     MOVE PC-CURRENT-PROGRAM-NAME  TO DP132-PROGRAM-NAME.         09710093
097200                                                                  09720093
097300     PERFORM 8000-READ-INPUT-FIRST-TIME                           09730004
097400       UNTIL PS-PROCESS-STORE-YES                                 09740004
097500          OR PS-EOF-INPUT-YES.                                    09750004
097600                                                                  09760004
097700     MOVE SU069-OTBND-TRIP-ID  TO  PV-TRIP-ID.                    09770077
097800     MOVE SU069-TRIP-OCRNC-ID  TO  PV-TRIP-OCRNC.                 09780085
097900     MOVE SU069-LOC-NBR        TO  PV-STORE-DEST.                 09790093
098000                                                                  09800077
098100     IF  PS-PROCESS-STORE-YES                                     09810005
098200         PERFORM 8040-GET-DC-STORE-NAME                           09820005
098300         PERFORM 8050-GET-TRAILER-INFO                            09830005
098400         PERFORM 8060-GET-STATUS-DESC                             09840005
098500     END-IF.                                                      09850005
098600                                                                  09860004
098700     PERFORM 8100-PRINT-REPORT-HEADINGS                           09870004
098800                                                                  09880004
098900     IF  PS-EOF-INPUT-YES                                         09890012
099000         SET PS-DATA-NO               TO TRUE                     09900097
099100         WRITE REPORT-RECORD                                      09910005
099200          FROM NO-DATA-TO-REPORT-LINE                             09920005
099300         AFTER ADVANCING 3 LINE                                   09930005
099400     ELSE                                                         09940005
099500         SET  PS-DATA-YES             TO TRUE                     09950097
099600         MOVE PV-STORE-NUMBER         TO PV-PREV-STORE            09960005
099700         MOVE PV-DC-NUMBER            TO PV-PREV-DC               09970005
099800         MOVE SU069-OTBND-TRIP-ID     TO PV-PREV-TRIP             09980005
099900         MOVE SU069-TRIP-OCRNC-ID     TO PV-PREV-ORCNC            09990011
100000     END-IF.                                                      10000005
100100                                                                  10010006
100200******************************************************************10020006
100300*                                                                 10030006
100400******************************************************************10040006
100500 2000-MAIN-PROCESS.                                               10050006
100600***  DISPLAY '2000-MAIN-PROCESS          '.                       10060048
100700                                                                  10070005
100800     IF  PS-PROCESS-STORE-YES                                     10080087
100900         EVALUATE TRUE                                            10090087
101000             WHEN SU069-OTBND-TRIP-ID  =  PV-PREV-TRIP            10100087
101100                  PERFORM 4000-PROCESS-TRIP                       10110087
101200             WHEN OTHER                                           10120087
101300                  MOVE  SU069-OTBND-TRIP-ID TO PV-TRIP-ID         10130087
101400                  MOVE  SU069-TRIP-OCRNC-ID TO PV-TRIP-OCRNC      10140087
101500                  IF  SU069-LOC-NBR  =  PV-STORE-DEST             10150093
101600                      CONTINUE                                    10160093
101700                  ELSE                                            10170093
101800                      MOVE  ZERO TO  PV-PAGE-COUNT                10180093
101900                      PERFORM 8040-GET-DC-STORE-NAME              10190093
102000                      MOVE SU069-LOC-NBR  TO  PV-STORE-DEST       10200093
102100                  END-IF                                          10210093
102200                  PERFORM 8050-GET-TRAILER-INFO                   10220092
102300                  PERFORM 8060-GET-STATUS-DESC                    10230092
102400                  PERFORM 8100-PRINT-REPORT-HEADINGS              10240091
102500                  PERFORM 4000-PROCESS-TRIP                       10250087
102600         END-EVALUATE                                             10260087
102700     END-IF.                                                      10270087
102800                                                                  10280005
102900     SET  PS-PROCESS-STORE-NO  TO  TRUE.                          10290031
103000                                                                  10300031
103100     PERFORM 8005-READ-TRIP-FILE.                                 10310087
103200                                                                  10320030
103300                                                                  10330030
103400******************************************************************10340011
103500*                                                                 10350011
103600******************************************************************10360011
103700 3000-TRIP-BREAK.                                                 10370011
103800     DISPLAY '3000-TRIP-BREAK            '                        10380078
103900              PV-TRIP-BEGIN-TMST  '   -   '                       10390078
104000              PV-TRIP-END-TMST.                                   10400078
104100                                                                  10410011
104200     ADD  PV-HARD-1ST-CRTNS                                       10420077
104300          PV-HARD-2ND-CRTNS                                       10430077
104400          PV-HARD-3RD-CRTNS                                       10440077
104500          PV-HARD-4TH-CRTNS                                       10450077
104600          GIVING  PV-HARD-TOT-CRTNS.                              10460077
104700                                                                  10470077
104800     ADD  PV-HARD-1ST-UNITS                                       10480077
104900          PV-HARD-2ND-UNITS                                       10490077
105000          PV-HARD-3RD-UNITS                                       10500077
105100          PV-HARD-4TH-UNITS                                       10510077
105200          GIVING  PV-HARD-TOT-UNITS.                              10520077
105300                                                                  10530077
105400     ADD  PV-SOFT-1ST-CRTNS                                       10540081
105500          PV-SOFT-2ND-CRTNS                                       10550081
105600          PV-SOFT-3RD-CRTNS                                       10560081
105700          PV-SOFT-4TH-CRTNS                                       10570081
105800          GIVING  PV-SOFT-TOT-CRTNS.                              10580081
105900                                                                  10590081
106000     ADD  PV-SOFT-1ST-UNITS                                       10600081
106100          PV-SOFT-2ND-UNITS                                       10610081
106200          PV-SOFT-3RD-UNITS                                       10620081
106300          PV-SOFT-4TH-UNITS                                       10630081
106400          GIVING  PV-SOFT-TOT-UNITS.                              10640081
106500                                                                  10650081
106600     ADD  PV-HANG-1ST-CRTNS                                       10660081
106700          PV-HANG-2ND-CRTNS                                       10670081
106800          PV-HANG-3RD-CRTNS                                       10680081
106900          PV-HANG-4TH-CRTNS                                       10690081
107000          GIVING  PV-HANG-TOT-CRTNS.                              10700081
107100                                                                  10710081
107200     ADD  PV-HANG-1ST-UNITS                                       10720081
107300          PV-HANG-2ND-UNITS                                       10730081
107400          PV-HANG-3RD-UNITS                                       10740081
107500          PV-HANG-4TH-UNITS                                       10750081
107600          GIVING  PV-HANG-TOT-UNITS.                              10760081
107700                                                                  10770081
107800     ADD  PV-FOLD-1ST-CRTNS                                       10780081
107900          PV-FOLD-2ND-CRTNS                                       10790081
108000          PV-FOLD-3RD-CRTNS                                       10800081
108100          PV-FOLD-4TH-CRTNS                                       10810081
108200          GIVING  PV-FOLD-TOT-CRTNS.                              10820081
108300                                                                  10830081
108400     ADD  PV-FOLD-1ST-UNITS                                       10840081
108500          PV-FOLD-2ND-UNITS                                       10850081
108600          PV-FOLD-3RD-UNITS                                       10860081
108700          PV-FOLD-4TH-UNITS                                       10870081
108800          GIVING  PV-FOLD-TOT-UNITS.                              10880081
108900                                                                  10890081
109000     ADD  PV-OH-R-1ST-CRTNS                                       10900081
109100          PV-OH-R-2ND-CRTNS                                       10910081
109200          PV-OH-R-3RD-CRTNS                                       10920081
109300          PV-OH-R-4TH-CRTNS                                       10930081
109400          GIVING  PV-OH-R-TOT-CRTNS.                              10940081
109500                                                                  10950081
109600     ADD  PV-OH-R-1ST-UNITS                                       10960081
109700          PV-OH-R-2ND-UNITS                                       10970081
109800          PV-OH-R-3RD-UNITS                                       10980081
109900          PV-OH-R-4TH-UNITS                                       10990081
110000          GIVING  PV-OH-R-TOT-UNITS.                              11000081
110100                                                                  11010081
110200     ADD  PV-OH-N-1ST-CRTNS                                       11020081
110300          PV-OH-N-2ND-CRTNS                                       11030081
110400          PV-OH-N-3RD-CRTNS                                       11040081
110500          PV-OH-N-4TH-CRTNS                                       11050081
110600          GIVING  PV-OH-N-TOT-CRTNS.                              11060081
110700                                                                  11070081
110800     ADD  PV-OH-N-1ST-UNITS                                       11080081
110900          PV-OH-N-2ND-UNITS                                       11090081
111000          PV-OH-N-3RD-UNITS                                       11100081
111100          PV-OH-N-4TH-UNITS                                       11110081
111200          GIVING  PV-OH-N-TOT-UNITS.                              11120081
111300                                                                  11130081
111400     ADD  PV-EAS-1ST-CRTNS                                        11140081
111500          PV-EAS-2ND-CRTNS                                        11150081
111600          PV-EAS-3RD-CRTNS                                        11160081
111700          PV-EAS-4TH-CRTNS                                        11170081
111800          GIVING  PV-EAS-TOT-CRTNS.                               11180081
111900                                                                  11190081
112000     ADD  PV-EAS-1ST-UNITS                                        11200081
112100          PV-EAS-2ND-UNITS                                        11210081
112200          PV-EAS-3RD-UNITS                                        11220081
112300          PV-EAS-4TH-UNITS                                        11230081
112400          GIVING  PV-EAS-TOT-UNITS.                               11240081
112500                                                                  11250081
112600     ADD  PV-CLRNC-1ST-CRTNS                                      11260081
112700          PV-CLRNC-2ND-CRTNS                                      11270081
112800          PV-CLRNC-3RD-CRTNS                                      11280081
112900          PV-CLRNC-4TH-CRTNS                                      11290081
113000          GIVING  PV-CLRNC-TOT-CRTNS.                             11300081
113100                                                                  11310081
113200     ADD  PV-CLRNC-1ST-UNITS                                      11320081
113300          PV-CLRNC-2ND-UNITS                                      11330081
113400          PV-CLRNC-3RD-UNITS                                      11340081
113500          PV-CLRNC-4TH-UNITS                                      11350081
113600          GIVING  PV-CLRNC-TOT-UNITS.                             11360081
113700                                                                  11370081
113800     ADD  PV-GRAND-1ST-CRTNS                                      11380081
113900          PV-GRAND-2ND-CRTNS                                      11390081
114000          PV-GRAND-3RD-CRTNS                                      11400081
114100          PV-GRAND-4TH-CRTNS                                      11410081
114200          GIVING  PV-GRAND-TOT-CRTNS.                             11420081
114300                                                                  11430081
114400     ADD  PV-GRAND-1ST-UNITS                                      11440081
114500          PV-GRAND-2ND-UNITS                                      11450081
114600          PV-GRAND-3RD-UNITS                                      11460081
114700          PV-GRAND-4TH-UNITS                                      11470081
114800          GIVING  PV-GRAND-TOT-UNITS.                             11480081
114900                                                                  11490081
115000     PERFORM 3010-GET-HARDLINE-SKUS.                              11500081
115100     PERFORM 3015-GET-SOFTLINE-SKUS.                              11510081
115200     PERFORM 3020-GET-HANG-SKUS.                                  11520081
115300     PERFORM 3025-GET-FOLD-SKUS.                                  11530081
115400     PERFORM 3030-GET-OH-R-SKUS.                                  11540081
115500     PERFORM 3035-GET-OH-N-SKUS.                                  11550081
115600     PERFORM 3040-GET-EAS-SKUS.                                   11560081
115700     PERFORM 3045-GET-CLRNC-SKUS.                                 11570081
115800     PERFORM 3050-GET-GRAND-SKUS.                                 11580081
115900                                                                  11590081
116000     MOVE PV-HARD-SKU-COUNT     TO  PV-HARD-TOT-SKUS.             11600081
116100     MOVE PV-SOFT-SKU-COUNT     TO  PV-SOFT-TOT-SKUS.             11610081
116200     MOVE PV-HANG-SKU-COUNT     TO  PV-HANG-TOT-SKUS.             11620081
116300     MOVE PV-FOLD-SKU-COUNT     TO  PV-FOLD-TOT-SKUS.             11630081
116400     MOVE PV-OH-R-SKU-COUNT     TO  PV-OH-R-TOT-SKUS.             11640081
116500     MOVE PV-OH-N-SKU-COUNT     TO  PV-OH-N-TOT-SKUS.             11650081
116600     MOVE PV-EAS-SKU-COUNT      TO  PV-EAS-TOT-SKUS.              11660081
116700     MOVE PV-CLEAR-SKU-COUNT    TO  PV-CLRNC-TOT-SKUS.            11670081
116800     MOVE PV-TOTAL-SKU-COUNT    TO  PV-GRAND-TOT-SKUS.            11680081
116900                                                                  11690077
117000*CREATE OUTPUT FILE                                               11700099
117100     INITIALIZE SU074-EXTRACT-RECORD                              11710099
117200     SET SU074-HARDLINES TO TRUE                                  11720099
117300     PERFORM 3005-GET-TRAILER-INFO                                11730099
117400     MOVE PV-HARD-1ST-CRTNS     TO  TL1-HARD-1ST-CRTNS            11740099
117500                                    SU074-TL1-HARD-1ST-CRTNS      11750099
117600     MOVE PV-HARD-1ST-SKUS      TO  TL1-HARD-1ST-SKUS             11760099
117700                                    SU074-TL1-HARD-1ST-SKUS       11770099
117800     MOVE PV-HARD-1ST-UNITS     TO  TL1-HARD-1ST-UNITS            11780099
117900                                    SU074-TL1-HARD-1ST-UNITS      11790099
118000     MOVE PV-HARD-2ND-CRTNS     TO  TL1-HARD-2ND-CRTNS            11800099
118100                                    SU074-TL1-HARD-2ND-CRTNS      11810099
118200     MOVE PV-HARD-2ND-SKUS      TO  TL1-HARD-2ND-SKUS             11820099
118300                                    SU074-TL1-HARD-2ND-SKUS       11830099
118400     MOVE PV-HARD-2ND-UNITS     TO  TL1-HARD-2ND-UNITS            11840099
118500                                    SU074-TL1-HARD-2ND-UNITS      11850099
118600     MOVE PV-HARD-3RD-CRTNS     TO  TL1-HARD-3RD-CRTNS            11860099
118700                                    SU074-TL1-HARD-3RD-CRTNS      11870099
118800     MOVE PV-HARD-3RD-SKUS      TO  TL1-HARD-3RD-SKUS             11880099
118900                                    SU074-TL1-HARD-3RD-SKUS       11890099
119000     MOVE PV-HARD-3RD-UNITS     TO  TL1-HARD-3RD-UNITS            11900099
119100                                    SU074-TL1-HARD-3RD-UNITS      11910099
119200     MOVE PV-HARD-4TH-CRTNS     TO  TL1-HARD-4TH-CRTNS            11920099
119300                                    SU074-TL1-HARD-4TH-CRTNS      11930099
119400     MOVE PV-HARD-4TH-SKUS      TO  TL1-HARD-4TH-SKUS             11940099
119500                                    SU074-TL1-HARD-4TH-SKUS       11950099
119600     MOVE PV-HARD-4TH-UNITS     TO  TL1-HARD-4TH-UNITS            11960099
119700                                    SU074-TL1-HARD-4TH-UNITS      11970099
119800     MOVE PV-HARD-TOT-CRTNS     TO  TL1-HARD-TOT-CRTNS            11980099
119900                                    SU074-TL1-HARD-TOT-CRTNS      11990099
120000     MOVE PV-HARD-TOT-SKUS      TO  TL1-HARD-TOT-SKUS             12000099
120100                                    SU074-TL1-HARD-TOT-SKUS       12010099
120200     MOVE PV-HARD-TOT-UNITS     TO  TL1-HARD-TOT-UNITS            12020099
120300                                    SU074-TL1-HARD-TOT-UNITS      12030099
120400     WRITE OUTPUT-RECORD                                          12040099
120500       FROM SU074-EXTRACT-RECORD                                  12050099
120600                                                                  12060099
120700                                                                  12070099
120800     INITIALIZE SU074-EXTRACT-RECORD                              12080099
120900     SET SU074-SOFTLINES TO TRUE                                  12090099
121000     PERFORM 3005-GET-TRAILER-INFO                                12100099
121100     MOVE PV-SOFT-1ST-CRTNS     TO  TL2-SOFT-1ST-CRTNS            12110099
121200                                    SU074-TL2-SOFT-1ST-CRTNS      12120099
121300     MOVE PV-SOFT-1ST-SKUS      TO  TL2-SOFT-1ST-SKUS             12130099
121400                                    SU074-TL2-SOFT-1ST-SKUS       12140099
121500     MOVE PV-SOFT-1ST-UNITS     TO  TL2-SOFT-1ST-UNITS            12150099
121600                                    SU074-TL2-SOFT-1ST-UNITS      12160099
121700     MOVE PV-SOFT-2ND-CRTNS     TO  TL2-SOFT-2ND-CRTNS            12170099
121800                                    SU074-TL2-SOFT-2ND-CRTNS      12180099
121900     MOVE PV-SOFT-2ND-SKUS      TO  TL2-SOFT-2ND-SKUS             12190099
122000                                    SU074-TL2-SOFT-2ND-SKUS       12200099
122100     MOVE PV-SOFT-2ND-UNITS     TO  TL2-SOFT-2ND-UNITS            12210099
122200                                    SU074-TL2-SOFT-2ND-UNITS      12220099
122300     MOVE PV-SOFT-3RD-CRTNS     TO  TL2-SOFT-3RD-CRTNS            12230099
122400                                    SU074-TL2-SOFT-3RD-CRTNS      12240099
122500     MOVE PV-SOFT-3RD-SKUS      TO  TL2-SOFT-3RD-SKUS             12250099
122600                                    SU074-TL2-SOFT-3RD-SKUS       12260099
122700     MOVE PV-SOFT-3RD-UNITS     TO  TL2-SOFT-3RD-UNITS            12270099
122800                                    SU074-TL2-SOFT-3RD-UNITS      12280099
122900     MOVE PV-SOFT-4TH-CRTNS     TO  TL2-SOFT-4TH-CRTNS            12290099
123000                                    SU074-TL2-SOFT-4TH-CRTNS      12300099
123100     MOVE PV-SOFT-4TH-SKUS      TO  TL2-SOFT-4TH-SKUS             12310099
123200                                    SU074-TL2-SOFT-4TH-SKUS       12320099
123300     MOVE PV-SOFT-4TH-UNITS     TO  TL2-SOFT-4TH-UNITS            12330099
123400                                    SU074-TL2-SOFT-4TH-UNITS      12340099
123500     MOVE PV-SOFT-TOT-CRTNS     TO  TL2-SOFT-TOT-CRTNS            12350099
123600                                    SU074-TL2-SOFT-TOT-CRTNS      12360099
123700     MOVE PV-SOFT-TOT-SKUS      TO  TL2-SOFT-TOT-SKUS             12370099
123800                                    SU074-TL2-SOFT-TOT-SKUS       12380099
123900     MOVE PV-SOFT-TOT-UNITS     TO  TL2-SOFT-TOT-UNITS            12390099
124000                                    SU074-TL2-SOFT-TOT-UNITS      12400099
124100     WRITE OUTPUT-RECORD                                          12410099
124200       FROM SU074-EXTRACT-RECORD                                  12420099
124300                                                                  12430099
124400                                                                  12440099
124500     INITIALIZE SU074-EXTRACT-RECORD                              12450099
124600     SET SU074-HANG TO TRUE                                       12460099
124700     PERFORM 3005-GET-TRAILER-INFO                                12470099
124800     MOVE PV-HANG-1ST-CRTNS     TO  TL3-HANG-1ST-CRTNS            12480099
124900                                    SU074-TL3-HANG-1ST-CRTNS      12490099
125000     MOVE PV-HANG-1ST-SKUS      TO  TL3-HANG-1ST-SKUS             12500099
125100                                    SU074-TL3-HANG-1ST-SKUS       12510099
125200     MOVE PV-HANG-1ST-UNITS     TO  TL3-HANG-1ST-UNITS            12520099
125300                                    SU074-TL3-HANG-1ST-UNITS      12530099
125400     MOVE PV-HANG-2ND-CRTNS     TO  TL3-HANG-2ND-CRTNS            12540099
125500                                    SU074-TL3-HANG-2ND-CRTNS      12550099
125600     MOVE PV-HANG-2ND-SKUS      TO  TL3-HANG-2ND-SKUS             12560099
125700                                    SU074-TL3-HANG-2ND-SKUS       12570099
125800     MOVE PV-HANG-2ND-UNITS     TO  TL3-HANG-2ND-UNITS            12580099
125900                                    SU074-TL3-HANG-2ND-UNITS      12590099
126000     MOVE PV-HANG-3RD-CRTNS     TO  TL3-HANG-3RD-CRTNS            12600099
126100                                    SU074-TL3-HANG-3RD-CRTNS      12610099
126200     MOVE PV-HANG-3RD-SKUS      TO  TL3-HANG-3RD-SKUS             12620099
126300                                    SU074-TL3-HANG-3RD-SKUS       12630099
126400     MOVE PV-HANG-3RD-UNITS     TO  TL3-HANG-3RD-UNITS            12640099
126500                                    SU074-TL3-HANG-3RD-UNITS      12650099
126600     MOVE PV-HANG-4TH-CRTNS     TO  TL3-HANG-4TH-CRTNS            12660099
126700                                    SU074-TL3-HANG-4TH-CRTNS      12670099
126800     MOVE PV-HANG-4TH-SKUS      TO  TL3-HANG-4TH-SKUS             12680099
126900                                    SU074-TL3-HANG-4TH-SKUS       12690099
127000     MOVE PV-HANG-4TH-UNITS     TO  TL3-HANG-4TH-UNITS            12700099
127100                                    SU074-TL3-HANG-4TH-UNITS      12710099
127200     MOVE PV-HANG-TOT-CRTNS     TO  TL3-HANG-TOT-CRTNS            12720099
127300                                    SU074-TL3-HANG-TOT-CRTNS      12730099
127400     MOVE PV-HANG-TOT-SKUS      TO  TL3-HANG-TOT-SKUS             12740099
127500                                    SU074-TL3-HANG-TOT-SKUS       12750099
127600     MOVE PV-HANG-TOT-UNITS     TO  TL3-HANG-TOT-UNITS            12760099
127700                                    SU074-TL3-HANG-TOT-UNITS      12770099
127800     WRITE OUTPUT-RECORD                                          12780099
127900       FROM SU074-EXTRACT-RECORD                                  12790099
128000                                                                  12800099
128100                                                                  12810099
128200     INITIALIZE SU074-EXTRACT-RECORD                              12820099
128300     SET SU074-FOLD TO TRUE                                       12830099
128400     PERFORM 3005-GET-TRAILER-INFO                                12840099
128500     MOVE PV-FOLD-1ST-CRTNS     TO  TL4-FOLD-1ST-CRTNS            12850099
128600                                    SU074-TL4-FOLD-1ST-CRTNS      12860099
128700     MOVE PV-FOLD-1ST-SKUS      TO  TL4-FOLD-1ST-SKUS             12870099
128800                                    SU074-TL4-FOLD-1ST-SKUS       12880099
128900     MOVE PV-FOLD-1ST-UNITS     TO  TL4-FOLD-1ST-UNITS            12890099
129000                                    SU074-TL4-FOLD-1ST-UNITS      12900099
129100     MOVE PV-FOLD-2ND-CRTNS     TO  TL4-FOLD-2ND-CRTNS            12910099
129200                                    SU074-TL4-FOLD-2ND-CRTNS      12920099
129300     MOVE PV-FOLD-2ND-SKUS      TO  TL4-FOLD-2ND-SKUS             12930099
129400                                    SU074-TL4-FOLD-2ND-SKUS       12940099
129500     MOVE PV-FOLD-2ND-UNITS     TO  TL4-FOLD-2ND-UNITS            12950099
129600                                    SU074-TL4-FOLD-2ND-UNITS      12960099
129700     MOVE PV-FOLD-3RD-CRTNS     TO  TL4-FOLD-3RD-CRTNS            12970099
129800                                    SU074-TL4-FOLD-3RD-CRTNS      12980099
129900     MOVE PV-FOLD-3RD-SKUS      TO  TL4-FOLD-3RD-SKUS             12990099
130000                                    SU074-TL4-FOLD-3RD-SKUS       13000099
130100     MOVE PV-FOLD-3RD-UNITS     TO  TL4-FOLD-3RD-UNITS            13010099
130200                                    SU074-TL4-FOLD-3RD-UNITS      13020099
130300     MOVE PV-FOLD-4TH-CRTNS     TO  TL4-FOLD-4TH-CRTNS            13030099
130400                                    SU074-TL4-FOLD-4TH-CRTNS      13040099
130500     MOVE PV-FOLD-4TH-SKUS      TO  TL4-FOLD-4TH-SKUS             13050099
130600                                    SU074-TL4-FOLD-4TH-SKUS       13060099
130700     MOVE PV-FOLD-4TH-UNITS     TO  TL4-FOLD-4TH-UNITS            13070099
130800                                    SU074-TL4-FOLD-4TH-UNITS      13080099
130900     MOVE PV-FOLD-TOT-CRTNS     TO  TL4-FOLD-TOT-CRTNS            13090099
131000                                    SU074-TL4-FOLD-TOT-CRTNS      13100099
131100     MOVE PV-FOLD-TOT-SKUS      TO  TL4-FOLD-TOT-SKUS             13110099
131200                                    SU074-TL4-FOLD-TOT-SKUS       13120099
131300     MOVE PV-FOLD-TOT-UNITS     TO  TL4-FOLD-TOT-UNITS            13130099
131400                                    SU074-TL4-FOLD-TOT-UNITS      13140099
131500     WRITE OUTPUT-RECORD                                          13150099
131600       FROM SU074-EXTRACT-RECORD                                  13160099
131700                                                                  13170099
131800                                                                  13180099
131900     INITIALIZE SU074-EXTRACT-RECORD                              13190099
132000     SET SU074-0-ON-HAND-REPL TO TRUE                             13200099
132100     PERFORM 3005-GET-TRAILER-INFO                                13210099
132200     MOVE PV-OH-R-1ST-CRTNS     TO  TL5-OH-R-1ST-CRTNS            13220099
132300                                    SU074-TL5-OH-R-1ST-CRTNS      13230099
132400     MOVE PV-OH-R-1ST-SKUS      TO  TL5-OH-R-1ST-SKUS             13240099
132500                                    SU074-TL5-OH-R-1ST-SKUS       13250099
132600     MOVE PV-OH-R-1ST-UNITS     TO  TL5-OH-R-1ST-UNITS            13260099
132700                                    SU074-TL5-OH-R-1ST-UNITS      13270099
132800     MOVE PV-OH-R-2ND-CRTNS     TO  TL5-OH-R-2ND-CRTNS            13280099
132900                                    SU074-TL5-OH-R-2ND-CRTNS      13290099
133000     MOVE PV-OH-R-2ND-SKUS      TO  TL5-OH-R-2ND-SKUS             13300099
133100                                    SU074-TL5-OH-R-2ND-SKUS       13310099
133200     MOVE PV-OH-R-2ND-UNITS     TO  TL5-OH-R-2ND-UNITS            13320099
133300                                    SU074-TL5-OH-R-2ND-UNITS      13330099
133400     MOVE PV-OH-R-3RD-CRTNS     TO  TL5-OH-R-3RD-CRTNS            13340099
133500                                    SU074-TL5-OH-R-3RD-CRTNS      13350099
133600     MOVE PV-OH-R-3RD-SKUS      TO  TL5-OH-R-3RD-SKUS             13360099
133700                                    SU074-TL5-OH-R-3RD-SKUS       13370099
133800     MOVE PV-OH-R-3RD-UNITS     TO  TL5-OH-R-3RD-UNITS            13380099
133900                                    SU074-TL5-OH-R-3RD-UNITS      13390099
134000     MOVE PV-OH-R-4TH-CRTNS     TO  TL5-OH-R-4TH-CRTNS            13400099
134100                                    SU074-TL5-OH-R-4TH-CRTNS      13410099
134200     MOVE PV-OH-R-4TH-SKUS      TO  TL5-OH-R-4TH-SKUS             13420099
134300                                    SU074-TL5-OH-R-4TH-SKUS       13430099
134400     MOVE PV-OH-R-4TH-UNITS     TO  TL5-OH-R-4TH-UNITS            13440099
134500                                    SU074-TL5-OH-R-4TH-UNITS      13450099
134600     MOVE PV-OH-R-TOT-CRTNS     TO  TL5-OH-R-TOT-CRTNS            13460099
134700                                    SU074-TL5-OH-R-TOT-CRTNS      13470099
134800     MOVE PV-OH-R-TOT-SKUS      TO  TL5-OH-R-TOT-SKUS             13480099
134900                                    SU074-TL5-OH-R-TOT-SKUS       13490099
135000     MOVE PV-OH-R-TOT-UNITS     TO  TL5-OH-R-TOT-UNITS            13500099
135100                                    SU074-TL5-OH-R-TOT-UNITS      13510099
135200     WRITE OUTPUT-RECORD                                          13520099
135300       FROM SU074-EXTRACT-RECORD                                  13530099
135400                                                                  13540099
135500                                                                  13550099
135600     INITIALIZE SU074-EXTRACT-RECORD                              13560099
135700     SET SU074-0-ON-HAND-NEW TO TRUE                              13570099
135800     PERFORM 3005-GET-TRAILER-INFO                                13580099
135900     MOVE PV-OH-N-1ST-CRTNS     TO  TL6-OH-N-1ST-CRTNS            13590099
136000                                    SU074-TL6-OH-N-1ST-CRTNS      13600099
136100     MOVE PV-OH-N-1ST-SKUS      TO  TL6-OH-N-1ST-SKUS             13610099
136200                                    SU074-TL6-OH-N-1ST-SKUS       13620099
136300     MOVE PV-OH-N-1ST-UNITS     TO  TL6-OH-N-1ST-UNITS            13630099
136400                                    SU074-TL6-OH-N-1ST-UNITS      13640099
136500     MOVE PV-OH-N-2ND-CRTNS     TO  TL6-OH-N-2ND-CRTNS            13650099
136600                                    SU074-TL6-OH-N-2ND-CRTNS      13660099
136700     MOVE PV-OH-N-2ND-SKUS      TO  TL6-OH-N-2ND-SKUS             13670099
136800                                    SU074-TL6-OH-N-2ND-SKUS       13680099
136900     MOVE PV-OH-N-2ND-UNITS     TO  TL6-OH-N-2ND-UNITS            13690099
137000                                    SU074-TL6-OH-N-2ND-UNITS      13700099
137100     MOVE PV-OH-N-3RD-CRTNS     TO  TL6-OH-N-3RD-CRTNS            13710099
137200                                    SU074-TL6-OH-N-3RD-CRTNS      13720099
137300     MOVE PV-OH-N-3RD-SKUS      TO  TL6-OH-N-3RD-SKUS             13730099
137400                                    SU074-TL6-OH-N-3RD-SKUS       13740099
137500     MOVE PV-OH-N-3RD-UNITS     TO  TL6-OH-N-3RD-UNITS            13750099
137600                                    SU074-TL6-OH-N-3RD-UNITS      13760099
137700     MOVE PV-OH-N-4TH-CRTNS     TO  TL6-OH-N-4TH-CRTNS            13770099
137800                                    SU074-TL6-OH-N-4TH-CRTNS      13780099
137900     MOVE PV-OH-N-4TH-SKUS      TO  TL6-OH-N-4TH-SKUS             13790099
138000                                    SU074-TL6-OH-N-4TH-SKUS       13800099
138100     MOVE PV-OH-N-4TH-UNITS     TO  TL6-OH-N-4TH-UNITS            13810099
138200                                    SU074-TL6-OH-N-4TH-UNITS      13820099
138300     MOVE PV-OH-N-TOT-CRTNS     TO  TL6-OH-N-TOT-CRTNS            13830099
138400                                    SU074-TL6-OH-N-TOT-CRTNS      13840099
138500     MOVE PV-OH-N-TOT-SKUS      TO  TL6-OH-N-TOT-SKUS             13850099
138600                                    SU074-TL6-OH-N-TOT-SKUS       13860099
138700     MOVE PV-OH-N-TOT-UNITS     TO  TL6-OH-N-TOT-UNITS            13870099
138800                                    SU074-TL6-OH-N-TOT-UNITS      13880099
138900     WRITE OUTPUT-RECORD                                          13890099
139000       FROM SU074-EXTRACT-RECORD                                  13900099
139100                                                                  13910099
139200                                                                  13920099
139300     INITIALIZE SU074-EXTRACT-RECORD                              13930099
139400     SET SU074-EAS-TAG TO TRUE                                    13940099
139500     PERFORM 3005-GET-TRAILER-INFO                                13950099
139600     MOVE PV-EAS-1ST-CRTNS      TO  TL7-EAS-1ST-CRTNS             13960099
139700                                    SU074-TL7-EAS-1ST-CRTNS       13970099
139800     MOVE PV-EAS-1ST-SKUS       TO  TL7-EAS-1ST-SKUS              13980099
139900                                    SU074-TL7-EAS-1ST-SKUS        13990099
140000     MOVE PV-EAS-1ST-UNITS      TO  TL7-EAS-1ST-UNITS             14000099
140100                                    SU074-TL7-EAS-1ST-UNITS       14010099
140200     MOVE PV-EAS-2ND-CRTNS      TO  TL7-EAS-2ND-CRTNS             14020099
140300                                    SU074-TL7-EAS-2ND-CRTNS       14030099
140400     MOVE PV-EAS-2ND-SKUS       TO  TL7-EAS-2ND-SKUS              14040099
140500                                    SU074-TL7-EAS-2ND-SKUS        14050099
140600     MOVE PV-EAS-2ND-UNITS      TO  TL7-EAS-2ND-UNITS             14060099
140700                                    SU074-TL7-EAS-2ND-UNITS       14070099
140800     MOVE PV-EAS-3RD-CRTNS      TO  TL7-EAS-3RD-CRTNS             14080099
140900                                    SU074-TL7-EAS-3RD-CRTNS       14090099
141000     MOVE PV-EAS-3RD-SKUS       TO  TL7-EAS-3RD-SKUS              14100099
141100                                    SU074-TL7-EAS-3RD-SKUS        14110099
141200     MOVE PV-EAS-3RD-UNITS      TO  TL7-EAS-3RD-UNITS             14120099
141300                                    SU074-TL7-EAS-3RD-UNITS       14130099
141400     MOVE PV-EAS-4TH-CRTNS      TO  TL7-EAS-4TH-CRTNS             14140099
141500                                    SU074-TL7-EAS-4TH-CRTNS       14150099
141600     MOVE PV-EAS-4TH-SKUS       TO  TL7-EAS-4TH-SKUS              14160099
141700                                    SU074-TL7-EAS-4TH-SKUS        14170099
141800     MOVE PV-EAS-4TH-UNITS      TO  TL7-EAS-4TH-UNITS             14180099
141900                                    SU074-TL7-EAS-4TH-UNITS       14190099
142000     MOVE PV-EAS-TOT-CRTNS      TO  TL7-EAS-TOT-CRTNS             14200099
142100                                    SU074-TL7-EAS-TOT-CRTNS       14210099
142200     MOVE PV-EAS-TOT-SKUS       TO  TL7-EAS-TOT-SKUS              14220099
142300                                    SU074-TL7-EAS-TOT-SKUS        14230099
142400     MOVE PV-EAS-TOT-UNITS      TO  TL7-EAS-TOT-UNITS             14240099
142500                                    SU074-TL7-EAS-TOT-UNITS       14250099
142600     WRITE OUTPUT-RECORD                                          14260099
142700       FROM SU074-EXTRACT-RECORD                                  14270099
142800                                                                  14280099
142900                                                                  14290099
143000     INITIALIZE SU074-EXTRACT-RECORD                              14300099
143100     SET SU074-CLEARANCE TO TRUE                                  14310099
143200     PERFORM 3005-GET-TRAILER-INFO                                14320099
143300     MOVE PV-CLRNC-1ST-CRTNS    TO  TL8-CLRNC-1ST-CRTNS           14330099
143400                                    SU074-TL8-CLRNC-1ST-CRTNS     14340099
143500     MOVE PV-CLRNC-1ST-SKUS     TO  TL8-CLRNC-1ST-SKUS            14350099
143600                                    SU074-TL8-CLRNC-1ST-SKUS      14360099
143700     MOVE PV-CLRNC-1ST-UNITS    TO  TL8-CLRNC-1ST-UNITS           14370099
143800                                    SU074-TL8-CLRNC-1ST-UNITS     14380099
143900     MOVE PV-CLRNC-2ND-CRTNS    TO  TL8-CLRNC-2ND-CRTNS           14390099
144000                                    SU074-TL8-CLRNC-2ND-CRTNS     14400099
144100     MOVE PV-CLRNC-2ND-SKUS     TO  TL8-CLRNC-2ND-SKUS            14410099
144200                                    SU074-TL8-CLRNC-2ND-SKUS      14420099
144300     MOVE PV-CLRNC-2ND-UNITS    TO  TL8-CLRNC-2ND-UNITS           14430099
144400                                    SU074-TL8-CLRNC-2ND-UNITS     14440099
144500     MOVE PV-CLRNC-3RD-CRTNS    TO  TL8-CLRNC-3RD-CRTNS           14450099
144600                                    SU074-TL8-CLRNC-3RD-CRTNS     14460099
144700     MOVE PV-CLRNC-3RD-SKUS     TO  TL8-CLRNC-3RD-SKUS            14470099
144800                                    SU074-TL8-CLRNC-3RD-SKUS      14480099
144900     MOVE PV-CLRNC-3RD-UNITS    TO  TL8-CLRNC-3RD-UNITS           14490099
145000                                    SU074-TL8-CLRNC-3RD-UNITS     14500099
145100     MOVE PV-CLRNC-4TH-CRTNS    TO  TL8-CLRNC-4TH-CRTNS           14510099
145200                                    SU074-TL8-CLRNC-4TH-CRTNS     14520099
145300     MOVE PV-CLRNC-4TH-SKUS     TO  TL8-CLRNC-4TH-SKUS            14530099
145400                                    SU074-TL8-CLRNC-4TH-SKUS      14540099
145500     MOVE PV-CLRNC-4TH-UNITS    TO  TL8-CLRNC-4TH-UNITS           14550099
145600                                    SU074-TL8-CLRNC-4TH-UNITS     14560099
145700     MOVE PV-CLRNC-TOT-CRTNS    TO  TL8-CLRNC-TOT-CRTNS           14570099
145800                                    SU074-TL8-CLRNC-TOT-CRTNS     14580099
145900     MOVE PV-CLRNC-TOT-SKUS     TO  TL8-CLRNC-TOT-SKUS            14590099
146000                                    SU074-TL8-CLRNC-TOT-SKUS      14600099
146100     MOVE PV-CLRNC-TOT-UNITS    TO  TL8-CLRNC-TOT-UNITS           14610099
146200                                    SU074-TL8-CLRNC-TOT-UNITS     14620099
146300     WRITE OUTPUT-RECORD                                          14630099
146400       FROM SU074-EXTRACT-RECORD                                  14640099
146500                                                                  14650099
146600                                                                  14660099
146700     INITIALIZE SU074-EXTRACT-RECORD                              14670099
146800     SET SU074-PRCNT-TOTALS TO TRUE                               14680099
146900     PERFORM 3005-GET-TRAILER-INFO                                14690099
147000     MOVE PV-GRAND-1ST-CRTNS    TO  TL9-GRAND-1ST-CRTNS           14700099
147100                                    SU074-TL9-GRAND-1ST-CRTNS     14710099
147200     MOVE PV-GRAND-1ST-SKUS     TO  TL9-GRAND-1ST-SKUS            14720099
147300                                    SU074-TL9-GRAND-1ST-SKUS      14730099
147400     MOVE PV-GRAND-1ST-UNITS    TO  TL9-GRAND-1ST-UNITS           14740099
147500                                    SU074-TL9-GRAND-1ST-UNITS     14750099
147600     MOVE PV-GRAND-2ND-CRTNS    TO  TL9-GRAND-2ND-CRTNS           14760099
147700                                    SU074-TL9-GRAND-2ND-CRTNS     14770099
147800     MOVE PV-GRAND-2ND-SKUS     TO  TL9-GRAND-2ND-SKUS            14780099
147900                                    SU074-TL9-GRAND-2ND-SKUS      14790099
148000     MOVE PV-GRAND-2ND-UNITS    TO  TL9-GRAND-2ND-UNITS           14800099
148100                                    SU074-TL9-GRAND-2ND-UNITS     14810099
148200     MOVE PV-GRAND-3RD-CRTNS    TO  TL9-GRAND-3RD-CRTNS           14820099
148300                                    SU074-TL9-GRAND-3RD-CRTNS     14830099
148400     MOVE PV-GRAND-3RD-SKUS     TO  TL9-GRAND-3RD-SKUS            14840099
148500                                    SU074-TL9-GRAND-3RD-SKUS      14850099
148600     MOVE PV-GRAND-3RD-UNITS    TO  TL9-GRAND-3RD-UNITS           14860099
148700                                    SU074-TL9-GRAND-3RD-UNITS     14870099
148800     MOVE PV-GRAND-4TH-CRTNS    TO  TL9-GRAND-4TH-CRTNS           14880099
148900                                    SU074-TL9-GRAND-4TH-CRTNS     14890099
149000     MOVE PV-GRAND-4TH-SKUS     TO  TL9-GRAND-4TH-SKUS            14900099
149100                                    SU074-TL9-GRAND-4TH-SKUS      14910099
149200     MOVE PV-GRAND-4TH-UNITS    TO  TL9-GRAND-4TH-UNITS           14920099
149300                                    SU074-TL9-GRAND-4TH-UNITS     14930099
149400     MOVE PV-GRAND-TOT-CRTNS    TO  TL9-GRAND-TOT-CRTNS           14940099
149500                                    SU074-TL9-GRAND-TOT-CRTNS     14950099
149600     MOVE PV-GRAND-TOT-SKUS     TO  TL9-GRAND-TOT-SKUS            14960099
149700                                    SU074-TL9-GRAND-TOT-SKUS      14970099
149800     MOVE PV-GRAND-TOT-UNITS    TO  TL9-GRAND-TOT-UNITS           14980099
149900                                    SU074-TL9-GRAND-TOT-UNITS     14990099
150000     WRITE OUTPUT-RECORD                                          15000099
150100       FROM SU074-EXTRACT-RECORD.                                 15010099
150200                                                                  15020011
150300                                                                  15030099
150400     PERFORM 8120-PRINT-REPORT.                                   15040011
150500                                                                  15050006
150600     INITIALIZE PV-HARD-VARIABLES                                 15060011
150700                PV-SOFT-VARIABLES                                 15070011
150800                PV-HANG-VARIABLES                                 15080011
150900                PV-FOLD-VARIABLES                                 15090011
151000                PV-OH-R-VARIABLES                                 15100011
151100                PV-OH-N-VARIABLES                                 15110011
151200                PV-EAS-VARIABLES                                  15120011
151300                PV-CLEAR-VARIABLES                                15130011
151400                PV-FINAL-VARIABLES.                               15140011
151500                                                                  15150011
151600                                                                  15160077
151700******************************************************************15170077
151800*                                                                 15180077
151900 3005-GET-TRAILER-INFO.                                           15190099
152000     MOVE PV-TODAYS-DATE-MM          TO SU074-RUN-MONTH           15200099
152100                                                                  15210099
152200     MOVE PV-TODAYS-DATE-DD          TO SU074-RUN-DAY             15220099
152300                                                                  15230099
152400     MOVE PV-TODAYS-DATE-CCYY(3:2)   TO SU074-RUN-YEAR            15240099
152500                                                                  15250099
152600     MOVE PV-TODAYS-TIME-HH          TO SU074-RUN-HOUR            15260099
152700                                                                  15270099
152800     MOVE PV-TODAYS-TIME-MM          TO SU074-RUN-MINUTES         15280099
152900                                                                  15290099
153000     MOVE  SU069-LOC-NBR             TO SU074-STORE-NBR           15300099
153100                                                                  15310099
153200     MOVE  PV-STORE-NAME             TO SU074-STORE-NAME          15320099
153300                                                                  15330099
153400     MOVE  PV-DC-NUMBER              TO SU074-DC-NBR              15340099
153500                                                                  15350099
153600     MOVE  PV-DC-NAME                TO SU074-DC-NAME             15360099
153700                                                                  15370099
153800     MOVE  PV-TRIP-STATUS            TO SU074-TRLR-STATUS         15380099
153900                                                                  15390099
154000     MOVE  PV-DC-SCAC                TO SU074-SCAC                15400099
154100                                                                  15410099
154200     MOVE  PV-DC-TRLR-ID             TO SU074-TRLR-ID             15420099
154300                                                                  15430099
154400     MOVE  SU069-OTBND-TRIP-SRL-NBR  TO SU074-TRLR-SRL.           15440099
154500                                                                  15450099
154600******************************************************************15460077
154700 3010-GET-HARDLINE-SKUS.                                          15470077
154800***  DISPLAY '3010-GET-HARDLINE-SKUS      '.                      15480099
154900                                                                  15490077
155000     MOVE '3010-GET-HARDLINE-SKUS      '                          15500077
155100                                 TO  PV-PARAGRAPH-NAME.           15510077
155200     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       15520077
155300     MOVE '                              '  TO  PV-TABLE-2.       15530077
155400     MOVE '                              '  TO  PV-TABLE-3.       15540077
155500                                                                  15550077
155600     MOVE  PV-TRIP-OCRNC         TO  SUT00095-TRIP-OCRNC-ID       15560085
155700                                                                  15570077
155800     EXEC SQL                                                     15580077
155900          SELECT COUNT(DISTINCT(SKU_NBR))                         15590077
156000            INTO :PV-HARD-SKU-COUNT                               15600078
156100            FROM SUT_TRIP_DTL_SUM                                 15610077
156200           WHERE TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID        15620077
156300             AND DIVERT_TMST   >=  :PV-TRIP-BEGIN-TMST            15630099
156400             AND DIVERT_TMST   <=  :PV-TRIP-END-TMST              15640099
156500             AND MDSE_LNE_CDE   =  'H'                            15650077
156600     END-EXEC.                                                    15660077
156700                                                                  15670077
156800     EVALUATE TRUE                                                15680077
156900         WHEN SQLCODE = ZEROS                                     15690077
157000              CONTINUE                                            15700077
157100         WHEN OTHER                                               15710077
157200              PERFORM Z999-SQL-ERROR                              15720077
157300     END-EVALUATE.                                                15730077
157400                                                                  15740077
157500                                                                  15750077
157600******************************************************************15760077
157700*                                                                 15770077
157800******************************************************************15780077
157900 3015-GET-SOFTLINE-SKUS.                                          15790077
158000***  DISPLAY '3015-GET-SOFTLINE-SKUS      '.                      15800099
158100                                                                  15810077
158200     MOVE '3015-GET-SOFTLINE-SKUS      '                          15820077
158300                                 TO  PV-PARAGRAPH-NAME.           15830077
158400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       15840077
158500     MOVE '                              '  TO  PV-TABLE-2.       15850077
158600     MOVE '                              '  TO  PV-TABLE-3.       15860077
158700                                                                  15870077
158800     EXEC SQL                                                     15880077
158900          SELECT COUNT(DISTINCT(SKU_NBR))                         15890077
159000            INTO :PV-SOFT-SKU-COUNT                               15900078
159100            FROM SUT_TRIP_DTL_SUM                                 15910077
159200           WHERE TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID        15920077
159300             AND DIVERT_TMST   >=  :PV-TRIP-BEGIN-TMST            15930099
159400             AND DIVERT_TMST   <=  :PV-TRIP-END-TMST              15940099
159500             AND MDSE_LNE_CDE   =  'S'                            15950077
159600     END-EXEC.                                                    15960077
159700                                                                  15970077
159800     EVALUATE TRUE                                                15980077
159900         WHEN SQLCODE = ZEROS                                     15990077
160000              CONTINUE                                            16000077
160100         WHEN OTHER                                               16010077
160200              PERFORM Z999-SQL-ERROR                              16020077
160300     END-EVALUATE.                                                16030077
160400                                                                  16040077
160500                                                                  16050077
160600******************************************************************16060077
160700*                                                                 16070077
160800******************************************************************16080077
160900 3020-GET-HANG-SKUS.                                              16090077
161000***  DISPLAY '3020-GET-HANG-SKUS          '.                      16100099
161100                                                                  16110077
161200     MOVE '3020-GET-HANG-SKUS          '                          16120077
161300                                 TO  PV-PARAGRAPH-NAME.           16130077
161400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       16140077
161500     MOVE '                              '  TO  PV-TABLE-2.       16150077
161600     MOVE '                              '  TO  PV-TABLE-3.       16160077
161700                                                                  16170077
161800     EXEC SQL                                                     16180077
161900          SELECT COUNT(DISTINCT(SKU_NBR))                         16190077
162000            INTO :PV-HANG-SKU-COUNT                               16200078
162100            FROM SUT_TRIP_DTL_SUM                                 16210077
162200           WHERE TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     16220077
162300             AND DIVERT_TMST      >=  :PV-TRIP-BEGIN-TMST         16230099
162400             AND DIVERT_TMST      <=  :PV-TRIP-END-TMST           16240099
162500             AND HNG_FOLD_SEQ_NBR  =  1                           16250077
162600     END-EXEC.                                                    16260077
162700                                                                  16270077
162800     EVALUATE TRUE                                                16280077
162900         WHEN SQLCODE = ZEROS                                     16290077
163000              CONTINUE                                            16300077
163100         WHEN OTHER                                               16310077
163200              PERFORM Z999-SQL-ERROR                              16320077
163300     END-EVALUATE.                                                16330077
163400                                                                  16340077
163500                                                                  16350077
163600******************************************************************16360077
163700*                                                                 16370077
163800******************************************************************16380077
163900 3025-GET-FOLD-SKUS.                                              16390077
164000***  DISPLAY '3025-GET-FOLD-SKUS          '.                      16400099
164100                                                                  16410077
164200     MOVE '3025-GET-FOLD-SKUS          '                          16420077
164300                                 TO  PV-PARAGRAPH-NAME.           16430077
164400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       16440077
164500     MOVE '                              '  TO  PV-TABLE-2.       16450077
164600     MOVE '                              '  TO  PV-TABLE-3.       16460077
164700                                                                  16470077
164800     EXEC SQL                                                     16480077
164900          SELECT COUNT(DISTINCT(SKU_NBR))                         16490077
165000            INTO :PV-FOLD-SKU-COUNT                               16500078
165100            FROM SUT_TRIP_DTL_SUM                                 16510077
165200           WHERE TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     16520077
165300             AND DIVERT_TMST      >=  :PV-TRIP-BEGIN-TMST         16530099
165400             AND DIVERT_TMST      <=  :PV-TRIP-END-TMST           16540099
165500             AND HNG_FOLD_SEQ_NBR  =  2                           16550077
165600     END-EXEC.                                                    16560077
165700                                                                  16570077
165800     EVALUATE TRUE                                                16580077
165900         WHEN SQLCODE = ZEROS                                     16590077
166000              CONTINUE                                            16600077
166100         WHEN OTHER                                               16610077
166200              PERFORM Z999-SQL-ERROR                              16620077
166300     END-EVALUATE.                                                16630077
166400                                                                  16640077
166500                                                                  16650077
166600******************************************************************16660077
166700*                                                                 16670077
166800******************************************************************16680077
166900 3030-GET-OH-R-SKUS.                                              16690077
167000***  DISPLAY '3030-GET-OH-R-SKUS          '.                      16700099
167100                                                                  16710077
167200     MOVE '3030-GET-OH-R-SKUS          '                          16720077
167300                                 TO  PV-PARAGRAPH-NAME.           16730077
167400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       16740077
167500     MOVE '                              '  TO  PV-TABLE-2.       16750077
167600     MOVE '                              '  TO  PV-TABLE-3.       16760077
167700                                                                  16770077
167800     EXEC SQL                                                     16780077
167900          SELECT COUNT(DISTINCT(SKU_NBR))                         16790077
168000            INTO :PV-OH-R-SKU-COUNT                               16800078
168100            FROM SUT_TRIP_DTL_SUM                                 16810077
168200           WHERE TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     16820077
168300             AND DIVERT_TMST      >=  :PV-TRIP-BEGIN-TMST         16830099
168400             AND DIVERT_TMST      <=  :PV-TRIP-END-TMST           16840099
168500             AND PRC_MSG_CDE       =  'RP'                        16850077
168600     END-EXEC.                                                    16860077
168700                                                                  16870077
168800     EVALUATE TRUE                                                16880077
168900         WHEN SQLCODE = ZEROS                                     16890077
169000              CONTINUE                                            16900077
169100         WHEN OTHER                                               16910077
169200              PERFORM Z999-SQL-ERROR                              16920077
169300     END-EVALUATE.                                                16930077
169400                                                                  16940077
169500                                                                  16950077
169600******************************************************************16960077
169700*                                                                 16970077
169800******************************************************************16980077
169900 3035-GET-OH-N-SKUS.                                              16990077
170000***  DISPLAY '3035-GET-OH-N-SKUS          '.                      17000099
170100                                                                  17010077
170200     MOVE '3035-GET-OH-N-SKUS          '                          17020077
170300                                 TO  PV-PARAGRAPH-NAME.           17030077
170400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       17040077
170500     MOVE '                              '  TO  PV-TABLE-2.       17050077
170600     MOVE '                              '  TO  PV-TABLE-3.       17060077
170700                                                                  17070077
170800     EXEC SQL                                                     17080077
170900          SELECT COUNT(DISTINCT(SKU_NBR))                         17090077
171000            INTO :PV-OH-N-SKU-COUNT                               17100078
171100            FROM SUT_TRIP_DTL_SUM                                 17110077
171200           WHERE TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     17120077
171300             AND DIVERT_TMST      >=  :PV-TRIP-BEGIN-TMST         17130099
171400             AND DIVERT_TMST      <=  :PV-TRIP-END-TMST           17140099
171500             AND PRC_MSG_CDE       =  'RF'                        17150099
171600     END-EXEC.                                                    17160077
171700                                                                  17170077
171800     EVALUATE TRUE                                                17180077
171900         WHEN SQLCODE = ZEROS                                     17190077
172000              CONTINUE                                            17200077
172100         WHEN OTHER                                               17210077
172200              PERFORM Z999-SQL-ERROR                              17220077
172300     END-EVALUATE.                                                17230077
172400                                                                  17240077
172500                                                                  17250077
172600******************************************************************17260077
172700*                                                                 17270077
172800******************************************************************17280077
172900 3040-GET-EAS-SKUS.                                               17290077
173000***  DISPLAY '3040-GET-EAS-SKUS          '.                       17300099
173100                                                                  17310077
173200     MOVE '3040-GET-EAS-SKUS          '                           17320077
173300                                 TO  PV-PARAGRAPH-NAME.           17330077
173400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       17340077
173500     MOVE '                              '  TO  PV-TABLE-2.       17350077
173600     MOVE '                              '  TO  PV-TABLE-3.       17360077
173700                                                                  17370077
173800     EXEC SQL                                                     17380077
173900          SELECT COUNT(DISTINCT(SKU_NBR))                         17390077
174000            INTO :PV-EAS-SKU-COUNT                                17400078
174100            FROM SUT_TRIP_DTL_SUM                                 17410077
174200           WHERE TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     17420077
174300             AND DIVERT_TMST      >=  :PV-TRIP-BEGIN-TMST         17430099
174400             AND DIVERT_TMST      <=  :PV-TRIP-END-TMST           17440099
174500             AND EAS_TAG_IND       =  'Y'                         17450077
174600     END-EXEC.                                                    17460077
174700                                                                  17470077
174800     EVALUATE TRUE                                                17480077
174900         WHEN SQLCODE = ZEROS                                     17490077
175000              CONTINUE                                            17500077
175100         WHEN OTHER                                               17510077
175200              PERFORM Z999-SQL-ERROR                              17520077
175300     END-EVALUATE.                                                17530077
175400                                                                  17540077
175500                                                                  17550077
175600******************************************************************17560077
175700*                                                                 17570077
175800******************************************************************17580077
175900 3045-GET-CLRNC-SKUS.                                             17590077
176000***  DISPLAY '3045-GET-CLRNC-SKUS          '.                     17600099
176100                                                                  17610077
176200     MOVE '3045-GET-CLRNC-SKUS          '                         17620077
176300                                 TO  PV-PARAGRAPH-NAME.           17630077
176400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       17640077
176500     MOVE '                              '  TO  PV-TABLE-2.       17650077
176600     MOVE '                              '  TO  PV-TABLE-3.       17660077
176700                                                                  17670077
176800     EXEC SQL                                                     17680077
176900          SELECT COUNT(DISTINCT(SKU_NBR))                         17690077
177000            INTO :PV-CLEAR-SKU-COUNT                              17700078
177100            FROM SUT_TRIP_DTL_SUM                                 17710077
177200           WHERE TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     17720077
177300             AND DIVERT_TMST      >=  :PV-TRIP-BEGIN-TMST         17730099
177400             AND DIVERT_TMST      <=  :PV-TRIP-END-TMST           17740099
177500             AND PRC_MSG_CDE       =  'CL'                        17750077
177600     END-EXEC.                                                    17760077
177700                                                                  17770077
177800     EVALUATE TRUE                                                17780077
177900         WHEN SQLCODE = ZEROS                                     17790077
178000              CONTINUE                                            17800077
178100         WHEN OTHER                                               17810077
178200              PERFORM Z999-SQL-ERROR                              17820077
178300     END-EVALUATE.                                                17830077
178400                                                                  17840077
178500                                                                  17850077
178600******************************************************************17860077
178700*                                                                 17870077
178800******************************************************************17880077
178900 3050-GET-GRAND-SKUS.                                             17890077
179000***  DISPLAY '3050-GET-GRAND-SKUS          '.                     17900099
179100                                                                  17910077
179200     MOVE '3050-GET-GRAND-SKUS          '                         17920077
179300                                 TO  PV-PARAGRAPH-NAME.           17930077
179400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       17940077
179500     MOVE '                              '  TO  PV-TABLE-2.       17950077
179600     MOVE '                              '  TO  PV-TABLE-3.       17960077
179700                                                                  17970077
179800     EXEC SQL                                                     17980077
179900          SELECT COUNT(DISTINCT(SKU_NBR))                         17990077
180000            INTO :PV-TOTAL-SKU-COUNT                              18000078
180100            FROM SUT_TRIP_DTL_SUM                                 18010077
180200           WHERE TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     18020077
180300             AND DIVERT_TMST      >=  :PV-TRIP-BEGIN-TMST         18030099
180400             AND DIVERT_TMST      <=  :PV-TRIP-END-TMST           18040099
180500     END-EXEC.                                                    18050077
180600                                                                  18060077
180700     EVALUATE TRUE                                                18070077
180800         WHEN SQLCODE = ZEROS                                     18080077
180900              CONTINUE                                            18090077
181000         WHEN OTHER                                               18100077
181100              PERFORM Z999-SQL-ERROR                              18110077
181200     END-EVALUATE.                                                18120077
181300                                                                  18130011
181400                                                                  18140077
181500******************************************************************18150011
181600*                                                                 18160006
181700******************************************************************18170006
181800 4000-PROCESS-TRIP.                                               18180007
181900***  DISPLAY '4000-PROCESS-TRIP          '.                       18190097
182000                                                                  18200007
182100     PERFORM 8070-GET-TRIP-BEGIN-END-TMST.                        18210013
182200                                                                  18220007
182300     PERFORM 8075-GET-TRIP-CARTON-COUNT.                          18230025
182400                                                                  18240025
182500*    DETERMINE THE NUMBER OF CARTONS THAT ARE IN EACH 1/4 OF THE  18250013
182600*    TRAILER - THE REMAINDER GETS ADDED TO THE 4TH 1/4 OF THE     18260013
182700*    TRAILER.                                                     18270013
182800                                                                  18280013
182900     DIVIDE     PV-TRIP-CARTON-COUNT                              18290025
183000         BY     4                                                 18300013
183100     GIVING     PV-CRTNS-PER-QUARTER                              18310013
183200     REMAINDER  PV-CRTNS-PER-QUARTER-REM.                         18320013
183300                                                                  18330008
183400     MOVE  PV-TRIP-CARTON-COUNT      TO  PV-DISP-TRIP-COUNT.      18340099
183500     MOVE  PV-CRTNS-PER-QUARTER      TO  PV-DISP-QUART-COUNT.     18350099
183600     MOVE  PV-CRTNS-PER-QUARTER-REM  TO  PV-DISP-CART-REMAIN.     18360099
183700     DISPLAY 'TRIP CARTON COUNT:'     PV-DISP-TRIP-COUNT          18370099
183800             '  CARTONS PER QUARTER:' PV-DISP-QUART-COUNT         18380099
183900             '  CARTONS REMAINDER:'   PV-DISP-CART-REMAIN.        18390099
184000                                                                  18400025
184100     MOVE  PV-CRTNS-PER-QUARTER     TO  PV-CRTNS-1ST-QUART        18410025
184200                                        PV-CRTNS-2ND-QUART        18420025
184300                                        PV-CRTNS-3RD-QUART        18430025
184400                                        PV-CRTNS-4TH-QUART.       18440025
184500***                                                               18450099
184600     IF  PV-CRTNS-PER-QUARTER-REM  >  0                           18460099
184700         ADD  1  TO  PV-CRTNS-1ST-QUART                           18470099
184800         SUBTRACT 1  FROM  PV-CRTNS-PER-QUARTER-REM               18480099
184900     END-IF.                                                      18490099
185000     IF  PV-CRTNS-PER-QUARTER-REM  >  0                           18500099
185100         ADD  1  TO  PV-CRTNS-2ND-QUART                           18510099
185200         SUBTRACT 1  FROM  PV-CRTNS-PER-QUARTER-REM               18520099
185300     END-IF.                                                      18530099
185400     IF  PV-CRTNS-PER-QUARTER-REM  >  0                           18540099
185500         ADD  1  TO  PV-CRTNS-3RD-QUART                           18550099
185600         SUBTRACT 1  FROM  PV-CRTNS-PER-QUARTER-REM               18560099
185700     END-IF.                                                      18570099
185800     IF  PV-CRTNS-PER-QUARTER-REM  >  0                           18580099
185900         ADD PV-CRTNS-PER-QUARTER-REM  TO  PV-CRTNS-4TH-QUART     18590099
186000     END-IF.                                                      18600099
186100***                                                               18610099
186200     INITIALIZE PV-PREV-SML.                                      18620025
186300                                                                  18630025
186400*    THE CURSOR BELOW WILL SELECT ALL OF THE CARTONS ATTACHED TO  18640025
186500*    THE TRAILER.                                                 18650025
186600                                                                  18660025
186700     SET  PS-TRIP-SML-EOF-NO    TO  TRUE.                         18670025
186800     MOVE  SU069-TRIP-OCRNC-ID  TO  SUT00095-TRIP-OCRNC-ID.       18680025
186900                                                                  18690025
187000     PERFORM 4100-OPEN-TRIP-SML-CSR.                              18700025
187100     PERFORM 4110-FETCH-TRIP-SML-CSR.                             18710025
187200                                                                  18720025
187300     SET  PS-TRLR-1ST-QUARTER    TO  TRUE.                        18730025
187400     MOVE SUT00095-DIVERT-TMST   TO  PV-QUARTER-BEGIN-TMST.       18740036
187500                                                                  18750033
187600     PERFORM 4080-DETERMINE-HARD-SOFT.                            18760033
187700     PERFORM 4085-DETERMINE-HANG-FOLD.                            18770037
187800     PERFORM 4050-ACCUM-CARTONS.                                  18780037
187900     MOVE SUT00095-SHIPT-UNT-ID  TO  PV-PREV-SML.                 18790037
188000     ADD  1  TO PV-CURRENT-QUART-COUNT.                           18800037
188100                                                                  18810037
188200     PERFORM 4010-PROCESS-CSR                                     18820037
188300       UNTIL  PS-TRIP-SML-EOF-YES.                                18830077
188400                                                                  18840037
188500     PERFORM 5015-COUNT-4TH-QUART-SKUS                            18850091
188600                                                                  18860091
188700     INITIALIZE  PV-CURRENT-QUART-COUNT.                          18870099
188800                                                                  18880099
188900     PERFORM 4120-CLOSE-TRIP-SML-CSR.                             18890037
189000                                                                  18900037
189100     PERFORM 3000-TRIP-BREAK.                                     18910078
189200                                                                  18920037
189300                                                                  18930078
189400******************************************************************18940037
189500*                                                                 18950037
189600******************************************************************18960037
189700 4010-PROCESS-CSR.                                                18970037
189800***  DISPLAY '4010-PROCESS-CSR           '.                       18980089
189900                                                                  18990037
190000     IF  SUT00095-SHIPT-UNT-ID  =  PV-PREV-SML                    19000037
190100         PERFORM 4020-ACCUM-UNITS                                 19010037
190200     ELSE                                                         19020037
190300         ADD  1  TO PV-CURRENT-QUART-COUNT                        19030037
190400                                                                  19040037
190500***  DISPLAY 'CURRENT QUARTER COUNT: ' PV-CURRENT-QUART-COUNT.    19050048
190600                                                                  19060037
190700         EVALUATE TRUE                                            19070056
190800         WHEN  PS-TRLR-1ST-QUARTER                                19080037
190900               IF  PV-CURRENT-QUART-COUNT > PV-CRTNS-1ST-QUART    19090057
191000                   MOVE  PV-PREV-DIVERT                           19100063
191100                     TO  PV-QUARTER-END-TMST                      19110063
191200                   PERFORM 5000-COUNT-1ST-QUART-SKUS              19120037
191300                   MOVE  1  TO  PV-CURRENT-QUART-COUNT            19130058
191400                   MOVE  SUT00095-DIVERT-TMST                     19140059
191500                     TO  PV-QUARTER-BEGIN-TMST                    19150059
191600                   SET  PS-TRLR-2ND-QUARTER  TO  TRUE             19160037
191700               END-IF                                             19170037
191800         WHEN  PS-TRLR-2ND-QUARTER                                19180037
191900****           IF  PV-CURRENT-QUART-COUNT = PV-CRTNS-2ND-QUART    19190057
192000****               OR                                             19200057
192100               IF  PV-CURRENT-QUART-COUNT > PV-CRTNS-2ND-QUART    19210057
192200                   MOVE  PV-PREV-DIVERT                           19220063
192300                     TO  PV-QUARTER-END-TMST                      19230063
192400                   PERFORM 5005-COUNT-2ND-QUART-SKUS              19240037
192500                   MOVE  1  TO  PV-CURRENT-QUART-COUNT            19250058
192600                   MOVE  SUT00095-DIVERT-TMST                     19260059
192700                     TO  PV-QUARTER-BEGIN-TMST                    19270059
192800                   SET  PS-TRLR-3RD-QUARTER  TO  TRUE             19280037
192900               END-IF                                             19290037
193000         WHEN  PS-TRLR-3RD-QUARTER                                19300037
193100****           IF  PV-CURRENT-QUART-COUNT = PV-CRTNS-3RD-QUART    19310057
193200****               OR                                             19320057
193300               IF  PV-CURRENT-QUART-COUNT > PV-CRTNS-3RD-QUART    19330057
193400                   MOVE  PV-PREV-DIVERT                           19340063
193500                     TO  PV-QUARTER-END-TMST                      19350063
193600                   PERFORM 5010-COUNT-3RD-QUART-SKUS              19360037
193700                   MOVE  1  TO  PV-CURRENT-QUART-COUNT            19370058
193800                   MOVE  SUT00095-DIVERT-TMST                     19380059
193900                     TO  PV-QUARTER-BEGIN-TMST                    19390059
194000                   SET  PS-TRLR-4TH-QUARTER  TO  TRUE             19400037
194100               END-IF                                             19410037
194200         WHEN  PS-TRLR-4TH-QUARTER                                19420037
194300               IF  PV-CURRENT-QUART-COUNT = PV-CRTNS-4TH-QUART    19430065
194400                   OR                                             19440065
194500                   PV-CURRENT-QUART-COUNT > PV-CRTNS-4TH-QUART    19450066
194600                   MOVE  SUT00095-DIVERT-TMST                     19460067
194700                     TO  PV-QUARTER-END-TMST                      19470063
194800****               PERFORM 5015-COUNT-4TH-QUART-SKUS              19480091
194900               END-IF                                             19490037
195000         END-EVALUATE                                             19500072
195100                                                                  19510037
195200         PERFORM 4080-DETERMINE-HARD-SOFT                         19520056
195300         PERFORM 4085-DETERMINE-HANG-FOLD                         19530056
195400         PERFORM 4050-ACCUM-CARTONS                               19540056
195500         PERFORM 4020-ACCUM-UNITS                                 19550056
195600         MOVE SUT00095-SHIPT-UNT-ID  TO  PV-PREV-SML              19560056
195700     END-IF.                                                      19570056
195800                                                                  19580056
195900     MOVE  SUT00095-DIVERT-TMST  TO  PV-PREV-DIVERT.              19590060
196000     PERFORM 4110-FETCH-TRIP-SML-CSR.                             19600037
196100                                                                  19610037
196200                                                                  19620037
196300******************************************************************19630037
196400*                                                                 19640037
196500******************************************************************19650037
196600                                                                  19660037
196700                                                                  19670037
196800                                                                  19680037
196900                                                                  19690037
197000                                                                  19700037
197100                                                                  19710037
197200******************************************************************19720037
197300*                                                                 19730037
197400******************************************************************19740037
197500 4020-ACCUM-UNITS.                                                19750037
197600***  DISPLAY '4020-ACCUM-UNITS           '.                       19760048
197700                                                                  19770037
197800     EVALUATE TRUE                                                19780037
197900         WHEN  PS-TRLR-1ST-QUARTER                                19790037
198000               PERFORM 4025-1ST-QUART-UNITS                       19800037
198100         WHEN  PS-TRLR-2ND-QUARTER                                19810037
198200               PERFORM 4030-2ND-QUART-UNITS                       19820037
198300         WHEN  PS-TRLR-3RD-QUARTER                                19830037
198400               PERFORM 4035-3RD-QUART-UNITS                       19840037
198500         WHEN  PS-TRLR-4TH-QUARTER                                19850037
198600               PERFORM 4040-4TH-QUART-UNITS                       19860037
198700     END-EVALUATE.                                                19870037
198800                                                                  19880037
198900                                                                  19890037
199000******************************************************************19900037
199100*                                                                 19910037
199200******************************************************************19920037
199300 4025-1ST-QUART-UNITS.                                            19930037
199400***  DISPLAY '4025-1ST-QUART-UNITS       '.                       19940048
199500                                                                  19950037
199600     EVALUATE SUT00095-MDSE-LNE-CDE                               19960037
199700         WHEN 'H'                                                 19970037
199800              ADD  SUT00095-UNT-QTY       TO  PV-HARD-1ST-UNITS   19980037
199900         WHEN 'S'                                                 19990037
200000              ADD SUT00095-UNT-QTY        TO  PV-SOFT-1ST-UNITS   20000037
200100     END-EVALUATE.                                                20010037
200200                                                                  20020037
200300     EVALUATE SUT00095-HNG-FOLD-SEQ-NBR                           20030037
200400         WHEN  1                                                  20040037
200500               ADD SUT00095-UNT-QTY       TO  PV-HANG-1ST-UNITS   20050037
200600         WHEN  2                                                  20060037
200700               ADD SUT00095-UNT-QTY       TO  PV-FOLD-1ST-UNITS   20070037
200800     END-EVALUATE.                                                20080037
200900                                                                  20090037
201000     EVALUATE SUT00095-PRC-MSG-CDE                                20100037
201100         WHEN 'RP'                                                20110037
201200               ADD SUT00095-UNT-QTY       TO  PV-OH-R-1ST-UNITS   20120037
201300         WHEN 'RF'                                                20130099
201400               ADD SUT00095-UNT-QTY       TO  PV-OH-N-1ST-UNITS   20140037
201500         WHEN 'CL'                                                20150037
201600               ADD SUT00095-UNT-QTY       TO  PV-CLRNC-1ST-UNITS  20160037
201700     END-EVALUATE.                                                20170037
201800                                                                  20180037
201900     EVALUATE SUT00095-EAS-TAG-IND                                20190037
202000         WHEN 'Y'                                                 20200037
202100               ADD SUT00095-UNT-QTY       TO  PV-EAS-1ST-UNITS    20210037
202200     END-EVALUATE.                                                20220037
202300                                                                  20230037
202400     ADD SUT00095-UNT-QTY   TO  PV-GRAND-1ST-UNITS.               20240037
202500                                                                  20250037
202600                                                                  20260037
202700******************************************************************20270037
202800*                                                                 20280037
202900******************************************************************20290037
203000 4030-2ND-QUART-UNITS.                                            20300037
203100***  DISPLAY '4030-2ND-QUART-UNITS       '.                       20310048
203200                                                                  20320037
203300     EVALUATE SUT00095-MDSE-LNE-CDE                               20330037
203400         WHEN 'H'                                                 20340037
203500              ADD  SUT00095-UNT-QTY       TO  PV-HARD-2ND-UNITS   20350037
203600         WHEN 'S'                                                 20360037
203700              ADD SUT00095-UNT-QTY        TO  PV-SOFT-2ND-UNITS   20370037
203800     END-EVALUATE.                                                20380037
203900                                                                  20390037
204000     EVALUATE SUT00095-HNG-FOLD-SEQ-NBR                           20400037
204100         WHEN  1                                                  20410037
204200               ADD SUT00095-UNT-QTY       TO  PV-HANG-2ND-UNITS   20420037
204300         WHEN  2                                                  20430037
204400               ADD SUT00095-UNT-QTY       TO  PV-FOLD-2ND-UNITS   20440037
204500     END-EVALUATE.                                                20450037
204600                                                                  20460037
204700     EVALUATE SUT00095-PRC-MSG-CDE                                20470037
204800         WHEN 'RP'                                                20480037
204900               ADD SUT00095-UNT-QTY       TO  PV-OH-R-2ND-UNITS   20490037
205000         WHEN 'RF'                                                20500099
205100               ADD SUT00095-UNT-QTY       TO  PV-OH-N-2ND-UNITS   20510037
205200         WHEN 'CL'                                                20520037
205300               ADD SUT00095-UNT-QTY       TO  PV-CLRNC-2ND-UNITS  20530037
205400     END-EVALUATE.                                                20540037
205500                                                                  20550037
205600     EVALUATE SUT00095-EAS-TAG-IND                                20560037
205700         WHEN 'Y'                                                 20570037
205800               ADD SUT00095-UNT-QTY       TO  PV-EAS-2ND-UNITS    20580037
205900     END-EVALUATE.                                                20590037
206000                                                                  20600037
206100     ADD SUT00095-UNT-QTY   TO  PV-GRAND-2ND-UNITS.               20610037
206200                                                                  20620037
206300                                                                  20630037
206400******************************************************************20640037
206500*                                                                 20650037
206600******************************************************************20660037
206700 4035-3RD-QUART-UNITS.                                            20670037
206800***  DISPLAY '4035-3RD-QUART-UNITS       '.                       20680048
206900                                                                  20690037
207000     EVALUATE SUT00095-MDSE-LNE-CDE                               20700037
207100         WHEN 'H'                                                 20710037
207200              ADD  SUT00095-UNT-QTY       TO  PV-HARD-3RD-UNITS   20720037
207300         WHEN 'S'                                                 20730037
207400              ADD SUT00095-UNT-QTY        TO  PV-SOFT-3RD-UNITS   20740037
207500     END-EVALUATE.                                                20750037
207600                                                                  20760037
207700     EVALUATE SUT00095-HNG-FOLD-SEQ-NBR                           20770037
207800         WHEN  1                                                  20780037
207900               ADD SUT00095-UNT-QTY       TO  PV-HANG-3RD-UNITS   20790037
208000         WHEN  2                                                  20800037
208100               ADD SUT00095-UNT-QTY       TO  PV-FOLD-3RD-UNITS   20810037
208200     END-EVALUATE.                                                20820037
208300                                                                  20830037
208400     EVALUATE SUT00095-PRC-MSG-CDE                                20840037
208500         WHEN 'RP'                                                20850037
208600               ADD SUT00095-UNT-QTY       TO  PV-OH-R-3RD-UNITS   20860037
208700         WHEN 'RF'                                                20870099
208800               ADD SUT00095-UNT-QTY       TO  PV-OH-N-3RD-UNITS   20880037
208900         WHEN 'CL'                                                20890037
209000               ADD SUT00095-UNT-QTY       TO  PV-CLRNC-3RD-UNITS  20900037
209100     END-EVALUATE.                                                20910037
209200                                                                  20920037
209300     EVALUATE SUT00095-EAS-TAG-IND                                20930037
209400         WHEN 'Y'                                                 20940037
209500               ADD SUT00095-UNT-QTY       TO  PV-EAS-3RD-UNITS    20950037
209600     END-EVALUATE.                                                20960037
209700                                                                  20970037
209800     ADD SUT00095-UNT-QTY   TO  PV-GRAND-3RD-UNITS.               20980037
209900                                                                  20990037
210000                                                                  21000037
210100******************************************************************21010037
210200*                                                                 21020037
210300******************************************************************21030037
210400 4040-4TH-QUART-UNITS.                                            21040037
210500**** DISPLAY '4040-4TH-QUART-UNITS       '.                       21050053
210600                                                                  21060037
210700     EVALUATE SUT00095-MDSE-LNE-CDE                               21070037
210800         WHEN 'H'                                                 21080037
210900              ADD  SUT00095-UNT-QTY       TO  PV-HARD-4TH-UNITS   21090037
211000         WHEN 'S'                                                 21100037
211100              ADD SUT00095-UNT-QTY        TO  PV-SOFT-4TH-UNITS   21110037
211200                                                                  21120045
211300***  MOVE SUT00095-UNT-QTY  TO  PV-DISP-UNITS                     21130053
211400***  DISPLAY 'SOFT UNITS:                 '                       21140053
211500***           PV-DISP-UNITS                                       21150053
211600***          '   -   ' PV-SOFT-4TH-UNITS                          21160053
211700                                                                  21170045
211800     END-EVALUATE.                                                21180037
211900                                                                  21190037
212000     EVALUATE SUT00095-HNG-FOLD-SEQ-NBR                           21200037
212100         WHEN  1                                                  21210037
212200               ADD SUT00095-UNT-QTY       TO  PV-HANG-4TH-UNITS   21220037
212300         WHEN  2                                                  21230037
212400               ADD SUT00095-UNT-QTY       TO  PV-FOLD-4TH-UNITS   21240037
212500     END-EVALUATE.                                                21250037
212600                                                                  21260037
212700     EVALUATE SUT00095-PRC-MSG-CDE                                21270037
212800         WHEN 'RP'                                                21280037
212900               ADD SUT00095-UNT-QTY       TO  PV-OH-R-4TH-UNITS   21290037
213000         WHEN 'RF'                                                21300099
213100               ADD SUT00095-UNT-QTY       TO  PV-OH-N-4TH-UNITS   21310037
213200         WHEN 'CL'                                                21320037
213300               ADD SUT00095-UNT-QTY       TO  PV-CLRNC-4TH-UNITS  21330037
213400     END-EVALUATE.                                                21340037
213500                                                                  21350037
213600     EVALUATE SUT00095-EAS-TAG-IND                                21360037
213700         WHEN 'Y'                                                 21370037
213800               ADD SUT00095-UNT-QTY       TO  PV-EAS-4TH-UNITS    21380037
213900     END-EVALUATE.                                                21390037
214000                                                                  21400037
214100     ADD SUT00095-UNT-QTY   TO  PV-GRAND-4TH-UNITS.               21410037
214200                                                                  21420037
214300                                                                  21430037
214400******************************************************************21440037
214500*                                                                 21450037
214600******************************************************************21460037
214700 4050-ACCUM-CARTONS.                                              21470037
214800***  DISPLAY '4050-ACCUM-CARTONS         '.                       21480048
214900                                                                  21490037
215000     EVALUATE TRUE                                                21500037
215100         WHEN  PS-TRLR-1ST-QUARTER                                21510037
215200               PERFORM 4055-1ST-QUART-CARTONS                     21520037
215300         WHEN  PS-TRLR-2ND-QUARTER                                21530037
215400               PERFORM 4060-2ND-QUART-CARTONS                     21540037
215500         WHEN  PS-TRLR-3RD-QUARTER                                21550037
215600               PERFORM 4065-3RD-QUART-CARTONS                     21560037
215700         WHEN  PS-TRLR-4TH-QUARTER                                21570037
215800               PERFORM 4070-4TH-QUART-CARTONS                     21580037
215900     END-EVALUATE.                                                21590037
216000                                                                  21600037
216100                                                                  21610037
216200******************************************************************21620037
216300*                                                                 21630037
216400******************************************************************21640037
216500 4055-1ST-QUART-CARTONS.                                          21650037
216600***  DISPLAY '4055-1ST-QUART-CARTONS     '.                       21660072
216700                                                                  21670037
216800     EVALUATE TRUE                                                21680037
216900         WHEN PS-HARDLINE-CARTON                                  21690037
217000              ADD  1                      TO  PV-HARD-1ST-CRTNS   21700037
217100         WHEN PS-SOFTLINE-CARTON                                  21710037
217200              ADD  1                      TO  PV-SOFT-1ST-CRTNS   21720037
217300     END-EVALUATE.                                                21730037
217400                                                                  21740037
217500     EVALUATE TRUE                                                21750037
217600         WHEN  PS-HANG-CARTON                                     21760037
217700               ADD  1                     TO  PV-HANG-1ST-CRTNS   21770037
217800***  DISPLAY '                      HANG 1ST QUARTER '            21780081
217900         WHEN  PS-FOLD-CARTON                                     21790037
218000               ADD  1                     TO  PV-FOLD-1ST-CRTNS   21800037
218100     END-EVALUATE.                                                21810037
218200                                                                  21820037
218300     EVALUATE SUT00095-PRC-MSG-CDE                                21830037
218400         WHEN 'RP'                                                21840037
218500               ADD  1                     TO  PV-OH-R-1ST-CRTNS   21850037
218600         WHEN 'RF'                                                21860099
218700               ADD  1                     TO  PV-OH-N-1ST-CRTNS   21870037
218800         WHEN 'CL'                                                21880037
218900               ADD  1                     TO  PV-CLRNC-1ST-CRTNS  21890037
219000     END-EVALUATE.                                                21900037
219100                                                                  21910037
219200     EVALUATE SUT00095-EAS-TAG-IND                                21920037
219300         WHEN 'Y'                                                 21930037
219400               ADD  1                     TO  PV-EAS-1ST-CRTNS    21940037
219500     END-EVALUATE.                                                21950037
219600                                                                  21960037
219700     ADD  1                 TO  PV-GRAND-1ST-CRTNS.               21970037
219800                                                                  21980037
219900                                                                  21990037
220000******************************************************************22000037
220100*                                                                 22010037
220200******************************************************************22020037
220300 4060-2ND-QUART-CARTONS.                                          22030037
220400***  DISPLAY '4060-2ND-QUART-CARTONS     '.                       22040048
220500                                                                  22050037
220600     EVALUATE TRUE                                                22060037
220700         WHEN PS-HARDLINE-CARTON                                  22070037
220800              ADD  1                      TO  PV-HARD-2ND-CRTNS   22080037
220900         WHEN PS-SOFTLINE-CARTON                                  22090037
221000              ADD  1                      TO  PV-SOFT-2ND-CRTNS   22100037
221100     END-EVALUATE.                                                22110037
221200                                                                  22120037
221300     EVALUATE TRUE                                                22130037
221400         WHEN  PS-HANG-CARTON                                     22140037
221500               ADD  1                     TO  PV-HANG-2ND-CRTNS   22150037
221600         WHEN  PS-FOLD-CARTON                                     22160037
221700               ADD  1                     TO  PV-FOLD-2ND-CRTNS   22170037
221800     END-EVALUATE.                                                22180037
221900                                                                  22190037
222000     EVALUATE SUT00095-PRC-MSG-CDE                                22200037
222100         WHEN 'RP'                                                22210037
222200               ADD  1                     TO  PV-OH-R-2ND-CRTNS   22220037
222300         WHEN 'RF'                                                22230099
222400               ADD  1                     TO  PV-OH-N-2ND-CRTNS   22240037
222500         WHEN 'CL'                                                22250037
222600               ADD  1                     TO  PV-CLRNC-2ND-CRTNS  22260037
222700     END-EVALUATE.                                                22270037
222800                                                                  22280037
222900     EVALUATE SUT00095-EAS-TAG-IND                                22290037
223000         WHEN 'Y'                                                 22300037
223100               ADD  1                     TO  PV-EAS-2ND-CRTNS    22310037
223200     END-EVALUATE.                                                22320037
223300                                                                  22330037
223400     ADD  1                 TO  PV-GRAND-2ND-CRTNS.               22340037
223500                                                                  22350037
223600                                                                  22360037
223700******************************************************************22370037
223800*                                                                 22380037
223900******************************************************************22390037
224000 4065-3RD-QUART-CARTONS.                                          22400037
224100***  DISPLAY '4065-3RD-QUART-CARTONS     '.                       22410048
224200                                                                  22420037
224300     EVALUATE TRUE                                                22430037
224400         WHEN PS-HARDLINE-CARTON                                  22440037
224500              ADD  1                      TO  PV-HARD-3RD-CRTNS   22450037
224600         WHEN PS-SOFTLINE-CARTON                                  22460037
224700              ADD  1                      TO  PV-SOFT-3RD-CRTNS   22470037
224800     END-EVALUATE.                                                22480037
224900                                                                  22490037
225000     EVALUATE TRUE                                                22500037
225100         WHEN  PS-HANG-CARTON                                     22510037
225200               ADD  1                     TO  PV-HANG-3RD-CRTNS   22520037
225300         WHEN  PS-FOLD-CARTON                                     22530037
225400               ADD  1                     TO  PV-FOLD-3RD-CRTNS   22540037
225500     END-EVALUATE.                                                22550037
225600                                                                  22560037
225700     EVALUATE SUT00095-PRC-MSG-CDE                                22570037
225800         WHEN 'RP'                                                22580037
225900               ADD  1                     TO  PV-OH-R-3RD-CRTNS   22590037
226000         WHEN 'RF'                                                22600099
226100               ADD  1                     TO  PV-OH-N-3RD-CRTNS   22610037
226200         WHEN 'CL'                                                22620037
226300               ADD  1                     TO  PV-CLRNC-3RD-CRTNS  22630037
226400     END-EVALUATE.                                                22640037
226500                                                                  22650037
226600     EVALUATE SUT00095-EAS-TAG-IND                                22660037
226700         WHEN 'Y'                                                 22670037
226800               ADD  1                     TO  PV-EAS-3RD-CRTNS    22680037
226900     END-EVALUATE.                                                22690037
227000                                                                  22700037
227100     ADD  1                 TO  PV-GRAND-3RD-CRTNS.               22710037
227200                                                                  22720037
227300                                                                  22730037
227400******************************************************************22740037
227500*                                                                 22750037
227600******************************************************************22760037
227700 4070-4TH-QUART-CARTONS.                                          22770037
227800***  DISPLAY '4070-4TH-QUART-CARTONS     '.                       22780048
227900                                                                  22790037
228000     EVALUATE TRUE                                                22800037
228100         WHEN PS-HARDLINE-CARTON                                  22810037
228200              ADD  1                      TO  PV-HARD-4TH-CRTNS   22820037
228300         WHEN PS-SOFTLINE-CARTON                                  22830037
228400              ADD  1                      TO  PV-SOFT-4TH-CRTNS   22840037
228500     END-EVALUATE.                                                22850037
228600                                                                  22860037
228700     EVALUATE TRUE                                                22870037
228800         WHEN  PS-HANG-CARTON                                     22880037
228900               ADD  1                     TO  PV-HANG-4TH-CRTNS   22890037
229000         WHEN  PS-FOLD-CARTON                                     22900037
229100               ADD  1                     TO  PV-FOLD-4TH-CRTNS   22910037
229200     END-EVALUATE.                                                22920037
229300                                                                  22930037
229400     EVALUATE SUT00095-PRC-MSG-CDE                                22940037
229500         WHEN 'RP'                                                22950037
229600               ADD  1                     TO  PV-OH-R-4TH-CRTNS   22960037
229700         WHEN 'RF'                                                22970099
229800               ADD  1                     TO  PV-OH-N-4TH-CRTNS   22980037
229900         WHEN 'CL'                                                22990037
230000               ADD  1                     TO  PV-CLRNC-4TH-CRTNS  23000037
230100     END-EVALUATE.                                                23010037
230200                                                                  23020037
230300     EVALUATE SUT00095-EAS-TAG-IND                                23030037
230400         WHEN 'Y'                                                 23040037
230500               ADD  1                     TO  PV-EAS-4TH-CRTNS    23050037
230600     END-EVALUATE.                                                23060037
230700                                                                  23070037
230800     ADD 1                  TO  PV-GRAND-4TH-CRTNS.               23080037
230900                                                                  23090037
231000                                                                  23100037
231100******************************************************************23110037
231200*                                                                 23120037
231300******************************************************************23130037
231400 4080-DETERMINE-HARD-SOFT.                                        23140037
231500***  DISPLAY '4080-DETERMINE-HARD-SOFT   '.                       23150053
231600                                                                  23160037
231700     INITIALIZE  PV-SOFTLINE-UNITS                                23170099
231800                 PV-HARDLINE-UNITS.                               23180047
231900                                                                  23190047
232000     PERFORM 8080-COUNT-SOFTLINE-UNITS.                           23200047
232100     PERFORM 8085-COUNT-HARDLINE-UNITS.                           23210047
232200                                                                  23220047
232300     SET  PS-HARD-SOFT-NO   TO  TRUE                              23230047
232400                                                                  23240047
232500     IF  (PV-HARDLINE-UNITS  =  PV-SOFTLINE-UNITS  OR             23250076
232600          PV-HARDLINE-UNITS  >  PV-SOFTLINE-UNITS)  AND           23260076
232700         PV-HARDLINE-UNITS  >  0                                  23270075
232800         SET  PS-HARDLINE-CARTON  TO  TRUE                        23280047
232900     ELSE                                                         23290047
233000     IF  PV-SOFTLINE-UNITS  >  0                                  23300075
233100         SET  PS-SOFTLINE-CARTON  TO  TRUE                        23310047
233200     END-IF                                                       23320075
233300     END-IF.                                                      23330075
233400                                                                  23340047
233500***  DISPLAY 'HARD/SOFT:  ' PS-CARTON-HARD-SOFT-SW.               23350053
233600***  IF  PS-SOFTLINE-CARTON                                       23360053
233700***  DISPLAY '                            '                       23370053
233800***           PS-CARTON-HARD-SOFT-SW                              23380053
233900***  END-IF.                                                      23390053
234000                                                                  23400047
234100                                                                  23410047
234200******************************************************************23420047
234300*                                                                 23430047
234400******************************************************************23440047
234500 4085-DETERMINE-HANG-FOLD.                                        23450047
234600***  DISPLAY '4085-DETERMINE-HANG-FOLD   '.                       23460053
234700                                                                  23470047
234800     INITIALIZE  PV-HANG-UNITS                                    23480047
234900                 PV-FOLD-UNITS.                                   23490047
235000                                                                  23500047
235100     PERFORM 8086-COUNT-HANG-UNITS.                               23510047
235200     PERFORM 8087-COUNT-FOLD-UNITS.                               23520047
235300                                                                  23530047
235400     SET  PS-HANG-FOLD-NO   TO  TRUE                              23540047
235500                                                                  23550047
235600     IF  (PV-HANG-UNITS  =  PV-FOLD-UNITS  OR                     23560076
235700          PV-HANG-UNITS  >  PV-FOLD-UNITS)  AND                   23570076
235800         PV-HANG-UNITS  >  0                                      23580075
235900         SET  PS-HANG-CARTON  TO  TRUE                            23590047
236000     ELSE                                                         23600047
236100     IF  PV-FOLD-UNITS  > 0                                       23610075
236200         SET  PS-FOLD-CARTON  TO  TRUE                            23620047
236300     END-IF                                                       23630075
236400     END-IF.                                                      23640047
236500                                                                  23650047
236600***  DISPLAY 'HANG/FOLD:  ' PS-CARTON-HANG-FOLD-SW.               23660053
236700                                                                  23670047
236800                                                                  23680047
236900******************************************************************23690047
237000*                                                                 23700047
237100******************************************************************23710047
237200                                                                  23720047
237300                                                                  23730047
237400                                                                  23740047
237500                                                                  23750047
237600                                                                  23760047
237700                                                                  23770047
237800                                                                  23780047
237900                                                                  23790047
238000                                                                  23800047
238100                                                                  23810047
238200                                                                  23820047
238300                                                                  23830047
238400                                                                  23840047
238500******************************************************************23850047
238600*                                                                 23860047
238700******************************************************************23870047
238800 4100-OPEN-TRIP-SML-CSR.                                          23880047
238900***  DISPLAY '4100-OPEN-TRIP-SML-CSR     '.                       23890048
239000                                                                  23900047
239100     MOVE '4100-OPEN-TRIP-SML-CSR    '                            23910047
239200                                 TO PV-PARAGRAPH-NAME.            23920047
239300     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       23930047
239400     MOVE '                              '  TO  PV-TABLE-2.       23940047
239500     MOVE '                              '  TO  PV-TABLE-3.       23950047
239600                                                                  23960047
239700     EXEC SQL                                                     23970047
239800         OPEN TRIP_SML_CSR                                        23980047
239900     END-EXEC.                                                    23990047
240000                                                                  24000047
240100     EVALUATE TRUE                                                24010047
240200         WHEN SQLCODE = ZEROS                                     24020047
240300              CONTINUE                                            24030047
240400         WHEN OTHER                                               24040047
240500              PERFORM Z999-SQL-ERROR                              24050047
240600     END-EVALUATE.                                                24060047
240700                                                                  24070047
240800                                                                  24080047
240900******************************************************************24090047
241000*                                                                 24100047
241100******************************************************************24110008
241200 4110-FETCH-TRIP-SML-CSR.                                         24120008
241300                                                                  24130022
241400***  DISPLAY '                           '.                       24140048
241500***  DISPLAY '4110-FETCH-TRIP-SML-CSR    '.                       24150048
241600                                                                  24160008
241700     MOVE '4110-FETCH-TRIP-SML-CSR    '                           24170008
241800                                 TO PV-PARAGRAPH-NAME.            24180008
241900     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       24190008
242000     MOVE '                              '  TO  PV-TABLE-2.       24200008
242100     MOVE '                              '  TO  PV-TABLE-3.       24210008
242200                                                                  24220008
242300     INITIALIZE  SUT00095-UNT-QTY.                                24230048
242400                                                                  24240048
242500     EXEC SQL                                                     24250008
242600          FETCH TRIP_SML_CSR                                      24260010
242700          INTO :SUT00095-TRIP-OCRNC-ID                            24270008
242800              ,:SUT00095-DIVERT-TMST                              24280008
242900              ,:SUT00095-SHIPT-UNT-ID                             24290008
243000              ,:SUT00095-SKU-NBR                                  24300008
243100              ,:SUT00095-MDSE-LNE-CDE                             24310008
243200              ,:SUT00095-HNG-FOLD-SEQ-NBR                         24320008
243300              ,:SUT00095-PRC-MSG-CDE                              24330008
243400              ,:SUT00095-EAS-TAG-IND                              24340008
243500              ,:SUT00095-UNT-QTY                                  24350008
243600     END-EXEC.                                                    24360008
243700                                                                  24370008
243800     EVALUATE TRUE                                                24380008
243900         WHEN SQLCODE = ZEROS                                     24390008
244000              CONTINUE                                            24400061
244100         WHEN SQLCODE = +100                                      24410009
244200              SET  PS-TRIP-SML-EOF-YES TO  TRUE                   24420077
244300         WHEN OTHER                                               24430008
244400              PERFORM Z999-SQL-ERROR                              24440008
244500     END-EVALUATE.                                                24450008
244600                                                                  24460004
244700**** MOVE  SUT00095-SHIPT-UNT-ID  TO  PV-DISP-SML.                24470080
244800***  MOVE  SUT00095-SKU-NBR       TO  PV-DISP-SKU.                24480080
244900***  MOVE  SUT00095-UNT-QTY       TO  PV-DISP-UNITS.              24490080
245000***  IF  PS-TRLR-1ST-QUARTER                                      24500080
245100***      IF  SUT00095-HNG-FOLD-SEQ-NBR = 1                        24510080
245200***          DISPLAY  PV-DISP-SML ','                             24520080
245300***                   SUT00095-DIVERT-TMST ','                    24530080
245400***                   PV-DISP-SKU ','                             24540080
245500***                   SUT00095-HNG-FOLD-SEQ-NBR ','               24550080
245600***                   PV-HANG-1ST-CRTNS                           24560080
245700***      ELSE                                                     24570080
245800***          DISPLAY  PV-DISP-SML ','                             24580080
245900***                   SUT00095-DIVERT-TMST ','                    24590080
246000***                   PV-DISP-SKU ','                             24600080
246100***                   SUT00095-HNG-FOLD-SEQ-NBR ','               24610080
246200***                   PV-HANG-1ST-CRTNS                           24620080
246300***                   '*****'                                     24630080
246400***      END-IF                                                   24640080
246500***  END-IF.                                                      24650080
246600                                                                  24660048
246700                                                                  24670005
246800******************************************************************24680008
246900*                                                                 24690008
247000******************************************************************24700008
247100 4120-CLOSE-TRIP-SML-CSR.                                         24710008
247200***  DISPLAY '4120-CLOSE-TRIP-SML-CSR    '.                       24720048
247300                                                                  24730008
247400     MOVE '4120-CLOSE-TRIP-SML-CSR    '                           24740008
247500                                 TO PV-PARAGRAPH-NAME.            24750008
247600     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       24760008
247700     MOVE '                              '  TO  PV-TABLE-2.       24770008
247800     MOVE '                              '  TO  PV-TABLE-3.       24780008
247900                                                                  24790008
248000     EXEC SQL                                                     24800008
248100         CLOSE TRIP_SML_CSR                                       24810008
248200     END-EXEC.                                                    24820008
248300                                                                  24830008
248400     EVALUATE TRUE                                                24840008
248500         WHEN SQLCODE = ZEROS                                     24850008
248600              CONTINUE                                            24860008
248700         WHEN OTHER                                               24870008
248800              PERFORM Z999-SQL-ERROR                              24880008
248900     END-EVALUATE.                                                24890008
249000                                                                  24900008
249100                                                                  24910008
249200******************************************************************24920010
249300*                                                                 24930010
249400******************************************************************24940010
249500 5000-COUNT-1ST-QUART-SKUS.                                       24950010
249600***  DISPLAY '                          '.                        24960097
249700***  DISPLAY '5000-COUNT-1ST-QUART-SKUS '.                        24970097
249800     DISPLAY '1ST QUARTER TMST RANGE:  '  PV-QUARTER-BEGIN-TMST   24980094
249900             ' - '            PV-QUARTER-END-TMST.                24990088
250000                                                                  25000033
250100     PERFORM 8090-TOTAL-SKU-COUNTS.                               25010033
250200     PERFORM 8091-HARD-SKU-COUNTS.                                25020033
250300     PERFORM 8092-SOFT-SKU-COUNTS.                                25030033
250400     PERFORM 8093-HANG-SKU-COUNTS.                                25040033
250500     PERFORM 8094-FOLD-SKU-COUNTS.                                25050033
250600     PERFORM 8095-OH-R-SKU-COUNTS.                                25060033
250700     PERFORM 8096-OH-N-SKU-COUNTS.                                25070033
250800     PERFORM 8097-EAS-SKU-COUNTS.                                 25080033
250900     PERFORM 8098-CLEAR-SKU-COUNTS.                               25090033
251000                                                                  25100033
251100     ADD  PV-HARD-SKU-COUNT      TO  PV-HARD-1ST-SKUS.            25110033
251200     ADD  PV-SOFT-SKU-COUNT      TO  PV-SOFT-1ST-SKUS.            25120011
251300     ADD  PV-HANG-SKU-COUNT      TO  PV-HANG-1ST-SKUS.            25130011
251400     ADD  PV-FOLD-SKU-COUNT      TO  PV-FOLD-1ST-SKUS.            25140011
251500     ADD  PV-OH-R-SKU-COUNT      TO  PV-OH-R-1ST-SKUS.            25150011
251600     ADD  PV-OH-N-SKU-COUNT      TO  PV-OH-N-1ST-SKUS.            25160011
251700     ADD  PV-EAS-SKU-COUNT       TO  PV-EAS-1ST-SKUS.             25170011
251800     ADD  PV-CLEAR-SKU-COUNT     TO  PV-CLRNC-1ST-SKUS.           25180013
251900     ADD  PV-TOTAL-SKU-COUNT     TO  PV-GRAND-1ST-SKUS.           25190013
252000                                                                  25200011
252100                                                                  25210011
252200******************************************************************25220011
252300*                                                                 25230011
252400******************************************************************25240011
252500 5005-COUNT-2ND-QUART-SKUS.                                       25250011
252600***  DISPLAY '                          '.                        25260097
252700***  DISPLAY ' 5005-COUNT-2ND-QUART-SKUS '.                       25270097
252800     DISPLAY '2ND QUARTER TMST RANGE:  '  PV-QUARTER-BEGIN-TMST   25280094
252900             ' - '            PV-QUARTER-END-TMST.                25290088
253000                                                                  25300011
253100     PERFORM 8090-TOTAL-SKU-COUNTS.                               25310011
253200     PERFORM 8091-HARD-SKU-COUNTS.                                25320011
253300     PERFORM 8092-SOFT-SKU-COUNTS.                                25330011
253400     PERFORM 8093-HANG-SKU-COUNTS.                                25340011
253500     PERFORM 8094-FOLD-SKU-COUNTS.                                25350011
253600     PERFORM 8095-OH-R-SKU-COUNTS.                                25360011
253700     PERFORM 8096-OH-N-SKU-COUNTS.                                25370011
253800     PERFORM 8097-EAS-SKU-COUNTS.                                 25380011
253900     PERFORM 8098-CLEAR-SKU-COUNTS.                               25390011
254000                                                                  25400011
254100     ADD  PV-HARD-SKU-COUNT      TO  PV-HARD-2ND-SKUS.            25410011
254200     ADD  PV-SOFT-SKU-COUNT      TO  PV-SOFT-2ND-SKUS.            25420011
254300     ADD  PV-HANG-SKU-COUNT      TO  PV-HANG-2ND-SKUS.            25430011
254400     ADD  PV-FOLD-SKU-COUNT      TO  PV-FOLD-2ND-SKUS.            25440011
254500     ADD  PV-OH-R-SKU-COUNT      TO  PV-OH-R-2ND-SKUS.            25450011
254600     ADD  PV-OH-N-SKU-COUNT      TO  PV-OH-N-2ND-SKUS.            25460011
254700     ADD  PV-EAS-SKU-COUNT       TO  PV-EAS-2ND-SKUS.             25470011
254800     ADD  PV-CLEAR-SKU-COUNT     TO  PV-CLRNC-2ND-SKUS.           25480013
254900     ADD  PV-TOTAL-SKU-COUNT     TO  PV-GRAND-2ND-SKUS.           25490013
255000                                                                  25500011
255100                                                                  25510011
255200******************************************************************25520011
255300*                                                                 25530011
255400******************************************************************25540011
255500 5010-COUNT-3RD-QUART-SKUS.                                       25550011
255600***  DISPLAY '                          '.                        25560097
255700***  DISPLAY ' 5010-COUNT-3RD-QUART-SKUS '.                       25570097
255800     DISPLAY '3RD QUARTER TMST RANGE:  '  PV-QUARTER-BEGIN-TMST   25580094
255900             ' - '            PV-QUARTER-END-TMST.                25590088
256000                                                                  25600011
256100     PERFORM 8090-TOTAL-SKU-COUNTS.                               25610011
256200     PERFORM 8091-HARD-SKU-COUNTS.                                25620011
256300     PERFORM 8092-SOFT-SKU-COUNTS.                                25630011
256400     PERFORM 8093-HANG-SKU-COUNTS.                                25640011
256500     PERFORM 8094-FOLD-SKU-COUNTS.                                25650011
256600     PERFORM 8095-OH-R-SKU-COUNTS.                                25660011
256700     PERFORM 8096-OH-N-SKU-COUNTS.                                25670011
256800     PERFORM 8097-EAS-SKU-COUNTS.                                 25680011
256900     PERFORM 8098-CLEAR-SKU-COUNTS.                               25690011
257000                                                                  25700011
257100     ADD  PV-HARD-SKU-COUNT      TO  PV-HARD-3RD-SKUS.            25710011
257200     ADD  PV-SOFT-SKU-COUNT      TO  PV-SOFT-3RD-SKUS.            25720011
257300     ADD  PV-HANG-SKU-COUNT      TO  PV-HANG-3RD-SKUS.            25730011
257400     ADD  PV-FOLD-SKU-COUNT      TO  PV-FOLD-3RD-SKUS.            25740011
257500     ADD  PV-OH-R-SKU-COUNT      TO  PV-OH-R-3RD-SKUS.            25750011
257600     ADD  PV-OH-N-SKU-COUNT      TO  PV-OH-N-3RD-SKUS.            25760011
257700     ADD  PV-EAS-SKU-COUNT       TO  PV-EAS-3RD-SKUS.             25770011
257800     ADD  PV-CLEAR-SKU-COUNT     TO  PV-CLRNC-3RD-SKUS.           25780013
257900     ADD  PV-TOTAL-SKU-COUNT     TO  PV-GRAND-3RD-SKUS.           25790013
258000                                                                  25800011
258100                                                                  25810011
258200******************************************************************25820011
258300*                                                                 25830011
258400******************************************************************25840011
258500 5015-COUNT-4TH-QUART-SKUS.                                       25850011
258600***  DISPLAY '                          '.                        25860097
258700***  DISPLAY ' 5015-COUNT-4TH-QUART-SKUS '.                       25870097
258800     DISPLAY '4TH QUARTER TMST RANGE:  '  PV-QUARTER-BEGIN-TMST   25880094
258900             ' - '            PV-QUARTER-END-TMST.                25890088
259000**                                                                25900099
259001*** DMH 8/4/06 - BEGIN                                            25900199
259002**                                                                25900299
259003     IF  PV-QUARTER-END-TMST NOT > ' '                            25900399
259004         MOVE PV-QUARTER-BEGIN-TMST                               25900499
259005           TO PV-QUARTER-END-TMST                                 25900599
259006              DISPLAY '4TH QUARTER TMST RANGE:  '                 25900699
259007              PV-QUARTER-BEGIN-TMST                               25900799
259008             ' - '            PV-QUARTER-END-TMST                 25900899
259009     END-IF.                                                      25900999
259010**                                                                25901099
259011*** DMH 8/4/06 - END                                              25901199
259012**                                                                25901299
259013                                                                  25901399
259020                                                                  25902099
259100     PERFORM 8090-TOTAL-SKU-COUNTS.                               25910011
259200     PERFORM 8091-HARD-SKU-COUNTS.                                25920011
259300     PERFORM 8092-SOFT-SKU-COUNTS.                                25930011
259400     PERFORM 8093-HANG-SKU-COUNTS.                                25940011
259500     PERFORM 8094-FOLD-SKU-COUNTS.                                25950011
259600     PERFORM 8095-OH-R-SKU-COUNTS.                                25960011
259700     PERFORM 8096-OH-N-SKU-COUNTS.                                25970011
259800     PERFORM 8097-EAS-SKU-COUNTS.                                 25980011
259900     PERFORM 8098-CLEAR-SKU-COUNTS.                               25990011
260000                                                                  26000011
260100     ADD  PV-HARD-SKU-COUNT      TO  PV-HARD-4TH-SKUS.            26010011
260200     ADD  PV-SOFT-SKU-COUNT      TO  PV-SOFT-4TH-SKUS.            26020011
260300     ADD  PV-HANG-SKU-COUNT      TO  PV-HANG-4TH-SKUS.            26030011
260400     ADD  PV-FOLD-SKU-COUNT      TO  PV-FOLD-4TH-SKUS.            26040011
260500     ADD  PV-OH-R-SKU-COUNT      TO  PV-OH-R-4TH-SKUS.            26050011
260600     ADD  PV-OH-N-SKU-COUNT      TO  PV-OH-N-4TH-SKUS.            26060011
260700     ADD  PV-EAS-SKU-COUNT       TO  PV-EAS-4TH-SKUS.             26070011
260800     ADD  PV-CLEAR-SKU-COUNT     TO  PV-CLRNC-4TH-SKUS.           26080013
260900     ADD  PV-TOTAL-SKU-COUNT     TO  PV-GRAND-4TH-SKUS.           26090013
261000                                                                  26100011
261100                                                                  26110011
261200******************************************************************26120011
261300*                                                                 26130005
261400******************************************************************26140005
261500 8000-READ-INPUT-FIRST-TIME.                                      26150004
261600***  DISPLAY '                           '.                       26160097
261700***  DISPLAY '8000-READ-INPUT-FIRST-TIME '.                       26170097
261800                                                                  26180004
261900     PERFORM 8010-READ-TRIP-FILE.                                 26190004
262000     IF  PV-PREV-STORE  =  SU069-LOC-NBR                          26200013
262100         CONTINUE                                                 26210004
262200     ELSE                                                         26220004
262300         PERFORM 8020-GET-STORE-INFORMATION                       26230004
262301         PERFORM 8025-CHECK-PARM-STORE-LEVEL                      26230199
262310         IF KRPRPM-FUNC-BEG-TMST = PC-DEFAULT-TMST                26231099
262311            PERFORM 8030-GET-DISTRICT-PARM                        26231199
262320         ELSE                                                     26232099
262321            SET  PS-DISTRICT-ON-HAND-YES  TO  TRUE                26232199
262410         END-IF                                                   26241099
262500         MOVE  SU069-LOC-NBR  TO  PV-PREV-STORE                   26250013
262600     END-IF.                                                      26260004
262700                                                                  26270004
262800      MOVE  SU069-OTBND-STAT-TMST  TO  PV-WORK-TMST.              26280004
262900      MOVE  PV-WORK-TMST-YY        TO  PV-WORK-DATE-YY.           26290004
263000      MOVE  PV-WORK-TMST-MM        TO  PV-WORK-DATE-MM.           26300004
263100      MOVE  PV-WORK-TMST-DD        TO  PV-WORK-DATE-DD.           26310004
263200                                                                  26320004
263300      MOVE  XLT00010-OPN-DTE       TO  PV-WORK-OPEN.              26330024
263400      MOVE  PV-WORK-OPEN-YY        TO  PV-WORK-OPEN-DATE-YY.      26340024
263500      MOVE  PV-WORK-OPEN-MM        TO  PV-WORK-OPEN-DATE-MM.      26350024
263600      MOVE  PV-WORK-OPEN-DD        TO  PV-WORK-OPEN-DATE-DD.      26360024
263700                                                                  26370021
263800*  SKIP E-COMMERCE TRIP                                           26380004
263900*  SKIP NON-STORE TRIPS                                           26390004
264000*  SKIP TRIPS WHERE STORE IS NOT OPEN YET (SHIPPED BEFORE OPEN)   26400004
264001******************************************************************26400199
264010*  THE "STORE NOT OPEN YET" CHECK WAS REMOVED PER A REQUEST      *26401099
264020*  FROM THE STORE ADMIN GROUP ON 9/17/2007                       *26402099
264030******************************************************************26403099
264100*  SKIP TRIPS WHERE DISTRICT IS NOT TURNED ON FOR ON-HAND         26410004
264200                                                                  26420004
264300     IF  XLT00010-E-BUS-IND       =  'Y'  OR                      26430013
264400         XLT00010-LOC-TYP-CDE NOT =  'DS' OR                      26440099
264500*        PV-WORK-OPEN-DATE        >  PV-WORK-DATE  OR             26450099
264600         PS-DISTRICT-ON-HAND-NO                                   26460099
264700             SET PS-PROCESS-STORE-NO  TO  TRUE                    26470004
264800     ELSE                                                         26480004
264900         SET PS-PROCESS-STORE-YES     TO  TRUE                    26490004
265000     END-IF.                                                      26500004
265100                                                                  26510005
265200                                                                  26520020
265300***  DISPLAY 'XLT00010-E-BUS-IND:   ' XLT00010-E-BUS-IND.         26530048
265400***  DISPLAY 'XLT00010-LOC-TYP-CDE: ' XLT00010-LOC-TYP-CDE.       26540048
265500***  DISPLAY 'XLT00010-OPN-DTE:     ' XLT00010-OPN-DTE.           26550048
265600***  DISPLAY 'PV-WORK-OPEN-DATE:    ' PV-WORK-OPEN-DATE.          26560048
265700***  DISPLAY 'PV-WORK-DATE:         ' PV-WORK-DATE.               26570048
265800***  DISPLAY 'PS-PROCESS-STORE-SW:  ' PS-PROCESS-STORE-SW.        26580048
265900                                                                  26590005
266000                                                                  26600020
266100******************************************************************26610031
266200*                                                                 26620031
266300******************************************************************26630031
266400 8005-READ-TRIP-FILE.                                             26640031
266500***  DISPLAY '                           '.                       26650082
266600***  DISPLAY '8005-READ-TRIP-FILE        '.                       26660082
266700                                                                  26670031
266800     PERFORM 8010-READ-TRIP-FILE.                                 26680031
266900     IF  PV-PREV-STORE  =  SU069-LOC-NBR                          26690031
267000         CONTINUE                                                 26700031
267100     ELSE                                                         26710031
267200         PERFORM 8020-GET-STORE-INFORMATION                       26720031
267210         PERFORM 8025-CHECK-PARM-STORE-LEVEL                      26721099
267220         IF KRPRPM-FUNC-BEG-TMST = PC-DEFAULT-TMST                26722099
267230            PERFORM 8030-GET-DISTRICT-PARM                        26723099
267240         ELSE                                                     26724099
267250            SET  PS-DISTRICT-ON-HAND-YES  TO  TRUE                26725099
267260         END-IF                                                   26726099
267400         MOVE  SU069-LOC-NBR  TO  PV-PREV-STORE                   26740031
267500     END-IF.                                                      26750031
267600                                                                  26760031
267700      MOVE  SU069-OTBND-STAT-TMST  TO  PV-WORK-TMST.              26770031
267800      MOVE  PV-WORK-TMST-YY        TO  PV-WORK-DATE-YY.           26780031
267900      MOVE  PV-WORK-TMST-MM        TO  PV-WORK-DATE-MM.           26790031
268000      MOVE  PV-WORK-TMST-DD        TO  PV-WORK-DATE-DD.           26800031
268100                                                                  26810031
268200      MOVE  XLT00010-OPN-DTE       TO  PV-WORK-OPEN.              26820031
268300      MOVE  PV-WORK-OPEN-YY        TO  PV-WORK-OPEN-DATE-YY.      26830031
268400      MOVE  PV-WORK-OPEN-MM        TO  PV-WORK-OPEN-DATE-MM.      26840031
268500      MOVE  PV-WORK-OPEN-DD        TO  PV-WORK-OPEN-DATE-DD.      26850031
268600                                                                  26860031
268700*  SKIP E-COMMERCE TRIP                                           26870031
268800*  SKIP NON-STORE TRIPS                                           26880031
268900*  SKIP TRIPS WHERE STORE IS NOT OPEN YET (SHIPPED BEFORE OPEN)   26890031
268910******************************************************************26891099
268920*  THE "STORE NOT OPEN YET" CHECK WAS REMOVED PER A REQUEST      *26892099
268930*  FROM THE STORE ADMIN GROUP ON 9/17/2007                       *26893099
268940******************************************************************26894099
269000*  SKIP TRIPS WHERE DISTRICT IS NOT TURNED ON FOR ON-HAND         26900031
269100                                                                  26910031
269200     IF  XLT00010-E-BUS-IND       =  'Y'  OR                      26920031
269300         XLT00010-LOC-TYP-CDE NOT =  'DS' OR                      26930099
269400*        PV-WORK-OPEN-DATE        >  PV-WORK-DATE  OR             26940099
269500         PS-DISTRICT-ON-HAND-NO                                   26950099
269600             SET PS-PROCESS-STORE-NO  TO  TRUE                    26960031
269700     ELSE                                                         26970031
269800         SET PS-PROCESS-STORE-YES     TO  TRUE                    26980031
269900     END-IF.                                                      26990031
270000                                                                  27000031
270100                                                                  27010031
270200***  DISPLAY 'XLT00010-E-BUS-IND:   ' XLT00010-E-BUS-IND.         27020048
270300***  DISPLAY 'XLT00010-LOC-TYP-CDE: ' XLT00010-LOC-TYP-CDE.       27030048
270400***  DISPLAY 'XLT00010-OPN-DTE:     ' XLT00010-OPN-DTE.           27040048
270500***  DISPLAY 'PV-WORK-OPEN-DATE:    ' PV-WORK-OPEN-DATE.          27050048
270600***  DISPLAY 'PV-WORK-DATE:         ' PV-WORK-DATE.               27060048
270700***  DISPLAY 'PS-PROCESS-STORE-SW:  ' PS-PROCESS-STORE-SW.        27070048
270800                                                                  27080031
270900                                                                  27090031
271000******************************************************************27100005
271100*                                                                 27110005
271200******************************************************************27120005
271300 8010-READ-TRIP-FILE.                                             27130004
271400***  DISPLAY '                           '.                       27140097
271500***  DISPLAY '8010-READ-TRIP-FILE        '.                       27150097
271600                                                                  27160004
271700     READ TRIP-FILE INTO SU069-EXTRACT-RECORD                     27170004
271800         AT END                                                   27180004
271900             SET PS-EOF-INPUT-YES     TO TRUE                     27190004
272000     END-READ.                                                    27200004
272100                                                                  27210004
272200     MOVE  SU069-OTBND-TRIP-ID  TO  PV-DISP-TRIP.                 27220026
272300     MOVE  SU069-TRIP-OCRNC-ID  TO  PV-DISP-ORCNCE.               27230027
272400                                                                  27240099
272500     IF  PS-EOF-INPUT-YES                                         27250099
272600         CONTINUE                                                 27260099
272700     ELSE                                                         27270099
272800         DISPLAY '      '                                         27280099
272900         DISPLAY 'TRIP: ' PV-DISP-TRIP                            27290099
273000                 '         OCRNC: ' PV-DISP-ORCNCE                27300099
273100     END-IF.                                                      27310099
273200                                                                  27320026
273300                                                                  27330027
273400******************************************************************27340005
273500*                                                                 27350005
273600******************************************************************27360005
273700 8020-GET-STORE-INFORMATION.                                      27370004
273800***  DISPLAY '8020-GET-STORE-INFORMATION '.                       27380048
273900                                                                  27390004
274000     MOVE '8020-GET-STORE-INFORMATION'                            27400004
274100                                 TO PV-PARAGRAPH-NAME.            27410004
274200     MOVE 'XLT_LOC                       '  TO  PV-TABLE-1.       27420005
274300     MOVE '                              '  TO  PV-TABLE-2.       27430005
274400     MOVE '                              '  TO  PV-TABLE-3.       27440005
274500                                                                  27450005
274600     MOVE  SU069-LOC-NBR  TO  XLT00010-LOC-NBR.                   27460013
274700                                                                  27470005
274800     EXEC SQL                                                     27480004
274900       SELECT DIST_NBR                                            27490004
275000             ,LOC_TYP_CDE                                         27500004
275100             ,OPN_DTE                                             27510004
275200             ,E_BUS_IND                                           27520004
275300       INTO  :XLT00010-DIST-NBR :DN-DIST-NBR                      27530099
275400            ,:XLT00010-LOC-TYP-CDE                                27540004
275500            ,:XLT00010-OPN-DTE                                    27550004
275600            ,:XLT00010-E-BUS-IND                                  27560004
275700       FROM   XLT_LOC                                             27570004
275800       WHERE  LOC_NBR            = :XLT00010-LOC-NBR              27580004
275900     END-EXEC.                                                    27590004
276000                                                                  27600004
276100     EVALUATE TRUE                                                27610004
276200         WHEN SQLCODE = ZEROS                                     27620004
                 IF DN-DIST-NBR = 0                                     27621099
276300              MOVE  XLT00010-DIST-NBR  TO  PV-DISP-DISTRICT       27630021
                 ELSE                                                   27631099
                    MOVE  ZERO               TO  PV-DISP-DISTRICT       27632099
                 END-IF                                                 27633099
276400         WHEN OTHER                                               27640004
276500              PERFORM Z999-SQL-ERROR                              27650004
276600     END-EVALUATE.                                                27660004
276700                                                                  27670005
276800                                                                  27680005
276900******************************************************************27690005
277000* CHECK IF ALL STORES TURNED ON                                   27700099
277010* IF KRPRPM-FUNC-BEG-TMST NOT EQUAL TO DEFAULT OF                 27701099
277020*  '0001-01-01-01.01.01.000000' THEN ALL STORES TURNED ON         27702099
277100******************************************************************27710005
277200 8025-CHECK-PARM-STORE-LEVEL.                                     27720099
277300*    DISPLAY '8025-CHECK-PARM-STORE-LEVEL'.                       27730099
277400                                                                  27740004
277500     MOVE '8025-CHECK-PARM-STORE-LEVEL '                          27750099
277600                                 TO PV-PARAGRAPH-NAME.            27760004
277700     MOVE 'TKRPRPM                       '  TO  PV-TABLE-1.       27770005
277800     MOVE '                              '  TO  PV-TABLE-2.       27780005
277900     MOVE '                              '  TO  PV-TABLE-3.       27790005
278000                                                                  27800004
278200                                                                  27820004
278300     EXEC SQL                                                     27830004
278330        SELECT  FUNC_BEG_TMST                                     27833099
278350          INTO  :KRPRPM-FUNC-BEG-TMST                             27835099
278360          FROM  TKRPRPM                                           27836099
278370         WHERE SYS_PRC_FUNC_CDE   = 'BALONH'                      27837099
278380           AND FUNC_PRC_STAT_CDE  =  'AC'                         27838099
278390           AND LOC_ID             =  090                          27839099
279200     END-EXEC.                                                    27920004
279300                                                                  27930004
279400     EVALUATE TRUE                                                27940004
279500         WHEN SQLCODE = ZEROS                                     27950004
279700         WHEN SQLCODE = +100                                      27970004
279701              CONTINUE                                            27970199
279900         WHEN OTHER                                               27990004
280000              PERFORM Z999-SQL-ERROR                              28000004
280100     END-EVALUATE.                                                28010004
280200                                                                  28020004
280300                                                                  28030005
280310******************************************************************28031099
280320* CHECK IF DISTRICT IS TURNED ON FOR ZERO ON-HAND PROCESSING      28032099
280330******************************************************************28033099
280340 8030-GET-DISTRICT-PARM.                                          28034099
280350*    DISPLAY '8030-GET-DISTRICT-PARM     '.                       28035099
280360                                                                  28036099
280370     MOVE '8030-GET-DISTRICT-PARM    '                            28037099
280380                                 TO PV-PARAGRAPH-NAME.            28038099
280390     MOVE 'TKRPRPM                       '  TO  PV-TABLE-1.       28039099
280391     MOVE '                              '  TO  PV-TABLE-2.       28039199
280392     MOVE '                              '  TO  PV-TABLE-3.       28039299
280393                                                                  28039399
280394     MOVE XLT00010-DIST-NBR  TO KRPRPM-LOC-ID                     28039499
280395                                                                  28039599
280396     EXEC SQL                                                     28039699
280397          SELECT   FUNC_TXT                                       28039799
280398            INTO  :KRPRPM-FUNC-TXT                                28039899
280399            FROM  TKRPRPM B                                       28039999
280400           WHERE  B.LOC_ID            =  :KRPRPM-LOC-ID           28040099
280401             AND  B.INTFC_SYS_CDE     =  'STR'                    28040199
280402             AND  B.SYS_PRC_FUNC_CDE  =  'PRCONH'                 28040299
280403             AND  B.FUNC_BEG_TMST     <  :SU069-OTBND-STAT-TMST   28040399
280404             AND  B.FUNC_TXT          =  'Y'                      28040499
280405     END-EXEC.                                                    28040599
280406                                                                  28040699
280407     EVALUATE TRUE                                                28040799
280408         WHEN SQLCODE = ZEROS                                     28040899
280409              SET  PS-DISTRICT-ON-HAND-YES  TO  TRUE              28040999
280410         WHEN SQLCODE = +100                                      28041099
280411              SET  PS-DISTRICT-ON-HAND-NO   TO  TRUE              28041199
280412         WHEN OTHER                                               28041299
280413              PERFORM Z999-SQL-ERROR                              28041399
280414     END-EVALUATE.                                                28041499
280415                                                                  28041599
280416                                                                  28041699
280420******************************************************************28042099
280500*                                                                 28050005
280600******************************************************************28060005
280700 8040-GET-DC-STORE-NAME.                                          28070007
280800***  DISPLAY '8040-GET-DC-STORE-NAME     '.                       28080048
280900                                                                  28090005
281000     MOVE '8040-GET-DC-STORE-NAME   '                             28100005
281100                                 TO  PV-PARAGRAPH-NAME.           28110005
281200     MOVE 'TSUOBTR                       '  TO  PV-TABLE-1.       28120005
281300     MOVE 'XLT_LOC                       '  TO  PV-TABLE-2.       28130005
281400     MOVE 'XLT_LOC                       '  TO  PV-TABLE-3.       28140005
281500                                                                  28150005
281600     MOVE  SU069-OTBND-TRIP-ID   TO  SUOBTR-OTBND-TRIP-ID.        28160005
281700                                                                  28170005
281800     EXEC SQL                                                     28180005
281900          SELECT A.ORGN_OPER_UNT_ID                               28190005
282000                ,B.LOC_NM                                         28200005
282100                ,C.LOC_NM                                         28210005
282200           INTO  :PV-DC-NUMBER                                    28220005
282300                ,:PV-DC-NAME                                      28230005
282400                ,:PV-STORE-NAME                                   28240005
282500           FROM   TSUOBTR A                                       28250005
282600                 ,XLT_LOC B                                       28260005
282700                 ,XLT_LOC C                                       28270005
282800          WHERE  A.OTBND_TRIP_ID     =  :SUOBTR-OTBND-TRIP-ID     28280005
282900            AND  A.ORGN_OPER_UNT_ID  =  B.LOC_NBR                 28290005
283000            AND  A.DEST_OPER_UNT_ID  =  C.LOC_NBR                 28300005
283100     END-EXEC.                                                    28310005
283200                                                                  28320005
283300     EVALUATE TRUE                                                28330005
283400         WHEN SQLCODE = ZEROS                                     28340005
283500              CONTINUE                                            28350005
283600         WHEN OTHER                                               28360005
283700              PERFORM Z999-SQL-ERROR                              28370005
283800     END-EVALUATE.                                                28380005
283900                                                                  28390005
284000                                                                  28400005
284100******************************************************************28410005
284200*                                                                 28420005
284300******************************************************************28430005
284400 8050-GET-TRAILER-INFO.                                           28440005
284500***  DISPLAY '8050-GET-TRAILER-INFO      '.                       28450048
284600                                                                  28460005
284700     MOVE '8050-GET-TRAILER-INFO    '                             28470005
284800                                 TO  PV-PARAGRAPH-NAME.           28480005
284900                                                                  28490005
285000     MOVE  SU069-OTBND-TRIP-SRL-NBR TO  CNTRID-TRLR-SRL-NBR.      28500013
285100     MOVE 'TCNTRID                       '  TO  PV-TABLE-1.       28510005
285200     MOVE '                              '  TO  PV-TABLE-2.       28520005
285300     MOVE '                              '  TO  PV-TABLE-3.       28530005
285400                                                                  28540005
285500     EXEC SQL                                                     28550005
285600          SELECT SCAC_CDE                                         28560005
285700                ,TRLR_ID                                          28570005
285800           INTO  :PV-DC-SCAC                                      28580005
285900                ,:PV-DC-TRLR-ID                                   28590005
286000           FROM   TCNTRID                                         28600013
286100          WHERE  TRLR_SRL_NBR  =  :CNTRID-TRLR-SRL-NBR            28610005
286200     END-EXEC.                                                    28620005
286300                                                                  28630005
286400     EVALUATE TRUE                                                28640005
286500         WHEN SQLCODE = ZEROS                                     28650005
286600              CONTINUE                                            28660005
286700         WHEN OTHER                                               28670005
286800              PERFORM Z999-SQL-ERROR                              28680005
286900     END-EVALUATE.                                                28690005
287000                                                                  28700005
287100                                                                  28710005
287200******************************************************************28720005
287300*                                                                 28730005
287400******************************************************************28740005
287500 8060-GET-STATUS-DESC.                                            28750005
287600***  DISPLAY '8060-GET-STATUS-DESC       '.                       28760048
287700                                                                  28770005
287800     MOVE '8060-GET-STATUS-DESC     '                             28780005
287900                                 TO  PV-PARAGRAPH-NAME.           28790005
288000     MOVE 'TSUOBSC                       '  TO  PV-TABLE-1.       28800005
288100     MOVE '                              '  TO  PV-TABLE-2.       28810005
288200     MOVE '                              '  TO  PV-TABLE-3.       28820005
288300                                                                  28830005
288400     MOVE  SU069-TRIP-STAT-CDE   TO  SUOBSC-TRIP-STAT-CDE         28840005
288500                                                                  28850005
288600     EXEC SQL                                                     28860005
288700          SELECT TRIP_STAT_DESC                                   28870005
288800           INTO  :PV-TRIP-STATUS                                  28880005
288900           FROM   TSUOBSC                                         28890007
289000          WHERE  TRIP_STAT_CDE  =  :SUOBSC-TRIP-STAT-CDE          28900005
289100     END-EXEC.                                                    28910005
289200                                                                  28920005
289300     EVALUATE TRUE                                                28930005
289400         WHEN SQLCODE = ZEROS                                     28940005
289500              CONTINUE                                            28950005
289600         WHEN OTHER                                               28960005
289700              PERFORM Z999-SQL-ERROR                              28970005
289800     END-EVALUATE.                                                28980005
289900                                                                  28990005
290000                                                                  29000005
290100******************************************************************29010007
290200*                                                                 29020007
290300******************************************************************29030007
290400 8070-GET-TRIP-BEGIN-END-TMST.                                    29040007
290500***  DISPLAY '8070-GET-TRIP-BEGIN-END-TMST'.                      29050048
290600                                                                  29060007
290700     PERFORM 8072-TRIP-BEGIN-TMST.                                29070007
290800     PERFORM 8074-TRIP-END-TMST.                                  29080007
290900                                                                  29090007
291000                                                                  29100007
291100******************************************************************29110007
291200*                                                                 29120007
291300******************************************************************29130007
291400 8072-TRIP-BEGIN-TMST.                                            29140007
291500***  DISPLAY '8072-TRIP-BEGIN-TMST        '.                      29150048
291600                                                                  29160018
291700     MOVE '8072-TRIP-BEGIN-TMST        '                          29170007
291800                                 TO  PV-PARAGRAPH-NAME.           29180007
291900     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       29190007
292000     MOVE '                              '  TO  PV-TABLE-2.       29200007
292100     MOVE '                              '  TO  PV-TABLE-3.       29210007
292200                                                                  29220007
292300     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       29230007
292400                                                                  29240007
292500     EXEC SQL                                                     29250007
292600          SELECT MIN(DIVERT_TMST)                                 29260007
292700           INTO  :PV-TRIP-BEGIN-TMST                              29270007
292800           FROM   SUT_TRIP_DTL_SUM                                29280013
292900          WHERE  TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID        29290007
293000     END-EXEC.                                                    29300007
293100                                                                  29310007
293200     EVALUATE TRUE                                                29320007
293300         WHEN SQLCODE = ZEROS                                     29330007
293400              CONTINUE                                            29340007
293500         WHEN OTHER                                               29350007
293600              PERFORM Z999-SQL-ERROR                              29360007
293700     END-EVALUATE.                                                29370007
293800                                                                  29380007
293900                                                                  29390007
294000******************************************************************29400007
294100*                                                                 29410007
294200******************************************************************29420007
294300 8074-TRIP-END-TMST.                                              29430007
294400***  DISPLAY '8074-TRIP-END-TMST          '.                      29440048
294500                                                                  29450010
294600     MOVE '8074-TRIP-END-TMST          '                          29460007
294700                                 TO  PV-PARAGRAPH-NAME.           29470007
294800     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       29480007
294900     MOVE '                              '  TO  PV-TABLE-2.       29490007
295000     MOVE '                              '  TO  PV-TABLE-3.       29500007
295100                                                                  29510007
295200     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       29520007
295300                                                                  29530007
295400     EXEC SQL                                                     29540007
295500          SELECT MAX(DIVERT_TMST)                                 29550007
295600           INTO  :PV-TRIP-END-TMST                                29560007
295700           FROM   SUT_TRIP_DTL_SUM                                29570013
295800          WHERE  TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID        29580007
295900     END-EXEC.                                                    29590007
296000                                                                  29600007
296100     EVALUATE TRUE                                                29610007
296200         WHEN SQLCODE = ZEROS                                     29620007
296300              CONTINUE                                            29630007
296400         WHEN OTHER                                               29640007
296500              PERFORM Z999-SQL-ERROR                              29650007
296600     END-EVALUATE.                                                29660007
296700                                                                  29670007
296800                                                                  29680025
296900******************************************************************29690025
297000*                                                                 29700025
297100******************************************************************29710025
297200 8075-GET-TRIP-CARTON-COUNT.                                      29720025
297300***  DISPLAY '8085-GET-TRIP-CARTON-COUNT   '.                     29730048
297400                                                                  29740025
297500     MOVE '8085-GET-TRIP-CARTON-COUNT  '                          29750025
297600                                 TO  PV-PARAGRAPH-NAME.           29760025
297700     MOVE 'SUT_TRIP_SUM                  '  TO  PV-TABLE-1.       29770025
297800     MOVE '                              '  TO  PV-TABLE-2.       29780025
297900     MOVE '                              '  TO  PV-TABLE-3.       29790025
298000                                                                  29800025
298100     MOVE  SU069-TRIP-OCRNC-ID  TO  SUT00007-TRIP-OCRNC-ID.       29810025
298200     MOVE  SU069-OTBND-TRIP-ID  TO  SUT00007-OTBND-TRIP-ID.       29820025
298300                                                                  29830025
298400     EXEC SQL                                                     29840025
298500          SELECT CART_QTY                                         29850025
298600            INTO :SUT00007-CART-QTY                               29860025
298700            FROM SUT_TRIP_SUM                                     29870025
298800           WHERE TRIP_OCRNC_ID =  :SUT00007-TRIP-OCRNC-ID         29880025
298900             AND OTBND_TRIP_ID =  :SUT00007-OTBND-TRIP-ID         29890025
299000     END-EXEC.                                                    29900025
299100                                                                  29910025
299200     EVALUATE TRUE                                                29920025
299300         WHEN SQLCODE = ZEROS                                     29930025
299400              MOVE  SUT00007-CART-QTY                             29940025
299500                               TO  PV-TRIP-CARTON-COUNT           29950025
299600         WHEN OTHER                                               29960025
299700              PERFORM Z999-SQL-ERROR                              29970025
299800     END-EVALUATE.                                                29980025
299900                                                                  29990025
300000                                                                  30000025
300100******************************************************************30010025
300200*                                                                 30020005
300300******************************************************************30030005
300400 8080-COUNT-SOFTLINE-UNITS.                                       30040010
300500***  DISPLAY '8080-COUNT-SOFTLINE-UNITS   '.                      30050053
300600                                                                  30060010
300700     MOVE '8080-COUNT-SOFTLINE-UNITS   '                          30070010
300800                                 TO  PV-PARAGRAPH-NAME.           30080010
300900     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       30090010
301000     MOVE '                              '  TO  PV-TABLE-2.       30100010
301100     MOVE '                              '  TO  PV-TABLE-3.       30110010
301200                                                                  30120010
301300     EXEC SQL                                                     30130010
301400          SELECT SUM(UNT_QTY)                                     30140010
301500            INTO :PV-SOFTLINE-UNITS :PV-NULL-IND-1                30150010
301600            FROM SUT_TRIP_DTL_SUM                                 30160010
301700           WHERE SHIPT_UNT_ID  =  :SUT00095-SHIPT-UNT-ID          30170073
301800             AND TRIP_OCRNC_ID =  :SUT00095-TRIP-OCRNC-ID         30180073
301900             AND MDSE_LNE_CDE  =  'S'                             30190010
302000     END-EXEC.                                                    30200010
302100                                                                  30210010
302200     EVALUATE TRUE                                                30220010
302300         WHEN SQLCODE = ZEROS                                     30230010
302400              IF  PV-NULL-IND-1  =  -1                            30240010
302500                  MOVE ZEROES  TO  PV-SOFTLINE-UNITS              30250010
302600              END-IF                                              30260010
302700         WHEN OTHER                                               30270010
302800              PERFORM Z999-SQL-ERROR                              30280010
302900     END-EVALUATE.                                                30290010
303000                                                                  30300005
303100                                                                  30310005
303200******************************************************************30320010
303300*                                                                 30330010
303400******************************************************************30340010
303500 8086-COUNT-HANG-UNITS.                                           30350037
303600***  DISPLAY '8086-COUNT-HANG-UNITS   '.                          30360053
303700                                                                  30370010
303800     MOVE '8086-COUNT-HANG-UNITS   '                              30380037
303900                                 TO  PV-PARAGRAPH-NAME.           30390010
304000     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       30400010
304100     MOVE '                              '  TO  PV-TABLE-2.       30410010
304200     MOVE '                              '  TO  PV-TABLE-3.       30420010
304300                                                                  30430010
304400     EXEC SQL                                                     30440010
304500          SELECT SUM(UNT_QTY)                                     30450010
304600            INTO :PV-HANG-UNITS :PV-NULL-IND-2                    30460037
304700            FROM SUT_TRIP_DTL_SUM                                 30470010
304800           WHERE SHIPT_UNT_ID      =  :SUT00095-SHIPT-UNT-ID      30480037
304900             AND TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     30490073
305000             AND HNG_FOLD_SEQ_NBR  =  1                           30500037
305100     END-EXEC.                                                    30510010
305200                                                                  30520010
305300     EVALUATE TRUE                                                30530010
305400         WHEN SQLCODE = ZEROS                                     30540010
305500              IF  PV-NULL-IND-2  =  -1                            30550010
305600                  MOVE ZEROES  TO  PV-HANG-UNITS                  30560037
305700              END-IF                                              30570010
305800         WHEN OTHER                                               30580010
305900              PERFORM Z999-SQL-ERROR                              30590010
306000     END-EVALUATE.                                                30600010
306100                                                                  30610010
306200                                                                  30620010
306300******************************************************************30630037
306400*                                                                 30640037
306500******************************************************************30650037
306600 8087-COUNT-FOLD-UNITS.                                           30660037
306700***  DISPLAY '8087-COUNT-FOLD-UNITS   '.                          30670048
306800                                                                  30680037
306900     MOVE '8087-COUNT-FOLD-UNITS   '                              30690037
307000                                 TO  PV-PARAGRAPH-NAME.           30700037
307100     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       30710037
307200     MOVE '                              '  TO  PV-TABLE-2.       30720037
307300     MOVE '                              '  TO  PV-TABLE-3.       30730037
307400                                                                  30740037
307500     EXEC SQL                                                     30750037
307600          SELECT SUM(UNT_QTY)                                     30760037
307700            INTO :PV-FOLD-UNITS :PV-NULL-IND-1                    30770037
307800            FROM SUT_TRIP_DTL_SUM                                 30780037
307900           WHERE SHIPT_UNT_ID      =  :SUT00095-SHIPT-UNT-ID      30790073
308000             AND TRIP_OCRNC_ID     =  :SUT00095-TRIP-OCRNC-ID     30800073
308100             AND HNG_FOLD_SEQ_NBR  =  2                           30810037
308200     END-EXEC.                                                    30820037
308300                                                                  30830037
308400     EVALUATE TRUE                                                30840037
308500         WHEN SQLCODE = ZEROS                                     30850037
308600              IF  PV-NULL-IND-1  =  -1                            30860037
308700                  MOVE ZEROES  TO  PV-FOLD-UNITS                  30870037
308800              END-IF                                              30880037
308900         WHEN OTHER                                               30890037
309000              PERFORM Z999-SQL-ERROR                              30900037
309100     END-EVALUATE.                                                30910037
309200                                                                  30920037
309300                                                                  30930037
309400******************************************************************30940037
309500*                                                                 30950037
309600******************************************************************30960037
309700 8085-COUNT-HARDLINE-UNITS.                                       30970037
309800***  DISPLAY '8085-COUNT-HARDLINE-UNITS   '.                      30980048
309900                                                                  30990037
310000     MOVE '8085-COUNT-HARDLINE-UNITS   '                          31000037
310100                                 TO  PV-PARAGRAPH-NAME.           31010037
310200     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       31020037
310300     MOVE '                              '  TO  PV-TABLE-2.       31030037
310400     MOVE '                              '  TO  PV-TABLE-3.       31040037
310500                                                                  31050037
310600     EXEC SQL                                                     31060037
310700          SELECT SUM(UNT_QTY)                                     31070037
310800            INTO :PV-HARDLINE-UNITS :PV-NULL-IND-2                31080037
310900            FROM SUT_TRIP_DTL_SUM                                 31090037
311000           WHERE SHIPT_UNT_ID  =  :SUT00095-SHIPT-UNT-ID          31100037
311100             AND TRIP_OCRNC_ID =  :SUT00095-TRIP-OCRNC-ID         31110073
311200             AND MDSE_LNE_CDE  =  'H'                             31120037
311300     END-EXEC.                                                    31130037
311400                                                                  31140037
311500     EVALUATE TRUE                                                31150037
311600         WHEN SQLCODE = ZEROS                                     31160037
311700              IF  PV-NULL-IND-2  =  -1                            31170037
311800                  MOVE ZEROES  TO  PV-HARDLINE-UNITS              31180037
311900              END-IF                                              31190037
312000         WHEN OTHER                                               31200037
312100              PERFORM Z999-SQL-ERROR                              31210037
312200     END-EVALUATE.                                                31220037
312300                                                                  31230037
312400                                                                  31240037
312500******************************************************************31250010
312600*                                                                 31260010
312700******************************************************************31270010
312800 8090-TOTAL-SKU-COUNTS.                                           31280011
312900***  DISPLAY '8090-TOTAL-SKU-COUNTS       '.                      31290048
313000                                                                  31300010
313100     MOVE '8090-TOTAL-SKU-COUNTS       '                          31310011
313200                                 TO  PV-PARAGRAPH-NAME.           31320010
313300     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       31330010
313400     MOVE '                              '  TO  PV-TABLE-2.       31340010
313500     MOVE '                              '  TO  PV-TABLE-3.       31350010
313600                                                                  31360010
313700     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       31370010
313800                                                                  31380010
313900     EXEC SQL                                                     31390010
314000          SELECT COUNT(DISTINCT(SKU_NBR))                         31400010
314100            INTO :PV-TOTAL-SKU-COUNT                              31410011
314200            FROM SUT_TRIP_DTL_SUM                                 31420010
314300           WHERE TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID        31430010
314400             AND DIVERT_TMST   <=  :PV-QUARTER-BEGIN-TMST         31440099
314500             AND DIVERT_TMST   >=  :PV-QUARTER-END-TMST           31450099
314600     END-EXEC.                                                    31460010
314700                                                                  31470010
314800     EVALUATE TRUE                                                31480010
314900         WHEN SQLCODE = ZEROS                                     31490010
315000              CONTINUE                                            31500010
315100         WHEN OTHER                                               31510010
315200              PERFORM Z999-SQL-ERROR                              31520010
315300     END-EVALUATE.                                                31530010
315400                                                                  31540010
315500                                                                  31550010
315600******************************************************************31560011
315700*                                                                 31570011
315800******************************************************************31580011
315900 8091-HARD-SKU-COUNTS.                                            31590011
316000***  DISPLAY '8091-HARD-SKU-COUNTS        '.                      31600096
316100                                                                  31610011
316200     MOVE '8091-HARD-SKU-COUNTS        '                          31620011
316300                                 TO  PV-PARAGRAPH-NAME.           31630011
316400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       31640011
316500     MOVE '                              '  TO  PV-TABLE-2.       31650011
316600     MOVE '                              '  TO  PV-TABLE-3.       31660011
316700                                                                  31670011
316800     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       31680011
316900                                                                  31690011
317000     EXEC SQL                                                     31700011
317100          SELECT COUNT(DISTINCT(SKU_NBR))                         31710011
317200            INTO :PV-HARD-SKU-COUNT                               31720011
317300            FROM SUT_TRIP_DTL_SUM                                 31730011
317400           WHERE TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID        31740011
317500             AND DIVERT_TMST   <=  :PV-QUARTER-BEGIN-TMST         31750099
317600             AND DIVERT_TMST   >=  :PV-QUARTER-END-TMST           31760099
317700             AND MDSE_LNE_CDE   =  'H'                            31770011
317800     END-EXEC.                                                    31780011
317900                                                                  31790011
318000     EVALUATE TRUE                                                31800011
318100         WHEN SQLCODE = ZEROS                                     31810011
318200              CONTINUE                                            31820011
318300         WHEN OTHER                                               31830011
318400              PERFORM Z999-SQL-ERROR                              31840011
318500     END-EVALUATE.                                                31850011
318600                                                                  31860011
318700                                                                  31870011
318800******************************************************************31880011
318900*                                                                 31890011
319000******************************************************************31900011
319100 8092-SOFT-SKU-COUNTS.                                            31910011
319200***  DISPLAY '8092-SOFT-SKU-COUNTS        '.                      31920096
319300                                                                  31930011
319400     MOVE '8092-SOFT-SKU-COUNTS        '                          31940011
319500                                 TO  PV-PARAGRAPH-NAME.           31950011
319600     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       31960011
319700     MOVE '                              '  TO  PV-TABLE-2.       31970011
319800     MOVE '                              '  TO  PV-TABLE-3.       31980011
319900                                                                  31990011
320000     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       32000011
320100                                                                  32010011
320200     EXEC SQL                                                     32020011
320300          SELECT COUNT(DISTINCT(SKU_NBR))                         32030011
320400            INTO :PV-SOFT-SKU-COUNT                               32040011
320500            FROM SUT_TRIP_DTL_SUM                                 32050011
320600           WHERE TRIP_OCRNC_ID  =  :SUT00095-TRIP-OCRNC-ID        32060011
320700             AND DIVERT_TMST   <=  :PV-QUARTER-BEGIN-TMST         32070099
320800             AND DIVERT_TMST   >=  :PV-QUARTER-END-TMST           32080099
320900             AND MDSE_LNE_CDE   =  'S'                            32090011
321000     END-EXEC.                                                    32100011
321100                                                                  32110011
321200     EVALUATE TRUE                                                32120011
321300         WHEN SQLCODE = ZEROS                                     32130011
321400              CONTINUE                                            32140011
321500         WHEN OTHER                                               32150011
321600              PERFORM Z999-SQL-ERROR                              32160011
321700     END-EVALUATE.                                                32170011
321800                                                                  32180011
321900                                                                  32190011
322000******************************************************************32200011
322100*                                                                 32210011
322200******************************************************************32220011
322300 8093-HANG-SKU-COUNTS.                                            32230011
322400***  DISPLAY '8093-HANG-SKU-COUNTS        '.                      32240096
322500                                                                  32250011
322600     MOVE '8093-HANG-SKU-COUNTS        '                          32260011
322700                                 TO  PV-PARAGRAPH-NAME.           32270011
322800     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       32280011
322900     MOVE '                              '  TO  PV-TABLE-2.       32290011
323000     MOVE '                              '  TO  PV-TABLE-3.       32300011
323100                                                                  32310011
323200     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       32320011
323300                                                                  32330011
323400     EXEC SQL                                                     32340011
323500          SELECT COUNT(DISTINCT(SKU_NBR))                         32350011
323600            INTO :PV-HANG-SKU-COUNT                               32360011
323700            FROM SUT_TRIP_DTL_SUM                                 32370011
323800           WHERE TRIP_OCRNC_ID    =  :SUT00095-TRIP-OCRNC-ID      32380011
323900             AND DIVERT_TMST     <=  :PV-QUARTER-BEGIN-TMST       32390099
324000             AND DIVERT_TMST     >=  :PV-QUARTER-END-TMST         32400099
324100             AND HNG_FOLD_SEQ_NBR  =  1                           32410013
324200     END-EXEC.                                                    32420011
324300                                                                  32430011
324400     EVALUATE TRUE                                                32440011
324500         WHEN SQLCODE = ZEROS                                     32450011
324600              CONTINUE                                            32460011
324700         WHEN OTHER                                               32470011
324800              PERFORM Z999-SQL-ERROR                              32480011
324900     END-EVALUATE.                                                32490011
325000                                                                  32500011
325100                                                                  32510011
325200******************************************************************32520011
325300*                                                                 32530011
325400******************************************************************32540011
325500 8094-FOLD-SKU-COUNTS.                                            32550011
325600***  DISPLAY '8094-FOLD-SKU-COUNTS        '.                      32560096
325700                                                                  32570011
325800     MOVE '8094-FOLD-SKU-COUNTS        '                          32580011
325900                                 TO  PV-PARAGRAPH-NAME.           32590011
326000     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       32600011
326100     MOVE '                              '  TO  PV-TABLE-2.       32610011
326200     MOVE '                              '  TO  PV-TABLE-3.       32620011
326300                                                                  32630011
326400     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       32640011
326500                                                                  32650011
326600     EXEC SQL                                                     32660011
326700          SELECT COUNT(DISTINCT(SKU_NBR))                         32670011
326800            INTO :PV-FOLD-SKU-COUNT                               32680011
326900            FROM SUT_TRIP_DTL_SUM                                 32690011
327000           WHERE TRIP_OCRNC_ID    =  :SUT00095-TRIP-OCRNC-ID      32700011
327100             AND DIVERT_TMST     <=  :PV-QUARTER-BEGIN-TMST       32710099
327200             AND DIVERT_TMST     >=  :PV-QUARTER-END-TMST         32720099
327300             AND HNG_FOLD_SEQ_NBR  =  2                           32730013
327400     END-EXEC.                                                    32740011
327500                                                                  32750011
327600     EVALUATE TRUE                                                32760011
327700         WHEN SQLCODE = ZEROS                                     32770011
327800              CONTINUE                                            32780011
327900         WHEN OTHER                                               32790011
328000              PERFORM Z999-SQL-ERROR                              32800011
328100     END-EVALUATE.                                                32810011
328200                                                                  32820011
328300                                                                  32830011
328400******************************************************************32840011
328500*                                                                 32850011
328600******************************************************************32860011
328700 8095-OH-R-SKU-COUNTS.                                            32870011
328800***  DISPLAY '8095-OH-R-SKU-COUNTS        '.                      32880096
328900                                                                  32890011
329000     MOVE '8095-OH-R-SKU-COUNTS        '                          32900011
329100                                 TO  PV-PARAGRAPH-NAME.           32910011
329200     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       32920011
329300     MOVE '                              '  TO  PV-TABLE-2.       32930011
329400     MOVE '                              '  TO  PV-TABLE-3.       32940011
329500                                                                  32950011
329600     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       32960011
329700                                                                  32970011
329800     EXEC SQL                                                     32980011
329900          SELECT COUNT(DISTINCT(SKU_NBR))                         32990011
330000            INTO :PV-OH-R-SKU-COUNT                               33000011
330100            FROM SUT_TRIP_DTL_SUM                                 33010011
330200           WHERE TRIP_OCRNC_ID    =  :SUT00095-TRIP-OCRNC-ID      33020011
330300             AND DIVERT_TMST     <=  :PV-QUARTER-BEGIN-TMST       33030099
330400             AND DIVERT_TMST     >=  :PV-QUARTER-END-TMST         33040099
330500             AND PRC_MSG_CDE      =  'RP'                         33050011
330600     END-EXEC.                                                    33060011
330700                                                                  33070011
330800     EVALUATE TRUE                                                33080011
330900         WHEN SQLCODE = ZEROS                                     33090011
331000              CONTINUE                                            33100011
331100         WHEN OTHER                                               33110011
331200              PERFORM Z999-SQL-ERROR                              33120011
331300     END-EVALUATE.                                                33130011
331400                                                                  33140011
331500                                                                  33150011
331600******************************************************************33160011
331700*                                                                 33170011
331800******************************************************************33180011
331900 8096-OH-N-SKU-COUNTS.                                            33190011
332000***  DISPLAY '8096-OH-N-SKU-COUNTS        '.                      33200096
332100                                                                  33210011
332200     MOVE '8096-OH-N-SKU-COUNTS        '                          33220011
332300                                 TO  PV-PARAGRAPH-NAME.           33230011
332400     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       33240011
332500     MOVE '                              '  TO  PV-TABLE-2.       33250011
332600     MOVE '                              '  TO  PV-TABLE-3.       33260011
332700                                                                  33270011
332800     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       33280011
332900                                                                  33290011
333000     EXEC SQL                                                     33300011
333100          SELECT COUNT(DISTINCT(SKU_NBR))                         33310011
333200            INTO :PV-OH-N-SKU-COUNT                               33320011
333300            FROM SUT_TRIP_DTL_SUM                                 33330011
333400           WHERE TRIP_OCRNC_ID    =  :SUT00095-TRIP-OCRNC-ID      33340011
333500             AND DIVERT_TMST     <=  :PV-QUARTER-BEGIN-TMST       33350099
333600             AND DIVERT_TMST     >=  :PV-QUARTER-END-TMST         33360099
333700             AND PRC_MSG_CDE      =  'RF'                         33370099
333800     END-EXEC.                                                    33380011
333900                                                                  33390011
334000     EVALUATE TRUE                                                33400011
334100         WHEN SQLCODE = ZEROS                                     33410011
334200              CONTINUE                                            33420011
334300         WHEN OTHER                                               33430011
334400              PERFORM Z999-SQL-ERROR                              33440011
334500     END-EVALUATE.                                                33450011
334600                                                                  33460011
334700                                                                  33470011
334800******************************************************************33480011
334900*                                                                 33490011
335000******************************************************************33500011
335100 8097-EAS-SKU-COUNTS.                                             33510011
335200***  DISPLAY '8097-EAS-SKU-COUNTS         '.                      33520096
335300                                                                  33530011
335400     MOVE '8097-EAS-SKU-COUNTS        '                           33540011
335500                                 TO  PV-PARAGRAPH-NAME.           33550011
335600     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       33560011
335700     MOVE '                              '  TO  PV-TABLE-2.       33570011
335800     MOVE '                              '  TO  PV-TABLE-3.       33580011
335900                                                                  33590011
336000     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       33600011
336100                                                                  33610011
336200     EXEC SQL                                                     33620011
336300          SELECT COUNT(DISTINCT(SKU_NBR))                         33630011
336400            INTO :PV-EAS-SKU-COUNT                                33640011
336500            FROM SUT_TRIP_DTL_SUM                                 33650011
336600           WHERE TRIP_OCRNC_ID    =  :SUT00095-TRIP-OCRNC-ID      33660011
336700             AND DIVERT_TMST     <=  :PV-QUARTER-BEGIN-TMST       33670099
336800             AND DIVERT_TMST     >=  :PV-QUARTER-END-TMST         33680099
336900             AND EAS_TAG_IND      =  'Y'                          33690011
337000     END-EXEC.                                                    33700011
337100                                                                  33710011
337200     EVALUATE TRUE                                                33720011
337300         WHEN SQLCODE = ZEROS                                     33730011
337400              CONTINUE                                            33740011
337500         WHEN OTHER                                               33750011
337600              PERFORM Z999-SQL-ERROR                              33760011
337700     END-EVALUATE.                                                33770011
337800                                                                  33780011
337900                                                                  33790011
338000******************************************************************33800011
338100*                                                                 33810011
338200******************************************************************33820011
338300 8098-CLEAR-SKU-COUNTS.                                           33830011
338400***  DISPLAY '8098-CLEAR-SKU-COUNTS       '.                      33840096
338500                                                                  33850011
338600     MOVE '8098-CLEAR-SKU-COUNTS        '                         33860011
338700                                 TO  PV-PARAGRAPH-NAME.           33870011
338800     MOVE 'SUT_TRIP_DTL_SUM              '  TO  PV-TABLE-1.       33880011
338900     MOVE '                              '  TO  PV-TABLE-2.       33890011
339000     MOVE '                              '  TO  PV-TABLE-3.       33900011
339100                                                                  33910011
339200     MOVE  SU069-TRIP-OCRNC-ID   TO  SUT00095-TRIP-OCRNC-ID       33920011
339300                                                                  33930011
339400     EXEC SQL                                                     33940011
339500          SELECT COUNT(DISTINCT(SKU_NBR))                         33950011
339600            INTO :PV-CLEAR-SKU-COUNT                              33960011
339700            FROM SUT_TRIP_DTL_SUM                                 33970011
339800           WHERE TRIP_OCRNC_ID    =  :SUT00095-TRIP-OCRNC-ID      33980011
339900             AND DIVERT_TMST     <=  :PV-QUARTER-BEGIN-TMST       33990099
340000             AND DIVERT_TMST     >=  :PV-QUARTER-END-TMST         34000099
340100             AND PRC_MSG_CDE      =  'CL'                         34010011
340200     END-EXEC.                                                    34020011
340300                                                                  34030011
340400     EVALUATE TRUE                                                34040011
340500         WHEN SQLCODE = ZEROS                                     34050011
340600              CONTINUE                                            34060011
340700         WHEN OTHER                                               34070011
340800              PERFORM Z999-SQL-ERROR                              34080011
340900     END-EVALUATE.                                                34090011
341000                                                                  34100011
341100                                                                  34110011
341200******************************************************************34120011
341300*                                                                 34130005
341400******************************************************************34140005
341500 8100-PRINT-REPORT-HEADINGS.                                      34150004
341600***  DISPLAY '8100-PRINT-REPORT-HEADINGS  '.                      34160096
341700                                                                  34170093
341800     ADD 1                        TO PV-PAGE-COUNT.               34180093
341900     MOVE PV-PAGE-COUNT           TO DP132-PAGE-NUMBER.           34190093
342000                                                                  34200093
342100     MOVE ZERO                    TO PV-LINE-COUNT.               34210093
342200     MOVE 1                       TO DP132-REPORT-NUMBER.         34220093
342300                                                                  34230093
342400                                                                  34240004
342500     MOVE  SU069-LOC-NBR             TO HL2-STORE-NBR             34250099
342600                                        SU074-STORE-NBR           34260099
342700     MOVE  PV-STORE-NAME             TO HL2-STORE-NAME            34270099
342800                                        SU074-STORE-NAME          34280099
342900     MOVE  PV-DC-NUMBER              TO HL3-DC-NBR                34290099
343000                                        SU074-DC-NBR              34300099
343100     MOVE  PV-DC-NAME                TO HL3-DC-NAME               34310099
343200                                        SU074-DC-NAME             34320099
343300     MOVE  PV-TRIP-STATUS            TO HL4-TRLR-STATUS           34330099
343400                                        SU074-TRLR-STATUS         34340099
343500     MOVE  PV-DC-SCAC                TO HL5-SCAC                  34350099
343600                                        SU074-SCAC                34360099
343700     MOVE  PV-DC-TRLR-ID             TO HL6-TRLR-ID               34370005
343800                                        SU074-TRLR-ID             34380099
343900     MOVE  SU069-OTBND-TRIP-SRL-NBR  TO HL7-TRLR-SRL              34390099
344000                                        SU074-TRLR-SRL            34400099
344100                                                                  34410005
344200     WRITE REPORT-RECORD                                          34420004
344300       FROM DP132-STANDRD-HEADER-132-COLS                         34430004
344400         AFTER ADVANCING PAGE.                                    34440004
344500                                                                  34450004
344600     WRITE REPORT-RECORD                                          34460004
344700       FROM HEADING-LINE1                                         34470004
344800         AFTER ADVANCING 2 LINES.                                 34480004
344900                                                                  34490004
345000     WRITE REPORT-RECORD                                          34500004
345100       FROM HEADING-LINE2                                         34510004
345200         AFTER ADVANCING 2 LINES.                                 34520004
345300                                                                  34530004
345400     WRITE REPORT-RECORD                                          34540004
345500       FROM HEADING-LINE3                                         34550004
345600         AFTER ADVANCING 1 LINE.                                  34560004
345700                                                                  34570004
345800     WRITE REPORT-RECORD                                          34580004
345900       FROM HEADING-LINE4                                         34590004
346000         AFTER ADVANCING 2 LINES.                                 34600004
346100                                                                  34610004
346200     WRITE REPORT-RECORD                                          34620004
346300       FROM HEADING-LINE5                                         34630004
346400         AFTER ADVANCING 1 LINE.                                  34640004
346500                                                                  34650004
346600     WRITE REPORT-RECORD                                          34660004
346700       FROM HEADING-LINE6                                         34670004
346800         AFTER ADVANCING 1 LINE.                                  34680004
346900                                                                  34690004
347000     WRITE REPORT-RECORD                                          34700004
347100       FROM HEADING-LINE7                                         34710004
347200         AFTER ADVANCING 1 LINE.                                  34720004
347300                                                                  34730004
347400     WRITE REPORT-RECORD                                          34740004
347500       FROM HEADING-LINE8                                         34750004
347600         AFTER ADVANCING 2 LINES.                                 34760004
347700                                                                  34770004
347800     WRITE REPORT-RECORD                                          34780004
347900       FROM HEADING-LINE9                                         34790004
348000         AFTER ADVANCING 1 LINE.                                  34800004
348100                                                                  34810004
348200                                                                  34820011
348300******************************************************************34830011
348400*                                                                 34840011
348500******************************************************************34850011
348600 8120-PRINT-REPORT.                                               34860011
348700***  DISPLAY '8120-PRINT-REPORT           '.                      34870048
348800                                                                  34880004
348900     WRITE REPORT-RECORD                                          34890011
349000       FROM TOTAL-LINE1                                           34900013
349100         AFTER ADVANCING 2 LINES.                                 34910098
349200                                                                  34920011
349300     WRITE REPORT-RECORD                                          34930011
349400       FROM TOTAL-LINE2                                           34940013
349500         AFTER ADVANCING 2 LINES.                                 34950077
349600                                                                  34960011
349700     WRITE REPORT-RECORD                                          34970011
349800       FROM TOTAL-LINE3                                           34980013
349900         AFTER ADVANCING 2 LINES.                                 34990077
350000                                                                  35000011
350100     WRITE REPORT-RECORD                                          35010011
350200       FROM TOTAL-LINE4                                           35020013
350300         AFTER ADVANCING 2 LINES.                                 35030077
350400                                                                  35040011
350500     WRITE REPORT-RECORD                                          35050011
350600       FROM TOTAL-LINE5                                           35060013
350700         AFTER ADVANCING 2 LINES.                                 35070077
350800                                                                  35080011
350900     WRITE REPORT-RECORD                                          35090011
351000       FROM TOTAL-LINE6                                           35100013
351100         AFTER ADVANCING 2 LINES.                                 35110077
351200                                                                  35120011
351300     WRITE REPORT-RECORD                                          35130011
351400       FROM TOTAL-LINE7                                           35140013
351500         AFTER ADVANCING 2 LINES.                                 35150077
351600                                                                  35160011
351700     WRITE REPORT-RECORD                                          35170011
351800       FROM TOTAL-LINE8                                           35180013
351900         AFTER ADVANCING 2 LINES.                                 35190077
352000                                                                  35200011
352100     WRITE REPORT-RECORD                                          35210011
352200       FROM TOTAL-LINE9                                           35220013
352300         AFTER ADVANCING 3 LINES.                                 35230077
352400                                                                  35240011
352500                                                                  35250001
352600******************************************************************35260097
352700*                                                                 35270097
352800******************************************************************35280097
352900 9000-END-PROCESS.                                                35290097
353000                                                                  35300097
353100     IF  PS-DATA-YES                                              35310097
353200         WRITE REPORT-RECORD                                      35320097
353300          FROM END-OF-REPORT-LINE                                 35330097
353400         AFTER ADVANCING 3 LINES                                  35340097
353500     END-IF.                                                      35350097
353600                                                                  35360097
353700     CLOSE TRIP-FILE                                              35370097
353800           REPORT-FILE                                            35380099
353900           OUTPUT-FILE.                                           35390099
354000                                                                  35400097
354100                                                                  35410097
354200******************************************************************35420001
354300*  PERFORMS A NON-SQL ABEND FOR THE PROGRAM                       35430001
354400******************************************************************35440001
354500 9200-ABEND.                                                      35450004
354600***  DISPLAY '9200-ABEND                  '.                      35460048
354700                                                                  35470018
354800     DISPLAY '***************************'.                       35480001
354900     DISPLAY '**       ABEND           **'.                       35490001
355000     DISPLAY '**  IN PROGRAM SUKRP046  **'.                       35500001
355100     DISPLAY '***************************'.                       35510001
355200     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.        35520001
355300     DISPLAY '**                 ** = ' PV-ERROR-MESSAGE-1.       35530001
355400     DISPLAY '**                 ** = ' PV-ERROR-MESSAGE-2.       35540001
355500                                                                  35550001
355600     MOVE +4014                  TO PV-ABEND-CODE.                35560001
355700     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         35570001
355800                                                                  35580001
355900******************************************************************35590004
356000*  PERFORMS AN SQL ABEND FOR THE PROGRAM                          35600004
356100******************************************************************35610004
356200 Z999-SQL-ERROR.                                                  35620004
356300***  DISPLAY 'Z999-SQL-ERROR              '.                      35630048
356400                                                                  35640004
356500     MOVE SU069-LOC-NBR             TO PV-DISP-STORE.             35650004
356600     MOVE SU069-OTBND-TRIP-ID       TO PV-DISP-TRIP.              35660005
356700     MOVE SU069-OTBND-TRIP-SRL-NBR  TO PV-DISP-TRLR-SRL.          35670013
356800     MOVE SU069-TRIP-OCRNC-ID       TO PV-DISP-ORCNCE.            35680014
356900     MOVE SQLCODE                   TO PV-DISP-SQLCODE.           35690013
357000                                                                  35700004
357100     DISPLAY '*********************************'                  35710004
357200     DISPLAY '** PROGRAM        ** =  SUKRP046'.                  35720004
357300     DISPLAY '*********************************'                  35730004
357400     DISPLAY '** PARAGRAPH      ** = ' PV-PARAGRAPH-NAME.         35740004
357500     DISPLAY '** SQLCODE        ** = ' PV-DISP-SQLCODE.           35750004
357600     DISPLAY '** DC             ** = ' PV-DISP-DC.                35760004
357700     DISPLAY '** DISTRICT       ** = ' PV-DISP-DISTRICT.          35770004
357800     DISPLAY '** STORE          ** = ' PV-DISP-STORE.             35780004
357900     DISPLAY '** OUTBOUND TRIP  ** = ' PV-DISP-TRIP.              35790004
358000     DISPLAY '** TRAILER SERIAL ** = ' PV-DISP-TRLR-SRL.          35800004
358100     DISPLAY '** SCAC           ** = ' PV-DC-SCAC.                35810005
358200     DISPLAY '** TRAILER        ** = ' PV-DC-TRLR-ID.             35820005
358300     DISPLAY '** OCCURANCE      ** = ' PV-DISP-ORCNCE.            35830014
358400     DISPLAY '**                **   '.                           35840014
358500     DISPLAY '** QUARTER BEGIN  **   ' PV-QUARTER-BEGIN-TMST.     35850062
358600     DISPLAY '** QUARTER END    **   ' PV-QUARTER-END-TMST.       35860062
358700     DISPLAY '**                **   '.                           35870062
358800     DISPLAY '** DB2 TABLE 1    ** = ' PV-TABLE-1.                35880005
358900     DISPLAY '** DB2 TABLE 2    ** = ' PV-TABLE-2.                35890005
359000     DISPLAY '** DB2 TABLE 3    ** = ' PV-TABLE-3.                35900005
359100     DISPLAY '*********************************'                  35910004
359200                                                                  35920004
359300     MOVE +4013 TO PV-ABEND-CODE.                                 35930004
359400     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         35940004
