000110******************************************************************00011001
000120 IDENTIFICATION DIVISION.                                         00012001
000130******************************************************************00013001
000140                                                                  00014001
000150 PROGRAM-ID.    SUKUT105.                                         00015099
000160 AUTHOR.        PAUL JORGENSEN.                                   00016068
000170 INSTALLATION.  KOHLS.                                            00017001
000180 DATE-WRITTEN   NOVEMBER, 2008.                                   00018099
000190 DATE-COMPILED.                                                   00019001
000191                                                                  00019101
000192******************************************************************00019201
000193*  THIS PROGRAM WILL ARCHIVE OUTBOUND TRIP SUMMARY DATA FROM      00019399
000194*  THE SUT_TRIP_SUM TABLE.                                        00019499
000196******************************************************************00019602
000197******************************************************************00019702
000198 ENVIRONMENT DIVISION.                                            00019802
000199******************************************************************00019902
000200 CONFIGURATION SECTION.                                           00020015
000201                                                                  00020115
000203 SOURCE-COMPUTER.        IBM-3090.                                00020315
000204 OBJECT-COMPUTER.        IBM-3090.                                00020415
000205                                                                  00020515
000206 INPUT-OUTPUT SECTION.                                            00020615
000207                                                                  00020715
000208 FILE-CONTROL.                                                    00020815
000209*                                                                 00020915
000210     SELECT EXTRACT-FILE                                          00021099
000211         ASSIGN TO INP01.                                         00021115
000212                                                                  00021215
000213     SELECT ARCHIVE-FILE                                          00021399
000214         ASSIGN TO OUT01.                                         00021415
000215                                                                  00021599
000216     SELECT PURGE-FILE                                            00021699
000217         ASSIGN TO OUT02.                                         00021799
000219*                                                                 00021915
000220******************************************************************00022002
000221 DATA DIVISION.                                                   00022102
000222******************************************************************00022202
000223*                                                                 00022302
000224 FILE SECTION.                                                    00022415
000225*                                                                 00022515
000231 FD  EXTRACT-FILE                                                 00023156
000232     RECORDING MODE IS F                                          00023215
000233     RECORD CONTAINS 20 CHARACTERS                                00023399
000234     LABEL RECORDS ARE OMITTED                                    00023415
000235     DATA RECORD IS EXTRACT-RECORD.                               00023558
000236 01  EXTRACT-RECORD                 PIC X(20).                    00023699
000237*                                                                 00023715
000238 FD  ARCHIVE-FILE                                                 00023899
000239     RECORDING MODE IS F                                          00023999
000240     RECORD CONTAINS 58 CHARACTERS                                00024099
000241     LABEL RECORDS ARE STANDARD                                   00024199
000242     DATA RECORD IS ARCHIVE-RECORD.                               00024299
000243 01  ARCHIVE-RECORD                 PIC X(58).                    00024399
000244*                                                                 00024499
000245 FD  PURGE-FILE                                                   00024599
000246     RECORDING MODE IS F                                          00024699
000247     RECORD CONTAINS 50 CHARACTERS                                00024799
000248     LABEL RECORDS ARE STANDARD                                   00024899
000249     DATA RECORD IS PURGE-RECORD.                                 00024999
000250 01  PURGE-RECORD                   PIC X(50).                    00025099
000251                                                                  00025199
000252******************************************************************00025202
000253 WORKING-STORAGE SECTION.                                         00025302
000254******************************************************************00025402
000255*                                                                 00025502
000256******************************************************************00025602
000257*  DB2 FORMATTED MESSAGE AREA                                     00025702
000258******************************************************************00025802
000259     COPY DPWS004.                                                00025902
000260                                                                  00026002
000261******************************************************************00026102
000262*    COMMUNICATIONS AREA FOR DB2                                  00026202
000263******************************************************************00026302
000264                                                                  00026402
000265     EXEC SQL                                                     00026502
000266          INCLUDE SQLCA                                           00026602
000267     END-EXEC.                                                    00026702
000268                                                                  00026802
000269******************************************************************00026902
000270*                                                                 00027002
000271 01  ABEND-CODE                      PIC S9(04)    VALUE +0       00027102
000272                                                   COMP SYNC.     00027202
000273                                                                  00027302
000274 01  PS-PROGRAM-SWITCHES.                                         00027402
000275     05  PS-END-OF-CURSOR-SW         PIC X(03)     VALUE 'N'.     00027599
000276         88  PS-END-OF-CURSOR-YES                  VALUE 'Y'.     00027699
000277         88  PS-END-OF-CURSOR-NO                   VALUE 'N'.     00027799
000278     05  PS-FIRST-TIME-SW            PIC X(01)     VALUE 'N'.     00027899
000279         88  PS-FIRST-TIME-YES                     VALUE 'Y'.     00027999
000280         88  PS-FIRST-TIME-NO                      VALUE 'N'.     00028099
000281     05  PS-EOF-PROCESS-SW           PIC  X(01)    VALUE 'N'.     00028199
000282         88  PS-EOF-PROCESS-YES                    VALUE 'Y'.     00028299
000283         88  PS-EOF-PROCESS-NO                     VALUE 'N'.     00028399
000284                                                                  00028420
000285                                                                  00028520
000286 01  PC-PROGRAM-CONSTANTS.                                        00028620
000287     05  PC-ROW-NOT-FOUND            PIC S9(04)    VALUE +100     00028720
000288                                                   COMP SYNC.     00028820
000289     05  PC-PROGRAM-NAME             PIC  X(08)    VALUE          00028923
000290         'SUKUT105'.                                              00029099
000291     05  PC-MAX-RETRIES              PIC S9(04)    VALUE +3       00029120
000292                                                   COMP SYNC.     00029220
000293                                                                  00029320
000294 01  PV-PROGRAM-VARIABLES.                                        00029420
000296     05  PV-SQL-RETURN-CD            PIC 999-.                    00029620
000297     05  PV-CICS-MSG-AREA            PIC  X(80)    VALUE SPACES.  00029720
000298     05  PV-COMMAREA-LENGTH          PIC S9(04)    VALUE +0       00029820
000299                                                   COMP SYNC.     00029920
000300     05  PV-CICS-RESPONSE            PIC S9(9)     VALUE ZERO     00030020
000301                                                   COMP SYNC.     00030120
000302                                                                  00030220
000303     05  PV-OTBND-TRIP-ID-MSG.                                    00030399
000304         10  FILLER                  PIC  X(13)    VALUE          00030499
000305         'OTBND TRIP = '.                                         00030599
000307         10  PV-OTBND-TRIP-ID        PIC  9(15).                  00030799
000313     05  PV-DONE-PROCESSING-SW       PIC  X(01)    VALUE 'N'.     00031320
000314         88  PV-DONE-PROCESSING                    VALUE 'Y'.     00031420
000316     05  PV-ABEND-PARAGRAPH          PIC  X(30)    VALUE SPACE.   00031620
000317     05  PV-PARAGRAPH-NAME           PIC  X(30)    VALUE SPACES.  00031720
000318     05  PV-DB2-OPERATION-ATTEMPTED  PIC  X(30)    VALUE SPACES.  00031820
000319                                                                  00031920
000320     05  PV-ABEND-CODE               PIC S9(04)    VALUE ZERO     00032020
000321                                                   COMP SYNC.     00032120
000322     05  PV-ABEND-PARA-NAME          PIC X(30)     VALUE SPACES.  00032220
000323     05  PV-DB2-OPERATION-MSG-1      PIC X(40)     VALUE SPACES.  00032320
000324     05  PV-DB2-OPERATION-MSG-2      PIC X(40)     VALUE SPACES.  00032420
000325     05  PV-DB2-OPERATION-MSG-3      PIC X(40)     VALUE SPACES.  00032599
000326     05  PV-DB2-TABLE-NAME           PIC X(17)     VALUE SPACES.  00032699
000327     05  PV-SQLCODE                  PIC Z(8)9-.                  00032799
000328     05  PV-RETRY-COUNTER            PIC S9(04)    VALUE ZERO     00032899
000329                                                   COMP SYNC.     00032999
000330                                                                  00033020
000331     05  PV-DAYS-TO-DELETE           PIC S9(04)    COMP.          00033129
000340     05  PV-DAYS-TO-DELETE-DSPLY     PIC  9(04).                  00034047
000345     05  PV-DISPLAY-COUNT            PIC ZZZ,ZZZ,ZZ9.             00034547
000346                                                                  00034647
000349     05  PV-RECORDS-READ             PIC S9(07)    COMP-3         00034991
000350                                                   VALUE ZEROS.   00035047
000351     05  PV-RECORDS-WRITTEN          PIC S9(07)    COMP-3         00035199
000352                                                   VALUE ZEROS.   00035247
000362 01  SD-SYSTEM-DATE.                                              00036247
000363     05  SD-SYSTEM-DATE-YY           PIC  9(02)      VALUE ZERO.  00036347
000364     05  SD-SYSTEM-DATE-MM           PIC  9(02)      VALUE ZERO.  00036447
000365     05  SD-SYSTEM-DATE-DD           PIC  9(02)      VALUE ZERO.  00036547
000366                                                                  00036647
000367 01  ST-SYSTEM-TIME.                                              00036747
000368     05  ST-SYSTEM-HOUR             PIC  9(02)      VALUE ZERO.   00036847
000369     05  ST-SYSTEM-MINUTE           PIC  9(02)      VALUE ZERO.   00036947
000370     05  FILLER                     PIC  9(04)      VALUE ZERO.   00037047
000371                                                                  00037147
000372******************************************************************00037247
000373*    ABEND PROCESSING COPYBOOK.                                   00037347
000374******************************************************************00037447
000375                                                                  00037547
000376     COPY DPWS013.                                                00037647
000377                                                                  00037747
000379******************************************************************00037947
000380*    INPUT RECORD LAYOUT.                                         00038099
000381******************************************************************00038147
000383     COPY SURD054.                                                00038399
000384                                                                  00038447
000385******************************************************************00038599
000386*    OUTPUT ARCHIVE RECORD                                        00038699
000387******************************************************************00038799
000388     COPY SURD081.                                                00038899
000389                                                                  00038999
000390*----------------------------------------------------------------*00039099
000391*  DCLGEN LAYOUT AND COBOL DECLARATION FOR SUT_TRIP_SUM          *00039199
000392*----------------------------------------------------------------*00039299
000393     EXEC SQL                                                     00039399
000394         INCLUDE SUT00007                                         00039499
000400     END-EXEC.                                                    00040099
000420                                                                  00042059
000421     EXEC SQL                                                     00042199
000422          DECLARE TRIP-SUMMARY-CSR CURSOR WITH HOLD               00042299
000423          FOR                                                     00042399
000430     SELECT TRIP_OCRNC_ID                                         00043099
000431          , OTBND_TRIP_ID                                         00043199
000432          , CRE_TMST                                              00043299
000433          , UNT_QTY                                               00043399
000434          , SKU_QTY                                               00043499
000435          , CART_QTY                                              00043599
000436          , RTL_DOL_AMT                                           00043699
000437          , COST_DOL_AMT                                          00043799
000438       FROM SUT_TRIP_SUM                                          00043899
000455      WHERE OTBND_TRIP_ID  =  :SU054-OTBND-TRIP-ID                00045599
000474     END-EXEC.                                                    00047499
000476                                                                  00047699
000477******************************************************************00047727
000478 PROCEDURE DIVISION.                                              00047827
000479******************************************************************00047927
000480*                                                                 00048027
000481******************************************************************00048127
000482* 0000-PROGRAM-MAINLINE - CONTROLS THE MAIN PROCESSING OF THE     00048227
000483*      PROGRAM.                                                   00048327
000484******************************************************************00048427
000485 0000-PROGRAM-MAINLINE.                                           00048527
000486*                                                                 00048627
000487     DISPLAY '* START OF SUKUT105 - SUT_TRIP_SUM EXTRACT *'.      00048799
000488     DISPLAY ' '.                                                 00048827
000489                                                                  00048927
000490      PERFORM 1000-INITIALIZE                                     00049027
000491      PERFORM 2000-MAIN-PROCESS                                   00049127
000492              UNTIL PS-EOF-PROCESS-YES                            00049299
000493      PERFORM 9000-END-PROCESS.                                   00049327
000494*                                                                 00049427
000495     STOP RUN.                                                    00049527
000496*                                                                 00049627
000497******************************************************************00049727
000498*  DO FIRST TIME PROGRAM INITIALIZATION TASKS.                    00049827
000499*    -- OPEN FILES                                                00049927
000500******************************************************************00050027
000501 1000-INITIALIZE.                                                 00050127
000502                                                                  00050227
000504     OPEN INPUT  EXTRACT-FILE                                     00050499
000505          OUTPUT ARCHIVE-FILE                                     00050599
000506                 PURGE-FILE.                                      00050699
000509                                                                  00050999
000510*READ FIRST INPUT RECORD.                                         00051099
000511     PERFORM 7000-READ-EXTRACT-FILE.                              00051199
000513*                                                                 00051399
000514 2000-MAIN-PROCESS.                                               00051499
000622     SET PS-END-OF-CURSOR-NO  TO TRUE                             00062299
000623     PERFORM 4000-OPEN-CURSOR                                     00062399
000624     PERFORM 4100-FETCH-CURSOR                                    00062499
000625     IF PS-END-OF-CURSOR-NO                                       00062599
000626         PERFORM 3000-WRITE-OUTPUT-RECS                           00062699
000627             UNTIL PS-END-OF-CURSOR-YES                           00062799
000632     END-IF.                                                      00063299
000633     PERFORM 4200-CLOSE-CURSOR.                                   00063399
000640                                                                  00064099
000650     PERFORM 7000-READ-EXTRACT-FILE.                              00065099
000651                                                                  00065199
000652 3000-WRITE-OUTPUT-RECS.                                          00065299
000653                                                                  00065399
000654     WRITE ARCHIVE-RECORD                                         00065499
000655         FROM SU081-TRIP-SUM.                                     00065599
000656     ADD  +1                      TO PV-RECORDS-WRITTEN.          00065699
000657     WRITE PURGE-RECORD                                           00065799
000658         FROM SU081-TRIP-SUM.                                     00065899
000659                                                                  00065999
000660     PERFORM 4100-FETCH-CURSOR.                                   00066099
000661                                                                  00066199
000670 4000-OPEN-CURSOR.                                                00067099
000691                                                                  00069199
000692     PERFORM WITH TEST AFTER                                      00069299
000693       VARYING PV-RETRY-COUNTER FROM 1 BY 1                       00069399
000694         UNTIL (PV-RETRY-COUNTER > PC-MAX-RETRIES                 00069499
000695                OR                                                00069599
000696                SQLCODE = +0)                                     00069699
000697                                                                  00069799
000698         EXEC SQL                                                 00069899
000699              OPEN TRIP-SUMMARY-CSR                               00069999
000700         END-EXEC                                                 00070099
000701                                                                  00070199
000702         EVALUATE TRUE                                            00070299
000703             WHEN SQLCODE = +0                                    00070399
000704             WHEN SQLCODE = -904                                  00070499
000705             WHEN SQLCODE = -911                                  00070599
000706                 CONTINUE                                         00070699
000707             WHEN SQLWARN0 NOT = SPACES                           00070799
000708             WHEN SQLCODE < +0                                    00070899
000709             WHEN SQLCODE > +0                                    00070999
000710                 MOVE '4000-OPEN-CURSOR          '                00071099
000711                                    TO PV-ABEND-PARA-NAME         00071199
000713                 MOVE SU054-OTBND-TRIP-ID                         00071399
000714                                    TO PV-OTBND-TRIP-ID           00071499
000715                 MOVE PV-OTBND-TRIP-ID-MSG                        00071599
000716                                    TO PV-DB2-OPERATION-MSG-1     00071699
000717                 MOVE 'SUT_TRIP_SUM     '                         00071799
000718                                    TO PV-DB2-TABLE-NAME          00071899
000719                 PERFORM 9998-SQL-ABEND                           00071999
000722         END-EVALUATE                                             00072299
000723     END-PERFORM.                                                 00072399
000724                                                                  00072499
000725     IF PV-RETRY-COUNTER > PC-MAX-RETRIES                         00072599
000726          MOVE '4000-OPEN-CURSOR          '                       00072699
000727                                    TO PV-ABEND-PARA-NAME         00072799
000729          MOVE SU054-OTBND-TRIP-ID  TO PV-OTBND-TRIP-ID           00072999
000730          MOVE PV-OTBND-TRIP-ID-MSG TO PV-DB2-OPERATION-MSG-1     00073099
000732          MOVE 'MAX RETRIES EXCEEDED'                             00073299
000733                                    TO PV-DB2-OPERATION-MSG-2     00073399
000734          MOVE 'SUT_TRIP_SUM     '  TO PV-DB2-TABLE-NAME          00073499
000735          PERFORM 9998-SQL-ABEND                                  00073599
000738     END-IF.                                                      00073899
000739                                                                  00073999
000740 4100-FETCH-CURSOR.                                               00074099
000743                                                                  00074399
000744     PERFORM WITH TEST AFTER                                      00074499
000745       VARYING PV-RETRY-COUNTER FROM 1 BY 1                       00074599
000746         UNTIL (PV-RETRY-COUNTER > PC-MAX-RETRIES                 00074699
000748                OR SQLCODE = +0                                   00074899
000749                OR PS-END-OF-CURSOR-YES)                          00074999
000750                                                                  00075099
000751         EXEC SQL                                                 00075199
000752            FETCH TRIP-SUMMARY-CSR                                00075299
000753             INTO :SU081-TRIP-OCRNC-ID                            00075399
000754                , :SU081-OTBND-TRIP-ID                            00075499
000755                , :SU081-CRE-TMST                                 00075599
000756                , :SU081-UNT-QTY                                  00075699
000757                , :SU081-SKU-QTY                                  00075799
000758                , :SU081-CART-QTY                                 00075899
000759                , :SU081-RTL-DOL-AMT                              00075999
000760                , :SU081-COST-DOL-AMT                             00076099
000765         END-EXEC                                                 00076599
000766         EVALUATE TRUE                                            00076699
000767             WHEN SQLCODE = +0                                    00076799
000768             WHEN SQLCODE = -904                                  00076899
000769             WHEN SQLCODE = -911                                  00076999
000770                 CONTINUE                                         00077099
000771             WHEN SQLCODE = +100                                  00077199
000772                 SET PS-END-OF-CURSOR-YES                         00077299
000773                                    TO TRUE                       00077399
000774             WHEN SQLWARN0 NOT = SPACES                           00077499
000775             WHEN SQLCODE < +0                                    00077599
000776             WHEN SQLCODE > +0                                    00077699
000777                 MOVE '4100-FETCH-CURSOR          '               00077799
000778                                    TO PV-ABEND-PARA-NAME         00077899
000779                 MOVE SU054-OTBND-TRIP-ID                         00077999
000780                                    TO PV-OTBND-TRIP-ID           00078099
000781                 MOVE PV-OTBND-TRIP-ID-MSG                        00078199
000782                                    TO PV-DB2-OPERATION-MSG-1     00078299
000783                 MOVE 'SUT_TRIP_SUM     '                         00078399
000784                                    TO PV-DB2-TABLE-NAME          00078499
000785                 PERFORM 9998-SQL-ABEND                           00078599
000786         END-EVALUATE                                             00078699
000787     END-PERFORM.                                                 00078799
000788                                                                  00078899
000789     IF PV-RETRY-COUNTER > PC-MAX-RETRIES                         00078999
000790          MOVE '4100-FETCH-CURSOR          '                      00079099
000791                                    TO PV-ABEND-PARA-NAME         00079199
000792          MOVE SU054-OTBND-TRIP-ID  TO PV-OTBND-TRIP-ID           00079299
000793          MOVE PV-OTBND-TRIP-ID-MSG TO PV-DB2-OPERATION-MSG-1     00079399
000795          MOVE 'MAX RETRIES EXCEEDED'                             00079599
000796                                    TO PV-DB2-OPERATION-MSG-2     00079699
000797          MOVE 'SUT_TRIP_SUM     '  TO PV-DB2-TABLE-NAME          00079799
000798          PERFORM 9998-SQL-ABEND                                  00079899
000799     END-IF.                                                      00079999
000800                                                                  00080099
000801 4200-CLOSE-CURSOR.                                               00080199
000802                                                                  00080299
000803     PERFORM WITH TEST AFTER                                      00080399
000804       VARYING PV-RETRY-COUNTER FROM 1 BY 1                       00080499
000805         UNTIL (PV-RETRY-COUNTER > PC-MAX-RETRIES                 00080599
000806                OR                                                00080699
000807                SQLCODE = +0)                                     00080799
000808                                                                  00080899
000809         EXEC SQL                                                 00080999
000810              CLOSE TRIP-SUMMARY-CSR                              00081099
000811         END-EXEC                                                 00081199
000812                                                                  00081299
000813         EVALUATE TRUE                                            00081399
000814             WHEN SQLCODE = +0                                    00081499
000815             WHEN SQLCODE = -904                                  00081599
000816             WHEN SQLCODE = -911                                  00081699
000817                 CONTINUE                                         00081799
000818             WHEN SQLWARN0 NOT = SPACES                           00081899
000819             WHEN SQLCODE < +0                                    00081999
000820             WHEN SQLCODE > +0                                    00082099
000821                 MOVE '4200-CLOSE-CURSOR          '               00082199
000822                                         TO PV-ABEND-PARA-NAME    00082299
000823                 MOVE SU054-OTBND-TRIP-ID                         00082399
000824                                         TO PV-OTBND-TRIP-ID      00082499
000825                 MOVE PV-OTBND-TRIP-ID-MSG                        00082599
000826                                         TO PV-DB2-OPERATION-MSG-100082699
000827                 MOVE 'SUT_TRIP_SUM     '                         00082799
000828                                         TO PV-DB2-TABLE-NAME     00082899
000829                 PERFORM 9998-SQL-ABEND                           00082999
000830         END-EVALUATE                                             00083099
000831     END-PERFORM.                                                 00083199
000832                                                                  00083299
000833     IF PV-RETRY-COUNTER > PC-MAX-RETRIES                         00083399
000834          MOVE '4200-CLOSE-CURSOR          '                      00083499
000840                                    TO PV-ABEND-PARA-NAME         00084099
000851          MOVE SU054-OTBND-TRIP-ID  TO PV-OTBND-TRIP-ID           00085199
000853          MOVE PV-OTBND-TRIP-ID-MSG TO PV-DB2-OPERATION-MSG-1     00085399
000870          MOVE 'MAX RETRIES EXCEEDED'                             00087099
000880                                    TO PV-DB2-OPERATION-MSG-2     00088099
000890          MOVE 'SUT_TRIP_SUM     '  TO PV-DB2-TABLE-NAME          00089099
000900          PERFORM 9998-SQL-ABEND                                  00090099
001000     END-IF.                                                      00100099
001100*                                                                 00110099
001200 7000-READ-EXTRACT-FILE.                                          00120099
001300******************************************************************00130099
001400     READ EXTRACT-FILE INTO SU054-EXTRACT-RECORD                  00140099
001500        AT END                                                    00150099
001600           SET PS-EOF-PROCESS-YES TO TRUE                         00160099
001700        NOT AT END                                                00170099
001800            ADD  +1               TO PV-RECORDS-READ              00180099
001900     END-READ.                                                    00190099
002000*                                                                 00200099
002100                                                                  00210099
002200******************************************************************00220099
002300*     CLOSE FILES.                                              **00230099
002400******************************************************************00240099
002500 9000-END-PROCESS.                                                00250099
002600*                                                                 00260099
002700     CLOSE ARCHIVE-FILE                                           00270099
002800           EXTRACT-FILE                                           00280099
002810           PURGE-FILE.                                            00281099
002900*                                                                 00290099
003000     PERFORM 9999-FINAL-DISPLAYS.                                 00300099
003100*                                                                 00310099
003200******************************************************************00320099
003300*     SQL ERROR PROCESSING                                      **00330099
003400******************************************************************00340099
003500 9998-SQL-ABEND.                                                  00350099
003600     PERFORM 9999-FINAL-DISPLAYS.                                 00360099
003700     MOVE SQLCODE     TO PV-SQLCODE.                              00370099
003800     DISPLAY '** ABEND           ** = SQLABEND'.                  00380099
003900     DISPLAY '** PROGRAM         ** = ' PC-PROGRAM-NAME.          00390099
004000     DISPLAY '** PARAGRAPH       ** = ' PV-ABEND-PARA-NAME        00400099
004100     DISPLAY '** TABLE AFFECTED  ** = ' PV-DB2-TABLE-NAME.        00410099
004200     DISPLAY '** OPERATIONAL MSG ** = ' PV-DB2-OPERATION-MSG-1.   00420099
004300     DISPLAY '** OPERATIONAL MSG ** = ' PV-DB2-OPERATION-MSG-2.   00430099
004400     DISPLAY '** OPERATIONAL MSG ** = ' PV-DB2-OPERATION-MSG-3.   00440099
004500     DISPLAY '** SQLCODE         ** = ' PV-SQLCODE.               00450099
004600     COPY DPPD004.                                                00460099
004700                                                                  00470099
004800     MOVE +4013                  TO PV-ABEND-CODE.                00480099
004900     CALL 'ILBOABN0'   USING PV-ABEND-CODE.                       00490099
005000*                                                                 00500099
005100 9999-FINAL-DISPLAYS.                                             00510099
005200     DISPLAY '**********************************'.                00520099
005300     DISPLAY '** SUKUT105 SUMMARY **'.                            00530099
005400     MOVE PV-RECORDS-READ       TO PV-DISPLAY-COUNT               00540099
005500     DISPLAY 'TOTAL INPUT RECORDS         = ' PV-DISPLAY-COUNT   .00550099
005600     MOVE PV-RECORDS-WRITTEN    TO PV-DISPLAY-COUNT               00560099
005700     DISPLAY 'TOTAL ARCHIVE RECORDS       = ' PV-DISPLAY-COUNT   .00570099
006000     DISPLAY '**********************************'.                00600099
