      ******************************************************************        
      * THIS COPYBOOK USED IN A WEBSERVICE UPDATETRAILERSTATUS                  
      * PLEASE CHECK IN CICS WEBSERVICE PLAYBOOK FOR STEPS TO FOLLOW            
      * FOR MAKING CHANGES TO THIS COPYBOOK LAYOUT                              
      ******************************************************************        
       01  SU119-OUT-TRLR-STAT-UPD.                                             
           05  SU119-RESP-MSG              PIC X(20)   VALUE SPACES.            
           05  SU119-MSG-ID                PIC X(06)   VALUE SPACES.            
           05  SU119-ERROR-TEXT            PIC X(80)   VALUE SPACES.            
