       01  SU124-GET-MANIFEST-DETAILS.                                          
           05  SU124-OUTBOUND-TRIP-ID     PIC  9(09) VALUE ZEROES.              
           05  SU124-LAST-CARTON-ID       PIC S9(18)V COMP-3.                   
           05  SU124-LAST-UPC-NBR         PIC S9(15)V COMP-3.                   
