000100******************************************************************00010000
000200**                        SURD005                               **00020000
000300**                                                              **00040000
000400**  THIS IS THE FILE LAYOUT FOR THE AUDIT CLOSE REPORT EXTRACT  **00040000
000500**  FILE.  IT WILL HAVE ONE RECORD PER RECEIVER/STORE FOR PACK  **      00
000500**  BY STORE AUDITS, OR ONE RECORD PER RECEIVER/SKU FOR CASE    **      00
      **  PACK AUDITS.                                                **        
      **                                                              **        
      **  THERE WILL BE TWO TYPES OF RECORDS, A PICKING ERROR RECORD  **        
      **  AND A TICKETING ERROR RECORD CONTAINING COUNTS FOR ALL THE  **        
      **  INDIVIDUAL EXCEPTIONS THAT MAKE UP THE TWO TYPES            **        
      **  CHG0068598 - ADDED A NEW ERROR TYPE OF RFID FOR REPORTING   **        
      **               RFID ERRORS.                                   **        
000600**  LENGTH: 200 BYTES                                           **00060000
000700******************************************************************00070000
000800 01  SU005-EXTRACT-RECORD.                                        00080000
000801*    LENGTH: 100 BYTES                                            00080100
000801     05  SU005-KEY-DATA.                                          00080100
000801         10  SU005-AUD-CNTL-NBR            PIC S9(09)  COMP.      00080100
000803         10  SU005-PO-NBR                  PIC S9(09)  COMP.              
000804         10  SU005-REC-SEQ-NBR             PIC S9(09)  COMP.              
000804         10  SU005-SKU-NBR.                                               
000805             15  SU005-SKU-DEPT-NBR        PIC  X(03).                  00
000806             15  SU005-SKU-CL-NBR          PIC  X(02).                  00
000804             15  SU005-SKU-NMBR            PIC  9(08).                    
000808         10  SU005-DEST-OPER-UNT-ID        PIC S9(04)  COMP.      00080200
000809         10  SU005-AUDIT-TYPE              PIC  X(01).                  00
000810             88  SU005-PBS-AUDIT           VALUE 'P'.                   00
000810             88  SU005-CASEPACK-AUDIT      VALUE 'C'.                   00
000804         10  SU005-UNITS-TRNSCRBD          PIC S9(09)  COMP.              
000804         10  SU005-UNITS-AUDITED           PIC S9(09)  COMP.              
000808         10  SU005-UPC-NBR                 PIC S9(15)V COMP-3.    00080200
000804         10  SU005-TOT-UNITS-IN-ERROR      PIC S9(09)  COMP.              
000801         10  FILLER                        PIC  X(52).            00080100
                                                                                
000801*    LENGTH: 100 BYTES                                            00080100
000801     05  SU005-DETAIL-RECORD.                                     00080100
000801         10  SU005-DETAIL-TYPE             PIC  X(01).            00080100
                   88  SU005-PICKING-ERRORS      VALUE 'P'.                     
                   88  SU005-TICKETING-ERRORS    VALUE 'T'.                     
                   88  SU005-RFID-ERRORS         VALUE 'Z'.                     
000801         10  FILLER                        PIC  X(99).            00080100
                                                                                
                                                                                
000801     05  SU005-PICKING-ERROR-RECORD                               00080100
              REDEFINES SU005-DETAIL-RECORD.                            00080100
000801         10  FILLER                        PIC  X(01).            00080100
000801         10  SU005-VENDOR-OVER             PIC S9(09)  COMP.      00080100
000801         10  SU005-VENDOR-SHORT            PIC S9(09)  COMP.      00080100
000801         10  SU005-RECEIVER-OVER           PIC S9(09)  COMP.      00080100
000801         10  SU005-RECEIVER-SHORT          PIC S9(09)  COMP.      00080100
000801         10  SU005-STYLE-SUB               PIC S9(09)  COMP.      00080100
000801         10  SU005-DAMAGED-UNITS           PIC S9(09)  COMP.      00080100
000804         10  SU005-TOT-PIC-ERR             PIC S9(09)  COMP.              
000804         10  SU005-TOT-UNITS-IN-PIC-ERR    PIC S9(09)  COMP.              
001250         10  FILLER                        PIC  X(67).                  00
                                                                                
                                                                                
000801     05  SU005-TICKETING-ERROR-RECORD                             00080100
              REDEFINES SU005-DETAIL-RECORD.                            00080100
000801         10  FILLER                        PIC  X(01).            00080100
000801         10  SU005-MISSING-TICKET          PIC S9(04)  COMP.      00080100
000801         10  SU005-WRONG-TICKET            PIC S9(04)  COMP.      00080100
000801         10  SU005-WRONG-LABEL             PIC S9(04)  COMP.      00080100
000801         10  SU005-NO-BARCODE              PIC S9(04)  COMP.      00080100
000801         10  SU005-DAMAGED-BARCODE         PIC S9(04)  COMP.      00080100
000801         10  SU005-WRONG-UPC               PIC S9(04)  COMP.      00080100
000801         10  SU005-NO-UPC                  PIC S9(04)  COMP.      00080100
000804         10  SU005-TOT-TIC-ERR             PIC S9(09)  COMP.              
000804         10  SU005-TOT-UNITS-IN-TIC-ERR    PIC S9(09)  COMP.              
901250         10  FILLER                        PIC  X(77).                  00
                                                                                
000801     05  SU005-RFID-ERROR-RECORD                                  00080100
              REDEFINES SU005-DETAIL-RECORD.                            00080100
000801         10  FILLER                        PIC  X(01).            00080100
000801         10  SU005-WRG-TKT-NO-EPC-LOGO     PIC S9(04)  COMP.      00080100
000801         10  SU005-WRG-RFID-TKT-CLR        PIC S9(04)  COMP.      00080100
000801         10  SU005-WRG-RFID-TKT-SIZE       PIC S9(04)  COMP.      00080100
000801         10  SU005-WRG-RFID-TKT-STYLE      PIC S9(04)  COMP.      00080100
000801         10  SU005-NO-RFID-TICKET          PIC S9(04)  COMP.      00080100
000804         10  SU005-TOT-RFID-ERR            PIC S9(09)  COMP.              
000804         10  SU005-TOT-UNITS-IN-RFID-ERR   PIC S9(09)  COMP.              
901250         10  FILLER                        PIC  X(81).                  00
