000010******************************************************************00001000
000020**                        SURD083                               **00002000
000030**                                                              **00003000
000040**  THIS IS THE LAYOUT FOR THE ARCHIVE FOR THE OUTBOUND TRIP    **00004000
000041**  STATUS DATABASE (TSUOBTS)                                   **00004100
000042**  LENGTH: 209  BYTES                                          **00004200
000043**                                                              **00004300
000044******************************************************************00004400
002200 01  SU083-TSUOBTS-RECORD.                                        00220000
002300     10 SU083-OTBND-TRIP-ID          PIC  S9(9) COMP.             00230000
002400     10 SU083-OTBND-STAT-TMST        PIC   X(26).                 00240000
002500     10 SU083-TRIP-STAT-CDE          PIC   X(2).                  00250000
002600     10 SU083-STAT-OPER-UNT-ID       PIC  S9(4) COMP.             00260000
002700     10 SU083-OTBND-STAT-USR-ID      PIC   X(8).                  00270000
002800     10 SU083-DOOR-ID                PIC   X(4).                  00280000
002900     10 SU083-TRLR-SEAL-ID           PIC   X(20).                 00290000
003000     10 SU083-SHIP-SCAC-CDE          PIC   X(4).                  00300000
003100     10 SU083-SHIP-DRV-LAST-NM       PIC   X(30).                 00310000
003200     10 SU083-SHIP-DRV-FRST-NM       PIC   X(30).                 00320000
003300     10 SU083-SHIP-DRV-ID            PIC   X(20).                 00330000
003400     10 SU083-TRLR-PRKG-LOC-DESC     PIC   X(20).                 00340000
003500     10 SU083-TRLR-PRKG-SLOT-NBR     PIC   X(6).                  00350000
003600     10 SU083-FINCL-POST-TMST        PIC   X(26).                 00360000
003700     10 SU083-CPCTY-PCT              PIC  S9(3)V COMP-3.          00370000
003800     10 SU083-UNUSD-PLLT-QTY         PIC  S9(4) COMP.             00380000
003900     10 SU083-LOD-BR-QTY             PIC  S9(4) COMP.             00390000
004000     10 SU083-RPT-GEND-IND           PIC   X(1).                  00400000
