000010******************************************************************00001000
000020**                        SURD082                               **00002000
000030**                                                              **00003000
000040**  THIS IS THE LAYOUT FOR THE ARCHIVE FOR THE OUTBOUND TRIP    **00004000
000041**  CONVEYOR CUTOFF DATABASE (TSUCDOT)                          **00004100
000042**  LENGTH: 130  BYTES                                          **00004200
000043**                                                              **00004300
000044******************************************************************00004400
002000 01  SU082-TSUCDOT-RECORD.                                        00200000
002100     10 SU082-OTBND-TRIP-ID          PIC  S9(9) COMP.             00210000
002200     10 SU082-OPER-UNT-ID            PIC  S9(4) COMP.             00220000
002300     10 SU082-DOOR-ID                PIC   X(4).                  00230000
002400     10 SU082-STRT-DIVERT-TMST       PIC   X(26).                 00240000
002500     10 SU082-END-DIVERT-TMST        PIC   X(26).                 00250000
002600     10 SU082-STRT-SCN-TMST          PIC   X(26).                 00260000
002700     10 SU082-STRT-SCN-USR-ID        PIC   X(8).                  00270000
002800     10 SU082-END-SCN-TMST           PIC   X(26).                 00280000
002900     10 SU082-END-SCN-USR-ID         PIC   X(8).                  00290000
