000001***************************************************************** 00000100
000002* UPLOAD ERROR RECORDS FROM CONVEYOR DIVERTS                      00000200
000003*    RECORD LENGTH:  250 BYTES                                    00000302
000005***************************************************************** 00000500
000006 01  SU172-CONV-UPLDER-RECORD.                                    00000600
000007     05  SU172-OPER-UNT-ID          PIC  9(04).                   00000700
000008     05  FILLER                     PIC  X(01).                   00000800
000009     05  SU172-UPLD-TRN-CDE         PIC  X(1).                    00000900
000010     05  FILLER                     PIC  X(01).                   00001000
000011     05  SU172-ERR-CDE              PIC  X(3).                    00001100
000012     05  FILLER                     PIC  X(01).                   00001200
000013     05  SU172-ERROR-REASON         PIC  X(21).                   00001304
000014     05  FILLER                     PIC  X(01).                   00001400
000015     05  SU172-PRC-TMST             PIC  X(26).                   00001500
000016     05  FILLER                     PIC  X(01).                   00001600
000017     05  SU172-DC-NBR               PIC  X(04).                   00001703
000018     05  FILLER                     PIC  X(01).                   00001800
000019     05  SU172-STR-NBR              PIC  X(04).                   00001904
000020     05  FILLER                     PIC  X(01).                   00002004
000021     05  SU172-BARCODE              PIC  X(22).                   00002100
000022     05  FILLER                     PIC  X(01).                   00002200
000023     05  SU172-DIVERT-NUMBER        PIC  X(04).                   00002303
000024     05  FILLER                     PIC  X(01).                   00002400
000025     05  SU172-DOOR-NUMBER          PIC  X(04).                   00002503
000026     05  FILLER                     PIC  X(01).                   00002600
000027     05  SU172-DIVERT-DATE          PIC  X(08).                   00002703
000028     05  FILLER                     PIC  X(01).                   00002800
000029     05  SU172-DIVERT-TIME          PIC  X(06).                   00002903
000030     05  FILLER                     PIC  X(01).                   00003000
000031     05  SU172-SURD014-PKT-TXT      PIC  X(100).                  00003101
000040     05  FILLER                     PIC  X(31).                   00004004
