000010******************************************************************00001000
000100* SURD030 - RECORD LENGTH 150                                    *00010000
000200******************************************************************00020000
000210*  RECORD LAYOUT FOR EXTRACT FILE USED TO CREATE                 *00021000
000211*  UCC128 - QUALITY SPOT CHECK STATISTICS REPORT                 *00021100
000212******************************************************************00021200
000213* RECORDS ARE TO BE SORTED IN THE FOLLOWING ORDER                *00021300
000214* - DATE                                                         *00021400
000215* - OPER UNIT ID                                                 *00021500
000220* - PACKAGING TYPE (BULK/CASEPACK, PREPACK, PBS)                 *00022000
000230* - VENDOR RANK                                                  *00023000
000240* - RECORD TYPE                                                  *00024000
000250******************************************************************00025000
000300* RECORD TYPE - A = AUDITS PROMPTED & COMPLETED FOR THE WEEK     *00030001
000320*               C = CARTONS/UNITS CHECKED IN FOR THE WEEK        *00032000
000330******************************************************************00033000
000340 01  SU030-RECORD.                                                00034001
000350     05  SU030-RECORD-TYPE               PIC  X(01)  VALUE SPACE. 00035000
000360         88  SU030-AUDIT-RECORD                      VALUE 'A'.   00036001
000380         88  SU030-CARTON-RECORD                     VALUE 'C'.   00038001
000381     05  SU030-WEEK-END-DATE             PIC X(10).               00038100
000382     05  SU030-WEEK-END-DATE-R REDEFINES SU030-WEEK-END-DATE.     00038200
000383         10  SU030-DATE-CCYY             PIC 9(04).               00038300
000384         10  FILLER                      PIC X(01).               00038400
000385         10  SU030-DATE-MM               PIC 9(02).               00038500
000386         10  FILLER                      PIC X(01).               00038600
000387         10  SU030-DATE-DD               PIC 9(02).               00038700
000390     05  SU030-FISCAL-YEAR               PIC 9(04).               00039001
000391     05  SU030-FISCAL-WEEK               PIC 9(02).               00039101
000392     05  SU030-FISCAL-SEASON             PIC X(06).               00039201
000393     05  SU030-FISCAL-MONTH              PIC 9(02).               00039301
000394     05  SU030-OPER-UNT-ID               PIC S9(04) COMP.         00039401
000395     05  SU030-PKGNG-TYPE                PIC X(02).               00039501
000396         88  SU030-BULK-CASE                         VALUE 'BC'.  00039601
000397         88  SU030-PREPACK                           VALUE 'PP'.  00039701
000398         88  SU030-PBS                               VALUE 'PS'.  00039801
000398         88  SU030-RF                                VALUE 'RF'.  00039903
000399     05  SU030-VENDOR-RANK               PIC X(06).               00040003
000400     05  SU030-RECORD-LAYOUT             PIC X(115)  VALUE SPACE. 00041003
000500                                                                  00050000
000510*                                                                 00051000
000520*** AUDIT SUMMARY RECORD                                          00052001
000530*                                                                 00053000
000600     05  SU030-PROMPT-EXTRACT-REC REDEFINES SU030-RECORD-LAYOUT.  00060000
000700         10  SU030-AUD-CNT-PRMT-CMPL-WEEK    PIC S9(09) COMP.     00070002
000701         10  SU030-AUD-CNT-PRMT-CMPL-MULT    PIC S9(09) COMP.     00070102
000710         10  SU030-AUD-CNT-COMPLT            PIC S9(09) COMP.     00071002
000720         10  SU030-AUD-CNT-PROMPT            PIC S9(09) COMP.     00072002
000730         10  SU030-AUD-CNT-COMPLT-PASS       PIC S9(09) COMP.     00073002
000740         10  SU030-AUD-CNT-COMPLT-FAIL       PIC S9(09) COMP.     00074002
000750         10  SU030-AUD-CNT-COMPLT-REOPEN     PIC S9(09) COMP.     00075002
000760         10  SU030-AUD-CRTN-QTY-COMPLT       PIC S9(09) COMP.     00076002
000900         10  SU030-AUD-UNIT-QTY-COMPLT       PIC S9(09) COMP.     00090002
000910         10  SU030-UNIT-QTY-PROMPT           PIC S9(09) COMP.     00091002
001000         10  SU030-UNIT-QTY-PRMT-CMPL-WEEK   PIC S9(09) COMP.     00100002
001001         10  SU030-UNIT-QTY-PRMT-CMPL-MULT   PIC S9(09) COMP.     00100102
001010         10  SU030-UNIT-QTY-PRMT-NOND-WEEK   PIC S9(09) COMP.     00101002
001011         10  SU030-UNIT-QTY-PRMT-NOND-MULT   PIC S9(09) COMP.     00101102
001020         10  SU030-UNIT-QTY-PRMT-INPR-WEEK   PIC S9(09) COMP.     00102002
001021         10  SU030-UNIT-QTY-PRMT-INPR-MULT   PIC S9(09) COMP.     00102102
001030         10  SU030-TOTAL-MINUTES             PIC S9(14) COMP.     00103002
002200         10  FILLER                          PIC X(39).           00220002
002210         10  SU030-AUD-CNTL-NBR              PIC S9(09) COMP.     00221001
002300*                                                                 00230001
002400*** CARTON SUMMARY RECORD                                         00240001
002500*                                                                 00250001
002600     05  SU030-CARTON-EXTRACT-REC REDEFINES SU030-RECORD-LAYOUT.  00260001
002700         10  SU030-CRTN-PO-CNT               PIC S9(06) COMP.     00270001
002800         10  SU030-CRTN-CRTN-QTY             PIC S9(06) COMP.     00280001
002900         10  SU030-CRTN-UNIT-QTY             PIC S9(06) COMP.     00290001
004000         10  FILLER                          PIC X(103).          00400001
