000100******************************************************************00010000
000200**                        SURD163                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT FOR THE TRIPS THAT ARE IN A      **00040014
000500**  DS, SO, SU, DC STATUS - FOR LOGISTICS' NIGHTLY              **00050013
000510**  CARTONS AND CONTENTS                                        **00060002
000600**  LENGTH:  250 BYTES                                          **00070009
000600**  09/24/2018 CHG0209983  ADDED DC STATUS TO COPYBOOK          **00071020
000700******************************************************************00080020
000800 05  SU163-EXTRACT-RECORD.                                        00090000
000801*  TRIP INFORMATION                                               00100000
000810     10  SU163-ORGN-OPER-UNT-ID        PIC  S9(09)  COMP.         00110007
000820     10  SU163-DEST-OPER-UNT-ID        PIC  S9(09)  COMP.         00120007
000830     10  SU163-OTBND-TRIP-ID           PIC  S9(09)  COMP.         00130000
000831     10  SU163-TRIP-STAT-CDE           PIC   X(02).               00140000
209983         88  SU163-DC-CLOSED                 VALUE 'DC'.          00150020
000832         88  SU163-DC-SHIPPED                VALUE 'DS'.          00151012
000834         88  SU163-STORE-UNLOADED            VALUE 'SU'.          00160000
000835     10  SU163-E-BUS                   PIC   X.                   00170004
000836         88  SU163-BRICK-AND-MORTAR          VALUE  'N'.          00180006
000837         88  SU163-EFC-STORE                 VALUE  'Y'.          00190004
000900     10  SU163-SCAC-CDE                PIC   X(04).               00200008
001000     10  SU163-TRLR-ID                 PIC   X(12).               00210008
001001     10  SU163-TRLR-SRL-NBR            PIC  S9(09)  COMP.         00220008
001025     10  SU163-TRIP-STAT-DATE          PIC   X(10).               00230008
001026     10  SU163-TRIP-STAT-TIME          PIC   X(08).               00240008
000838     10  SU163-WM-SHIPMT-ID            PIC   X(20).               00250004
000840*  SML INFORMATION                                                00260000
000850     10  SU163-SHIPT-UNIT-ID           PIC  S9(18)V COMP-3.       00270007
000860     10  SU163-SML-ORGN-LOC-NBR        PIC  S9(04)  COMP.         00280000
000870     10  SU163-SML-DEST-LOC-NBR        PIC  S9(04)  COMP.         00290000
001000     10  SU163-CART-SRC-CDE            PIC   X(03).               00300010
001018     10  SU163-SML-CRE-DTE             PIC   X(10).               00310003
001019     10  SU163-SML-CRE-TM              PIC   X(08).               00320003
001030     10  SU163-ORIG-CART-ID            PIC  S9(18)V COMP-3.       00330000
001040     10  SU163-ACTV-IND                PIC   X(01).               00340000
001071* DC SHIPPED AND DC CLOSED STATUS                                 00350016
001072     10  SU163-MFST-TO-TRLR-TYPE       PIC   X(01).               00360000
001073         88  SU163-DIVERT-TO-TRLR                   VALUE 'D'.    00370000
001074         88  SU163-SCAN-ONTO-TRLR                   VALUE 'S'.    00380000
001075     10  SU163-MFST-DATE               PIC   X(10).               00390003
001076     10  SU163-MFST-TIME               PIC   X(08).               00400003
001077* STORE UNLOADED STATUS                                           00410016
001078     10  SU163-STR-SCAN-DATE           PIC   X(10).               00420004
001079     10  SU163-STR-SCAN-TIME           PIC   X(08).               00430004
001080     10  SU163-STR-SCAN-LOC            PIC  S9(04)  COMP.         00440004
001081     10  SU163-STR-SCAN-TYPE-CDE       PIC   X(04).               00450004
001084         88  SU163-EXPTD-CRTN-SCAN                  VALUE 'SSEC'. 00460003
001085         88  SU163-STORE-MISLOAD-SCAN               VALUE 'SSSM'. 00470003
001086         88  SU163-CRTN-NOT-MFST                    VALUE 'SSNM'. 00480003
001087         88  SU163-TRLR-MISLOAD-SCAN                VALUE 'SSTM'. 00490003
001088         88  SU163-ASSUMPTV-RCPT                    VALUE 'SSAR'. 00500003
001089         88  SU163-ASSUMPTV-MISLOAD                 VALUE 'SSAM'. 00510003
001092     10  SU163-STR-SCAN-ORIG-TRIP-ID   PIC  S9(09)  COMP.         00520003
001093     10  SU163-STR-SCAN-FR-MSTR-IND    PIC   X(01).               00530003
001094*  CARTON CONTENTS                                                00540003
001095     10  SU163-TRN-NBR                 PIC  S9(09)  COMP.         00550003
001096     10  SU163-RCVR-SEQ-NBR            PIC  S9(09)  COMP.         00560003
001097     10  SU163-TRN-LNE-NBR             PIC  S9(09)  COMP.         00570003
001098     10  SU163-TRN-TYP-CDE             PIC   X(02).               00580003
001099         88  SU163-TRN-TYP-PO                       VALUE 'PO'.   00590011
001100         88  SU163-TRN-TYP-FST-TRNSFR               VALUE 'FX'.   00600011
001101         88  SU163-TRN-TYP-CNTRL-STCK               VALUE 'CS'.   00610011
001103     10  SU163-SHPD-UNT-QTY            PIC  S9(09)V COMP-3.       00620003
001104     10  SU163-SKU-NBR                 PIC  S9(08)V COMP-3.       00630003
001110*                                                                 00640001
001111     10  SU163-SEASET-YR               PIC   X(04).               00650011
001112     10  SU163-SEASET-SHRT-NM          PIC   X(05).               00660011
001120*                                                                 00670004
001200     10  FILLER                        PIC   X(50).               00680009
