000100******************************************************************00010000
000200**                        SURD117                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT TO BE USED TO DETERMINE SUPPLY CHAIN    **00040000
000500**  DURATIONS FOR MERCHANDISE ON SHIPPED TRAILERS.  THIS WILL   **00050000
000600**  ALLOW US TO TRACK MERCHANDISE FROM ARRIVAL AT THE DC TO     **00060000
000700**  BEING SHIPPED TO THE STORES AND BE ABLE TO PAINT A PICTURE  **00070000
000800**  OF HOW LONG IT IS TAKING US TO GET THE MERCHANDISE          **00080000
000900**  PROCESSED THRU THE DC.                                      **00090000
001000**  THIS DATA WILL BE AT THE CONTENT LEVEL OF CARTONS FOUND ON  **00100000
001100**  A SHIPPED TRAILER.                                          **00110000
001200**  LENGTH:  550 BYTES                                          **00120002
001300******************************************************************00130000
001400 05  SU117-EXTRACT-RECORD.                                        00140000
001410*                                                                 00141006
001420*** THIS SECTION IS POPULATED BY SUKUT176                         00142006
001430*                                                                 00143006
001500     10  SU117-OPER-UNT-ID             PIC  S9(04) COMP.          00150000
001600     10  SU117-STORE-DEST              PIC  S9(04) COMP.          00160000
001700     10  SU117-TRIP-ID                 PIC  S9(09) COMP.          00170000
001800*                                                                 00180000
001900     10  SU117-TRIP-OPEN-TMST          PIC   X(26).               00190004
002100     10  SU117-TRIP-CLOSE-TMST         PIC   X(26).               00210004
002300     10  SU117-TRIP-SHIP-TMST          PIC   X(26).               00230004
002500*                                                                 00250000
002600     10  SU117-TRIP-OPEN-TO-CLOSE-MIN  PIC  S9(09) COMP.          00260000
002700     10  SU117-TRIP-CLOSE-TO-SHIP-MIN  PIC  S9(09) COMP.          00270000
002800     10  SU117-TRIP-OPEN-TO-SHIP-MIN   PIC  S9(09) COMP.          00280000
002910*                                                                 00291006
002920*** THIS SECTION IS POPULATED BY SUKUT177                         00292006
002930*                                                                 00293006
003000     10  SU117-SML-NBR                 PIC  S9(18) COMP-3.        00300000
003100     10  SU117-SML-SRC-CDE             PIC   X(03).               00310000
003200     10  SU117-SML-CRE-DTE             PIC   X(10).               00320000
003300     10  SU117-SML-CRE-TM              PIC   X(08).               00330000
003400     10  SU117-SML-P2L-OPEN-DTE        PIC   X(10).               00340000
003500     10  SU117-SML-P2L-OPEN-TM         PIC   X(08).               00350000
003600     10  SU117-SML-P2L-CLOSE-DTE       PIC   X(10).               00360000
003700     10  SU117-SML-P2L-CLOSE-TM        PIC   X(08).               00370000
003800     10  SU117-SML-ON-OTBND-DTE        PIC   X(10).               00380000
003900     10  SU117-SML-ON-OTBND-TM         PIC   X(08).               00390000
004000     10  SU117-SML-ON-OTBND-CDE        PIC   X(01).               00400000
004100         88  SU117-SML-ON-OTBND-DVRT               VALUE 'D'.     00410000
004200         88  SU117-SML-ON-OTBND-SCAN               VALUE 'S'.     00420000
004300*                                                                 00430000
004310* WAS THE SML (SU117-SML-NBR ) PART OF A MASTER                   00431003
004320*                                                                 00432003
004400     10  SU117-MSTR-SML-NBR            PIC  S9(18) COMP-3.        00440000
004500     10  SU117-MSTR-CRE-DTE            PIC   X(10).               00450000
004600     10  SU117-MSTR-CRE-TM             PIC   X(08).               00460000
004700     10  SU117-SML-IN-MSTR-DTE         PIC   X(10).               00470000
004800     10  SU117-SML-IN-MSTR-TM          PIC   X(08).               00480000
004810     10  SU117-FIRST-SML-IN-MSTR-DTE   PIC   X(10).               00481000
004820     10  SU117-FIRST-SML-IN-MSTR-TM    PIC   X(08).               00482000
004830     10  SU117-LAST-SML-IN-MSTR-DTE    PIC   X(10).               00483000
004840     10  SU117-LAST-SML-IN-MSTR-TM     PIC   X(08).               00484000
004850*                                                                 00485006
004860*** THIS SECTION IS POPULATED BY SUKUT178                         00486006
004870*                                                                 00487006
004900*   OUTBOUND UPC                                                  00490003
005000     10  SU117-TRN-NBR                 PIC  S9(09) COMP.          00500000
005100     10  SU117-REC-SEQ-NBR             PIC  S9(09) COMP.          00510000
005200     10  SU117-TRN-LNE-NBR             PIC  S9(09) COMP.          00520000
005300     10  SU117-SML-UNT-QTY             PIC  S9(09) COMP.          00530000
005310* TRECEIV REC_TMST                                                00531003
005400     10  SU117-REC-SEQ-ARRIVE-DTE      PIC   X(10).               00540000
005500     10  SU117-REC-SEQ-ARRIVE-TM       PIC   X(08).               00550000
005510*                                                                 00551003
005511*** THIS SECTION IS POPULATED BY SUKUT177                         00551106
005512*                                                                 00551206
005520* SRC ASN - WHEN CHECKED IN                                       00552003
005530* SRC P2L/JWL - WHEN WAS THE EARLIEST CHECKED IN THAT             00553003
005531*               WENT TO P2L                                       00553103
005532* ALL OTHER CARTON SOURCE THESE WILL BE THE CREATE DATE/TIME      00553205
005533* FROM SUT_OTBND_CART                                             00553305
005540*                                                                 00554003
005600     10  SU117-SRC-CART-PRC-DTE        PIC   X(10).               00560000
005700     10  SU117-SRC-CART-PRC-TM         PIC   X(08).               00570000
005701*                                                                 00570106
005702*** THIS SECTION IS POPULATED BY SUKUT178                         00570206
005703*                                                                 00570306
005710* OTBND_PKD_UPC                                                   00571003
005800     10  SU117-PKD-IN-P2L-SML-DTE      PIC   X(10).               00580000
005900     10  SU117-PKD-IN-P2L-SML-TM       PIC   X(08).               00590000
006100*                                                                 00610006
006110*** THIS SECTION IS CALCULATED IN SUKUT179                        00611006
006120*                                                                 00612006
006200     10  SU117-ARRIVE-TO-PRC-MIN       PIC  S9(09) COMP.          00620000
006300     10  SU117-ARRIVE-TO-P2L-PKD-MIN   PIC  S9(09) COMP.          00630000
006400     10  SU117-PRC-TO-P2L-PKD-MIN      PIC  S9(09) COMP.          00640000
006500     10  SU117-P2L-PKD-TO-CLOSE-MIN    PIC  S9(09) COMP.          00650000
006600     10  SU117-P2L-OPEN-TO-CLOSE-MIN   PIC  S9(09) COMP.          00660000
006700     10  SU117-P2L-OPEN-TO-OTBND-MIN   PIC  S9(09) COMP.          00670009
006710     10  SU117-P2L-CLOSE-TO-OTBND-MIN  PIC  S9(09) COMP.          00671009
006800     10  SU117-ARRIVE-TO-OTBND-MIN     PIC  S9(09) COMP.          00680000
006900     10  SU117-PRC-TO-OTBND-MIN        PIC  S9(09) COMP.          00690000
007000     10  SU117-ARRIVE-TO-TCLOS-MIN     PIC  S9(09) COMP.          00700000
007100     10  SU117-ARRIVE-TO-SHIP-MIN      PIC  S9(09) COMP.          00710000
007200     10  SU117-P2L-OPEN-TO-TCLOS-MIN   PIC  S9(09) COMP.          00720000
007300     10  SU117-P2L-OPEN-TO-SHIP-MIN    PIC  S9(09) COMP.          00730000
007310     10  SU117-P2L-CLOSE-TO-TCLOS-MIN  PIC  S9(09) COMP.          00731000
007320     10  SU117-P2L-CLOSE-TO-SHIP-MIN   PIC  S9(09) COMP.          00732000
007400     10  SU117-ARRIVE-TO-MSTR-MIN      PIC  S9(09) COMP.          00740000
007500     10  SU117-PRC-TO-MSTR-MIN         PIC  S9(09) COMP.          00750000
007600     10  SU117-MSTR-CRE-TO-OTBND-MIN   PIC  S9(09) COMP.          00760000
007610     10  SU117-MSTR-CRE-TO-TCLOS-MIN   PIC  S9(09) COMP.          00761000
007620     10  SU117-MSTR-CRE-TO-SHIP-MIN    PIC  S9(09) COMP.          00762000
007630     10  SU117-MSTR-FIRST-TO-OTBND-MIN PIC  S9(09) COMP.          00763000
007631     10  SU117-MSTR-FIRST-TO-TCLOS-MIN PIC  S9(09) COMP.          00763100
007632     10  SU117-MSTR-FIRST-TO-SHIP-MIN  PIC  S9(09) COMP.          00763200
007640     10  SU117-MSTR-LAST-TO-OTBND-MIN  PIC  S9(09) COMP.          00764000
007650     10  SU117-MSTR-LAST-TO-TCLOS-MIN  PIC  S9(09) COMP.          00765000
007660     10  SU117-MSTR-LAST-TO-SHIP-MIN   PIC  S9(09) COMP.          00766000
007670     10  SU117-ON-OTBND-TO-CLOS-MIN    PIC  S9(09) COMP.          00767007
007680     10  SU117-ON-OTBND-TO-SHIP-MIN    PIC  S9(09) COMP.          00768007
007700                                                                  00770000
007800*                                                                 00780000
007900     10  FILLER                        PIC   X(102).              00790009
