000010******************************************************************00001000
000020**                        SURD084                               **00002000
000030**                                                              **00003000
000040**  THIS IS THE LAYOUT FOR THE ARCHIVE FOR THE OUTBOUND TRIP    **00004000
000041**  DATABASE (TSUOBTR)                                          **00004100
000042**  LENGTH:  71  BYTES                                          **00004200
000043**                                                              **00004300
000044******************************************************************00004400
001100******************************************************************00110000
001200 01  SU084-TSUOBTR-RECORD.                                        00120000
001300     10 SU084-OTBND-TRIP-ID          PIC  S9(9) COMP.             00130000
001400     10 SU084-ORGN-OPER-UNT-ID       PIC  S9(4) COMP.             00140000
001500     10 SU084-DEST-OPER-UNT-ID       PIC  S9(4) COMP.             00150000
001600     10 SU084-TRLR-SRL-NBR           PIC  S9(9) COMP.             00160000
001700     10 SU084-BOL-ID                 PIC   X(30).                 00170000
001800     10 SU084-EST-ARRVL-TMST         PIC   X(26).                 00180000
001900     10 SU084-TRIP-ACTV-CDE          PIC   X(1).                  00190000
002000     10 SU084-DOOR-TYP-CDE           PIC   X(2).                  00200000
