      ******************************************************************        
      * THIS COPYBOOK USED IN A WEBSERVICE SHIPOUTBOUNDTRAILER                  
      * PLEASE CHECK IN CICS WEBSERVICE PLAYBOOK FOR STEPS TO FOLLOW            
      * FOR MAKING CHANGES TO THIS COPYBOOK LAYOUT                              
      ******************************************************************        
       01  SU161-OUT-SHIP-OUTB-TLR.                                             
           05  SU161-TRLR-SEAL-ID          PIC X(20)   VALUE SPACES.            
           05  SU161-MSG-ID                PIC X(06)   VALUE SPACES.            
           05  SU161-MSG-TEXT              PIC X(80)   VALUE SPACES.            
