000100**                        SUWS027                                         
000200**                                                                        
000300**  CARTON AUDIT EXTRACT                                                  
000400**  LENGTH:  100 BYTES                                                    
000500                                                                          
000600 01  SU027-CARTON-EXTRACT-RECORD.                                         
000700     05  SU027-OPER-UNT-ID            PIC S9(04) COMP.                    
000800     05  SU027-SHIPT-UNT-ID           PIC S9(18) COMP-3.                  
000900     05  SU027-PO-NBR                 PIC S9(09) COMP.                    
001000     05  SU027-REC-SEQ-NBR            PIC S9(09) COMP.                    
001100     05  SU027-PO-LNE-NBR             PIC S9(09) COMP.                    
001200     05  SU027-SHPD-QTY               PIC S9(09) COMP-3.                  
001300     05  SU027-PO-RCVR-CTN-CNT        PIC S9(07) COMP-3.                  
001400     05  SU027-CRE-DATE               PIC X(10).                          
001500     05  SU027-CRE-TIME               PIC X(08).                          
001600     05  FILLER                       PIC X(049).                         
