000100*                         SURD069                                         
000200*                                                                         
000300*   BUSINESS AREA EXTRACT FILE FOR WORKLOAD PLANNER PROCESS               
000500*                                                                         
000600**  LENGTH:  100               USED IN JOB SUKXXX                         
000700                                                                          
000800 01  SU069-EXTRACT-RECORD.                                                
001005     05  SU069-OTBND-TRIP-ID           PIC S9(09) COMP.                   
001008     05  SU069-TRIP-STAT-CDE           PIC X(02).                         
001008     05  SU069-OTBND-STAT-TMST         PIC X(26).                         
001009     05  SU069-OTBND-TRIP-SRL-NBR      PIC S9(9)  COMP.                   
000910     05  SU069-LOC-NBR                 PIC S9(04) COMP.                   
000911     05  SU069-BUS-AREA-ID             PIC S9(2)V COMP-3.                 
000912     05  SU069-UNT-QTY                 PIC S9(9)  COMP.                   
000913     05  SU069-SKU-QTY                 PIC S9(4)  COMP.                   
000914     05  SU069-CART-QTY                PIC S9(4)  COMP.                   
000914     05  SU069-TRIP-OCRNC-ID           PIC S9(9)  COMP.                   
001600     05  FILLER                        PIC X(48).                         
