000010******************************************************************00001000
000020* SURD035 - RECORD LENGTH 150                                    *00002000
000030******************************************************************00003000
000040*  RECORD LAYOUT FOR OPER UNIT TOTALS USED TO CREATE             *00004000
000050*  CORPORATE SUMMARY QC SPOT CHECK STATISTICS REPORT             *00005000
000060******************************************************************00006000
000070* RECORDS ARE TO BE SORTED IN THE FOLLOWING ORDER                *00007000
000080* - PACKAGING TYPE (BULK/CASEPACK, PREPACK, PBS)                 *00008000
000090* - VENDOR RANKING                                               *00009000
000220******************************************************************00022000
000260 01  SU035-RECORD.                                                00026000
000262     05  SU035-PKGNG-TYPE                PIC X(02).               00026200
000263     05  SU035-VENDOR-RANKING            PIC X(06).               00026300
000264     05  SU035-TOT-PROMPT-AUDITS         PIC 9(09) COMP.          00026402
000266     05  SU035-TOT-COMPLT-AUDITS         PIC 9(09) COMP.          00026602
000267     05  SU035-COMPLETE-AUDITS           PIC 9(09) COMP.          00026702
000268     05  SU035-AUD-PASSED-QTY            PIC 9(09) COMP.          00026802
000269     05  SU035-AUD-FAILED-QTY            PIC 9(09) COMP.          00026902
000270     05  SU035-AUD-REOPEN-QTY            PIC 9(09) COMP.          00027002
000271     05  SU035-CTNS-AUDITED-QTY          PIC 9(09) COMP.          00027102
000273     05  SU035-UNIT-AUDITED-QTY          PIC 9(09) COMP.          00027302
000275     05  SU035-UNIT-PROMPT-QTY           PIC 9(09) COMP.          00027502
000276     05  SU035-UNIT-COMPLETE-QTY         PIC 9(09) COMP.          00027602
000277     05  SU035-UNIT-NOT-NEEDED-QTY       PIC 9(09) COMP.          00027702
000278     05  SU035-UNIT-IN-PROCESS-QTY       PIC 9(09) COMP.          00027802
000280     05  SU035-AUD-CRTN-QTY-COMPLT       PIC 9(09) COMP.          00028002
000282     05  SU035-AUD-CNT-PROMPT            PIC 9(09) COMP.          00028203
000283     05  SU035-TOTAL-MINUTES             PIC 9(14).               00028301
000284     05  SU035-CRTN-CRTN-QTY             PIC 9(09) COMP.          00028402
000285     05  SU035-CRTN-UNIT-QTY             PIC 9(09) COMP.          00028502
000290     05  FILLER                          PIC X(64).               00029003
