000100******************************************************************00010000
000200**                        SURD001                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT FOR THE SHIPING UNIT REPORTS     **00040000
000500**  LENGTH:  200 BYTES                                          **00050000
000600**                                                              **00060007
000700**  WHEN MAKING CHANGES TO THIS RECORD LAYOUT, MAKE SURE YOU    **00070007
000800**  UPDATE SUKUT038 WITH THE CHANGE AS WELL.                    **00080007
000900******************************************************************00090000
001000 01  SU001-EXTRACT-RECORD.                                        00100000
001100     05  SU001-MANIFEST-NBR             PIC S9(09) COMP.          00110000
001200     05  SU001-SHIPT-UNT-ID             PIC S9(18) COMP-3.        00120000
001300     05  SU001-PO-NUMBER                PIC S9(09) COMP.          00130000
001400     05  SU001-REC-SEQ-NBR              PIC S9(09) COMP.          00140000
001500     05  SU001-SCANNED-IND              PIC  X(01).               00150000
001600     05  SU001-MISDIRECT-IND            PIC  X(01).               00160004
001700     05  SU001-NOT-FOUND-IND            PIC  X(01).               00170000
001800     05  SU001-FREE-ASTRAY-IND          PIC  X(01).               00180000
001900     05  SU001-ANOTHER-TRAILER-IND      PIC  X(01).               00190000
002000     05  SU001-RECORD-TYPE-IND          PIC  X(01).               00200000
002100         88  SU001-ERROR-RECORD                    VALUE 'A'.     00210000
002200         88  SU001-DETAIL-RECORD                   VALUE 'B'.     00220000
002300     05  SU001-STR-NBR                  PIC  S9(4) COMP.          00230001
002400     05  SU001-TSULBXF-USED             PIC  X(01).               00240002
002500         88  SU001-TABLE-USED                      VALUE 'Y'.     00250002
002600         88  SU001-TABLE-NOT-USED                  VALUE 'N'.     00260002
002700     05  SU001-BRCDE-NBR                PIC  X(22).               00270003
002800     05  SU001-AUTO-VE-IND              PIC X(01).                00280006
002900         88  SU001-AUTO-VE-YES                     VALUE 'Y'.     00290006
003000         88  SU001-AUTO-VE-NO                      VALUE 'N'.     00300006
003100     05  FILLER                         PIC X(146).               00310005
