000100******************************************************************00010000
000200**                        SURD008                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE FILE LAYOUT TO BE USED FOR EXTRACT INFORMATION  **00040000
000500**  FROM THE CHECK-IN TABLES.  THIS FILE WILL BE USED TO RETAIN **00050000
000600**  INFORMATION ABOUT CARTON CHECKED IN FOR A PERIOD OF TIME    **00060000
000700**  FOR THE USE OF CREATING A SUMMARY REPORT.                   **00070000
000800**                                                              **00080000
000900**  LENGTH:  200 BYTES                                          **00090000
001000******************************************************************00100000
001100 01  SU008-EXTRACT-RECORD.                                        00110000
001200     05  SU008-SHIPT-UNT-ID                PIC  S9(18)V   COMP-3. 00120000
001300     05  SU008-PO-NBR                      PIC  S9(9)     COMP.   00130000
001400     05  SU008-REC-SEQ-NBR                 PIC  S9(9)     COMP.   00140000
001410     05  SU008-DEPT-NBR                    PIC  X(03).            00141000
001500     05  SU008-ORGN-OPER-UNT-ID            PIC  S9(4)     COMP.   00142000
001600     05  SU008-ORGN-FCLTY-ID               PIC  S9(4)     COMP.   00143000
001700     05  SU008-DEST-OPER-UNT-ID            PIC  S9(4)     COMP.   00144000
001800     05  SU008-DEST-FCLTY-ID               PIC  S9(4)     COMP.   00145000
001900     05  SU008-ASN-CRE-USR-ID              PIC   X(8).            00146000
002000     05  SU008-ASN-CRE-DATE                PIC   X(10).           00147000
002100     05  SU008-ASN-CRE-TIME                PIC   X(8).            00148000
002200     05  SU008-SCN-OPER-UNT-ID             PIC  S9(4)     COMP.   00149000
002300     05  SU008-SCN-FCLTY-ID                PIC  S9(4)     COMP.   00150000
002400     05  SU008-SCN-USR-ID                  PIC   X(8).            00160000
002500     05  SU008-SCN-DATE                    PIC   X(10).           00170000
002600     05  SU008-SCN-TIME                    PIC   X(8).            00180000
002700     05  SU008-PROCESS-DC-NBR              PIC  S9(4)     COMP.   00190000
002800     05  SU008-TRIP-ID                     PIC  S9(9)     COMP.   00200000
002810     05  SU008-SCAC-CDE                    PIC   X(4).            00210000
002820     05  SU008-VEH-NBR                     PIC   X(11).           00220000
002830     05  SU008-VEND-NAME                   PIC   X(30).           00230000
002831     05  SU008-ENT-ID                      PIC  S9(9)     COMP.   00240000
002840     05  SU008-ASN-NBR                     PIC   X(30).           00250000
002900     05  SU008-MISDIRECT-TYPE              PIC   X(1).            00260000
003000         88  WRG-DC-DWNLD-RGHT-CHCKIN-DC         VALUE '1'.       00270000
003100         88  WRG-DC-DWNLD-WRG-CHCKIN-DC          VALUE '2'.       00280000
003110         88  RGHT-DC-DWNLD-WRG-CHCKIN-DC         VALUE '3'.       00290000
003140         88  BULK-MISDIRECT                      VALUE '4'.       00300000
003150     05  SU008-DONT-SHIP-BEF-DTE           PIC   X(10).           00310000
003160     05  SU008-PO-TYP-CDE                  PIC   X(02).           00311000
003170     05  SU008-NEW-STR-IND                 PIC   X(01).           00312000
003180     05  SU008-TOT-CHECKIN-SCAC            PIC  S9(9)     COMP.   00240000
003190* DMH - 11/17/17 BEGIN                                                    
003191     05  SU008-EBUS-IND                    PIC   X(01).                   
003193     05  SU008-EFC-SISTER-DC               PIC   9(04).                   
003194* DMH - 11/17/17 END                                                      
003200     05  FILLER                            PIC   X(07).           00313000
