000100******************************************************************00010000
000200**                        SURD166                               **00020000
000300**                                                              **00030000
000400**  DC OUTBOUND TRAILER EXTRACT OF TRAILERS TO BE SUMMARIZED    **00040000
000500**  RECORD LENGTH 100                                           **00050000
000600**                                                              **00060000
000700******************************************************************00070000
000800******************************************************************00080000
000900 01  SU166-OTBND-TRLR-RECORD.                                     00090001
001000     10 SU166-OPER-UNT-ID            PIC  S9(04) COMP.            00100000
001101     10 SU166-OTBND-TRIP-ID          PIC  S9(09) COMP.            00110102
001103     10 SU166-DEST-OPER-UNT-ID       PIC  S9(04) COMP.            00110302
001105     10 SU166-TRLR-SRL-NBR           PIC  S9(09) COMP.            00110502
001107     10 SU166-DOOR-TYPE              PIC   X(02).                 00110702
001108     10 SU166-TRIP-ST                PIC   X(02).                 00110802
001109     10 SU166-LAST-SUM-TMST          PIC   X(26).                 00110900
001120     10 SU166-LAST-SUM-CRTN-CNT      PIC  S9(09)  COMP.           00112000
001122     10 SU166-LAST-SUM-UNT-QTY       PIC  S9(09)  COMP.           00112200
001200     10 FILLER                       PIC   X(50).                 00120001
