000100******************************************************************00010000
000200**                        SURD009                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT FOR THE PO/STORE UNIT ADJ RPTS   **00040000
000500**  LENGTH:  200 BYTES                                          **00050000
000600******************************************************************00060000
000700 01  SU009-EXTRACT-RECORD.                                        00070000
000800     05  SU009-MANIFEST-NBR             PIC S9(09) COMP.          00080000
000900     05  SU009-PO-NUMBER                PIC S9(09) COMP.          00090000
001000     05  SU009-REC-SEQ-NBR              PIC S9(09) COMP.          00100000
001100     05  SU009-STR-NBR                  PIC S9(04) COMP.          00110000
001200     05  SU009-LINE-NBR                 PIC S9(09) COMP.          00120000
001300     05  SU009-SHPD-QTY                 PIC S9(9)V COMP-3.        00130000
001400     05  SU009-EXCEPTION-TYPE           PIC X(01).                00140000
001500         88  SU009-NOT-SCANNED              VALUE '1'.            00150000
001600         88  SU009-MISDIRECT                VALUE '2'.            00160000
001700         88  SU009-FREE-ASTRAY              VALUE '3'.            00170000
001800     05  SU009-RECORD-TYPE-IND          PIC  X(01).               00180000
001900         88  SU009-ERROR-RECORD                    VALUE 'A'.     00190000
002000         88  SU009-DETAIL-RECORD                   VALUE 'B'.     00200000
002100     05  SU009-PREPK-IND                PIC X(1).                 00210000
002200     05  SU009-PREPK-ID                 PIC S9(04) COMP.          00220000
002300     05  SU009-FREE-ASTRAY-IND          PIC X(01).                00230001
002400     05  SU009-AUTO-VE-IND              PIC X(01).                00240001
002500         88  SU009-AUTO-VE-YES                     VALUE 'Y'.     00250001
002600         88  SU009-AUTO-VE-NO                      VALUE 'N'.     00260001
002700     05  FILLER                         PIC X(170).               00270001
