000100******************************************************************00010000
000200**                        SURD007                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE FILE LAYOUT TO BE USED FOR EXTRACT INFORMATION  **00040000
000500**  FROM THE CHECK-IN TABLES.  THIS FILE WILL BE USED TO RETAIN **00050000
000600**  INFORMATION ABOUT CARTON CHECK-INS FOR A PERIOD OF TIME     **00060000
000700**  FOR THE USE OF CREATING A SUMMARY REPORT.                   **00070000
000800**                                                              **00080000
001002**  LENGTH:  100 BYTES                                          **00100200
001003******************************************************************00100300
001004 01  SU007-EXTRACT-RECORD.                                        00100400
001005     05  SU007-SHIPT-UNT-ID                PIC  S9(18)V   COMP-3. 00100500
001006     05  SU007-OPER-UNT-ID                 PIC  S9(4)     COMP.   00100600
001007     05  SU007-FCLTY-ID                    PIC  S9(4)     COMP.   00100700
001008     05  SU007-SCN-LOC-ID                  PIC   X(4).            00100800
001009     05  SU007-CRE-USR-ID                  PIC   X(8).            00100900
001010     05  SU007-CRE-TMST                    PIC   X(26).           00101000
001011     05  SU007-TRIP-ID                     PIC  S9(9)     COMP.   00101100
001012     05  SU007-PRTR-TYP-CDE                PIC   X(1).            00101200
001013         88  SU007-NO-PRINTER              VALUE 'N'.             00101300
001014         88  SU007-4X4-BATCH-PRINT         VALUE 'B'.             00101401
001015         88  SU007-4X4-PRINT-APPLY         VALUE 'R'.             00101501
001016         88  SU007-4X4-PRINT-PEEL          VALUE 'P'.             00101601
001026     05  SU007-LBL-PRT-BTCH-ID             PIC  S9(4)     COMP.   00102601
001027     05  SU007-CRTN-TYP-CDE                PIC   X(1).            00102701
001028         88  SU007-BULK-CRTN               VALUE 'B'.             00102801
001030         88  SU007-PACK-BY-STR-CRTN        VALUE 'P'.             00103000
001040     05  FILLER                            PIC   X(40).           00104000
