000100***************************************************************** 00010000
000200* EXTRACTED CARTON DIRECTIVE DATA FOR DUAL FEED PRINT AND APPLY * 00020000
000300* DIRECTIVE DATA INTEGRITY PROCESS.  EXTRACTED FROM KOHL'S DB2  * 00030000
000600* TABLE SUT_CART_DIRV_TRKG                                      * 00060000
000601*                                                               * 00060100
000602*  SURD050- 1050 BYTES                                          * 00060221
000603*                                                               * 00060300
000700*                     MODIFICATION HISTORY                      * 00070000
000800*                     --------------------                      * 00080000
001000* DATE       PROGRAMMER  MODIFICATION                           * 00100000
001100* --------   ----------  -----------------------------------    * 00110000
001200* 12/08/2008 ALICE EBERT INITIAL                                * 00120000
001210* 12/26/2008 R DELAURA   MODIFIED TO USE COPY REPLACING.        * 00121001
001210* 12/03/2010 JEAN KURK   CHANGE TOTAL LINE STRUCTURE            * 00122023
001210*                        REPLACE DEMATIC WITH SRTDRCT           * 00123024
001300***************************************************************** 00130000
001400 01 SU050-DIRECTIV-TRACKING-DATA.                                 00140006
001500   05  SU050-RECORD-TYPE                   PIC X(01).             00150017
001501       88  SU050-SRTDRCT-NO-MATCH               VALUE 'D'.        00150124
001502       88  SU050-SRTDRCT-DATA-DIFF              VALUE 'F'.        00150324
001503       88  SU050-KOHLS-NO-MATCH                 VALUE 'K'.        00150424
001504       88  SU050-KOHLS-DATA-DIFF                VALUE 'N'.        00150524
001507       88  SU050-TOTALS-REC                     VALUE 'T'.        00150720
001508       88  SU050-SRTDRCT-INVALID-REC            VALUE 'X'.        00150825
001510   05  SU050-INPUT-DATA.                                          00151021
001511       10  SU050-KEY-FIELDS.                                      00151118
001512           15  SU050-BRCD-NBR              PIC X(22).             00151218
001513           15  SU050-CRE-TMST              PIC X(26).             00151318
001514       10  SU050-COMPARE-FIELDS.                                  00151418
001520           15  SU050-CNVYR-PRC-ACTN-CDE    PIC X(06).             00152017
001700           15  SU050-PO-NBR                PIC X(09).             00170017
001800           15  SU050-RCVR-SEQ-NBR          PIC X(09).             00180017
001810           15  SU050-PO-LNE-NBR            PIC X(09).             00181017
002100           15  SU050-DIRECTIV-REASON-CDE   PIC X(03).             00210017
004000           15  SU050-CURR-CASI-CDE         PIC X(01).             00400017
004600           15  SU050-CART-STAT-CDE         PIC X(01).             00460017
004610           15  SU050-LOGICAL-DEST          PIC X(32).             00461017
004700           15  SU050-AUD-CNTL-NBR          PIC X(09).             00470017
004800           15  SU050-AUD-STAT-CDE          PIC X(01).             00480017
004900           15  SU050-AUD-FALR-RSN-NM       PIC X(04).             00490017
005200           15  SU050-PRE-PACK-ID           PIC X(04).             00520017
005300           15  SU050-STR-ZN-ID             PIC X(05).             00530017
005500           15  SU050-SEASET-SHRT-NM        PIC X(05).             00550017
005600           15  SU050-STR-NBR               PIC X(05).             00560017
005800           15  SU050-UNIQUE-IND            PIC X(09).             00580017
005900           15  SU050-CRE-BY-USR-ID         PIC X(08).             00590017
005910       10  SU050-OTHER-FIELDS.                                    00591021
005920           15  SU050-ORIG-CASI-CDE         PIC X(01).             00592021
005000           15  SU050-AUD-CART-BEG-DTE.                            00593022
005100               20  SU050-AUD-CART-BEG-CCYY PIC X(04).             00594022
005120               20  SU050-AUD-CART-BEG-MM   PIC X(02).             00595022
005130               20  SU050-AUD-CART-BEG-DD   PIC X(02).             00596022
005710           15  SU050-VNDR-NAME             PIC X(30).             00597022
006000       10  FILLER                          PIC X(01).             00600017
006600       10  SU050-RAW-DATA                  PIC X(750).            00660017
006610       10  FILLER                          PIC X(91).             00661017
006700   05  SU050-TOTALS-RECORD          REDEFINES SU050-INPUT-DATA.   00670021
006800       10  SU050-TTL-DESC                  PIC X(55).             00680023
006810       10  SU050-TTL-CNT                   PIC Z,ZZZ,ZZ9.         00681017
006820       10  FILLER                          PIC X(985).            00682023
