000100******************************************************************00010000
000200**                        SURD167                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT EMAIL FROM STORE WEB SERVICE     **00040001
000500**  WHEN TRAILER STATUS IS INCORRECT                            **00050001
000600**  LENGTH:  80  BYTES                                          **00060001
000700******************************************************************00070000
000800 01  SU167-EXTRACT-RECORD.                                        00080002
000900     05  SU167-TRLR-SEAL-ID         PIC   X(20).                  00090002
000910     05  FILLER                     PIC   X.                      00091002
001000     05  SU167-OTBND-TRIP-ID        PIC   9(10).                  00100002
001001     05  FILLER                     PIC   X.                      00100102
001010     05  SU167-ORGN-OPER-TRIP-ID    PIC   9(04).                  00101002
001011     05  FILLER                     PIC   X.                      00101102
001012     05  SU167-DEST-OPER-TRIP-ID    PIC   9(04).                  00101202
001013     05  FILLER                     PIC   X.                      00101302
001020     05  SU167-TRLR-SRL-NBR         PIC   9(10).                  00102002
001021     05  FILLER                     PIC   X.                      00102102
001030     05  SU167-TRIP-STAT-CDE        PIC   X(02).                  00103002
001031     05  FILLER                     PIC   X.                      00103102
001040     05  SU167-SCAC-CDE             PIC   X(04).                  00104002
001041     05  FILLER                     PIC   X.                      00104102
001050     05  SU167-TRLR-ID              PIC   X(12).                  00105002
001070     05  FILLER                     PIC   X(07).                  00107002
