000100******************************************************************00010001
000200*    COPY MEMBER:  SURD152                       LRECL = 100     *00020001
000300*                                                                *00030001
000400*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR ASSUMPTIVE       *00040001
000500*    CARTON PROCESSING FOR SCANNING STORES.                      *00050001
000600*                                                                *00060001
000700******************************************************************00070001
000800 01  SU152-ASSUMPTIVE-CTN-REC.                                    00080001
000900     05  SU152-TRIP-ID              PIC  9(9)    VALUE ZEROES.    00090001
001000     05  SU152-TRIP-STORE           PIC  9(4)    VALUE ZEROES.    00100001
001100     05  SU152-SCAN-STORE           PIC  9(4)    VALUE ZEROES.    00110001
001200     05  SU152-ASSUMP-REASON        PIC  X(1)    VALUE SPACE.     00120002
001210         88  SU152-REG-TRLR-DAYS                 VALUE 'A'.       00121002
001220         88  SU152-VIRTL-TRLR-DAYS               VALUE 'B'.       00122002
001230         88  SU152-REG-TRLR-INV                  VALUE 'C'.       00123002
001240         88  SU152-VIRTL-TRLR-INV                VALUE 'D'.       00124002
001250         88  SU152-REG-TRLR-RFID                 VALUE 'E'.       00125002
001260         88  SU152-VIRTL-TRLR-RFID               VALUE 'F'.       00126002
001270         88  SU152-FORCED-EARLY                  VALUE 'G'.       00127002
001280         88  SU152-FORCE-EXCEPTION               VALUE 'H'.       00128002
001300     05  FILLER                     PIC  X(82)   VALUE SPACES.    00130002
