      ******************************************************************        
      * THIS COPYBOOK USED IN A WEBSERVICE PROCESSCARTONSCAN                    
      * PLEASE CHECK IN CICS WEBSERVICE PLAYBOOK FOR STEPS TO FOLLOW            
      * FOR MAKING CHANGES TO THIS COPYBOOK LAYOUT                              
      ******************************************************************        
       01  SU137-INP-PROCESS-CARTON.                                            
           05  SU137-CARTON-ID             PIC S9(18)V COMP-3.                  
           05  SU137-OUTBOUND-TRIP-ID      PIC  9(09).                          
           05  SU137-STORE-NBR             PIC  9(04).                          
           05  SU137-USER-ID               PIC  X(08).                          
           05  SU137-PARENT-SCAN-IND       PIC  X(01).                          
