000100***************************************************************** 00010000
000200*    RECORD PURPOSE: EXTRACT FILE LAYOUT FOR CARTONS THAT       * 00020000
000300*                    HAVE BEEN CHECKED IN BUT AFTER 2 DAYS      * 00030000
000400*                    ARE STILL ASSOCIATED TO AN INACTIVE        * 00040000
000500*                    PACKSLIP.                                  * 00050000
000600*    RECORD LENGTH:  150 BYTES                                  * 00060001
000700*    RECORD FORMAT:  SEQUENTIAL                                 * 00070000
000800***************************************************************** 00080000
000900 01  SU016-EXTRACT-RECORD.                                        00090000
001000     05  SU016-RECORD-TYPE-CDE           PIC  X(01)  VALUE SPACES.00100000
001100         88  SU016-HEADER-RECORD                     VALUE 'A'.   00110000
001200         88  SU016-DETAIL-RECORD                     VALUE 'B'.   00120000
001300     05  SU016-PO-NBR                    PIC  9(09)  VALUE ZEROS. 00130000
001400     05  SU016-DEPT-NBR                  PIC  9(04)  VALUE ZEROS. 00140000
001500     05  SU016-VENDOR-NAME               PIC  X(30)  VALUE SPACES.00150001
001600     05  SU016-SHIPT-UNT-ID              PIC  X(18)  VALUE SPACES.00160000
001700     05  SU016-TRIP-ID                   PIC  9(09)  VALUE ZEROS. 00170000
001800     05  SU016-SCAN-DATE.                                         00180000
001900         10  SU016-SCAN-DATE-MM          PIC  X(02).              00190000
002000         10  FILLER                      PIC  X(01).              00200000
002100         10  SU016-SCAN-DATE-DD          PIC  X(02).              00210000
002200         10  FILLER                      PIC  X(01).              00220000
002300         10  SU016-SCAN-DATE-YYYY        PIC  X(04).              00230000
002400     05  SU016-SCAN-TIME.                                         00240000
002500         10  SU016-SCAN-TIME-HH          PIC  X(02).              00250000
002600         10  FILLER                      PIC  X(01).              00260000
002700         10  SU016-SCAN-TIME-MM          PIC  X(02).              00270000
002800         10  FILLER                      PIC  X(01).              00280000
002900         10  SU016-SCAN-TIME-SS          PIC  X(02).              00290000
003000     05  SU016-SCAN-DC-NBR               PIC  9(04)  VALUE ZEROS. 00300000
003100     05  SU016-ORIGIN-DC-NBR             PIC  9(04)  VALUE ZEROS. 00310000
003200     05  SU016-DESTIN-DC-NBR             PIC  9(04)  VALUE ZEROS. 00320000
003300     05  SU016-ASSIGN-TEXT               PIC  X(04)  VALUE SPACES.00330000
003400         88  SU016-ASSIGN-P2L                        VALUE ' P2L'.00340000
003410     05  SU016-BRCDE-NBR                 PIC  X(22)  VALUE SPACES.00341002
003500     05  FILLER                          PIC  X(23)  VALUE SPACES.00350002
