       01  SU017-RMS-CARTON-RECORD.                                             
           05  SU017-CARTON-ID              PIC X(20) VALUE SPACES.             
           05  SU017-CARTON-STATUS-IND      PIC 9(01).                          
               88  SU017-FOUND-ON-RMS                 VALUE 0.                  
               88  SU017-NOT-FOUND-ON-RMS             VALUE 1.                  
               88  SU017-ERROR-CALL                   VALUE 2.                  
           05  SU017-SQLCODE                PIC S9(9) COMP.                     
           05  SU017-ERROR-MESSAGE          PIC X(79).                          
           05  SU017-SQLCA                  PIC X(136).                         
