000100******************************************************************00010000
000200**                        SURD039                               **00020000
000300**  LAYOUT FOR THE SU PO ARCHIVE REQUEST FILE                   **00030008
000600**  LENGTH:  69                                                 **00060007
000700**                                                              **00070000
000800******************************************************************00080000
000900 01  SU039-REQUEST-RECORD.                                        00090001
001000     05 SU039-PO-NBR                    PIC S9(09) COMP.          00100000
001100     05 SU039-REC-SEQ-NBR               PIC S9(09) COMP.          00110000
001110     05 SU039-OPER-UNT-ID               PIC S9(04) COMP.          00111002
001111     05 SU039-DEST-OPER-UNT-ID          PIC S9(04) COMP.          00111105
001120     05 SU039-TK-NBR                    PIC X(08).                00112002
001171     05 SU039-REQ-DATE.                                           00117102
001172        10 SU039-REQ-YY                 PIC X(04).                00117202
001173        10 FILLER                       PIC X(01).                00117302
001174        10 SU039-REQ-MM                 PIC X(02).                00117402
001175        10 FILLER                       PIC X(01).                00117502
001176        10 SU039-REQ-DD                 PIC X(02).                00117602
001178     05 SU039-REQ-TIME.                                           00117802
001179        10 SU039-REQ-HRS                PIC X(02).                00117902
001180        10 FILLER                       PIC X(01).                00118002
001181        10 SU039-REQ-MIN                PIC X(02).                00118102
001182        10 FILLER                       PIC X(01).                00118202
001183        10 SU039-REQ-SEC                PIC X(02).                00118302
001184     05 SU039-REC-SEQ-IND               PIC X(01).                00118406
001185        88 SU039-ALL-RECEIVERS              VALUE 'Y'.            00118506
001186        88 SU039-NOT-ALL-RECEIVERS          VALUE 'N'.            00118606
001187                                                                  00118702
001188     05 FILLER                          PIC X(30).                00118802
001190                                                                  00119000
