000100*                         SURD068                                         
000200*                                                                         
000300*   INACTIVE CARTON EXTRACT FILE - INPUT TO SUKRP048                      
000500*                                                                         
000600**  LENGTH:  100               USED IN JOB SUK015                         
000700                                                                          
000800 01  SU068-EXTRACT-RECORD.                                                
000902     05  SU068-SHIPT-UNT-ID           PIC S9(18)V COMP-3.                 
000910     05  SU068-LOC-NBR                PIC S9(04)  COMP.                   
000920     05  SU068-PO-NBR                 PIC  9(09)  COMP.                   
000930     05  SU068-RCVR-SEQ               PIC  9(04)  COMP.                   
000940     05  SU068-LINE-NBR               PIC  9(04)  COMP.                   
000950     05  SU068-OUTBOUND-TRIP          PIC  9(09)  COMP.                   
000960     05  SU068-SRC-ID                 PIC  X(03)  VALUE SPACE.            
000970         88  SU068-SRC-ASN                         VALUE 'ASN'.           
000980         88  SU068-SRC-CHECKED-IN                  VALUE 'CKN'.           
000990         88  SU068-SRC-CASEPACK-SPLIT              VALUE 'CPS'.           
001000         88  SU068-SRC-MANUAL                      VALUE 'MAN'.           
001100         88  SU068-SRC-P2L                         VALUE 'P2L'.           
001200         88  SU068-SRC-RECV                        VALUE 'RCV'.           
001300         88  SU068-SRC-RDM                         VALUE 'RDM'.           
001310         88  SU068-SRC-SMOOTHING                   VALUE 'SMO'.           
001320         88  SU068-SRC-FAST-XFER                   VALUE 'FXR'.           
001330         88  SU068-SRC-MSTR-CNTR                   VALUE 'MST'.           
001340         88  SU068-SRC-CRTN-BULD                   VALUE 'MSC'.           
001350         88  SU068-SRC-UNKNOWN                     VALUE '   '.           
001360         88  SU068-SRC-JWL                         VALUE 'JWL'.           
001370         88  SU068-SRC-DMG                         VALUE 'DMG'.           
001400     05  SU068-INACTIVE-USER-ID       PIC X(08).                          
001401     05  SU068-INACTIVE-REASON        PIC X(12).                          
001410         88  SU068-CSEPK-DELETE           VALUE 'CSEPK DELETE'.           
001411         88  SU068-RECLAIM                VALUE 'RECLAIM     '.           
001412         88  SU068-UNUSED                 VALUE 'UNUSED      '.           
001413         88  SU068-UNSMOOTHED             VALUE 'UNSMOOTHED  '.           
001414         88  SU068-UNKNOWN                VALUE 'UNKNOWN     '.           
001500     05  SU068-ACTIVE-CARTONS         PIC 9(09) COMP.                     
001501     05  SU068-INACTIVE-CARTONS       PIC 9(09) COMP.                     
001510     05  SU068-DEST-OPER-UNIT-ID      PIC 9(09) COMP.                     
001511     05  SU068-DEPT-NUMBER            PIC 9(04) COMP.                     
001514     05  SU068-SUB-CLASS              PIC 9(04) COMP.                     
001515     05  SU068-SKU                    PIC 9(08) COMP.                     
001516     05  SU068-UNIT-COUNT             PIC 9(09) COMP.                     
001515     05  SU068-DIVERT-DOOR            PIC X(04).                          
001600     05  FILLER                       PIC X(25).                          
