000100******************************************************************00010000
000200**  SURD123                                                     **00020000
000220**                                                              **00022000
000230**  SUMMARY BY OUTBOUND TRIP - SU EXTRACT                       **00023000
000400**  LENGTH:  600 BYTES                                          **00040007
000500******************************************************************00050000
001900 05  SU123-EXTRACT-RECORD.                                        00190000
002000*                                                                 00200000
002300     10  SU123-OPER-UNT-ID             PIC  S9(04) COMP.          00230000
002400     10  SU123-STORE-DEST              PIC  S9(04) COMP.          00240000
002500     10  SU123-TRIP-ID                 PIC  S9(09) COMP.          00250000
002600*                                                                 00260000
003100     10  SU123-TRIP-OPEN-TO-CLOSE-MIN  PIC  S9(16) COMP.          00310008
003200     10  SU123-TRIP-CLOSE-TO-SHIP-MIN  PIC  S9(16) COMP.          00320008
003300     10  SU123-TRIP-OPEN-TO-SHIP-MIN   PIC  S9(16) COMP.          00330008
003400*                                                                 00340000
003800     10  SU123-SML-SRC-CDE             PIC   X(03).               00380000
003900     10  SU123-INPUT-RECORD-COUNT      PIC  S9(16) COMP.          00390008
009200*                                                                 00920000
009210*** MINUTES                                                       00921001
009220*                                                                 00922001
009300     10  SU123-ARRIVE-TO-PRC-MIN       PIC  S9(16) COMP.          00930008
009400     10  SU123-ARRIVE-TO-P2L-PKD-MIN   PIC  S9(16) COMP.          00940008
009500     10  SU123-PRC-TO-P2L-PKD-MIN      PIC  S9(16) COMP.          00950008
009600     10  SU123-P2L-PKD-TO-CLOSE-MIN    PIC  S9(16) COMP.          00960008
009700     10  SU123-P2L-OPEN-TO-CLOSE-MIN   PIC  S9(16) COMP.          00970008
009800     10  SU123-P2L-OPEN-TO-OTBND-MIN   PIC  S9(16) COMP.          00980008
009810     10  SU123-P2L-CLOSE-TO-OTBND-MIN  PIC  S9(16) COMP.          00981008
009900     10  SU123-ARRIVE-TO-OTBND-MIN     PIC  S9(16) COMP.          00990008
010000     10  SU123-PRC-TO-OTBND-MIN        PIC  S9(16) COMP.          01000008
010100     10  SU123-ARRIVE-TO-TCLOS-MIN     PIC  S9(16) COMP.          01010008
010200     10  SU123-ARRIVE-TO-SHIP-MIN      PIC  S9(16) COMP.          01020008
010300     10  SU123-P2L-OPEN-TO-TCLOS-MIN   PIC  S9(16) COMP.          01030008
010400     10  SU123-P2L-OPEN-TO-SHIP-MIN    PIC  S9(16) COMP.          01040008
010500     10  SU123-P2L-CLOSE-TO-TCLOS-MIN  PIC  S9(16) COMP.          01050008
010600     10  SU123-P2L-CLOSE-TO-SHIP-MIN   PIC  S9(16) COMP.          01060008
010700     10  SU123-ARRIVE-TO-MSTR-MIN      PIC  S9(16) COMP.          01070008
010800     10  SU123-PRC-TO-MSTR-MIN         PIC  S9(16) COMP.          01080008
010900     10  SU123-MSTR-CRE-TO-OTBND-MIN   PIC  S9(16) COMP.          01090008
011000     10  SU123-MSTR-CRE-TO-TCLOS-MIN   PIC  S9(16) COMP.          01100008
011100     10  SU123-MSTR-CRE-TO-SHIP-MIN    PIC  S9(16) COMP.          01110008
011200     10  SU123-MSTR-FIRST-TO-OTBND-MIN PIC  S9(16) COMP.          01120008
011300     10  SU123-MSTR-FIRST-TO-TCLOS-MIN PIC  S9(16) COMP.          01130008
011400     10  SU123-MSTR-FIRST-TO-SHIP-MIN  PIC  S9(16) COMP.          01140008
011500     10  SU123-MSTR-LAST-TO-OTBND-MIN  PIC  S9(16) COMP.          01150008
011600     10  SU123-MSTR-LAST-TO-TCLOS-MIN  PIC  S9(16) COMP.          01160008
011700     10  SU123-MSTR-LAST-TO-SHIP-MIN   PIC  S9(16) COMP.          01170008
011710     10  SU123-ON-OTBND-TO-CLOS-MIN    PIC  S9(16) COMP.          01171008
011711     10  SU123-ON-OTBND-TO-SHIP-MIN    PIC  S9(16) COMP.          01171108
011800*                                                                 01180001
011801* INPUT RECORD COUNT                                              01180101
011802*                                                                 01180201
011810     10  SU123-ARRIVE-TO-PRC-CNT       PIC  S9(16) COMP.          01181008
011820     10  SU123-ARRIVE-TO-P2L-PKD-CNT   PIC  S9(16) COMP.          01182008
011830     10  SU123-PRC-TO-P2L-PKD-CNT      PIC  S9(16) COMP.          01183008
011840     10  SU123-P2L-PKD-TO-CLOSE-CNT    PIC  S9(16) COMP.          01184008
011850     10  SU123-P2L-OPEN-TO-CLOSE-CNT   PIC  S9(16) COMP.          01185008
011851     10  SU123-P2L-OPEN-TO-OTBND-CNT   PIC  S9(16) COMP.          01185108
011860     10  SU123-P2L-CLOSE-TO-OTBND-CNT  PIC  S9(16) COMP.          01186008
011870     10  SU123-ARRIVE-TO-OTBND-CNT     PIC  S9(16) COMP.          01187008
011880     10  SU123-PRC-TO-OTBND-CNT        PIC  S9(16) COMP.          01188008
011890     10  SU123-ARRIVE-TO-TCLOS-CNT     PIC  S9(16) COMP.          01189008
011891     10  SU123-ARRIVE-TO-SHIP-CNT      PIC  S9(16) COMP.          01189108
011892     10  SU123-P2L-OPEN-TO-TCLOS-CNT   PIC  S9(16) COMP.          01189208
011893     10  SU123-P2L-OPEN-TO-SHIP-CNT    PIC  S9(16) COMP.          01189308
011894     10  SU123-P2L-CLOSE-TO-TCLOS-CNT  PIC  S9(16) COMP.          01189408
011895     10  SU123-P2L-CLOSE-TO-SHIP-CNT   PIC  S9(16) COMP.          01189508
011896     10  SU123-ARRIVE-TO-MSTR-CNT      PIC  S9(16) COMP.          01189608
011897     10  SU123-PRC-TO-MSTR-CNT         PIC  S9(16) COMP.          01189708
011900     10  SU123-MSTR-CRE-TO-OTBND-CNT   PIC  S9(16) COMP.          01190008
011901     10  SU123-MSTR-CRE-TO-TCLOS-CNT   PIC  S9(16) COMP.          01190108
011902     10  SU123-MSTR-CRE-TO-SHIP-CNT    PIC  S9(16) COMP.          01190208
011903     10  SU123-MSTR-FIRST-TO-OTBND-CNT PIC  S9(16) COMP.          01190308
011904     10  SU123-MSTR-FIRST-TO-TCLOS-CNT PIC  S9(16) COMP.          01190408
011905     10  SU123-MSTR-FIRST-TO-SHIP-CNT  PIC  S9(16) COMP.          01190508
011906     10  SU123-MSTR-LAST-TO-OTBND-CNT  PIC  S9(16) COMP.          01190608
011907     10  SU123-MSTR-LAST-TO-TCLOS-CNT  PIC  S9(16) COMP.          01190708
011908     10  SU123-MSTR-LAST-TO-SHIP-CNT   PIC  S9(16) COMP.          01190808
011909     10  SU123-ON-OTBND-TO-CLOS-CNT    PIC  S9(16) COMP.          01190908
011910     10  SU123-ON-OTBND-TO-SHIP-CNT    PIC  S9(16) COMP.          01191008
011920*                                                                 01192000
011930*   REPORT SEQUENCE                                               01193009
011940*   01 - ASN - CROSS DOCK                                         01194009
011950*   02 - CPS - CASEPACK SPLIT - MANUAL XDOCK                      01195009
011960*   03 - SMO - SMOOTHING - PBS MANUAL XDOCK                       01196009
011970*   04 - JWL - P2L JEWELRY                                        01197009
011980*   05 - P2L - PACK-TO-LIGHT                                      01198009
011990*   06 - MST - MASTER CONTAINER                                   01199009
011991*   07 - RDM - IR - IMPORT REPLEN - CENTRAL STOCK                 01199112
011992*   08 - 3WD - THIRD PARTY WAREHOUSE DISTRIBUTION                 01199212
011993*                                                                 01199312
012000     10  SU123-REPORT-SORT-SEQ         PIC   9(02).               01200009
012001         88 SU123-RPT-SEQ-01                       VALUE 01.      01200109
012002         88 SU123-RPT-SEQ-02                       VALUE 02.      01200209
012003         88 SU123-RPT-SEQ-03                       VALUE 03.      01200309
012004         88 SU123-RPT-SEQ-04                       VALUE 04.      01200409
012005         88 SU123-RPT-SEQ-05                       VALUE 05.      01200509
012006         88 SU123-RPT-SEQ-06                       VALUE 06.      01200609
012007         88 SU123-RPT-SEQ-07                       VALUE 07.      01200709
012008         88 SU123-RPT-SEQ-08                       VALUE 08.      01200812
012009         88 SU123-RPT-SEQ-OTHER                    VALUE 99.      01200912
012010*                                                                 01201009
012020*** DMH 8/18/16                                                   01202010
012030*                                                                 01203010
012100     10  SU123-TRIP-CARTONS            PIC   9(16).               01210010
012200     10  SU123-TRIP-SRC-CARTONS        PIC   9(16).               01220010
012300     10  SU123-TOTAL-TRIPS             PIC   9(06).               01230010
012310*                                                                 01231010
012320***                                                               01232010
012330*                                                                 01233010
012400     10  FILLER                        PIC   X(69).               01240011
