000100******************************************************************00010000
000200**                        SURD945                               **00020000
000300**                                                              **00030000
000400**  USED TO CREATED DATA REQUESTED BY LOGISTICS                 **00040000
000500**  RECORD LENGTH 160                                          ** 00050004
000600**                                                              **00060000
000700******************************************************************00070000
000800******************************************************************00080000
000900 01  SU945-UPLDER-RECORD.                                         00090000
001105     10 SU945-OPER-UNT-ID            PIC   X(4).                  00110502
001106     10 FILLER                       PIC   X(01).                 00110600
001107     10 SU945-DIVERT-NBR             PIC   X(9).                  00110702
001108     10 FILLER                       PIC   X(01).                 00110800
001109     10 SU945-DIVERT-LOC-ID          PIC   X(4).                  00110900
001110     10 FILLER                       PIC   X(01).                 00111000
001111     10 SU945-DIVERT-TMST            PIC   X(26).                 00111100
001112     10 FILLER                       PIC   X(01).                 00111200
001113     10 SU945-BRCDE-NBR              PIC   X(22).                 00111300
001114     10 FILLER                       PIC   X(01).                 00111400
001115     10 SU945-PRC-RSN-CDE            PIC   X(8).                  00111500
001116     10 FILLER                       PIC   X(01).                 00111600
001120     10 SU945-SHIPT-UNT-ID           PIC   X(18).                 00112002
001121     10 FILLER                       PIC   X(01).                 00112100
001130     10 SU945-BTCH-NBR               PIC   X(15).                 00113000
001131     10 FILLER                       PIC   X(01).                 00113100
001140     10 SU945-BTCH-RVSN-NBR          PIC   X(4).                  00114002
001141     10 FILLER                       PIC   X(01).                 00114100
001150     10 SU945-ACTV-CDE               PIC   X(1).                  00115000
001151     10 FILLER                       PIC   X(01).                 00115100
001160     10 SU945-NACTV-USR-ID           PIC   X(8).                  00116000
001161     10 FILLER                       PIC   X(01).                 00116100
001170     10 SU945-DOOR-ID                PIC   X(4).                  00117000
001171     10 FILLER                       PIC   X(01).                 00117100
001180     10 SU945-DEST-OPER-UNT-ID       PIC   X(4).                  00118003
001181     10 FILLER                       PIC   X(01).                 00118100
001190     10 SU945-DIVERT-SYS-DTE         PIC   X(10).                 00119000
001191     10 FILLER                       PIC   X(01).                 00119100
001200     10 SU945-DIVERT-SYS-TM          PIC   X(8).                  00120000
001300     10 FILLER                       PIC   X(01).                 00130000
