000100******************************************************************00010000
000200**                        SURD077                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT FOR THE WEEKLY MANIFEST EXTRACT FOR      **00040000
000410**  LOGISTICS.                                                  **00041000
000420**  LENGTH:  194 BYTES                                          **00042001
000430**                                                              **00043000
000440******************************************************************00044000
000450 01  SU077-MFST-EXTRACT-RECORD.                                   00045000
000456     05  SU077-DC-NBR                   PIC   Z(04).              00045600
000457     05  SU077-COMMA-01                 PIC   X(01).              00045700
000458     05  SU077-STORE-NBR                PIC   Z(04).              00045800
000459     05  SU077-COMMA-02                 PIC   X(01).              00045900
000461     05  SU077-STORE-OPEN-DATE.                                   00046100
000462         10  SU077-STORE-OPEN-YEAR      PIC   9(04).              00046200
000463         10  SU077-DATE-DASH-1          PIC   X(01).              00046300
000464         10  SU077-STORE-OPEN-MONTH     PIC   9(02).              00046400
000465         10  SU077-DATE-DASH-2          PIC   X(01).              00046500
000466         10  SU077-STORE-OPEN-DAY       PIC   9(02).              00046600
000467     05  SU077-COMMA-03                 PIC   X(01).              00046700
000469     05  SU077-OTBND-TRIP-ID            PIC   Z(10).              00046900
000470     05  SU077-COMMA-04                 PIC   X(01).              00047000
000472     05  SU077-TRLR-SRL-NBR             PIC   Z(10).              00047200
000473     05  SU077-COMMA-05                 PIC   X(01).              00047300
000475     05  SU077-SCAC                     PIC   X(04).              00047500
000476     05  SU077-COMMA-06                 PIC   X(01).              00047600
000478     05  SU077-TRLR-ID                  PIC   X(12).              00047800
000479     05  SU077-COMMA-07                 PIC   X(01).              00047900
000481     05  SU077-TRLR-SIZE                PIC   Z(04).              00048100
000482     05  SU077-COMMA-08                 PIC   X(01).              00048200
000484     05  SU077-TRLR-SUMMARY-TMST        PIC   X(26).              00048400
000485     05  SU077-COMMA-09                 PIC   X(01).              00048500
000487     05  SU077-CARTON-QTY               PIC   Z(09).              00048700
000488     05  SU077-COMMA-10                 PIC   X(01).              00048800
000490     05  SU077-UNIT-QTY                 PIC   Z(09).              00049000
000491     05  SU077-COMMA-11                 PIC   X(01).              00049100
000493     05  SU077-TRLR-SHIP-TMST           PIC   X(26).              00049300
000494     05  SU077-COMMA-12                 PIC   X(01).              00049400
000496     05  SU077-TRLR-CLOSE-TMST          PIC   X(26).              00049600
000497     05  SU077-COMMA-13                 PIC   X(01).              00049700
000498     05  SU077-TRLR-OPEN-TMST           PIC   X(26).              00049801
000499     05  SU077-COMMA-14                 PIC   X(01).              00049901
