000100******************************************************************00010000
000200**                        SURD004                               **00020000
000300**                                                              **00040000
000400**  THIS IS THE EXTRACT LAYOUT FOR THE RECEIVER OVER/SHORT FILE **00040000
000500**  USED IN THE AUDIT SUMMARY EXTRACT                                   00
000600**  LENGTH:  100 BYTES                                          **00060000
000700******************************************************************00070000
000800 05  SU004-EXTRACT-RECORD.                                        00080000
000801     10  SU004-AUD-CNTL-NBR            PIC  S9(09)  COMP.         00080100
000803     10  SU004-PO-NBR                  PIC  S9(09)  COMP.                 
000804     10  SU004-REC-SEQ-NBR             PIC  S9(09)  COMP.                 
000805     10  SU004-SKU-NBR.                                                 00
000806         15  SU004-SKU-DEPT-NBR        PIC   X(03).                     00
000807         15  SU004-SKU-CL-NBR          PIC   X(02).                     00
000805         15  SU004-SKU-NMBR            PIC   9(08).                     00
000809     10  SU004-SCN-TMST                PIC   X(26).                     00
000810     10  SU004-DEST-OPER-UNT-ID        PIC  S9(04)  COMP.         00080200
000811     10  SU004-QTY-AUD                 PIC  S9(09)  COMP-3.             00
000812     10  SU004-QTY-RECV                PIC  S9(09)  COMP-3.             00
000815     10  SU004-PICK-ERR-CNT            PIC  S9(09)  COMP-3.               
000816     10  SU004-UNT-ERR-CNT-COMBO       PIC  S9(09)  COMP-3.               
000817     10  SU004-ORDER-TYPE-IND          PIC   X(01).                     00
000818        88  SU004-PBS-ORDER            VALUE 'P'.                       00
000819        88  SU004-CASEPACK-ORDER       VALUE 'C'.                       00
000820     10  SU004-TOT-ERR-QTY             PIC  S9(09)  COMP-3.               
001250     05  FILLER                        PIC   X(121).                    00
