000100******************************************************************        
000200*                         SURD023                                *        
000300*                                                                *        
000400*   THIS IS THE FILE LAYOUT FOR THE BMC OFFLOAD WHICH CREATES    *        
000500*   FILE PKMT.SU.SHIPPED.UNLOAD AND OPENED.UNLOAD WHICHI WILL BE *        
000600*   USED TO CREATE 2 OF THE TRAILER SUSPENSE REPORTS:  SHIPPED   *        
000600*   BUT NOT OPENED AT STORE AND OPENED BUT NOT UNLOADED AT STORE *        
000800*                                                                *        
001002**  LENGTH: 076 BYTES          USED IN JOB SUK010 & SUK050       *        
001003******************************************************************        
001004 01  SU023-EXTRACT-RECORD.                                                
001005     05  SU023-TRIP-ID                 PIC S9(09) COMP.                   
001007     05  SU023-OPER-UNT-ID             PIC S9(04) COMP.                   
001008     05  SU023-STR-NBR                 PIC S9(04) COMP.                   
001008     05  SU023-TRLR-SRL-NBR            PIC S9(09) COMP.                   
001008     05  SU023-OTBND-STAT-TMST         PIC X(26).                         
001008     05  SU023-SCAC                    PIC X(04).                         
001008     05  SU023-TRLR-ID                 PIC X(12).                         
001008     05  SU023-CITY                    PIC X(20).                         
001008     05  SU023-STATE                   PIC X(02).                         
001008     05  SU023-TRIP-HOURS              PIC S9(09) COMP.                   
           05  FILLER                        PIC X(01).                         
