      ******************************************************************        
      * THIS COPYBOOK USED IN A WEBSERVICE SHIPOUTBOUNDTRAILER                  
      * PLEASE CHECK IN CICS WEBSERVICE PLAYBOOK FOR STEPS TO FOLLOW            
      * FOR MAKING CHANGES TO THIS COPYBOOK LAYOUT                              
      ******************************************************************        
       01  SU160-INP-SHIP-OUTB-TLR.                                             
           05  SU160-DC-NBR              PIC 9(04)  VALUE ZEROES.               
           05  SU160-TRLR-SEAL-ID        PIC X(20)  VALUE SPACES.               
           05  SU160-USER-ID             PIC X(08)  VALUE SPACES.               
