000100******************************************************************        
000200*                         SURD074                                *        
000300*                                                                *        
000400*   WLP EXTRACT LAYOUT:                                          *        
000600*     -  EXTRACT CREATED IN SUKRP046                             *        
000500*     -  EXTRACT CREATED FROM THE TRAILER SUMMARY REPORT DATA    *        
000800*                                                                *        
001002**  LENGTH: 280 BYTES                 CREATE IN JOB SUK075       *        
001003******************************************************************        
001004 01  SU074-EXTRACT-RECORD.                                                
001004*                                                                         
001004***   TRAILER INFO                                                        
001004*                                                                         
001004     02  SU074-TRAILER-INFO.                                              
001004         05  SU074-RECORD-TYPE             PIC X(01).                     
001004                88  SU074-HARDLINES           VALUE '1'.                  
001004                88  SU074-SOFTLINES           VALUE '2'.                  
001004                88  SU074-HANG                VALUE '3'.                  
001004                88  SU074-FOLD                VALUE '4'.                  
001004                88  SU074-0-ON-HAND-REPL      VALUE '5'.                  
001004                88  SU074-0-ON-HAND-NEW       VALUE '6'.                  
001004                88  SU074-EAS-TAG             VALUE '7'.                  
001004                88  SU074-CLEARANCE           VALUE '8'.                  
001004                88  SU074-PRCNT-TOTALS        VALUE '9'.                  
041900         05  SU074-RUN-MONTH               PIC X(02).                     
041900         05  SU074-RUN-DAY                 PIC X(02).                     
041900         05  SU074-RUN-YEAR                PIC X(02).                     
041900         05  SU074-RUN-HOUR                PIC X(02).                     
041900         05  SU074-RUN-MINUTES             PIC X(02).                     
041900         05  SU074-STORE-NBR               PIC 9(04).                     
049400         05  SU074-STORE-NAME              PIC X(40).                     
049400         05  SU074-DC-NBR                  PIC 9(04).                     
049400         05  SU074-DC-NAME                 PIC X(40).                     
049400         05  SU074-TRLR-STATUS             PIC X(30).                     
049400         05  SU074-SCAC                    PIC X(04).                     
049400         05  SU074-TRLR-ID                 PIC X(12).                     
049400         05  SU074-TRLR-SRL                PIC 9(09).                     
001004         05  FILLER                        PIC X(26).                     
049400*                                                                         
049500***    HARDLINE TOTALS                                                    
049600*                                                                         
001004****   TRAILER DETAIL LINE 1                                              
001004     02  SU074-TRAILER-DETAIL-DATA1.                                      
049600*                                                                         
010000         05  SU074-TL1-HARD-1ST-CRTNS      PIC 9(05).                     
050200         05  SU074-TL1-HARD-1ST-SKUS       PIC 9(05).                     
050400         05  SU074-TL1-HARD-1ST-UNITS      PIC 9(05).                     
050600         05  SU074-TL1-HARD-2ND-CRTNS      PIC 9(05).                     
050800         05  SU074-TL1-HARD-2ND-SKUS       PIC 9(05).                     
051000         05  SU074-TL1-HARD-2ND-UNITS      PIC 9(05).                     
051200         05  SU074-TL1-HARD-3RD-CRTNS      PIC 9(05).                     
051400         05  SU074-TL1-HARD-3RD-SKUS       PIC 9(05).                     
051600         05  SU074-TL1-HARD-3RD-UNITS      PIC 9(05).                     
051800         05  SU074-TL1-HARD-4TH-CRTNS      PIC 9(05).                     
052000         05  SU074-TL1-HARD-4TH-SKUS       PIC 9(05).                     
052200         05  SU074-TL1-HARD-4TH-UNITS      PIC 9(05).                     
052400         05  SU074-TL1-HARD-TOT-CRTNS      PIC 9(05).                     
052600         05  SU074-TL1-HARD-TOT-SKUS       PIC 9(05).                     
052800         05  SU074-TL1-HARD-TOT-UNITS      PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
053200***    SOFTLINE TOTALS                                                    
053300*                                                                         
001004***    TRAILER DETAIL LINE 2                                              
001004     02  SU074-TRAILER-DETAIL-DATA2 REDEFINES                             
000004         SU074-TRAILER-DETAIL-DATA1.                                      
053300*                                                                         
053700         05  SU074-TL2-SOFT-1ST-CRTNS      PIC 9(05).                     
053900         05  SU074-TL2-SOFT-1ST-SKUS       PIC 9(05).                     
054100         05  SU074-TL2-SOFT-1ST-UNITS      PIC 9(05).                     
054300         05  SU074-TL2-SOFT-2ND-CRTNS      PIC 9(05).                     
054500         05  SU074-TL2-SOFT-2ND-SKUS       PIC 9(05).                     
054700         05  SU074-TL2-SOFT-2ND-UNITS      PIC 9(05).                     
054900         05  SU074-TL2-SOFT-3RD-CRTNS      PIC 9(05).                     
055100         05  SU074-TL2-SOFT-3RD-SKUS       PIC 9(05).                     
055300         05  SU074-TL2-SOFT-3RD-UNITS      PIC 9(05).                     
055500         05  SU074-TL2-SOFT-4TH-CRTNS      PIC 9(05).                     
055700         05  SU074-TL2-SOFT-4TH-SKUS       PIC 9(05).                     
055900         05  SU074-TL2-SOFT-4TH-UNITS      PIC 9(05).                     
056100         05  SU074-TL2-SOFT-TOT-CRTNS      PIC 9(05).                     
056300         05  SU074-TL2-SOFT-TOT-SKUS       PIC 9(05).                     
056500         05  SU074-TL2-SOFT-TOT-UNITS      PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
053200***    HANG TOTALS                                                        
053300*                                                                         
001004***    TRAILER DETAIL LINE 3                                              
001004     02  SU074-TRAILER-DETAIL-DATA3 REDEFINES                             
               SU074-TRAILER-DETAIL-DATA2.                                      
053300*                                                                         
057400         05  SU074-TL3-HANG-1ST-CRTNS      PIC 9(05).                     
057600         05  SU074-TL3-HANG-1ST-SKUS       PIC 9(05).                     
057800         05  SU074-TL3-HANG-1ST-UNITS      PIC 9(05).                     
058000         05  SU074-TL3-HANG-2ND-CRTNS      PIC 9(05).                     
058200         05  SU074-TL3-HANG-2ND-SKUS       PIC 9(05).                     
058400         05  SU074-TL3-HANG-2ND-UNITS      PIC 9(05).                     
058600         05  SU074-TL3-HANG-3RD-CRTNS      PIC 9(05).                     
058800         05  SU074-TL3-HANG-3RD-SKUS       PIC 9(05).                     
059000         05  SU074-TL3-HANG-3RD-UNITS      PIC 9(05).                     
059200         05  SU074-TL3-HANG-4TH-CRTNS      PIC 9(05).                     
059400         05  SU074-TL3-HANG-4TH-SKUS       PIC 9(05).                     
059600         05  SU074-TL3-HANG-4TH-UNITS      PIC 9(05).                     
059800         05  SU074-TL3-HANG-TOT-CRTNS      PIC 9(05).                     
060000         05  SU074-TL3-HANG-TOT-SKUS       PIC 9(05).                     
060200         05  SU074-TL3-HANG-TOT-UNITS      PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
053200***    FOLD TOTALS                                                        
053300*                                                                         
001004***    TRAILER DETAIL LINE 4                                              
001004     02  SU074-TRAILER-DETAIL-DATA4 REDEFINES                             
               SU074-TRAILER-DETAIL-DATA3.                                      
053300*                                                                         
057400         05  SU074-TL4-FOLD-1ST-CRTNS      PIC 9(05).                     
057600         05  SU074-TL4-FOLD-1ST-SKUS       PIC 9(05).                     
057800         05  SU074-TL4-FOLD-1ST-UNITS      PIC 9(05).                     
058000         05  SU074-TL4-FOLD-2ND-CRTNS      PIC 9(05).                     
058200         05  SU074-TL4-FOLD-2ND-SKUS       PIC 9(05).                     
058400         05  SU074-TL4-FOLD-2ND-UNITS      PIC 9(05).                     
058600         05  SU074-TL4-FOLD-3RD-CRTNS      PIC 9(05).                     
058800         05  SU074-TL4-FOLD-3RD-SKUS       PIC 9(05).                     
059000         05  SU074-TL4-FOLD-3RD-UNITS      PIC 9(05).                     
059200         05  SU074-TL4-FOLD-4TH-CRTNS      PIC 9(05).                     
059400         05  SU074-TL4-FOLD-4TH-SKUS       PIC 9(05).                     
059600         05  SU074-TL4-FOLD-4TH-UNITS      PIC 9(05).                     
059800         05  SU074-TL4-FOLD-TOT-CRTNS      PIC 9(05).                     
060000         05  SU074-TL4-FOLD-TOT-SKUS       PIC 9(05).                     
060200         05  SU074-TL4-FOLD-TOT-UNITS      PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
064300***    ZERO ON HAND - REPLENISHMENT TOTALS                                
053300*                                                                         
001004***    TRAILER DETAIL LINE 5                                              
001004     02  SU074-TRAILER-DETAIL-DATA5 REDEFINES                             
               SU074-TRAILER-DETAIL-DATA4.                                      
053300*                                                                         
064800         05  SU074-TL5-OH-R-1ST-CRTNS      PIC 9(05).                     
065000         05  SU074-TL5-OH-R-1ST-SKUS       PIC 9(05).                     
065200         05  SU074-TL5-OH-R-1ST-UNITS      PIC 9(05).                     
065400         05  SU074-TL5-OH-R-2ND-CRTNS      PIC 9(05).                     
065600         05  SU074-TL5-OH-R-2ND-SKUS       PIC 9(05).                     
065800         05  SU074-TL5-OH-R-2ND-UNITS      PIC 9(05).                     
066000         05  SU074-TL5-OH-R-3RD-CRTNS      PIC 9(05).                     
066200         05  SU074-TL5-OH-R-3RD-SKUS       PIC 9(05).                     
066400         05  SU074-TL5-OH-R-3RD-UNITS      PIC 9(05).                     
066600         05  SU074-TL5-OH-R-4TH-CRTNS      PIC 9(05).                     
066800         05  SU074-TL5-OH-R-4TH-SKUS       PIC 9(05).                     
067000         05  SU074-TL5-OH-R-4TH-UNITS      PIC 9(05).                     
067200         05  SU074-TL5-OH-R-TOT-CRTNS      PIC 9(05).                     
067400         05  SU074-TL5-OH-R-TOT-SKUS       PIC 9(05).                     
067600         05  SU074-TL5-OH-R-TOT-UNITS      PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
068000***    ZERO ON HAND - NEW TOTALS                                          
053300*                                                                         
001004***    TRAILER DETAIL LINE 6                                              
001004     02  SU074-TRAILER-DETAIL-DATA6 REDEFINES                             
               SU074-TRAILER-DETAIL-DATA5.                                      
053300*                                                                         
064800         05  SU074-TL6-OH-N-1ST-CRTNS      PIC 9(05).                     
065000         05  SU074-TL6-OH-N-1ST-SKUS       PIC 9(05).                     
065200         05  SU074-TL6-OH-N-1ST-UNITS      PIC 9(05).                     
065400         05  SU074-TL6-OH-N-2ND-CRTNS      PIC 9(05).                     
065600         05  SU074-TL6-OH-N-2ND-SKUS       PIC 9(05).                     
065800         05  SU074-TL6-OH-N-2ND-UNITS      PIC 9(05).                     
066000         05  SU074-TL6-OH-N-3RD-CRTNS      PIC 9(05).                     
066200         05  SU074-TL6-OH-N-3RD-SKUS       PIC 9(05).                     
066400         05  SU074-TL6-OH-N-3RD-UNITS      PIC 9(05).                     
066600         05  SU074-TL6-OH-N-4TH-CRTNS      PIC 9(05).                     
066800         05  SU074-TL6-OH-N-4TH-SKUS       PIC 9(05).                     
067000         05  SU074-TL6-OH-N-4TH-UNITS      PIC 9(05).                     
067200         05  SU074-TL6-OH-N-TOT-CRTNS      PIC 9(05).                     
067400         05  SU074-TL6-OH-N-TOT-SKUS       PIC 9(05).                     
067600         05  SU074-TL6-OH-N-TOT-UNITS      PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
071700***    EAS SECURITY TAG NEEDED - TOTALS                                   
 53300*                                                                         
001004***    TRAILER DETAIL LINE 7                                              
001004     02  SU074-TRAILER-DETAIL-DATA7 REDEFINES                             
               SU074-TRAILER-DETAIL-DATA6.                                      
053300*                                                                         
072200         05  SU074-TL7-EAS-1ST-CRTNS       PIC 9(05).                     
072400         05  SU074-TL7-EAS-1ST-SKUS        PIC 9(05).                     
072600         05  SU074-TL7-EAS-1ST-UNITS       PIC 9(05).                     
072800         05  SU074-TL7-EAS-2ND-CRTNS       PIC 9(05).                     
073000         05  SU074-TL7-EAS-2ND-SKUS        PIC 9(05).                     
073200         05  SU074-TL7-EAS-2ND-UNITS       PIC 9(05).                     
073400         05  SU074-TL7-EAS-3RD-CRTNS       PIC 9(05).                     
073600         05  SU074-TL7-EAS-3RD-SKUS        PIC 9(05).                     
073800         05  SU074-TL7-EAS-3RD-UNITS       PIC 9(05).                     
074000         05  SU074-TL7-EAS-4TH-CRTNS       PIC 9(05).                     
074200         05  SU074-TL7-EAS-4TH-SKUS        PIC 9(05).                     
074400         05  SU074-TL7-EAS-4TH-UNITS       PIC 9(05).                     
074600         05  SU074-TL7-EAS-TOT-CRTNS       PIC 9(05).                     
074800         05  SU074-TL7-EAS-TOT-SKUS        PIC 9(05).                     
075000         05  SU074-TL7-EAS-TOT-UNITS       PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
075400***    CLEARANCE - TOTALS                                                 
053300*                                                                         
001004***    TRAILER DETAIL LINE 8                                              
001004     02  SU074-TRAILER-DETAIL-DATA8 REDEFINES                             
               SU074-TRAILER-DETAIL-DATA7.                                      
053300*                                                                         
075900         05  SU074-TL8-CLRNC-1ST-CRTNS     PIC 9(05).                     
076100         05  SU074-TL8-CLRNC-1ST-SKUS      PIC 9(05).                     
076300         05  SU074-TL8-CLRNC-1ST-UNITS     PIC 9(05).                     
076500         05  SU074-TL8-CLRNC-2ND-CRTNS     PIC 9(05).                     
076700         05  SU074-TL8-CLRNC-2ND-SKUS      PIC 9(05).                     
076900         05  SU074-TL8-CLRNC-2ND-UNITS     PIC 9(05).                     
077100         05  SU074-TL8-CLRNC-3RD-CRTNS     PIC 9(05).                     
077300         05  SU074-TL8-CLRNC-3RD-SKUS      PIC 9(05).                     
077500         05  SU074-TL8-CLRNC-3RD-UNITS     PIC 9(05).                     
077700         05  SU074-TL8-CLRNC-4TH-CRTNS     PIC 9(05).                     
077900         05  SU074-TL8-CLRNC-4TH-SKUS      PIC 9(05).                     
078100         05  SU074-TL8-CLRNC-4TH-UNITS     PIC 9(05).                     
078300         05  SU074-TL8-CLRNC-TOT-CRTNS     PIC 9(05).                     
078500         05  SU074-TL8-CLRNC-TOT-SKUS      PIC 9(05).                     
078700         05  SU074-TL8-CLRNC-TOT-UNITS     PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
053100*                                                                         
075400***    GRAND TOTALS                                                       
053300*                                                                         
001004***    TRAILER DETAIL LINE 9                                              
001004     02  SU074-TRAILER-DETAIL-DATA9 REDEFINES                             
               SU074-TRAILER-DETAIL-DATA8.                                      
053300*                                                                         
079600         05  SU074-TL9-GRAND-1ST-CRTNS     PIC 9(05).                     
079800         05  SU074-TL9-GRAND-1ST-SKUS      PIC 9(05).                     
080000         05  SU074-TL9-GRAND-1ST-UNITS     PIC 9(05).                     
080200         05  SU074-TL9-GRAND-2ND-CRTNS     PIC 9(05).                     
080400         05  SU074-TL9-GRAND-2ND-SKUS      PIC 9(05).                     
080600         05  SU074-TL9-GRAND-2ND-UNITS     PIC 9(05).                     
080800         05  SU074-TL9-GRAND-3RD-CRTNS     PIC 9(05).                     
081000         05  SU074-TL9-GRAND-3RD-SKUS      PIC 9(05).                     
081200         05  SU074-TL9-GRAND-3RD-UNITS     PIC 9(05).                     
081400         05  SU074-TL9-GRAND-4TH-CRTNS     PIC 9(05).                     
081600         05  SU074-TL9-GRAND-4TH-SKUS      PIC 9(05).                     
081800         05  SU074-TL9-GRAND-4TH-UNITS     PIC 9(05).                     
082000         05  SU074-TL9-GRAND-TOT-CRTNS     PIC 9(05).                     
082200         05  SU074-TL9-GRAND-TOT-SKUS      PIC 9(05).                     
082400         05  SU074-TL9-GRAND-TOT-UNITS     PIC 9(05).                     
001004         05  FILLER                        PIC X(25).                     
