000100******************************************************************00010001
000200*                         SURD044                                *00020001
000300*                                                                *00030001
000400*   THIS IS THE SML EXTRACT FILE FOR CARTONS CREATED AND NOT     *00040001
000500*   MANIFESTED TO A TRAILER                                      *00050001
000600*                                                                *00060001
000700**  LENGTH:  400               USED IN JOBS SUK065,066,067       *00070011
000800******************************************************************00080001
000900 01  SU044-EXTRACT-RECORD.                                        00090001
001000     05  SU044-ORGN-LOC-NBR            PIC S9(04)  VALUE ZEROES.  00100005
001000     05  SU044-DEST-LOC-NBR            PIC S9(04)  VALUE ZEROES.  00101009
001100     05  SU044-SHIPT-UNT-ID            PIC S9(18)  VALUE ZEROES.  00110001
001200     05  SU044-CART-SRC-CDE            PIC  X(03)  VALUE SPACES.  00120001
001300     05  SU044-CRTN-STATUS             PIC  X(02)  VALUE SPACES.  00130001
001400     05  SU044-CRE-DATE                PIC  X(10)  VALUE SPACES.  00140001
001500     05  SU044-CRE-TIME                PIC  X(08)  VALUE SPACES.  00150001
002900     05  SU044-NEW-STR-IND             PIC  X(01)  VALUE SPACES.  00151010
003000         88  SU044-NEW-STR-YES                     VALUE 'Y'.     00152010
003100         88  SU044-NEW-STR-NO                      VALUE ' '.     00153012
001600*                                                                 00160003
001700     05  SU044-P2L-BEG-TMST            PIC  X(26)  VALUE SPACES.  00170003
001800     05  SU044-P2L-END-TMST            PIC  X(26)  VALUE SPACES.  00180003
001810     05  SU044-JWL-BEG-TMST            PIC  X(26)  VALUE SPACES.  00181006
001820     05  SU044-JWL-END-TMST            PIC  X(26)  VALUE SPACES.  00182006
001900     05  SU044-OTHER-BEG-TMST          PIC  X(26)  VALUE SPACES.  00190003
002000     05  SU044-OTHER-END-TMST          PIC  X(26)  VALUE SPACES.  00200004
002010     05  SU044-FLAT-BEG-TMST           PIC  X(26)  VALUE SPACES.  00201008
002020     05  SU044-FLAT-END-TMST           PIC  X(26)  VALUE SPACES.  00202008
002100*                                                                 00210003
002200     05  FILLER                       PIC  X(142)  VALUE SPACES.  00220011
