000100******************************************************************00010000
000200**                        SURD021                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE COMMAREA PASSED TO THE SUKCS583, USED TO        **00040000
000500**  DETERMINE IF A CARTON NEEDS TO BE AUDITED.                  **00050000
000300**                                                              **00050100
000500**  THIS COMMAREA IS ALSO PASSED TO SUKCS720, USED TO DETERMINE **00051001
000500**  IF CARTON NEEDS TO BE RFID AUDITED.                         **00052000
000600**  LENGTH:  150 BYTES                                          **00060000
000700******************************************************************00070000
000800 01  SU021-CARTON-AUDIT-RECORD.                                   00080000
000810     05 SU021-AUDIT-REQUEST-TYPE        PIC  X(01).               00081000
000820         88 SU021-CARTON-CHECK-IN      VALUE 'C'.                 00082000
000830         88 SU021-CARTON-AUDIT         VALUE 'A'.                 00083000
000900     05 SU021-PO-NUMBER                 PIC S9(09).               00084000
001000     05 SU021-LINE-NBR                  PIC S9(09).               00085000
001001     05 SU021-DRIVER-LINE-NBR           PIC S9(09).               00086000
001010     05 SU021-PRE-PACK-ID               PIC S9(04).               00087000
001100     05 SU021-PACKAGE-TYPE-CODE         PIC  X(02).               00088000
001200     05 SU021-OPER-UNT-ID               PIC S9(04).               00089000
001300     05 SU021-REC-SEQ-NBR               PIC S9(09).               00090000
001400     05 SU021-INBOUND-TRIP-ID           PIC S9(09).               00100000
001410     05 SU021-SHIPT-UNT-ID              PIC S9(18)V COMP-3.       00110000
001420     05 SU021-USER-ID                   PIC  X(08).               00120000
001430     05 SU021-DEFERRED-AUDIT-IND        PIC  X(01).               00130000
001500     05 SU021-AUDIT-REQUIRED-SW         PIC  X(01).               00140000
001501     05 SU021-AUDIT-NUMBER              PIC S9(09).               00150000
001510     05 SU021-AUDIT-VALIDATION-SW       PIC  X(01).               00151000
001520         88 SU021-INVALID-REQUEST       VALUE 'I'.                00152000
001530         88 SU021-DB2-ERROR             VALUE 'D'.                00153000
001540         88 SU021-AUDIT-REQUIRED        VALUE 'Q'.                00154000
001541         88 SU021-100-PC-AUDIT-REQD     VALUE '%'.                00154100
001550         88 SU021-REWORK                VALUE 'R'.                00154200
001570         88 SU021-AUDIT-PENDING         VALUE 'U'.                00154300
001580         88 SU021-AUDIT-IS-COMPLETE     VALUE ' '.                00154400
001590     05 SU021-PRINT-APPLY-SW            PIC  X(01).               00154500
001591         88 SU021-PRINT-APPLY           VALUE 'Y'.                00154600
001500     05 SU021-RFID-AUDIT-REQUIRED-SW    PIC  X(01).               00154700
001501     05 SU021-RFID-AUDIT-NUMBER         PIC S9(09).               00154800
001510     05 SU021-RFID-AUDIT-VALIDATION-SW  PIC  X(01).               00154900
001520         88 SU021-RFID-INVALID-REQUEST   VALUE 'I'.               00155000
001530         88 SU021-RFID-DB2-ERROR         VALUE 'D'.               00155100
001540         88 SU021-RFID-AUDIT-REQUIRED    VALUE 'Q'.               00155200
001541         88 SU021-RFID-100-PC-AUDIT-REQD VALUE '%'.               00155300
001550         88 SU021-RFID-REWORK            VALUE 'R'.               00155400
001570         88 SU021-RFID-AUDIT-PENDING     VALUE 'U'.               00155500
001580         88 SU021-RFID-AUDIT-IS-COMPLETE VALUE ' '.               00155600
001600     05 FILLER                          PIC  X(52).               00156000
