       01  SU140-GET-MSTR-CRTN-DETAILS.                                         
           05  SU140-CARTON-ID        PIC S9(18)V COMP-3.                       
           05  SU140-LAST-CARTON      PIC S9(18)V COMP-3.                       
           05  SU140-LAST-UPC-NBR     PIC S9(15)V COMP-3.                       
