000100******************************************************************00010001
000200**                        SURD038                               **00020001
000500**  SU PO ARCHIVE REQUEST LAYOUT                                **00050012
000600**  LENGTH: 173                                                 **00060012
000700**                                                              **00070001
000800******************************************************************00080001
000900 01  SU038-EXTRACT-RECORD.                                        00090001
001000     05 SU038-SHIPT-UNT-ID           PIC S9(18)V COMP-3.          00100006
001100     05 SU038-PO-NBR                 PIC S9(09) COMP.             00110006
001110     05 SU038-REC-SEQ-NBR            PIC S9(09) COMP.             00111006
001111     05 SU038-TRIP-ID                PIC S9(9) COMP.              00111106
001112     05 SU038-BUILD-DATE.                                         00111206
001113        10 SU038-BLD-YY              PIC X(04).                   00111306
001114        10 FILLER                    PIC X(01).                   00111406
001115        10 SU038-BLD-MM              PIC X(02).                   00111506
001116        10 FILLER                    PIC X(01).                   00111606
001117        10 SU038-BLD-DD              PIC X(02).                   00111706
001120     05 SU038-ORGN-OPER-UNT-ID       PIC S9(4) COMP.              00112006
001130     05 SU038-DEST-OPER-UNT-ID       PIC S9(4) COMP.              00113006
001131     05 SU038-SHIPT-UNT-SRC-ID       PIC X(03).                   00113106
001132     05 SU038-ACTV-IND               PIC X(01).                   00113206
001150     05 SU038-CRE-DTE.                                            00115006
001152        10 SU038-CRE-YY              PIC  X(04).                  00115206
001153        10 FILLER                    PIC  X(01).                  00115301
001154        10 SU038-CRE-MM              PIC  X(02).                  00115406
001155        10 FILLER                    PIC  X(01).                  00115501
001156        10 SU038-CRE-DD              PIC  X(02).                  00115606
001157     05 SU038-CRE-TM.                                             00115706
001158        10 SU038-CRE-HRS             PIC  X(02).                  00115806
001159        10 FILLER                    PIC  X(01).                  00115906
001160        10 SU038-CRE-MIN             PIC  X(02).                  00116006
001161        10 FILLER                    PIC  X(01).                  00116106
001162        10 SU038-CRE-SEC             PIC  X(02).                  00116206
001163     05 SU038-CRE-USR-ID             PIC X(08).                   00116306
001164     05 SU038-CRE-PGM-NM             PIC X(08).                   00116406
001165     05 SU038-TRN-NBR                PIC S9(9)   COMP.            00116506
001166     05 SU038-TRN-LNE-NBR            PIC S9(9)   COMP.            00116606
001167     05 SU038-TRN-TYP-CDE            PIC X(02).                   00116706
001168     05 SU038-UPC-NBR                PIC S9(15)V COMP-3.          00116806
001169     05 SU038-SHPD-QTY               PIC S9(9)V  COMP-3.          00116906
001300     05 SU038-TK-NBR                 PIC X(08).                   00130004
001310     05 SU038-REQ-OPER-ID            PIC S9(4).                   00131008
001320     05 SU038-REQ-DEST-ID            PIC S9(4).                   00132008
001400     05 SU038-REQ-DATE.                                           00140004
001401        10 SU038-REQ-YY              PIC X(04).                   00140104
001402        10 FILLER                    PIC X(01).                   00140204
001403        10 SU038-REQ-MM              PIC X(02).                   00140304
001404        10 FILLER                    PIC X(01).                   00140404
001405        10 SU038-REQ-DD              PIC X(02).                   00140504
001406     05 SU038-REQ-TIME.                                           00140604
001407        10 SU038-REQ-HRS             PIC X(02).                   00140704
001408        10 FILLER                    PIC X(01).                   00140804
001409        10 SU038-REQ-MIN             PIC X(02).                   00140904
001410        10 FILLER                    PIC X(01).                   00141004
001411        10 SU038-REQ-SEC             PIC X(02).                   00141104
001413     05 FILLER                       PIC X(42).                   00141310
