000100******************************************************************00010000
000200**                        SURD133                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT TO BE USED TO DETERMINE THE NUMBER OF   **00040000
000500**  CARTONS DIVERTED OR SCANNED ONTO AN OUTBOUND TRAILER.       **00050000
001200**  LENGTH:   75 BYTES                                          **00120000
001300******************************************************************00130000
001400 05  SU133-EXTRACT-RECORD.                                        00140000
001410*                                                                 00141000
001440     10  SU133-OPER-UNT-ID             PIC   9(04).               00144000
001441     10  FILLER                        PIC   X(01).               00144100
001450     10  SU133-STORE-DEST              PIC   9(04).               00145000
001451     10  FILLER                        PIC   X(01).               00145100
001460     10  SU133-TRIP-ID                 PIC   9(09).               00146000
001461     10  FILLER                        PIC   X(01).               00146100
001462     10  SU133-TRAILER-COUNT           PIC   9(09).               00146201
001463     10  FILLER                        PIC   X(01).               00146300
001480     10  SU133-DIVERT-COUNT            PIC   9(09).               00148000
001481     10  FILLER                        PIC   X(01).               00148100
001490     10  SU133-SCANON-COUNT            PIC   9(09).               00149000
001510     10  FILLER                        PIC   X(26).               00151001
001600*                                                                 00160000
