000100******************************************************************00010000
000200**                        SURD073                               **00020001
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT FOR THE SHIPING UNIT REPORTS     **00040000
000500**  LENGTH:  50 BYTES                                          ** 00050001
000900******************************************************************00090000
001000 01  SU073-EXTRACT-RECORD.                                        00100001
001300     05  SU073-PO-NBR                   PIC S9(09) COMP.          00130001
001400     05  SU073-REC-SEQ-NBR              PIC S9(09) COMP.          00140001
003100     05  FILLER                         PIC X(42).                00310002
