000100******************************************************************00010000
000200**                        SURD168                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT OF THE FILE CREATED IN SUK950            **00040000
000600**  LENGTH: 100  BYTES                                          **00060000
000700******************************************************************00070000
000800 01  SU168-EXTRACT-RECORD.                                        00080004
001000     05  FILLER               PIC   X(13)  VALUE 'STATUS OPER: '. 00100009
001001     05  SU168-STATUS-OPER    PIC   9(04).                        00100106
001010     05  FILLER               PIC   X(3)   VALUE SPACES.          00101010
001011     05  FILLER               PIC   X(06)  VALUE 'CODE: '.        00101111
001020     05  SU168-TRIP-STAT-CDE  PIC   X(02).                        00102006
001030     05  FILLER               PIC   X(3)   VALUE SPACES.          00103010
001040     05  FILLER               PIC   X(11)  VALUE 'DATE/TIME: '.   00104009
001060     05  SU168-STATUS-DATE    PIC   X(10).                        00106006
001070     05  FILLER               PIC   X      VALUE SPACE.           00107010
001080     05  SU168-STATUS-TIME    PIC   X(05).                        00108006
001081     05  FILLER               PIC   X(3)   VALUE SPACES.          00108110
001082     05  FILLER               PIC   X(08)  VALUE 'USERID: '.      00108209
001090     05  SU168-STATUS-USERID  PIC   X(07).                        00109006
001100     05  FILLER               PIC   X(24)  VALUE SPACES.          00110011
