      ******************************************************************        
      * THIS COPYBOOK USED IN A WEBSERVICE GETOUTBOUNDTRIPID                    
      * PLEASE CHECK IN CICS WEBSERVICE PLAYBOOK FOR STEPS TO FOLLOW            
      * FOR MAKING CHANGES TO THIS COPYBOOK LAYOUT                              
      ******************************************************************        
       01  SU114-OUT-OUTBOUND-TRIP.                                             
          05  SU114-OTBND-TRP-ID          PIC 9(09)   VALUE ZEROES.             
          05  SU114-STORE-NBR             PIC X(04)   VALUE SPACES.             
          05  SU114-TRLR-SRL-NBR          PIC 9(09)   VALUE ZEROES.             
          05  SU114-TRLR-STATUS           PIC X(02)   VALUE SPACES.             
          05  SU114-TRLR-TMST             PIC X(19)   VALUE SPACES.             
          05  SU114-TRAILER-ID            PIC X(12)   VALUE SPACES.             
          05  SU114-TRLR-SCAC-CDE         PIC X(04)   VALUE SPACES.             
          05  SU114-MSG-ID                PIC X(06)   VALUE SPACES.             
          05  SU114-MSG-TEXT              PIC X(50)   VALUE SPACES.             
          05  SU114-SHIP-NODE             PIC X(04)   VALUE SPACES.             
