000100******************************************************************00010000
000200**                        SURD003                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT FOR THE VENDOR OVER/SHORT FILE   **00040000
000500**  USED IN THE AUDIT SUMMARY EXTRACT                           **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800 05  SU003-EXTRACT-RECORD.                                        00080000
000801     10  SU003-AUD-CNTL-NBR            PIC  S9(09)    COMP.       00080100
000802     10  SU003-SHIPT-UNT-ID            PIC  S9(18)V   COMP-3.     00080201
000803     10  SU003-DEST-OPER-UNT-ID        PIC  S9(04)    COMP.       00080300
000804     10  SU003-PO-NBR                  PIC  S9(09)    COMP.       00080402
000805     10  SU003-REC-SEQ-NBR             PIC  S9(09)    COMP.       00080502
000806     10  SU003-UPC                     PIC  S9(15)    COMP-3.     00080602
000807     10  SU003-SCN-TMST                PIC  X(26).                00080702
000808     10  SU003-QTY-EXP                 PIC  S9(09)    COMP-3.     00080802
000809     10  SU003-QTY-AUD                 PIC  S9(09)    COMP-3.     00080902
000810     10  SU003-SKU-NBR.                                           00081005
000820         15  SU003-SKU-DEPT-NBR        PIC   X(03).               00084205
000830         15  SU003-SKU-CL-NBR          PIC   X(02).               00084305
000810         15  SU003-SKU-NMBR            PIC   9(08).               00084405
000850     10  SU003-PICK-ERR-CNT            PIC  S9(09)    COMP-3.     00085002
000860     10  SU003-UNT-ERR-CNT-COMBO       PIC  S9(09)    COMP-3.     00086002
000870     10 SU003-ORDER-TYPE-IND           PIC   X(01).               00087002
000880        88 SU003-PBS-ORDER             VALUE 'P'.                 00088002
000890        88 SU003-CASEPACK-ORDER        VALUE 'C'.                 00089002
000900     10  SU003-TOT-ERR-QTY             PIC  S9(09)    COMP-3.     00090002
001000     10 SU003-EXTRACT-TYPE             PIC   X(01).               00100002
001100        88 SU003-AUDIT-EXTRACT         VALUE 'A'.                 00110002
001101        88 SU003-CARTON-EXTRACT        VALUE 'C'.                 00110102
001102     10  SU003-AUD-OPER-UNT-ID         PIC  S9(04)    COMP.       00110200
001103     10  SU003-INTR-UPC-ID             PIC  S9(15)    COMP-3.     00110302
           10  SU003-AUD-CAT-CDE             PIC   X(04).               00110406
              88 SU003-QC-AUDIT              VALUE 'QC  '.              00110506
              88 SU003-RFID-AUDIT            VALUE 'RFID'.              00110607
001104 05  FILLER                            PIC   X(88).               00110706
