000010******************************************************************00001000
000020**                        SURD174                               **00002000
000030**                                                              **00003000
000040**  THIS IS THE LAYOUT FOR THE UPDATE OF OLD OUTBOUND TRIPS     **00004001
000042**  LENGTH: 200  BYTES                                          **00004203
000043**                                                              **00004300
000044******************************************************************00004400
000045 01  SU174-TRIP-RECORD.                                           00004501
000046     05  SU174-OTBND-TRIP-ID          PIC S9(09) COMP.            00004600
000047     05  SU174-ORIG-OPER              PIC S9(04) COMP.            00004700
000048     05  SU174-DEST-OPER              PIC S9(04) COMP.            00004800
000049     05  SU174-TRLR-SRL-NBR           PIC S9(09) COMP.            00004900
000050     05  SU174-DOOR-TYPE              PIC  X(02).                 00005000
000060         88  SU174-SHIPPING-DOOR                 VALUE 'SH'.      00006000
000070         88  SU174-SHUTTLE-DOOR                  VALUE 'DS'.      00007000
000080         88  SU174-STORAGE-DOOR                  VALUE 'ST'.      00008000
000090     05  SU174-STATUS-TMST            PIC  X(26).                 00009004
000100     05  SU174-TRIP-STATUS            PIC  X(02).                 00010000
000200         88  SU174-DC-OPEN                       VALUE 'DO'.      00020000
000300         88  SU174-DC-CLOSE                      VALUE 'DC'.      00030000
000400         88  SU174-DC-AUDIT-OPEN                 VALUE 'AO'.      00040000
000600         88  SU174-DC-AUDIT-KEEP                 VALUE 'AK'.      00060002
000700         88  SU174-DC-SHIPPED                    VALUE 'DS'.      00070000
000800         88  SU174-DC-STORE-OPEN                 VALUE 'SO'.      00080000
000900     05  SU174-STATUS-OPER            PIC S9(04) COMP.            00090000
001000     05  SU174-STATUS-USR-ID          PIC  X(08).                 00100000
001100     05  SU174-TRLR-SEAL              PIC  X(20).                 00110000
001200     05  SU174-DOOR-ID                PIC  X(04).                 00120000
001300     05  SU174-UNT-QTY                PIC S9(09) COMP.            00130000
001400     05  SU174-SKU-QTY                PIC S9(04) COMP.            00140000
001500     05  SU174-CART-QTY               PIC S9(04) COMP.            00150000
001510*                                                                 00151003
001600     05  SU174-STATUS-TMST-1DAYS      PIC  X(26).                 00160004
001610*                                                                 00161003
001620     05  SU174-STATUS-TMST-2DAYS      PIC  X(26).                 00162004
001630*                                                                 00163003
001640     05  SU174-STATUS-TMST-3DAYS      PIC  X(26).                 00164004
001700*                                                                 00170003
001800     05  FILLER                       PIC  X(38).                 00180003
