000100 01  SU026-STA-WRKR-REC.                                                  
000200     05  SU026-OPER-UNT-ID                PIC S9(4) COMP.                 
000300     05  SU026-ACM-LBL-STA-NBR            PIC S9(9) COMP.                 
000400     05  SU026-DOOR-ID                    PIC X(4).                       
000500     05  SU026-INBD-TRIP-ID               PIC S9(9) COMP.                 
000600     05  SU026-ASGD-STRT-TMST             PIC X(26).                      
000700     05  SU026-WRKR-STRT-TMST             PIC X(26).                      
000800     05  SU026-WRKR-END-TMST              PIC X(26).                      
000900     05  SU026-WRKR-USR-ID                PIC X(8).                       
001000     05  SU026-CRE-BY-USR-ID              PIC X(8).                       
001100     05  SU026-CRE-TMST                   PIC X(26).                      
001200     05  SU026-UPDATE-BY-USERID           PIC X(8).                       
001300     05  SU026-UPDATE-TIMESTAMP           PIC X(26).                      
