000100*********** ******************************************************00010002
000200**  SURD130                                                     **00020002
000210**                                                              **00021002
000220**  SUMMARY BY OUTBOUND TRIP - DC LEVEL                         **00022002
000230**  LENGTH:  1250 BYTES                                         **00023002
000240******************************************************************00024002
000250 05  SU130-EXTRACT-RECORD.                                        00025002
000260*                                                                 00026002
000270     10  SU130-OPER-UNT-ID             PIC   9(04).               00027002
000271     10  SU130-COMMA-001               PIC   X(01).               00027102
000272     10  SU130-SML-SRC-CDE             PIC   X(03).               00027202
000273     10  SU130-COMMA-002               PIC   X(01).               00027302
000274     10  SU130-INPUT-RECORD-COUNT      PIC   9(18)-.              00027402
000277     10  SU130-COMMA-003               PIC   X(01).               00027702
000278*                                                                 00027802
000279     10  SU130-TRIP-OPEN-TO-CLOSE-MIN  PIC   9(18)-.              00027902
000280     10  SU130-COMMA-004               PIC   X(01).               00028002
000281     10  SU130-TRIP-CLOSE-TO-SHIP-MIN  PIC   9(18)-.              00028102
000282     10  SU130-COMMA-005               PIC   X(01).               00028202
000290     10  SU130-TRIP-OPEN-TO-SHIP-MIN   PIC   9(18)-.              00029002
000300     10  SU130-COMMA-006               PIC   X(01).               00030002
000400*                                                                 00040002
001000*** MINUTES                                                       00100002
001100*                                                                 00110002
001200     10  SU130-ARRIVE-TO-PRC-MIN       PIC   9(18)-.              00120002
001300     10  SU130-COMMA-007               PIC   X(01).               00130002
001400     10  SU130-ARRIVE-TO-P2L-PKD-MIN   PIC   9(18)-.              00140002
001410     10  SU130-COMMA-008               PIC   X(01).               00141002
001420     10  SU130-PRC-TO-P2L-PKD-MIN      PIC   9(18)-.              00142002
001430     10  SU130-COMMA-009               PIC   X(01).               00143003
001440     10  SU130-P2L-PKD-TO-CLOSE-MIN    PIC   9(18)-.              00144002
001450     10  SU130-COMMA-010               PIC   X(01).               00145002
001460     10  SU130-P2L-OPEN-TO-CLOSE-MIN   PIC   9(18)-.              00146002
001470     10  SU130-COMMA-011               PIC   X(01).               00147002
001480     10  SU130-P2L-OPEN-TO-OTBND-MIN   PIC   9(18)-.              00148002
001490     10  SU130-COMMA-012               PIC   X(01).               00149002
001500     10  SU130-P2L-CLOSE-TO-OTBND-MIN  PIC   9(18)-.              00150002
001600     10  SU130-COMMA-013               PIC   X(01).               00160002
001700     10  SU130-ARRIVE-TO-OTBND-MIN     PIC   9(18)-.              00170002
001800     10  SU130-COMMA-014               PIC   X(01).               00180002
001900     10  SU130-PRC-TO-OTBND-MIN        PIC   9(18)-.              00190002
002000     10  SU130-COMMA-015               PIC   X(01).               00200002
002100     10  SU130-ARRIVE-TO-TCLOS-MIN     PIC   9(18)-.              00210002
002110     10  SU130-COMMA-016               PIC   X(01).               00211002
002120     10  SU130-ARRIVE-TO-SHIP-MIN      PIC   9(18)-.              00212002
002130     10  SU130-COMMA-017               PIC   X(01).               00213002
002140     10  SU130-P2L-OPEN-TO-TCLOS-MIN   PIC   9(18)-.              00214002
002150     10  SU130-COMMA-018               PIC   X(01).               00215002
002160     10  SU130-P2L-OPEN-TO-SHIP-MIN    PIC   9(18)-.              00216002
002170     10  SU130-COMMA-019               PIC   X(01).               00217002
002180     10  SU130-P2L-CLOSE-TO-TCLOS-MIN  PIC   9(18)-.              00218002
002190     10  SU130-COMMA-020               PIC   X(01).               00219002
002200     10  SU130-P2L-CLOSE-TO-SHIP-MIN   PIC   9(18)-.              00220002
002300     10  SU130-COMMA-021               PIC   X(01).               00230002
002400     10  SU130-ARRIVE-TO-MSTR-MIN      PIC   9(18)-.              00240002
002500     10  SU130-COMMA-022               PIC   X(01).               00250002
002600     10  SU130-PRC-TO-MSTR-MIN         PIC   9(18)-.              00260002
002700     10  SU130-COMMA-023               PIC   X(01).               00270002
002800     10  SU130-MSTR-CRE-TO-OTBND-MIN   PIC   9(18)-.              00280002
002900     10  SU130-COMMA-024               PIC   X(01).               00290002
003000     10  SU130-MSTR-CRE-TO-TCLOS-MIN   PIC   9(18)-.              00300002
003010     10  SU130-COMMA-025               PIC   X(01).               00301002
003020     10  SU130-MSTR-CRE-TO-SHIP-MIN    PIC   9(18)-.              00302002
003030     10  SU130-COMMA-026               PIC   X(01).               00303002
003040     10  SU130-MSTR-FIRST-TO-OTBND-MIN PIC   9(18)-.              00304002
003050     10  SU130-COMMA-027               PIC   X(01).               00305002
003060     10  SU130-MSTR-FIRST-TO-TCLOS-MIN PIC   9(18)-.              00306002
003070     10  SU130-COMMA-028               PIC   X(01).               00307002
003080     10  SU130-MSTR-FIRST-TO-SHIP-MIN  PIC   9(18)-.              00308002
003090     10  SU130-COMMA-029               PIC   X(01).               00309002
003100     10  SU130-MSTR-LAST-TO-OTBND-MIN  PIC   9(18)-.              00310002
003200     10  SU130-COMMA-030               PIC   X(01).               00320002
003300     10  SU130-MSTR-LAST-TO-TCLOS-MIN  PIC   9(18)-.              00330002
003400     10  SU130-COMMA-031               PIC   X(01).               00340002
003500     10  SU130-MSTR-LAST-TO-SHIP-MIN   PIC   9(18)-.              00350002
003600     10  SU130-COMMA-032               PIC   X(01).               00360002
003700     10  SU130-ON-OTBND-TO-CLOS-MIN    PIC   9(18)-.              00370002
003710     10  SU130-COMMA-033               PIC   X(01).               00371002
003720     10  SU130-ON-OTBND-TO-SHIP-MIN    PIC   9(18)-.              00372002
003730     10  SU130-COMMA-034               PIC   X(01).               00373002
003740*                                                                 00374002
003750* INPUT RECORD COUNT                                              00375002
003760*                                                                 00376002
003770     10  SU130-ARRIVE-TO-PRC-CNT       PIC   9(18)-.              00377002
003780     10  SU130-COMMA-035               PIC   X(01).               00378002
003790     10  SU130-ARRIVE-TO-P2L-PKD-CNT   PIC   9(18)-.              00379002
003800     10  SU130-COMMA-036               PIC   X(01).               00380002
003900     10  SU130-PRC-TO-P2L-PKD-CNT      PIC   9(18)-.              00390002
004000     10  SU130-COMMA-037               PIC   X(01).               00400002
004100     10  SU130-P2L-PKD-TO-CLOSE-CNT    PIC   9(18)-.              00410002
004200     10  SU130-COMMA-038               PIC   X(01).               00420002
004300     10  SU130-P2L-OPEN-TO-CLOSE-CNT   PIC   9(18)-.              00430002
004400     10  SU130-COMMA-039               PIC   X(01).               00440002
004500     10  SU130-P2L-OPEN-TO-OTBND-CNT   PIC   9(18)-.              00450002
004600     10  SU130-COMMA-040               PIC   X(01).               00460002
004610     10  SU130-P2L-CLOSE-TO-OTBND-CNT  PIC   9(18)-.              00461002
004620     10  SU130-COMMA-041               PIC   X(01).               00462002
004630     10  SU130-ARRIVE-TO-OTBND-CNT     PIC   9(18)-.              00463002
004640     10  SU130-COMMA-042               PIC   X(01).               00464002
004650     10  SU130-PRC-TO-OTBND-CNT        PIC   9(18)-.              00465002
004660     10  SU130-COMMA-043               PIC   X(01).               00466002
004670     10  SU130-ARRIVE-TO-TCLOS-CNT     PIC   9(18)-.              00467002
004680     10  SU130-COMMA-044               PIC   X(01).               00468002
004690     10  SU130-ARRIVE-TO-SHIP-CNT      PIC   9(18)-.              00469002
004700     10  SU130-COMMA-045               PIC   X(01).               00470002
004800     10  SU130-P2L-OPEN-TO-TCLOS-CNT   PIC   9(18)-.              00480002
004900     10  SU130-COMMA-046               PIC   X(01).               00490002
005000     10  SU130-P2L-OPEN-TO-SHIP-CNT    PIC   9(18)-.              00500002
005100     10  SU130-COMMA-047               PIC   X(01).               00510002
005200     10  SU130-P2L-CLOSE-TO-TCLOS-CNT  PIC   9(18)-.              00520002
005300     10  SU130-COMMA-048               PIC   X(01).               00530002
005400     10  SU130-P2L-CLOSE-TO-SHIP-CNT   PIC   9(18)-.              00540002
005410     10  SU130-COMMA-049               PIC   X(01).               00541002
005420     10  SU130-ARRIVE-TO-MSTR-CNT      PIC   9(18)-.              00542002
005430     10  SU130-COMMA-050               PIC   X(01).               00543002
005440     10  SU130-PRC-TO-MSTR-CNT         PIC   9(18)-.              00544002
005450     10  SU130-COMMA-051               PIC   X(01).               00545002
005460     10  SU130-MSTR-CRE-TO-OTBND-CNT   PIC   9(18)-.              00546002
005470     10  SU130-COMMA-052               PIC   X(01).               00547002
005480     10  SU130-MSTR-CRE-TO-TCLOS-CNT   PIC   9(18)-.              00548002
005490     10  SU130-COMMA-053               PIC   X(01).               00549002
005500     10  SU130-MSTR-CRE-TO-SHIP-CNT    PIC   9(18)-.              00550002
005600     10  SU130-COMMA-054               PIC   X(01).               00560002
005700     10  SU130-MSTR-FIRST-TO-OTBND-CNT PIC   9(18)-.              00570002
005800     10  SU130-COMMA-055               PIC   X(01).               00580002
005900     10  SU130-MSTR-FIRST-TO-TCLOS-CNT PIC   9(18)-.              00590002
006000     10  SU130-COMMA-056               PIC   X(01).               00600002
006100     10  SU130-MSTR-FIRST-TO-SHIP-CNT  PIC   9(18)-.              00610002
006200     10  SU130-COMMA-057               PIC   X(01).               00620002
006300     10  SU130-MSTR-LAST-TO-OTBND-CNT  PIC   9(18)-.              00630002
006310     10  SU130-COMMA-058               PIC   X(01).               00631002
006320     10  SU130-MSTR-LAST-TO-TCLOS-CNT  PIC   9(18)-.              00632002
006330     10  SU130-COMMA-059               PIC   X(01).               00633002
006340     10  SU130-MSTR-LAST-TO-SHIP-CNT   PIC   9(18)-.              00634002
006350     10  SU130-COMMA-060               PIC   X(01).               00635002
006360     10  SU130-ON-OTBND-TO-CLOS-CNT    PIC   9(18)-.              00636002
006370     10  SU130-COMMA-061               PIC   X(01).               00637002
006380     10  SU130-ON-OTBND-TO-SHIP-CNT    PIC   9(18)-.              00638002
006390     10  SU130-COMMA-062               PIC   X(01).               00639002
006400*                                                                 00640002
006410     10  SU130-TRIP-OPEN-TO-CLOSE-CNT  PIC   9(18)-.              00641004
006420     10  SU130-COMMA-063               PIC   X(01).               00642004
006430     10  SU130-TRIP-CLOSE-TO-SHIP-CNT  PIC   9(18)-.              00643004
006440     10  SU130-COMMA-064               PIC   X(01).               00644004
006450     10  SU130-TRIP-OPEN-TO-SHIP-CNT   PIC   9(18)-.              00645004
006460     10  SU130-COMMA-065               PIC   X(01).               00646004
006461*                                                                 00646105
006462*   REPORT SEQUENCE                                               00646205
006463*   01 - ASN - CROSS DOCK                                         00646305
006464*   02 - CPS - CASEPACK SPLIT - MANUAL XDOCK                      00646405
006465*   03 - SMO - SMOOTHING - PBS MANUAL XDOCK                       00646505
006466*   04 - JWL - P2L JEWELRY                                        00646605
006467*   05 - P2L - PACK-TO-LIGHT                                      00646705
006468*   06 - MST - MASTER CONTAINER                                   00646805
006469*   07 - RDM - IR - IMPORT REPLEN                                 00646905
006470*   08 - 3WD - THIRD PARTY WAREHOUSE DISTRIBTION                  00647006
006471*                                                                 00647106
006472     10  SU130-REPORT-SORT-SEQ         PIC   9(02).               00647206
006473         88 SU130-RPT-SEQ-01                       VALUE 01.      00647306
006474         88 SU130-RPT-SEQ-02                       VALUE 02.      00647406
006475         88 SU130-RPT-SEQ-03                       VALUE 03.      00647506
006476         88 SU130-RPT-SEQ-04                       VALUE 04.      00647606
006477         88 SU130-RPT-SEQ-05                       VALUE 05.      00647706
006478         88 SU130-RPT-SEQ-06                       VALUE 06.      00647806
006479         88 SU130-RPT-SEQ-07                       VALUE 07.      00647906
006480         88 SU130-RPT-SEQ-08                       VALUE 08.      00648006
006481         88 SU130-RPT-SEQ-OTHER                    VALUE 99.      00648106
006482     10  SU130-COMMA-066               PIC   X(01).               00648206
006490*                                                                 00649004
006500     10  FILLER                        PIC   X(28).               00650005
