000100******************************************************************        
000200* SURD033 - RECORD LENGTH 150                                    *        
000300******************************************************************        
000400*  RECORD LAYOUT FOR EXTRACT FILE USED TO CREATE                 *        
000500*  VENDOR UCC128 VIOLATION REPORT                                *        
000600******************************************************************        
000700 01  SU033-RECORD.                                                        
000800     05  SU033-WEEK-END-DATE             PIC X(10).                       
000900     05  SU033-WEEK-END-DATE-R REDEFINES SU033-WEEK-END-DATE.             
001000         10  SU033-DATE-CCYY             PIC 9(04).                       
001100         10  FILLER                      PIC X(01).                       
001200         10  SU033-DATE-MM               PIC 9(02).                       
001300         10  FILLER                      PIC X(01).                       
001400         10  SU033-DATE-DD               PIC 9(02).                       
001500     05  SU033-FISCAL-YEAR               PIC 9(04).                       
001600     05  SU033-FISCAL-WEEK               PIC 9(02).                       
001700     05  SU033-FISCAL-SEASON             PIC X(06).                       
001800     05  SU033-FISCAL-MONTH              PIC 9(02).                       
001801                                                                          
001810     05  SU033-VENDOR-SALES-RANK         PIC S9(04) COMP.                 
001900     05  SU033-VENDOR-ID                 PIC S9(09) COMP.                 
001910     05  SU033-PKGNG-TYPE                PIC X(02).                       
001920         88  SU033-BULK-CASE                         VALUE 'BC'.          
001930         88  SU033-PREPACK                           VALUE 'PP'.          
001940         88  SU033-PBS                               VALUE 'PS'.          
001940         88  SU033-RFID                              VALUE 'RF'.          
002100     05  SU033-VENDOR-AUDIT-RANK         PIC  X(06).                      
002110                                                                          
002200     05  SU033-VENDOR-NAME               PIC  X(30).                      
002700*                                                                         
002800     05  SU033-OPER-UNT-ID               PIC S9(04) COMP.                 
002900     05  SU033-PO-NBR                    PIC S9(09) COMP.                 
003000     05  SU033-RCVR-SEQ-NBR              PIC S9(09) COMP.                 
003100     05  SU033-PO-LNE-NBR                PIC S9(09) COMP.                 
003200     05  SU033-PO-PREPK-ID               PIC S9(04) COMP.                 
003300     05  SU033-AUD-CNTL-NBR              PIC S9(09) COMP.                 
003400*                                                                         
003500     05  SU033-CRTNS-AUDITED             PIC S9(06) COMP.                 
003600     05  SU033-CRTNS-W-PICK-ERR          PIC S9(06) COMP.                 
003700     05  SU033-UNITS-AUDITED             PIC S9(09) COMP.                 
003800     05  SU033-UNITS-PICK-ERR            PIC S9(09) COMP.                 
003900     05  SU033-UNITS-PACK-ERR            PIC S9(09) COMP.                 
004000     05  SU033-PACKS-AUDITED             PIC S9(06) COMP.                 
004100     05  SU033-PACKS-W-PACK-ERR          PIC S9(06) COMP.                 
004200*                                                                         
004300     05  SU033-FAILURE-ERROR-SW          PIC  X(01)  VALUE SPACE.         
004400         88  SU033-FAILURE-ERROR-YES                 VALUE 'Y'.           
004500         88  SU033-FAILURE-ERROR-NO                  VALUE 'N'.           
004600*                                                                         
004700     05  SU033-AUD-STAT-CDE              PIC  X(01)  VALUE SPACE.         
004800         88  SU033-COMPLETE                          VALUE 'P',           
004810                                                           'F'.           
004900         88  SU033-PASS                              VALUE 'P'.           
005000         88  SU033-FAIL                              VALUE 'F'.           
005100         88  SU033-NOT-NEED                          VALUE 'N'.           
005200         88  SU033-IN-PROCESS                        VALUE 'I'.           
005300*                                                                         
003800     05  SU033-UNITS-TICK-ERR            PIC S9(09) COMP.                 
005400     05  FILLER                          PIC X(28).                       
