000100******************************************************************00010001
000200**                        SURD171                               **00020001
000300**                                                              **00030001
000400**  THIS IS THE EXTRACT LAYOUT FOR THE SET AND YEAR RECORDS     **00040001
000500**  TO PURGE FROM PACK AND HOLD CARTON INVENTORY FILE           **00050001
000600**  LENGTH:   30 BYTES                                          **00060001
000700******************************************************************00070001
000800 01  SU171-EXTRACT-RECORD.                                        00080001
000806     05  SU171-SEASET-YR               PIC   X(4).                00080601
000807     05  SU171-SEASET-SHRT-NM          PIC   X(5).                00080701
000860     05  SU171-BTCH-PRC-DTE            PIC   X(10).               00086001
000870     05  FILLER                        PIC   X(11).               00087003
