000100******************************************************************00010001
000200**                        SURD136                               **00020001
000300**                                                              **00030001
000400**  THIS IS THE LAYOUT OF THE MESSAGE BEING SENT TO OMS OR MLS  **00040001
000500**  OUTBOUND TRAILER ARE SHIPPED TO THE STORES. IT IS DETERMINED**00050001
000400**  BY A SWITCH AS TO WHICH FILE IT WILL GO TO                  **00060001
000600**  LENGTH: 200  BYTES                                          **00070004
000700******************************************************************00080001
000800 01  SU136-EXTRACT-RECORD.                                        00090001
000801     05  SU136-DEST-LOC-NBR         PIC  S9(04)  VALUE 0 COMP.    00100001
000802     05  SU136-OTBND-TRIP-ID        PIC  S9(09)  VALUE 0 COMP.    00110001
000803     05  SU136-SHIPPED-TMST         PIC   X(26)  VALUE SPACES.    00120001
000804     05  SU136-SHIPT-UNT-ID         PIC  S9(18)V VALUE 0 COMP-3.  00130001
000805     05  SU136-SKU-NBR              PIC  S9(08)V VALUE 0 COMP-3.  00140001
000806     05  SU136-SHPD-UNT-QTY         PIC  S9(09)V VALUE 0 COMP-3.  00150001
000801     05  SU136-ORGN-OPER-UNT-ID     PIC  S9(04)  VALUE 0 COMP.    00160001
           05  SU136-TRLR-ID              PIC   X(12)  VALUE SPACES.    00170001
           05  SU136-TRLR-SRL-NBR         PIC  S9(09)  VALUE 0 COMP.    00180001
           05  SU136-TRLR-SEAL-ID         PIC   X(20)  VALUE SPACES.    00190001
           05  SU136-SHIP-SCAC-CDE        PIC   X(4)   VALUE SPACES.    00200001
           05  SU136-TRN-NBR              PIC  S9(09)  VALUE 0 COMP.    00210001
           05  SU136-RCVR-SEQ-NBR         PIC  S9(09)  VALUE 0 COMP.    00220001
           05  SU136-UNIT-RETAIL          PIC  S9(08)V99  VALUE 0.      00230001
           05  SU136-COST-AMT             PIC  S9(07)V999 VALUE 0.      00240001
           05  SU136-SML-TYPE             PIC   X(03)  VALUE SPACES.    00250011
           05  SU136-TMST-ON-TRLR         PIC  X(26)   VALUE SPACE.     00260009
           05  SU136-DTE-AT-DC            PIC  X(10)   VALUE SPACE.     00270006
           05  SU136-TM-AT-DC             PIC  X(08)   VALUE SPACE.     00280006
           05  SU136-RECORD-TYP-SW        PIC  X(03)   VALUE '   '.     00290006
               88 SU136-OMS-RECORD                     VALUE 'OMS'.     00300006
               88 SU136-MLS-RECORD                     VALUE 'MLS'.     00310006
           05  SU136-VENDOR-STYLE         PIC  S9(9)   VALUE 0 COMP.    00320013
           05  SU136-CATEGORY             PIC  S9(4)   VALUE 0 COMP.    00330013
           05  SU136-OPC-SET-IND          PIC  X(01)   VALUE SPACE.     00340015
           05  SU136-VENDOR-CART-ID       PIC  S9(18)V VALUE 0 COMP-3.  00341016
           05  FILLER                     PIC  X(11)   VALUE SPACE.     00350016
