000100******************************************************************00010000
000200*                         SURD046                                *00020000
000300*                                                                *00030000
000400*   THIS IS THE SUMMARY SML EXTRACT FILE FOR CARTONS CREATED     *00040000
000500*   AND MANIFESTED TO A TRAILER                                  *00050000
000600*                                                                *00060000
000700**  LENGTH:  150               USED IN JOB SUK___                *00070001
000800******************************************************************00080000
000900 01  SU046-EXTRACT-RECORD.                                        00090000
001000     05  SU046-ORGN-LOC-NBR            PIC S9(04)  VALUE ZEROES.  00100012
001100     05  SU046-TRN-NBR                 PIC S9(09)  VALUE ZEROES.  00110012
001200     05  SU046-RCVR-SEQ-NBR            PIC S9(09)  VALUE ZEROES.  00120000
001300     05  SU046-CARTON-SOURCE           PIC  X(03)  VALUE SPACES.  00130011
001400     05  SU046-VENDOR-ID               PIC S9(09)  VALUE ZEROES.  00140000
001500     05  SU046-VENDOR-NAME             PIC  X(15)  VALUE SPACES.  00150000
001600     05  SU046-LNE-LOC-CDE             PIC  X(05)  VALUE SPACES.  00160000
001700         88  SU046-LNE-LOC-MULT                    VALUE 'MULT'.  00170000
001800     05  SU046-PRC-AREA-ID             PIC  X(06)  VALUE SPACES.  00180000
001900         88  SU046-PRC-AREA-MULT                   VALUE 'MULT'.  00190008
002000     05  SU046-VERIFY-DATE             PIC  X(10)  VALUE SPACES.  00200011
002100     05  SU046-VERIFY-TIME             PIC  X(05)  VALUE SPACES.  00210011
002200     05  SU046-TRBL-IND                PIC  X(01)  VALUE SPACES.  00220000
002300         88  SU046-TRBL-YES                        VALUE 'Y'.     00230000
002400         88  SU046-TRBL-NO                         VALUE 'N'.     00240000
002500     05  SU046-EXPTD-CRTNS             PIC S9(09)  VALUE ZEROES.  00250009
002600     05  SU046-NBR-CRTNS-MFSTD         PIC S9(09)  VALUE ZEROES.  00260009
002700     05  SU046-NBR-CRTNS-NO-TRLR       PIC S9(09)  VALUE ZEROES.  00270009
002800     05  SU046-VRFD-CRTN-CNT           PIC S9(09)  VALUE ZEROES.  00280010
002900     05  SU046-VRFD-STATUS             PIC  X(01)  VALUE SPACES.  00290007
003000         88  SU046-SOME-LINES                      VALUE 'S'.     00300007
003100         88  SU046-ALL-LINES                       VALUE 'A'.     00310007
003200         88  SU046-NO-LINES                        VALUE 'N'.     00320007
003300     05  SU046-RETAIL-AMT              PIC S9(07)V99 VALUE ZEROES.00330014
002900     05  SU046-NEW-STR-IND             PIC  X(01)  VALUE SPACES.  00331017
003000         88  SU046-NEW-STR-YES                     VALUE 'Y'.     00332016
003100         88  SU046-NEW-STR-NO                      VALUE ' '.     00333018
003300     05  SU046-SEASET-NAME             PIC  X(05)  VALUE SPACES.  00334016
003300     05  SU046-DEPT-NBR                PIC  X(03)  VALUE SPACES.  00335019
003300     05  SU046-TYP-CDE                 PIC  X(01)  VALUE SPACES.  00336020
003000         88  SU046-TYP-CDE-JWL                     VALUE 'J'.     00337020
003100         88  SU046-TYP-CDE-P2L                     VALUE 'P'.     00338020
003100         88  SU046-TYP-CDE-FLAT                    VALUE 'F'.     00339020
003100         88  SU046-TYP-CDE-OTHER                   VALUE 'O'.     00339120
003100         88  SU046-TYP-CDE-MULTI                   VALUE 'M'.     00339221
003400     05  FILLER                        PIC  X(18)  VALUE SPACES.  00340020
