000100*    DUAL PRINT AND APPLY CONTROL FILE FOR                                
000200*                         RECREATE SORT DIRECTIVES.                       
000300*     PROGRAM SUKUT136 JOB SUK140  JEZ                                    
000400*     LENGTH = 168                                                        
000500 01  SU095-RECORD.                                                        
000600     05  SU095-BRCDE-NBR              PIC   X(22).                        
000700     05  SU095-CRE-TMST               PIC   X(26).                        
000800     05  SU095-OPER-UNT-ID            PIC  S9(4) COMP.                    
000900     05  SU095-DIRV-RSN-CDE           PIC   X(3).                         
001000     05  SU095-LGCL-LOC-NM            PIC   X(32).                        
001100     05  SU095-AUD-CNTL-NBR           PIC  S9(9) COMP.                    
001200     05  SU095-SHIPT-UNT-ID           PIC  S9(18)V COMP-3.                
001300     05  SU095-AUD-STAT-CDE           PIC   X(1).                         
001400     05  SU095-PO-NBR                 PIC  S9(9) COMP.                    
001500     05  SU095-RCVR-SEQ-NBR           PIC  S9(9) COMP.                    
001600     05  SU095-PO-LNE-NBR             PIC  S9(9) COMP.                    
001700     05  SU095-PREPK-ID               PIC  S9(4) COMP.                    
001800     05  SU095-STR-NBR                PIC  S9(4) COMP.                    
001900     05  SU095-CRE-PGM-NM             PIC   X(8).                         
002000     05  SU095-ACKNL-SEQ-NBR          PIC  S9(18)V COMP-3.                
002100     05  SU095-CASI-CDE               PIC   X(1).                         
002200     05  SU095-CART-STAT-CDE          PIC   X(1).                         
002300     05  SU095-AUD-FALR-RSN-NM        PIC   X(4).                         
002400     05  SU095-STR-ZN-ID              PIC   X(5).                         
002500     05  SU095-SEASET-YR              PIC   X(4).                         
002600     05  SU095-SEASET-SHRT-NM         PIC   X(5).                         
002700     05  SU095-CNVYR-PRC-ACTN-NM      PIC   X(6).                         
002800     05  SU095-CRE-BY-USR-ID          PIC   X(8).                         
