000100*                         SUWS028                                         
000200*                                                                         
000300*   PO/CARTON AUDIT EXTRACT                                               
000400*   LENGTH:  100 BYTES                                                    
000500                                                                          
000600 01  SU028-PO-CTN-EXTRACT-RECORD.                                         
000700     05  SU028-OPER-UNT-ID            PIC S9(04) COMP.                    
000800     05  SU028-PO-NBR                 PIC S9(09) COMP.                    
000900     05  SU028-REC-SEQ-NBR            PIC S9(09) COMP.                    
001000     05  SU028-PKGNG-TYPE             PIC X(02).                          
001100     05  SU028-ENT-ID                 PIC S9(09) COMP.                    
001200     05  SU028-VENDOR-RANK            PIC X(06).                          
001300     05  SU028-PROCESS-DATE           PIC X(10).                          
001400     05  SU028-TOTAL-RCVR-CTNS        PIC S9(09) COMP-3.                  
001500     05  SU028-TOTAL-RCVR-UNITS       PIC S9(09) COMP-3.                  
001600     05  SU028-DEPT-NBR               PIC X(03).                          
001700     05  FILLER                       PIC X(055).                         
