000100******************************************************************00010000
000200**                        SURD078                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT FOR THE EXTRACT OF THE UNIQUE PO-RCVR    **00040000
000410**  IN TLBVRMG DATABASE                                         **00041000
000420**  LENGTH:  34  BYTES                                          **00042005
000430**                                                              **00043000
000440******************************************************************00044000
000450 01  SU078-EXTRACT-RECORD.                                        00045000
000451     05  SU078-PO-NBR                   PIC  S9(09) COMP.         00045101
000452     05  SU078-RCVR                     PIC  S9(09) COMP.         00045203
000452     05  SU078-CRE-TMST                 PIC   X(26).              00045303
