000100*                         SURD072                                         
000200*                                                                         
000300*   EXTRACT OF TRAILERS FROM SUT_TRIP_DTL_SUM TABLE                       
000300*           STATUS (SU, AR, DR) X DAYS OLD                                
000500*                                                                         
000500*   NOTE - FILLER1 NEEDED FOR NULL FIELD CURR-FUNC-TMST                   
000500*        - FILLER2 NEEDED FOR NULL FIELD FUNC-QTY                         
000500*        - FILLER  NEEDS TO FOLLOW NULL FIELD                             
000500*                                                                         
000600**  LENGTH:  150               USED IN JOB SUK140                         
000700                                                                          
000800 01  SU072-EXTRACT-RECORD.                                                
001005     05  SU072-OTBND-TRIP-ID           PIC S9(09) COMP.                   
000914     05  SU072-TRIP-OCRNC-ID           PIC S9(9)  COMP.                   
001008     05  SU072-TRIP-STAT-CDE           PIC X(02).                         
001008     05  SU072-OTBND-STAT-TMST         PIC X(26).                         
001008     05  SU072-SUM-CRE-TMST            PIC X(26).                         
001008     05  SU072-CURR-TMST               PIC X(26).                         
001008     05  SU072-CURR-FUNC-TMST          PIC X(26).                         
001008     05  SU072-FILLER1                 PIC X(1).                          
001008     05  SU072-FUNC-QTY                PIC S9(9) COMP.                    
001008     05  SU072-FILLER2                 PIC X(1).                          
001600     05  FILLER                        PIC X(30).                         
