000100******************************************************************00010000
000200**                        SURD010                               **00020002
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT FOR PO/LINE UNUSED REPORT        **00040003
000500**  LENGTH:  200 BYTES                                          **00050004
000300**                                                              **00051010
      **03/01 - DEANNA BRANTNER - ADDED SU010-PREPK-IND               **00052010
000600******************************************************************00060000
000700 01  SU010-EXTRACT-RECORD.                                        00070000
001000     05  SU010-PO-NUMBER                PIC S9(09) COMP.          00080000
001100     05  SU010-REC-SEQ-NBR              PIC S9(09) COMP.          00090000
001245     05  SU010-LINE-NBR                 PIC S9(09) COMP.          00100000
001247     05  SU010-CART-LBL-TYPE            PIC X(01).                00110000
               88  SU010-SML-TYPE                        VALUE 'S'.     00120003
               88  SU010-P2L-TYPE                        VALUE 'P'.     00130003
               88  SU010-CS-TYPE                         VALUE 'C'.     00140003
001247     05  SU010-LABEL-IND                PIC X(01).                00150000
               88  SU010-CONSUMED                        VALUE 'Y'.     00160000
               88  SU010-NOT-CONSUMED                    VALUE 'N'.     00170000
001245     05  SU010-LABEL-TOTAL              PIC S9(09) COMP.          00180003
001240     05  SU010-RECORD-TYPE-IND          PIC X(01).                00190000
001240         88  SU010-ERROR-RECORD                    VALUE 'A'.     00200000
001240         88  SU010-DETAIL-RECORD                   VALUE 'B'.     00210000
001245     05  SU010-MANIFEST-NBR             PIC S9(09) COMP.          00220008
           05  SU010-PREPK-IND                PIC X(1).                 00221009
001250     05  FILLER                         PIC X(176).               00230009
