000100******************************************************************00010011
000200**                        SURD018                               **00020003
000300**                                                              **00030003
000400**  THIS IS THE EXTRACT LAYOUT FOR ALL CARTONS MANIFESTED TO    **00040003
000500**  A TRAILER.                                                  **00050022
000600**                                                              **00060003
000700**  USED IN THE CARTONS MANIFESTED TO TRAILER EXTRACT PROGRAM.  **00070010
000800**  LENGTH:  200 BYTES                                          **00080003
000900******************************************************************00090003
001000 05  SU018-EXTRACT-RECORD.                                        00100023
001100     10  SU018-RECORD-TYPE             PIC   X(01).               00110023
001200     10  SU018-AUD-CNTL-NBR            PIC  S9(09) COMP.          00120029
001300     10  SU018-DEST-TYP-CDE            PIC   X(01).               00130023
001400     10  SU018-TRAILER-SERIAL-NBR      PIC  S9(09)    COMP.       00140023
001500     10  SU018-SCAC                    PIC   X(04).               00150023
001600     10  SU018-TRAILER-ID              PIC   X(12).               00160023
001700     10  SU018-SCN-LOC-ID              PIC   X(04).               00170023
001800     10  SU018-ORIG-OTBND-TRIP-ID      PIC  S9(09)    COMP.       00180023
001900     10  SU018-DEST-OTBND-TRIP-ID      PIC  S9(09)    COMP.       00190023
002000     10  SU018-ORGN-OPER-UNT-ID        PIC  S9(04)    COMP.       00200023
002100     10  SU018-DEST-OPER-UNT-ID        PIC  S9(04)    COMP.       00210023
002200     10  SU018-TRIP-STAT-CDE           PIC   X(02).               00220023
002300     10  SU018-ORIG-DOOR-ID            PIC   X(04).               00230023
002400     10  SU018-DEST-DOOR-ID            PIC   X(04).               00240023
002500     10  SU018-ORIG-DOOR-TYP-CDE       PIC   X(02).               00250023
002600     10  SU018-DEST-DOOR-TYP-CDE       PIC   X(02).               00260023
002700     10  SU018-ORIG-DIVERT-NBR         PIC  S9(09)    COMP.       00270023
002800     10  SU018-DEST-DIVERT-NBR         PIC  S9(09)    COMP.       00280023
002900     10  SU018-ORIG-DIVERT-LOC-ID      PIC   X(04).               00290023
003000     10  SU018-DEST-DIVERT-LOC-ID      PIC   X(04).               00300023
003100     10  SU018-SHIPT-UNT-ID            PIC  S9(18)V   COMP-3.     00310023
003200     10  SU018-BRCDE-NBR               PIC   X(22).               00320023
003300     10  SU018-MFST-CRTN-CNT           PIC  S9(09)    COMP.       00330024
003400     10  SU018-MFST-CRTN-ERR-CNT       PIC  S9(09)    COMP.       00340025
003500     10  SU018-MFST-NOT-AUD-CNT        PIC  S9(09)    COMP.       00350030
003600     10  FILLER                        PIC   X(84)   VALUE SPACES.00360031
