000100******************************************************************00010000
000200*                         SURD051                                *00020000
000300*                                                                *00030000
000400*   THIS IS THE BMC EXTRACT FILE FOR CARTONS CREATED AND NOT     *00040000
000500*   MANIFESTED TO A TRAILER                                      *00050000
000600*                                                                *00060000
000700**  LENGTH:  50                USED IN JOB SUK___                 00070001
000800******************************************************************00080000
000900 01  SU051-EXTRACT-RECORD.                                        00090000
001100     05  SU051-SHIPT-UNT-ID            PIC S9(18)V COMP-3.        00110000
001110     05  SU051-ORGN-LOC-NBR            PIC S9(04)  COMP.          00111000
001200     05  SU051-CART-SRC-CDE            PIC  X(03).                00120000
001400     05  SU051-CRE-DATE                PIC  X(10).                00140000
001500     05  SU051-CRE-TIME                PIC  X(08).                00150000
001510     05  SU051-CART-TYP-CDE            PIC  X(01).                00151000
001511     05  SU051-DEST-LOC-NBR            PIC S9(04)  COMP.          00151102
001100     05  SU051-PRNT-CART-ID            PIC S9(18)V COMP-3.        00151203
001520     05  FILLER                        PIC  X(14).                00152002
001600*                                                                 00160000
