000100******************************************************************00010000
000200**                        SURD103                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE LAYOUT OF THE MESSAGE BEING SENT TO MLS WHEN    **00040000
000500**  OUTBOUND TRAILER ARE SHIPPED TO THE STORES                  **00050003
000600**  LENGTH:  110 BYTES                                          **00060014
000700******************************************************************00070000
000800 01  SU103-EXTRACT-RECORD.                                        00080000
000801     05  SU103-DEST-LOC-NBR         PIC  S9(04)  VALUE 0 COMP.    00090000
000802     05  SU103-OTBND-TRIP-ID        PIC  S9(09)  VALUE 0 COMP.    00100000
000803     05  SU103-SHIPPED-TMST         PIC   X(26)  VALUE SPACES.    00110002
000804     05  SU103-SHIPT-UNT-ID         PIC  S9(18)V VALUE 0 COMP-3.  00120001
000805     05  SU103-SKU-NBR              PIC  S9(08)V VALUE 0 COMP-3.  00130001
000806     05  SU103-SHPD-UNT-QTY         PIC  S9(09)V VALUE 0 COMP-3.  00140001
           05  SU103-TRLR-SEAL-ID         PIC   X(20)  VALUE SPACES.    00150008
000804     05  SU103-SML-TYPE             PIC   X(03)  VALUE SPACES.    00160009
000804     05  SU103-MSTR-UNT-ID          PIC  S9(18)V VALUE 0 COMP-3.  00170004
           05  SU103-VENDOR-STYLE         PIC  S9(09)  VALUE 0 COMP.    00180011
           05  SU103-CATEGORY             PIC  S9(04)  VALUE 0 COMP.    00190011
           05  SU103-OPC-SET-IND          PIC   X(01)  VALUE SPACE.     00191012
           05  SU103-VENDOR-CART-ID       PIC  S9(18)V VALUE 0 COMP-3.  00192013
000807     05  FILLER                     PIC   X(08)  VALUE SPACES.    00200012
