000100******************************************************************00010003
000200*                         SURD053                                *00020003
000300*                                                                *00030003
000400*   THIS IS THE RECORD LAYOUT FOR THE PURGE OF CARTON PROCESSED  *00040003
000500*   MESSAGE PURGE. TABLE POPULATED FROM THE PRINT AND APPLY      *00050004
000600*   APPLICATION.                                                 *00060004
000610*                                                                *00061004
000700**  LENGTH:  50                USED IN JOB SUK140                 00070005
000800******************************************************************00080003
000900 01  SU053-EXTRACT-RECORD.                                        00090003
001000     05  SU053-DC-NBR                  PIC  S9(4) COMP.           00100003
001100     05  SU053-ACM-LBL-STA-NBR         PIC  S9(4) COMP.           00110003
001200     05  SU053-ACM-MSG-RCV-TMST        PIC  X(26).                00120003
001300     05  FILLER                        PIC  X(20).                00130003
001400*                                                                 00140003
