       01  SU125-OUT-MANIFEST-DETAILS.                                          
          05  SU125-CARTON-UPC-COUNT      PIC S9(04)  COMP.                     
          05  SU125-CARTON-ARRAY OCCURS 10000 TIMES.                            
              10  SU125-CARTON-ID         PIC S9(18)V COMP-3.                   
              10  SU125-UPC-NBR           PIC S9(15)V COMP-3.                   
              10  SU125-SKU-NBR           PIC S9(08)V COMP-3.                   
              10  SU125-UPC-QUANTITY      PIC  9(05).                           
              10  SU125-STYL-ID           PIC S9(08)V COMP-3.                   
              10  SU125-CTG-SEQ-NBR       PIC S9(04)  COMP.                     
              10  SU125-SML-TYPE          PIC  X(03).                           
              10  SU125-PARENT-SML        PIC S9(18)V COMP-3.                   
              10  SU125-CARTON-RECEIVED   PIC  X(01).                           
              10  SU125-SML-TRLR-TMST     PIC  X(19).                           
              10  SU125-SML-CRE-TMST      PIC  X(19).                           
              10  SU125-OPC-SET-IND       PIC  X(01).                           
              10  SU125-VENDOR-CART-ID    PIC S9(18)V COMP-3.                   
          05  SU125-MSG-ID                PIC  9(05).                           
          05  SU125-MSG-TEXT              PIC  X(80).                           
          05  SU125-SHIP-NODE             PIC  9(04).                           
          05  SU125-TRLR-SRL-NBR          PIC  9(09).                           
          05  SU125-TRLR-SEAL-ID          PIC  X(20).                           
          05  SU125-TRAILER-ID            PIC  X(12).                           
          05  SU125-TRLR-SCAC-CDE         PIC  X(04).                           
