000010******************************************************************00001000
000020**                        SURD080                               **00002000
000030**                                                              **00003000
000040**  THIS IS THE LAYOUT FOR THE ARCHIVE FOR THE OUTBOUND TRIP    **00004000
000041**  WORKER AUDIT DATABASE (SUT_TRIP_WRKR_AUD - SUT00006)        **00004100
000050**  LENGTH:  46  BYTES                                          **00005000
000060**                                                              **00006000
000070******************************************************************00007000
000080 01  SU080-TRIP-AUD-RECORD.                                       00008000
001700     05  SU080-OTBND-TRIP-ID          PIC  S9(9) COMP.            00170000
001800     05  SU080-USR-ID                 PIC   X(8).                 00180000
001900     05  SU080-CRE-TMST               PIC   X(26).                00190000
002000     05  SU080-CRE-BY-PGM-NM          PIC   X(8).                 00200000
