000100******************************************************************00010000
000200**                        SURD049                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE EXTRACT LAYOUT FOR THE PURGE OF THE OUTBOUND    **00040000
000500**  CARTON DATABASE.                                            **00050000
000600**  LENGTH:  100 BYTES                                          **00060000
000700******************************************************************00070000
000800 05  SU049-EXTRACT-RECORD.                                        00080000
000900     10  SU049-SML                     PIC  S9(18)V COMP-3.       00090000
001000     10  SU049-DEST                    PIC  S9(04)  COMP.         00100000
001010     10  SU049-PO-NBR                  PIC  S9(09)  COMP.         00101000
001100     10  SU049-RCVR-SEQ-NBR            PIC  S9(09)  COMP.         00110001
001200     10  SU049-PURGE-SW                PIC   X(01).               00120002
001210         88  SU049-PURGE-YES                 VALUE 'Y'.           00121002
001220         88  SU049-PURGE-NO                  VALUE 'N'.           00122002
001230     10  SU049-DISPLAY-SML             PIC   9(18)V.              00123003
001250     10  SU049-DISPLAY-PO              PIC   9(09).               00125003
001260     10  SU049-DISPLAY-RCVR            PIC   9(09).               00126003
002600     10  FILLER                        PIC   X(43).               00260003
