000410******************************************************************        
000420*    COPY MEMBER:  SURD060                       LRECL = 14      *        
000430*                                                                *        
000440*    THIS FILE IS CREATED FROM A BMC UNLOAD AND WILL CONTAIN     *        
000450*    THE OUTBOUND TRIP ID FOR THOSE STORE TRAILERS THAT          *        
000460*    WERE UNLOADED FOR THE PREVIOUS DAY.                         *        
000495*                                                                *        
000496******************************************************************        
000500 01  SU060-BMC-UNLOAD-SU-REC.                                             
000600     05  SU060-OTBND-TRIP-ID          PIC S9(09) COMP.                    
001200     05  SU060-STR-UNLOAD-DATE        PIC  X(10).                         
