000300******************************************************************        
000400*  RECORD LAYOUT FOR CONTROL CARD WITH DATES/TIMESTAMPS AND DC   *        
000400*  FOR DUAL FEED PRINT AND APPLY WITH AUTOMATED CONVEYOR.        *        
000400*  DIRECTIVE RESEND.                                             *        
000400*  USED IN PROGRAM SUKUT134 - JOB SUK035                         *        
000600******************************************************************        
000200* SURD029 - RECORD LENGTH 80                                     *        
000300******************************************************************        
000700 01  SURD029-RECORD.                                                      
000800     05  SU029-OPER-UNT-ID               PIC 9(04).                       
001400     05  SU029-TMST-BEGIN                PIC X(26).                       
001400     05  SU029-TMST-END                  PIC X(26).                       
004700     05  FILLER                          PIC X(24).                       
