000100*                         SURD067                                         
000200*                                                                         
000300*   FORMAT TO IDENTIFY DIVERTED CARTONS THAT ARE INACTIVE OR              
000400*   THAT ARE EMPTY (NOT MANIFESTED)                                       
000500*                                                                         
000600**  LENGTH:  150               USED IN JOB SUK015                         
000700                                                                          
000800 01  SU067-EXTRACT-RECORD.                                                
000900     05  SU067-SHIPT-UNT-ID           PIC S9(18)V COMP-3.                 
000910     05  SU067-LOC-NBR                PIC S9(04) COMP.                    
001400     05  SU067-RECORD-TYPE            PIC X(01).                          
001410         88  SU067-UNKNOWN-CARTON         VALUE 'U'.                      
001420         88  SU067-EMPTY-CARTON           VALUE 'E'.                      
001430         88  SU067-INACTIVE-CARTON        VALUE 'I'.                      
001500     05  SU067-CARTON-STATUS          PIC X(01).                          
001501         88  SU067-CRTN-ACTIVE            VALUE 'A'.                      
001502         88  SU067-CRTN-INACTIVE          VALUE 'I'.                      
001510     05  SU067-DIVERT-DATE            PIC X(10).                          
001511     05  SU067-DIVERT-TIME            PIC X(08).                          
001512     05  SU067-DIVERT-STATUS          PIC X(01).                          
001513         88  SU067-DIVERT-ACTIVE          VALUE 'A'.                      
001514         88  SU067-DIVERT-INACTIVE        VALUE 'I'.                      
001515     05  SU067-DIVERT-DOOR            PIC X(04).                          
001520     05  SU067-CREATE-DATE            PIC X(10).                          
001521     05  SU067-CREATE-TIME            PIC X(08).                          
001530     05  SU067-CREATE-SRC             PIC X(03).                          
001531         88  SU067-SRC-ASN                         VALUE 'ASN'.           
001532         88  SU067-SRC-CHECKED-IN                  VALUE 'CKN'.           
001533         88  SU067-SRC-CASEPACK-SPLIT              VALUE 'CPS'.           
001534         88  SU067-SRC-MANUAL                      VALUE 'MAN'.           
001535         88  SU067-SRC-P2L                         VALUE 'P2L'.           
001536         88  SU067-SRC-RECV                        VALUE 'RCV'.           
001537         88  SU067-SRC-RDM                         VALUE 'RDM'.           
001538         88  SU067-SRC-SMOOTHING                   VALUE 'SMO'.           
001539         88  SU067-SRC-FAST-XFER                   VALUE 'FXR'.           
001540         88  SU067-SRC-MSTR-CNTR                   VALUE 'MST'.           
001541         88  SU067-SRC-CRTN-BULD                   VALUE 'MSC'.           
001542         88  SU067-SRC-UNKNOWN                     VALUE '   '.           
001543         88  SU067-SRC-JWL                         VALUE 'JWL'.           
001544         88  SU067-SRC-DMG                         VALUE 'DMG'.           
001545     05  SU067-CREATE-USERID          PIC X(08).                          
001546     05  SU067-P2L-UPLOAD-DATE        PIC X(10).                          
001547     05  SU067-P2L-UPLOAD-TIME        PIC X(08).                          
001600     05  FILLER                       PIC X(66).                          
