       01  SU141-OUT-MSTR-CRTN-DETAILS.                                         
          05  SU141-PARENT-SML            PIC S9(18)V COMP-3.                   
          05  SU141-UPC-COUNT             PIC S9(04)  COMP.                     
          05  SU141-UPC-ARRAY   OCCURS 3000 TIMES.                              
              10  SU141-CHLD-CARTON-ID    PIC S9(18)V COMP-3.                   
              10  SU141-STORE-NBR         PIC  9(04).                           
              10  SU141-TRIP-ID           PIC  9(09).                           
              10  SU141-SML-TYPE          PIC  X(03).                           
              10  SU141-CARTON-RECEIVED   PIC  X(01).                           
              10  SU141-SML-TRLR-TMST     PIC  X(19).                           
              10  SU141-SML-CRE-TMST      PIC  X(19).                           
              10  SU141-XFER-IND          PIC  X(01).                           
              10  SU141-XFER-NBR          PIC S9(09) COMP.                      
              10  SU141-CUST-REQ-IND      PIC  X(01).                           
              10  SU141-CUST-NAME         PIC  X(20).                           
              10  SU141-UPC-NBR           PIC S9(15)V COMP-3.                   
              10  SU141-QUANTITY          PIC  9(05).                           
              10  SU141-PO-NUMBER         PIC S9(09) COMP.                      
              10  SU141-PO-LNE-NBR        PIC  9(04).                           
              10  SU141-RCVR-SEQ-NBR      PIC S9(09) COMP.                      
              10  SU141-SKU-NBR           PIC S9(09) COMP.                      
              10  SU141-STYL-ID           PIC S9(08)V COMP-3.                   
              10  SU141-CTG-SEQ-NBR       PIC S9(04) COMP.                      
              10  SU141-UNT-COST-AMT      PIC S9(4)V9(3) COMP-3.                
              10  SU141-UNT-RTL-AMT       PIC S9(7)V9(2) COMP-3.                
              10  SU141-SHIP-NODE         PIC  9(04).                           
              10  SU141-TRLR-SRL-NBR      PIC  9(09).                           
              10  SU141-TRLR-SEAL-ID      PIC  X(20).                           
              10  SU141-TRAILER-ID        PIC  X(12).                           
              10  SU141-TRLR-SCAC-CDE     PIC  X(04).                           
              10  SU141-VENDOR-CART-ID    PIC S9(18)V COMP-3.                   
          05  SU141-MSG-ID                PIC  9(05).                           
          05  SU141-MSG-TEXT              PIC  X(80).                           
