000100******************************************************************00010001
000200**                        SUWS087                               **00020001
000300**                                                              **00030001
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040001
000500**  DUAL FEED PRINT AND APPLY SETUP SCREEN                      **00050001
000600**  LENGTH:  200 BYTES                                          **00060005
000700******************************************************************00070012
000800         10  SU087-INTER-APPL-COMMAREA  REDEFINES                 00080001
000900                                     INTER-APPL-COMM-AREA.        00090001
001000             15  FILLER                         PIC  X(01).       00100001
001026             15  SU087-OPER-UNT-ID              PIC S9(04) COMP.  00102601
001028             15  SU087-FCLTY-NME                PIC  X(25).       00102801
001029             15  SU087-PNA-STA-NBR              PIC  9(04).       00102906
001030             15  SU087-DOOR-ID                  PIC  X(04).       00103001
001040             15  SU087-ASSIGN-FROM-DATE  PIC X(10).               00104008
001051             15  SU087-ASSIGN-TO-DATE    PIC X(10).               00105109
001063             15  SU087-ASGD-STRT-TMST    PIC X(26).               00106310
001064             15  SU087-TRIP-ID           PIC 9(09).               00106411
001065             15  SU087-SCAC              PIC X(04).               00106512
001066             15  SU087-TRAILER           PIC X(10).               00106612
001067             15  SU087-FUNCTION                 PIC  X(01).       00106713
001068                 88  SU087-FUNCTION-NONE             VALUE ' '.   00106813
001070                 88  SU087-UPD-DOOR                  VALUE 'U'.   00107013
001090             15  FILLER                         PIC X(094).       00109014
