000100***************************************************************** 00010014
000200* DIRECTIVE GENERATOR COMMUNICATION AREA                        * 00020015
000300*                                                               * 00030015
000400* THIS IS THE COMMUNICATION AREA IS USED TO SEND A DIRECTIVE    * 00040015
000500* REQUEST TO THE DIRECTIVE GENERATOR (SUKUT129).                * 00050015
000600*                                                               * 00060015
000700*                     MODIFICATION HISTORY                      * 00070015
000800*                     --------------------                      * 00080015
000900*                                                               * 00090015
001000* DATE     PROGRAMMER MODIFICATION                              * 00100015
001100* -------- ---------- ----------------------------------------  * 00110015
001200*                                                               * 00120015
001300***************************************************************** 00130015
001400 01  SU090-DG-REQUEST-COMMAREA.                                   00140015
001500     05  SU090-RET-CODE                PIC X(02).                 00150015
001600         88  SU090-SUCCESS                       VALUE '00'.      00160015
001700         88  SU090-PARAMETER-ERROR               VALUE '01'.      00170015
001800         88  SU090-DB2-ERROR                     VALUE '02'.      00180015
001900         88  SU090-MQ-ERROR                      VALUE '03'.      00190015
002000         88  SU090-OTHER-ERROR                   VALUE '90'.      00200015
002100     05  SU090-ERR-PROGRAM             PIC X(08).                 00210015
002200     05  SU090-ERR-PARAGRAPH           PIC X(31).                 00220020
002300     05  SU090-SQLCODE                 PIC S9(9) COMP.            00230015
002310     05  SU090-SQLCA                   PIC X(136).                00231019
002400     05  SU090-MQ-COND-CODE            PIC S9(9) COMP.            00240019
002401     05  SU090-MQ-REAS-CODE            PIC S9(9) COMP.            00241019
002402     05  SU090-MQ-REAS-TXT             PIC X(30).                 00242019
002500     05  SU090-CALLING-PGM             PIC X(08).                 00250015
002600     05  SU090-BATCH-ONLINE-IND        PIC X(01).                 00251016
003100         88  SU090-BATCH                         VALUE  'B'.      00252016
003200         88  SU090-ONLINE                        VALUE  'C'.      00253016
003201     05  SU090-OPER-UNT-ID-X.                                     00260018
003202         10  SU090-OPER-UNT-ID         PIC 9(04).                 00261018
003203     05  SU090-ACTN-CDE                PIC 9(01).                 00270015
003204         88  SU090-VALID-ACTIONS                 VALUES 1,        00280015
003205                                                        2,        00290015
003206                                                        3.        00300015
003207         88  SU090-ADD-ACTION                    VALUE  1.        00310015
003208         88  SU090-DELETE-ACTION                 VALUE  2.        00320015
003300         88  SU090-MODIFY-ACTION                 VALUE  3.        00330015
003400     05  SU090-DIRECTIVE-LVL-CDE       PIC 9(02).                 00340015
003500         88  SU090-VALID-DIRECTIVE-LEVEL         VALUES 1,        00350015
003600                                                        2,        00360015
003610                                                        3,        00361015
003620                                                        4,        00362015
003630                                                        5.        00363015
003640         88  SU090-CARTON-DIRECTIVE              VALUE  1.        00364015
003650         88  SU090-AUDIT-GROUP-DIRECTIVE         VALUE  2.        00365015
003660         88  SU090-PO-RCVR-DIRECTIVE             VALUE  3.        00366015
003670         88  SU090-PO-RCVR-LINE-DIRECTIVE        VALUE  4.        00367015
003680         88  SU090-PO-RCVR-PACK-DIRECTIVE        VALUE  5.        00368015
003690     05  SU090-DIRV-RSN-CDE            PIC X(03).                 00369015
003691                                                                          
003692***                                                                       
003693*** VALID BARCODE TYPES                                                   
003694***   S = SML                                                             
003695***   K = PBS                                                             
003696***   P = PACK-TO-LIGHT                                                   
003697***   E = E-COMM          (ADDED 3/15/12)                                 
003698***   C = CENTRAL STOCK   (ADDED 3/15/12)                                 
003699***                                                                       
003700                                                                          
003710     05  SU090-BRCDE-TYP-CDE           PIC X(01).                         
003800         88  SU090-VALID-BARCODE-TYPE            VALUES ' ',              
003900                                                        'S',              
003910                                                        'K',              
004000                                                        'P',              
004010                                                        'E',              
004020                                                        'C'.              
004030                                                                          
004100         88  SU090-NO-BARCODE                    VALUE  ' '.              
004200         88  SU090-SML-BARCODE                   VALUE  'S',              
004210                                                        'K',              
004220                                                        'E',              
004230                                                        'C'.              
004240                                                                          
004300         88  SU090-P2L-BARCODE                   VALUE  'P'.              
004310                                                                          
004400     05  SU090-SML-BRCDE-NBR-X.                                   00440015
004500         10  SU090-SML-BRCDE-NBR       PIC 9(18).                 00450015
004600     05  SU090-P2L-BRCDE-NBR           PIC X(22).                 00460015
004700     05  SU090-PO-NBR-X.                                          00470015
004800         10  SU090-PO-NBR              PIC 9(09).                 00480015
004900     05  SU090-PO-LNE-NBR-X.                                      00490015
005000         10  SU090-PO-LNE-NBR          PIC 9(04).                 00500015
005100     05  SU090-PO-PREPK-ID-X.                                     00510015
005200         10  SU090-PO-PREPK-ID         PIC 9(04).                 00520015
005300     05  SU090-RCVR-SEQ-NBR-X.                                    00530015
005400         10  SU090-RCVR-SEQ-NBR        PIC 9(04).                 00540015
005500     05  SU090-CASI-CDE                PIC X(01).                 00550015
005600     05  SU090-CART-STAT-CDE           PIC X(01).                 00560015
005700         88  SU090-VALID-CARTON-STATUS           VALUES 'A',      00570015
005800                                                        'I'.      00580015
005900         88  SU090-ACTIVE-CART                   VALUE  'A'.      00590015
006000         88  SU090-INACTIVE-CART                 VALUE  'I'.      00600015
006100     05  SU090-AUD-CNTL-NBR-X.                                    00610015
006200         10  SU090-AUD-CNTL-NBR        PIC 9(09).                 00620015
006300     05  SU090-AUD-STAT-CDE            PIC X(01).                 00630015
006400     05  SU090-AUD-FAIL-RSN            PIC X(05).                 00640015
006500     05  SU090-STR-ZN                  PIC X(05).                 00650015
006600     05  SU090-SEASET-YR               PIC X(04).                 00660015
006700     05  SU090-SEASET-CDE              PIC X(05).                 00670015
006800     05  SU090-STR-NBR-X.                                         00680015
006900         10  SU090-STR-NBR             PIC 9(04).                 00690015
007000     05  SU090-ASSOC-ID                PIC X(08).                 00700015
007001     05  SU090-QMNGR-CONNECTED-SW      PIC X(01).                 00560015
007002         88  SU090-QMNGR-CONNECTED-YES           VALUES 'Y'.      00570015
007004         88  SU090-QMNGR-CONNECTED-NO            VALUE  'N'.      00590015
007001     05  SU090-DIRECTIVE-RESEND-SW     PIC X(01).                 00560015
007002         88  SU090-DIRECTIVE-RESEND-YES          VALUE  'Y'.      00570015
007004         88  SU090-DIRECTIVE-RESEND-NO           VALUE  'N'.      00590015
007001     05  SU090-RFID-AUD-DIRECTIVE-SW   PIC X(01).                 00560015
007002         88  SU090-RFID-AUD-DIR-YES              VALUE  'Y'.      00570015
007004         88  SU090-RFID-AUD-DIR-NO               VALUE  'N'.      00590015
006100     05  SU090-RFID-AUD-CNTL-NBR-X.                               00610015
006200         10  SU090-RFID-AUD-CNTL-NBR   PIC 9(09).                 00620015
007010     05  FILLER                        PIC X(88).                 00701017
007100 01  SU090-COMMAREA                    PIC X(01).                 00710015
007200 01  SU090-DIRV-GEN-PGM                PIC X(08) VALUE 'SUKUT129'.00720015
