000010******************************************************************00001000
000020**                        SUWS092                               **00002000
000030**                                                              **00003000
000040**  THIS IS THE COMMAREA PASSED TO THE SUKUT709, USED FOR       **00004000
000050**  TRIP CARTON DETERMINATION FOR PRINT AND APPLY PROCESSING    **00005000
000060**  LENGTH:      BYTES                                          **00006000
000070******************************************************************00007000
000080 01  SU092-ITEM-COMMAREA.                                         00008000
000090     05  SU092-ACCESS-METHOD          PIC X(03).                  00009000
000100         88  SU092-PRINT-APPLY            VALUE 'PNA'.            00010000
000200     05  SU092-RETURN-CODE            PIC X(02).                  00020000
000300         88  SU092-SUCCESSFUL             VALUES ZERO.            00030000
000400         88  SU092-PNA-STA-NOT-FOUND      VALUE '01'.             00040000
000500         88  SU092-SQL-ERROR              VALUE '13'.             00050000
000600     05  SU092-FLAGS.                                             00060000
000700         10  SU092-PRNT-N-APP-TRIP-IND    PIC X(01).              00070000
000800             88  SU092-TRIP-ID-FOUND          VALUE 'Y'.          00080000
000900             88  SU092-NO-TRIP-ID-FOUND       VALUE 'N'.          00090000
001000         10  SU092-PRNT-N-APP-USER-IND    PIC X(01).              00100000
001100             88  SU092-USER-ID-FOUND          VALUE 'Y'.          00110000
001110             88  SU092-NO-USER-ID-FOUND       VALUE 'N'.          00111000
001120     05  SU092-ERROR-NBR              PIC 9(02).                  00112000
001130     05  SU092-ERROR-PARA             PIC X(12).                  00113000
001140     05  SU092-KEYS.                                              00114000
001150         10  SU092-KEY-ACM-STN-NBR    PIC S9(04)  COMP.           00115000
001160         10  SU092-KEY-DC-LOC         PIC S9(9)   COMP.           00116000
001170         10  SU092-KEY-BAR-CODE-1     PIC X(20).                  00117000
001180         10  SU092-KEY-BAR-CODE-2     PIC X(20).                  00118000
001190         10  SU092-KEY-BAR-CODE-3     PIC X(22).                  00119000
001200         10  FILLER                   PIC X(20).                  00120000
001300                                                                  00130000
001400     05  SU092-OUTPUT-FIELDS.                                     00140000
001500         10 SU092-TRIP-ID             PIC S9(09) COMP.            00150000
001600         10 SU092-USER-ID             PIC X(08).                  00160000
001700         10 SU092-DOOR-ID             PIC X(04).                  00170000
001800*                                                                 00180000
001900* DMH 9/14/11 ADDED                                               00190000
002000         10  SU092-UCC128-FOUND-IND       PIC X(01).              00200000
002100             88  SU092-UCC128-FOUND           VALUE 'Y'.          00210000
002200             88  SU092-UCC128-NOT-FOUND       VALUE 'N'.          00220000
002210*                                                                 00221000
002220* DMH 9/21/11 ADDED                                               00222000
002230         10  SU092-MULT-SSCC-IND          PIC X(01).              00223000
002240             88  SU092-MULT-SSCC-YES          VALUE 'Y'.          00224000
002250             88  SU092-MULT-SSCC-NO           VALUE 'N'.          00225000
002300*                                                                 00230000
002400     05  FILLER                       PIC X(148).                 00240000
002500     05  SU092-SQLCA                  PIC X(136).                 00250000
002600 01  SU092-COMMAREA                   PIC X(01).                  00260000
002700 01  SU092-VSM-PGM                    PIC X(08) VALUE 'SUKUT709'. 00270000
