000010******************************************************************00001000
000020*                         SUWS019                                *00002000
000030*                                                                *00003000
000040* SELECTION QUEUE FOR LIST SCREENS FOR THE VENDOR RANK           *00004000
000050* MAINTENANCE SCREENS                                            *00005000
000060******************************************************************00006000
000070                                                                  00007000
000080 01  SU019-SELECT-RECORD.                                         00008000
000090     05  SU019-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00009000
000100                                                COMP-3.           00010000
000200     05  SU019-MAX-ITEMS              PIC 99    VALUE 20.         00020000
000300     05  SU019-SELECTED-ITEM-ARRAY.                               00030000
000400         10  FILLER                   OCCURS 20 TIMES             00040000
000500                                      INDEXED BY SU019-IDX.       00050000
000600             15  SU019-ITEM           PIC S9(9) COMP-3.           00060000
000700             15  SU019-ACTION-SW      PIC X.                      00070000
000800                 88  SU019-INQ                  VALUE 'I'.        00080000
000900                 88  SU019-UPD                  VALUE 'U'.        00090000
001000                 88  SU019-DEL                  VALUE 'D'.        00100000
001100                 88  SU019-ERR                  VALUE 'E'.        00110000
001210             15  SU019-ENT-ID         PIC S9(09)  COMP.           00121002
001220             15  SU019-DEPT-NBR       PIC  9(04).                 00122002
001230             15  SU019-VENDOR-DESC    PIC  X(30).                 00123002
001240             15  SU019-DEPT-DESC      PIC  X(30).                 00124002
001260             15  FILLER               PIC  X(16).                 00126003
001300*                                                                 00130000
