000100******************************************************************        
000200**                        SUWS011                               **        
000300**                                                              **        
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **        
000500**  STORE TRAILER CRIT SPEC SCREEN                              **        
000600**  LENGTH:  200 BYTES                                          **        
000700******************************************************************        
000800         10  SU011-INTER-APPL-COMMAREA  REDEFINES                         
000900             INTER-APPL-COMM-AREA.                                        
001000             15  FILLER                         PIC  X(01).               
001100             15  SU011-CURR-OPER-UNT-ID         PIC S9(04) COMP.          
001200             15  SU011-CURR-LOC-TYPE-CODE       PIC  X(02).               
001300                 88  SU011-STR                       VALUE 'DS'.          
001400                 88  SU011-DISTRIB-CNTR              VALUE 'DC'.          
001500                 88  SU011-CORP                      VALUE 'HQ'.          
001600             15  SU011-CURR-LOC-DIST-NBR        PIC  X(02).               
001700             15  SU011-USER-ID                  PIC  X(08).               
001800             15  SU011-USER-TYPE                PIC  X(02).               
001900                 88  SU011-DISTRICT-MGR              VALUE 'DM'.          
002000                 88  SU011-REGIONAL-MGR              VALUE 'RM'.          
002100                 88  SU011-STR-MGR                   VALUE 'SM'.          
002200                 88  SU011-OSA                       VALUE 'OS'.          
002300             15  SU011-STR-NBR                  PIC S9(04).               
002400             15  SU011-STR-DIST-NBR             PIC  X(02).               
002500             15  SU011-STR-NAME                 PIC  X(25).               
002600             15  SU011-STATUS-SELECTED.                                   
002700                 20  SU011-OPEN-AT-DC           PIC  X(01).               
002800                     88 SU011-DC-OPEN-SEL            VALUE 'S'.           
002900                 20  SU011-DC-CLOSED            PIC  X(01).               
003000                     88 SU011-DC-CLOSED-SEL          VALUE 'S'.           
003100                 20  SU011-DC-SHIPPED           PIC  X(01).               
003200                     88 SU011-DC-SHIPPED-SEL         VALUE 'S'.           
003300                 20  SU011-STR-OPEN             PIC  X(01).               
003400                     88 SU011-STR-OPEN-SEL           VALUE 'S'.           
003500                 20  SU011-STR-UNLOADED         PIC  X(01).               
003600                     88 SU011-STR-UNLD-SEL           VALUE 'S'.           
003700                 20  FILLER                     PIC  X(05).               
003800             15  SU011-STR-UNLD-FROM-DATE.                                
003900                 20  SU011-STR-UNLD-FROM-CCYY PIC    9(04).               
004000                 20  SU011-STR-UNLD-FROM-MM     PIC  9(02).               
004100                 20  SU011-STR-UNLD-FROM-DD     PIC  9(02).               
004200             15  SU011-STR-UNLD-TO-DATE.                                  
004300                 20  SU011-STR-UNLD-TO-CCYY     PIC  9(04).               
004400                 20  SU011-STR-UNLD-TO-MM       PIC  9(02).               
004500                 20  SU011-STR-UNLD-TO-DD       PIC  9(02).               
004510             15  SU011-TRLR-SRL-NBR             PIC  S9(09) COMP.         
004520             15  SU011-TRLR-STATUS              PIC  X(20).               
004521             15  SU011-TRAILER-ID               PIC  X(11).               
004530             15  SU011-SCAC                     PIC  X(04).               
004540             15  SU011-TOTAL-CTNS               PIC  S9(07)               
004541                                                     COMP-3.              
004550             15  SU011-TOTAL-UNITS              PIC  S9(07)               
004551                                                     COMP-3.              
004560             15  SU011-SERVICING-DC             PIC  X(25).               
004570             15  SU011-DEPARTMENT-NAME          PIC  X(25).               
004600             15  SU011-DC-SHIP-X-DAYS-SW        PIC  X(01).               
004610                 88 SU011-DC-SHIP-GRTR-X-DAYS        VALUE 'Y'.           
004700             15  SU011-STR-OPEN-X-DAYS-SW       PIC  X(01).               
004710                 88 SU011-STR-OPEN-GRTR-X-DAYS       VALUE 'Y'.           
004800             15  FILLER                         PIC  X(27).               
