000100******************************************************************00010012
000200**                        SUWS026                               **00020012
000300**                                                              **00030012
000400**  THIS IS THE COMMAREA PASSED TO THE SUKCS594, USED TO        **00040012
000500**  GET SUMMARY INFORMATION ABOUT AN AUDIT.                     **00050012
000600**  LENGTH:  150 BYTES                                          **00060012
000700******************************************************************00070012
000800     05  SU026-CARTON-AUDIT-RECORD.                               00080012
001500         10 SU026-AUDIT-NUMBER              PIC S9(09).           00090012
001501         10 SU026-AUDIT-STATUS-CDE          PIC  X(01).           00100012
001502             88 SU026-IN-PROCESS            VALUE 'I'.            00110012
001503             88 SU026-COMPLETE              VALUE 'C'.            00120012
001504         10 SU026-MULTIPLE-FAILURE-IND      PIC  X(01).           00130012
001505         10 SU026-OPER-UNIT-ID              PIC S9(04) COMP.      00140012
001506         10 SU026-PICK-ERRORS               PIC S9(09) COMP.      00150012
001507         10 SU026-PACK-ERRORS               PIC S9(09) COMP.      00150112
001508         10 SU026-TICKET-ERRORS             PIC S9(09) COMP.      00150212
001509         10 SU026-TOT-TCKT-ERROR-PCT        PIC S9(03)V999 COMP.  00150312
001510         10 SU026-TCKT-ERROR-PCT            PIC S9(03)V999 COMP.  00150412
001511         10 SU026-PICK-ERROR-PCT            PIC S9(03)V999 COMP.  00150512
001512         10 SU026-AUDIT-ERROR-PCT           PIC S9(03)V999 COMP.  00150612
001513         10 SU026-AUDITED-UNITS             PIC S9(04) COMP.      00150712
001514         10 SU026-TOTAL-UNITS               PIC S9(04) COMP.      00150812
001515         10 SU026-AUDITED-CARTONS           PIC S9(04) COMP.      00150912
001516         10 SU026-TOTAL-CARTONS             PIC S9(04) COMP.      00151012
001517         10 SU026-AUDIT-STATUS-DESC         PIC  X(07).           00151112
001518         10 SU026-PACKAGE-TYPE-CODE         PIC  X(02).           00151212
001519         10 SU026-AUDIT-VALIDATION-SW       PIC  X(01).           00151312
001520             88 SU026-INVALID-REQUEST       VALUE 'I'.            00151412
001530             88 SU026-DB2-ERROR             VALUE 'D'.            00151512
001540             88 SU026-SUCCESSFUL            VALUE 'S'.            00151612
001547         10 SU026-PO-STR-ERROR-SW           PIC  X(01).           00151712
001548             88 SU026-PO-STR-ERROR          VALUE 'Y'.            00151812
001549             88 SU026-NO-PO-STR-ERROR       VALUE 'N'.            00151912
001507         10 SU026-RFID-ERRORS               PIC S9(09) COMP.      00152012
001550         10 FILLER                          PIC  X(86).           00153012
