000100******************************************************************00010000
000200*                         SUWS021                                *00020000
000300*                                                                *00030000
000400*  INTER-APPLICATION COMMUNICATION AREA FOR THE PURCHASE ORDER   *00040000
000500*  AUDIT EXCEPTION SCREENS                                       *00050000
000600*  LENGTH = 200 BYTES                                            *00060000
000700******************************************************************00070000
000800         10  SU021-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900                                        INTER-APPL-COMM-AREA.     00090000
001000             15  FILLER                    PIC X.                 00100000
001100             15  SU021-NUMBER-OF-SELECTED-ITEMS                   00110000
001200                                           PIC S9(09) COMP-3.     00120000
001300             15  SU021-NUMBER-OF-TS-ITEMS  PIC S9(05) COMP-3.     00130000
001400             15  SU021-SEL-QUEUE-NAME      PIC  X(08).            00140000
001401             15  SU021-TEMP-QUEUE-UPDATE-SW PIC X(01).            00140104
001402                 88  SU021-UPDATE-TSQ       VALUE 'Y'.            00140204
001403                 88  SU021-NO-TSQ-UPDATE    VALUE 'N'.            00140304
001410                                                                  00141003
001420             15  SU021-PO-NBR               PIC S9(09) COMP.      00142004
001430             15  SU021-PO-LINE-NBR          PIC S9(04) COMP.      00143004
001440             15  SU021-PREPACK-ID           PIC S9(04) COMP.      00144004
001450             15  SU021-OPER-UNT-ID          PIC S9(04) COMP.      00145004
001460             15  SU021-AUDIT-TYPE           PIC X(01).            00146004
001470             15  SU021-PKGNG-CDE            PIC X(01).            00147004
001480             15  SU021-PKGNG-DESC           PIC X(15).            00148004
001490             15  SU021-SHIP-FROM-DATE       PIC X(10).            00149004
001500             15  SU021-SHIP-TO-DATE         PIC X(10).            00150004
001510             15  SU021-OPER-ALL             PIC X(03).            00151004
001600             15  FILLER                     PIC X(132).           00160004
