000010******************************************************************00001000
000020*                         SUWS013                                *00002000
000030*                                                                *00003000
000040*  SELECTION QUEUE FOR LIST SCREENS FOR THE STORE RECEIVING      *00004000
000050*  SCREENS                                                       *00005000
000070******************************************************************00007000
000100                                                                  00010000
000200 01  SU013-SELECT-RECORD.                                         00020000
000300     05  SU013-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00030000
000400                                                COMP-3.           00040000
000500     05  SU013-MAX-ITEMS              PIC 99    VALUE 20.         00050000
000600     05  SU013-SELECTED-ITEM-ARRAY.                               00060000
000700         10  FILLER                   OCCURS 20 TIMES             00070000
000800                                      INDEXED BY SU013-IDX.       00080000
000900             15  SU013-ITEM           PIC S9(9) COMP-3.           00090000
001000             15  SU013-ACTION-SW      PIC X.                      00100000
001100                 88  SU013-INQ                  VALUE 'I'.        00110000
001200                 88  SU013-UPD                  VALUE 'U'.        00120000
001300                 88  SU013-DEL                  VALUE 'D'.        00130000
001400                 88  SU013-ERR                  VALUE 'E'.        00140000
001500             15  SU013-KEY-DATA.                                  00150000
001600*                                                                 00160000
001700                 20  SU013-TRIP-OCRNC-ID          PIC S9(09) COMP.00170000
001701                 20  SU013-TRLR-SRL-NBR           PIC  9(09).     00170100
001710                 20  SU013-SCAC                   PIC  X(04).     00171000
001720                 20  SU013-TRLR-ID                PIC  X(12).     00172000
001800                 20  SU013-TRIP-ID                PIC  9(09).     00180000
001900                 20  SU013-TRIP-STAT-CDE          PIC  X(02).     00190000
001910                 20  SU013-TRIP-STAT-DESC         PIC  X(10).     00191000
002000                 20  SU013-STAT-DATE              PIC  X(10).     00200000
002001                 20  SU013-CAPCTY-PCT             PIC  9(03).     00200100
002002                 20  SU013-JWLRY-IND              PIC  X(01).     00200200
002003                     88 SU013-JWLRY-YES               VALUE 'Y'.  00200300
002004                     88 SU013-JWLRY-NO                VALUE 'N'.  00200400
002005                 20  SU013-AD-MDSE-IND            PIC  X(01).     00200500
002006                     88 SU013-AD-MDSE-YES             VALUE 'Y'.  00200600
002009                     88 SU013-AD-MDSE-NO              VALUE 'N'.  00200900
002010                 20  SU013-CARTON-CNT             PIC S9(09) COMP.00201000
002011                 20  SU013-UNIT-COUNT             PIC S9(09) COMP.00201100
002012*                                                                 00201200
002013                 20  SU013-SUMMARY-TMST           PIC  X(26).     00201300
002014                 20  SU013-SUMMARY-TMST-R REDEFINES               00201400
002015                     SU013-SUMMARY-TMST.                          00201500
002016                     25  SU013-SUMMARY-DATE       PIC  X(10).     00201600
002017                     25  FILLER                   PIC  X(01).     00201700
002018                     25  SU013-SUMMARY-TIME       PIC  X(08).     00201800
002019                     25  FILLER                   PIC  X(07).     00201900
002020*                                                                 00202000
002021                 20  SU013-DEPT-NBR               PIC  9(04).     00202100
002021                 20  SU013-DEPT-NAME              PIC  X(25).     00202200
002022                 20  SU013-CLASS-NBR              PIC  9(04).     00202300
001910                 20  SU013-TRIP-STAT-DESC-LONG    PIC  X(30).     00202401
002021                 20  SU013-BUS-GP-NBR             PIC  9(04).     00202504
002050                 20  FILLER                       PIC  X(33).     00205003
