000100******************************************************************        
000200*  SUWS001 - 360 BYTES                                                    
000300*                                                                         
000400*  THIS MEMBER CONTAINS THE COMMON DATA THAT IS PASSED BETWEEN            
000500*  THE SU ONLINE PROGRAMS IN THE COMMAREA                                 
000600*                                                                         
000700******************************************************************        
000800     05  SU001-COMMON-DATA.                                               
000900         10  SU001-TRANSACTION-STATUS                                     
001000                                         PIC  X(01)  VALUE SPACE.         
001100             88  SU001-INITIALIZE-SCREEN             VALUE 'S'.           
001200             88  SU001-PROCESS-SCREEN                VALUE 'R'.           
001300             88  SU001-LBL-PRT-AT-SCAN               VALUE 'P'.           
001400             88  SU001-WAIT-FOR-CONFIRMATION         VALUE 'W'.           
001500                                                                          
001600*                CAUSES ANOTHER CYCLE TO WAIT FOR DATA ENTRY              
001700*                AFTER FIELDS ARE PRELOADED (SEE SUKRF529)                
001800             88  SU001-WAIT-FOR-KEY-ENTRY            VALUE 'K'.           
001810             88  SU001-HARD-STOP-CANT-USE            VALUE 'H'.           
001900                                                                          
002000         10  SU001-LAST-PROGRAM          PIC  X(08)  VALUE SPACE.         
002100         10  SU001-TERM-ID               PIC  X(04)  VALUE SPACE.         
002200         10  SU001-TRAN-ID               PIC  X(04)  VALUE SPACE.         
002300         10  SU001-USER-ID               PIC  X(08)  VALUE SPACE.         
002400         10  SU001-MANIFEST              PIC S9(09)  VALUE  0             
002500                                                     COMP.                
002600         10  SU001-PRINTER-IND           PIC  X(01)  VALUE SPACE.         
002700             88  SU001-COMTEC-PRINTER                VALUE 'C'.           
002800             88  SU001-RASCAL-PRINTER                VALUE 'R'.           
002900             88  SU001-NO-PRINTER                    VALUE 'N'.           
003000             88  SU001-BATCH-PRINTER                 VALUE 'B'.           
003100             88  SU001-TETHERED-PRINTER              VALUE 'T'.           
003200             88  SU001-PRINT-AND-PEEL                VALUE 'P'.           
003300         10  SU001-DUPLICATE-IND         PIC  X(01)  VALUE SPACE.         
003400         10  SU001-LABEL-IND             PIC  X(01)  VALUE SPACE.         
003500         10  SU001-OPER-UNT-ID           PIC S9(04)  VALUE  0             
003600                                                     COMP.                
003700         10  SU001-FCLTY-ID              PIC S9(04)  VALUE  0             
003800                                                     COMP.                
003900         10  SU001-CARTON                PIC S9(18)  VALUE  0             
004000                                                     COMP.                
004100         10  SU001-PO                    PIC S9(09)  VALUE  0             
004200                                                     COMP.                
004300         10  SU001-STORE                 PIC S9(04)  VALUE  0             
004400                                                     COMP.                
004500         10  SU001-STORE-OPER-UNT-ID     PIC S9(04)  VALUE  0             
004600                                                     COMP.                
004700         10  SU001-NOT-FOUND-IND         PIC  X(01)  VALUE SPACE.         
004800             88  SU001-ADD-NOT-FOUND                 VALUE 'A'.           
004900             88  SU001-SKIP-NOT-FOUND                VALUE 'S'.           
005000         10  SU001-MISDIRECT-IND         PIC  X(01)  VALUE SPACE.         
005100             88  SU001-MISDIRECT                     VALUE 'Y'.           
005200         10  SU001-OPER-UNT-IND          PIC  X(01)  VALUE SPACE.         
005300             88  SU001-DIFFERENT-OPER-UNT            VALUE 'Y'.           
005400         10  SU001-BAD-CHECK-DIGIT-IND   PIC  X(01)  VALUE SPACE.         
005500             88  SU001-BAD-CHECK-DIGIT               VALUE 'N'.           
005600             88  SU001-GOOD-CHECK-DIGIT              VALUE 'Y'.           
005700         10  SU001-PACK-BY-STORE-IND     PIC  X(01)  VALUE 'N'.           
005800             88  SU001-PACK-BY-STORE                 VALUE 'Y'.           
005900             88  SU001-NOT-PACK-BY-STORE             VALUE 'N'.           
006000         10  SU001-WRONG-FCLTY-IND       PIC  X(01)  VALUE SPACE.         
006100             88  SU001-WRONG-FCLTY                   VALUE 'W'.           
006200         10  SU001-REC-NOT-FOUND-IND     PIC  X(01)  VALUE SPACE.         
006300             88  SU001-NOT-FOUND                     VALUE 'N'.           
006400         10  SU001-TURN-PRINTER-ON-IND   PIC  X(01)  VALUE SPACE.         
006500             88  SU001-TURN-PRINTER-ON               VALUE 'Y'.           
006600         10  SU001-PRINTER-ID            PIC  X(08)  VALUE SPACE.         
006700         10  SU001-ORIGIN-OPER-UNT-ID    PIC S9(04)  VALUE ZERO           
006800                                                     COMP.                
006900         10  SU001-525-SCREEN-SELECTION-TBL.                              
007000             15  SU001-525-SCREEN-SELECTION-REC                           
007100                     OCCURS 5 TIMES.                                      
007200                 20  CA-525-PRINT-RPT-IND PIC X(01)  VALUE SPACES.        
007300                 20  SU001-525-RPT-NUMBER PIC X(02)  VALUE SPACES.        
007400                 20  SU001-525-RPT-DESC   PIC X(14)  VALUE SPACES.        
007500                                                                          
007600         10  SU001-525-REPORT-SELECTION-TBL.                              
007700             15  CA-525-STATISTICS-RPT-IND  PIC X(01) VALUE SPACE.        
007800             15  CA-525-WORKSHEET-RPT-IND   PIC X(01) VALUE SPACE.        
007900             15  SU001-525-CARTONS-RPT-IND  PIC X(01) VALUE SPACE.        
008000             15  CA-525-FREE-ASTRAY-RPT-IND PIC X(01) VALUE SPACE.        
008100             15  CA-525-MISDIRECT-RPT-IND   PIC X(01) VALUE SPACE.        
008200             15  CA-525-DUPLICATE-RPT-IND   PIC X(01) VALUE SPACE.        
008300             15  SU001-525-SCAN-RPT-IND     PIC X(01) VALUE SPACE.        
008400             15  SU001-525-UNUSED-RPT-IND   PIC X(01) VALUE SPACE.        
008500                                                                          
008600         10  SU001-BATCH-NUMBER          PIC  9(04)  VALUE ZERO           
008700                                                     COMP.                
008800         10  SU001-RCVR-SEQ-NBR          PIC  9(09)  VALUE ZERO           
008900                                                     COMP.                
009000         10  SU001-PO-LINE-NBR           PIC  9(09)  VALUE ZEROES         
009100                                                     COMP.                
009200         10  SU001-CURR-OPER-UNT-ID      PIC  9(04)  VALUE ZERO           
009300                                                     COMP.                
009400         10  SU001-OWNER-SCAC-ID         PIC  X(04)  VALUE SPACES.        
009500         10  SU001-VEH-NBR               PIC  X(10)  VALUE SPACES.        
009600         10  SU001-DC-PRTD-AT-CDE        PIC  X(02)  VALUE SPACES.        
009700         10  SU001-BAR-CODE-STORE        PIC  X(04)  VALUE SPACE.         
009800         10  SU001-PRT-LBL-ON-SCN-CNT    PIC  9(04)  VALUE ZERO           
009900                                                     COMP.                
010000         10  SU001-ROWS-INSERTED         PIC  9(04)  VALUE ZERO           
010100                                                     COMP.                
010200         10  SU001-PRINTER-ID-USE        PIC  X(08)  VALUE SPACES.        
010300         10  SU001-BATCH-NO-USE          PIC S9(04)  VALUE ZERO           
010400                                                     COMP.                
010500         10  SU001-FREE-ASTRAY-IND       PIC  X(01)  VALUE SPACE.         
010600             88  SU001-FREE-ASTRAY                   VALUE 'Y'.           
010700         10  SU001-SHPUNT-NOT-FND-IND    PIC  X(01)  VALUE SPACE.         
010800             88  SU001-SHPUNT-NOT-FND                VALUE 'Y'.           
010900         10  SU001-MULTI-LINE-IND        PIC  X(01)  VALUE SPACE.         
011000             88  SU001-MULTI-LINE                    VALUE 'Y'.           
011100             88  SU001-NOT-MULTI-LINE                VALUE 'N'.           
011200         10  SU001-NO-LINE-IND           PIC  X(01)  VALUE SPACE.         
011300             88  SU001-NO-LINE                       VALUE 'Y'.           
011400             88  SU001-LINE-FND                      VALUE 'N'.           
011500         10  SU001-REPRINT-IND           PIC  X(01)  VALUE SPACE.         
011600             88  SU001-REPRINT                       VALUE 'Y'.           
011700             88  SU001-NOT-REPRINT                   VALUE SPACE.         
011800         10  SU001-LBL-REPRINT-IND       PIC  X(01)  VALUE SPACE.         
011900             88  SU001-LBL-REPRINT                   VALUE 'Y'.           
012000             88  SU001-NOT-LBL-REPRINT               VALUE SPACE.         
012100         10  SU001-REPRINT-FORM-SW       PIC  X(01)  VALUE SPACE.         
012200             88  SU001-REPRINT-FORM                  VALUE 'Y'.           
012300             88  SU001-NOT-REPRINT-FORM              VALUE 'N'.           
012400             88  SU001-NO-FORM-SENT                  VALUE SPACE.         
012500         10  SU001-INVALID-DATA-CDE      PIC  X(01)  VALUE SPACE.         
012600             88  SU001-INVLD-MTCH-PO-LNE             VALUE 'A'.           
012700         10  SU001-CRTN-ATT-TO-RCVR-SW   PIC  X(01)  VALUE SPACE.         
012800             88  SU001-CRTN-ATT-TO-RCVR              VALUE 'Y'.           
012900             88  SU001-NOT-CRTN-ATT-TO-RCVR          VALUE 'N'.           
013000         10  SU001-CRTN-ATT-TO-TRIP-SW   PIC  X(01)  VALUE SPACE.         
013100             88  SU001-CRTN-ATT-TO-TRIP              VALUE 'Y'.           
013200             88  SU001-NOT-CRTN-ATT-TO-TRIP          VALUE 'N'.           
013300         10  SU001-LBL-MANIFEST-NBR      PIC  9(09)  VALUE ZEROES         
013400                                                     COMP.                
013500         10  SU001-USER-ID-USE           PIC  X(08)  VALUE SPACE.         
013600         10  SU001-REPORT-REQUEST-SW     PIC  X(01)  VALUE SPACES.        
013700             88  SU001-RPT-REQUESTED                 VALUE 'Y'.           
013800             88  SU001-NO-RPT-REQUESTED              VALUE 'N'.           
013900         10  SU001-OUTR-PACK-QTY         PIC  S9(5)  VALUE                
014000                                                     ZEROES COMP.         
014100         10  SU001-SESSION-ID            PIC  X(08)  VALUE SPACE.         
014200         10  SU001-SUKRF530-MESSAGE      PIC  X(01)  VALUE SPACE.         
014300             88  SU001-UCC128-PBS-RCVR               VALUE 'A'.           
014400             88  SU001-UCC128-NO-RCVR                VALUE 'B'.           
014500             88  SU001-UCC128-CENTRAL-STOCK          VALUE 'C'.           
014600             88  SU001-UCC128-DUP-CTN                VALUE 'D'.           
014700             88  SU001-UCC128-COMTEC-INPK            VALUE 'E'.           
014800             88  SU001-UCC128-AUDIT-CHECK            VALUE 'F'.           
014900             88  SU001-UCC128-GENERAL-MESS           VALUE 'G'.           
015000             88  SU001-ASGMT-CLOSED-RETURN           VALUE 'H'.           
015100             88  SU001-UCC128-IGNORED                VALUE 'I'.           
015200             88  SU001-UCC128-NO-LABEL-DATA          VALUE 'L'.           
015300             88  SU001-UCC128-NOT-AVAILABLE          VALUE 'N'.           
015400             88  SU001-UCC128-PREPK-ORD              VALUE 'P'.           
015500             88  SU001-CREATE-SOURCE-RECV            VALUE 'R'.           
015600             88  SU001-STAT-WARNG-MESSGE-DEP         VALUE 'S'.           
015700             88  SU001-FREE-ASTRY-TRIP-MESS          VALUE 'T'.           
015800             88  SU001-INACTV-CRTN-MESSAGE           VALUE 'V'.           
015900             88  SU001-STAT-WARNG-MESSGE-DEL         VALUE 'W'.           
016000             88  SU001-UCC128-UNABLE-TO-ASSIGN       VALUE 'X'.           
016010             88  SU001-DEPARTED-DIFF-DC              VALUE 'Y'.           
016020             88  SU001-DEPARTED-AFTER-DAYS           VALUE 'Z'.           
016100         10  SU001-PREPK-ID              PIC  S9(4)  COMP.                
016200         10  SU001-PKGNG-CDE             PIC  X(01)  VALUE SPACE.         
016300         10  SU001-RASCAL-FORM-IND       PIC  X(01)  VALUE SPACE.         
016400             88  SU001-RASCAL-SML-FORM               VALUE 'S'.           
016500             88  SU001-RASCAL-P2L-FORM               VALUE 'P'.           
016600             88  SU001-RASCAL-MSG-FORM               VALUE 'M'.           
016700         10  SU001-P2L-LBL-IND           PIC  X(01)  VALUE SPACE.         
016800             88  SU001-P2L-LBL-CREATED               VALUE 'Y'.           
016900             88  SU001-NO-P2L-LBL-CREATED            VALUE 'N'.           
017000         10  SU001-RECEIV-PBS-IND        PIC  X(01)  VALUE SPACE.         
017100         10  SU001-ALL-PO-IND            PIC  X(01)  VALUE SPACE.         
017200             88  SU001-ALL-PO-NBRS                   VALUE 'Y'.           
017300             88  SU001-NOT-ALL-PO-NBRS               VALUE 'N'.           
017400         10  SU001-PO2                   PIC S9(09)  VALUE  0             
017500                                                     COMP.                
017600         10  SU001-PO3                   PIC S9(09)  VALUE  0             
017700                                                     COMP.                
017800         10  SU001-PO4                   PIC S9(09)  VALUE  0             
017900                                                     COMP.                
018000         10  SU001-PO5                   PIC S9(09)  VALUE  0             
018100                                                     COMP.                
018200         10  SU001-PO6                   PIC S9(09)  VALUE  0             
018300                                                     COMP.                
018400         10  SU001-PO7                   PIC S9(09)  VALUE  0             
018500                                                     COMP.                
018600         10  SU001-PO8                   PIC S9(09)  VALUE  0             
018700                                                     COMP.                
018800         10  SU001-RQST-TMST             PIC  X(26)  VALUE SPACE.         
018900         10  SU001-FKEY-PROCESSING-IND   PIC  X(1)   VALUE SPACES.        
019000             88 SU001-F2-PROCESSING                  VALUE '1'.           
019100             88 SU001-F4-PROCESSING                  VALUE '2'.           
019200         10  SU001-SUBMIT-JOB-SW         PIC  X(1)   VALUE SPACES.        
019300             88 SU001-SUBMIT-JOB                     VALUE 'Y'.           
019400             88 SU001-NO-SUBMIT                      VALUE 'N'.           
019500         10  SU001-CONFIRM-SW            PIC X(01)   VALUE 'Y'.           
019600             88  SU001-TRIP-CONFIRMED                VALUE 'Y'.           
019700             88  SU001-TRIP-NOT-CONFIRMED            VALUE 'N',           
019800                                                       SPACE.             
019900         10  SU001-AUDIT-CNTL-NBR        PIC  9(09)  VALUE ZEROES         
020000                                                     COMP.                
020100         10  SU001-PROMPT-IND            PIC  X(1)   VALUE SPACES.        
020200         10  SU001-AUDIT-FAILED-IND      PIC  X(1)   VALUE SPACES.        
020300         10  SU001-PRE-PACK-ID           PIC S9(04).                      
020400         10  SU001-PKSL-SEQ-NBR          PIC S9(04) COMP.                 
020500         10  SU001-ASGMT-STRT-DTE        PIC  X(10)  VALUE SPACE.         
020600             88  SU001-DC-NOT-INTERFACED             VALUE SPACE.         
020700         10  SU001-ASGMT-NBR-TXT         PIC  X(10)  VALUE SPACE.         
020800         10  SU001-ASGMT-NBR-SEQ-NBR     PIC S9(09)  VALUE ZERO           
020900                                                     COMP.                
021000         10  SU001-DOOR-ID               PIC  X(04)  VALUE SPACE.         
021100         10  SU001-ECOMM-DC-SW           PIC  X(01)  VALUE 'N'.           
021200             88  SU001-ECOMM-DC-YES                  VALUE 'Y'.           
021300             88  SU001-ECOMM-DC-NO                   VALUE 'N'.           
021400         10  SU001-P4-SW                 PIC  X(01)  VALUE 'N'.           
021500             88  SU001-P4-YES                        VALUE 'Y'.           
021600             88  SU001-P4-NO                         VALUE 'N'.           
021700         10  SU001-P4-PROMPT-FLAG        PIC  X(01)  VALUE 'N'.           
021710         10  SU001-SEQ-START-NBR         PIC  S9(09) COMP.                
021720         10  SU001-AUTO-VE-SW            PIC  X(01)  VALUE 'N'.           
021730             88  SU001-AUTO-VE-YES                   VALUE 'Y'.           
021740             88  SU001-AUTO-VE-NO                    VALUE 'N'.           
021750         10  SU001-ECOMM-DC-REPUR-SW     PIC  X(01)  VALUE 'N'.           
021760             88  SU001-ECOMM-DC-REPURPOSE            VALUE 'Y'.           
021770             88  SU001-ECOMM-DC-REPURPOSE-NO         VALUE 'N'.           
021780         10  SU001-FLOWBACK-SW           PIC  X(01)  VALUE 'N'.           
021790             88  SU001-FLOWBACK-YES                  VALUE 'Y'.           
021800             88  SU001-FLOWBACK-NO                   VALUE 'N'.           
021810         10  SU001-P2L-MOD-UPD-SW        PIC  X(01)  VALUE ' '.           
021820             88  SU001-P2L-MOD-UPD-CMPLT             VALUE 'Y'.           
021830             88  SU001-P2L-MOD-UPD-NOT-CMPLT         VALUE 'N'.           
