000010************************************************************      00001006
000020* COMMUNICATION AREA USED TO PASS CARTON INFORMATION TO    *      00002006
000030* TO THE RECEIVER CREATE PROGRAM                           *      00003006
000031* SUWS044              RECORD LENGTH = 900                 *      00003106
000032************************************************************      00003206
000033 01  SU044-COMM-AREA.                                             00003306
000034     05  SU044-SHIPT-UNT-ID            PIC  S9(18)V COMP-3.       00003406
000035     05  SU044-PO                      PIC  S9(9) COMP.           00003508
000036     05  SU044-ORIG-REC-SEQ-NBR        PIC  S9(9) COMP.           00003609
000037     05  SU044-NEW-REC-SEQ-NBR         PIC  S9(9) COMP.           00003709
000038     05  SU044-RCVR-TYPE-CDE           PIC  X(1).                 00003809
000039         88  SU044-RCVR-PBS                 VALUE '1'.            00003909
000040         88  SU044-RCVR-BULK                VALUE '2'.            00004009
000041         88  SU044-RCVR-PREPK               VALUE '3'.            00004109
000042     05  SU044-OPER-UNT-ID             PIC  S9(4) COMP.           00004209
000043     05  SU044-CRTN-OPER-UNT-ID        PIC  S9(4) COMP.           00004309
000044     05  SU044-FCLTY-ID                PIC  S9(4) COMP.           00004409
000045     05  SU044-TRIP-ID                 PIC  S9(9) COMP.           00004509
000046     05  SU044-SCAC-ID                 PIC  X(4).                 00004609
000047     05  SU044-VEH-NBR                 PIC  X(10).                00004709
000048     05  SU044-DEST-STR-NBR            PIC  S9(4) COMP.           00004809
000049     05  SU044-ORIG-SHIP               PIC  S9(9) COMP.           00004909
000050     05  SU044-NEW-SHIP                PIC  S9(9) COMP.           00005009
000051     05  SU044-ORIG-BOL-NBR            PIC  X(16).                00005109
000052     05  SU044-ORIG-PKSL-SEQ-NBR       PIC  S9(4) COMP.           00005209
000053     05  SU044-NEW-PKSL-SEQ-NBR        PIC  S9(4) COMP.           00005309
000054     05  SU044-FUNCTION-SWITCH         PIC  X(1).                 00005409
000055         88  SU044-CREATE-PKSLIP            VALUE '1'.            00005509
000056         88  SU044-DETACH-ONLY              VALUE '2'.            00005609
000057     05  SU044-CALL-SOURCE-SWITCH      PIC  X(1).                 00005709
000058         88  SU044-SRC-CHECKIN              VALUE '1'.            00005809
000059         88  SU044-SRC-VERIFICATION         VALUE '2'.            00005909
000060     05  SU044-UPDATE-PKSLIP-SW        PIC  X(1).                 00006013
000061         88  SU044-UPDATE-PKSLIP-ONLY       VALUE '1'.            00006113
000062         88  SU044-UPDATE-RCVR-PKSLIP       VALUE '2'.            00006214
000063     05  SU044-PROGRAM-NAME            PIC  X(08).                00006310
000064     05  SU044-SUCCESS-IND             PIC  X(01).                00006410
000065         88  SU044-SUCCESSFUL          VALUES                     00006510
000066                                      ZERO, SPACES, LOW-VALUES.   00006610
000067         88  SU044-ERROR                   VALUE '1'.             00006710
000068         88  SU044-INVALID-SQL             VALUE '2'.             00006810
000069         88  SU044-DATABASE-BUSY           VALUE '3'.             00006910
000070     05  SU044-PKSLIP-CRE-SRCE         PIC  X(01).                00007011
000071         88  SU044-ASN-PKSLIP-CREATE       VALUE 'A'.             00007111
000072         88  SU044-FA-PKSLIP-CREATE        VALUE 'F'.             00007211
000073     05  SU044-RECEIVER-CREATE-SRC     PIC  X(02).                00007312
000074         88  SU044-CREATE-FA-RCVR          VALUE 'FA'.            00007412
000075         88  SU044-CREATE-CHECK-IN-RCVR    VALUE 'CI'.            00007512
000076     05  SU044-ORIG-PRO-NBR            PIC  X(22).                00007617
000077     05  SU044-NEW-PRO-NBR             PIC  X(22).                00007718
000078     05  SU044-SQLCA                   PIC  X(136).               00007818
000079     05  SU044-CRA-RET-MSG             PIC  X(133) VALUE SPACES.  00007918
000080     05  SU044-CRA-REQ-ID              PIC  X(08)  VALUE SPACES.  00008018
000081     05  SU044-SIGNON-USER-ID          PIC  X(08)  VALUE SPACES.  00008118
000082     05  SU044-ORIG-COMMAREA           PIC  X(400) VALUE SPACES.  00008218
000076     05  SU044-CARR-AUTH-ID            PIC  X(30).                00008320
000090     05  FILLER                        PIC  X(49)  VALUE SPACE.   00009020
