000010******************************************************************00001000
000020*                         SUWS039                                *00002000
000030*                                                                *00003000
000040*  SELECTION QUEUE FOR LIST SCREENS FOR THE STORE UNIT           *00004001
000050*  ADJUSTMENT SCREENS                                            *00005001
000060******************************************************************00006011
000070                                                                  00007012
000080 01  SU039-SELECT-RECORD.                                         00008012
000090     05  SU039-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00009012
000100                                                COMP-3.           00010012
000200     05  SU039-MAX-ITEMS              PIC 99    VALUE 20.         00020012
000300     05  SU039-SELECTED-ITEM-ARRAY.                               00030012
000400         10  FILLER                   OCCURS 20 TIMES             00040012
000500                                      INDEXED BY SU039-IDX.       00050012
000600             15  SU039-ITEM           PIC S9(9) COMP-3.           00060012
000700             15  SU039-ACTION-SW      PIC X.                      00070012
000800                 88  SU039-INQ                  VALUE 'I'.        00080012
000900                 88  SU039-UPD                  VALUE 'U'.        00090012
001000                 88  SU039-DEL                  VALUE 'D'.        00100012
001100                 88  SU039-ERR                  VALUE 'E'.        00110012
001200             15  SU039-KEY-DATA.                                  00120012
001300*                                                                 00130012
001400                 20  SU039-OPER-UNT-ID        PIC S9(04) COMP.    00140012
001410                 20  SU039-STR-NBR            PIC S9(04) COMP.    00141012
001420                 20  SU039-PO-RCVR            PIC  X(13).         00142012
001430                 20  SU039-LINE               PIC S9(04).         00143012
001440                 20  SU039-SKU                PIC S9(08).         00144012
001800                 20  SU039-UPC                PIC S9(15).         00180011
001900                 20  SU039-NET-ADJ            PIC S9(06).         00190011
001910                 20  SU039-ADJ-SOURCE         PIC  X(08).         00191011
001920                 20  SU039-FAIL-SUCCSS        PIC  X(01).         00192012
001930                 20  SU039-ACKNOWLEDGE        PIC  X(01).         00193012
001940                 20  SU039-BEF-QTY            PIC S9(04) COMP.    00194011
001950                 20  SU039-AFT-QTY            PIC S9(04) COMP.    00195011
001960                 20  SU039-ADJ-TYP            PIC  X(05).         00196011
001970                 20  SU039-ERR-CDE            PIC  X(08).         00197011
001980                 20  SU039-FINCL-ID           PIC S9(09) COMP.    00198011
001990                 20  SU039-SHIPT-UNT-ID       PIC S9(18)V COMP-3. 00199011
002000                 20  SU039-PROCESS-GROUP      PIC  X(01).         00200012
002010                 20  SU039-PROCESS-GRP-DESC   PIC  X(25).         00201013
002019*                                                                 00201900
002025                 20  FILLER                   PIC  X(03).         00202513
