000100***************************************************************** 00010000
000200*    COMMAREA FOR CARTON CHECK IN - THIN SLICE MODULE             00020000
000400*    RECORD LENGTH:  200 BYTES                                    00040001
000500***************************************************************** 00050000
000600 01  SU109-THIN-SLICE-COMM.                                       00060000
000601*                                                                 00060100
000610*----------------------------------------------------------------*00061000
000620*  INPUT FROM PNA & RF CHECK IN                                  *00062000
000630*----------------------------------------------------------------*00063000
000640*                                                                 00064000
000700     05  SU109-OPER-UNT-ID           PIC  S9(04)       COMP.      00070000
000710     05  SU109-TRIP-ID               PIC  S9(09)       COMP.      00071000
000720     05  SU109-DOOR-NUMBER           PIC  X(04)  VALUE SPACE.     00072000
000800     05  SU109-ACM-LBL-STA-NBR       PIC  S9(09)       COMP.      00080000
000801     05  SU109-USER-ID               PIC   X(08) VALUE SPACE.     00080100
000810*                                                                 00081000
000900     05  SU109-BAR-CODE              PIC   9(18) VALUE ZEROS.     00090006
000910     05  SU109-ORD-NBR               PIC   9(09) VALUE ZEROS.     00091006
000911     05  SU109-REC-SEQ-NBR           PIC   9(04) VALUE ZEROS.     00091106
000920     05  SU109-ORD-LNE-NBR           PIC   9(04) VALUE ZEROS.     00092006
000930     05  SU109-PREPK-ID              PIC   9(04) VALUE ZEROS.     00093006
001000     05  SU109-PACK-BY-ST-IND        PIC   X(1).                  00100000
001001         88  SU109-PBS                           VALUE 'Y'.       00100100
001002         88  SU109-PBS-NO                        VALUE ' '.       00100200
001003     05  SU109-PKGNG-CDE             PIC   X(1).                  00100300
001004         88  SU109-PREPACK                       VALUE 'M'.       00100400
001005         88  SU109-BULK                          VALUE 'B'.       00100500
001006*                                                                 00100600
001007*----------------------------------------------------------------*00100700
001008*  RESULTS                                                       *00100800
001009*----------------------------------------------------------------*00100900
001010*                                                                 00101000
001011     05  SU109-DC-THIN-SLICE-SW      PIC   X(01) VALUE 'N'.       00101100
001012         88  SU109-DC-THIN-SLICE                 VALUE 'Y'.       00101200
001013         88  SU109-DC-THIN-SLICE-NO              VALUE 'N'.       00101300
001014*                                                                 00101400
001015     05  SU109-DC-PNA-THIN-SLICE-SW  PIC   X(01) VALUE 'N'.       00101500
001016         88  SU109-DC-PNA-THIN-SLICE             VALUE 'Y'.       00101600
001017         88  SU109-DC-PNA-THIN-SLICE-NO          VALUE 'N'.       00101700
001018*                                                                 00101800
001019     05  SU109-DC-DOOR-THIN-SLICE-SW PIC   X(01) VALUE 'N'.       00101900
001020         88  SU109-DC-DOOR-THIN-SLICE            VALUE 'Y'.       00102000
001021         88  SU109-DC-DOOR-THIN-SLICE-NO         VALUE 'N'.       00102100
001022*                                                                 00102200
001033     05  SU109-THIN-SLICE-SELECTED-SW PIC   X(01) VALUE 'N'.      00103305
001034         88  SU109-THIN-SLICE-SELECTED            VALUE 'Y'.      00103405
001035         88  SU109-THIN-SLICE-SELECTED-NO         VALUE 'N'.      00103505
001040*                                                                 00104000
001050     05  SU109-SUCCESS-IND           PIC   X(01).                 00105004
001060         88  SU109-SUCCESSFUL                    VALUES           00106004
001070                                      ZERO, SPACES, LOW-VALUES.   00107003
001080         88  SU109-ERROR                         VALUE '1'.       00108004
001090         88  SU109-INVALID-SQL                   VALUE '2'.       00109004
001100         88  SU109-DATABASE-BUSY                 VALUE '3'.       00110004
001210*                                                                 00121004
001300     05  SU109-CRA-RET-CDE           PIC  X(02).                  00130004
001400         88  SU109-CRA-SUCCESSFUL                VALUE '00'.      00140004
001500         88  SU109-CRA-SQLERROR                  VALUE '01'.      00150004
001600         88  SU109-CRA-INVALID                   VALUE '02'.      00160004
001610     05  FILLER                      PIC  X(01).                  00161004
001620     05  SU109-CRA-RET-MSG           PIC  X(25).                  00162004
001630     05  FILLER                      PIC  X(01).                  00163004
001640     05  SU109-CRA-REQ-ID            PIC  X(08).                  00164004
001650     05  FILLER                      PIC  X(13).                  00165004
001660*                                                                 00166004
001700     05  FILLER                      PIC  X(82).                  00170006
