000100******************************************************************00010000
000200*                         SUWS029                                *00020001
000300*                                                                *00030000
000400*  INTER-APPLICATION COMMUNICATION AREA FOR THE AUDIT CARTON     *00040000
000500*  DETAIL LIST SCREENS                                           *00050000
000600*  LENGTH = 200 BYTES                                            *00060000
000700******************************************************************00070000
000800         10  SU029-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900                                        INTER-APPL-COMM-AREA.     00090000
001000             15  FILLER                     PIC X.                00100000
001100             15  SU029-NUMBER-OF-SELECTED-ITEMS                   00110000
001200                                            PIC S9(09) COMP-3.    00120000
001300             15  SU029-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00130000
001400             15  SU029-SEL-QUEUE-NAME       PIC  X(08).           00140000
001500             15  SU029-SYS-MAN-IND              PIC  X(01).       00150002
001600                 88  SU029-SYSTEM           VALUE 'S'.            00160002
001700                 88  SU029-MANUAL           VALUE 'M'.            00170002
001800                 88  SU029-ALL              VALUE 'A'.            00180002
001900             15  SU029-PACKAGING-TYPE           PIC  X(02).       00190002
002000             15  SU029-PROCESS-STATUS           PIC  X(01).       00200002
002013             15  SU029-SOURCE                   PIC  X(03).       00201304
002100             15  SU029-PO                       PIC  9(09).       00210002
002200             15  SU029-RECEIVER-SEQ             PIC  9(03).       00220002
002300             15  SU029-VENDOR-NAME              PIC  X(30).       00230002
002400             15  SU029-ENT-ID                   PIC  9(09).       00240002
002500             15  SU029-DEPT-NBR                 PIC  9(03).       00250002
002600             15  SU029-AUDIT-TYPE               PIC  X(01).       00260002
002700             15  SU029-AUDIT-STATUS             PIC  X(01).       00270002
002800             15  SU029-OPER-UNIT-ID             PIC  9(04).       00280002
002900             15  SU029-FROM-DATE-MM             PIC  9(02).       00290002
003000             15  SU029-FROM-DATE-DD             PIC  9(02).       00300002
003100             15  SU029-FROM-DATE-YY             PIC  9(04).       00310002
003200             15  SU029-TO-DATE-MM               PIC  9(02).       00320002
003300             15  SU029-TO-DATE-DD               PIC  9(02).       00330002
003400             15  SU029-TO-DATE-YY               PIC  9(04).       00340002
003500             15  SU029-AUDIT-NBR                PIC  9(09).       00350003
003600             15  SU029-CARTON-ID                PIC  9(18).       00360002
003710             15  SU029-REQUEST-MDCY             PIC  X(10).       00371005
003740             15  SU029-PO-RECEIVER              PIC  X(13).       00374005
003800             15  FILLER                         PIC  X(50).       00380005
