000010************************************************************      00001000
000020* COMMUNICATION AREA USED TO PASS CARTON INFORMATION TO    *      00002000
000030* TO THE UNIT ADJUSTMENT PROGRAM (SUKUT706)                *      00003000
000031* SUWS036              RECORD LENGTH = 500                 *      00003100
000032************************************************************      00003200
000033 01  SU036-COMM-AREA.                                             00003300
000034     05  SU036-SHIPT-UNT-ID            PIC  S9(18)V COMP-3.       00003400
000036     05  SU036-CRE-TMST                PIC  X(26).                00003600
000037     05  SU036-PRC-RSN-CDE             PIC  X(08).                00003700
000038     05  SU036-ORIG-OPER-UNT-ID        PIC  S9(4) COMP.           00003800
000039     05  SU036-BEFORE-QTY              PIC  S9(9) COMP.           00003900
000040     05  SU036-AFTER-QTY               PIC  S9(9) COMP.           00004000
000041     05  SU036-ADJUST-QTY              PIC  S9(9) COMP.           00004100
000042     05  SU036-CREATE-USER-ID          PIC  X(08).                00004200
000043     05  SU036-PO                      PIC  S9(9) COMP.           00004300
000044     05  SU036-REC-SEQ-NBR             PIC  S9(9) COMP.           00004400
000045     05  SU036-PO-LNE-NBR              PIC  S9(9) COMP.           00004500
000046     05  SU036-ADJ-AUDIT-CNTL-NBR      PIC  S9(9) COMP.           00004600
000047     05  SU036-PROGRAM-NAME            PIC  X(08).                00004700
000048     05  SU036-DEST-LOC-NBR            PIC  S9(9) COMP.           00004800
000049     05  SU036-CASEPACK-DELETE-IND     PIC  X(01).                00004900
000050     05  SU036-UPDATE-UNTS-WORKED-IND  PIC  X(01).                00005000
000051     05  SU036-CART-CREATE-SRC         PIC  X(03).                00005100
000052     05  SU036-SUCCESS-IND             PIC  X(01).                00005200
000053         88  SU036-SUCCESSFUL          VALUES                     00005300
000054                                      ZERO, SPACES, LOW-VALUES.   00005400
000055         88  SU036-ERROR                   VALUE '1'.             00005500
000056         88  SU036-INVALID-SQL             VALUE '2'.             00005600
000057         88  SU036-DATABASE-BUSY           VALUE '3'.             00005700
000058     05  SU036-SQLCA                   PIC  X(136).               00005800
000059     05  SU036-CRA-RET-MSG             PIC  X(133) VALUE SPACES.  00005900
000060     05  SU036-CRA-REQ-ID              PIC  X(08)  VALUE SPACES.  00006000
000061     05  SU036-UPDATE-DISTDT-IND       PIC  X(01).                00006100
000062         88  SU036-UPDATE-DISTDT       VALUE 'Y'.                 00006200
000063         88  SU036-NO-UPDATE-DISTDT    VALUE 'N'.                 00006300
000064     05  SU036-FINCL-ADJ-ID            PIC S9(9) COMP.            00006400
000065     05  SU036-LOG-ONLY-IND            PIC  X(01).                00006500
000066         88  SU036-LOG-ONLY-NO             VALUE 'N'.             00006600
000067         88  SU036-LOG-ONLY                VALUE 'Y'.             00006700
000068         88  SU036-LOG-AS-FAIL             VALUE 'F'.             00006800
000069     05  SU036-PRE-PACK-IND            PIC  X(01).                00006900
000070         88  SU036-PRE-PACK                VALUE 'Y'.             00007000
000080     05  SU036-BEFORE-ODD-UNT-QTY      PIC  S9(9) COMP.           00008000
000090     05  SU036-AFTER-ODD-UNT-QTY       PIC  S9(9) COMP.           00009000
000100     05  SU036-ODD-UNIT-SW             PIC  X(1).                 00010000
000110         88  SU036-ODD-UNIT-YES         VALUE 'Y'.                00011000
000120         88  SU036-ODD-UNIT-NO          VALUE 'N'.                00012000
000130     05  SU036-PACK-SW                 PIC  X(1).                 00013000
000140         88  SU036-PACK-YES             VALUE 'Y'.                00014000
000141         88  SU036-PACK-NO              VALUE 'N'.                00014100
000142     05  SU036-VRFY-ADJ-DRIVE-LNE      PIC X.                     00014200
000143         88  SU036-DRIVE-LINE           VALUE 'A'.                00014300
000144     05  SU036-PACK-ADJUST-QTY         PIC  S9(9) COMP.           00014400
000145     05  SU036-UPDATE-TYPE-IND         PIC  X(01).                00014500
000146         88  SU036-COMPLETE                VALUE '1'.             00014600
000147         88  SU036-VERIFIED                VALUE '2'.             00014700
000148         88  SU036-POST-VERIFIED           VALUE '3'.             00014800
000149         88  SU036-UPDATE-ERROR            VALUE '4'.             00014900
000150         88  SU036-NO-CHANGE               VALUE '5'.             00015000
000160     05  SU036-PACK-ID                 PIC S9(04)  COMP.          00016000
000170     05  SU036-PACK-BY-STORE-SW        PIC  X(1).                 00017000
000180         88  SU036-PACK-BY-STORE-YES    VALUE 'Y'.                00018000
000181     05  SU036-INCREMENT-UNITS-SW      PIC  X(1).                 00018104
000182         88  SU036-INCREMENT-UNITS      VALUE 'Y'.                00018204
000183         88  SU036-DECREMENT-UNITS      VALUE 'N'.                00018304
000190     05  FILLER                        PIC  X(089)  VALUE SPACE.  00019004
