000100****************************************************************  00010034
000200*                        SUWS005                               *  00020034
000300*                                                              *  00030034
000400*  THIS IS THE COPYBOOK MEMEBER THAT WILL CONTAIN THE MESSAGES *  00040034
000500*  USED IN THE UCC128 VENDOR ACCURACY CARTON AUDIT RF SYSTEM   *  00050034
000600*  LENGTH                                                         00060034
000700****************************************************************  00070034
000800 01  PM-PGM-MSG-DATA.                                             00080034
000900     05  PM-DB2-FATAL-ERROR-MSG          PIC  X(19)  VALUE        00090034
001000         'DB2 ERR/HELP DESK  '.                                   00100034
001100     05  PM-TRANS-NOT-AVAILABLE-MSG      PIC  X(19)  VALUE        00110034
001200         'TRANS NOT AVAILABLE'.                                   00120034
001300     05  PM-CICS-FATAL-ERROR-MSG         PIC  X(19)  VALUE        00130034
001400         'CICS ERR/HELP DESK '.                                   00140034
001500     05  PM-UNRECOGNIZED-PF-KEY-MSG      PIC  X(19)  VALUE        00150034
001600         'UNRECOGNIZED PF KEY'.                                   00160034
001700     05  PM-SYSTEM-ERROR-MSG             PIC  X(19)  VALUE        00170034
001800         'SYSTEM ERR/HELP DES'.                                   00180034
001900     05  PM-NUMERIC-VALUE-REQUIRED-MSG   PIC  X(19)  VALUE        00190034
002000         'NUMERIC VALUE REQ. '.                                   00200034
002100     05  PM-INVALID-SELECTION-MSG        PIC  X(19)  VALUE        00210034
002200         'INVALID SELECTION  '.                                   00220034
002300     05  PM-DB2-ACCESS-ERROR-MSG         PIC  X(19)  VALUE        00230034
002400         'DB2 ACCESS ERROR   '.                                   00240034
002500     05  PM-DUNNS-NBR-INFO-MISSING-MSG   PIC  X(19)  VALUE        00250034
002600         'DUNS # INFO MISSING'.                                   00260034
002700     05  PM-NOT-A-DC-MSG                 PIC  X(19)  VALUE        00270034
002800         'NOT A VALID DC     '.                                   00280034
002900     05  PM-UPC-NOT-FOUND-MSG            PIC  X(19)  VALUE        00290034
003000         'UPC DOES NOT EXIST '.                                   00300034
003100     05  PM-UPC-NOT-VALID-MSG            PIC  X(19)  VALUE        00310034
003200         'UPC NOT VALID      '.                                   00320034
003300     05  PM-UPC-NOT-ASSOC-TO-SKU-MSG     PIC  X(19)  VALUE        00330034
003400         'UPC NOT ASSOC 2 SKU'.                                   00340034
003500     05  PM-UPC-NOT-NUMERIC-MSG          PIC  X(19)  VALUE        00350034
003600         'UPC NOT NUMERIC    '.                                   00360034
003700     05  PM-SKU-NOT-NUMERIC-MSG          PIC  X(19)  VALUE        00370034
003800         'SKU NOT NUMERIC    '.                                   00380034
003900     05  PM-SKU-NOT-VALID-MSG            PIC  X(19)  VALUE        00390034
004000         'SKU NOT VALID      '.                                   00400034
004100     05  PM-NO-VNDR-NAME-FOUND-MSG       PIC  X(19)  VALUE        00410034
004200         'NO VNDR NAME FOUND '.                                   00420034
004300     05  PM-ENTER-THROUGH-MENU-MSG       PIC  X(19)  VALUE        00430034
004400         'ENTER THROUGH MENU '.                                   00440034
004500     05  PM-NO-BYR-NME-FOUND-MSG         PIC  X(19)  VALUE        00450034
004600         'NO BUYER NAME FOUND'.                                   00460034
004700     05  PM-ACCESS-DENIED-MSG            PIC  X(19)  VALUE        00470034
004800         'USER NOT AUTHORIZED'.                                   00480034
004900     05  PM-CICS-AUTH-ERROR-MSG          PIC  X(19)  VALUE        00490034
005000         'CICSAUTH BAD RETURN'.                                   00500034
005100     05  PM-ONLY-ONE-SELECTION-MSG       PIC  X(19)  VALUE        00510034
005200         'SELECT ONLY ONE    '.                                   00520034
005300     05  PM-AUDIT-NOT-FOUND-MSG          PIC  X(19)  VALUE        00530034
005400         'AUDIT NBR NOT FOUND'.                                   00540034
005500     05  PM-PF2-CONTINUE-MSG             PIC  X(19)  VALUE        00550034
005600         'UPD COMPLT F2-CONT '.                                   00560034
005700     05  PM-INVALID-PRINTER-ID-MSG       PIC  X(19)  VALUE        00570034
005800         'INVALID PRINTER ID '.                                   00580034
005900     05  PM-PRINTER-ID-REQUIRED-MSG      PIC  X(19)  VALUE        00590034
006000         'PRINTER ID REQUIRED'.                                   00600034
006100     05  PM-RPT-PRINTED-MSG              PIC  X(19)  VALUE        00610034
006200         'REPORT PRINTED     '.                                   00620034
006300     05  PM-SELECT-TYPE-MSG              PIC  X(19)  VALUE        00630034
006400         'SELECT AUDIT TYPE  '.                                   00640034
006500     05  PM-ALREADY-CLOSED-MSG           PIC  X(19)  VALUE        00650034
006600         'ALREADY CLOSED     '.                                   00660034
006700     05  PM-ALREADY-POSTPONED-MSG        PIC  X(19)  VALUE        00670034
006800         'ALREADY POSTPONED  '.                                   00680034
006900     05  PM-AUDIT-CLOSE-MSG              PIC  X(19)  VALUE        00690034
007000         'AUDIT CLOSED       '.                                   00700034
007100     05  PM-SHIP-UNIT-CLOSE-MSG          PIC  X(19)  VALUE        00710034
007200         'CARTON CLOSED      '.                                   00720034
007300     05  PM-SHIP-UNIT-POSTPONED-MSG      PIC  X(19)  VALUE        00730034
007400         'CARTON POSTPONED   '.                                   00740034
007500     05  PM-CONFIRM-RESTART-MSG          PIC  X(19)  VALUE        00750034
007600         'F2 - RESTART CARTON'.                                   00760034
007700     05  PM-CANCEL-RESTART-MSG           PIC  X(19)  VALUE        00770034
007800         'RESTART CANCELED   '.                                   00780034
007900     05  PM-CONFIRM-CLOSE-MSG            PIC  X(19)  VALUE        00790034
008000         'F2 TO CLOSE AUDIT  '.                                   00800034
008100     05  PM-UPC-REQUIRED-MSG             PIC  X(19)  VALUE        00810034
008200         'UPC REQUIRED       '.                                   00820034
008300     05  PM-ERROR-EXISTS-MSG             PIC  X(19)  VALUE        00830034
008400         'AUDIT ERROR EXISTS '.                                   00840034
008500     05  PM-AUDIT-POSTPONED-MSG          PIC  X(19)  VALUE        00850034
008600         'AUDIT IS POSTPONED '.                                   00860034
008700     05  PM-NO-PRINT-MSG                 PIC  X(19)  VALUE        00870034
008800         'NO PRINT/HELP DESK '.                                   00880034
008900     05  PM-OPEN-CARTON-MSG.                                      00890034
009000         10  PM-CTN-COUNT                PIC ZZ9.                 00900034
009100         10  FILLER                      PIC X(16)   VALUE        00910034
009200         ' CTNS STILL OPEN'.                                      00920034
009300     05  PM-F3-NOT-VALID-MSG             PIC  X(19)  VALUE        00930034
009400         'F3 - NOT VALID     '.                                   00940034
009500     05  PM-CREATE-CNTL-NBR-MSG          PIC  X(19)  VALUE        00950034
009600         'CREATE NEW CNTL NBR'.                                   00960034
009700     05  PM-CONFIRM-CONT-MSG             PIC  X(19)  VALUE        00970034
009800         'F2 TO CONFIRM CONT.'.                                   00980034
009900     05  PM-ALREADY-ADD-MSG              PIC  X(19)  VALUE        00990034
010000         'ALREADY ADDED      '.                                   01000034
010100     05  PM-CART-ID-REQ-MSG              PIC  X(19)  VALUE        01010034
010200         'SERIAL SHIP REQUIRD'.                                   01020034
010300     05  PM-PO-NBR-REQ-MSG               PIC  X(19)  VALUE        01030034
010400         'PO NUMBER REQUIRED '.                                   01040034
010500     05  PM-ERR-LOGGED-MSG               PIC  X(19)  VALUE        01050034
010600         'EXP ALREADY LOGGED '.                                   01060034
010700     05  PM-NO-TAG-LOGGED-MSG            PIC  X(19)  VALUE        01070034
010800         'NO TAG EXP CREATED '.                                   01080034
010900     05  PM-CANT-AUD-KOHL-MSG            PIC  X(19)  VALUE        01090035
011000         'CANT AUDIT KOHL SML'.                                   01100035
010900     05  PM-INVALID-ENTRY-MSG            PIC  X(19)  VALUE        01110036
011000         'INVALID ENTRY      '.                                   01120036
010900     05  PM-INVALID-YESNO-MSG            PIC  X(19)  VALUE        01130037
011000         'MUST ENTER Y OR N  '.                                   01140037
010900     05  PM-EPC-ONLY-MSG1                PIC  X(19)  VALUE        01150039
011000         'IF CHOOSE N, CANNOT'.                                   01160039
010900     05  PM-EPC-ONLY-MSG2                PIC  X(19)  VALUE        01170039
011000         'CHOOSE OTHER ERROR '.                                   01180039
