000100******************************************************************00010000
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE UCC-128 SCREENS 00020000
000300*    LENGTH = 200 BYTES                                           00030000
000400******************************************************************00040000
000500         10  SU003-INTER-APPL-COMMAREA  REDEFINES                 00050000
000600                                        INTER-APPL-COMM-AREA.     00060000
000700             15  FILLER                     PIC X.                00070000
000800             15  SU003-NUMBER-OF-SELECTED-ITEMS                   00080000
000900                                            PIC S9(09) COMP-3.    00090000
001000             15  SU003-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00100000
001100             15  SU003-SEL-QUEUE-NAME       PIC X(08).            00110000
001200             15  SU003-OPER-UNT-ID          PIC S9(04) COMP.      00120000
001300             15  SU003-FCLTY-ID             PIC S9(04) COMP.      00130000
001400             15  SU003-FCLTY-NME            PIC X(25).            00140000
001500             15  SU003-PO-NBR               PIC S9(09) COMP.      00150000
001600             15  SU003-REC-SEQ-NBR          PIC S9(09) COMP.      00160000
001700             15  SU003-TRIP-ID              PIC S9(09) COMP.      00170000
001800             15  SU003-SCAC-CDE             PIC X(04).            00180000
001900             15  SU003-TRLR-NBR             PIC X(10).            00190000
002000             15  SU003-STATUS-AR            PIC X(02).            00200000
002100             15  SU003-STATUS-UG            PIC X(02).            00210000
002200             15  SU003-STATUS-UN            PIC X(02).            00220000
002300             15  SU003-STATUS-EN            PIC X(02).            00230000
002400             15  SU003-STATUS-DP            PIC X(02).            00240000
002500             15  SU003-SHIPT-UNT-ID         PIC S9(18) COMP-3.    00250000
002600             15  SU003-ALL-PO-IND           PIC X(01).            00260000
002700                 88  SU003-ALL-PO-NBRS      VALUE 'Y'.            00270000
002800                 88  SU003-NOT-ALL-PO-NBRS  VALUE 'N'.            00280000
002810             15  SU003-TEMP-QUEUE-UPDATE-SW PIC X(01).            00281003
002820                 88  SU003-UPDATE-TSQ       VALUE 'Y'.            00282002
002830                 88  SU003-NO-TSQ-UPDATE    VALUE 'N'.            00283002
002840             15  SU003-PKGNG-CD             PIC X.                00284004
002850                 88  SU003-PRE-PACK-ORDER         VALUE 'I', 'M'. 00285004
002860                 88  SU003-INNER-PREPK            VALUE 'I'.      00286004
002870                 88  SU003-MULTI-SKU-PREPK        VALUE 'M'.      00287004
002880                 88  SU003-SINGLE-SKU-PREPK       VALUE 'S'.      00288004
002890                 88  SU003-CASEPACK               VALUE 'C'.      00289004
002891                 88  SU003-BULK-PACK              VALUE 'B'.      00289104
002900             15  FILLER                     PIC X(105).           00290004
