000100******************************************************************00010000
000200*                         SUWS015                                *00020000
000300*                                                                *00030000
000400*  INTER-APPLICATION COMMUNICATION AREA FOR THE AUDIT RANK MAINT *00040000
000500*  SCREENS                                                       *00050000
000600*  LENGTH = 200 BYTES                                            *00060000
000700******************************************************************00070000
000800         10  SU015-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900                                        INTER-APPL-COMM-AREA.     00090000
001000             15  FILLER                     PIC X.                00100000
001100             15  SU015-NUMBER-OF-SELECTED-ITEMS                   00110000
001200                                            PIC S9(09) COMP-3.    00120000
001300             15  SU015-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00130000
001400             15  SU015-SEL-QUEUE-NAME       PIC  X(08).           00140000
001500             15  SU015-VEND-RNK-CDE         PIC  X(06).           00150001
001700             15  SU015-VEND-RNK-DESC        PIC  X(30).           00170001
001800             15  SU015-TEMP-QUEUE-UPDATE-SW PIC X(01).            00180002
001900                 88  SU015-UPDATE-TSQ       VALUE 'Y'.            00190002
002000                 88  SU015-NO-TSQ-UPDATE    VALUE 'N'.            00200002
004390             15  FILLER                     PIC X(146).           00439002
