000100******************************************************************00020001
000200**                        CNWS100                               **00030010
000300**                                                              **00040001
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00050001
000500**  DIRECTIVE HISORY CRIT SPEC                                  **00060001
000600**  LENGTH:  200 BYTES                                          **00070001
000700******************************************************************00080001
000800         10  SU100-INTER-APPL-COMMAREA  REDEFINES                 00090001
000900                                     INTER-APPL-COMM-AREA.        00100001
001000             15  FILLER                         PIC  X(01).       00110001
001010             15  SU100-FUNCTION                 PIC  X(01).       00120001
001020                 88  SU100-FUNCTION-NONE             VALUE ' '.   00130001
001021                 88  SU100-ADD                       VALUE 'A'.   00140002
001030                 88  SU100-UPD                       VALUE 'U'.   00150002
001100             15  SU100-OPER-UNIT                PIC S9(04) COMP.  00160001
001200             15  SU100-OPER-NAME                PIC  X(25).       00170001
001400             15  SU100-CARTON-ID                PIC  X(22).       00171011
001300             15  SU100-PO-NUMBER                PIC S9(09) COMP.  00180001
001310             15  SU100-RCVR-SEQ-NO              PIC  X(04).       00190008
001320             15  SU100-RCVR-PACK-TYPE           PIC  X(14).       00200001
001330             15  SU100-LINE-NO                  PIC  X(04).       00210001
001400             15  SU100-PACK-ID                  PIC  X(04).       00220001
001400             15  SU100-CRE-PGM-NM               PIC  X(08).       00220107
001400             15  SU100-AUDIT-NUMBER             PIC  X(09).       00221001
001400             15  SU100-ORIG-CASI                PIC  X(01).       00223001
001400             15  SU100-SETCODE                  PIC  X(05).       00224001
001400             15  SU100-YEAR                     PIC  X(04).       00225001
001400             15  SU100-DATE-RANGE-BEGIN         PIC  X(19).       00226003
001400             15  SU100-DATE-RANGE-END           PIC  X(19).       00227003
                   15  SU100-CURSOR-SW                PIC  X(03).       00228004
                       88  SU100-NO-CURSOR                 VALUE 'Z  '. 00229004
                       88  SU100-OPER-UNIT-PO-C1           VALUE 'PO1'. 00230004
                       88  SU100-OPER-UNIT-PO-R-C1         VALUE 'RV1'. 00240006
                       88  SU100-OPER-UNIT-PO-R-LINE-C1    VALUE 'LN1'. 00250006
                       88  SU100-OPER-UNIT-PO-R-PACK-C1    VALUE 'PK1'. 00260006
                       88  SU100-AUDIT-CONTROL-NO-C1       VALUE 'AU1'. 00270004
                       88  SU100-CARTON-ID-C1              VALUE 'CA1'. 00280004
                       88  SU100-OPER-UNIT-DATE-C1         VALUE 'DT1'. 00281004
                       88  SU100-OPER-UNIT-CASI-DATE-C1    VALUE 'CS1'. 00282004
                       88  SU100-OPER-UNIT-SETCODE-YR-C1   VALUE 'SC1'. 00283005
                       88  SU100-DIRECTIVE-RSN-CODE-C1     VALUE 'DC1'. 00284012
                   15  SU100-DIRCODE                  PIC  X(03).       00285015
001450             15  FILLER                         PIC X(048).       00290015
