000100******************************************************************00010000
000200*                         SUWS025                                *00020000
000300*                                                                *00030000
000400* SELECTION QUEUE FOR LIST SCREENS FOR THE AUDIT RESULTS LIST    *00040000
000500* SCREENS                                                        *00050000
000600******************************************************************00060000
000700                                                                  00070000
000800 01  SU025-SELECT-RECORD.                                         00080000
000900     05  SU025-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00090000
001000                                                COMP-3.           00100000
001100     05  SU025-MAX-ITEMS              PIC 99    VALUE 20.         00110000
001200     05  SU025-SELECTED-ITEM-ARRAY.                               00120000
001300         10  FILLER                   OCCURS 20 TIMES             00130000
001400                                      INDEXED BY SU025-IDX.       00140000
001500             15  SU025-ITEM           PIC S9(9) COMP-3.           00150000
001600             15  SU025-ACTION-SW      PIC X.                      00160000
001700                 88  SU025-INQ                  VALUE 'I'.        00170000
001800                 88  SU025-UPD                  VALUE 'U'.        00180000
001900                 88  SU025-DEL                  VALUE 'D'.        00190000
002000                 88  SU025-ERR                  VALUE 'E'.        00200000
002100             15  SU025-KEY-DATA.                                  00210000
002200                 20  SU025-AUDIT-NBR        PIC S9(09)  COMP.     00220003
002300                 20  SU025-SOURCE           PIC  X(03).           00230003
002400                 20  SU025-OPER-UNIT        PIC S9(04)  COMP.     00240011
002500                 20  SU025-PO-RECEIVER      PIC X(13).            00250012
002600                 20  SU025-PACK-LINE        PIC  X(06).           00260006
002700                 20  SU025-SKU              PIC  X(15).           00270017
002800                 20  SU025-REQUEST-DATE     PIC  X(08).           00280007
002900                 20  SU025-REQUEST-MDCY     PIC  X(10).           00290007
003000                 20  SU025-REQUEST-TIME     PIC  X(05).           00300007
003100                 20  SU025-PROCESS-STATUS   PIC  X(07).           00310003
003200                 20  SU025-ERROR-PCT        PIC S9(03)  COMP-3.   00320003
003300                 20  SU025-DEFERRED-IND     PIC  X(01).           00330003
003400                 20  SU025-PROCESS-ST-CDE   PIC  X(01).           00340015
003500                 20  SU025-PKG-TYPE         PIC  X(02).           00350016
003600                 20  SU025-MODIFIED-IND     PIC  X(01).           00360019
003700                 20  FILLER                 PIC  X(09).           00370019
