000100******************************************************************00010000
000200**                        SUWS002                               **00020000
000300**                                                              **00030000
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
000500**  UCC-128 CRITERIA SPECIFICATION                              **00050000
000600**  LENGTH:  200 BYTES                                          **00060000
000700******************************************************************00070000
000800         10  SU002-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900                                     INTER-APPL-COMM-AREA.        00090002
001000             15  FILLER                         PIC  X(01).       00100025
001100             15  SU002-OPER-UNT-ID              PIC S9(04) COMP.  00110014
001200             15  SU002-FCLTY-ID                 PIC S9(04) COMP.  00120016
001300             15  SU002-FCLTY-NME                PIC X(25).        00130020
001400             15  SU002-SCAC                     PIC X(04).        00140014
001500             15  SU002-TRLR-NBR                 PIC X(10).        00150014
001600             15  SU002-STATUS-AR                PIC X(02).        00160024
001700             15  SU002-STATUS-UG                PIC X(02).        00170024
001800             15  SU002-STATUS-UN                PIC X(02).        00180024
001900             15  SU002-STATUS-EN                PIC X(02).        00190029
002000             15  SU002-STATUS-DP                PIC X(02).        00200029
002100             15  SU002-TRIP-ID                  PIC S9(09) COMP.  00210014
002200             15  SU002-PO-NBR                   PIC S9(09) COMP.  00220026
002300             15  SU002-REC-SEQ-NBR              PIC S9(09) COMP.  00230026
002400             15  SU002-SHIPT-UNT-ID             PIC S9(18) COMP-3.00240027
002500             15  FILLER                         PIC X(124).       00250029
