000100******************************************************************00010000
000200*                         SUWS024                                *00020000
000300*                                                                *00030000
000400*  INTER-APPLICATION COMMUNICATION AREA FOR THE AUDIT RESULTS    *00040000
000500*  LIST SCREENS                                                  *00050000
000600*  LENGTH = 200 BYTES                                            *00060017
000700******************************************************************00070000
000800         10  SU024-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900                                        INTER-APPL-COMM-AREA.     00090016
001000             15  FILLER                     PIC X.                00100000
001100             15  SU024-NUMBER-OF-SELECTED-ITEMS                   00110000
001200                                            PIC S9(09) COMP-3.    00120000
001300             15  SU024-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00130000
001400             15  SU024-SEL-QUEUE-NAME       PIC  X(08).           00140000
001500             15  SU024-SYS-MAN-IND          PIC  X(01).           00150017
001600                 88  SU024-SYSTEM                VALUE 'S'.       00160017
001700                 88  SU024-MANUAL                VALUE 'M'.       00170017
001800                 88  SU024-ALL                   VALUE 'A'.       00180017
001900             15  SU024-PACKAGING-TYPE       PIC  X(02).           00190017
002000             15  SU024-PROCESS-STATUS       PIC  X(01).           00200017
002100             15  SU024-PO                   PIC  9(09) COMP-3.    00210017
002200             15  SU024-RECEIVER-SEQ         PIC  9(03).           00220017
002300             15  SU024-VENDOR-NAME          PIC  X(30).           00230017
002400             15  SU024-ENT-ID               PIC  9(09) COMP-3.    00240017
002500             15  SU024-DEPT-NBR             PIC  9(03) COMP-3.    00250017
002600             15  SU024-AUDIT-TYPE           PIC  X(01).           00260017
002700             15  SU024-AUDIT-STATUS         PIC  X(01).           00270017
002800             15  SU024-OPER-UNIT-ID-X.                            00280011
002900                 20  SU024-OPER-UNIT-ID     PIC  9(04).           00290017
003000             15  SU024-FROM-DATE-MM         PIC  9(02).           00300017
003100             15  SU024-FROM-DATE-DD         PIC  9(02).           00310017
003200             15  SU024-FROM-DATE-YY         PIC  9(04).           00320017
003300             15  SU024-TO-DATE-MM           PIC  9(02).           00330017
003400             15  SU024-TO-DATE-DD           PIC  9(02).           00340017
003500             15  SU024-TO-DATE-YY           PIC  9(04).           00350017
003600             15  SU024-AUDIT-NBR            PIC  9(09) COMP-3.    00360017
003700             15  SU024-CARTON-ID            PIC  9(18) COMP-3.    00370017
003800             15  SU024-OPER-DESC            PIC  X(30).           00380017
003900             15  SU024-DEPARTMENT-DESC      PIC  X(30).           00390017
004000             15  SU024-SOURCE               PIC  X(06).           00400017
004100             15  SU024-REQUEST-DATE         PIC  X(10).           00410017
004200             15  SU024-MODIFIED-IND         PIC  X(01).           00420017
004300             15  FILLER                     PIC  X(20).           00430017
