000010************************************************************      00001001
000020* COMMUNICATION AREA USED TO PASS CARTON INFORMATION TO    *      00002001
000030* TO THE UNIT ADJUSTMENT PROGRAM (SUKUT702)                *      00003010
000031* SUWS035              RECORD LENGTH = 500                 *      00003109
000032************************************************************      00003201
000033 01  SU035-COMM-AREA.                                             00003301
000034     05  SU035-SHIPT-UNT-ID            PIC  S9(18)V COMP-3.       00003411
000035     05  SU035-UPC-NBR                 PIC  S9(15)V COMP-3.       00003501
000036     05  SU035-CRE-TMST                PIC  X(26).                00003601
000037     05  SU035-PRC-RSN-CDE             PIC  X(08).                00003701
000038     05  SU035-ORIG-OPER-UNT-ID        PIC  S9(4) COMP.           00003801
000039     05  SU035-BEFORE-QTY              PIC  S9(9) COMP.           00003901
000040     05  SU035-AFTER-QTY               PIC  S9(9) COMP.           00004001
000041     05  SU035-ADJUST-QTY              PIC  S9(9) COMP.           00004103
000043     05  SU035-CREATE-USER-ID          PIC  X(08).                00004301
000044     05  SU035-PO                      PIC  S9(9) COMP.           00004401
000045     05  SU035-REC-SEQ-NBR             PIC  S9(9) COMP.           00004501
000046     05  SU035-PO-LNE-NBR              PIC  S9(9) COMP.           00004601
000047     05  SU035-ADJ-AUDIT-CNTL-NBR      PIC  S9(9) COMP.           00004701
000048     05  SU035-PROGRAM-NAME            PIC  X(08).                00004801
000049     05  SU035-DEST-LOC-NBR            PIC  S9(9) COMP.           00004901
000051     05  SU035-CASEPACK-DELETE-IND     PIC  X(01).                00005101
000052     05  SU035-UPDATE-UNTS-WORKED-IND  PIC  X(01).                00005201
000053     05  SU035-CART-CREATE-SRC         PIC  X(03).                00005306
000056     05  SU035-SUCCESS-IND             PIC  X(01).                00005604
000057         88  SU035-SUCCESSFUL          VALUES                     00005704
000058                                      ZERO, SPACES, LOW-VALUES.   00005804
000059         88  SU035-ERROR                   VALUE '1'.             00005904
000060         88  SU035-INVALID-SQL             VALUE '2'.             00006004
000061         88  SU035-DATABASE-BUSY           VALUE '3'.             00006104
000062     05  SU035-SQLCA                   PIC  X(136).               00006204
000063     05  SU035-CRA-RET-MSG             PIC  X(133) VALUE SPACES.  00006304
000064     05  SU035-CRA-REQ-ID              PIC  X(08)  VALUE SPACES.  00006404
000065     05  SU035-UPDATE-DISTDT-IND       PIC  X(01).                00006501
000070         88  SU035-UPDATE-DISTDT       VALUE 'Y'.                 00007001
000080         88  SU035-NO-UPDATE-DISTDT    VALUE 'N'.                 00008001
000090     05  SU035-FINCL-ADJ-ID            PIC S9(9) COMP.            00009007
000091     05  SU035-LOG-ONLY-IND            PIC  X(01).                00009110
000094         88  SU035-LOG-ONLY-NO             VALUE 'N'.             00009414
000095         88  SU035-LOG-ONLY                VALUE 'Y'.             00009514
000096         88  SU035-LOG-AS-FAIL             VALUE 'F'.             00009614
000097     05  SU035-PRE-PACK-IND            PIC  X(01).                00009714
000098         88  SU035-PRE-PACK                VALUE 'Y'.             00009814
000099     05  SU035-BEFORE-ODD-UNT-QTY      PIC  S9(9) COMP.           00009914
000100     05  SU035-AFTER-ODD-UNT-QTY       PIC  S9(9) COMP.           00010014
000120     05  SU035-ODD-UNIT-SW             PIC  X(1).                 00012016
000130         88  SU035-ODD-UNIT-YES         VALUE 'Y'.                00013015
000140         88  SU035-ODD-UNIT-NO          VALUE 'N'.                00014015
000141     05  SU035-PACK-SW                 PIC  X(1).                 00014117
000142         88  SU035-PACK-YES             VALUE 'Y'.                00014217
000143         88  SU035-PACK-NO              VALUE 'N'.                00014317
000150     05  SU035-VRFY-ADJ-DRIVE-LNE      PIC X.                     00015016
000160         88  SU035-DRIVE-LINE           VALUE 'A'.                00016015
000170     05  SU035-PACK-ADJUST-QTY         PIC  S9(9) COMP.           00017018
000180     05  SU035-UPDATE-TYPE-IND         PIC  X(01).                00018019
000190         88  SU035-COMPLETE                VALUE '1'.             00019019
000192         88  SU035-VERIFIED                VALUE '2'.             00019219
000193         88  SU035-POST-VERIFIED           VALUE '3'.             00019319
000195         88  SU035-UPDATE-ERROR            VALUE '4'.             00019519
000196         88  SU035-NO-CHANGE               VALUE '5'.             00019619
000197     05  SU035-PACK-ID                 PIC S9(04)  COMP.          00019721
000198     05  SU035-PACK-BY-STORE-SW        PIC  X(1).                 00019822
000199         88  SU035-PACK-BY-STORE-YES    VALUE 'Y'.                00019922
000200     05  SU035-CYC-ADJ-NBR             PIC S9(9) COMP.            00020024
000300     05  FILLER                        PIC  X(085)  VALUE SPACE.  00030023
