000100******************************************************************00010000
000200*                         SUWS027                                *00020000
000300*                                                                *00030000
000400*  INTER-APPLICATION COMMUNICATION AREA FOR THE AUDIT CARTON     *00040000
000500*  LIST SCREENS                                                  *00050000
000600*  LENGTH = 200 BYTES                                            *00060000
000700******************************************************************00070000
000800         10  SU027-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900                                        INTER-APPL-COMM-AREA.     00090000
001000             15  FILLER                     PIC X.                00100000
001100             15  SU027-NUMBER-OF-SELECTED-ITEMS                   00110000
001200                                            PIC S9(09) COMP-3.    00120000
001300             15  SU027-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00130000
001400             15  SU027-SEL-QUEUE-NAME       PIC  X(08).           00140000
001500             15  SU027-AUDIT-NBR            PIC  9(09).           00150006
001600             15  SU027-REQUEST-DATE         PIC  X(08).           00160004
001700             15  SU027-REQUEST-MDCY         PIC  X(10).           00170004
001800             15  SU027-REQUEST-TIME         PIC  X(05).           00180004
001900             15  SU027-PROCESS-STATUS       PIC  X(01).           00190004
002000             15  SU027-PO-RECEIVER          PIC  X(13).           00200004
002100             15  SU027-SOURCE               PIC  X(03).           00210004
002200             15  SU027-OPER-UNIT-ID         PIC  9(04).           00220004
002300             15  SU027-OPER-DESC            PIC  X(30).           00230004
002400             15  SU027-PACKAGING-TYPE       PIC  X(02).           00240004
002500             15  SU027-ENT-ID               PIC  9(09).           00250004
002600             15  SU027-VENDOR-NAME          PIC  X(30).           00260004
002700             15  SU027-DEPT-NBR             PIC  9(03).           00270004
002800             15  SU027-DEPARTMENT-DESC      PIC  X(30).           00280004
002900             15  FILLER                     PIC  X(26).           00290005
