000100******************************************************************00001000
000200*                         SUWS022                                *00002000
000300*                                                                *00003000
000400* SELECTION QUEUE FOR LIST SCREENS FOR THE PURCHASE ORDER AUDIT  *00004000
000500* EXCEPTION MAINTENANCE SCREENS                                  *00005000
000600******************************************************************00006000
000700                                                                  00007000
000800 01  SU022-SELECT-RECORD.                                         00008000
000900     05  SU022-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00009000
001000                                                COMP-3.           00010000
001100     05  SU022-MAX-ITEMS              PIC S9(5) COMP-3 VALUE 20.  00020000
001200     05  SU022-SELECTED-ITEM-ARRAY.                               00030000
001300         10  FILLER                   OCCURS 20 TIMES             00040000
001400                                      INDEXED BY SU022-IDX.       00050000
001500             15  SU022-ITEM           PIC S9(9) COMP-3.           00060000
001600             15  SU022-ACTION-SW      PIC X.                      00070000
001700                 88  SU022-INQ                  VALUE 'I'.        00080000
001800                 88  SU022-UPD                  VALUE 'U'.        00090000
001900                 88  SU022-DEL                  VALUE 'D'.        00100000
002000                 88  SU022-ERR                  VALUE 'E'.        00110000
002100             15  SU022-KEY-DATA.                                  00120000
002200                 20  SU022-PO-NBR      PIC 9(09).                 00121000
002300                 20  SU022-PO-LNE-NBR  PIC S9(04) COMP.           00121100
002400                 20  SU022-PREPACK-ID  PIC S9(04) COMP.           00121200
002500                 20  SU022-OPER-UNT-ID PIC S9(04) COMP.           00121300
002600                 20  SU022-AUDIT-TYPE  PIC X(01).                 00121400
002700     05  FILLER                        PIC X(073).                00121500
