000100******************************************************************00010000
000200*                         SUWS028                                *00020000
000300*                                                                *00030000
000400* SELECTION QUEUE FOR LIST SCREENS FOR THE AUDIT CARTON DETAIL   *00040000
000500* LIST SCREENS                                                   *00050000
000600******************************************************************00060000
000700                                                                  00070000
000800 01  SU028-SELECT-RECORD.                                         00080000
000900     05  SU028-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00090000
001000                                                COMP-3.           00100000
001100     05  SU028-MAX-ITEMS              PIC 99    VALUE 20.         00110000
001200     05  SU028-SELECTED-ITEM-ARRAY.                               00120000
001300         10  FILLER                   OCCURS 20 TIMES             00130000
001400                                      INDEXED BY SU028-IDX.       00140000
001500             15  SU028-ITEM           PIC S9(9) COMP-3.           00150000
001600             15  SU028-ACTION-SW      PIC X.                      00160000
001700                 88  SU028-INQ                  VALUE 'I'.        00170000
001800                 88  SU028-UPD                  VALUE 'U'.        00180000
001900                 88  SU028-DEL                  VALUE 'D'.        00190000
002000                 88  SU028-ERR                  VALUE 'E'.        00200000
002100             15  SU028-KEY-DATA.                                  00210000
002200                 20  SU028-CARTON           PIC S9(18)  COMP-3.   00220000
002300                 20  SU028-STATUS           PIC  X(02).           00230000
002400                 20  SU028-START-DATE       PIC  X(08).           00240000
002500                 20  SU028-START-TIME       PIC  X(05).           00250000
002600                 20  SU028-STOP-DATE        PIC  X(08).           00260000
002700                 20  SU028-STOP-TIME        PIC  X(05).           00270000
002800                 20  SU028-USER-ID          PIC  X(08).           00280000
002900                 20  SU028-AUDIT-QTY        PIC S9(09)  COMP.     00290000
003000                 20  SU028-ERROR-COUNT      PIC S9(04)  COMP.     00300000
003100                 20  SU028-AUDIT-NBR        PIC S9(09)  COMP.     00310001
003200                 20  FILLER                 PIC  X(20).           00320000
