000100******************************************************************00010001
000110**                        SUWS098                                 00011001
000120**                                                                00012001
000200* INTER-APPLICATION COMMUNICATION AREA FOR THE                    00013001
000300*       PRINT AND APPLY STATION DOOR SCREENS                      00014001
000400* LENGTH = 200 BYTES                                              00015001
000500******************************************************************00016001
000600         10  SU098-INTER-APPL-COMMAREA  REDEFINES                 00017001
000700                                        INTER-APPL-COMM-AREA.     00018001
000800             15  FILLER                     PIC X.                00019001
000900             15  SU098-NUMBER-OF-SELECTED-ITEMS                   00020001
001000                                            PIC S9(09) COMP-3.    00030001
001100             15  SU098-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00040001
001200             15  SU098-SEL-QUEUE-NAME       PIC X(08).            00050001
001410             15  SU098-OPER-UNT-ID          PIC 9(04).            00060001
001420             15  SU098-FCLTY-ID             PIC 9(04).            00070001
001421             15  SU098-FCLTY-NME            PIC X(25).            00080001
001420             15  SU098-PO-NBR               PIC 9(08).            00090005
001420             15  SU098-RCVR                 PIC 9(04).            00100008
001420             15  SU098-PACK-TYPE            PIC X(14).            00101011
001800             15  SU098-FILLER               PIC X(124).           00108011
