          05  SU103-PNA-SLA-INFO.                                       00010000
               10  SU103-PROCESS-DATE          PIC  X(08)  VALUE SPACES.00010100
               10  SU103-OPER-UNT-ID           PIC  X(04)  VALUE SPACES.00010200
               10  SU103-OPER-UNT-ID-X REDEFINES SU103-OPER-UNT-ID      00010300
                                               PIC  9(04).              00010500
               10  SU103-LANE-NUMBER           PIC  9(04)  VALUE ZERO.  00010600
               10  SU103-TOTL-CARTON-SCANS     PIC S9(09)  VALUE ZERO   00010700
                                                           COMP.        00010800
               10  SU103-TOTL-GT-SLA           PIC S9(09)  VALUE ZERO   00010900
                                                           COMP.        00011000
               10  SU103-FISCAL-YR             PIC  9(04)  VALUE ZERO.  00011100
               10  SU103-FISCAL-MO             PIC  9(02)  VALUE ZERO.  00011200
               10  SU103-FISCAL-WK             PIC  9(02)  VALUE ZERO.  00011300
               10  SU103-FILLER                PIC X(1003) VALUE SPACES.01100000
