000100******************************************************************00010000
000200*    INTER-APPLICATION COMMUNICATION AREA FOR THE OUTBOUND TRLR/  00020000
000210*    DOOR STATUS SCREENS                                          00021000
000300*    LENGTH = 200 BYTES                                           00030000
000400******************************************************************00040000
000500         10  SU009-INTER-APPL-COMMAREA  REDEFINES                 00050000
000600                                        INTER-APPL-COMM-AREA.     00060000
000700             15  FILLER                     PIC X.                00070000
000800             15  SU009-NUMBER-OF-SELECTED-ITEMS                   00080000
000900                                            PIC S9(09) COMP-3.    00090000
001000             15  SU009-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00100000
001100             15  SU009-SEL-QUEUE-NAME       PIC X(08).            00110000
001200             15  SU009-OPER-UNT-ID          PIC S9(04) COMP.      00120000
001210             15  SU009-DOOR-SLOT            PIC  X(06).           00121013
001220             15  SU009-TRLR-SRL-NBR         PIC S9(09) COMP.      00122014
001230             15  SU009-SCAC-CDE             PIC  X(04).           00123014
001240             15  SU009-TRLR-ID              PIC  X(12).           00124014
001250             15  SU009-TRLR-STATUS          PIC  X(10).           00125014
001260             15  SU009-STATUS-DATE          PIC  X(26).           00126014
001270             15  SU009-CARTONS              PIC  X(01).           00127014
001280             15  SU009-DEST-STR-NBR         PIC S9(04) COMP.      00128014
001290             15  SU009-TRIP-ID              PIC S9(09) COMP.      00129014
001300             15  SU009-TRLR-SEAL-NBR        PIC  X(20).           00130014
001400             15  SU009-TRIP-STATUS          PIC  X(24).           00140003
001500             15  SU009-USER-ID              PIC  X(08).           00150014
001600             15  SU009-SML-NBR              PIC  9(18).           00160014
001700             15  SU009-CREATE-ID            PIC  X(03).           00170014
001800             15  SU009-DOOR-ID              PIC  X(04).           00180014
001900             15  SU009-PO-RCVR              PIC  X(12).           00190014
002000             15  SU009-LINE-NBR             PIC  9(04).           00200014
002100             15  SU009-PACKAGE              PIC  X(06).           00210014
002200             15  SU009-TOT-CRTNS            PIC  9(06).           00220014
002810             15  SU009-TEMP-QUEUE-UPDATE-SW PIC  X(01).           00281001
002820                 88  SU009-UPDATE-TSQ       VALUE 'Y'.            00282000
002830                 88  SU009-NO-TSQ-UPDATE    VALUE 'N'.            00283000
002831             15  SU009-REQUEST-TYPE         PIC  X(02).           00283114
002832                 88 SU009-CS-PULL-TRAN           VALUE 'CS'.      00283214
002833                 88 SU009-FX-FAST-TRANSFER       VALUE 'FX'.      00283314
002840             15  FILLER                     PIC X(005).           00284014
