000100******************************************************************00010007
000200**                        SUWS037                               **00020007
000300**                                                              **00030007
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040007
000500**  STORE UNIT ADJUSTMENTS CRIT SPEC                            **00050007
000600**  LENGTH:  200 BYTES                                          **00060007
000700******************************************************************00070007
000800         10  SU037-INTER-APPL-COMMAREA  REDEFINES                 00080007
000900             INTER-APPL-COMM-AREA.                                00090007
001000             15  FILLER                        PIC  X(01).        00100007
001100             15  SU037-CURR-OPER-UNT-ID        PIC S9(04) COMP.   00110007
001200*                                                                 00120007
001300             15  SU037-UNT-ADJ-TYP             PIC  X(01).        00130007
001400                 88  SU037-UNT-ADJ-ALL               VALUE 'A'.   00140007
001500                 88  SU037-UNT-ADJ-CNFRM             VALUE 'C'.   00150007
001600                 88  SU037-UNT-ADJ-POSTV             VALUE 'P'.   00160007
001700                 88  SU037-UNT-ADJ-VERFY             VALUE 'V'.   00170007
001800                 88  SU037-UNT-ADJ-P2L               VALUE 'Q'.   00180008
001900             15  SU037-FAIL-SUCCESS-IND        PIC  X(01).        00190007
002000                 88  SU037-FAIL-SUCC-ALL             VALUE 'A'.   00200007
002100                 88  SU037-FAIL                      VALUE 'F'.   00210007
002200                 88  SU037-SUCCESS                   VALUE 'S'.   00220007
002300                 88  SU037-UNACKNOWLEDGED            VALUE 'U'.   00230008
002400             15  SU037-REQUEST-FROM-DATE.                         00240007
002500                 20  SU037-REQ-FROM-MM         PIC  99.           00250007
002600                 20  SU037-REQ-FROM-DD         PIC  99.           00260007
002700                 20  SU037-REQ-FROM-YY         PIC  9(4).         00270007
002800             15  SU037-REQUEST-TO-DATE.                           00280007
002900                 20  SU037-REQ-TO-MM           PIC  99.           00290007
003000                 20  SU037-REQ-TO-DD           PIC  99.           00300007
003100                 20  SU037-REQ-TO-YY           PIC  9(4).         00310007
003200*                                                                 00320007
003300             15  SU037-OPER-UNT-ID             PIC S9(04) COMP.   00330007
003400             15  SU037-OPER-NAME               PIC  X(25).        00340007
003500             15  SU037-PO                      PIC S9(09) COMP.   00350007
003600             15  SU037-RCVR                    PIC S9(09) COMP.   00360007
003700             15  SU037-LINE                    PIC S9(09) COMP.   00370007
003800             15  SU037-STR-NBR                 PIC S9(04) COMP.   00380007
003900             15  SU037-STR-NAME                PIC  X(25).        00390007
004000             15  SU037-AUDIT-NBR               PIC S9(09) COMP.   00400007
004100             15  SU037-AUDIT-SOURCE            PIC  X(01).        00410007
004200                 88  SU037-MANUAL-AUDIT             VALUE 'M'.    00420007
004300                 88  SU037-SYSTEM-AUDIT             VALUE 'S'.    00430007
004400             15  SU037-AUDIT-TYPE              PIC  X(01).        00440007
004500                 88  SU037-100-PERCENT              VALUE '1'.    00450007
004600                 88  SU037-SPOT                     VALUE '2'.    00460007
004700                 88  SU037-REWORK                   VALUE '3'.    00470007
004800             15  SU037-UPC                     PIC S9(15)V COMP-3.00480007
004900             15  SU037-SKU                     PIC S9(08)V COMP-3.00490007
005000             15  SU037-SML                     PIC S9(18)V COMP-3.00500007
005010             15  SU037-PROCESS-GROUP           PIC  X(01).        00501009
005020                 88  SU037-GROUP-ALL                 VALUE 'A'.   00502009
005030                 88  SU037-GROUP-CRTN                VALUE 'C'.   00503009
005040                 88  SU037-GROUP-P2L                 VALUE 'P'.   00504009
005050             15  SU037-PROCESS-GRP-DESC        PIC  X(25).        00505010
005100*                                                                 00510007
005200             15  FILLER                        PIC  X(58).        00520010
