000010******************************************************************00001000
000020**                        SUWS107                               **00002000
000030**                                                              **00003000
000040**  THIS IS THE LAYOUT OF PKT_TXT TUPLDER FOR E-101 RECORDS     **00004000
000050**  TO SHOW THAT AN EMAIL HAS BEEN TRIGGERED TO DC LP WHEN      **00005000
000051**  A STORE TRIES TO OPEN A TRAILER THAT IS NOT IN THE          **00005100
000052**  CORRECT DC SHIPPED STATUS (PROGRAM SUKCS541)                **00005200
000060**  LENGTH: 100  BYTES                                          **00006000
000070******************************************************************00007000
000080 01  SU107-RECORD-LAYOUT.                                         00008000
000090     05  SU107-SEAL-ID                PIC X(20).                  00009000
000100     05  FILLER                       PIC X(01).                  00010000
000200     05  SU107-TRIP-ID                PIC 9(10).                  00020000
000300     05  FILLER                       PIC X(01).                  00030000
000400     05  SU107-DC-NBR                 PIC 9(04).                  00040000
000500     05  FILLER                       PIC X(01).                  00050000
000510     05  SU107-STORE-NBR              PIC 9(04).                  00051000
000520     05  FILLER                       PIC X(01).                  00052000
000530     05  SU107-TRLR-SRL               PIC 9(10).                  00053000
000540     05  FILLER                       PIC X(01).                  00054000
000600     05  SU107-TRIP-STATUS            PIC X(02).                  00060000
001200     05  FILLER                       PIC X(01).                  00120001
001300     05  SU107-SCAC                   PIC X(04).                  00130001
001400     05  FILLER                       PIC X(01).                  00140001
001500     05  SU107-TRLR-ID                PIC X(12).                  00150002
001600     05  FILLER                       PIC X(27).                  00160001
