000100******************************************************************00010002
000200**                        SUWS017                               **00020002
000300**                                                              **00030002
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040002
000500**  VENDOR RANK MAINTENANCE CRIT SPEC                           **00050002
000600**  LENGTH:  200 BYTES                                          **00060002
000700******************************************************************00070002
000800         10  SU017-INTER-APPL-COMMAREA  REDEFINES                 00080002
000900             INTER-APPL-COMM-AREA.                                00090002
000910             15  FILLER                         PIC  X(01).       00091003
001000             15  SU017-ENT-ID                   PIC  9(09).       00100008
001100             15  SU017-DEPT-NBR                 PIC  9(04).       00110002
001200             15  SU017-VENDOR-DESC              PIC  X(30).       00120002
001210             15  SU017-DEPT-DESC                PIC  X(30).       00121004
001220             15  SU017-SEL-QUEUE-NAME           PIC  X(08).       00122007
001300             15  FILLER                         PIC  X(118).      00130005
