000100******************************************************************00010018
000200**                        SUWS046                               **00020018
000300**                                                              **00030018
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040018
000500**  FREE ASTRAY EXCEPTIONS CRIT SPEC                            **00050018
000600**  LENGTH:  200 BYTES                                          **00060018
000700******************************************************************00070018
000800         10  SU046-INTER-APPL-COMMAREA  REDEFINES                 00080018
000900                                     INTER-APPL-COMM-AREA.        00090018
001000             15  FILLER                         PIC  X(01).       00100018
001100             15  SU046-OPER-UNT-ID              PIC S9(04) COMP.  00110018
001200             15  SU046-FCLTY-ID                 PIC S9(04) COMP.  00120019
001300             15  SU046-FCLTY-NME                PIC X(25).        00130018
001400             15  SU046-SCAC                     PIC X(04).        00140018
001500             15  SU046-TRLR-NBR                 PIC X(10).        00150018
001600             15  SU046-TRIP-ID                  PIC S9(09) COMP.  00160018
001700             15  SU046-PO-NBR                   PIC S9(09) COMP.  00170018
001800             15  SU046-REC-SEQ-NBR              PIC S9(09) COMP.  00180018
001900             15  SU046-SHIPT-UNT-ID             PIC S9(18) COMP-3.00190018
002000             15  SU046-CURR-DATE                PIC X(10).        00200018
002100             15  SU046-FROM-DATE                PIC X(10).        00210026
002200             15  SU046-TO-DATE                  PIC X(10).        00220026
002300             15  SU046-LIST-SEQ-IND             PIC X(01).        00230032
002310                 88  SU046-SCAC-TRLR-SEQ        VALUE 'S'.        00231032
002400                 88  SU046-DATE-ASC-SEQ         VALUE 'A'.        00240032
002500                 88  SU046-DATE-DES-SEQ         VALUE 'D'.        00250032
002600             15  SU046-DATE-SELECTED            PIC X(01).        00260031
002700                 88  SU046-SEL-CURR-DATE         VALUE 'C'.       00270030
002800                 88  SU046-SEL-DATE-RNGE         VALUE 'R'.       00280030
002900             15  FILLER                         PIC X(102).       00290032
