000100****************************************************************  00010013
000200*                         SUWS007                             **  00020013
000300*  THIS IS THE COPYBOOK USED TO DISPLAYING MESSAGES ON THE    **  00030013
000400*  "MESSAGE" SCREEN IN THE UCC128 RF SYSTEM (SUKRF514)        **  00040013
000500****************************************************************  00050013
000600 01  PM-PGM-MSG-NBRS.                                             00060013
000700     05  PM-PGM-MSG-NBR                  PIC  9(02)  VALUE ZEROS. 00070013
000800         88  PM-HOLD-CARTON                          VALUE  1.    00080013
000900         88  PM-UPC-NOT-FOUND                        VALUE  2.    00090013
001000         88  PM-SKU-NOT-FOUND                        VALUE  3.    00100013
001100         88  PM-STYLE-SUB                            VALUE  4.    00110013
001200         88  PM-MISDIRECT                            VALUE  5.    00120013
001300         88  PM-NO-ALLOC                             VALUE  6.    00130013
001400         88  PM-UPC-NOT-ON-CRTN                      VALUE  7.    00140013
001500         88  PM-STYLE-SUB-NOT-ON-CRTN                VALUE  8.    00150013
001600         88  PM-MISDIRECT-NOT-ON-CRTN                VALUE  9.    00160013
001700         88  PM-NO-ALLOC-NOT-ON-CRTN                 VALUE 10.    00170013
001710         88  PM-IMAGE-ONLY-VALIDATION                VALUE 11.    00171014
001720         88  PM-IMAGE-DIM-WGT-VALIDATION             VALUE 12.    00172014
001730         88  PM-IMAGE-DIM-VALIDATION                 VALUE 13.    00173014
001740         88  PM-IMAGE-WGT-VALIDATION                 VALUE 14.    00174014
001750         88  PM-NO-WEB-ITEM-RECORD                   VALUE 15.    00175014
001760         88  PM-DIM-WGT-VALIDATION                   VALUE 16.    00176016
001770         88  PM-DIM-VALIDATION                       VALUE 17.    00177016
001780         88  PM-WGT-VALIDATION                       VALUE 18.    00178016
001790         88  PM-IMAGE-NO-WEB-ITEM-RECORD             VALUE 19.    00179017
001791         88  PM-DEPARTED-ENDED-TRIP                  VALUE 20.    00179119
001792         88  PM-PREPACK-PREV-CLOSED                  VALUE 21.    00179220
001793         88  PM-CARTON-NOT-CHECKED-IN                VALUE 22.    00179322
001794         88  PM-CARTON-CHECKED-OTHR-DC               VALUE 23.    00179426
001795         88  PM-CARTON-ALREADY-LOADED                VALUE 24.    00179526
001800                                                                  00180013
001900 01  PM-PGM-MSG-DATA.                                             00190013
002000     05  PM-HOLD-CARTON-MSG.                                      00200013
002100         10  FILLER                      PIC  X(19)  VALUE        00210013
002200             ' NOTIFY SUPERVISOR '.                               00220013
002300         10  FILLER                      PIC  X(19)  VALUE        00230013
002400             ' CARTON MISDIRECT  '.                               00240013
002500         10  FILLER                      PIC  X(19)  VALUE        00250013
002600             '                   '.                               00260013
002700         10  FILLER                      PIC  X(19)  VALUE        00270013
002800             'HOLD FOR RESOLUTION'.                               00280013
002900         10  FILLER                      PIC  X(19)  VALUE        00290013
003000             '                   '.                               00300013
003100         10  FILLER                      PIC  X(19)  VALUE        00310013
003200             'COLLECT APPROPRIATE'.                               00320013
003300         10  FILLER                      PIC  X(19)  VALUE        00330013
003400             '  DOCUMENTATION    '.                               00340013
003500     05  PM-UPC-NOT-FOUND-MSG.                                    00350013
003600         10  FILLER                      PIC  X(19)  VALUE        00360013
003700             '       UPC         '.                               00370013
003800         10  FILLER                      PIC  X(19)  VALUE        00380013
003900             '       NOT         '.                               00390013
004000         10  FILLER                      PIC  X(19)  VALUE        00400013
004100             '      FOUND        '.                               00410013
004200         10  FILLER                      PIC  X(19)  VALUE        00420013
004300             '                   '.                               00430013
004400         10  FILLER                      PIC  X(19)  VALUE        00440013
004500             '   CONTINUE TO     '.                               00450013
004600         10  FILLER                      PIC  X(19)  VALUE        00460013
004700             '  SKU SCAN SCREEN  '.                               00470013
004800         10  FILLER                      PIC  X(19)  VALUE        00480013
004900             '                   '.                               00490013
005000     05  PM-SKU-NOT-FOUND-MSG.                                    00500013
005100         10  FILLER                      PIC  X(19)  VALUE        00510013
005200             '       SKU         '.                               00520013
005300         10  FILLER                      PIC  X(19)  VALUE        00530013
005400             '       NOT         '.                               00540013
005500         10  FILLER                      PIC  X(19)  VALUE        00550013
005600             '      FOUND        '.                               00560013
005700         10  FILLER                      PIC  X(19)  VALUE        00570013
005800             '                   '.                               00580013
005900         10  FILLER                      PIC  X(19)  VALUE        00590013
006000             '   CONTINUE TO     '.                               00600013
006100         10  FILLER                      PIC  X(19)  VALUE        00610013
006200             '  DATA INFO SCREEN '.                               00620013
006300         10  FILLER                      PIC  X(19)  VALUE        00630013
006400             '                   '.                               00640013
006500     05  PM-STYLE-SUB-MSG.                                        00650013
006600         10  FILLER                      PIC  X(19)  VALUE        00660013
006700             '    STYLE SUB      '.                               00670013
006800         10  FILLER                      PIC  X(19)  VALUE        00680013
006900             '                   '.                               00690013
007000         10  FILLER                      PIC  X(19)  VALUE        00700013
007100             'NOTIFY SUPERVISOR  '.                               00710013
007200         10  FILLER                      PIC  X(19)  VALUE        00720013
007300             ' HOLD CARTON FOR   '.                               00730013
007400         10  FILLER                      PIC  X(19)  VALUE        00740013
007500             '   RESOLUTION      '.                               00750013
007600         10  FILLER                      PIC  X(19)  VALUE        00760013
007700             'COLLECT APPROPRIATE'.                               00770013
007800         10  FILLER                      PIC  X(19)  VALUE        00780013
007900             '  DOCUMENTATION    '.                               00790013
008000     05  PM-MISDIRECT-MSG.                                        00800013
008100         10  FILLER                      PIC  X(19)  VALUE        00810013
008200             '   NO DC OTR FOR   '.                               00820013
008300         10  FILLER                      PIC  X(19)  VALUE        00830013
008400             '    THE PO/LINE    '.                               00840013
008500         10  FILLER                      PIC  X(19)  VALUE        00850013
008600             'NOTIFY SUPERVISOR  '.                               00860013
008700         10  FILLER                      PIC  X(19)  VALUE        00870013
008800             ' HOLD CARTON FOR   '.                               00880013
008900         10  FILLER                      PIC  X(19)  VALUE        00890013
009000             '   RESOLUTION      '.                               00900013
009100         10  FILLER                      PIC  X(19)  VALUE        00910013
009200             'COLLECT APPROPRIATE'.                               00920013
009300         10  FILLER                      PIC  X(19)  VALUE        00930013
009400             '  DOCUMENTATION    '.                               00940013
009500     05  PM-NO-ALLOC-MSG.                                         00950013
009600         10  FILLER                      PIC  X(19)  VALUE        00960013
009700             'NO STORE ALLOCATION'.                               00970013
009800         10  FILLER                      PIC  X(19)  VALUE        00980013
009900             '                   '.                               00990013
010000         10  FILLER                      PIC  X(19)  VALUE        01000013
010100             'NOTIFY SUPERVISOR  '.                               01010013
010200         10  FILLER                      PIC  X(19)  VALUE        01020013
010300             ' HOLD CARTON FOR   '.                               01030013
010400         10  FILLER                      PIC  X(19)  VALUE        01040013
010500             '   RESOLUTION      '.                               01050013
010600         10  FILLER                      PIC  X(19)  VALUE        01060013
010700             'COLLECT APPROPRIATE'.                               01070013
010800         10  FILLER                      PIC  X(19)  VALUE        01080013
010900             '  DOCUMENTATION    '.                               01090013
011000     05  PM-UPC-NOT-ON-CARTON-MSG.                                01100013
011100         10  FILLER                      PIC  X(19)  VALUE        01110013
011200             'UPC NOT EXPECTED IN'.                               01120013
011300         10  FILLER                      PIC  X(19)  VALUE        01130013
011400             '    THIS CARTON    '.                               01140013
011500         10  FILLER                      PIC  X(19)  VALUE        01150013
011600             'NOTIFY SUPERVISOR  '.                               01160013
011700         10  FILLER                      PIC  X(19)  VALUE        01170013
011800             ' HOLD CARTON FOR   '.                               01180013
011900         10  FILLER                      PIC  X(19)  VALUE        01190013
012000             '   RESOLUTION      '.                               01200013
012100         10  FILLER                      PIC  X(19)  VALUE        01210013
012200             'COLLECT APPROPRIATE'.                               01220013
012300         10  FILLER                      PIC  X(19)  VALUE        01230013
012400             '  DOCUMENTATION    '.                               01240013
012500     05  PM-STYLE-SUB-NOT-ON-CRTN-MSG.                            01250013
012600         10  FILLER                      PIC  X(19)  VALUE        01260013
012700             'ITEM NOT EXPECTED  '.                               01270013
012800         10  FILLER                      PIC  X(19)  VALUE        01280013
012900             'IN CARTON-STYLE SUB'.                               01290013
013000         10  FILLER                      PIC  X(19)  VALUE        01300013
013100             'NOTIFY SUPERVISOR  '.                               01310013
013200         10  FILLER                      PIC  X(19)  VALUE        01320013
013300             ' HOLD CARTON FOR   '.                               01330013
013400         10  FILLER                      PIC  X(19)  VALUE        01340013
013500             '   RESOLUTION      '.                               01350013
013600         10  FILLER                      PIC  X(19)  VALUE        01360013
013700             'COLLECT APPROPRIATE'.                               01370013
013800         10  FILLER                      PIC  X(19)  VALUE        01380013
013900             '  DOCUMENTATION    '.                               01390013
014000     05  PM-MISDIRECT-NOT-ON-CRTN-MSG.                            01400013
014100         10  FILLER                      PIC  X(19)  VALUE        01410013
014200             'ITEM NOT EXPECTED  '.                               01420013
014300         10  FILLER                      PIC  X(19)  VALUE        01430013
014400             'IN CRTN-BULK MSDRCT'.                               01440013
014500         10  FILLER                      PIC  X(19)  VALUE        01450013
014600             'NOTIFY SUPERVISOR  '.                               01460013
014700         10  FILLER                      PIC  X(19)  VALUE        01470013
014800             ' HOLD CARTON FOR   '.                               01480013
014900         10  FILLER                      PIC  X(19)  VALUE        01490013
015000             '   RESOLUTION      '.                               01500013
015100         10  FILLER                      PIC  X(19)  VALUE        01510013
015200             'COLLECT APPROPRIATE'.                               01520013
015300         10  FILLER                      PIC  X(19)  VALUE        01530013
015400             '  DOCUMENTATION    '.                               01540013
015500     05  PM-NO-ALLOC-NOT-ON-CRTN-MSG.                             01550013
015600         10  FILLER                      PIC  X(19)  VALUE        01560013
015700             'NO STORE ALLOCATION'.                               01570013
015800         10  FILLER                      PIC  X(19)  VALUE        01580013
015900             '*CARTONIZATION MSG*'.                               01590013
016000         10  FILLER                      PIC  X(19)  VALUE        01600013
016100             'NOTIFY SUPERVISOR  '.                               01610013
016200         10  FILLER                      PIC  X(19)  VALUE        01620013
016300             ' HOLD CARTON FOR   '.                               01630013
016400         10  FILLER                      PIC  X(19)  VALUE        01640013
016500             '   RESOLUTION      '.                               01650013
016600         10  FILLER                      PIC  X(19)  VALUE        01660013
016700             'COLLECT APPROPRIATE'.                               01670013
016800         10  FILLER                      PIC  X(19)  VALUE        01680013
016900             '  DOCUMENTATION    '.                               01690013
016910     05  PM-VISUAL-CHECK-IMAGE-ONLY.                              01691013
016920         10  FILLER                      PIC  X(19)  VALUE        01692013
016930             '    IMAGE ONLY     '.                               01693013
016940         10  FILLER                      PIC  X(19)  VALUE        01694013
016950             '   VALIDATION IS   '.                               01695013
016960         10  FILLER                      PIC  X(19)  VALUE        01696013
016970             '     REQUIRED      '.                               01697013
016980         10  FILLER                      PIC  X(19)  VALUE        01698013
016990             '                   '.                               01699013
016991         10  FILLER                      PIC  X(19)  VALUE        01699113
016992             '                   '.                               01699213
016993         10  FILLER                      PIC  X(19)  VALUE        01699313
016994             '                   '.                               01699413
016995         10  FILLER                      PIC  X(19)  VALUE        01699513
016996             '                   '.                               01699613
016997     05  PM-VISUAL-DIM-WEIGHT-CHECK.                              01699713
016998         10  FILLER                      PIC  X(19)  VALUE        01699813
016999             ' IMAGE, DIMENSION  '.                               01699913
017000         10  FILLER                      PIC  X(19)  VALUE        01700013
017001             '    AND WEIGHT     '.                               01700113
017002         10  FILLER                      PIC  X(19)  VALUE        01700213
017003             '   VALIDATION IS   '.                               01700313
017004         10  FILLER                      PIC  X(19)  VALUE        01700413
017005             '     REQUIRED      '.                               01700513
017007         10  FILLER                      PIC  X(19)  VALUE        01700713
017008             '                   '.                               01700813
017009         10  FILLER                      PIC  X(19)  VALUE        01700913
017010             '                   '.                               01701013
017011         10  FILLER                      PIC  X(19)  VALUE        01701113
017012             '                   '.                               01701213
017013     05  PM-VISUAL-DIM-CHECK.                                     01701313
017014         10  FILLER                      PIC  X(19)  VALUE        01701413
017015             'IMAGE AND DIMENSION'.                               01701513
017018         10  FILLER                      PIC  X(19)  VALUE        01701813
017019             '   VALIDATION IS   '.                               01701913
017020         10  FILLER                      PIC  X(19)  VALUE        01702013
017021             '     REQUIRED      '.                               01702113
017022         10  FILLER                      PIC  X(19)  VALUE        01702213
017023             '                   '.                               01702313
017024         10  FILLER                      PIC  X(19)  VALUE        01702413
017025             '                   '.                               01702513
017026         10  FILLER                      PIC  X(19)  VALUE        01702613
017027             '                   '.                               01702713
017028         10  FILLER                      PIC  X(19)  VALUE        01702813
017029             '                   '.                               01702913
017030     05  PM-VISUAL-WEIGHT-CHECK.                                  01703013
017031         10  FILLER                      PIC  X(19)  VALUE        01703113
017032             ' IMAGE AND WEIGHT  '.                               01703213
017035         10  FILLER                      PIC  X(19)  VALUE        01703513
017036             '   VALIDATION IS   '.                               01703613
017037         10  FILLER                      PIC  X(19)  VALUE        01703713
017038             '     REQUIRED      '.                               01703813
017039         10  FILLER                      PIC  X(19)  VALUE        01703913
017040             '                   '.                               01704013
017041         10  FILLER                      PIC  X(19)  VALUE        01704113
017042             '                   '.                               01704213
017043         10  FILLER                      PIC  X(19)  VALUE        01704313
017044             '                   '.                               01704413
017045         10  FILLER                      PIC  X(19)  VALUE        01704513
017046             '                   '.                               01704613
017047     05  PM-NO-WEB-ITEM-MSG.                                      01704715
017049         10  FILLER                      PIC  X(19)  VALUE        01704914
017050             ' NOTIFY SUPERVISOR '.                               01705014
017051         10  FILLER                      PIC  X(19)  VALUE        01705114
017052             '   THERE IS NO     '.                               01705214
017053         10  FILLER                      PIC  X(19)  VALUE        01705314
017054             '   WEBITM RECORD   '.                               01705419
017055         10  FILLER                      PIC  X(19)  VALUE        01705514
017056             '   FOR THIS UPC    '.                               01705614
017057         10  FILLER                      PIC  X(19)  VALUE        01705714
017058             '                   '.                               01705814
017059         10  FILLER                      PIC  X(19)  VALUE        01705914
017060             '                   '.                               01706014
017061         10  FILLER                      PIC  X(19)  VALUE        01706114
017062             '                   '.                               01706214
017070                                                                  01707013
017080     05  PM-DIM-WEIGHT-CHECK.                                     01708016
017090         10  FILLER                      PIC  X(19)  VALUE        01709016
017091             '    DIMENSION      '.                               01709116
017092         10  FILLER                      PIC  X(19)  VALUE        01709216
017093             '    AND WEIGHT     '.                               01709316
017094         10  FILLER                      PIC  X(19)  VALUE        01709416
017095             '   VALIDATION IS   '.                               01709516
017096         10  FILLER                      PIC  X(19)  VALUE        01709616
017097             '     REQUIRED      '.                               01709716
017098         10  FILLER                      PIC  X(19)  VALUE        01709816
017099             '                   '.                               01709916
017100         10  FILLER                      PIC  X(19)  VALUE        01710016
017101             '                   '.                               01710116
017102         10  FILLER                      PIC  X(19)  VALUE        01710216
017103             '                   '.                               01710316
017104     05  PM-DIM-CHECK.                                            01710416
017105         10  FILLER                      PIC  X(19)  VALUE        01710516
017106             '    DIMENSION      '.                               01710616
017107         10  FILLER                      PIC  X(19)  VALUE        01710716
017108             '   VALIDATION IS   '.                               01710816
017109         10  FILLER                      PIC  X(19)  VALUE        01710916
017110             '     REQUIRED      '.                               01711016
017111         10  FILLER                      PIC  X(19)  VALUE        01711116
017112             '                   '.                               01711216
017113         10  FILLER                      PIC  X(19)  VALUE        01711316
017114             '                   '.                               01711416
017115         10  FILLER                      PIC  X(19)  VALUE        01711516
017116             '                   '.                               01711616
017117         10  FILLER                      PIC  X(19)  VALUE        01711716
017118             '                   '.                               01711816
017119     05  PM-WEIGHT-CHECK.                                         01711916
017120         10  FILLER                      PIC  X(19)  VALUE        01712016
017121             '      WEIGHT       '.                               01712116
017122         10  FILLER                      PIC  X(19)  VALUE        01712216
017123             '   VALIDATION IS   '.                               01712316
017124         10  FILLER                      PIC  X(19)  VALUE        01712416
017125             '     REQUIRED      '.                               01712516
017126         10  FILLER                      PIC  X(19)  VALUE        01712616
017127             '                   '.                               01712716
017128         10  FILLER                      PIC  X(19)  VALUE        01712816
017129             '                   '.                               01712916
017130         10  FILLER                      PIC  X(19)  VALUE        01713016
017131             '                   '.                               01713116
017132         10  FILLER                      PIC  X(19)  VALUE        01713216
017133             '                   '.                               01713316
017134     05  PM-IMAGE-NO-WEB-ITEM-MSG.                                01713417
017135         10  FILLER                      PIC  X(19)  VALUE        01713517
017136             '      IMAGE        '.                               01713617
017137         10  FILLER                      PIC  X(19)  VALUE        01713717
017138             '   VALIDATION IS   '.                               01713817
017139         10  FILLER                      PIC  X(19)  VALUE        01713917
017140             '     REQUIRED      '.                               01714017
017141         10  FILLER                      PIC  X(19)  VALUE        01714117
017142             ' NOTIFY SUPERVISOR '.                               01714217
017143         10  FILLER                      PIC  X(19)  VALUE        01714317
017144             '   THERE IS NO     '.                               01714417
017145         10  FILLER                      PIC  X(19)  VALUE        01714517
017146             '   WEBITM RECORD   '.                               01714619
017147         10  FILLER                      PIC  X(19)  VALUE        01714717
017148             '   FOR THIS UPC    '.                               01714817
017155                                                                  01715517
017156     05  PM-DEPARTED-ENDED-TRIP-MSG.                              01715620
017157         10  FILLER                      PIC  X(19)  VALUE        01715718
017158             '                   '.                               01715818
017159         10  FILLER                      PIC  X(19)  VALUE        01715918
017160             '                   '.                               01716018
017161         10  FILLER                      PIC  X(19)  VALUE        01716118
017162             '    TRIP ENTERED   '.                               01716218
017163         10  FILLER                      PIC  X(19)  VALUE        01716318
017164             '  IS IN A DEPARTED '.                               01716418
017165         10  FILLER                      PIC  X(19)  VALUE        01716518
017166             '       STATUS      '.                               01716618
017168         10  FILLER                      PIC  X(19)  VALUE        01716818
017169             '                   '.                               01716918
017170         10  FILLER                      PIC  X(19)  VALUE        01717018
017171             '                   '.                               01717118
017172                                                                  01717218
017173                                                                  01717320
017174     05  PM-PREPACK-PREV-CLOSED-MSG.                              01717420
017175         10  FILLER                      PIC  X(19)  VALUE        01717520
017176             '                   '.                               01717620
017177         10  FILLER                      PIC  X(19)  VALUE        01717720
017178             'PREPACK  PREVIOUSLY'.                               01717820
017179         10  FILLER                      PIC  X(19)  VALUE        01717920
017180             '     SCANNED       '.                               01718020
017181         10  FILLER                      PIC  X(19)  VALUE        01718120
017182             '                   '.                               01718220
017183         10  FILLER                      PIC  X(19)  VALUE        01718320
017184             '  ADDITIONAL UPC   '.                               01718421
017185         10  FILLER                      PIC  X(19)  VALUE        01718520
017186             '  ARE ODD UNITS    '.                               01718621
017187         10  FILLER                      PIC  X(19)  VALUE        01718720
017188             '                   '.                               01718820
017189                                                                  01718920
017190     05  PM-CARTON-NOT-CHECKED-IN.                                01719022
017191         10  FILLER                      PIC  X(19)  VALUE        01719122
017192             '   ***WARNING***   '.                               01719222
017193         10  FILLER                      PIC  X(19)  VALUE        01719322
017194             ' CRTN NOT CHKD IN  '.                               01719422
017195         10  FILLER                      PIC  X(19)  VALUE        01719522
017196             'AUDIT DISCREPANCIES'.                               01719622
017197         10  FILLER                      PIC  X(19)  VALUE        01719722
017198             ' WILL *NOT* CREATE '.                               01719822
017199         10  FILLER                      PIC  X(19)  VALUE        01719922
017200             'CARTON ADJUSTMENTS '.                               01720022
017201         10  FILLER                      PIC  X(19)  VALUE        01720122
017202             '     F2-AUDIT      '.                               01720223
017203         10  FILLER                      PIC  X(19)  VALUE        01720322
017204             'ENTER-DO NOT AUDIT '.                               01720422
017205                                                                  01720524
017206     05  PM-CARTON-CHECKED-OTHR-DC.                               01720626
017207         10  FILLER                      PIC  X(19)  VALUE        01720726
017208             '   ***WARNING***   '.                               01720826
017209         10  FILLER                      PIC  X(19)  VALUE        01720926
017210             ' CARTON CHECKED IN '.                               01721026
017211         10  FILLER                      PIC  X(19)  VALUE        01721126
017212             '   AT ANOTHER DC   '.                               01721227
017213         10  FILLER                      PIC  X(19)  VALUE        01721326
017214             ' WILL *NOT* CREATE '.                               01721426
017215         10  FILLER                      PIC  X(19)  VALUE        01721526
017216             'CARTON ADJUSTMENTS '.                               01721626
017217         10  FILLER                      PIC  X(19)  VALUE        01721726
017218             '     F2-AUDIT      '.                               01721826
017219         10  FILLER                      PIC  X(19)  VALUE        01721926
017220             'ENTER-DO NOT AUDIT '.                               01722026
017235                                                                  01723524
017236     05  PM-CARTON-ALREADY-LOADED.                                01723626
017237         10  FILLER                      PIC  X(19)  VALUE        01723726
017238             '   ***WARNING***   '.                               01723826
017239         10  FILLER                      PIC  X(19)  VALUE        01723926
017240             '   CARTON ALREADY  '.                               01724026
017241         10  FILLER                      PIC  X(19)  VALUE        01724126
017242             '   LOADED ON TRLR  '.                               01724226
017243         10  FILLER                      PIC  X(19)  VALUE        01724326
017244             ' WILL *NOT* CREATE '.                               01724426
017245         10  FILLER                      PIC  X(19)  VALUE        01724526
017246             'CARTON ADJUSTMENTS '.                               01724626
017247         10  FILLER                      PIC  X(19)  VALUE        01724726
017248             '     F2-AUDIT      '.                               01724826
017249         10  FILLER                      PIC  X(19)  VALUE        01724926
017250             'ENTER-DO NOT AUDIT '.                               01725026
017251                                                                  01725126
017252 01  PM-PGM-MSG-TABLE  REDEFINES  PM-PGM-MSG-DATA.                01725226
017260     05  PM-PGM-MSG-ENTRY                OCCURS 24 TIMES          01726026
017300                                         INDEXED BY PM-IDX.       01730013
017400         10  PM-LINE-1                   PIC  X(19).              01740013
017500         10  PM-LINE-2                   PIC  X(19).              01750013
017600         10  PM-LINE-3                   PIC  X(19).              01760013
017700         10  PM-LINE-4                   PIC  X(19).              01770013
017800         10  PM-LINE-5                   PIC  X(19).              01780013
017900         10  PM-LINE-6                   PIC  X(19).              01790013
018000         10  PM-LINE-7                   PIC  X(19).              01800013
