000100******************************************************************00010000
000110*  SUWS010                                                        00011000
000120*                                                                 00012000
000130*  THIS MEMBER CONTAINS THE COMMON DATA THAT IS PASSED BETWEEN    00013000
000140*  THE SHIPPING ONLINE PROGRAMS IN THE COMMAREA                   00014000
000150*                                                                 00015000
000152* EKTA ADDED SU010-OPER-UNIT-ID AT THE END FOR IMPORT REP 2010    00015200
000160******************************************************************00016000
000200 01  SU010-SELECT-RECORD.                                         00020000
000300     05  SU010-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00030000
000400                                                COMP-3.           00040000
000500     05  SU010-MAX-ITEMS              PIC 99    VALUE 20.         00050000
000600     05  SU010-SELECTED-ITEM-ARRAY.                               00060000
000700         10  FILLER                   OCCURS 20 TIMES             00070000
000800                                      INDEXED BY SU010-IDX.       00080000
000900             15  SU010-ITEM           PIC S9(9) COMP-3.           00090000
001000             15  SU010-ACTION-SW      PIC X.                      00100000
001100                 88  SU010-INQ                  VALUE 'I'.        00110000
001200                 88  SU010-UPD                  VALUE 'U'.        00120000
001300                 88  SU010-DEL                  VALUE 'D'.        00130000
001400                 88  SU010-ERR                  VALUE 'E'.        00140000
001500             15  SU010-KEY-DATA.                                  00150000
001600*                                                                 00160000
001700                 20  SU010-TRLR-SRL-NBR           PIC  9(09).     00170000
001800                 20  SU010-TRIP-ID                PIC  9(09).     00180000
001900                 20  SU010-TRIP-STATUS            PIC  X(24).     00190000
002000                 20  SU010-STAT-DATE              PIC  X(10).     00200000
002100                 20  SU010-DESCRIPTION            PIC  X(20).     00210000
002200                 20  SU010-DEST-NBR               PIC  9(04).     00220000
002300                 20  SU010-STAT-TIME              PIC  X(05).     00230000
002400                 20  SU010-USER-ID                PIC  X(08).     00240000
002500                 20  SU010-DOORSLOT               PIC  X(06).     00250000
002600                 20  SU010-SML                    PIC  9(18).     00260000
002700                 20  SU010-CREATE                 PIC  X(03).     00270000
002900                 20  SU010-PO-RCVR                PIC  X(12).     00290000
003100                 20  SU010-LOAD-STATUS            PIC  X(07).     00310000
003110                 20  SU010-LOAD-STAT              PIC  X(05).     00311000
003200                 20  SU010-DOOR-ID                PIC  X(04).     00320000
003300                 20  SU010-DOOR-TYPE              PIC  X(02).     00330000
003400                 20  SU010-SCAC                   PIC  X(04).     00340000
003500                 20  SU010-TRLR-ID                PIC  9(09).     00350000
003600                 20  SU010-TRLR-SEAL-ID           PIC  X(20).     00360000
003700                 20  SU010-LINE-NBR               PIC  9(04).     00370000
003800                 20  SU010-LINE-STAT              PIC  X(02).     00380000
003900                 20  SU010-UNTS-VRFD              PIC  9(06).     00390000
004000                 20  SU010-UNTS-MFSD              PIC  9(06).     00400000
004010                 20  SU010-UNTS-VARI              PIC S9(06).     00401000
004020                 20  SU010-TOT-CRTNS              PIC  9(06).     00402000
004030                 20  SU010-OPER-UNIT-ID           PIC S9(04).     00403000
004050                                                                  00405000
