000100******************************************************************00020001
000110**                        CNWS012                                 00030001
000120**                                                                00040001
000200* INTER-APPLICATION COMMUNICATION AREA FOR                        00050001
000300* HEADER OF DIRECTIVE LIST SCREEN                                 00060001
000400* LENGTH = 200 BYTES                                              00070001
000500******************************************************************00080001
000600         10  SU101-INTER-APPL-COMMAREA  REDEFINES                 00090001
000700                                        INTER-APPL-COMM-AREA.     00100001
000800             15  FILLER                     PIC X.                00110001
                   15  SU101-FUNCTION                 PIC  X(01).       00151005
                       88  SU101-FUNCTION-NONE             VALUE ' '.   00152005
                       88  SU101-ADD                       VALUE 'A'.   00153005
                       88  SU101-UPD                       VALUE 'U'.   00154005
001300             15  SU101-OPER-UNIT            PIC S9(04) COMP.      00160007
001400             15  SU101-OPER-NAME            PIC X(25).            00170001
                   15  SU101-CARTON-ID            PIC X(22).            00171008
001410             15  SU101-SORT-SEQ             PIC X(64).            00180001
001420             15  SU101-LOCK-MODE            PIC X(08).            00190001
                   15  SU101-DATE-RANGE-END           PIC  X(19).       00200004
                   15  SU101-CURSOR-SW                PIC  X(03).       00210004
                       88  SU101-NO-CURSOR                 VALUE 'Z  '. 00220004
                       88  SU101-OPER-UNIT-PO-C1           VALUE 'PO1'. 00230004
                       88  SU101-OPER-UNIT-PO-R-C1         VALUE 'RV1'. 00240004
                       88  SU101-OPER-UNIT-PO-R-LINE-C1    VALUE 'LN1'. 00241004
                       88  SU101-OPER-UNIT-PO-R-PACK-C1    VALUE 'PK1'. 00242004
                       88  SU101-AUDIT-CONTROL-NO-C1       VALUE 'AU1'. 00243004
                       88  SU101-CARTON-ID-C1              VALUE 'CA1'. 00244004
                       88  SU101-OPER-UNIT-DATE-C1         VALUE 'DT1'. 00245004
                       88  SU101-OPER-UNIT-CASI-DATE-C1    VALUE 'CS1'. 00246004
                       88  SU101-OPER-UNIT-RSN-CODE-C1     VALUE 'DC1'. 00246111
                       88  SU101-OPER-UNIT-SETCODE-YR-C1   VALUE 'SC1'. 00247004
                       88  SU101-OPER-UNIT-PO-C2           VALUE 'PO1'. 00249004
                       88  SU101-OPER-UNIT-PO-R-C2         VALUE 'RV1'. 00249104
                       88  SU101-OPER-UNIT-PO-R-LINE-C2    VALUE 'LN1'. 00249204
                       88  SU101-OPER-UNIT-PO-R-PACK-C2    VALUE 'PK1'. 00249304
                       88  SU101-AUDIT-CONTROL-NO-C2       VALUE 'AU1'. 00249404
                       88  SU101-CARTON-ID-C2              VALUE 'CA1'. 00249504
                       88  SU101-OPER-UNIT-DATE-C2         VALUE 'DT1'. 00249604
                       88  SU101-OPER-UNIT-CASI-DATE-C2    VALUE 'CS1'. 00249704
                       88  SU101-OPER-UNIT-RSN-CODE-C2     VALUE 'DC1'. 00249811
                       88  SU101-OPER-UNIT-SETCODE-YR-C2   VALUE 'SC1'. 00249904
000900             15  SU101-NUMBER-OF-SELECTED-ITEMS                   00250007
001000                                            PIC S9(09) COMP-3.    00250107
001100             15  SU101-NUMBER-OF-TS-ITEMS   PIC S9(05) COMP-3.    00251007
001200             15  SU101-SEL-QUEUE-NAME       PIC X(08).            00252007
                   15  SU101-PO-NUMBER            PIC 9(09).            00253010
                   15  SU101-RCVR                 PIC X(04).            00254010
                   15  SU101-LINE-PACK            PIC X(04).            00255010
001800             15  FILLER                     PIC X(20).            00260009
