000100******************************************************************00010000
000200*                         SUWS083                                *00020001
000300*                                                                *00030000
000400*  INTER-APPLICATION COMMUNICATION AREA FOR THE PRINT REPORT     *00040001
000500*  FUNCTION                                                      *00050001
000600*  LENGTH = 200 BYTES                                            *00060000
000700******************************************************************00070000
000800      05  SU083-COMM-AREA.                                        00080011
001500             15  SU083-TRIP-OCRNC-ID        PIC S9(09) COMP.      00150003
001510             15  SU083-BUS-AREA-ID          PIC S9(2) COMP-3.     00151012
001600             15  SU083-STR-NBR              PIC S9(04) COMP.      00160001
001800             15  SU083-STR-NAME             PIC  X(25).           00180001
004200             15  SU083-SCREEN-SEQUENCE          PIC  X(01).       00420001
004310                 88  SU083-AREA-SEQ                  VALUE 'A'.   00431007
004400                 88  SU083-UNIT-SEQ                  VALUE 'U'.   00440001
004510*                                                                 00451000
004520             15  SU083-DEPT-NBR                 PIC  9(04).       00452001
004530             15  SU083-DEPARTMENT-NAME          PIC  X(25).       00453001
004540             15  SU083-SERVICING-DC             PIC  X(25).       00454001
004541                                                                  00454101
004543             15  SU083-TRLR-SRL-NBR         PIC  S9(09) COMP.     00454301
004544             15  SU083-TRLR-STATUS          PIC  X(20).           00454401
004545             15  SU083-TRIP-ID              PIC  9(09).           00454505
004546             15  SU083-TRLR-ID              PIC  X(12).           00454608
004547             15  SU083-SCAC                 PIC  X(04).           00454701
004550             15  SU083-TOTAL-CTNS           PIC  S9(07) COMP-3.   00455001
004560             15  SU083-TOTAL-UNITS          PIC  S9(07) COMP-3.   00456001
004570             15  SU083-SUMMARY-DATE         PIC  X(10).           00457001
004580             15  SU083-SUMMARY-TIME         PIC  X(08).           00458001
004590             15  SU083-PRINTER-ID           PIC  X(08).           00459002
004600                                                                  00460000
004700             15  FILLER                     PIC  X(29).           00470013
