010000******************************************************************00010000
020000**                        SUWS098                               **00020002
030000**                                                              **00030000
040000**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **00040000
050000**  TRAILER MANIFESTING APPLICATION SCREENS - DC DOORS          **00050000
060000**  LENGTH:  200 BYTES                                          **00060000
070000******************************************************************00070000
080000         10  SU097-INTER-APPL-COMMAREA  REDEFINES                 00080006
090000                                     INTER-APPL-COMM-AREA.        00090000
100000             15  FILLER                PIC  X(01).                00100007
110010             15  SU097-OPER-UNT-ID     PIC  9(04).                00110011
110010             15  SU097-FCLTY-NME       PIC  X(25).                00110108
110010             15  SU097-PO-NBR          PIC  9(08).                00110211
110100             15  SU097-RCVR-SEQ-NBR    PIC  9(04).                00110312
110200             15  SU097-PO-LNE-NBR      PIC  9(04).                00110411
110300             15  SU097-PREPACK-ID      PIC  9(04).                00110511
110500             15  SU097-AUD-CNTL-NBR    PIC  9(09).                00110711
110500             15  SU097-BRCDE-NBR       PIC  X(22).                00110811
110400             15  SU097-PACK-TYPE       PIC  X(14).                00110915
145008             15  SU097-FILLER          PIC  X(105).               00145014
