000200***************************************************************** 00020001
000300*    RECORD PURPOSE: LABEL REQUEST -  RECORD LAYOUT               00030001
000400*    FROM PRINT AND APPLY SYSTEM                                  00040001
000500*    RECORD LENGTH:  108 BYTES                                    00050001
000700***************************************************************** 00070001
000800 01  SU053-CRTN-PROCESSED-RECORD.                                 00080003
000900     05  SU053-DC-NUMBER                 PIC  9(04)  VALUE ZEROS. 00090001
001100     05  SU053-KOHLS-SML                 PIC  X(22)  VALUE SPACES.00110001
001200     05  SU053-MESSAGE-SEQ-NUMBER        PIC  9(03)  VALUE ZEROS. 00120001
001400     05  SU053-CRTN-PROCESS-STATUS       PIC  9(01)  VALUE ZEROS. 00140001
001600     05  SU053-CRTN-REJECT-CAUSE         PIC  9(02)  VALUE ZEROS. 00160001
001700     05  SU053-ACCM-LINE-NMBR            PIC  9(03)  VALUE ZEROS. 00170002
001800     05  SU053-INDUCT-DATE               PIC  9(08)  VALUE ZEROS. 00180001
001900     05  SU053-INDUCT-TIME               PIC  9(06)  VALUE ZEROS. 00190001
001910     05  SU053-EXIT-DATE                 PIC  9(08)  VALUE ZEROS. 00191001
001920     05  SU053-EXIT-TIME                 PIC  9(06)  VALUE ZEROS. 00192001
002000     05  SU053-RECORD-TERMINATOR         PIC  X(01)  VALUE SPACE. 00200001
002100 01  SU053-WORK-FIELDS.                                           00210001
002200     05  SU053-TERMINATING-CHAR          PIC  X(01) VALUE ';'.    00220004
