000100                                                                  00010002
000200 01  SU004-DC-SELECT-RECORD.                                      00020002
000300     05  SU004-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00030002
000400                                                COMP-3.           00040002
000500     05  SU004-MAX-ITEMS              PIC 99    VALUE 20.         00050002
000600     05  SU004-SELECTED-ITEM-ARRAY.                               00060002
000700         10  FILLER                   OCCURS 20 TIMES             00070002
000800                                      INDEXED BY SU004-IDX.       00080002
000900             15  SU004-ITEM           PIC S9(9) COMP-3.           00090002
001000             15  SU004-ACTION-SW      PIC X.                      00100002
001100                 88  SU004-INQ                  VALUE 'I'.        00110002
001200                 88  SU004-UPD                  VALUE 'U'.        00120002
001300                 88  SU004-DEL                  VALUE 'D'.        00130002
001400                 88  SU004-ERR                  VALUE 'E'.        00140002
001500             15  SU004-KEY-DATA.                                  00150002
001600                 20  SU004-OPER-UNT-ID                            00160002
001700                                      PIC S9(04) COMP.            00170002
001800                 20  SU004-FCLTY-ID   PIC S9(04) COMP.            00180002
001900                 20  SU004-PO-NBR     PIC S9(09) COMP.            00190002
002000                 20  SU004-REC-SEQ-NBR                            00200002
002100                                      PIC S9(09) COMP.            00210002
002200                 20  SU004-TRIP-ID    PIC S9(09) COMP.            00220002
002300                 20  SU004-SCAC-CDE                               00230002
002400                                      PIC X(04).                  00240002
002500                 20  SU004-VEH-NBR    PIC X(10).                  00250002
002600                 20  SU004-SHIPT-UNT-ID                           00260002
002700                                      PIC S9(18) COMP-3.          00270002
002800                 20  SU004-CSR-IND    PIC X(01).                  00280002
002801                     88  SU004-ALL-LINES            VALUE 'A'.    00280104
002810                 20  SU004-LINE-NO    PIC S9(09) COMP.            00281002
002811                 20  SU004-PREPK-ID                               00281103
002812                                      PIC S9(04) COMP.            00281203
002820                 20  FILLER           PIC  X(48).                 00282003
002900                                                                  00290002
