*          DATA SET SVKM106                                                     
        PRINT  NOGEN                                                    00002   
SVKM106 DFHMSD TYPE=DSECT,                                             C00003   
               LANG=COBOL,                                             C00004   
               MODE=INOUT,                                             C00005   
               STORAGE=AUTO,                                           C00006   
               TERM=3270-2,                                            C00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
SV106A  DFHMDI LINE=2,COLUMN=1,                                        C00010**5
               SIZE=(19,80),                                           C00011**5
               CTRL=(FREEKB),                                          C00012   
               MAPATTS=(COLOR,HILIGHT),                                C00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
*          DATA SET SVKM106                                                     
***************                                                         00053   
        DFHMDF POS=(03,01),LENGTH=23,ATTRB=(PROT,NORM),                X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='CARD TYPE.............:'                        00037   
ATYP01  DFHMDF POS=(03,26),LENGTH=01,ATTRB=(ASKIP,NORM,NUM),           X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='9'                                               00059   
        DFHMDF POS=(03,28),LENGTH=1,ATTRB=(ASKIP,NORM),                X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(03,30),LENGTH=18,ATTRB=(PROT,NORM),                X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='1 - KMRC  2 - GIFT'                             00037   
        DFHMDF POS=(04,01),LENGTH=23,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='CARD STOCK TYPE.......:'                        00040   
ASTK01  DFHMDF POS=(04,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(04,35),LENGTH=1,ATTRB=(ASKIP,NORM),                X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(05,01),LENGTH=23,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='PRE-DENOMINATED AMOUNT:'                        00040   
ADNM01  DFHMDF POS=(05,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00058**6
               COLOR=BLUE,                                             X00059   
               PICOUT='ZZZZZ.ZZ'                                        00059   
        DFHMDF POS=(05,35),LENGTH=1,ATTRB=(ASKIP,NORM),                X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(06,01),LENGTH=23,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='CARD STOCK DESCRIPTION:'                        00040   
ADESC01 DFHMDF POS=(06,26),LENGTH=25,ATTRB=(UNPROT,NORM),              X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(06,52),LENGTH=1,ATTRB=(ASKIP,NORM),                X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(07,01),LENGTH=23,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='INSTRUCTIONS ON USE...:'                        00040   
AINST01 DFHMDF POS=(07,26),LENGTH=30,ATTRB=(UNPROT,NORM),              X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(07,57),LENGTH=1,ATTRB=(ASKIP,NORM),                X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(08,01),LENGTH=23,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='REPLENISHABLE.........:'                        00040   
AREPL01 DFHMDF POS=(08,26),LENGTH=01,ATTRB=(UNPROT,NORM),              X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(08,28),LENGTH=1,ATTRB=(ASKIP,NORM),                X00058**6
               COLOR=BLUE                                               00059   
        DFHMDF POS=(08,30),LENGTH=03,ATTRB=(PROT,NORM),                X00035   
               COLOR=NEUTRAL,                                          X00036   
               INITIAL='Y/N'                                            00037   
        DFHMDF POS=(09,01),LENGTH=23,ATTRB=(PROT,NORM),                X00038**8
               COLOR=NEUTRAL,                                          X00039   
               INITIAL='UPC...................:'                        00040   
AUPC01  DFHMDF POS=(09,26),LENGTH=12,ATTRB=(UNPROT,IC),                X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZZZZZZZZZZ'                                    00059   
        DFHMDF ATTRB=(ASKIP),                                          X00050**2
               POS=(09,39),                                            X00051**2
               INITIAL=' ',                                            X00052**2
               LENGTH=1                                                 00053**2
***************                                                         00053   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
