000100******************************************************************00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300******************************************************************00030000
000400 PROGRAM-ID.                SVKUP901.                             00040000
000500 AUTHOR.                    COGNIZANT.                            00050000
000600 INSTALLATION.              KOHLS DEPARTMENT STORES.              00060000
000700 DATE-WRITTEN.              05-10-2017.                           00070000
000800 DATE-COMPILED.                                                   00080000
000900                                                                  00090000
001000******************************************************************00100000
001100*  BATCH PROGRAM - SVKUP901                                      *00110000
001400*                                                                *00120000
001500*  THIS PROGRAM WILL INSERT SVT_KOHLS_CRD_TXN REDEMPTIONS         00130000
001600*  FOR ADHOC ACTIVITY.                                            00140000
001700*                                                                *00150000
001800******************************************************************00160000
001900*  05/10/2017  INTIAL VERSION.                                    00170000
002000*                                                                 00180000
002100*  MADE BY: COGNIZANT                                             00190000
002101******************************************************************00200000
092823*  09/28/2023  ALLOW FOR POSITIVE VALUES AND REDEMPTIONS VS       00201000
092823*              ACTIVATIONS.                                       00201100
092823*                                                                 00202000
092823*  MADE BY: DAN PAYNTER            CHG0294354                     00203000
002101******************************************************************00204000
092923*  09/29/2023  ALLOW KMC AS WELL AS GIFT CARD REDEMPTIONS         00205000
092923*                                                                 00207000
092923*  MADE BY: DAN PAYNTER            CHG0294428                     00208002
002101******************************************************************00209000
002102                                                                  00210000
002103 ENVIRONMENT DIVISION.                                            00220000
002104******************************************************************00230000
002105                                                                  00240000
002200 CONFIGURATION SECTION.                                           00250000
002300                                                                  00260000
002400 SOURCE-COMPUTER.    IBM-3090.                                    00270000
002500 OBJECT-COMPUTER.    IBM-3090.                                    00280000
002600                                                                  00290000
002700 INPUT-OUTPUT SECTION.                                            00300000
002800                                                                  00310000
002900 FILE-CONTROL.                                                    00320000
003000                                                                  00330000
003100     SELECT POS-INPUT-FILE                                        00340000
003200         ASSIGN TO INP01.                                         00350000
003201                                                                  00360000
003202     SELECT POS-ERROR-FILE                                        00370000
003203         ASSIGN TO OUT01.                                         00380000
003300                                                                  00390000
003400******************************************************************00400000
003500 DATA DIVISION.                                                   00410000
003600******************************************************************00420000
003700                                                                  00430000
003800 FILE SECTION.                                                    00440000
003900                                                                  00450000
004000 FD  POS-INPUT-FILE                                               00460000
004100     RECORDING MODE IS F                                          00470000
004200     BLOCK CONTAINS 0 RECORDS                                     00480000
004300     LABEL RECORDS ARE STANDARD.                                  00490000
004400                                                                  00500000
004500 01  POS-INPUT-RECORD            PIC X(80).                       00510000
004501                                                                  00520000
004502 FD  POS-ERROR-FILE                                               00530000
004503     RECORDING MODE IS F                                          00540000
004504     BLOCK CONTAINS 0 RECORDS                                     00550000
004505     LABEL RECORDS ARE STANDARD.                                  00560000
004506                                                                  00570000
004507 01  POS-ERROR-RECORD      PIC X(80).                             00580000
004600                                                                  00590000
004700 WORKING-STORAGE SECTION.                                         00600000
004800                                                                  00610000
004900 01  FILLER                            PIC X(50)  VALUE           00620000
005000     ' *** WORKING STORAGE STARTS HERE FOR SVKUP901 *** '.        00630000
005100                                                                  00640000
005200******************************************************************00650000
005300*  RECORD LAYOUT FOR INPUT DATE CARD (POS DATE)                   00660000
005400******************************************************************00670000
005800                                                                  00680000
005900 01  PS-PROGRAM-SWITCHES.                                         00690000
006400     05  PS-END-OF-INPUT-FILE-SW    PIC  X(01)       VALUE 'N'.   00700000
006500         88  PS-END-OF-INPUT-FILE                    VALUE 'Y'.   00710000
007500                                                                  00720000
007600 01  PC-PROGRAM-CONSTANTS.                                        00730000
007700     05  PC-PROGRAM-NAME         PIC X(8)     VALUE 'SVKUP901'.   00740000
008300                                                                  00800000
008400 01  PV-PROGRAM-VARIABLES.                                        00810000
008600     05  PV-PARAGRAPH-NAME       PIC X(30)         VALUE SPACE.   00830000
008700     05  PV-DB2-OPERATION        PIC X(30)         VALUE SPACE.   00840000
011200     05  PV-RECORDS-READ         PIC 9(06)         VALUE ZEROS.   01090000
011200     05  PV-ERROR-COUNT          PIC 9(06)         VALUE ZEROS.   01091000
011200     05  PV-ACTIVATE-COUNT       PIC 9(06)         VALUE ZEROS.   01092000
092823     05  PV-ORD-NBR-NULL-IND     PIC S9(04)  COMP  VALUE ZERO.    01093000
V11300                                                                  01100000
011400 01  AC-ABEND-CODE               PIC S9(04)        VALUE ZERO     01110000
011500                                                   COMP SYNC.     01120000
011600     88  AC-CONTROL-CARD-ERROR                     VALUE +4003.   01130000
011700     88  AC-DB2-ERROR                              VALUE +4013.   01140000
011701                                                                  01150000
011702 01  ABEND-CODE                  PIC S9(04)        VALUE +0 COMP. 01160000
       01  PV-INPUT-RECORD.                                             01170000
           05  PV-INPUT-CARD-NBR       PIC 9(19).                       01180000
           05  FILLER                  PIC X(01).                       01190000
           05  PV-INPUT-SAL-DATE       PIC X(10).                       01200000
           05  FILLER                  PIC X(01).                       01210000
           05  PV-INPUT-STORE-NBR      PIC 9(4).                        01220000
           05  FILLER                  PIC X(01).                       01230000
           05  PV-INPUT-REG-ID         PIC 9(3).                        01240000
           05  FILLER                  PIC X(01).                       01250000
           05  PV-INPUT-TRN-NBR        PIC 9(04).                       01260000
           05  FILLER                  PIC X(01).                       01270000
           05  PV-INPUT-AMT            PIC 99999.99.                    01280000
092823     05  FILLER                  PIC X(01).                       01290000
092823     05  PV-AMT-POSITIVE-IND     PIC X(01).                       01290100
092823     05  FILLER                  PIC X(25).                       01290200
       01  PV-ERROR-RECORD.                                             01291000
           05  PV-ERROR-CARD-NBR       PIC 9(19).                       01292000
           05  FILLER                  PIC X(01).                       01293000
           05  PV-ERROR-SAL-DATE       PIC X(10).                       01294000
           05  FILLER                  PIC X(01).                       01295000
           05  PV-ERROR-STORE-NBR      PIC 9(4).                        01296000
           05  FILLER                  PIC X(01).                       01297000
           05  PV-ERROR-REG-ID         PIC 9(3).                        01298000
           05  FILLER                  PIC X(01).                       01299000
           05  PV-ERROR-TRN-NBR        PIC 9(04).                       01299100
           05  FILLER                  PIC X(01).                       01299200
           05  PV-ERROR-REASON         PIC X(30).                       01299300
           05  FILLER                  PIC X(01).                       01299400
012300**********************************************************        01360000
012400*  WS FIELDS FOR SQLCA MESSAGE ROUTINE                            01370000
012500**********************************************************        01380000
012600     COPY DPWS004.                                                01390000
026200******************************************************************01400000
026300** WORKING STORAGE FOR CONVERSION TO CARD NUMBER                 *01410000
026400******************************************************************01420000
026500     COPY SVWS007.                                                01430000
014700******************************************************************01680000
014800*  KOHL'S STORED VALUE TABLE                                     *01690000
014900******************************************************************01700000
015000                                                                  01710000
015100     EXEC SQL                                                     01720000
015200         INCLUDE SVT00001                                         01730000
015300     END-EXEC.                                                    01740000
015400                                                                  01750000
015500******************************************************************01760000
015600*  KOHL'S STORED VALUE TRANSACTION TABLE                         *01770000
015700******************************************************************01780000
015800                                                                  01790000
015900     EXEC SQL                                                     01800000
016000         INCLUDE SVT00002                                         01810000
016100     END-EXEC.                                                    01820000
016200                                                                  01830000
016300******************************************************************01840000
016400*  KOHL'S DOMAIN LOCATION TABLE                                  *01850000
016500******************************************************************01860000
016600                                                                  01870000
016700     EXEC SQL                                                     01880000
016800         INCLUDE XST00001                                         01890000
016900     END-EXEC.                                                    01900000
017000                                                                  01910000
017800                                                                  01920000
029300*  STANDARD LAYPUT FOR THE SQL COMMUNICATION AREA.                01930000
029400                                                                  01940000
029500     EXEC SQL                                                     01950000
029600         INCLUDE SQLCA                                            01960000
029700     END-EXEC.                                                    01970000
029800                                                                  01980000
029900******************************************************************01990000
030000 PROCEDURE DIVISION.                                              02000000
030100******************************************************************02010000
030200                                                                  02020000
030300 0000-MAINLINE.                                                   02030000
030400                                                                  02040000
030500     PERFORM 1000-INITIALIZE.                                     02050000
030800                                                                  02060000
030900     PERFORM 2000-PROCESS-INPUT                                   02070000
031000             UNTIL  PS-END-OF-INPUT-FILE.                         02080000
                                                                        02080100
           PERFORM 9000-COMMIT.                                         02081000
                                                                        02082000
           PERFORM 9999-END-OF-PROGRAM.                                 02090000
                                                                        02100000
034108     GOBACK.                                                      02170000
034109                                                                  02180000
034110******************************************************************02190000
034111* 1000-INITIALIZE-PROGRAM                                         02200000
034112* GET CONTROL CARD                                                02210000
034113******************************************************************02220000
034114 1000-INITIALIZE.                                                 02230000
                                                                        02231000
034115     INITIALIZE PV-RECORDS-READ PV-ERROR-COUNT PV-ACTIVATE-COUNT  02240000
           PS-END-OF-INPUT-FILE-SW.                                     02241000
                                                                        02242000
034116     OPEN INPUT  POS-INPUT-FILE.                                  02250000
                                                                        02251000
034117     OPEN OUTPUT POS-ERROR-FILE.                                  02260000
                                                                        02270000
034119     PERFORM 1500-READ-INPUT-FILE.                                02280000
                                                                        02281000
034120***************************************************************** 02290000
034121*1500-READ-INPUT-FILE.                                            02300000
034122******************************************************************02310000
034123 1500-READ-INPUT-FILE.                                            02320000
                                                                        02321000
034124     INITIALIZE PV-INPUT-RECORD.                                  02330000
                                                                        02331000
034125     READ POS-INPUT-FILE INTO PV-INPUT-RECORD                     02340000
034126        AT END                                                    02350000
034127           SET PS-END-OF-INPUT-FILE TO TRUE.                      02360000
                                                                        02360100
           IF NOT PS-END-OF-INPUT-FILE                                  02361000
                ADD 1 TO PV-RECORDS-READ                                02370000
           END-IF.                                                      02380000
047100******************************************************************02740000
047200* 2000-PROCESS-INPUT.                                             02750000
047300******************************************************************02760000
047400 2000-PROCESS-INPUT.                                              02770000
                                                                        02770100
092823     PERFORM 2100-FIND-CARD-LENGTH.                               02780000
           PERFORM 2200-VALIDATE-CARD.                                  02790000
049100     PERFORM 1500-READ-INPUT-FILE.                                02900000
090713******************************************************************02920000
092823 2100-FIND-CARD-LENGTH.                                           02920100
           MOVE 0  TO SV007-CARD-NUMBER-LENGTH.                         02920200
           MOVE PV-INPUT-CARD-NBR TO SV007-CARD-NUMBER-IN.              02920300
           PERFORM SV007-FORMAT-CARD.                                   02920400
           MOVE SV007-CARD-NBR     TO SVT00001-CRD-NBR.                 02920500
090713******************************************************************02921000
090714 2200-VALIDATE-CARD.                                              02930000
090715                                                                  02940000
090716     EXEC SQL                                                     02950000
090717         SELECT CRD_NBR INTO : SVT00002-CRD-NBR                   02951000
090719           FROM SVT_KOHLS_CRD_ACCT                                02952000
090720          WHERE CRD_NBR       = :SVT00001-CRD-NBR                 02953000
090721            WITH UR                                               02954000
090722     END-EXEC.                                                    02955000
090723                                                                  02956000
090724     EVALUATE TRUE                                                02957000
090725         WHEN SQLCODE = 0                                         02958000
092823             PERFORM 2300-VALIDATE-ACTIVATE                       02959000
090727         WHEN SQLCODE = +100                                      02959200
                   MOVE 'CARD IS INVALID' TO PV-ERROR-REASON            02959300
090728             PERFORM 8000-WRITE-ERROR-FILE                        02959400
090729         WHEN OTHER                                               02959500
090730             MOVE '2200-VALIDATE-CARD' TO PV-PARAGRAPH-NAME       02959600
090731             MOVE 'ERROR ON SELECT OF SVT_KOHLS_CRD_ACCT'         02959700
090732                                            TO PV-DB2-OPERATION   02959800
090800             PERFORM 9100-SQL-ABEND                               02959900
090900     END-EVALUATE.                                                02960000
090910**************************************************************    02960100
090714 2300-VALIDATE-ACTIVATE.                                          02961000
090715                                                                  02962000
090716     EXEC SQL                                                     02963000
090717         SELECT DISTINCT CRD_NBR INTO : SVT00001-CRD-NBR          02964000
090719           FROM SVT_KOHLS_CRD_TXN                                 02965000
090720          WHERE CRD_NBR       = :SVT00002-CRD-NBR                 02966000
092923            AND  ACTVY_TYP_CDE = 1                                02966101
092923*           AND  ACTVY_TYP_CDE IN (1,2)                           02966201
090721            WITH UR                                               02967000
090722     END-EXEC.                                                    02968000
090723                                                                  02969000
090724     EVALUATE TRUE                                                02969100
090725         WHEN SQLCODE = +100                                      02969200
092823             MOVE 'CARD NOT ACTIVATED YET    ' TO PV-ERROR-REASON 02969300
092823             PERFORM 8000-WRITE-ERROR-FILE                        02969400
090727         WHEN SQLCODE = 0                                         02969600
092823             PERFORM 2400-FIND-ST-CDE                             02969700
090729         WHEN OTHER                                               02969800
090730             MOVE '2300-VALIDATE-ACTIVAT' TO PV-PARAGRAPH-NAME    02969900
090731             MOVE 'ERROR ON SELECT OF SVT_KOHLS_CRD_ACCT'         02970000
090732                                            TO PV-DB2-OPERATION   02970100
090800             PERFORM 9100-SQL-ABEND                               02971000
090900     END-EVALUATE.                                                02972000
090910**************************************************************    02972100
090714 2400-FIND-ST-CDE.                                                02972200
090715                                                                  02972300
           MOVE PV-INPUT-STORE-NBR TO XST00001-LOC-NBR.                 02972400
                                                                        02972500
090716     EXEC SQL                                                     02972600
090717         SELECT ST_CDE INTO :XST00001-ST-CDE                      02972700
090719           FROM XST_LOC                                           02972800
090720          WHERE LOC_NBR       = :XST00001-LOC-NBR                 02972900
090721            WITH UR                                               02973000
090722     END-EXEC.                                                    02973100
090723                                                                  02973200
090724     EVALUATE TRUE                                                02973300
090725         WHEN SQLCODE = 0                                         02973400
092823                 PERFORM 2500-REDEEM-CARD                         02973500
090729         WHEN OTHER                                               02973900
090730             MOVE '2400-FIND-ST-CDE'      TO PV-PARAGRAPH-NAME    02974000
090731             MOVE 'ERROR ON SELECT OF XST_LOC'                    02974100
090732                                            TO PV-DB2-OPERATION   02974200
090800             PERFORM 9100-SQL-ABEND                               02974300
090900     END-EVALUATE.                                                02974400
090910**************************************************************    02975000
092823 2500-REDEEM-CARD.                                                02980000
                                                                        02981000
056600     MOVE SPACE                   TO SVT00002-DRV-LIC-NBR.        03000000
054900     MOVE 0                       TO SVT00002-TRN-RVRSL-CDE.      03010000
056400     MOVE 'N'                     TO SVT00002-TRN-VOID-IND.       03020000
092823     MOVE 3                       TO SVT00002-ACTVY-TYP-CDE.      03210000
092823     MOVE -1                      TO PV-ORD-NBR-NULL-IND.         03211000
055900     MOVE PV-INPUT-SAL-DATE       TO SVT00002-POS-DTE.            03220000
056100     MOVE PV-INPUT-STORE-NBR      TO SVT00002-STR-NBR.            03230000
056200     MOVE PV-INPUT-REG-ID         TO SVT00002-POS-TRMNL-NBR.      03240000
056300     MOVE PV-INPUT-TRN-NBR        TO SVT00002-POS-TRN-NBR.        03250000
054200     MOVE PV-INPUT-AMT            TO SVT00002-APP-AUTH-AMT.       03300000
056600     MOVE 0                       TO SVT00002-POS-OPRT-ID.        03301000
056700     MOVE 'SVKUP901'              TO SVT00002-APVL-USR-ID.        03550000
056800     MOVE 3                       TO SVT00002-ACTVY-STAT-CDE.     03560000
054200     MOVE PV-INPUT-AMT            TO SVT00002-ORIG-AUTH-AMT       03570000
054200     MOVE XST00001-ST-CDE         TO SVT00002-ST-CDE.             03580000
092823     IF PV-AMT-POSITIVE-IND = 'N'                                 03590000
092823         COMPUTE SVT00002-APP-AUTH-AMT = SVT00002-APP-AUTH-AMT    03600000
092823                  * -1                                            03610000
092823         COMPUTE SVT00002-ORIG-AUTH-AMT = SVT00002-ORIG-AUTH-AMT  03611000
092823                  * -1                                            03612000
092823     END-IF.                                                      03620000
076300     EXEC SQL INSERT                                              04680000
076400              INTO SVT_KOHLS_CRD_TXN                              04690000
076500                  (CRD_NBR                                        04700000
076600                  ,TRN_AUTH_TMST                                  04710000
076700                  ,DRV_LIC_NBR                                    04720000
076800                  ,TRN_RVRSL_CDE                                  04730000
076900                  ,TRN_VOID_IND                                   04740000
077000                  ,ACTVY_TYP_CDE                                  04750000
077100                  ,POS_DTE                                        04760000
077200                  ,STR_NBR                                        04770000
077300                  ,POS_TRMNL_NBR                                  04780000
077400                  ,POS_TRN_NBR                                    04790000
077500                  ,TRN_PSTD_TMST                                  04800000
077600                  ,APP_AUTH_AMT                                   04810000
077700                  ,POS_OPRT_ID                                    04820000
077800                  ,APVL_USR_ID                                    04830000
077900                  ,ACTVY_STAT_CDE                                 04840000
078000                  ,ORIG_AUTH_AMT                                  04850000
092823                  ,ST_CDE                                         04860000
092823                  ,ORD_NBR)                                       04861000
078200           VALUES                                                 04870000
078300              (:SVT00002-CRD-NBR                                  04880000
078400              ,CURRENT TIMESTAMP                                  04890000
078500              ,:SVT00002-DRV-LIC-NBR                              04900000
078600              ,:SVT00002-TRN-RVRSL-CDE                            04910000
078700              ,:SVT00002-TRN-VOID-IND                             04920000
078800              ,:SVT00002-ACTVY-TYP-CDE                            04930000
078900              ,:SVT00002-POS-DTE                                  04940000
079000              ,:SVT00002-STR-NBR                                  04950000
079100              ,:SVT00002-POS-TRMNL-NBR                            04960000
079200              ,:SVT00002-POS-TRN-NBR                              04970000
079300              ,CURRENT TIMESTAMP                                  04980000
079400              ,:SVT00002-APP-AUTH-AMT                             04990000
079500              ,:SVT00002-POS-OPRT-ID                              05000000
079600              ,:SVT00002-APVL-USR-ID                              05010000
079700              ,:SVT00002-ACTVY-STAT-CDE                           05020000
079800              ,:SVT00002-ORIG-AUTH-AMT                            05030000
092823              ,:SVT00002-ST-CDE                                   05040000
092823              ,:SVT00002-ORD-NBR :PV-ORD-NBR-NULL-IND)            05041000
080000     END-EXEC.                                                    05050000
080100                                                                  05060000
080200     EVALUATE TRUE                                                05070000
080300         WHEN SQLCODE = ZERO                                      05080000
080400             ADD +1 TO PV-ACTIVATE-COUNT                          05090000
090400         WHEN OTHER                                               05100000
090700                                                                  05140000
092823             MOVE '2500-REDEEM-CARD'                              05150000
090704                                            TO PV-PARAGRAPH-NAME  05160000
090705             MOVE 'ERROR ON INSERT OF SVT_KOHLS_CRD_TXN'          05170000
090706                                            TO PV-DB2-OPERATION   05180000
090707             PERFORM 9100-SQL-ABEND                               05190000
090708     END-EVALUATE.                                                05200000
090709                                                                  05210000
090920**8000-WRITE-ERROR-FILE                                           05481000
090930**************************************************************    05490000
090940 8000-WRITE-ERROR-FILE.                                           05500000
                                                                        05501000
           MOVE PV-INPUT-CARD-NBR  TO PV-ERROR-CARD-NBR.                05510000
           MOVE PV-INPUT-SAL-DATE  TO PV-ERROR-SAL-DATE.                05512000
           MOVE PV-INPUT-STORE-NBR TO PV-ERROR-STORE-NBR.               05514000
           MOVE PV-INPUT-REG-ID    TO PV-ERROR-REG-ID.                  05516000
           MOVE PV-INPUT-TRN-NBR   TO PV-ERROR-TRN-NBR.                 05518000
           ADD 1 TO PV-ERROR-COUNT.                                     05519000
091010     WRITE POS-ERROR-RECORD FROM                                  05530000
091020                            PV-ERROR-RECORD.                      05540000
091500***************************************************************** 05590000
091600*    COMMIT DB2 UPDATES                                           05600000
091700***************************************************************** 05610000
091800 9000-COMMIT.                                                     05620000
091900     EXEC SQL                                                     05630000
092000        COMMIT                                                    05640000
092100     END-EXEC.                                                    05650000
092200                                                                  05660000
092300     EVALUATE TRUE                                                05670000
092400        WHEN SQLCODE = 0                                          05680000
092500            CONTINUE                                              05690000
092600        WHEN OTHER                                                05700000
092700            MOVE '9000-COMMIT' TO PV-PARAGRAPH-NAME               05710000
092800            MOVE 'COMMIT FAILED' TO PV-DB2-OPERATION              05720000
092900            PERFORM 9100-SQL-ABEND                                05730000
093000     END-EVALUATE.                                                05740000
093100                                                                  05750000
093200******************************************************************05760000
093300* 9100-SQL-ABEND - PERFORMS THE ABEND FOR THE PROGRAM IN THE      05770000
093400* EVENT THAT AN SQL ERROR OR WARNING CODE OCCURS.                 05780000
093500******************************************************************05790000
093600 9100-SQL-ABEND.                                                  05800000
093700     DISPLAY '** ABEND     **'.                                   05810000
093800     DISPLAY '** PROGRAM   ** = ' PC-PROGRAM-NAME.                05820000
093900     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH-NAME.              05830000
094000     DISPLAY '** OPERATION ** = ' PV-DB2-OPERATION.               05840000
094100                                                                  05850000
094200******************************************************************05860000
094300* COPYBOOK CONTAINING PROCEDURE DIVISION STATEMENTS REQUIRED      05870000
094400* TO UTILIZE SQLCA MESSAGE DISPLAY MODULE 'DSNTIAR' FOLLOWS       05880000
094500******************************************************************05890000
094600                                                                  05900000
094700     COPY DPPD004.                                                05910000
094800                                                                  05920000
094900     SET AC-DB2-ERROR TO TRUE.                                    05930000
095000     CALL 'ILBOABN0' USING AC-ABEND-CODE.                         05940000
095100                                                                  05950000
094500******************************************************************05960000
       9999-END-OF-PROGRAM.                                             05970000
            CLOSE POS-INPUT-FILE.                                       05971000
            CLOSE POS-ERROR-FILE.                                       05973000
            DISPLAY '****************************'.                     05980000
            DISPLAY 'NO OF RECORDS READ  :'PV-RECORDS-READ.             06000000
            DISPLAY 'NO OF CARDS ACTIVATE:' PV-ACTIVATE-COUNT.          06010000
            DISPLAY 'NO OF ERROR CARDS   :' PV-ERROR-COUNT.             06020000
            DISPLAY '  END OF PROGRAM'.                                 06021000
            DISPLAY '****************************'.                     06030000
012300**********************************************************        06040000
012400*  CARD CONVERSION MODULE                                         06050000
012300**********************************************************        06060000
012600     COPY SVPD007.                                                06070000
