000100 IDENTIFICATION DIVISION.                                         00010000
000200                                                                  00020000
000300 PROGRAM-ID.      SVKUT013.                                       00030001
000400 AUTHOR.          DAN PAYNTER.                                    00040001
000500 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00050000
000600 DATE-WRITTEN.    05/13/2022.                                     00060001
000700 DATE-COMPILED.                                                   00070000
000800                                                                  00080000
000900******************************************************************00090000
001000*  MODULE TYPE:   COBOL2 BATCH.                                   00100000
001100*                                                                 00110000
001200* THIS PROGRAM PREPARES THE GC FAILED ATTEMPTS FILE TO BE         00120001
001300* PROCESSED BY SVKUP012 UNDER THE DB2 CHECKPOINT RESTART SYSTEM.  00130001
001400*                                                                 00140000
001500* THE PROGRAM READS THE FAILED GC ATTEMPTS UPDATE FILE, REFORMATS 00150001
001600* THE RECORDS AND SETS A CHECKPOINT INDICATOR ON THE RECORD BASED 00160000
001700* ON HOW CHECKPOINTS WILL BE TAKEN BY THE MAINTENANCE PROGRAM.    00170000
001800* AFTER A RECORD HAS BEEN REFORMATTED IT IS PASSED TO THE         00180000
001900* TRANSACTION PREPARATION MODULE (DPKUT900) WHICH DOES SOME MORE  00190000
002000* PROCESSING ON THE RECORDS AND WRITES THE REFORMATTED RECORDS    00200000
002100* OUT TO A SEQUENTIAL FILE.                                       00210000
002200*                                                                 00220000
002300* THE PROGRAM COMMUNICATES WITH THE TRANSACTION PREPARATION       00230000
002400* MODULE USING FUNCTION CODES (OPEN, WRITE, & CLOSE) AND CHECKS   00240000
002500* THE RETURN CODE AFTER EACH REQUEST.  IF AN INVALID RETURN CODE  00250000
002600* IS RECEIVED, ANY INFORMATION THAT MAY BE HELPFUL IN RESOLVING   00260000
002700* THE BAD RETURN CODE IS DISPLAYED ON SYSOUT AND THE PROGRAM      00270000
002800* ABENDS.                                                         00280000
002900*                                                                 00290000
003000*========================== CHANGE LOG ===========================00300000
003100* CHANGE       BY           DATE    DESCRIPTION                   00310000
003200*=================================================================00320000
003300* CHG0270185  DAN PAYNTER 05-17-22  CREATE PROGRAM                00330003
003500******************************************************************00350000
003600                                                                  00360000
003700 ENVIRONMENT DIVISION.                                            00370000
003800 CONFIGURATION SECTION.                                           00380000
003900                                                                  00390000
004000 SOURCE-COMPUTER.    IBM-3090.                                    00400000
004100 OBJECT-COMPUTER.    IBM-3090.                                    00410000
004200                                                                  00420000
004300 INPUT-OUTPUT SECTION.                                            00430000
004400 FILE-CONTROL.                                                    00440000
004500                                                                  00450000
004600     SELECT UPDATE-FILE   ASSIGN TO INP01.                        00460000
004700                                                                  00470000
004800 DATA DIVISION.                                                   00480000
004900 FILE SECTION.                                                    00490000
005000                                                                  00500000
005100 FD  UPDATE-FILE                                                  00510000
005200     RECORDING MODE IS F                                          00520000
005300     BLOCK CONTAINS 0 RECORDS                                     00530000
005400     LABEL RECORDS ARE OMITTED.                                   00540000
005500                                                                  00550000
005600 01  UPDATE-REC                       PIC  X(100).                00560001
005700                                                                  00570000
005800***************************************************************** 00580000
005900*                       WORKING STORAGE                           00590000
006000***************************************************************** 00600000
006100 WORKING-STORAGE SECTION.                                         00610000
006200                                                                  00620000
006300 01  WS-START                         PIC  X(40)                  00630000
006400     VALUE 'SVKUT013 - WORKING STORAGE BEGINS HERE'.              00640001
006500                                                                  00650000
006600                                                                  00660000
006700***************************************************************** 00670000
006800*                         SWITCHES                                00680000
006900***************************************************************** 00690000
007000 01  PROGRAM-SWITCHES.                                            00700000
007100     05  PS-INPUT-UPDATE-EOF-SW       PIC  X(01) VALUE 'N'.       00710000
007200         88  PS-INPUT-UPDATE-EOF                 VALUE 'Y'.       00720000
007300     05  PS-FIRST-TRANS-READ-SW       PIC  X(01) VALUE 'Y'.       00730000
007400         88  FIRST-TRANS-READ                    VALUE 'Y'.       00740000
007500                                                                  00750000
007600******************************************************************00760000
007700*                       ACCUMULATORS                              00770000
007800******************************************************************00780000
007900 01  PROGRAM-ACCUMULATORS.                                        00790000
008000     05  PA-READ                      PIC  9(11) VALUE ZEROS.     00800000
008100     05  PA-WRITTEN                   PIC  9(11) VALUE ZEROS.     00810000
008200                                                                  00820000
008300******************************************************************00830000
008400*                           CONSTANTS                             00840000
008500******************************************************************00850000
008600 01  PROGRAM-CONSTANTS.                                           00860000
008700     05  PC-PROGRAM-NAME              PIC  X(08) VALUE 'SVKUT013'.00870001
008800                                                                  00880000
008900     05  PC-TRAN-PREP-FUNC-CODES.                                 00890000
009000         10  PC-TRAN-PREP-FUNC-OPEN   PIC  X(05) VALUE 'OPEN '.   00900000
009100         10  PC-TRAN-PREP-FUNC-WRITE  PIC  X(05) VALUE 'WRITE'.   00910000
009200         10  PC-TRAN-PREP-FUNC-CLOSE  PIC  X(05) VALUE 'CLOSE'.   00920000
009300                                                                  00930000
009400     05  PC-JOB-NAME                  PIC  X(08) VALUE 'SVK026  '.00940001
009500     05  PC-PLAN-NAME                 PIC  X(08) VALUE 'SVKUP012'.00950001
009600     05  PC-TRANS-RECORD-LENGTH       PIC S9(04) VALUE +100 COMP. 00960002
009700                                                                  00970000
009800******************************************************************00980000
009900*                          VARIABLES                              00990000
010000******************************************************************01000000
010100 01  PROGRAM-VARIABLES.                                           01010000
010200     05  PV-PARAGRAPH-NAME            PIC  X(30) VALUE SPACES.    01020000
010300     05  PV-OPERATION-MSG             PIC  X(60) VALUE SPACES.    01030000
010400     05  PV-RET-CODE                  PIC  9(04) VALUE ZEROS.     01040000
010500                                                                  01050000
010600     05  PV-CHECKPOINT-TYPE           PIC  X(01) VALUE SPACE.     01060000
010700         88  CONTROL-BREAK                       VALUE 'C'.       01070000
010800         88  LOGICAL-TRANSACTION                 VALUE 'L'.       01080000
010900         88  TIME-INTERVAL                       VALUE 'T'.       01090000
011000         88  REQUESTED-BY-PROGRAM                VALUE 'R'.       01100000
011100                                                                  01110000
011200     05  PV-HOLD-CRD-NBR              PIC  9(04) VALUE ZERO.      01120001
011300                                                                  01130000
011400******************************************************************01140000
011500*               SYSTEM TIME AND DATE VARIABLES                    01150000
011600******************************************************************01160000
011700 01  SYS-DATE-TIME.                                               01170000
011800     05  SYS-DATE                     PIC  X(08) VALUE SPACES.    01180000
011900     05  SYS-TIME                     PIC  X(08) VALUE SPACES.    01190000
012000                                                                  01200000
012100 01  ST-BEG-TIME.                                                 01210000
012200     05  ST-BEG-HR                    PIC  9(02) VALUE ZEROS.     01220000
012300     05  FILLER                       PIC  X(01) VALUE ':'.       01230000
012400     05  ST-BEG-MN                    PIC  9(02) VALUE ZEROS.     01240000
012500                                                                  01250000
012600 01  ST-END-TIME.                                                 01260000
012700     05  ST-END-HR                    PIC  9(02) VALUE ZEROS.     01270000
012800     05  FILLER                       PIC  X(01) VALUE ':'.       01280000
012900     05  ST-END-MN                    PIC  9(02) VALUE ZEROS.     01290000
013000                                                                  01300000
013100 01  SD-EDIT-DATE.                                                01310000
013200     05  SD-MONTH                     PIC  9(02) VALUE ZEROS.     01320000
013300     05  FILLER                       PIC  X(01) VALUE '-'.       01330000
013400     05  SD-DAY                       PIC  9(02) VALUE ZEROS.     01340000
013500     05  FILLER                       PIC  X(01) VALUE '-'.       01350000
013600     05  SD-CENT                      PIC  9(02) VALUE ZEROS.     01360000
013700     05  SD-YEAR                      PIC  9(02) VALUE ZEROS.     01370000
013800                                                                  01380000
013900******************************************************************01390000
014000*                        ERROR HANDLING                           01400000
014100******************************************************************01410000
014200 01  ABEND-CODE                       PIC S9(04) VALUE ZEROS      01420000
014300                                                 COMP SYNC.       01430000
014500     88  ABEND-4019-CAL-SUB-ERROR          VALUE +4019.           01440000
014600                                                                  01450000
014700                                                                  01460000
      ***************************************************************** 01470000
      *  WS FIELDS FOR TEPITM AND TEPEID ASSOCIATE DISCOUNT UPDATES     01480000
      ***************************************************************** 01490000
           COPY SVRD024.                                                01500001
                                                                        01510000
015200                                                                  01520000
015300******************************************************************01530000
015400*  TRANSACTION PREPARATION MODULE LINKAGE SECTION                 01540000
015500******************************************************************01550000
260107     COPY DPWS990.                                                01560000
015700                                                                  01570000
015600     COPY DPLS000.                                                01571000
015700                                                                  01572000
015800******************************************************************01580000
015900*  SQL COMMUNICATIONS WORK AREA                                   01590000
016000******************************************************************01600000
016100     COPY SQLCA2.                                                 01610000
016200                                                                  01620000
016300                                                                  01630000
016500                                                                  01640000
016600 PROCEDURE DIVISION.                                              01650000
016700******************************************************************01660000
016800* MAINLINE-PROCESSING                                             01670000
016900******************************************************************01680000
017000                                                                  01690000
017100     PERFORM A100-INITIALIZE.                                     01700000
017200                                                                  01710000
017300     PERFORM B100-PROCESS-UPDATE-INPUT-FILE                       01720000
017400       UNTIL PS-INPUT-UPDATE-EOF.                                 01730000
017500                                                                  01740000
017600     PERFORM Z990-END-OF-JOB-ROUTINE.                             01750000
017700                                                                  01760000
017800     GOBACK.                                                      01770000
017900                                                                  01780000
018000                                                                  01790000
018100******************************************************************01800000
018200* PREFORMS TASK INITIATION                                        01810000
018300******************************************************************01820000
018400 A100-INITIALIZE.                                                 01830000
018500                                                                  01840000
018600     OPEN INPUT UPDATE-FILE.                                      01850000
018700                                                                  01860000
018800     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 01870000
018900                                                                  01880000
019000     MOVE SYS-TIME (1:2) TO ST-BEG-HR.                            01890000
019100     MOVE SYS-TIME (3:2) TO ST-BEG-MN.                            01900000
019200                                                                  01910000
019300     MOVE SYS-DATE (1:2) TO SD-CENT.                              01920000
019400     MOVE SYS-DATE (3:2) TO SD-YEAR.                              01930000
019500     MOVE SYS-DATE (5:2) TO SD-MONTH.                             01940000
019600     MOVE SYS-DATE (7:2) TO SD-DAY.                               01950000
019700                                                                  01960000
019800     PERFORM C100-ISSUE-OPEN-REQUEST.                             01970000
019900                                                                  01980000
020000     PERFORM C200-READ-UPDATE-INPUT-FILE.                         01990000
020100                                                                  02000000
020200     IF PS-INPUT-UPDATE-EOF                                       02010000
020200        DISPLAY '**** EMPTY UPDATE FILE ****'                     02020000
020800     END-IF.                                                      02030000
020900                                                                  02040000
021000                                                                  02050000
021100******************************************************************02060000
021200* PROCESS THE UPDATE FILE. IF A RECORD IS READ, GATHER WHATEVER   02070000
021300* OTHER DATA IS NECESSARY TO TAKE CHECKPOINTS BASED ON THE TYPE OF02080000
021400* CHECKPOINTS BEING TAKEN BY SVKUP012 AND ISSUE A WRITE REQUEST   02090001
021500* TO THE TRANSACTION PREPARATION PROGRAM.                         02100000
021600******************************************************************02110000
021700 B100-PROCESS-UPDATE-INPUT-FILE.                                  02120000
021800                                                                  02130000
021900     IF FIRST-TRANS-READ                                          02140000
022000         MOVE SV024-CRD-NBR       TO PV-HOLD-CRD-NBR              02150001
022100         MOVE 'N'                 TO PS-FIRST-TRANS-READ-SW       02160000
022200     END-IF.                                                      02170000
022300                                                                  02180000
022400     IF CONTROL-BREAK                                             02190000
022500         PERFORM C300-CKPT-BY-CNTL-BREAK                          02200000
022600     ELSE                                                         02210000
022700         IF LOGICAL-TRANSACTION                                   02220000
022800             PERFORM C400-CKPT-BY-LOGICAL-TRANS                   02230000
022900         ELSE                                                     02240000
023000             PERFORM C500-CKPT-BY-TIME-OR-REQUEST                 02250000
023100         END-IF                                                   02260000
023200     END-IF.                                                      02270000
023300                                                                  02280000
023400     PERFORM C200-READ-UPDATE-INPUT-FILE.                         02290000
023500                                                                  02300000
023600                                                                  02310000
023700******************************************************************02320000
023800* ISSUE AN 'OPEN' REQUEST TO THE TRANSACTION PREPARATION MODULE   02330000
023900******************************************************************02340000
024000 C100-ISSUE-OPEN-REQUEST.                                         02350000
024100                                                                  02360000
024200     MOVE PC-TRAN-PREP-FUNC-OPEN TO DP000-FUNC-CODE.              02370000
024300     MOVE PC-JOB-NAME            TO DP000-JOB-NAME.               02380000
024400     MOVE PC-PLAN-NAME           TO DP000-PLAN-NAME.              02390000
024500                                                                  02400000
024600     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         02410000
024700                                                                  02420000
024800     MOVE DP000-CKPT-TYPE-CODE   TO PV-CHECKPOINT-TYPE.           02430000
024900                                                                  02440000
025000                                                                  02450000
025100******************************************************************02460000
025200* READ THE UPDATE INPUT FILE                                      02470000
025300******************************************************************02480000
025400 C200-READ-UPDATE-INPUT-FILE.                                     02490000
025500                                                                  02500000
025600     READ UPDATE-FILE INTO SV024-CARD-UPDT-RECORD                 02510001
025700       AT END SET PS-INPUT-UPDATE-EOF TO TRUE.                    02520000
025800                                                                  02530000
025900     IF PS-INPUT-UPDATE-EOF                                       02540000
026000         CONTINUE                                                 02550000
026100     ELSE                                                         02560000
026200         ADD +1 TO PA-READ                                        02570000
026300     END-IF.                                                      02580000
026400                                                                  02590000
026500                                                                  02600000
026600******************************************************************02610000
026700* THIS ROUTINE SETS THE CHECKPOINT INDICATOR ON THE TRANSACATION  02620000
026800* RECORD "ON" IF THERE IS A CHANGE IN THE STORE NUMBER. AFTER     02630000
026900* THE TRANSACTION RECORD HAS BEEN FORMATTED, A WRITE REQUEST IS   02640000
027000* ISSUED TO THE TRANSACTION PREPARATION MODULE.                   02650000
027100*                                                                 02660000
027200* NOTE: AT THIS TIME CONTROL/LOGIC BREAK PROCESSING IS IDENTICAL. 02670000
027300******************************************************************02680000
027400 C300-CKPT-BY-CNTL-BREAK.                                         02690000
027500                                                                  02700000
027600     IF  SV024-CRD-NBR = PV-HOLD-CRD-NBR                          02710001
027700         MOVE 'N' TO DP000-CHECKPOINT-IND                         02720000
027800     ELSE                                                         02730000
027900         MOVE 'Y' TO DP000-CHECKPOINT-IND                         02740000
028000         MOVE SV024-CRD-NBR       TO PV-HOLD-CRD-NBR              02750001
028100     END-IF.                                                      02760000
028200                                                                  02770000
028300     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      02780000
028400     MOVE SV024-CARD-UPDT-RECORD  TO DP000-TRANS-REC.             02790001
028500     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             02800000
028600     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              02810000
028700     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             02820000
028800                                                                  02830000
028900     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         02840000
029000                                                                  02850000
029100     ADD +1 TO PA-WRITTEN.                                        02860000
029200                                                                  02870000
029300                                                                  02880000
029400******************************************************************02890000
029500* THIS ROUTINE SETS THE CHECKPOINT INDICATOR ON THE TRANSACTION   02900000
029600* RECORD "ON".  THE UPDATE PROGRAM WILL CHECK THE CHECKPOINT      02910000
029700* FREQUENCY TO KNOW WHETHER A CHECKPOINT SHOULD BE TAKEN. AFTER   02920000
029800* THE TRANSACTION RECORD HAS BEEN FORMATTED, A WRITE REQUEST IS   02930000
029900* ISSUED TO THE TRANSACTION PREPARATION MODULE.                   02940000
030000******************************************************************02950000
030100 C400-CKPT-BY-LOGICAL-TRANS.                                      02960000
030200                                                                  02970000
027600     IF  SV024-CRD-NBR = PV-HOLD-CRD-NBR                          02980001
027700         MOVE 'N' TO DP000-CHECKPOINT-IND                         02990000
027800     ELSE                                                         03000000
027900         MOVE 'Y' TO DP000-CHECKPOINT-IND                         03010000
028000         MOVE SV024-CRD-NBR       TO PV-HOLD-CRD-NBR              03020001
028100     END-IF.                                                      03030000
030900                                                                  03040000
028300     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      03050000
028400     MOVE SV024-CARD-UPDT-RECORD  TO DP000-TRANS-REC.             03060001
028500     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             03070000
028600     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03080000
028700     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03090000
031500                                                                  03100000
031600     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03110000
031700                                                                  03120000
031800     ADD +1 TO PA-WRITTEN.                                        03130000
031900                                                                  03140000
032000                                                                  03150000
032100******************************************************************03160000
032200* THIS ROUTINE BUILDS THE TRANSACTION RECORD AND ISSUES A WRITE   03170000
032300* REQUEST TO THE TRANSACTION PREPARATION MODULE IF CHECKPOINTS ARE03180000
032400* TAKEN BY TIME INTERVAL (SECONDS) OR REQUESTED BY THE MAINTENANCE03190000
032500* PROGRAM.                                                        03200000
032600******************************************************************03210000
032700 C500-CKPT-BY-TIME-OR-REQUEST.                                    03220000
032800                                                                  03230000
032900     MOVE 'N'                     TO DP000-CHECKPOINT-IND.        03240000
033000                                                                  03250000
033100     MOVE PC-TRANS-RECORD-LENGTH  TO DP000-TRANS-REC-LENGTH.      03260000
028400     MOVE SV024-CARD-UPDT-RECORD  TO DP000-TRANS-REC.             03270001
033300     MOVE PC-TRAN-PREP-FUNC-WRITE TO DP000-FUNC-CODE.             03280000
033400     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03290000
033500     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03300000
033600                                                                  03310000
033700     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03320000
033800                                                                  03330000
033900     ADD +1 TO PA-WRITTEN.                                        03340000
034000                                                                  03350000
034100                                                                  03360000
034200******************************************************************03370000
034300* ISSUE A 'CLOSE' REQUEST TO THE TRANSACTION PREPARATION MODULE   03380000
034400******************************************************************03390000
034500 C600-ISSUE-CLOSE-REQUEST.                                        03400000
034600                                                                  03410000
034700     MOVE PC-TRAN-PREP-FUNC-CLOSE TO DP000-FUNC-CODE.             03420000
034800     MOVE PC-JOB-NAME             TO DP000-JOB-NAME.              03430000
034900     MOVE PC-PLAN-NAME            TO DP000-PLAN-NAME.             03440000
035000                                                                  03450000
035100     PERFORM Z100-CALL-TRANS-PREP-MODULE.                         03460000
035200                                                                  03470000
035300                                                                  03480000
035400******************************************************************03490000
035500* VERIFY THE RETURN CODE ON THE CALLED MODULE                     03500000
035600******************************************************************03510000
035700 Z100-CALL-TRANS-PREP-MODULE.                                     03520000
035800                                                                  03530000
035900     PERFORM Z900-CALL-TRANS-PREP-MODULE.                         03540000
036000                                                                  03550000
036100     IF  DP000-GOOD-RET-CODE                                      03560000
036200         CONTINUE                                                 03570000
036300                                                                  03580000
036400     ELSE                                                         03590000
036500         MOVE 'Z100-CALL-TRANS-PREP-MODULE' TO PV-PARAGRAPH-NAME  03600000
036600         MOVE '** BAD CALL TO TRANS PREP MODULE **'               03610000
036700                                            TO PV-OPERATION-MSG   03620000
036800         MOVE DP000-RET-CODE                TO PV-RET-CODE        03630000
036900                                                                  03640000
037000         SET ABEND-4019-CAL-SUB-ERROR TO TRUE                     03650000
037100                                                                  03660000
037200         PERFORM Z200-ABEND                                       03670000
037300     END-IF.                                                      03680000
037400                                                                  03690000
037500                                                                  03700000
037600******************************************************************03710000
037700* NON-DB2 ABEND                                                   03720000
037800******************************************************************03730000
037900 Z200-ABEND.                                                      03740000
038000                                                                  03750000
038100     PERFORM Z999-CONTROLS.                                       03760000
038200                                                                  03770000
038300     DISPLAY '                     '.                             03780000
038400     DISPLAY '** ABEND           **'.                             03790000
038500     DISPLAY '** PROGRAM         ** = ' PC-PROGRAM-NAME.          03800000
038600     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.        03810000
038700     DISPLAY '** OPERATION       ** = ' PV-OPERATION-MSG.         03820000
038800     DISPLAY '** RETURN CODE     ** = ' PV-RET-CODE.              03830000
038900                                                                  03840000
039000     CALL 'ILBOABN0' USING ABEND-CODE.                            03850000
039100                                                                  03860000
039200                                                                  03870000
039300******************************************************************03880000
039400* PERFORMS TASK TERMINATION PROCESSING                            03890000
039500******************************************************************03900000
039600 Z990-END-OF-JOB-ROUTINE.                                         03910000
039700                                                                  03920000
039800     CLOSE UPDATE-FILE.                                           03930000
039900                                                                  03940000
040000     PERFORM C600-ISSUE-CLOSE-REQUEST.                            03950000
040100                                                                  03960000
040200     PERFORM Z999-CONTROLS.                                       03970000
040300                                                                  03980000
040400                                                                  03990000
040500******************************************************************04000000
040600* DISPLAY CONTROLS FROM THE PROGRAM                               04010000
040700******************************************************************04020000
040800 Z999-CONTROLS.                                                   04030000
040900                                                                  04040000
041000     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 04050000
041100                                                                  04060000
041200     MOVE SYS-TIME (1:2) TO ST-END-HR.                            04070000
041300     MOVE SYS-TIME (3:2) TO ST-END-MN.                            04080000
041400                                                                  04090000
041500     DISPLAY '                    '.                              04100000
041600     DISPLAY '**********************'.                            04110000
041700     DISPLAY '   SVKUT013 CONTROLS  '.                            04120001
041800     DISPLAY '**********************'.                            04130000
041900     DISPLAY 'RUN DATE  = ' SD-EDIT-DATE.                         04140000
042000     DISPLAY 'BEG TIME  = ' ST-BEG-TIME.                          04150000
042100     DISPLAY 'END TIME  = ' ST-END-TIME.                          04160000
042200     DISPLAY '======================'.                            04170000
042300     DISPLAY 'RECORDS READ    = ' PA-READ.                        04180000
042400     DISPLAY '                  '.                                04190000
042500     DISPLAY 'RECORDS WRITTEN = ' PA-WRITTEN.                     04200000
042600     DISPLAY '                  '.                                04210000
042700                                                                  04220000
042800                                                                  04230000
042900******************************************************************04240000
043000* TRANSACTION PREPARATION MODULE CALL AND ERROR ROUTINES          04250000
043100******************************************************************04260000
043200     COPY DPPD000.                                                04270000
043300                                                                  04280000
043400                                                                  04290000
