000100******************************************************************00010000
000200*  KOHL'S MERCHANDISE CARD DAILY FILE EXTRACT RECORD LAYOUT FROM *00020000
000300*  THE SVT_KOHLS_CRD_TXN TABLE.                                  *00030000
P10237* LRECL = 158                                                    *00040004
000500******************************************************************00050000
P10237* DATE:        06/08/2015                                        *00051004
P10237* WR/IR#:      CHG0104429                                        *00052004
P10237* PROGRAMMER:  COGNIZANT                                         *00053004
P10237* DESCRIPTION: ADDED THE DRIVER LICENSE FIELD AT THE END TO HAVE *00054004
P10237*              THE ENCRYPTED DATA AND THE EXISTING DRIVER LICENSE*00055004
P10237*              FIELD IS CHANGED TO FILLER.                       *00056005
P10237*              SV018-DRIVERS-LICENSE - INCREASED FROM 21 TO 48   *00056106
P10237******************************************************************00057004
000580* DATE:        05/17/2016                                        *00058007
000590* WR/IR#:      CHG0141575                                        *00059009
000591* PROGRAMMER:  ACCENTURE                                         *00059107
000592* DESCRIPTION: ADDED 88 LEVEL VARIABLE FOR FILEGC, FILAKMC       *00059208
000593*              IN SV022-CRD-SPCTY-TYP-CDE                        *00059307
000596******************************************************************00059607
000600 01  SV022-KMCACT-EXTRACT-RECORD.                                 00060000
000700     05  SV022-CRD-TYP-CDE        PIC S9(01)V COMP-3.             00070000
000800         88  SV022-CRD-TYP-KMRC                 VALUE 1.          00080000
000900         88  SV022-CRD-TYP-GIFT                 VALUE 2.          00090000
001000     05  SV022-CRD-NBR            PIC S9(12)V   COMP-3.           00100000
001100     05  SV022-POS-DTE            PIC X(10).                      00110000
001200     05  SV022-STR-NBR            PIC S9(04)    COMP.             00120000
001300     05  SV022-TRMNL-NBR          PIC S9(04)    COMP.             00130000
001400     05  SV022-TRN-NBR            PIC S9(04)    COMP.             00140000
001500     05  SV022-APP-AUTH-AMT       PIC S9(07)V99 COMP-3.           00150000
001600     05  SV022-ORIG-AUTH-AMT      PIC S9(07)V99 COMP-3.           00160000
001700     05  SV022-TRN-VOID-IND       PIC X(01).                      00170000
001800     05  SV022-TRN-RVRSL-CDE      PIC S9(01)V   COMP-3.           00180000
P10237     05  FILLER                   PIC X(21).                      00190004
002000     05  SV022-ACTVY-STAT-CDE     PIC S9(01)V   COMP-3.           00200000
002100     05  SV022-ACTVY-TYP-CDE      PIC S9(01)V   COMP-3.           00210000
002200     05  SV022-POS-OPER-ID        PIC S9(11)V   COMP-3.           00220000
002300     05  SV022-APPR-USER-ID       PIC  X(08).                     00230000
002400     05  SV022-OVERTENDER-SW      PIC  X(01).                     00240000
002500         88  SV022-OVERTENDERED                 VALUE 'Y'.        00250000
002600         88  SV022-NOT-OVER                     VALUE 'N'.        00260000
002400     05  SV022-TRN-AUTH-TMST      PIC  X(26).                     00261000
002700     05  SV022-ST-CDE             PIC  X(02).                     00270000
002400     05  SV022-TRN-STAT-CDE       PIC  X(02).                     00271000
002400     05  SV022-CRD-SPCTY-TYP-CDE  PIC S9(01)V   COMP-3.           00272000
000800         88  SV022-CRD-TYP-GC-KMRC              VALUE 0.          00273000
000900         88  SV022-CRD-TYP-KCK                  VALUE 1.          00274000
000900         88  SV022-CRD-TYP-VIRTUAL              VALUE 2.          00275000
000900         88  SV022-CRD-TYP-KMRC                 VALUE 3.          00276001
000900         88  SV022-CRD-TYP-FILA-GC              VALUE 4.          00276107
000900         88  SV022-CRD-TYP-FILA-KMC             VALUE 5.          00276207
P10237     05  SV022-DRV-LIC-NBR        PIC  X(48).                     00277004
P12431     05  SV022-ORD-NBR            PIC  X(40) VALUE SPACES.        00278011
002800     05  FILLER                   PIC  X(05).                     00280000
002900                                                                  00290000
