000100******************************************************************00010000
000200*  SVRD064 - DISTRIBUTION HEADER RECORD LAYOUT                    00020000
000300*    -  STORED VALUE OFF-LINE FILE  -  NEXT GEN POS  -            00030000
000400*    HEADERS ARE USED BY A PROCESS AT THE MID-TIER SERVER         00040000
000500*    TO BREAK THE ONE FILE INTO MULTIPLE FILES, AND DISTRIBUTE    00050000
000600*    THE RESULTING FILES TO THE APPROPRIATE LOCATIONS.            00060000
000700*    THE HEADERS WILL BE IDENTIFIED BY 'HDR' IN THE               00070000
000800*    HEADER-IND FIELD.                                            00080000
000900******************************************************************00090000
001000 01  SV064-SV-HEADER-RECORD.                                      00100001
001100     05  SV064-HDR-IND               PIC  X(03)  VALUE 'HDR'.     00110001
001200     05  SV064-STR-GP-TYP            PIC  9(05)  VALUE ZEROES.    00120002
001300         88 SV064-METRO-GRP                      VALUE 02000.     00130001
001400         88 SV064-STR-GRP                        VALUE 05000.     00140001
001500     05  SV064-STR-GP-OUT            PIC  9(05)  VALUE ZEROES.    00150002
001600     05  SV064-STR-GP-ID             PIC  9(05)  VALUE ZEROES.    00160002
001700     05  SV064-EXCP-STR-NBR          PIC  9(05)  VALUE ZEROES.    00170002
001800     05  SV064-FILE-DIST-DTE         PIC  X(08)  VALUE SPACES.    00180001
001900     05  SV064-FILE-NAME-GRP.                                     00190000
002000         10  SV064-FILE-NAME.                                     00200001
002100             15  SV064-FIL-NAM-GRP   PIC  X(03)  VALUE SPACES.    00210000
002110                 88 SV064-FIL-NAM-PMU            VALUE 'PMU'.     00230000
002200             15  SV064-UNDERSCORE-1  PIC  X(01)  VALUE '_'.       00250000
002300             15  SV064-FIL-NAM-TBL   PIC  X(02)  VALUE SPACES.    00210000
002310                 88 SV064-FIL-NAM-TBL-SV         VALUE 'SV'.      00230000
002400             15  SV064-UNDERSCORE-2  PIC  X(01)  VALUE '_'.       00250000
002500             15  SV064-FIL-NAM-TYP   PIC  X(03)  VALUE SPACES.    00220000
002600                 88 SV064-FIL-TYP-FUL            VALUE 'FUL'.     00230000
002700                 88 SV064-FIL-TYP-CHG            VALUE 'CHG'.     00240000
002800         10  SV064-UNDERSCORE-3      PIC  X(01)  VALUE '_'.       00250000
002900         10  SV064-STR-NBR           PIC  9(05).                  00260000
003000         10  SV064-STR-NBR-X     REDEFINES                        00260000
003100             SV064-STR-NBR           PIC  X(05).                  00260000
003200         10  SV064-UNDERSCORE-4      PIC  X(01)  VALUE '_'.       00270000
003300         10  SV064-CRT-TIMESTAMP.                                 00280003
003400             15  SV064-CRT-DATE      PIC  X(08)  VALUE SPACES.    00290003
003500             15  SV064-CRT-TIME      PIC  X(06)  VALUE SPACES.    00300003
003600         10  SV064-UNDERSCORE-5      PIC  X(01)  VALUE '_'.       00320000
003700         10  SV064-FILE-APPLY-TYP    PIC  X(01)  VALUE 'N'.       00330000
