      ***************************************************************** 00010000
      * THIS COPYBOOK IS THE LAYOUT FOR THE STORED VALUE ACTIVITY     * 00010100
      * RECORDS FOR THE ESCHEAT REPORT     LRECL=103                  * 00010201
      ***************************************************************** 00010300
       01  SV033-RECORD.                                                        
           05 SV033-CRD-NBR                PIC  S9(12)       COMP-3.            
           05 SV033-ACTVY-TYP-CDE          PIC  S9(01)       COMP-3.            
           05 SV033-APP-AUTH-AMT           PIC  S9(07)V9(02) COMP-3.            
           05 SV033-ISSUE-TIMESTAMP        PIC  X(26).                          
           05 SV033-TENDER-TIMESTAMP       PIC  X(26).                          
           05 SV033-CRD-STK-TYP-ID         PIC  X(08).                          
           05 SV033-CRD-STK-TYP-DESC       PIC  X(25).                          
           05 SV033-TRN-VOID-IND           PIC  X(01).                          
           05 SV033-STATE-CDE              PIC  X(02).                          
           05 SV033-CRD-STAT-CDE           PIC  X(02).                          
