000010 01  SV012-CRD-INFO.                                              00001001
000020     05  SV012-CRD-NBR                PIC S9(12)V COMP-3.         00002001
000021     05  SV012-CRD-PROD-YR            PIC S9(04)V COMP.           00002102
000030     05  SV012-SHIPT-REQ-NBR          PIC S9(04)V COMP.           00003002
000040     05  SV012-CRD-TYP-CDE            PIC S9(01)V COMP-3.         00004004
000050     05  SV012-CRD-STAT-CDE           PIC XX.                     00005001
