      ******************************************************************04/29/88
      *  KOHL'S MERCHANDISE CARD ACTIVITY UPDATE POSTING FILE RECORD   *MIRD010O
      *  LAYOUT.                                                       *   LV001
      *                                                                *   CL**9
      * THIS LAYOUT IS USED TO UPDATE THE KMC ACTIVITY TABLE DURING    *   CL*10
      * POSTING.                                                       *   CL*10
      *                                                                *   CL**9
P10237* LRECL = 158                                                    *   CL**9
      ******************************************************************   CL**9
P10237* DATE:        06/08/2015                                        *        
P10237* WR/IR#:      CHG0104429                                        *        
P10237* PROGRAMMER:  COGNIZANT                                         *        
P10237* DESCRIPTION: ADDED THE DRIVER LICENSE FIELD AT THE END TO HAVE *        
P10237*              THE ENCRYPTED DATA AND THE EXISTING DRIVER LICENSE*        
P10237*              FIELD IS CHANGED TO FILLER.                       *        
P10237*              SV018-DRIVERS-LICENSE - INCREASED FROM 21 TO 48   *        
      ******************************************************************        
       01  SV018-UPDATE-POSTING-RECORD.                                    CL*10
           05  SV018-RECORD-TYPE       PIC X.                                   
               88  SV018-UPDATE-REC                        VALUE 'U'.           
               88  SV018-INSERT-REC                        VALUE 'I'.           
           05  SV018-CRD-TYP-CDE       PIC S9(01)V COMP-3.                      
           05  SV018-KMC-CRD-NBR       PIC S9(12)V COMP-3.                      
           05  SV018-POS-DATE          PIC X(10).                               
           05  SV018-STORE-NBR         PIC S9(04)  COMP.                        
           05  SV018-TERMINAL-NBR      PIC S9(04)  COMP.                        
           05  SV018-TRANSACTION-NBR   PIC S9(04)  COMP.                        
           05  SV018-APPROVED-TRAN-AMT PIC S9(07)V9(02)                         
                                                   COMP-3.                      
           05  SV018-ORIGINAL-AUTH-AMT PIC S9(07)V9(02)                         
                                                   COMP-3.                      
           05  SV018-TRANS-VOID-IND    PIC  X(01).                              
           05  SV018-REVERSAL-IND      PIC S9(01)  COMP-3.                      
               88  SV018-NORMAL                            VALUE 0.             
               88  SV018-REVERSAL                          VALUE 1.             
P10237     05  FILLER                  PIC  X(21).                              
           05  SV018-TRANS-TYPE        PIC S9(01)  COMP-3.                      
               88  SV018-ISSUANCE                          VALUE 1.             
               88  SV018-TENDER                            VALUE 3.             
           05  SV018-UPDATED-ACTIVITY  PIC S9(01)  COMP-3.                      
               88  SV018-NO-AUTHORIZATION                  VALUE 2.             
               88  SV018-SETTLED                           VALUE 3.             
           05  SV018-POS-OPERATOR-ID   PIC S9(11)  COMP-3.                      
           05  SV018-APPROVAL-USER-ID  PIC  X(08).                              
           05  SV018-TRN-AUTH-TMST     PIC  X(26).                              
           05  SV018-TRN-STAT-CDE      PIC  X(02).                              
P10237     05  SV018-DRIVERS-LICENSE   PIC  X(48).                              
P12431     05  SV018-ORD-NBR           PIC  X(40) VALUE SPACES.                 
           05  FILLER                  PIC  X(08).                              
