000100******************************************************************00010000
000200*  INCOMM DAILY RECONCILIATION FILE DETAIL                       *00020026
000300*  LRECL = 250                                                   *00030017
000400******************************************************************00040000
000500 01  SV072-DETAIL-TRANS.                                          00050000
000600     05  SV072-CARD-NBR                  PIC  9(12).              00060008
000800     05  SV072-TRANS-DATE                PIC  X(10).              00080007
001200     05  SV072-TRANS-AMOUNT              PIC S9(09)V99 COMP-3.    00120011
001300     05  SV072-REPORT-FLAG               PIC  X(03).              00130025
001400         88  SV072-RF-VERIFIED           VALUES                   00140026
001500                                 'VA', 'VD', 'VAR', 'VDR'.        00150026
001600         88  SV072-RF-VERIFIED-ACTIV     VALUE 'VA'.              00160026
001700         88  SV072-RF-VERIFIED-DEACTIV   VALUE 'VD'.              00170026
001800         88  SV072-RF-VERIFIED-A-REVERS  VALUE 'VAR'.             00180026
001900         88  SV072-RF-VERIFIED-D-REVERS  VALUE 'VDR'.             00190026
002000         88  SV072-RF-MISSING-INCOMM     VALUES                   00200026
002100                            'IA', 'ID', 'IAR', 'IDR'.             00210026
002200         88  SV072-RF-MISSING-I-ACTIV    VALUE 'IA'.              00220026
002300         88  SV072-RF-MISSING-I-DEACTIV  VALUE 'ID'.              00230026
002400         88  SV072-RF-MISSING-I-A-REVERS VALUE 'IAR'.             00240026
002500         88  SV072-RF-MISSING-I-D-REVERS VALUE 'IDR'.             00250026
002600         88  SV072-RF-MISSING-KOHLS      VALUES                   00260026
002700                            'KA', 'KD', 'KAR', 'KDR'.             00270026
002802         88  SV072-RF-MISSING-K-ACTIV    VALUE 'KA'.              00280215
002803         88  SV072-RF-MISSING-K-DEACTIV  VALUE 'KD'.              00280315
002804         88  SV072-RF-MISSING-K-A-REVERS VALUE 'KAR'.             00280415
002805         88  SV072-RF-MISSING-K-D-REVERS VALUE 'KDR'.             00280515
002810     05  SV072-UPC                       PIC  X(15).              00281009
002820     05  SV072-INCOMM-REF-NO             PIC  X(12).              00282012
002830     05  SV072-VAN16                     PIC  X(30).              00283010
002850     05  SV072-SELR-NM                   PIC  X(23).              00285021
002860     05  SV072-MERCHANT                  PIC  X(50).              00286007
002870     05  SV072-LOCATION                  PIC  X(50).              00287007
002880     05  SV072-TRN-AUTH-TMST             PIC  X(26).              00288017
002890     05  SV072-TRANS-ORDER               PIC  9(02).              00289020
002891         88 SV072-ACTIVATE               VALUE 00.                00289123
002892         88 SV072-REVERSAL-ACTIVATE      VALUE 01.                00289223
002893         88 SV072-DEACTIVATE             VALUE 02.                00289323
002894         88 SV072-REVERSAL-DEACTIVATE    VALUE 03.                00289423
003000     05  FILLER                          PIC  X(11).              00300025
