      ******************************************************************04/29/88
      *  KOHL'S POS MERCHANDISE CARD ACTIVITY EXTRACT RECORD LAYOUT.   *MIRD010O
      *                                                                *   CL**9
P10237* LRECL = 145                                                    *   CL**9
      ******************************************************************   CL**9
P10237* DATE:        06/08/2015                                        *        
P10237* WR/IR#:      CHG0104429                                        *        
P10237* PROGRAMMER:  COGNIZANT                                         *        
P10237* DESCRIPTION: ADDED THE DRIVER LICENSE FIELD AT THE END TO HAVE *        
P10237*              THE ENCRYPTED DATA AND THE EXISTING DRIVER LICENSE*        
P10237*              FIELD IS CHANGED TO FILLER.                       *        
P10237*              SV018-DRIVERS-LICENSE - INCREASED FROM 21 TO 48   *        
      ******************************************************************        
       01  SV021-POS-ACTIVITY-RECORD.                                           
           05  SV021-CRD-TYP-CDE        PIC S9(1)V COMP-3.                      
               88  SV021-CRD-TYP-KMRC                 VALUE 1.                  
               88  SV021-CRD-TYP-GIFT                 VALUE 2.                  
           05  SV021-CRD-NBR            PIC S9(12)V   COMP-3.                   
           05  SV021-POS-DTE            PIC X(10).                              
           05  SV021-STR-NBR            PIC S9(04)    COMP.                     
           05  SV021-TRMNL-NBR          PIC S9(04)    COMP.                     
           05  SV021-TRN-NBR            PIC S9(04)    COMP.                     
           05  SV021-APP-AUTH-AMT       PIC S9(07)V99 COMP-3.                   
           05  SV021-ORIG-AUTH-AMT      PIC S9(07)V99 COMP-3.                   
           05  SV021-TRN-VOID-IND       PIC X(01).                              
               88  SV021-TRN-VOID                     VALUE 'Y'.                
               88  SV021-TRN-NOT-VOID                 VALUE 'N'.                
                                                                                
           05  SV021-TRN-RVRSL-CDE      PIC S9(01)V   COMP-3.                   
P10237     05  FILLER                   PIC X(21).                              
           05  SV021-ACTVY-STAT-CDE     PIC S9(01)V   COMP-3.                   
           05  SV021-ACTVY-TYP-CDE      PIC S9(01)V   COMP-3.                   
           05  SV021-POS-OPER-ID        PIC S9(11)V   COMP-3.                   
           05  SV021-APPR-USER-ID       PIC  X(08).                             
           05  SV021-OVERTENDER-SW      PIC  X(01).                             
               88  SV021-OVERTENDERED                 VALUE 'Y'.                
               88  SV021-NOT-OVER                     VALUE 'N'.                
           05  SV021-TNDR-ID-SRCE       PIC  X(02).                             
               88  SV021-TI-KEY-ENTERED               VALUE '00'.               
               88  SV021-TI-MAG-STRIPE-READ           VALUE '01'.               
               88  SV021-TI-BAR-CODE-READ             VALUE '02'.               
               88  SV021-TI-CHECK-READER              VALUE '03'.               
           05  SV021-TRN-STAT-CDE       PIC  X(02).                             
P12431     05  SV021-ORD-NBR            PIC  X(40)    VALUE SPACES.             
           05  SV021-OMNI-CHNL-FFLMT    PIC  X(03).                             
P10237     05  SV021-DRV-LIC-NBR        PIC  X(48).                             
           05  FILLER                   PIC  X(10).                             
