000100***************************************************************** 00010000
000101* SVRD011                                                       * 00010100
000102* THIS COPYBOOK IS THE LAYOUT FOR THE TXN EXTRACT FILE TO BE    * 00010200
000103* USED FOR STORED VALUE OFFLINE   LRECL=17                      * 00010301
000104***************************************************************** 00010400
000105 01  SV011-RECORD.                                                00010500
000106     05 SV011-CRD-NBR                PIC  S9(12)       COMP-3.    00010600
000107     05 SV011-TRN-VOID-IND           PIC   X(01).                 00010701
000109     05 SV011-STR-NBR                PIC  S9(04)       COMP.      00010900
000110     05 SV011-APP-AUTH-AMT           PIC  S9(07)V9(02) COMP-3.    00011001
000120     05 SV011-ST-CDE                 PIC   X(02).                 00012001
