000100******************************************************************00010001
000200*  KOHL'S MERCHANDISE CARD DAILY FILE EXTRACT RECORD LAYOUT FROM *00020001
000300*  THE SVT_KOHLS_CRD_TXN TABLE.                                  *00030001
000400* LRECL = 110                                                    *00040010
000500******************************************************************00050001
000600 01  SV071-KMCACT-EXTRACT-RECORD.                                 00060001
001000     05  SV071-CRD-NBR            PIC 9(12).                      00100014
001100     05  SV071-POS-DTE            PIC X(10).                      00110001
001500     05  SV071-APP-AUTH-AMT       PIC S9(9)V99 COMP-3.            00150003
001800     05  SV071-TRN-RVRSL-CDE      PIC 9(01).                      00180003
002000     05  SV071-ACTVY-STAT-CDE     PIC 9(01).                      00200003
002200     05  SV071-SELR-NM            PIC X(23).                      00220015
002300     05  SV071-UPC-NBR            PIC 9(15).                      00230015
002400     05  SV071-POS-REF-NO         PIC 9(12).                      00240016
002500     05  SV071-TRN-AUTH-TMST      PIC X(26).                      00250016
002600     05  SV071-TRANS-ORDER        PIC 9(02).                      00260016
002700     05  FILLER                   PIC X(02).                      00270016
002800                                                                  00280016
