000100***************************************************************** 00010001
000101* THIS COPYBOOK IS THE LAYOUT FOR THE EXTRACT FILE TO BE USED   * 00010102
000102* IN PROGRAM SVKRP024 TOTALS                 LRECL=312          * 00010204
000103***************************************************************** 00010302
000104 01  SV043-RECORD.                                                00010402
000105     05 SV043-TOT-VER-ISSUE-G        PIC  S9(09)V99   COMP-3.     00010502
000106     05 SV043-TOT-AUTH-ISSUE-G       PIC  S9(09)V99   COMP-3.     00010602
000107     05 SV043-TOT-COMP-ISSUE-G       PIC  S9(09)V99   COMP-3.     00010702
000108     05 SV043-TOT-VER-TND-G          PIC  S9(09)V99   COMP-3.     00010802
000109     05 SV043-TOT-AUTH-TND-G         PIC  S9(09)V99   COMP-3.     00010902
000110     05 SV043-TOT-COMP-TND-G         PIC  S9(09)V99   COMP-3.     00011002
000120     05 SV043-ECOMM-DOL-ISST-G       PIC  S9(09)V99   COMP-3.     00012002
000121     05 SV043-ECOMM-CNT-ISST-G       PIC  S9(07)      COMP-3.     00012103
000122     05 SV043-ECOMM-DOL-ISSVT-G      PIC  S9(09)V99   COMP-3.     00012202
000123     05 SV043-ECOMM-CNT-ISSVT-G      PIC  S9(07)      COMP-3.     00012303
000124     05 SV043-ECOMM-DOL-TNDT-G       PIC  S9(09)V99   COMP-3.     00012402
000125     05 SV043-ECOMM-CNT-TNDT-G       PIC  S9(07)      COMP-3.     00012503
000126     05 SV043-ECOMM-DOL-TNDVT-G      PIC  S9(09)V99   COMP-3.     00012602
000127     05 SV043-ECOMM-CNT-TNDVT-G      PIC  S9(07)      COMP-3.     00012703
000128     05 SV043-ECOMM-DOL-ISSNT-G      PIC  S9(09)V99   COMP-3.     00012802
000129     05 SV043-ECOMM-CNT-ISSNT-G      PIC  S9(07)      COMP-3.     00012903
000130     05 SV043-ECOMM-DOL-ISSVNT-G     PIC  S9(09)V99   COMP-3.     00013002
000131     05 SV043-ECOMM-CNT-ISSVNT-G     PIC  S9(07)      COMP-3.     00013103
000132     05 SV043-ECOMM-DOL-TNDNT-G      PIC  S9(09)V99   COMP-3.     00013202
000133     05 SV043-ECOMM-CNT-TNDNT-G      PIC  S9(07)      COMP-3.     00013303
000134     05 SV043-ECOMM-DOL-TNDVNT-G     PIC  S9(09)V99   COMP-3.     00013402
000135     05 SV043-ECOMM-CNT-TNDVNT-G     PIC  S9(07)      COMP-3.     00013503
000136     05 SV043-ECOMM-DOL-ISSNTP-G     PIC  S9(09)V99   COMP-3.     00013602
000137     05 SV043-ECOMM-CNT-ISSNTP-G     PIC  S9(07)      COMP-3.     00013703
000138     05 SV043-ECOMM-DOL-ISSVNTP-G    PIC  S9(09)V99   COMP-3.     00013802
000139     05 SV043-ECOMM-CNT-ISSVNTP-G    PIC  S9(07)      COMP-3.     00013903
000140     05 SV043-ECOMM-DOL-TNDNTP-G     PIC  S9(09)V99   COMP-3.     00014002
000141     05 SV043-ECOMM-CNT-TNDNTP-G     PIC  S9(07)      COMP-3.     00014103
000142     05 SV043-ECOMM-DOL-TNDVNTP-G    PIC  S9(09)V99   COMP-3.     00014202
000143     05 SV043-ECOMM-CNT-TNDVNTP-G    PIC  S9(07)      COMP-3.     00014303
000144     05 SV043-TOT-VER-ISSUE-K        PIC  S9(09)V99   COMP-3.     00014402
000145     05 SV043-TOT-AUTH-ISSUE-K       PIC  S9(09)V99   COMP-3.     00014502
000146     05 SV043-TOT-COMP-ISSUE-K       PIC  S9(09)V99   COMP-3.     00014602
000147     05 SV043-TOT-VER-TND-K          PIC  S9(09)V99   COMP-3.     00014702
000148     05 SV043-TOT-AUTH-TND-K         PIC  S9(09)V99   COMP-3.     00014802
000149     05 SV043-TOT-COMP-TND-K         PIC  S9(09)V99   COMP-3.     00014902
000150     05 SV043-ECOMM-DOL-ISST-K       PIC  S9(09)V99   COMP-3.     00015002
000160     05 SV043-ECOMM-CNT-ISST-K       PIC  S9(07)      COMP-3.     00016003
000170     05 SV043-ECOMM-DOL-ISSVT-K      PIC  S9(09)V99   COMP-3.     00017002
000180     05 SV043-ECOMM-CNT-ISSVT-K      PIC  S9(07)      COMP-3.     00018003
000190     05 SV043-ECOMM-DOL-TNDT-K       PIC  S9(09)V99   COMP-3.     00019002
000200     05 SV043-ECOMM-CNT-TNDT-K       PIC  S9(07)      COMP-3.     00020003
000300     05 SV043-ECOMM-DOL-TNDVT-K      PIC  S9(09)V99   COMP-3.     00030002
000400     05 SV043-ECOMM-CNT-TNDVT-K      PIC  S9(07)      COMP-3.     00040003
000500     05 SV043-ECOMM-DOL-ISSNT-K      PIC  S9(09)V99   COMP-3.     00050002
000510     05 SV043-ECOMM-CNT-ISSNT-K      PIC  S9(07)      COMP-3.     00051003
000520     05 SV043-ECOMM-DOL-ISSVNT-K     PIC  S9(09)V99   COMP-3.     00052002
000530     05 SV043-ECOMM-CNT-ISSVNT-K     PIC  S9(07)      COMP-3.     00053003
000540     05 SV043-ECOMM-DOL-TNDNT-K      PIC  S9(09)V99   COMP-3.     00054002
000550     05 SV043-ECOMM-CNT-TNDNT-K      PIC  S9(07)      COMP-3.     00055003
000560     05 SV043-ECOMM-DOL-TNDVNT-K     PIC  S9(09)V99   COMP-3.     00056002
000570     05 SV043-ECOMM-CNT-TNDVNT-K     PIC  S9(07)      COMP-3.     00057003
000580     05 SV043-ECOMM-DOL-ISSNTP-K     PIC  S9(09)V99   COMP-3.     00058002
000590     05 SV043-ECOMM-CNT-ISSNTP-K     PIC  S9(07)      COMP-3.     00059003
000591     05 SV043-ECOMM-DOL-ISSVNTP-K    PIC  S9(09)V99   COMP-3.     00059102
000592     05 SV043-ECOMM-CNT-ISSVNTP-K    PIC  S9(07)      COMP-3.     00059203
000593     05 SV043-ECOMM-DOL-TNDNTP-K     PIC  S9(09)V99   COMP-3.     00059302
000594     05 SV043-ECOMM-CNT-TNDNTP-K     PIC  S9(07)      COMP-3.     00059403
000595     05 SV043-ECOMM-DOL-TNDVNTP-K    PIC  S9(09)V99   COMP-3.     00059502
000596     05 SV043-ECOMM-CNT-TNDVNTP-K    PIC  S9(07)      COMP-3.     00059603
