000100******************************************************************00010000
000200*  KOHL'S XPEDX GIFT CARD DAILY FILE EXTRACT RECORD LAYOUT FROM  *00020000
000300*  THE SVT_KOHLS_CRD_TXN AND SVT_CRD_STK_DNMNTN TABLES.          *00030000
000400* LRECL = 37                                                     *00040001
000500******************************************************************00050000
000600 01  SV066-XPDEX-EXTRACT-RECORD.                                  00060001
001000     05  SV066-KOHLS              PIC  X(05).                     00100001
001001     05  SV066-STR-NBR            PIC  9(04).                     00100101
001002     05  SV066-COMMA1             PIC  X(01).                     00100201
001004     05  SV066-UPC-NBR            PIC  9(11).                     00100401
001005     05  SV066-COMMA2             PIC  X(01).                     00100501
001006     05  SV066-LOCALE             PIC  X(05).                     00100601
001007     05  SV066-COMMA3             PIC  X(01).                     00100701
001008     05  SV066-STORE-TOTAL        PIC  9(06).                     00100801
001009     05  SV066-COMMA4             PIC  X(01).                     00100901
001010     05  SV066-UNITOFMEASURE      PIC  X(02).                     00101001
