000100******************************************************************        
000200* SVRD060 - RECORD LAYOUT FOR OUTPUT STORED VALUE OFF-LINE FILE           
000300*         - VERSION FOR SQL SERVER --- LRECL=41 ---                       
000400******************************************************************        
000500  01  SV060-CARD-RCD.                                                     
000600      05  SV060-METRO-AREA         PIC  X(04)  VALUE SPACES.              
000700      05  SV060-EXC-STORE          PIC  X(04)  VALUE SPACES.              
000800      05  SV060-FUL-CHG            PIC  X(03)  VALUE SPACES.              
000900      05  SV060-SEND-RCD.                                                 
001000          10  SV060-FIRST-PIPE     PIC  X(01).                            
001100          10  SV060-CONVERT-VAR-REC.                                      
001200              15  SV060-CONVERT-FILE-VAR                                  
001300                                   PIC  X(01)  VALUE SPACES               
001400                                    OCCURS 29 TIMES                       
001500                                    INDEXED BY                            
001600                                    SV060-CONVERT-LENGTH.                 
001700*                                                                         
001800 01  SV060-HOLD-FIELDS.                                                   
001900     05  SV060-ACTION-CODE         PIC  X(01)  VALUE SPACE.               
002000         88  SV060-ACTION-ADD                  VALUE 'A'.                 
002100         88  SV060-ACTION-UPDATE               VALUE 'U'.                 
002200         88  SV060-ACTION-DELETE               VALUE 'D'.                 
002300     05  SV060-SVC-NBR             PIC  9(12)  VALUE ZEROES.              
002400     05  SV060-SVC-TYP-CDE         PIC  9(01)  VALUE ZERO.                
002500     05  SV060-SVC-SPCTY-TYP-CDE   PIC  9(01)  VALUE ZERO.                
002600     05  SV060-SVC-BAL-AMT         PIC  9(6).99 VALUE ZEROES.             
002700***************************  END OF COPYBOOK  ********************        
