000100*----------------------------------------------------------------*      93
000200*                         SVWS008                                *      7 
000300*                                                                *      07
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *      7 
000500*   MAINTENANCE PROGRAMS TO PASS DATA WITHIN THE STORED VALUE    *      7 
000600*   SYSTEM.                                                      *      7 
000700*                                                                *      7 
000800*----------------------------------------------------------------*      7 
000900                                                                        7 
000910 10  SV008-INTER-APPL-COMMAREA REDEFINES                                  
000920     INTER-APPL-COMM-AREA.                                                
000930     15  FILLER                         PIC X(01).                        
000940     15  SV008-NUMBER-OF-SELECTED-ITEMS PIC S9(09)                        
000950                                            COMP-3.                       
000960     15  SV008-NUMBER-OF-TS-ITEMS       PIC S9(05)                        
000970                                            COMP-3.                       
000980     15  SV008-SEL-QUEUE-NAME           PIC X(8).                         
000990     15  FILLER                         PIC X(183).                       
000994                                                                          
