000100*----------------------------------------------------------------*00010000
000200*                         SVWS009                                *00020001
000300*                                                                *00030000
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *00040000
000500*   MAINTENANCE PROGRAMS TO PASS THE MESSAGE NUMBER.             *00050000
000600*                                                                *00060000
000700*----------------------------------------------------------------*00070000
000800                                                                  00080000
000900 01  SV009-SEL-REC.                                               00090003
001000       05  SV009-SELECTED-ITEMS             PIC S9(05)  COMP-3    00100001
001100                                                      VALUE ZERO. 00110001
001200       05  SV009-MAX-ITEMS                  PIC S9(04)  COMP-3    00120008
001210                                                      VALUE +15.  00121008
001300       05  SV009-SELECTED-ITEM-ARRAY.                             00130001
001400           10  FILLER                       OCCURS 15 TIMES       00140001
001500                                            INDEXED BY SV009-IDX. 00150001
001600               15  SV009-ITEM               PIC S9(09)  COMP-3.   00160001
001700               15  SV009-ACTION-SW          PIC  X(01).           00170001
001800                   88  SV009-INQ                       VALUE 'I'. 00180001
001900                   88  SV009-UPD                       VALUE 'U'. 00190001
002000                   88  SV009-DEL                       VALUE 'D'. 00200001
002100                   88  SV009-ERR                       VALUE 'E'. 00210001
002200               15  SV009-KEY-DATA.                                00220001
002300                   20  SV009-CRD-TYPE-CDE   PIC S9(1)V COMP-3.    00230015
002500                   20  SV009-STK-TYP-ID     PIC  X(08).           00250001
002700                   20  SV009-PRE-DNNTD-AMT  PIC  X(07).           00270012
002701                   20  SV009-PRE-DNNTD-AMT-9 REDEFINES            00270110
002702                       SV009-PRE-DNNTD-AMT  PIC  9(05)V99.        00270213
002720                   20  SV009-COMMENT                 PIC  X(30).  00272009
005500                                                                  00550009
