000100******************************************************************        
000200*  SVWS007 - WORKING STORAGE FOR CONVERSION OF CARD NUMBER       *        
000300******************************************************************        
000400 01  SV007-MISC-FIELDS.                                                   
000500     05 SV007-LEADING-0-CNT          PIC S9(03) VALUE 0   COMP-3.         
000600     05 SV007-MAX-CARD-NBR-LENGTH    PIC S9(03) VALUE +30 COMP-3.         
000700     05 SV007-CARD-NUMBER-LENGTH     PIC S9(3)  VALUE 0   COMP-3.         
000800     05 SV007-CARD-NUMBER-IN-LENGTH  PIC S9(3)  VALUE 0   COMP-3.         
000900     05 SV007-CARD-NUMBER-DIS-LENGTH PIC S9(3)  VALUE 30  COMP-3.         
001000     05 SV007-CARD-COL-TO            PIC S9(3)  VALUE 0   COMP-3.         
           05 SV007-PRE-DNNTD-CRD-AMT      PIC S9(07)V99        COMP-3.         
           05 SV007-CRD-NBR                PIC S9(12)V VALUE 0  COMP-3.         
           05 SV007-DENOMINATION-PREFIXES.                                      
              07  SV007-NON-DNNTD-PREFIX   PIC  9(02)  VALUE 20.                
              07  SV007-PRE-DNNTD-PREFIX   PIC  9(02)  VALUE 21.                
              07  SV007-NON-DNNTD-IND      PIC S9(01)  VALUE +0 COMP-3.         
              07  SV007-PRE-DNNTD-IND      PIC S9(01)  VALUE +1 COMP-3.         
001100     05 SV007-SAFEWAY-BIN            PIC X(6)   VALUE '111021'.           
001200     05 SV007-FORMAT-FUNCTION            PIC X      VALUE 'I'.            
001300       88 SV007-FORMAT-IN                           VALUE 'I'.            
001400       88 SV007-FORMAT-DISPLAY                      VALUE 'D'.            
001500       88 SV007-FORMAT-BOTH                         VALUE 'B'.            
001600     05 SV007-FORMAT-ERROR-SW            PIC X      VALUE "N".            
001700       88 SV007-FORMAT-ERROR                        VALUE "Y".            
001800       88 SV007-NOT-FORMAT-ERROR                    VALUE "N".            
           05 SV007-DB2-ERROR-SW               PIC  X(01) VALUE  'N'.           
              88  SV007-DB2-ERROR                         VALUE  'Y'.           
              88  SV007-NO-DB2-ERROR                      VALUE  'N'.           
002000     05 SV007-CARD-JUSTIFIED             PIC X(30).                       
002100     05 SV007-CARD-JUST-R         REDEFINES SV007-CARD-JUSTIFIED.         
002200        07 SV007-CARD-JUST-UPC           PIC 9(11).                       
002300        07 SV007-CARD-19-JUST.                                            
002400          09 SV007-CARD-JUST-BIN         PIC 9(6).                        
002500          09 SV007-CARD-13-JUST.                                          
002600            11 SV007-CARD-TYPE-JUST      PIC X(1).                        
002700            11 FILLER                    PIC X(1).                        
002800            11 SV007-CARD-13-JUST-10     PIC X(10).                       
002900            11 FILLER                    PIC X.                           
003000          09 SV007-CARD-13-JUST-R REDEFINES SV007-CARD-13-JUST.           
003100            11 FILLER                    PIC X(1).                        
003200            11 SV007-CARD-12-JUST.                                        
003300              13 SV007-CARD-12-JUST2     PIC X(2).                        
003400              13 SV007-CARD-10-JUST      PIC X(10).                       
003500                                                                          
003600     05 SV007-CARD-NUMBER-IN             PIC X(30).                       
003700     05 SV007-CARD-NUMBER-IN9 REDEFINES SV007-CARD-NUMBER-IN              
003800                                         PIC 9(30).                       
004000     05 SV007-CARD-NUMBER.                                                
004100        07 SV007-UPC-NBR                 PIC 9(11)  VALUE 0.              
004200        07 SV007-BIN-NBR                 PIC 9(06)  VALUE 0.              
004300        07 SV007-CARD-IDX.                                                
004400          09 SV007-CARD-TYPE             PIC 9(01)  VALUE 0.              
004500          09 SV007-CARD-NBR              PIC 9(12)  VALUE 0.              
004600        07 SV007-CARD-ID   REDEFINES SV007-CARD-IDX                       
004700                                         PIC 9(13).                       
004800     05 SV007-CARD-NUMBER9 REDEFINES SV007-CARD-NUMBER                    
004900                                         PIC 9(30).                       
005000     05 SV007-CARD-OUT-R          REDEFINES SV007-CARD-NUMBER.            
005100        07 SV007-CARD-OUT-UPC            PIC 9(11).                       
005200        07 SV007-CARD-19-OUT.                                             
005300          09 SV007-CARD-OUT-BIN          PIC 9(6).                        
005400          09 SV007-CARD-13-OUT.                                           
005500            11 SV007-CARD-PREFIX-OUT.                                     
005500               13 SV007-CARD-TYPE-OUT    PIC X(1).                        
005600               13 FILLER                 PIC X(1).                        
005700            11 SV007-CARD-13-OUT-10.                                      
005700               13 SV007-CARD-13-OUT-10-9 PIC 9(10).                       
005800            11 SV007-CHECK-DIGIT-OUT PIC X.                               
005900          09 SV007-CARD-13-OUT-R  REDEFINES SV007-CARD-13-OUT.            
006000            11 FILLER                    PIC X(1).                        
006100            11 SV007-CARD-12-OUT.                                         
006200              13 SV007-CARD-12-OUT2      PIC X(2).                        
006300              13 SV007-CARD-10-OUT       PIC X(10).                       
006400                                                                          
006500* left justified as 10, 12, 19, or 30                                     
006600     05 SV007-CARD-NUMBER-DISPLAY.                                        
006600       07 SV007-CARD-NUMBER-DISPLAY9     PIC 9(30).                       
