      ******************************************************************        
      *  COPY MEMBER SVWS006.                                          *        
      *  STORED VALUE SYSTEM -                                         *        
      *                                                                *        
      *  DATA AREA USED BY PROGRAMS TO COMMUNICATE WITH THE STORED     *        
      *  VALUE APPROVAL OR FORCE COMPLIANCE NUMBER PROCEDURE SVPD006.  *        
      *                                                                *        
      ******************************************************************        
       01  SV006-KMC-APPROVAL-PARAMETERS.                                       
           05  SV006-KMC-ID                PIC S9(10)    COMP-3.                
           05  SV006-TENDER-AMT            PIC S9(07)V9(02)                     
                                                         COMP-3.                
           05  SV006-TERMINAL-NBR.                                              
               10  SV006-TERMINAL-DIGIT-1  PIC  9(01).                          
               10  SV006-TERMINAL-DIGIT-2  PIC  9(01).                          
               10  SV006-TERMINAL-DIGIT-3  PIC  9(01).                          
               10  SV006-TERMINAL-DIGIT-4  PIC  9(01).                          
           05  SV006-TRANSACTION-NBR.                                           
               10  SV006-TRANS-DIGIT-1     PIC  9(01).                          
               10  SV006-TRANS-DIGIT-2     PIC  9(01).                          
               10  SV006-TRANS-DIGIT-3     PIC  9(01).                          
               10  SV006-TRANS-DIGIT-4     PIC  9(01).                          
           05  SV006-KMC-APPROVAL-NBR      PIC  X(06).                          
                                                                                
       01  SV006-PROGRAM-VARIABLES.                                             
                                                                                
           05  SV006-PV-SUB            PIC  9(01)     VALUE ZERO.               
           05  SV006-PV-CHAR-SUB       PIC  9(02)     VALUE ZERO.               
           05  SV006-PV-BASE-NUMBER.                                            
               10  SV006-PV-BASE-FIRST-12 PIC 9(12)   VALUE ZERO.               
               10  SV006-PV-BASE-LAST-6.                                        
                   15  FILLER          PIC  9(05)     VALUE ZERO.               
                   15  SV006-PV-BASE-LAST-1 PIC 9(01) VALUE ZERO.               
                                                                                
           05  SV006-PV-HIGH-ORDER-TABLE.                                       
               10  SV006-PV-HIGH-ORDER-DIGIT PIC 9(01) OCCURS 6 TIMES           
                                                      VALUE ZERO.               
           05  SV006-PV-LOW-ORDER-TABLE.                                        
               10  SV006-PV-LOW-ORDER-DIGIT PIC 9(01) OCCURS 6 TIMES            
                                                      VALUE ZERO.               
           05  SV006-PV-ADD-POSITIONS-TABLE.                                    
               10  SV006-PV-ADD-POSITION PIC 9(02)    OCCURS 6 TIMES            
                                                      VALUE ZERO.               
           05  SV006-PV-OFFSET-TABLE.                                           
               10  SV006-PV-OFFSET     PIC  9(02)     OCCURS 6 TIMES            
                                                      VALUE ZERO.               
           05  SV006-PV-APPROVAL-NUMBER.                                        
               10  SV006-PV-APPROVAL-DIGIT PIC X(01)  OCCURS 6 TIMES            
                                                      VALUE SPACE.              
           05  SV006-PV-KMC-ID         PIC  9(11)     VALUE ZERO.               
           05  SV006-PV-KMC-ID-DIGITS REDEFINES SV006-PV-KMC-ID.                
               10  FILLER              PIC  9(01).                              
               10  SV006-PV-KMC-DIGIT-1 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-2 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-3 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-4 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-5 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-6 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-7 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-8 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-9 PIC 9(01).                              
               10  SV006-PV-KMC-DIGIT-10 PIC 9(01).                             
                                                                                
           05  SV006-PV-TENDER-AMT         PIC S9(07)V9(02).                    
           05  SV006-PV-TENDER-DIGITS REDEFINES SV006-PV-TENDER-AMT.            
               10  FILLER                  PIC  9(03).                          
               10  SV006-PV-TEND-DIGIT-1   PIC  9(01).                          
               10  SV006-PV-TEND-DIGIT-2   PIC  9(01).                          
               10  SV006-PV-TEND-DIGIT-3   PIC  9(01).                          
               10  SV006-PV-TEND-DIGIT-4   PIC  9(01).                          
               10  SV006-PV-TEND-DIGIT-5   PIC  9(01).                          
               10  SV006-PV-TEND-DIGIT-6   PIC  9(01).                          
       EJECT                                                                    
       01  SV006-PROGRAM-CONSTANTS.                                             
           05  SV006-PC-LENGTH-OF-TABLES    PIC 9(01) VALUE 6.                  
           05  SV006-PC-NUMBER-OF-REL-CHARS PIC 9(02) VALUE 32.                 
           05  SV006-PC-RELATIVE-CHAR-VALUES.                                   
               10  FILLER              PIC X(01)      VALUE 'A'.                
               10  FILLER              PIC X(01)      VALUE 'B'.                
               10  FILLER              PIC X(01)      VALUE 'C'.                
               10  FILLER              PIC X(01)      VALUE 'D'.                
               10  FILLER              PIC X(01)      VALUE 'E'.                
               10  FILLER              PIC X(01)      VALUE 'F'.                
               10  FILLER              PIC X(01)      VALUE 'G'.                
               10  FILLER              PIC X(01)      VALUE 'H'.                
               10  FILLER              PIC X(01)      VALUE 'I'.                
               10  FILLER              PIC X(01)      VALUE 'J'.                
               10  FILLER              PIC X(01)      VALUE 'K'.                
               10  FILLER              PIC X(01)      VALUE 'L'.                
               10  FILLER              PIC X(01)      VALUE 'M'.                
               10  FILLER              PIC X(01)      VALUE 'N'.                
               10  FILLER              PIC X(01)      VALUE 'P'.                
               10  FILLER              PIC X(01)      VALUE 'Q'.                
               10  FILLER              PIC X(01)      VALUE 'R'.                
               10  FILLER              PIC X(01)      VALUE 'S'.                
               10  FILLER              PIC X(01)      VALUE 'T'.                
               10  FILLER              PIC X(01)      VALUE 'W'.                
               10  FILLER              PIC X(01)      VALUE 'X'.                
               10  FILLER              PIC X(01)      VALUE 'Y'.                
               10  FILLER              PIC X(01)      VALUE 'Z'.                
               10  FILLER              PIC X(01)      VALUE '1'.                
               10  FILLER              PIC X(01)      VALUE '2'.                
               10  FILLER              PIC X(01)      VALUE '3'.                
               10  FILLER              PIC X(01)      VALUE '4'.                
               10  FILLER              PIC X(01)      VALUE '5'.                
               10  FILLER              PIC X(01)      VALUE '6'.                
               10  FILLER              PIC X(01)      VALUE '7'.                
               10  FILLER              PIC X(01)      VALUE '8'.                
               10  FILLER              PIC X(01)      VALUE '9'.                
                                                                                
           05  SV006-PC-RELATIVE-TABLE REDEFINES                                
               SV006-PC-RELATIVE-CHAR-VALUES.                                   
                                                                                
               10 SV006-PC-RELATIVE-CHARACTER PIC X(01) OCCURS 32 TIMES.        
                                                                                
       EJECT                                                                    
       01  SV006-PROGRAM-SWITCHES.                                              
           05  SV006-LCK-ERROR-SW           PIC X(01) VALUE 'N'.                
               88  SV006-PS-LCK-ERROR                 VALUE 'Y'.                
               88  SV006-PS-NO-LCK-ERROR              VALUE 'N'.                
