000100****************************************************************  00010000
000200* SVWS004                                                      *  00020000
000300* STORED VALUE CARD CONSTANTS                                  *  00030000
000400*     THIS COPYLIB CONTAINS ALL THE STORED VALUE CARD          *  00040000
000500*     CONSTANTS.                                               *  00050000
000600****************************************************************  00060000
000700* 09/27/2001 - BARB ERTL                                       *  00070000
000800*              COPIED FROM RDWS010                             *  00080000
000900****************************************************************  00090000
P5211 * 05/30/2013 - COGNIZANT                                       *  00100000
P5211 *              ADDED NEW PRODUCER CODE 'V' FOR VIRTUAL GIFT    *  00110000
P5211 *              CARDS INTO SV004-CARD-PRODUCER-CODE GROUP       *  00120000
P5211 *              VARIABLE                                        *  00130000
P5211 ****************************************************************  00140000
P5266 * 07/29/2013 - COGNIZANT                                       *  00150000
P5266 *              NEW VENDOR ADDED BY REPLACING THE EXISTING      *  00160000
P5266 *              VENDOR. I.E, REPLACED 'AB TEUTEBERG' TO         *  00170000
P5266 *              'HARVARD'.                                      *  00180000
P5266 ****************************************************************  00190000
8661H * 12/08/2015 - ACCENTURE                                       *  00200000
8661H *              MODIFIED THE COPYBOOK TO REPLACE PCS WITH       *  00210000
8661H *              BLACKHAWK AND IPS WITH INCOMM ON GIFT CARD      *  00220000
8661H *              PRINTER SCREEN.                                 *  00230000
8661H ****************************************************************  00240000
001000* 05/17/2016 - ACCENTURE                                       *  00250000
001001* CHANGE#    - CHG0141575                                         00260000
001001*              ADDED ELEMENT 5 AND 6 FOR FILAGC, FILAKMC       *  00270000
001002*              CHANGED SV004-SPECIALTY-OCC OCCURS FROM 3 TO 6  *  00280000
001002*              CHANGED SV004-SPECIALTY-MAX-OCC VALUE TO 6      *  00290000
001004****************************************************************  00300000
OAKMC1* 06/22/2016 - JIM HUNTER                                      *  00310000
OAKMC1* CHANGE#    - CHG0145393                                         00320000
OAKMC1*              CHANGED ELEMENT 5 FROM FILAGC TO OAKMC FOR      *  00330000
OAKMC1*              OFF-AISLE KMC CARDS.                            *  00340000
OAKMC1****************************************************************  00350000
WR7057* 10/04/2017 - BARB SCHULTZ                                    *  00351000
WR7057* CHANGE#    - CHG0180846                                      *  00352000
WR7057*              CHANGED SAFEWAY TO VALID AND CPI TO ABCORP.     *  00353000
WR7057****************************************************************  00354000
092821* 09/17/2021 - DAN PAYNTER                                     *  00354100
092821* CHANGE#    - CHG0261461                                         00354200
092821*              ADDED ELEMENTS TO KMC SPECIALTY TABLE FOR       *  00354300
092821*              VIRTUAL KMC TYPES (KMCVIR AND KMCVRINT)         *  00354400
092821****************************************************************  00354500
111023* 11/10/2023 - DAN PAYNTER                                     *  00354601
111023* CHANGE#    - CHG0297091                                         00354701
111023*              REPLACE HARVARD WITH PLI CARD PRINT VENDOR      *  00354801
111023****************************************************************  00354901
001000*  ALL CARDS BELOW THE FOLLOWING CARD NUMBER ARE TEST OR TRAINING 00355000
001100*  CARD NUMBERS.                                                  00356000
001200 01  SV004-KMRC-CRD-NBR-START   PIC  9(10)   VALUE 1000000404.    00357000
001300 01  SV004-KMRC-CRD-NBR-END     PIC  9(10)   VALUE 4999999999.    00358000
001400 01  SV004-GIFT-CRD-NBR-START   PIC  9(10)   VALUE 5000000009.    00359000
001500 01  SV004-GIFT-CRD-NBR-END     PIC  9(10)   VALUE 9999999999.    00360000
001600 01  SV004-INITIAL-KMRC-CARD    PIC  9(09)   VALUE 100000040.     00370000
001700 01  SV004-INITIAL-GIFT-CARD    PIC  9(09)   VALUE 500000000.     00380000
001800                                                                  00390000
001900 01  SV004-DEFAULT-DATE          PIC  X(10)  VALUE '9999-09-09'.  00400000
002000 01  SV004-DEFAULT-TIME          PIC  X(08)  VALUE '09.09.09'.    00410000
002100 01  SV004-DEFAULT-TIMESTAMP     PIC  X(26)  VALUE                00420000
002200                                 '9999-09-09-09.09.09.000000'.    00430000
002300 01  SV004-SAFEWAY-LOCATION      PIC S9(04)  VALUE +918 COMP.     00440000
002400 01  SV004-CORPORATE-LOCATION    PIC S9(04)  VALUE +90  COMP.     00450000
002500 01  SV004-HALLMARK-LOCATION     PIC S9(04)  VALUE +919 COMP.     00460000
002500 01  SV004-INCOMM-LOCATION       PIC S9(04)  VALUE +676 COMP.     00470000
002600                                                                  00480000
002700 01  SV004-CARD-STATUS-TYPE.                                      00490000
002800     05  SV004-CRD-STAT-TYP-CORP                                  00500000
002900                                 PIC  X(02)  VALUE 'HQ'.          00510000
003000     05  SV004-PRINT-CRD-STAT-CORP-DESC                           00520000
003100                                 PIC  X(10)  VALUE 'CORP RCVD '.  00530000
003200     05  SV004-CRD-STAT-TYP-AVAILABLE                             00540000
003300                                 PIC  X(02)  VALUE 'AV'.          00550000
003400     05  SV004-AVAIL-CRD-STAT-SHT-DESC                            00560000
003500                                 PIC  X(10)  VALUE 'AVAILABLE '.  00570000
003600     05  SV004-CRD-STAT-TYP-CANCELLED                             00580000
003700                                 PIC  X(02)  VALUE 'CA'.          00590000
003800     05  SV004-CANCL-CRD-STAT-SHT-DESC                            00600000
003900                                 PIC  X(10)  VALUE 'CANCELLED '.  00610000
004000     05  SV004-CRD-STAT-TYP-LOST PIC  X(02)  VALUE 'LS'.          00620000
004100     05  SV004-LOST-CRD-STAT-SHT-DESC                             00630000
004200                                 PIC  X(10)  VALUE 'LOST      '.  00640000
004300     05  SV004-CRD-STAT-TYP-STOLEN                                00650000
004400                                 PIC  X(02)  VALUE 'ST'.          00660000
004500     05  SV004-STLN-CRD-STAT-SHT-DESC                             00670000
004600                                 PIC  X(10)  VALUE 'STOLEN    '.  00680000
004700     05  SV004-CRD-STAT-TYP-EXPIRED                               00690000
004800                                 PIC  X(02)  VALUE 'EX'.          00700000
004900     05  SV004-EXPR-CRD-STAT-SHT-DESC                             00710000
005000                                 PIC  X(10)  VALUE 'EXPIRED   '.  00720000
005100     05  SV004-CRD-STAT-TYP-INACTIVE                              00730000
005200                                 PIC  X(02)  VALUE 'IN'.          00740000
005300     05  SV004-INAC-CRD-STAT-SHT-DESC                             00750000
005400                                 PIC  X(10)  VALUE 'INACTIVE  '.  00760000
005500 01  SV004-CARD-STATUS-TABLE                                      00770000
005600     REDEFINES SV004-CARD-STATUS-TYPE.                            00780000
005700     05  SV004-CARD-ST-OCC       OCCURS 7 TIMES                   00790000
005800                                 INDEXED BY SV004-CARD-ST-IDX.    00800000
005900         10  SV004-CARD-ST-CD    PIC  X(02).                      00810000
006000         10  SV004-CARD-ST-SDESC PIC  X(10).                      00820000
006100 01  SV004-CARD-ST-MAX-OCC       PIC  9(02)  VALUE 7.             00830000
006200                                                                  00840000
006300 01  SV004-CARD-TYPE.                                             00850000
006400     05  SV004-KMRC-CRD-TYP      PIC S9(01)  VALUE 1              00860000
006500                                             COMP-3.              00870000
006600     05  SV004-KMRC-CRD-DESC     PIC  X(30)  VALUE                00880000
006700         'KMRC                          '.                        00890000
006800     05  SV004-KMRC-CRD-SHT-DESC PIC  X(10)  VALUE                00900000
006900         'KMRC      '.                                            00910000
007000     05  SV004-GIFT-CRD-TYP      PIC S9(01)  VALUE 2              00920000
007100                                             COMP-3.              00930000
007200     05  SV004-GIFT-CRD-DESC     PIC  X(30)  VALUE                00940000
007300         'GIFT CARD                     '.                        00950000
007400     05  SV004-GIFT-CRD-SHT-DESC PIC  X(10)  VALUE                00960000
007500         'GIFT CARD '.                                            00970000
007600                                                                  00980000
007700 01  SV004-CARD-TYPE-TABLE                                        00990000
007800     REDEFINES SV004-CARD-TYPE.                                   01000000
007900     05  SV004-CARD-TYP-OCC      OCCURS 2 TIMES                   01010000
008000                                 INDEXED BY SV004-CARD-TYP-IDX.   01020000
008100         10  SV004-CARD-TYP-CD   PIC S9(01) COMP-3.               01030000
008200         10  SV004-CARD-TYP-DESC PIC  X(30).                      01040000
008300         10  SV004-CARD-TYP-SHT-DESC                              01050000
008400                                 PIC  X(10).                      01060000
008500 01  SV004-CARD-TYP-MAX-OCC      PIC  9(02)  VALUE 2.             01070000
008600                                                                  01080000
008700 01  SV004-SPECIALTY.                                             01090000
008800*---* ELEMENT 1                                                   01100000
008900     05  SV004-NO-SPECIALTY      PIC S9(01)  VALUE 0              01110000
009000                                             COMP-3.              01120000
009100     05  SV004-NO-SPECIALTY-DESC PIC  X(30)  VALUE                01130000
009200         'NO SPECIALTY TYPE             '.                        01140000
009300     05  SV004-NO-SPECIALTY-SHT  PIC  X(10)  VALUE                01150000
009400         'NO SPECIAL'.                                            01160000
009500*---* ELEMENT 2                                                   01170000
009600     05  SV004-KCK-SPECIALTY     PIC S9(01)  VALUE 1              01180000
009700                                             COMP-3.              01190000
009800     05  SV004-KCK-SPECIAL-DESC  PIC  X(30)  VALUE                01200000
009900         'KOHLS CARES FOR KIDS          '.                        01210000
010000     05  SV004-KCK-SPECIAL-SHT   PIC  X(10)  VALUE                01220000
010100         'KCK       '.                                            01230000
010200*---* ELEMENT 3                                                   01240000
010300     05  SV004-VIRTUAL-SPECIALTY PIC S9(01)  VALUE 2              01250000
010400                                             COMP-3.              01260000
010500     05  SV004-VIRTUAL-DESC      PIC  X(30)  VALUE                01270000
010600         'VIRTUAL CARD                  '.                        01280000
010700     05  SV004-VIRTUAL-SPECIAL-SHT PIC  X(10) VALUE               01290000
010800         'VIRTUAL   '.                                            01300000
010900*---* ELEMENT 4                                                   01310000
011000     05  SV004-KMRC-SPECIALTY      PIC S9(01)  VALUE 3            01320000
011100                                             COMP-3.              01330000
011200     05  SV004-KMRC-DESC           PIC  X(30)  VALUE              01340000
011300         'KMRC CARD                     '.                        01350000
011400     05  SV004-KMRC-SPECIAL-SHT    PIC  X(10) VALUE               01360000
011500         'KMRC      '.                                            01370000
010900*---* ELEMENT 5                                                   01380000
OAKMC1     05  SV004-OA-KMC-SPECIALTY    PIC S9(01)  VALUE 4            01390000
011100                                             COMP-3.              01400000
OAKMC1     05  SV004-OA-KMC-DESC         PIC  X(30)  VALUE              01410000
OAKMC1         'OA KMC CARD                   '.                        01420000
OAKMC1     05  SV004-OA-KMC-SPECIAL-SHT  PIC  X(10) VALUE               01430000
OAKMC1         'OAKMC     '.                                            01440000
010900*---* ELEMENT 6                                                   01450000
011000     05  SV004-FILA-KMC-SPECIALTY PIC S9(01)  VALUE 5             01460000
011100                                             COMP-3.              01470000
011200     05  SV004-FILA-KMC-DESC       PIC  X(30)  VALUE              01480000
011300         'FILA KMC CARD                 '.                        01490000
011400     05  SV004-FILA-KMC-SPECIAL-SHT PIC  X(10) VALUE              01500000
011500         'FILAKMC   '.                                            01510000
092821*---* ELEMENT 7                                                   01511000
092821     05  SV004-VIRT-KMC-SPECIALTY PIC S9(01)  VALUE 6             01512000
092821                                             COMP-3.              01513000
092821     05  SV004-VIRT-KMC-DESC       PIC  X(30)  VALUE              01514000
092821         'KMC VIRTUAL                   '.                        01515000
092821     05  SV004-VIRT-KMC-SPECIAL-SHT PIC  X(10) VALUE              01516000
092821         'KMCVIR    '.                                            01517000
092821*---* ELEMENT 8                                                   01518000
092821     05  SV004-VINT-KMC-SPECIALTY PIC S9(01)  VALUE 7             01519000
092821                                             COMP-3.              01519100
092821     05  SV004-VINT-KMC-DESC       PIC  X(30)  VALUE              01519200
092821         'KMC VIRTUAL CORP/INT USE ONLY '.                        01519300
092821     05  SV004-VINT-KMC-SPECIAL-SHT PIC  X(10) VALUE              01519400
092821         'KMCVRINT  '.                                            01519500
011600 01  SV004-SPECIALTY-TABLE                                        01520000
011700     REDEFINES SV004-SPECIALTY.                                   01530000
092821     05  SV004-SPECIALTY-OCC     OCCURS 8 TIMES                   01540000
011900                                 INDEXED BY SV004-SPECIALTY-IDX.  01550000
012000         10  SV004-SPECIALTY-CD   PIC S9(01) COMP-3.              01560000
012100         10  SV004-SPECIALTY-DESC PIC  X(30).                     01570000
012200         10  SV004-SPECIALTY-SHT-DESC                             01580000
012300                                 PIC  X(10).                      01590000
092821 01  SV004-SPECIALTY-MAX-OCC     PIC  9(02)  VALUE 8.             01600000
012500                                                                  01610000
012600 01  SV004-ACTIVITY-TYPE.                                         01620000
012700     05  SV004-ISSUE-KMRC-ACT-TYP                                 01630000
012800                                 PIC  9(01)  VALUE 1.             01640000
012900     05  SV004-ISSUE-KMRC-ACT-TYP-N                               01650000
013000                                 PIC S9(01)  VALUE +1             01660000
013100                                             COMP-3.              01670000
013200     05  SV004-ISSUE-KMRC-LONG-DESC                               01680000
013300                                 PIC  X(30)  VALUE                01690000
013400         'KMRC ISSUANCE                 '.                        01700000
013500     05  SV004-ISSUE-KMRC-SHRT-DESC                               01710000
013600                                 PIC  X(07)  VALUE                01720000
013700         'ISU MRC'.                                               01730000
013800     05  SV004-ISSUE-GIFT-CRD-ACT-TYP                             01740000
013900                                 PIC  9(01)  VALUE 2.             01750000
014000     05  SV004-ISSUE-GIFT-CRD-ACT-TYP-N                           01760000
014100                                 PIC S9(01)  VALUE +2             01770000
014200                                             COMP-3.              01780000
014300     05  SV004-ISSUE-GIFT-CRD-LONG-DESC                           01790000
014400                                 PIC  X(30)  VALUE                01800000
014500         'GIFT CARD ISSUANCE            '.                        01810000
014600     05  SV004-ISSUE-GIFT-CRD-SHRT-DESC                           01820000
014700                                 PIC  X(07)  VALUE                01830000
014800         'ISU GC '.                                               01840000
014900     05  SV004-TENDER-ACT-TYP    PIC  9(01)  VALUE 3.             01850000
015000     05  SV004-TENDER-ACT-TYP-N  PIC S9(01)  VALUE +3             01860000
015100                                             COMP-3.              01870000
015200     05  SV004-TENDER-LONG-DESC  PIC  X(30)  VALUE                01880000
015300         'TENDER                        '.                        01890000
015400     05  SV004-TENDER-SHRT-DESC  PIC  X(07)  VALUE                01900000
015500         'TENDER '.                                               01910000
015600     05  SV004-SRV-FEE-ACT-TYP   PIC  9(01)  VALUE 4.             01920000
015700     05  SV004-SRV-FEE-ACT-TYP-N                                  01930000
015800                                 PIC S9(01)  VALUE +4             01940000
015900                                             COMP-3.              01950000
016000     05  SV004-SRV-FEE-LONG-DESC PIC  X(30)  VALUE                01960000
016100         'FEE                           '.                        01970000
016200     05  SV004-SRV-FEE-SHRT-DESC PIC  X(07)  VALUE                01980000
016300         'FEE    '.                                               01990000
016400     05  SV004-VA-REG-PAY-ACT-TYP                                 02000000
016500                                 PIC  9(01)  VALUE 5.             02010000
016600     05  SV004-VA-REG-PAY-ACT-TYP-N                               02020000
016700                                 PIC S9(01)  VALUE +5             02030000
016800                                             COMP-3.              02040000
016900     05  SV004-VA-REG-PAY-LONG-DESC                               02050000
017000                                 PIC  X(30)  VALUE                02060000
017100         'VALUE ADD REGISTER - PAYMENT  '.                        02070000
017200     05  SV004-VA-REG-PAY-SHRT-DESC                               02080000
017300                                 PIC  X(07)  VALUE                02090000
017400         'VA PAY '.                                               02100000
017500     05  SV004-VA-LP-ACT-TYP     PIC  9(01)  VALUE 6.             02110000
017600     05  SV004-VA-LP-ACT-TYP-N   PIC S9(01)  VALUE +6             02120000
017700                                             COMP-3.              02130000
017800     05  SV004-VA-LP-LONG-DESC   PIC  X(30)  VALUE                02140000
017900         'VALUE ADD LOSS PREVENTION     '.                        02150000
018000     05  SV004-VA-LP-SHRT-DESC                                    02160000
018100                                 PIC  X(07)  VALUE                02170000
018200         'VA LP  '.                                               02180000
018300 01  SV004-ACTIVITY-TYPE-TABLE                                    02190000
018400     REDEFINES SV004-ACTIVITY-TYPE.                               02200000
018500     05  SV004-ACT-TYP-OCC       OCCURS 6 TIMES                   02210000
018600                                 INDEXED BY SV004-ACT-TYP-IDX.    02220000
018700         10  SV004-ACT-TYP-CD    PIC  9(01).                      02230000
018800         10  SV004-ACT-TYP-CD-N  PIC S9(01)  COMP-3.              02240000
018900         10  SV004-ACT-TYP-LDESC PIC  X(30).                      02250000
019000         10  SV004-ACT-TYP-SDESC PIC  X(07).                      02260000
019100 01  SV004-ACT-TYP-MAX-OCC       PIC  9(02)  VALUE 6.             02270000
019200                                                                  02280000
019300 01  SV004-PC-CARD-TYPE-LENGTH.                                   02290000
019400     05  SV004-PC-GFTCRD-LGTH              PIC 9(02) VALUE 13.    02300000
019500     05  SV004-PC-KMRC-LGTH                PIC 9(02) VALUE 10.    02310000
019600     05  SV004-PC-SV-LGTH                  PIC 9(02) VALUE 12.    02320000
019700     05  SV004-PC-DEF-CRD-LGTH             PIC 9(02) VALUE 15.    02330000
019800     05  SV004-PC-SAFEWAY-CRD-LGTH         PIC 9(02) VALUE 19.    02340000
019800     05  SV004-PC-INCOMM-CRD-LGTH          PIC 9(02) VALUE 19.    02350000
019900     05  SV004-PC-30-DIGIT-LGTH            PIC 9(02) VALUE 30.    02360000
020000                                                                  02370000
020100 01  SV004-ACTIVITY-STATUS.                                       02380000
020200     05  SV004-STAT-AUTH-RECEIVED-CD                              02390000
020300                                 PIC S9(01)  COMP-3               02400000
020400                                             VALUE 1.             02410000
020500     05  SV004-STAT-AUTH-RECEIVED-DESC                            02420000
020600                                 PIC  X(14) VALUE                 02430000
020700         'AUTH RECVD    '.                                        02440000
020800     05  SV004-STAT-NO-AUTH-CD                                    02450000
020900                                 PIC S9(01)  COMP-3               02460000
021000                                             VALUE 2.             02470000
021100     05  SV004-STAT-NO-AUTH-DESC                                  02480000
021200                                 PIC  X(14) VALUE                 02490000
021300         'AUDIT/NO AUTH '.                                        02500000
021400     05  SV004-STAT-VERIFIED-CD                                   02510000
021500                                 PIC S9(01)  COMP-3               02520000
021600                                             VALUE 3.             02530000
021700     05  SV004-STAT-VERIFIED-DESC                                 02540000
021800                                 PIC  X(14)  VALUE                02550000
021900         'VERIFIED      '.                                        02560000
022000 01  SV004-ACTIVITY-STATUS-TABLE                                  02570000
022100     REDEFINES SV004-ACTIVITY-STATUS.                             02580000
022200     05  SV004-ACT-ST-OCC        OCCURS 3 TIMES                   02590000
022300                                 INDEXED BY SV004-ACT-ST-IDX.     02600000
022400         10  SV004-ACT-ST-CD     PIC S9(01)  COMP-3.              02610000
022500         10  SV004-ACT-ST-DESC   PIC  X(14).                      02620000
022600 01  SV004-ACT-ST-MAX-OCC        PIC  9(02)  VALUE 3.             02630000
022700                                                                  02640000
022800 01  SV004-AUTH-CODE.                                             02650000
022900     05  SV004-AUTH-APPROVE-CD   PIC  9(01)  VALUE 0.             02660000
023000     05  SV004-AUTH-APPROVE-DESC PIC  X(12)  VALUE                02670000
023100         'APPROVE     '.                                          02680000
023200     05  SV004-AUTH-HARD-DEC-CD  PIC  9(01)  VALUE 7.             02690000
023300     05  SV004-AUTH-HARD-DEC-DESC                                 02700000
023400                                 PIC  X(12)  VALUE                02710000
023500         'HARD DECLINE'.                                          02720000
023600     05  SV004-AUTH-REFERRAL-CD  PIC  9(01)  VALUE 8.             02730000
023700     05  SV004-AUTH-REFERRAL-DESC                                 02740000
023800                                 PIC  X(12)  VALUE                02750000
023900         'REFERRAL    '.                                          02760000
024000     05  SV004-AUTH-ABEND-CD     PIC  9(01)  VALUE 9.             02770000
024100     05  SV004-AUTH-ABEND-DESC   PIC  X(12)  VALUE                02780000
024200         'UNAVAILABLE '.                                          02790000
024300 01  SV004-AUTH-CODE-TABLE                                        02800000
024400     REDEFINES SV004-AUTH-CODE.                                   02810000
024500     05  SV004-AUTH-CD-OCC       OCCURS 4 TIMES                   02820000
024600                                 INDEXED BY SV004-AUTH-CD-IDX.    02830000
024700         10  SV004-AUTH-CD       PIC  9(01).                      02840000
024800         10  SV004-AUTH-CD-DESC  PIC  X(12).                      02850000
024900 01  SV004-AUTH-CD-MAX-OCC       PIC  9(02)  VALUE 4.             02860000
025000                                                                  02870000
025100 01  SV004-AUTO-MANUAL-IND.                                       02880000
025200     05  SV004-AUTO-IND          PIC  X(01)  VALUE 'A'.           02890000
025300     05  SV004-MANUAL-IND        PIC  X(01)  VALUE 'M'.           02900000
025400                                                                  02910000
025500 01  SV004-VOID-IND.                                              02920000
025600     05  SV004-NOT-VOID-TRANS    PIC  X(01)  VALUE 'N'.           02930000
025700     05  SV004-VOID-TRANS        PIC  X(01)  VALUE 'Y'.           02940000
025800     05  SV004-VOID-DISPLAY      PIC  X(01)  VALUE 'V'.           02950000
025900     05  SV004-NOT-VOID-DISPLAY  PIC  X(01)  VALUE SPACE.         02960000
026000     05  SV004-VOID-LONG-DESC    PIC  X(04)  VALUE 'VOID'.        02970000
026100     05  SV004-NOT-VOID-LONG-DESC                                 02980000
026200                                 PIC  X(04)  VALUE SPACES.        02990000
026300                                                                  03000000
026400 01  SV004-DUPLICATE-IND.                                         03010000
026500     05  SV004-DUPLICATE         PIC  X(01)  VALUE 'Y'.           03020000
026600                                                                  03030000
026700 01  SV004-REVERSAL-CDE.                                          03040000
026800     05  SV004-REV-CDE-NORMAL    PIC S9(01)  COMP-3               03050000
026900                                             VALUE 0.             03060000
027000     05  SV004-REV-CDE-REVERSAL  PIC S9(01)  COMP-3               03070000
027100                                             VALUE 1.             03080000
027200     05  SV004-REV-CDE-NORMAL-DISPLAY                             03090000
027300                                 PIC  X(01)  VALUE ' '.           03100000
027400     05  SV004-REV-CDE-REV-LONG-DESC                              03110000
027500                                 PIC  X(08)  VALUE 'REVERSAL'.    03120000
027600     05  SV004-REV-CDE-NORM-LONG-DESC                             03130000
027700                                 PIC  X(08)  VALUE SPACES.        03140000
027800                                                                  03150000
027900 01  SV004-CONTROL-VALUES.                                        03160000
028000     05  SV004-AUDIT-DATE-RANGE-DAYS                              03170000
028100                                 PIC  9(03)  VALUE 90.            03180000
028200*        (NUMBER OF DAYS INTO THE PAST THAT AUDIT CAN UPDATE      03190000
028300*         CARD ACTIVITY)                                          03200000
028400 01  SV004-CARD-STOCK-DESC-SHORT.                                 03210000
028500     05  SV004-STK-DESC-SHRT-GIFT-CRD                             03220000
028600                                 PIC  X(08)  VALUE 'GIFTCARD'.    03230000
028700     05  SV004-STK-DESC-SHRT-KMRC-CRD                             03240000
028800                                 PIC  X(08)  VALUE 'KMRC    '.    03250000
028900     05  SV004-STK-DESC-SHRT-GIFT-CERT                            03260000
029000                                 PIC  X(08)  VALUE 'GIFTCERT'.    03270000
029100 01  SV004-CARD-STOCK-DESC-LONG.                                  03280000
029200     05  SV004-STK-DESC-LONG-GIFT-CRD                             03290000
029300                                 PIC  X(25)  VALUE                03300000
029400         'GIFT CARD                '.                             03310000
029500     05  SV004-STK-DESC-LONG-KMRC-CRD                             03320000
029600                                 PIC  X(25)  VALUE                03330000
029700         'MERCHANDISE RETURN CREDIT'.                             03340000
029800 01  SV004-KMRC-TEN-DIGIT-CONV-DATE.                              03350000
029900     05  SV004-KMRC-CONV-DATE-ISO                                 03360000
030000                                 PIC  X(08)  VALUE '19970711'.    03370000
030100     05  SV004-KMRC-CONV-DATE-ISO-FMT                             03380000
030200                                 PIC  X(10)  VALUE                03390000
030300                                             '1997-07-11'.        03400000
030400 01  SV004-ISSUE-MNEMONIC        PIC  X(08)  VALUE 'RDUCRD  '.    03410000
030500 01  SV004-APVL-USR-ID-SYSTEM    PIC  X(08)  VALUE 'SYSTEM  '.    03420000
030600 01  SV004-APVL-USR-ID-SVKUP001  PIC  X(08)  VALUE 'SVKUP001'.    03430000
030700 01  SV004-APVL-USR-ID-PEPLSOFT  PIC  X(08)  VALUE 'PSFTFIRB'.    03440000
030800 01  SV004-APVL-USR-ID-SPACES    PIC  X(08)  VALUE  SPACES.       03450000
030900 01  SV004-DENOMINATION-PREFIXES.                                 03460000
031000     05  SV004-NON-DNNTD-PREFIX  PIC  9(02)  VALUE 20.            03470000
031100     05  SV004-PRE-DNNTD-PREFIX  PIC  9(02)  VALUE 21.            03480000
031200     05  SV004-NON-DNNTD-IND     PIC S9(01)  VALUE +0 COMP-3.     03490000
031300     05  SV004-PRE-DNNTD-IND     PIC S9(01)  VALUE +1 COMP-3.     03500000
031400                                                                  03510000
031500 01  SV004-KOHLS-CARES-FOR-KIDS  PIC  X(08)  VALUE 'KCK     '.    03520000
031500 01  SV004-KOHLS-VIRTUAL-KCK     PIC  X(08)  VALUE 'VGCKCK  '.    03530000
031600 01  SV004-VIRTUAL-CARD          PIC  X(08)  VALUE 'VIRTUAL '.    03540000
031700 01  SV004-KMRC-CARD             PIC  X(08)  VALUE 'KMRC    '.    03550000
OAKMC1 01  SV004-OA-KMC                PIC  X(08)  VALUE 'OAKMC   '.    03560000
031700 01  SV004-FILA-KMC              PIC  X(08)  VALUE 'FILAKMC '.    03570000
092821 01  SV004-VIR-KMC               PIC  X(08)  VALUE 'KMCVIR  '.    03571000
092821 01  SV004-VIR-INT-KMC           PIC  X(08)  VALUE 'KMCVRINT'.    03572000
031800 01  SV004-SAFEWAY-BIN           PIC  9(06)  VALUE 111021.        03580000
031900 01  SV004-KOHLS-IIN             PIC  9(06)  VALUE 639305.        03590000
032000 01  SV004-KMRC-CARD-UPC-NBR     PIC  9(12)  VALUE 400899920982.  03600000
032100                                                                  03610000
032200 01  SV004-CARD-INITIAL-DATE.                                     03620000
032300     05  SV004-CARD-INIT-DATE-ISO                                 03630000
032400                                 PIC  X(08)  VALUE '19960804'.    03640000
032500     05  SV004-CARD-INIT-DATE-ISO-FMT                             03650000
032600                                 PIC  X(10)  VALUE                03660000
032700                                             '1996-08-04'.        03670000
032800 01  SV004-SERVICE-FEE           PIC S9(07)V99  COMP-3            03680000
032900                                             VALUE -1.50.         03690000
033000 01  SV004-SRV-FEE-INACTIVE-PRD  PIC S9(04)     COMP-3            03700000
033100                                             VALUE +24.           03710000
033200 01  SV004-SERVICE-FEE-DATE.                                      03720000
033300     05  SV004-SRV-FEE-TMSTMP    PIC  X(26)  VALUE                03730000
033400                                 '9999-09-09-23.59.00.000000'.    03740000
033500 01  SV004-GIFT-CARD-DENOM-AMT.                                   03750000
033600     05  SV004-DENOM-0           PIC 9(04)V99 VALUE 0.00          03760000
033700                                              COMP-3.             03770000
033800     05  SV004-DENOM-0-IFILE     PIC X(20)    VALUE               03780000
033900         'BLANK.PCX           '.                                  03790000
034000     05  SV004-SAFEWAY-1-UPC-0   PIC 9(11)    VALUE ZERO.         03800000
034100     05  SV004-SAFEWAY-2-UPC-0   PIC 9(11)    VALUE ZERO.         03810000
034200     05  SV004-DENOM-5           PIC 9(04)V99 VALUE  5.00         03820000
034300                                              COMP-3.             03830000
034400     05  SV004-DENOM-5-FILE      PIC X(20)    VALUE               03840000
034500         'FIVEB1.PCX          '.                                  03850000
034600     05  SV004-SAFEWAY-1-UPC-5   PIC 9(11)    VALUE ZERO.         03860000
034700     05  SV004-SAFEWAY-2-UPC-5   PIC 9(11)    VALUE ZERO.         03870000
034800     05  SV004-DENOM-10          PIC 9(04)V99 VALUE 10.00         03880000
034900                                              COMP-3.             03890000
035000     05  SV004-DENOM-10-IFILE    PIC X(20)    VALUE               03900000
035100         'TENB1.PCX           '.                                  03910000
035200     05  SV004-SAFEWAY-1-UPC-10  PIC 9(11)    VALUE ZERO.         03920000
035300     05  SV004-SAFEWAY-2-UPC-10  PIC 9(11)    VALUE ZERO.         03930000
035400     05  SV004-DENOM-15          PIC 9(04)V99 VALUE 15.00         03940000
035500                                              COMP-3.             03950000
035600     05  SV004-DENOM-15-IFILE    PIC X(20)    VALUE               03960000
035700         'FIFTNB1.PCX         '.                                  03970000
035800     05  SV004-SAFEWAY-1-UPC-15  PIC 9(11)    VALUE ZERO.         03980000
035900     05  SV004-SAFEWAY-2-UPC-15  PIC 9(11)    VALUE ZERO.         03990000
036000     05  SV004-DENOM-20          PIC 9(04)V99 VALUE 20.00         04000000
036100                                              COMP-3.             04010000
036200     05  SV004-DENOM-20-IFILE    PIC X(20)    VALUE               04020000
036300         'TWENB1.PCX          '.                                  04030000
036400     05  SV004-SAFEWAY-1-UPC-20  PIC 9(11)    VALUE ZERO.         04040000
036500     05  SV004-SAFEWAY-2-UPC-20  PIC 9(11)    VALUE ZERO.         04050000
036600     05  SV004-DENOM-25          PIC 9(04)V99 VALUE 25.00         04060000
036700                                              COMP-3.             04070000
036800     05  SV004-DENOM-25-IFILE    PIC X(20)    VALUE               04080000
036900         'TWENFIVB1.PCX       '.                                  04090000
037000     05  SV004-SAFEWAY-1-UPC-25  PIC 9(11)    VALUE 7675002875.   04100000
037100     05  SV004-SAFEWAY-2-UPC-25  PIC 9(11)    VALUE 7675002878.   04110000
037110     05  SV004-DENOM-30          PIC 9(04)V99 VALUE 30.00         04120000
037120                                              COMP-3.             04130000
037130     05  SV004-DENOM-30-IFILE    PIC X(20)    VALUE               04140000
037140         'THIRTYB1.PCX        '.                                  04150000
037150     05  SV004-SAFEWAY-1-UPC-30  PIC 9(11)    VALUE 7675009864.   04160000
037160     05  SV004-SAFEWAY-2-UPC-30  PIC 9(11)    VALUE 7675009864.   04170000
037200     05  SV004-DENOM-45          PIC 9(04)V99 VALUE 45.00         04180000
037300                                              COMP-3.             04190000
037400     05  SV004-DENOM-45-IFILE    PIC X(20)    VALUE               04200000
037500         'FORTYFIV.PCX        '.                                  04210000
037600     05  SV004-SAFEWAY-1-UPC-45  PIC 9(11)    VALUE ZERO.         04220000
037700     05  SV004-SAFEWAY-2-UPC-45  PIC 9(11)    VALUE ZERO.         04230000
037800     05  SV004-DENOM-50          PIC 9(04)V99 VALUE 50.00         04240000
037900                                              COMP-3.             04250000
038000     05  SV004-DENOM-50-IFILE    PIC X(20)    VALUE               04260000
038100         'FIFTB1.PCX          '.                                  04270000
038200     05  SV004-SAFEWAY-1-UPC-50  PIC 9(11)    VALUE 7675002876.   04280000
038300     05  SV004-SAFEWAY-2-UPC-50  PIC 9(11)    VALUE 7675002879.   04290000
038400     05  SV004-DENOM-100         PIC 9(04)V99 VALUE 100.00        04300000
038500                                              COMP-3.             04310000
038600     05  SV004-DENOM-100-IFILE   PIC X(20)    VALUE               04320000
038700         'HUNDB1.PCX          '.                                  04330000
038800     05  SV004-SAFEWAY-1-UPC-100 PIC 9(11)    VALUE 7675002877.   04340000
038900     05  SV004-SAFEWAY-2-UPC-100 PIC 9(11)    VALUE 7675002880.   04350000
039000     05  SV004-DENOM-500         PIC 9(04)V99 VALUE 500.00        04360000
039100                                              COMP-3.             04370000
039200     05  SV004-DENOM-500-IFILE   PIC X(20)    VALUE               04380000
039300         'FIVHUNB1.PCX        '.                                  04390000
039400     05  SV004-SAFEWAY-1-UPC-500 PIC 9(11)    VALUE ZERO.         04400000
039500     05  SV004-SAFEWAY-2-UPC-500 PIC 9(11)    VALUE ZERO.         04410000
039600 01  SV004-GIFT-CARD-DENOM-TABLE                                  04420000
039700     REDEFINES SV004-GIFT-CARD-DENOM-AMT.                         04430000
039800     05  SV004-DENOM-AMT         OCCURS 11 TIMES                  04440000
039900                                 INDEXED BY SV004-DENOM-IDX.      04450000
040000         10  SV004-DENOM         PIC  9(04)V99 COMP-3.            04460000
040100         10  SV004-DENOM-IFILE   PIC  X(20).                      04470000
040200         10  SV004-SAFEWAY-1-UPC PIC  9(11).                      04480000
040300         10  SV004-SAFEWAY-2-UPC PIC  9(11).                      04490000
040400 01  SV004-DENOM-MAX-OCC         PIC  9(02)  VALUE 11.            04500000
040500                                                                  04510000
040600 01  SV004-CARD-PRODUCER-CODE.                                    04520000
040700     05  SV004-CARD-PRODUCER-KOHLS                                04530000
040800                                 PIC X(01)  VALUE 'K'.            04540000
040900     05  SV004-CARD-PRODUCER-KOHLS-LIT                            04550000
041000                                 PIC X(06)  VALUE 'KOHLS '.       04560000
8661H      05  SV004-CARD-PRODUCER-INCOMM                               04570000
8661H                                  PIC X(01)  VALUE 'I'.            04580000
8661H      05  SV004-CARD-PRODUCER-INCOMM-LIT                           04590000
8661H                                  PIC X(06)  VALUE 'INCOMM'.       04600000
041500     05  SV004-CARD-PRDR-SAFEWAY-1-STEP                           04610000
041600                                 PIC X(01)  VALUE '1'.            04620000
041700     05  SV004-CARD-PRDR-SAFEWAY-1-LIT                            04630000
041800                                 PIC X(06)  VALUE 'SFWAY1'.       04640000
041900     05  SV004-CARD-PRDR-SAFEWAY-2-STEP                           04650000
042000                                 PIC X(01)  VALUE '2'.            04660000
042100     05  SV004-CARD-PRDR-SAFEWAY-2-LIT                            04670000
042200                                 PIC X(06)  VALUE 'SFWAY2'.       04680000
042300     05  SV004-CARD-PRODUCER-GIFT-CERT                            04690000
042400                                 PIC X(01)  VALUE 'G'.            04700000
042500     05  SV004-CARD-PRODUCER-GIFT-LIT                             04710000
042600                                 PIC X(06)  VALUE 'GFCERT'.       04720000
111023*    05  SV004-CARD-PRDR-HARVARD                                  04730001
111023*                                PIC X(01)  VALUE 'T'.            04740001
111023*    05  SV004-CARD-PRDR-HARVARD-LIT                              04740101
111023*                                PIC X(06)  VALUE 'HARVRD'.       04740201
111023     05  SV004-CARD-PRDR-PLICRD                                   04741001
111023                                 PIC X(01)  VALUE 'P'.            04742001
111023     05  SV004-CARD-PRDR-PLICRD-LIT                               04761001
111023                                 PIC X(06)  VALUE 'PLICRD'.       04762001
8661H      05  SV004-CARD-PRDR-BLACKHAWK                                04770000
8661H                                  PIC X(01)  VALUE 'B'.            04780000
8661H      05  SV004-CARD-PRDR-BLACKHAWK-LIT                            04790000
8661H                                  PIC X(06)  VALUE 'BLKHWK'.       04800000
092122     05  SV004-CARD-PRDR-OPTMUM                                   04810000
092122                                 PIC X(01)  VALUE 'O'.            04820000
092122     05  SV004-CARD-PRDR-OPTMUM-LIT                               04830000
092122                                 PIC X(06)  VALUE 'OPTMUM'.       04840000
WR7057     05  SV004-CARD-PRDR-VALID                                    04850000
WR7057                                 PIC X(01)  VALUE 'L'.            04860000
WR7057     05  SV004-CARD-PRDR-VALID-LIT                                04870000
WR7057                                 PIC X(06)  VALUE 'VALID '.       04880000
044300     05  SV004-CARD-PRDR-JET-LITHO                                04890000
044400                                 PIC X(01)  VALUE 'J'.            04900000
044500     05  SV004-CARD-PRDR-JET-LITHO-LIT                            04910000
044600                                 PIC X(06)  VALUE 'JETLTH'.       04920000
044300     05  SV004-CARD-PRDR-MTL                                      04930000
044400                                 PIC X(01)  VALUE 'M'.            04940000
044500     05  SV004-CARD-PRDR-MTL-LIT                                  04950000
044600                                 PIC X(06)  VALUE 'MTL   '.       04960000
P5211      05  SV004-CARD-PRDR-VIRTUAL                                  04970000
P5211                                  PIC X(01)  VALUE 'V'.            04980000
P5211      05  SV004-CARD-PRDR-VIRTUAL-LIT                              04990000
P5211                                  PIC X(06)  VALUE 'VRTUAL'.       05000000
044700 01  SV004-CARD-PRODUCER-TABLE                                    05010000
044800     REDEFINES SV004-CARD-PRODUCER-CODE.                          05020000
044900     05  SV004-CARD-PRDR         OCCURS 12 TIMES                  05030000
045000                                 INDEXED BY SV004-CARD-PRDR-IDX.  05040000
045100         10  SV004-CARD-PRDR-CDE PIC  X(01).                      05050000
045200         10  SV004-CARD-PRDR-LIT PIC  X(06).                      05060000
045300 01  SV004-CARD-PRDR-MAX-OCC     PIC  9(02)  VALUE 12.            05070000
045400                                                                  05080000
045500 01  SV004-PIN-INITIAL-SHIPMENT.                                  05090000
045600     05  SV004-PIN-INIT-PROD-YR                                   05100000
045700                                 PIC  S9(04) COMP                 05110000
045800                                             VALUE 2003.          05120000
045900     05  SV004-PIN-INIT-SHIPT-REQ                                 05130000
046000                                 PIC  S9(04) COMP                 05140000
046100                                             VALUE 13.            05150000
046200 01  SV004-BREAKAGE-INIT-FISCAL-PD.                               05160000
046300     05  SV004-BREAKAGE-INIT-FISC-YR                              05170000
046400                                 PIC   9(04) VALUE 2003.          05180000
046500     05  SV004-BREAKAGE-INIT-FISC-PD                              05190000
046600                                 PIC   9(02) VALUE 09.            05200000
046700***************************************************************   05210000
046800*   WORK AREAS                                                    05220000
046900***************************************************************   05230000
047000 01  SV004-PRE-DENOMINATIONS     PIC  9(05)V99  VALUE ZEROS.      05240000
047100     88  SV004-STD-GIFT-CARD-DENOM              VALUE 0.00,       05250000
047200                                                      5.00,       05260000
047300                                                     10.00,       05270000
047400                                                     15.00,       05280000
047500                                                     20.00,       05290000
047600                                                     25.00,       05300000
047610                                                     30.00,       05310000
047700                                                     50.00,       05320000
047800                                                    100.00,       05330000
047900                                                    500.00.       05340000
