      ******************************************************************00010000
      *  DISCOVER MERCHANT TABLE ENTRIES                               *00020004
      *  LRECL = 199 WITH NO FILLER                                    *00030012
      ******************************************************************00040000
       01  ABCDE-DISC-MER-TABLE.                                        00050003
           05  ABCDE-DT-FIRST-FIELD            PIC  X(08).              00060010
           05  ABCDE-DT-STORE-NBR              PIC  9(04).              00070010
           05  ABCDE-DT-RECORD-TYPE            PIC  X(01).              00080004
           05  ABCDE-DT-HARDCODE-ONE           PIC  X(10).              00090013
           05  ABCDE-DT-STORE-NBR2             PIC  9(04).              00100010
           05  ABCDE-DT-HARDCODE-TWO           PIC  X(12).              00110014
           05  ABCDE-DT-CITY                   PIC  X(13).              00120007
           05  ABCDE-DT-HARDCODE-THREE         PIC  X(01).              00130007
           05  ABCDE-DT-STATE                  PIC  X(02).              00140007
           05  ABCDE-DT-HARDCODE-FOUR          PIC  X(01).              00150007
           05  ABCDE-DT-HARDCODE-FIVE          PIC  X(12).              00160007
           05  ABCDE-DT-ADDRESS                PIC  X(22).              00170012
           05  ABCDE-DT-HARDCODE-51            PIC  X(04).              00180012
           05  ABCDE-DT-ZIPPLUS4               PIC  X(09).              00190007
           05  ABCDE-DT-HARDCODE-SIX           PIC  X(04).              00200007
           05  ABCDE-DT-STATE2                 PIC  X(02).              00210007
           05  ABCDE-DT-HARDCODE-SEVEN         PIC  X(12).              00220007
           05  ABCDE-DT-CITY2                  PIC  X(13).              00230007
           05  ABCDE-DT-HARDCODE-EIGHT         PIC  X(05).              00240007
           05  ABCDE-DT-ZIPPLUS4A              PIC  X(09).              00250007
           05  ABCDE-DT-HARDCODE-NINE          PIC  X(04).              00260010
           05  ABCDE-DT-STORE-NBR3             PIC  9(04).              00270010
           05  ABCDE-DT-MALLNAME               PIC  X(21).              00280011
           05  ABCDE-DT-HARDCODE-TEN           PIC  X(06).              00290007
           05  ABCDE-DT-MERCHANT-NBR           PIC  X(15).              00300007
           05  FILLER                          PIC  X(01).              00310013
