      ******************************************************************00010000
      *  FIRST DATA MERCHANT TABLE ENTRIES                             *00020010
      *  LRECL = 201                                                   *00030027
      ******************************************************************00040000
       01  ABCDE-FD-RETURNS-MER-TABLE.                                  00050010
           05  ABCDE-FD-RETURNS-FIRST-FIELD    PIC  X(08).              00060010
           05  ABCDE-FD-RETURNS-STORE-NBR      PIC  9(05).              00070027
           05  ABCDE-FD-RETURNS-RECORD-TYPE    PIC  X(01).              00080010
           05  ABCDE-FD-RETURNS-DETAIL.                                 00090017
               10  ABCDE-FD-RETURNS-HARDCODE-ONE   PIC  X(05).          00101025
               10  ABCDE-FD-RETURNS-LOCATION-NM    PIC  X(20).          00110022
               10  ABCDE-FD-RETURNS-HARDCODE-TWO   PIC  X(06).          00111225
               10  ABCDE-FD-RETURNS-MERCHANT-NBR   PIC  X(15).          00112021
               10  ABCDE-FD-RETURNS-FILLER         PIC  X(140).         00120021
       01  ABCDE-FD-RETURNS-MER-TABLE-R2 REDEFINES                      00121029
           ABCDE-FD-RETURNS-MER-TABLE.                                  00122029
           05  ABCDE-FD-RETURNS-SET1           PIC  X(13).              00123029
           05  ABCDE-FD-RETURNS-REC-TYP-R2     PIC  X(01).              00124029
           05  ABCDE-FD-RETURNS-HRDCDE-ONE-R2  PIC  X(05).              00125029
           05  ABCDE-FD-RETURNS-LOC-NM-R2      PIC  X(20).              00126029
           05  ABCDE-FD-RETURNS-SET2           PIC  X(161).             00127029
       01  ABCDE-PG-FD-RTRNS-MER-TABLE.                                 00130019
           05  ABCDE-PG-FD-RTRNS-FIRST-FIELD   PIC  X(07).              00140018
           05  ABCDE-PG-FD-RTRNS-STORE-NBR     PIC  9(06).              00150027
           05  ABCDE-PG-FD-RTRNS-DETAIL        PIC  X(186).             00160018
SJK   *01  ABCDE-FD-RETURNS-MER-TABLE-R1 REDEFINES                      00170016
      *    ABCDE-FD-RETURNS-MER-TABLE.                                  00180016
      *    05  FILLER                          PIC  X(08).              00190016
      *    05  ABCDE-FD-PG-RETURNS-STORE-NBR   PIC  9(05).              00200016
      *    05  FILLER                          PIC  X(186).             00210016
                                                                        00220014
       01  ABCDE-FD-SALES-MER-TABLE.                                    00230010
           05  ABCDE-FD-SALES-FIRST-FIELD      PIC  X(08).              00240010
           05  ABCDE-FD-SALES-STORE-NBR        PIC  9(05).              00250027
           05  ABCDE-FD-SALES-RECORD-TYPE      PIC  X(01).              00260010
           05  ABCDE-FD-SALES-DETAIL.                                   00270017
               10  ABCDE-FD-SALES-HARDCODE-ONE     PIC  X(20).          00280025
               10  ABCDE-FD-SALES-LOCATION-NM      PIC  X(20).          00280125
               10  ABCDE-FD-SALES-HARDCODE-TWO     PIC  X(06).          00282025
               10  ABCDE-FD-SALES-MERCHANT-NBR     PIC  X(15).          00283025
               10  ABCDE-FD-SALES-FILLER           PIC  X(125).         00300025
       01  ABCDE-FD-SALES-MER-TABLE-R2 REDEFINES                        00301029
           ABCDE-FD-SALES-MER-TABLE.                                    00302029
           05  ABCDE-FD-SALES-SET1             PIC  X(13).              00303029
           05  ABCDE-FD-SALES-REC-TYP-R2       PIC  X(01).              00304029
           05  ABCDE-FD-SALES-HRDCDE-ONE-R2    PIC  X(20).              00305029
           05  ABCDE-FD-SALES-LOC-NM-R2        PIC  X(20).              00306029
           05  ABCDE-FD-SALES-SET2             PIC  X(146).             00307029
       01  ABCDE-PG-FD-SLS-MER-TABLE.                                   00310019
           05  ABCDE-PG-FD-SLS-FIRST-FIELD     PIC  X(07).              00320018
           05  ABCDE-PG-FD-SLS-STORE-NBR       PIC  9(06).              00330027
           05  ABCDE-PG-FD-SLS-DETAIL          PIC  X(186).             00340018
SJK   *01  ABCDE-FD-SALES-MER-TABLE-R1 REDEFINES                        00350016
      *    ABCDE-FD-SALES-MER-TABLE.                                    00360016
      *    05  FILLER                          PIC  X(08).              00370016
      *    05  ABCDE-FD-PG-SALES-STORE-NBR     PIC  9(05).              00380016
      *    05  FILLER                          PIC  X(186).             00390016
