      ******************************************************************        
      *  DEBIT/CREDIT SETTLEMENT                                       *        
      *                                                                *        
      *  RECORD USED TO UPDATE SETTLEMENT PROCESSED CODE ON TEPCRD     *        
052523*  LRECL = 100                                                   *        
      ******************************************************************        
       01  TC009-DATA.                                                          
           05  TC009-STR-NBR           PIC  9(04).                              
           05  TC009-RGST-ID           PIC  9(04).                              
           05  TC009-TRN-NBR           PIC  9(04).                              
           05  TC009-STRT-TIME         PIC  X(08).                              
           05  TC009-SLS-CORR-SEQ-NBR  PIC S9(04).                              
           05  TC009-TNDR-SEQ-NBR      PIC  9(04).                              
           05  TC009-SLS-DTE           PIC  X(10).                              
           05  TC009-CARD-NBR          PIC  X(19).                              
052523     05  TC009-ORIG-STR-NBR      PIC  9(04).                              
052523     05  TC009-TRLING-TRN-IND    PIC  X(01).                              
052523     05  TC009-COBRAND-PYMT-IND  PIC  X(01).                              
052523     05  TC009-TRN-TYP-CDE       PIC  X(02).                              
052523     05  FILLER                  PIC  X(35).                              
