      ******************************************************************        
      *  DEBIT SETTLEMENT SYSTEM                                       *        
      *                                                                *        
      *  EXCEPTION TABLE FILE LAYOUT                                   *        
      *  LRECL = 78                                                    *        
      ******************************************************************        
       01  TC021-DATA.                                                          
           05  TC021-RPT-DTE           PIC  X(10).                              
           05  TC021-SLS-DTE           PIC  X(10).                              
           05  TC021-STR-NBR           PIC  9(04).                              
           05  TC021-RGST-ID           PIC  9(04).                              
           05  TC021-TRN-NBR           PIC  9(04).                              
           05  TC021-STRT-TIME         PIC  X(08).                              
           05  TC021-TNDR-SEQ-NBR      PIC  9(04).                              
           05  TC021-CARD-NBR          PIC  X(19).                              
           05  TC021-TNDR-AMT          PIC  S9(7)V99.                           
           05  TC021-SALE-TYPE         PIC  X(01).                              
               88  TC021-SALES-CORR     VALUE 'C'.                              
               88  TC021-LATE           VALUE 'L'.                              
               88  TC021-LATE-VOID      VALUE 'W'.                              
               88  TC021-REVERSAL       VALUE 'R'.                              
               88  TC021-NORMAL-SALE    VALUE 'S'.                              
               88  TC021-RETURN         VALUE 'X'.                              
               88  TC021-VOID           VALUE 'V'.                              
           05  TC021-SOURCE-CDE        PIC  X(02).                              
               88  TC021-BANK           VALUE 'B '.                             
               88  TC021-BANK-ADJ       VALUE 'BA'.                             
               88  TC021-COSA           VALUE 'S '.                             
           05  TC021-REASON-CDE        PIC  X(03).                              
               88  TC021-MISS-SA-TRAN   VALUE 'MSA'.                            
               88  TC021-MISS-BANK-TRAN VALUE 'MSB'.                            
               88  TC021-CARD-NBR-DIFF  VALUE 'CRD'.                            
               88  TC021-SALE-AMT-DIFF  VALUE 'AMT'.                            
               88  TC021-UNMTCH-ADJ     VALUE 'UNA'.                            
               88  TC021-BANK-REV-TRAN  VALUE 'BRE'.                            
               88  TC021-DUP-BANK-TRAN  VALUE 'DBT'.                            
               88  TC021-SALE-TYP-DIFF  VALUE 'STD'.                            
