      ***********************************************************       00010000
      **                      TCRD072                          **       00020000
      **                     LRECL=250                         **       00030000
      **  THIS COPYBOOK WILL DEFINE THE FIELDS AND LAYOUT OF   **       00040000
      **  THE TRAILING TRANSACTIONS UPDATE FIELDS FOR USE IN   **       00050000
      **  UPDATING TEPPAY AND TEPCRD.                          **       00051000
      **  USED IN JOB TCK072 BY PROGRAMS TCKUT072, TCKUT073    **       00060000
      **  AND TCKUP074.                                        **       00070000
      ***********************************************************       00080000
       01  TC072-TRAN-UPDT-RECORD.                                      00090000
           05  TC072-EPTRN-PARTN-NBR        PIC 9(4).                   00100000
           05  FILLER                       PIC X(1) VALUE ','.         00110000
           05  TC072-EPTRN-STR-NBR          PIC 9(4).                   00120000
           05  FILLER                       PIC X(1) VALUE ','.         00130000
           05  TC072-EPTRN-RGST-ID          PIC 9(4).                   00140000
           05  FILLER                       PIC X(1) VALUE ','.         00150000
           05  TC072-EPTRN-TRN-NBR          PIC 9(4).                   00160000
           05  FILLER                       PIC X(1) VALUE ','.         00170000
           05  TC072-EPTRN-STRT-TM          PIC X(8).                   00180000
           05  FILLER                       PIC X(1) VALUE ','.         00190000
           05  TC072-EPTRN-SLS-CORR-SEQ-NBR PIC -9(4).                  00200000
           05  FILLER                       PIC X(1) VALUE ','.         00210000
           05  TC072-EPCRD-TNDR-SEQ-NBR     PIC -9(4).                  00220000
           05  FILLER                       PIC X(1) VALUE ','.         00230000
           05  TC072-UPDATE-TYPE            PIC X(1).                   00240000
           05  FILLER                       PIC X(208).                 00450000
