000100******************************************************************00010000
000200*  THIS COPYBOOK IS THE LAYOUT FOR AJB SETTELEMENT TRANSACTION   *00020000
000300*                                                                *00030000
000500******************************************************************00040000
000600 01  TC011-EXTRACT-RECORD                PIC  X(328).             00050000
000601                                                                  00060000
000610 01  TC011-EXTRACT-DTL-RECORD REDEFINES                           00061000
000620         TC011-EXTRACT-RECORD.                                    00062000
000700     05  TC011-PARTN-NBR                 PIC  9(04).              00063000
000800     05  TC011-STR-NBR                   PIC  9(04).              00064000
000900     05  TC011-RGST-ID                   PIC  9(04).              00065000
001000     05  TC011-TRN-NBR                   PIC  9(04).              00066000
001100     05  TC011-STRT-TM                   PIC  X(08).              00067000
001200     05  TC011-SLS-CORR-SEQ-NBR          PIC S9(04)               00068000
001210                                         SIGN IS LEADING SEPARATE.00069000
001300     05  TC011-TRN-TYP-CDE               PIC  X(02).              00070000
001400     05  TC011-SLS-DTE                   PIC  X(10).              00080000
001500     05  TC011-TRN-DTE                   PIC  X(10).              00090000
001600     05  TC011-TNDR-SEQ-NBR              PIC  9(04).              00100000
001700     05  TC011-TNDR-TYP-CDE              PIC  X(02).              00110000
001800     05  TC011-TNDR-ID                   PIC  X(33).              00120000
001900     05  TC011-TNDR-AMT                  PIC S9(07)V99            00130000
001910                                         SIGN IS LEADING SEPARATE.00140000
002000     05  TC011-TNDR-ID-SRC-CDE           PIC  X(02).              00150000
002100     05  TC011-AUTH-NBR                  PIC  X(06).              00160000
002200     05  TC011-AUTH-SRC-CDE              PIC  X(02).              00170000
002300     05  TC011-CPS-TRN-ID                PIC  9(15).              00180000
002400     05  TC011-MC-CMPLIN-CDE             PIC  X(04).              00190000
002500     05  TC011-VIP-SRC-CDE               PIC  X(01).              00200000
002600     05  TC011-VIP-RSPN-CDE              PIC  X(02).              00210000
002700     05  TC011-BNKNET-NBR                PIC  X(15).              00220000
002800     05  TC011-SETTLE-STORE-NBR          PIC  9(04).              00230000
002900     05  TC011-ECOMM-REAUTH-IND          PIC  X(01).              00240000
003000     05  TC011-ECOMM-ORD-NBR             PIC  X(25).              00250000
003100     05  TC011-AUTH-REF-NBR              PIC  X(45).              00260000
003200     05  TC011-TRAN-CDE                  PIC  X(01).              00270000
003300         88  TC011-PREV-DAY-TRAN              VALUE 'P'.          00280000
003400         88  TC011-CURR-DAY-TRAN              VALUE SPACE.        00290000
003500     05  TC011-MERCHANT-NBR              PIC  X(15).              00300000
003600     05  TC011-AVS-RSPN-CDE              PIC  X(01).              00310000
003700     05  TC011-VOID-ABRT-CDE             PIC  X(01).              00320000
003800     05  TC011-SLS-TX-AMT                PIC S9(07)V99            00330000
003810                                         SIGN IS LEADING SEPARATE.00340000
003900     05  TC011-CRD-LVL-RSLT-CDE          PIC  X(02).              00350000
004000     05  TC011-CVV-RSPN-CDE              PIC  X(01).              00360000
004100     05  TC011-E-BUS-IND                 PIC  X(01).              00370000
004200     05  TC011-NETWK-REF-ID              PIC  X(15).              00380000
004300     05  TC011-TRSM-TMST                 PIC  X(26).              00390000
004400     05  TC011-SYS-TRC-AUD-NBR           PIC  9(06).              00400000
004500     05  TC011-TRK-DAT-CND-CDE           PIC  X(02).              00410000
004600     05  TC011-OMNI-CHNL-FFLMT-TYP-CDE   PIC  X(03).              00420000
SHIP       05  TC011-VISA-MULT-CLR-SEQ-NBR     PIC  9(04).              00430000
SHIP       05  TC011-VISA-TOT-SHP-NBR          PIC  9(04).              00440000
SHIP2      05  TC011-PAR-SHP-IND               PIC  X(01).              00451000
SHIP2          88  TC011-PAR-SHP           VALUE 'Y'.                   00452000
SHIP2          88  TC011-NOT-PAR-SHP       VALUE 'N'.                   00453000
SHIP2          88  TC011-NO-SHP            VALUE ' '.                   00454000
052523     05  TC011-TRLING-TRN-IND            PIC  X(01).              00455000
052523     05  TC011-COBRAND-PYMT-IND          PIC  X(01).              00456000
052523     05  FILLER                          PIC  X(11).              00460000
004800                                                                  00470000
004900 01  TC011-TRAILOR-RECORD REDEFINES                               00480000
005000         TC011-EXTRACT-RECORD.                                    00490000
005100     05  TC011-TRLR-ID                   PIC  X(04).              00500000
005101         88  AR025-TRAILER                    VALUE 'FTLR'.       00510000
005102     05  FILLER                          PIC  X(01).              00510100
005103     05  TC011-TOTAL-COUNT               PIC  9(09).              00510200
005104     05  FILLER                          PIC  X(01).              00510300
005105     05  TC011-TOTAL-DOLLAR-AMOUNT       PIC  S9(09)V99           00510400
005106                                         SIGN IS LEADING SEPARATE.00510500
005107     05  FILLER                          PIC  X(301).             00510600
