      ***********************************************************       00010000
      **                      TCRD075                          **       00020000
      **                     LRECL=250                         **       00030000
      **  THIS COPYBOOK WILL DEFINE THE FIELDS AND LAYOUT OF   **       00040000
      **  THE TRAILING TRANSACTIONS UPDATE FIELDS FOR USE IN   **       00050000
      **  UPDATING TSASUM CATEGORIES OF TTN AND TTP.           **       00051000
      **  USED IN JOB TCK095 BY PROGRAMS TCKUT075, TCKUT076    **       00060000
      **  AND TCKUP077.                                        **       00070000
      ***********************************************************       00080000
       01  TC075-TRAN-UPDT-RECORD.                                      00090000
           05  TC075-SASUM-PARTN-NBR        PIC 9(4).                   00100000
           05  FILLER                       PIC X(1) VALUE ','.         00110000
           05  TC075-SASUM-STR-NBR          PIC 9(4).                   00120000
           05  FILLER                       PIC X(1) VALUE ','.         00130000
           05  TC075-SASUM-RGST-ID          PIC 9(4).                   00140000
           05  FILLER                       PIC X(1) VALUE ','.         00150000
           05  TC075-SASUM-SUM-CTG-CDE      PIC X(3).                   00160000
           05  FILLER                       PIC X(1) VALUE ','.         00170000
           05  TC075-SASUM-AMOUNT           PIC -9(7).99.               00180000
           05  FILLER                       PIC X(1) VALUE ','.         00190000
           05  TC075-SASUM-COUNT            PIC 9(7).                   00200000
           05  FILLER                       PIC X(212).                 00210000
