000100******************************************************************00001000
000200*  THIS COPYBOOK IS THE LAYOUT FOR THE EXTRACT FILE TO BE USED   *00002000
000300*  FOR THE EARLY EXTRACT OF CREDIT TRANSACTIONS FOR SETTLEMENT   *00003000
000400*  WITH FIFTH THIRD BANK.                                        *00004000
000400******************************************************************00004100
SHIP2 * DATE:        01/21/2020                                        *00004200
SHIP2 * WR/IR#:      CHG0233046                                        *00004300
SHIP2 * PROGRAMMER:  BARB SCHULTZ                                      *00004400
SHIP2 * DESCRIPTION: COMMENTED OUT THE MC FIELDS BECAUSE THEY WILL NOW *00004500
SHIP2 *              USE THE VISA FIELDS. BOTH VISA AND MC ARE GOING   *00004600
SHIP2 *              TO BE USING THE SAME MULT CLEARING FIELDS FROM THE*00004700
SHIP2 *              DATABASE. ALSO ADDED THE PARTIAL SHIPPING INDICATOR00004800
SHIP2 *              COUNT TO HELP FIGURE OUT IF THIS IS A PARTIAL     *00004900
SHIP2 *              SHIPMENT OR THE WHOLE ORDER WAS SHIPPED.          *00005000
000500******************************************************************00005100
000600 01  TC005-EXTRACT-RECORD.                                        00005200
000700     05  TC005-PARTN-NBR             PIC S9(04)    COMP.          00005300
000800     05  TC005-STR-NBR               PIC S9(04)    COMP.          00005400
000900     05  TC005-RGST-ID               PIC S9(04)    COMP.          00005500
001000     05  TC005-TRN-NBR               PIC S9(04)    COMP.          00005600
001100     05  TC005-STRT-TM               PIC  X(08).                  00005700
001200     05  TC005-SLS-CORR-SEQ-NBR      PIC S9(04)    COMP.          00005800
001300     05  TC005-TRN-TYP-CDE           PIC  X(02).                  00005900
001400     05  TC005-SLS-DTE               PIC  X(10).                  00006000
001500     05  TC005-TRN-DTE               PIC  X(10).                  00007000
001600     05  TC005-TNDR-SEQ-NBR          PIC S9(04)    COMP.          00008000
001700     05  TC005-TNDR-TYP-CDE          PIC  X(02).                  00009000
001800     05  TC005-TNDR-ID               PIC  X(33).                  00009100
001900     05  TC005-TNDR-AMT              PIC S9(07)V99 COMP-3.        00009200
002000     05  TC005-TNDR-ID-SRC-CDE       PIC  X(02).                  00009300
002100     05  TC005-AUTH-NBR              PIC  X(06).                  00009400
002200     05  TC005-AUTH-SRC-CDE          PIC  X(02).                  00009500
002300     05  TC005-CPS-TRN-ID            PIC S9(15)    COMP-3.        00009600
002400     05  TC005-MC-CMPLIN-CDE         PIC  X(04).                  00009700
002500     05  TC005-VIP-SRC-CDE           PIC  X(01).                  00009800
002600     05  TC005-VIP-RSPN-CDE          PIC  X(02).                  00009900
002700     05  TC005-BNKNET-NBR            PIC  X(15).                  00010000
002800     05  TC005-SETTLE-STORE-NBR      PIC  9(04).                  00010100
002900     05  TC005-ECOMM-REAUTH-IND      PIC  X(01).                  00010200
003000     05  TC005-ECOMM-ORD-NBR         PIC  X(25).                  00010300
003100     05  TC005-AUTH-REF-NBR          PIC  X(45).                  00010400
003200     05  TC005-TRAN-CDE              PIC  X(01).                  00010500
003300         88  TC005-PREV-DAY-TRAN    VALUE 'P'.                    00010600
003400         88  TC005-CURR-DAY-TRAN    VALUE SPACE.                  00010700
003500     05  TC005-MERCHANT-NBR          PIC  X(15).                  00010800
002600     05  TC005-AVS-RSPN-CDE          PIC  X(01).                  00010900
003800     05  TC005-VOID-ABRT-CDE         PIC  X(01).                  00011000
001900     05  TC005-SLS-TX-AMT            PIC S9(07)V99 COMP-3.        00011100
001900     05  TC005-CRD-LVL-RSLT-CDE      PIC  X(02).                  00011200
001900     05  TC005-CVV-RSPN-CDE          PIC  X(01).                  00011300
001900     05  TC005-E-BUS-IND             PIC  X(01).                  00011400
001900     05  TC005-NETWK-REF-ID          PIC  X(15).                  00011500
001900     05  TC005-TRSM-TMST             PIC  X(26).                  00011600
001900     05  TC005-SYS-TRC-AUD-NBR       PIC  9(06).                  00011700
001900     05  TC005-TRK-DAT-CND-CDE       PIC  X(02).                  00011800
002000     05  TC005-OMNI-CHNL-FFLMT-TYP-CDE  PIC  X(03).               00011900
SHIP       05  TC005-VISA-MULT-CLR-SEQ-NBR PIC  9(04).                  00012000
SHIP       05  TC005-VISA-TOT-SHP-NBR      PIC  9(04).                  00012100
SHIP2 *    05  TC005-MC-MULT-CLR-SEQ-NBR   PIC  9(04).                  00012200
SHIP       05  TC005-FULFILLMENT-TYPE      PIC  X(01).                  00012300
SHIP2      05  TC005-PAR-SHIP-IND          PIC  X(01).                  00012400
052523     05  TC005-TRLING-TRN-IND        PIC  X(01).                  00012500
052523     05  TC005-COBRAND-PYMT-IND      PIC  X(01).                  00012600
052523     05  FILLER                      PIC  X(10).                  00012700
