      ******************************************************************        
      *  DEBIT SETTLEMENT SYSTEM                                       *        
      *                                                                *        
      *  COSA SEQUENTIAL FILE                                          *        
C24628*  LRECL = 72                                                    *        
      *  THIS IS FROM TKMA.NEXTGEN.FULL.SRCLIB                         *        
      ******************************************************************        
       01  TC002-DATA.                                                          
           05  TC002-PARTN-NBR         PIC  9(04).                              
           05  TC002-STR-NBR           PIC  9(04).                              
           05  TC002-SLS-DTE           PIC  X(08).                              
           05  TC002-STRT-TIME         PIC  X(06).                              
           05  TC002-RGST-ID           PIC  9(04).                              
           05  TC002-TRN-NBR           PIC  9(04).                              
           05  TC002-SLS-CORR-SEQ-NBR  PIC  S9(04).                             
           05  TC002-TNDR-SEQ-NBR      PIC  S9(04).                             
           05  TC002-CARD-NBR          PIC  X(19).                              
           05  TC002-TNDR-AMT          PIC  S9(7)V99.                           
           05  TC002-MATCH-CDE         PIC  X(01).                              
               88  TC002-MATCH          VALUE 'Y'.                              
               88  TC002-NOT-MATCHED    VALUE 'N'.                              
           05  TC002-SALE-TYPE         PIC  X(01).                              
               88  TC002-SALES-CORR     VALUE 'C'.                              
               88  TC002-LATE           VALUE 'L'.                              
               88  TC002-LATE-VOID      VALUE 'W'.                              
               88  TC002-REVERSAL       VALUE 'R'.                              
               88  TC002-NORMAL-SALE    VALUE 'S'.                              
               88  TC002-RETURN         VALUE 'X'.                              
               88  TC002-VOID           VALUE 'V'.                              
           05  TC002-REC-IND           PIC  X(01).                              
               88  TC002-NEW-RECORD     VALUE 'N'.                              
               88  TC002-OLD-RECORD     VALUE 'O'.                              
C24628     05  TC002-REASON-CDE        PIC  X(03).                              
