      ******************************************************************        
      *  DEBIT SETTLEMENT SYSTEM                                       *        
      *                                                                *        
      *  MERCHANT ACTIVITY FILE FROM FIFTH THIRD BANK                  *        
      *  THERE IS A HEADER, MANY DETAIL RECORDS AND A TRAILER RECORD.  *        
      *                                                                *        
      *  LRECL = 80                                                    *        
      ******************************************************************        
P10237* DATE:        04/22/2015                                        *        
P10237* WR/IR#:      CHG0104429                                        *        
P10237* PROGRAMMER:  COGNIZANT                                         *        
P10237* DESCRIPTION: TC001-ACCT-NBR FIELD IS REPLACED WITH FILLER AS   *        
P10237*              PART OF COSA DATA SECURITY PROJECT. CHANGES ARE   *        
P10237*              TAGGED AS P10237.                                 *        
P10237******************************************************************        
       01  TC001-MERCHANT-ACTIVITY-FILE.                                        
           05  TC001-MAF-FILE.                                                  
               10  TC001-FILLER                PIC  X(08).                      
               10  TC001-REC-TYP               PIC  9(02).                      
                   88  TC001-HDR-TYP        VALUE 10.                           
                   88  TC001-FILE-TRL-TYP   VALUE 90.                           
                   88  TC001-DTL-TYP        VALUE 20.                           
                   88  TC001-DTL2-TYP       VALUE 21.                           
                   88  TC001-TRN1-TYP       VALUE 51.                           
                   88  TC001-TRN2-TYP       VALUE 52.                           
                   88  TC001-TRN3-TYP       VALUE 53.                           
                   88  TC001-TRN4-TYP       VALUE 54.                           
                   88  TC001-BTCH-TRL-TYP   VALUE 80.                           
                   88  TC001-RECON-HDR-TYP  VALUE 70.                           
                   88  TC001-RECON1-TYP     VALUE 71.                           
                   88  TC001-RECON2-TYP     VALUE 72.                           
                   88  TC001-RECONT-TYP     VALUE 79.                           
               10  TC001-MAF-FILLER         PIC  X(70).                         
               10  TC001-HEADER-RECORD                                          
                                         REDEFINES TC001-MAF-FILLER.            
                  15  TC001-FILE-TITLE            PIC  X(04).                   
                  15  TC001-FILE-FORMAT-VERSION   PIC X(02).                    
                  15  TC001-MERCH-CHAIN-NBR       PIC  9(06).                   
                  15  TC001-MPS-PROC-DTE          PIC  9(08).                   
                  15  TC001-FILE-CRE-DTE          PIC  9(08).                   
                  15  TC001-FILE-CRE-TME          PIC  9(06).                   
                  15  FILLER                      PIC  X(01).                   
                  15  TC001-MERCH-REC-RPT-OPT     PIC  X(01).                   
                  15  FILLER                      PIC  X(34).                   
               10  TC001-FILE-BATCH-TRAIL-RECORD REDEFINES                      
                                                TC001-MAF-FILLER.               
                  15  TC001-FILE-BTCH-TOTAL        PIC  9(05).                  
                  15  TC001-FILE-REC-CNT           PIC  9(06).                  
                  15  TC001-FILE-DEBIT-TRANS       PIC  9(06).                  
                  15  TC001-FILE-DOL-DEBIT-TRANS   PIC  9(7)V99.                
                  15  TC001-FILE-CREDIT-TRANS      PIC  9(06).                  
                  15  TC001-FILE-DOL-CREDIT-TRANS  PIC  9(7)V99.                
                  15  TC001-FILE-CASH-BACK-AMT     PIC  9(7)V99.                
                  15  TC001-FILE-NET-AMT           PIC  9(7)V99.                
                  15  TC001-FILE-NET-AMT-SIGN      PIC  X(01).                  
                  15  TC001-FILE-DOL-DB-HIGH-DGT   PIC  9(01).                  
                  15  TC001-FILE-DOL-CR-HIGH-DGT   PIC  9(01).                  
                  15  TC001-FILE-NET-HIGH-DGT      PIC  9(01).                  
                  15  TC001-FILE-FILLER            PIC  X(07).                  
               10  TC001-DTL-BATCH-HDR-RECORD REDEFINES                         
                                           TC001-MAF-FILLER.                    
                  15  TC001-BATCH-TYP             PIC  X(03).                   
                  15  TC001-MERCH-DIV-NBR         PIC  9(03).                   
                  15  TC001-STR-NBR               PIC  9(04).                   
                  15  TC001-MERCH-NBR             PIC  X(16).                   
                  15  TC001-MERCH-TERMINAL-NBR    PIC  X(15).                   
                  15  TC001-REG-NBR               PIC  9(04).                   
                  15  TC001-BATCH-NBR             PIC  9(05).                   
                  15  TC001-TRAN-NBR              PIC  9(05).                   
                  15  TC001-MERCH-END-OF-DAY      PIC  X(01).                   
                  15  TC001-DTL-BATCH-HDR-FILLER  PIC  X(14).                   
               10  TC001-DTL-BATCH-HDR2-RECORD REDEFINES                        
                                         TC001-MAF-FILLER.                      
                  15  TC001-MERCH-NAME             PIC  X(25).                  
                  15  TC001-MERCH-CITY             PIC  X(13).                  
                  15  TC001-MERCH-STATE            PIC  X(03).                  
                  15  TC001-MERCH-ZIP              PIC  X(09).                  
                  15  TC001-MERCH-CNTRY-CDE        PIC  X(03).                  
                  15  TC001-MERCH-TME-ZN           PIC  X(03).                  
                  15  TC001-MERCH-EOF-DTE          PIC  9(05).                  
                  15  TC001-MERCH-EOF-TME          PIC  9(04).                  
                  15  TC001-DTL2-FILLER            PIC  X(05).                  
               10  TC001-DTL-TRAN1-RECORD REDEFINES                             
                                        TC001-MAF-FILLER.                       
                  15  TC001-TRN1-DTE               PIC  9(04).                  
                  15  TC001-TRN1-TME               PIC  9(06).                  
                  15  TC001-TRN1-SEQ-NBR           PIC  9(06).                  
                  15  TC001-TRN1-TRAN-TYPE         PIC  X(02).                  
                  15  TC001-TRAN-DISP              PIC  X(01).                  
                  15  TC001-TRAN-RESP-CDE          PIC  9(03).                  
                  15  TC001-TRAN-AMT               PIC  9(07)V99.               
                  15  TC001-AUTH-CDE               PIC  X(10).                  
                  15  TC001-POS-ENTRY-MODE         PIC  X(02).                  
                  15  TC001-CARD-NBR               PIC  X(19).                  
                  15  TC001-CARD-SEQ-NBR           PIC  X(03).                  
                  15  TC001-EXP-DTE                PIC  9(04).                  
                  15  TC001-TRN1-FILLER            PIC  X(01).                  
               10  TC001-DTL-TRAN2-RECORD REDEFINES                             
                                          TC001-MAF-FILLER.                     
                  15  TC001-CARDHOLDER-INST-ID     PIC  X(04).                  
                  15  TC001-CARDHOLDER-NETWK-ID    PIC  X(04).                  
                  15  TC001-LOCATOR-NBR            PIC  X(11).                  
                  15  TC001-SIC                    PIC  X(04).                  
                  15  TC001-AUTH-AMT               PIC  9(07)V99.               
                  15  TC001-CASHBACK-AMT           PIC  9(04)V99.               
                  15  TC001-CARDHOLDER-METHOD      PIC  X(01).                  
                  15  TC001-AUTH-SOURCE            PIC  X(01).                  
                  15  TC001-MAIL-PHONE-IND         PIC  X(01).                  
                  15  TC001-CAT-IND                PIC  X(01).                  
                  15  TC001-ACCT-TYPE              PIC  X(03).                  
P10237            15  FILLER                       PIC  X(19).                  
                  15  TC001-TRN2-FILLER            PIC  X(06).                  
               10  TC001-DTL-TRAN3-RECORD REDEFINES                             
                                       TC001-MAF-FILLER.                        
                  15  TC001-EMPLOYEE-NBR           PIC  X(09).                  
                  15  TC001-CURRENCY-CDE           PIC  9(03).                  
                  15  TC001-TRAN-QUAL              PIC  X(03).                  
                  15  TC001-POS-COND-CDE           PIC  X(02).                  
                  15  TC001-AUTH-CHAR-IND          PIC  X(01).                  
                  15  TC001-INT-REIMBURSE-FEE-LVL  PIC  9(02).                  
                  15  TC001-INT-REIMBURSE-FEE-AMT  PIC  9(05)V99.               
                  15  TC001-INT-ADJ-RSN-CDE        PIC  X(02).                  
                  15  TC001-INT-ADJ-RSN-AMT        PIC  9(05)V99.               
                  15  TC001-INT-ADJ-SIGN           PIC  X(01).                  
                  15  TC001-AVS-RESP-CDE           PIC  X(01).                  
                  15  TC001-NETWK-RESP-SW          PIC  X(01).                  
                  15  TC001-NETWK-VISA-FIELDS.                                  
                      20  TC001-VISA-TRAN-ID       PIC  X(15).                  
                      20  TC001-VISA-VALID-CDE     PIC  X(04).                  
                      20  TC001-VISA-AUTH-RESP-CDE PIC  X(02).                  
                  15  TC001-NETWK-MSTR-FIELDS REDEFINES                         
                          TC001-NETWK-VISA-FIELDS.                              
                      20  TC001-MSTR-REF-NBR       PIC  X(09).                  
                      20  TC001-MSTR-STTLMT-DTE    PIC  X(04).                  
                      20  TC001-MSTR-RESERVED      PIC  X(08).                  
                  15  TC001-TRN3-FILLER            PIC  X(10).                  
               10  TC001-DTL-TRAN4-RECORD REDEFINES                             
                                          TC001-MAF-FILLER.                     
                  15  TC001-TYP-REF-NBR           PIC X(01).                    
                  15  TC001-MPS-REF-NBR           PIC X(36).                    
                  15  TC001-TRN4-FILLER           PIC X(33).                    
               10  TC001-DTL-BATCH-TRAIL-RECORD REDEFINES                       
                                       TC001-MAF-FILLER.                        
                  15  TC001-BTCH-SEQ-NBR           PIC  9(05).                  
                  15  TC001-NBR-DEBIT-SLS-TRAN     PIC  9(06).                  
                  15  TC001-DOL-DEBIT-SLS-TRAN     PIC  9(07)V99.               
                  15  TC001-NBR-CREDIT-SLS-TRAN    PIC  9(06).                  
                  15  TC001-DOL-CREDIT-SLS-TRAN    PIC  9(07)V99.               
                  15  TC001-TOT-CASH-BACK-AMT      PIC  9(07)V99.               
                  15  TC001-NET-AMT                PIC  9(07)V99.               
                  15  TC001-NET-AMT-SIGN           PIC  X(01).                  
                  15  TC001-BTCH-LOG-CNT           PIC  9(07).                  
                  15  TC001-DOL-DEBIT-HIGH-DGT     PIC  9(01).                  
                  15  TC001-DOL-CREDIT-HIGH-DGT    PIC  9(01).                  
                  15  TC001-NET-AMT-HIGH-DGT       PIC  9(01).                  
                  15  TC001-BTCH-TRL-FILLER        PIC  X(06).                  
               10  TC001-RECON-HDR-RECORD REDEFINES                             
                                             TC001-MAF-FILLER.                  
                  15  TC001-RECON-HDR-BTCH-ID      PIC  X(03).                  
                  15  TC001-RECON-BREAKOUT         PIC  X(03).                  
                  15  TC001-ACT-IND                PIC  X(02).                  
                  15  TC001-RECON-HDR-FILLER       PIC  X(62).                  
               10  TC001-RECON1-RECORD REDEFINES                                
                                        TC001-MAF-FILLER.                       
                  15  TC001-RECON1-REC-LVL           PIC  X(02).                
                  15  TC001-SUBMISSION-DTE           PIC  X(04).                
                  15  TC001-SUBMISSION-TME           PIC  X(04).                
                  15  TC001-FILE-DTE                 PIC  X(04).                
                  15  TC001-FILE-TYP                 PIC  X(04).                
                  15  TC001-RECON1-DIV-CDE           PIC  X(03).                
                  15  TC001-RECON1-STR-NBR           PIC  X(04).                
                  15  TC001-RECON1-MERCH-NBR         PIC  X(16).                
                  15  TC001-RECON1-NET-SLS-AMT       PIC  9(09)V99.             
                  15  TC001-RECON1-NET-SLS-SIGN      PIC  X(01).                
                  15  TC001-RECON1-FILLER            PIC  X(08).                
               10  TC001-RECON2-RECORD REDEFINES                                
                                       TC001-MAF-FILLER.                        
                  15  TC001-VISA-MC-SLS-AMT          PIC  X(01).                
                  15  TC001-VISA-MC-SLS-AMT-SIGN     PIC  X(01).                
                  15  TC001-DISC-SLS-AMT-SIGN        PIC  X(01).                
                  15  TC001-DISC-AMT-SIGN            PIC  X(01).                
                  15  TC001-DISC-STTLMT-IND          PIC  X(01).                
                  15  TC001-NON-STTLD-ACT            PIC  9(08)V99.             
                  15  TC001-NON-STTLD-SIGN           PIC  X(01).                
                  15  TC001-CHGBK-ADJ-AMT            PIC  9(08)V99.             
                  15  TC001-CHGBK-ADJ-SIGN           PIC  X(01).                
                  15  TC001-FEE-AMT                  PIC  9(08)V99.             
                  15  TC001-FEE-AMT-SIGN             PIC  X(01).                
                  15  TC001-NET-DEP-AMT              PIC  9(08)V99.             
                  15  TC001-NET-DEP-SIGN             PIC  X(01).                
                  15  TC001-CREDIT-FILLER            PIC X(03).                 
               10  TC001-RECON-TRAILER-RECORD REDEFINES                         
                                       TC001-MAF-FILLER.                        
                  15  TC001-RECONT-BATCH-ID          PIC  X(03).                
                  15  TC001-RECONT-BREAKOUT          PIC  X(03).                
                  15  TC001-RECONT-ACT-IND           PIC  X(02).                
                  15  TC001-RECONT-CNT-REC           PIC  9(07).                
                  15  TC001-RECONT-FILLER            PIC  X(55).                
               10  TC001-TRAILER-RECORD.                                        
                  15  TC001-TRAIL-REC-TYP         PIC  X(01).                   
                  15  TC001-TRAN-COUNT            PIC  9(06).                   
                  15  FILLER                      PIC  X(97).                   
