      ******************************************************************        
      *  DEBIT SETTLEMENT SYSTEM                                       *        
      *                                                                *        
      *  SEQUENTIAL ADJUSTMENT FILE                                    *        
      *  LRECL = 258                                                   *        
      ******************************************************************        
       01  TC005-ADJUSTMENT-FILE.                                               
           10  TC005-STORE-NUMBER      PIC  X(04).                              
           10  TC005-REG-NBR           PIC  X(04).                              
           10  TC005-TRAN-NBR          PIC  X(04).                              
           10  TC005-ORIG-TRAN-DTE     PIC  X(06).                              
           10  TC005-ORIG-TRAN-TM      PIC  X(06).                              
           10  TC005-ORIG-TRANS-AMT    PIC  9(8)V99.                            
           10  TC005-ADJUST-AMT        PIC  S9(8)V99.                           
           10  TC005-ADJUST-TYP        PIC  X(4).                               
               88  TC005-NOTICE          VALUE 'NOT '.                          
               88  TC005-REQUEST         VALUE 'REQ '.                          
               88  TC005-PAYMENT         VALUE 'PAY '.                          
           10  TC005-STTLMNT-DATE      PIC  X(06).                              
           10  TC005-ADJ-REASON        PIC  X(03).                              
           10  TC005-ADJ-NBR           PIC  X(12).                              
           10  TC005-TRAN-DISP         PIC  X(03).                              
               88  TC005-NEW-ITEM        VALUE '100'.                           
               88  TC005-DELETE          VALUE '101'.                           
               88  TC005-UPDATE          VALUE '102'.                           
               88  TC005-REMINDER        VALUE '103'.                           
               88  TC005-AUTH-PAYMENT    VALUE '110'.                           
               88  TC005-REQ-PAY-FORCE   VALUE '111'.                           
               88  TC005-REQ-PAY-APPR    VALUE '112'.                           
               88  TC005-REQ-PAY-DENIED  VALUE '115'.                           
               88  TC005-ADJ-DEPSI       VALUE '117'.                           
           10  TC005-ORIG-CARD-NBR     PIC  X(19).                              
           10  TC005-PRI-CARD-NBR      PIC  X(19).                              
           10  TC005-ADJ-TIMESTAMP     PIC  X(12).                              
           10  TC005-ORIG-COMMENTS     PIC  X(80).                              
           10  TC005-RECV-COMMENTS     PIC  X(50).                              
           10  TC005-FORCE-STTL-DTE    PIC  X(06).                              
