      ******************************************************************        
      *  DEBIT SETTLEMENT SYSTEM                                       *        
      *                                                                *        
      *  MERCHANT ACTIVITY FILE DATA (MAF)                             *        
      *  LRECL = 80                                                    *        
      ******************************************************************        
       01  TC003-MAF-DATA.                                                      
           05  TC003-STORE-NBR         PIC  9(04).                              
           05  TC003-REG-NBR           PIC  9(04).                              
           05  TC003-TRAN-NBR          PIC  9(04).                              
           05  TC003-SLS-DTE           PIC  X(08).                              
           05  TC003-STRT-TM           PIC  X(6).                               
           05  TC003-TRAN-SEQ-NBR      PIC S9(04).                              
           05  TC003-TRAN-TYPE         PIC  X(02).                              
           05  TC003-TRAN-DISP         PIC  X(01).                              
           05  TC003-CARD-NBR          PIC  X(19).                              
           05  TC003-TRAN-AMT          PIC  S9(7)V99.                           
           05  TC003-TYP-CDE           PIC  X(01).                              
               88  TC003-MAF-REC         VALUE 'M'.                             
               88  TC003-ADJ-REC         VALUE 'A'.                             
           05  TC003-ADJ-DISP          PIC  X(03).                              
               88  TC003-NOT-ADJ         VALUE '   '.                           
               88  TC003-NEW-ITEM        VALUE '100'.                           
               88  TC003-DELETE          VALUE '101'.                           
               88  TC003-UPDATE          VALUE '102'.                           
               88  TC003-REMINDER        VALUE '103'.                           
               88  TC003-AUTH-PAY        VALUE '110'.                           
               88  TC003-REQ-PAY-FORCE   VALUE '111'.                           
               88  TC003-REQ-PAY-APPR    VALUE '112'.                           
               88  TC003-REQ-PAY-DENIED  VALUE '115'.                           
               88  TC003-ADJ-DEPSI       VALUE '117'.                           
           05  TC003-RESPONSE-CDE      PIC  9(03).                              
           05  TC003-STATE-CDE         PIC  X(02).                              
           05  TC003-STORE-NAME-ABBR   PIC  X(10).                              
