      ******************************************************************        
      *  DEBIT SETTLEMENT SYSTEM                                       *        
      *                                                                *        
      *  MATCHED ADJUSTMENTS FROM TCKUT004                             *        
      *  LRECL = 100                                                   *        
      ******************************************************************        
       01  TC006-DATA.                                                          
           05  TC006-STR-NBR           PIC  9(04).                              
           05  TC006-RGST-ID           PIC  9(04).                              
           05  TC006-TRN-NBR           PIC  9(04).                              
           05  TC006-STRT-TIME         PIC  X(08).                              
           05  TC006-SLS-CORR-SEQ-NBR  PIC  9(04).                              
           05  TC006-TNDR-SEQ-NBR      PIC  9(04).                              
           05  TC006-SLS-DTE           PIC  X(10).                              
           05  TC006-CARD-NBR          PIC  X(19).                              
           05  FILLER                  PIC  X(43).                              
