      ******************************************************************        
      *  DEBIT SETTLEMENT SYSTEM                                       *        
      *                                                                *        
      *  FIFTH THIRD'S ADJUSTMENT FILE - VERSION A                     *        
      *  LRECL = 320                                                   *        
      ******************************************************************        
P10237* DATE:        04/22/2015                                        *        
P10237* WR/IR#:      CHG0104429                                        *        
P10237* PROGRAMMER:  COGNIZANT                                         *        
P10237* DESCRIPTION: FOLLOWING FIELDS ARE REPLACED WITH FILLER AS PART *        
P10237*              OF COSA DATA SECURITY PROJECT. CHANGES ARE TAGGED *        
P10237*              AS P10237.                                        *        
P10237*              1. TC004-TDTL-ORIG-ACCT-NBR                       *        
P10237*              2. TC004-TDDA-PRIMARY-ACCT                        *        
P10237*              3. TC004-TDDA-FROM-ACCT-NBR                       *        
P10237*              4. TC004-TDDA-TO-ACCT-NBR                         *        
P10237*              5. TC004-MACT-ACCT-NBR                            *        
P10237******************************************************************        
       01  TC004-ADJUSTMENT-DATA.                                               
           05  TC004-ADJ-FILE.                                                  
               10  TC004-FILLER                    PIC  X(04).                  
               10  TC004-ADJ-FILE-FORMAT           PIC  X(02).                  
                   88  TC004-REC-FORMAT       VALUE 'SW'.                       
                   88  TC004-TDTL-RECF        VALUE 'TD'.                       
                   88  TC004-DIIA-RECF        VALUE 'DI'.                       
                   88  TC004-TSIA-RECF        VALUE 'CI'.                       
                   88  TC004-FAIA-RECF        VALUE 'FI'.                       
                   88  TC004-SIAR-RECF        VALUE 'SI'.                       
                   88  TC004-MACT-RECF        VALUE 'MR'.                       
                   88  TC004-RDAC-RECF        VALUE 'TD'.                       
                   88  TC004-RACT-RECF        VALUE 'RR'.                       
                   88  TC004-AFEO-RECF        VALUE 'SA'.                       
                   88  TC004-AFCN-RECF        VALUE 'SA'.                       
               10  TC004-ADJ-RECORD-TYPE           PIC  X(02).                  
                   88  TC004-REC-TYPE         VALUE 'FH'.                       
                   88  TC004-TDTL-RECT        VALUE 'AD'.                       
                   88  TC004-TDAA-RECT        VALUE 'A2'.                       
                   88  TC004-TDAA-INTERCEPT   VALUE 'IN'.                       
                   88  TC004-TDAA-PROCESSOR   VALUE 'PR'.                       
                   88  TC004-TDAA-DEV-PROV    VALUE 'DR'.                       
                   88  TC004-TDAA-INTERCEPT   VALUE 'IN'.                       
                   88  TC004-TDAA-PROCESSOR   VALUE 'PR'.                       
                   88  TC004-TSIA-INTERCEPT   VALUE 'IN'.                       
                   88  TC004-TSIA-PROCESSOR   VALUE 'PR'.                       
                   88  TC004-FAIA-PROCESSOR   VALUE 'PR'.                       
                   88  TC004-SIAR-INTERCEPT   VALUE 'IN'.                       
                   88  TC004-SIAR-PROCESSOR   VALUE 'PR'.                       
                   88  TC004-SIAR-DEBIT       VALUE 'DB'.                       
                   88  TC004-SIAR-CREDIT      VALUE 'CR'.                       
                   88  TC004-MACT-HOST-DTL    VALUE 'DT'.                       
                   88  TC004-MACT-EXT-DTL     VALUE 'EX'.                       
                   88  TC004-MACT-SUM-CRD     VALUE 'SR'.                       
                   88  TC004-RDAC-WR          VALUE 'WR'.                       
                   88  TC004-RACT-WR          VALUE 'IN'.                       
                   88  TC004-AFEO-CR          VALUE 'EF'.                       
                   88  TC004-AFCN-CR          VALUE 'CR'.                       
               10  TC004-ADJ-FILLER                PIC  X(312).                 
               10  TC004-ACTIVITY-FILE-HEADER                                   
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-FILE-CREATE-DTE       PIC  X(06).                  
                   15  TC004-FILE-CREATE-TME       PIC  X(06).                  
                   15  TC004-IMED-DEST             PIC  X(04).                  
                   15  TC004-DEST-RT               PIC  X(10).                  
                   15  TC004-IMED-ORIGIN           PIC  X(04).                  
                   15  TC004-ORIG-RT               PIC  X(10).                  
                   15  TC004-BLANK-SP              PIC  X(272).                 
               10  TC004-TRAN-DETAIL-ADJ-RECORD                                 
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-TDTL-SORT-INST        PIC  X(04).                  
                   15  TC004-TDTL-DTE-CLOSED       PIC  X(06).                  
                   15  TC004-TDTL-TRAN-TYPE        PIC  X(02).                  
                       88  DEPOSIT-ADJ-CREDIT           VALUE '20'.             
                       88  DEPOSIT-ADJ-DEBIT            VALUE '22'.             
                       88  POS-ADJ-CREDIT               VALUE '24'.             
                       88  POS-ADJ-DEBIT                VALUE '25'.             
                       88  CASH-ADJ-CREDIT              VALUE '26'.             
                       88  CASH-ADJ-DEBIT               VALUE '27'.             
                       88  NON-MONETARY-NOTE            VALUE '60'.             
                   15  TC004-TDTL-ORIG-AMT         PIC  9(8)V99.                
                   15  TC004-TDTL-ACT-AMT          PIC  9(8)V99.                
                   15  TC004-TDTL-TRANS-DISP       PIC  X(02).                  
                   15  TC004-TDTL-INTERCEPT-ID     PIC  X(04).                  
                   15  TC004-TDTL-ADJUST-DIFF      PIC  9(10).                  
                   15  TC004-TDTL-PROCESSOR-ID     PIC  X(04).                  
                   15  TC004-TDTL-ORIGINATOR       PIC  X(04).                  
                   15  TC004-TDTL-RECEIVER         PIC  X(04).                  
                   15  TC004-TDTL-BLANK            PIC  X(02).                  
                   15  TC004-TDTL-OWNER-ID         PIC  X(04).                  
                   15  TC004-TDTL-ADJ-TYP          PIC  X(04).                  
                   15  TC004-TDTL-ORIG-TRN-DTE     PIC  X(06).                  
                   15  TC004-TDTL-CARD-INST        PIC  X(04).                  
                   15  TC004-TDTL-ERROR-CDE        PIC  X(03).                  
                   15  TC004-TDTL-AUTO-PASS-FLG    PIC  X(01).                  
                   15  TC004-TDTL-TRAN-TME         PIC  X(06).                  
                   15  TC004-TDTL-PRI-ACCT-NBR     PIC  X(19).                  
                   15  TC004-TDTL-ADJ-TERMINAL     PIC  X(06).                  
                   15  TC004-TDTL-ADJ-TMESTMP      PIC  X(12).                  
                   15  TC004-TDTL-TERM-SEQ-NBR     PIC  X(06).                  
                   15  TC004-TDTL-ADJ-REASON       PIC  X(03).                  
                   15  TC004-TDTL-ADJ-NBR          PIC  X(12).                  
                   15  TC004-TDTL-TRAN-DISP-QUAL   PIC  X(03).                  
                   15  TC004-TDTL-TIMES-REMINDED   PIC  X(01).                  
                   15  TC004-TDTL-ORIG-TRAN-ACCT-TYPE  PIC  X(03).              
P10237             15  FILLER                      PIC  X(19).                  
                   15  TC004-TDTL-ORIG-COMMENTS    PIC  X(80).                  
                   15  TC004-TDTL-RECV-COMMENTS    PIC  X(50).                  
                   15  TC004-TDTL-FORCE-STTL-DTE   PIC  X(06).                  
                   15  TC004-TDTL-BLANK1           PIC  X(02).                  
               10  TC004-TRAN-DETAIL-ADJ-ADD-REC                                
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-TDAA-SORT-INST        PIC  X(04).                  
                   15  TC004-TDAA-NETWORK-ID       PIC  X(04).                  
                   15  TC004-TDAA-ZEROES           PIC  X(05).                  
                   15  TC004-TDAA-TERM-STREET      PIC  X(27).                  
                   15  TC004-TDAA-TERM-CITY        PIC  X(15).                  
                   15  TC004-TDAA-TERM-STATE       PIC  X(02).                  
                   15  TC004-TDAA-SEC-TERM-OWNER   PIC X(04).                   
                   15  TC004-TDAA-SEC-CARDHOLD     PIC X(04).                   
                   15  TC004-TDAA-ZEROES1          PIC X(09).                   
                   15  TC004-TDAA-ADJ-TERM-NBR     PIC X(15).                   
                   15  TC004-TDAA-ZEROES2          PIC X(06).                   
                   15  TC004-TDAA-BLANK            PIC X(16).                   
                   15  TC004-TDAA-BLANK1           PIC X(25).                   
                   15  TC004-TDAA-ADJ-NBR          PIC X(12).                   
                   15  TC004-TDAA-BLANK2           PIC X(02).                   
                   15  TC004-TDAA-ORIG-TRAN-TYP    PIC X(02).                   
                   15  TC004-TDAA-BLANK3           PIC X(160).                  
               10  TC004-TRAN-DETAIL-ACT-REC                                    
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-TDDA-SORT-INST        PIC  X(04).                  
                   15  TC004-TDDA-STTLMT-DTE       PIC  X(06).                  
                   15  TC004-TDDA-TRAN-TYP         PIC  X(02).                  
                   15  TC004-TDDA-TRAN-AMT         PIC  9(10).                  
                   15  TC004-TDDA-STTLMT-AMT       PIC  9(10).                  
                   15  TC004-TDDA-TRAN-DISP        PIC  X(02).                  
                   15  TC004-TDDA-INTERCEPT-ID     PIC  X(04).                  
                   15  TC004-TDDA-INTERCEPT-CDE    PIC  X(01).                  
                   15  TC004-TDDA-INTERCEPT-DATA   PIC  X(09).                  
                   15  TC004-TDDA-PROCESSOR-ID     PIC  X(04).                  
                   15  TC004-TDDA-PROCESSOR-CDE    PIC  X(01).                  
                   15  TC004-TDDA-PROCESSOR-DATA   PIC  X(09).                  
                   15  TC004-TDDA-OWNER-ID         PIC  X(04).                  
                   15  TC004-TDDA-OWNER-CDE        PIC  X(01).                  
                   15  TC004-TDDA-OWNER-DATA       PIC  X(09).                  
                   15  TC004-TDDA-CARDHOLDER-INST  PIC  X(04).                  
                   15  TC004-TDDA-CARDHOLDER-CODE  PIC  X(01).                  
                   15  TC004-TDDA-CARDHOLDER-DATA  PIC  X(09).                  
P10237             15  FILLER                      PIC  X(19).                  
                   15  TC004-TDDA-SURCHG-AMT       PIC  9(05).                  
                   15  TC004-TDDA-SURCHG-AMT-SIGN  PIC  X(01).                  
                   15  TC004-TDDA-TIMESTAMP        PIC  X(12).                  
                   15  TC004-TDDA-TERM-SEQ-NBR     PIC  X(06).                  
                   15  TC004-TDDA-TERM-LOC         PIC  X(44).                  
                   15  TC004-TDDA-TERM-TYPE        PIC  X(02).                  
                   15  TC004-TDDA-RESP-CDE         PIC  X(03).                  
                   15  TC004-TDDA-CARD-DISP        PIC  X(01).                  
                   15  TC004-TDDA-FROM-ACCT-TYP    PIC  X(03).                  
                   15  TC004-TDDA-TO-ACCT-TYP      PIC  X(03).                  
P10237             15  FILLER                      PIC  X(19).                  
P10237             15  FILLER                      PIC  X(19).                  
                   15  TC004-TDDA-MSG-SEQ-NBR      PIC  X(06).                  
                   15  TC004-TDDA-CRD-MEM-NBR      PIC  X(01).                  
                   15  TC004-TDDA-RESV1            PIC  X(05).                  
                   15  TC004-TDDA-TERM-CUTOFF-DTE  PIC  X(06).                  
                   15  TC004-TDDA-STTLMT           PIC  X(01).                  
                   15  TC004-TDDA-PROC-CUTOFF-DTE  PIC  X(06).                  
                   15  TC004-TDDA-MERCHANT-NME     PIC  X(20).                  
                   15  TC004-TDDA-TRAN-INTR-FEE    PIC  X(04).                  
                   15  TC004-TDDA-TRAN-INTR-FEE-S  PIC  X(01).                  
                   15  TC004-TDDA-FEE-ASSESS-AMT   PIC  9(2)V99.                
                   15 TC004-TDDA-FEE-ASSESS-S      PIC  X(01).                  
                   15 TC004-TDDA-TRAN-AUTH-CDE     PIC  X(02).                  
                   15 TC004-TDDA-NETWORK-ID        PIC  X(04).                  
                   15 TC004-TDDA-SWITCH-DTE-S      PIC  X(09).                  
                   15 TC004-TDDA-TERMINAL-NBR      PIC  X(15).                  
               10  TC004-DAILY-INTER-INFO-ACT-REC                               
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-DIIA-SORT-INST        PIC  X(04).                  
                   15  TC004-DIIA-STTLMNT-DTE      PIC  X(06).                  
                   15  TC004-DIIA-TRAN-TYP         PIC  X(02).                  
                   15  TC004-DIIA-TOT-AMT          PIC  X(10).                  
                   15  TC004-DIIA-TOT-AMT-SIGN     PIC  X(01).                  
                   15  TC004-DIIA-APPR-AMT         PIC  X(10).                  
                   15  TC004-DIIA-APPR-SIGN        PIC  X(01).                  
                   15  TC004-DIIA-DENIED-AMT       PIC  X(10).                  
                   15  TC004-DIIA-DENIED-SIGN      PIC  X(01).                  
                   15  TC004-DIIA-RESV2            PIC  X(267).                 
               10  TC004-TRAN-SUR-INFO-ACT-REC                                  
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-TSIA-SORT-INST        PIC  X(04).                  
                   15  TC004-TSIA-STTLMNT-DTE      PIC  X(06).                  
                   15  TC004-TSIA-TRAN-TYP         PIC  X(02).                  
                   15  TC004-TSIA-TOT-AMT          PIC  X(10).                  
                   15  TC004-TSIA-TOT-AMT-SIGN     PIC  X(01).                  
                   15  TC004-TSIA-APPR-AMT         PIC  X(10).                  
                   15  TC004-TSIA-APPR-SIGN        PIC  X(01).                  
                   15  TC004-TSIA-DENIED-AMT       PIC  X(10).                  
                   15  TC004-TSIA-DENIED-SIGN      PIC  X(01).                  
                   15  TC004-TSIA-RESV1            PIC  X(267).                 
               10  TC004-FEE-ASSESS-INFO-ACT-REC                                
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-FAIA-SORT-INST        PIC  X(04).                  
                   15  TC004-FAIA-STTLMNT-DTE      PIC  X(06).                  
                   15  TC004-FAIA-TRAN-TYP         PIC  X(02).                  
                   15  TC004-FAIA-TOT-AMT          PIC  X(10).                  
                   15  TC004-FAIA-TOT-AMT-SIGN     PIC  X(01).                  
                   15  TC004-FAIA-APPR-AMT         PIC  X(10).                  
                   15  TC004-FAIA-APPR-SIGN        PIC  X(01).                  
                   15  TC004-FAIA-DENIED-AMT       PIC  X(10).                  
                   15  TC004-FAIA-DENIED-SIGN      PIC  X(01).                  
                   15  TC004-FAIA-RESV1            PIC  X(267).                 
               10  TC004-STTLMNT-INFO-ACT-REC                                   
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-SIAR-SORT-INST        PIC  X(04).                  
                   15  TC004-SIAR-STTLMNT-DTE      PIC  X(06).                  
                   15  TC004-SIAR-TRAN-TYP         PIC  X(02).                  
                   15  TC004-SIAR-AMT              PIC  9(8)V99.                
                   15  TC004-SIAR-RESV1            PIC  X(290).                 
               10  TC004-MERCHANT-ACT-REC                                       
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-MACT-SORT-INST        PIC  X(04).                  
                   15  TC004-MACT-STTLMNT-DTE      PIC  X(06).                  
                   15  TC004-MACT-TRAN-TYP         PIC  X(02).                  
                   15  TC004-MACT-TRAN-AMT         PIC  9(8)V99.                
                   15  TC004-MACT-MERCH-RT         PIC  X(09).                  
P10237             15  FILLER                      PIC  X(17).                  
                   15  TC004-MACT-ACCT-NME         PIC  X(16).                  
                   15  TC004-MACT-ACCT-CDE         PIC  X(01).                  
                   15  TC004-MACT-SUPP-INFO        PIC  X(19).                  
                   15  TC004-MACT-MERCH-NBR        PIC  X(07).                  
                   15  TC004-MACT-RESV1            PIC  X(221).                 
               10  TC004-RPT-DTE-ACT-REC                                        
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-MACT-IMED-DEST        PIC  X(04).                  
                   15  TC004-MACT-SEQ-RPT1         PIC  X(04).                  
                   15  TC004-MACT-CNTL-CARR1       PIC  X(01).                  
                   15  TC004-MACT-RPT-LNE1         PIC  X(132).                 
                   15  TC004-MACT-SEQ-RPT2         PIC  X(04).                  
                   15  TC004-MACT-CNTL-CARR2       PIC  X(01).                  
                   15  TC004-MACT-RPT-LNE2         PIC  X(132).                 
                   15  TC004-MACT-RESV1            PIC  X(34).                  
               10  TC004-REC-ACT-REC                                            
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-RACT-IMED-DEST        PIC  X(04).                  
                   15  TC004-RACT-STTLMNT-DTE      PIC  X(06).                  
                   15  TC004-RACT-TRAN-TYP         PIC  X(02).                  
                   15  TC004-RACT-TRAN-AMT         PIC  X(10).                  
                   15  TC004-RACT-REC-TYP          PIC  X(03).                  
                   15  TC004-RACT-TERM-TYP         PIC  X(02).                  
                   15  TC004-RACT-CURR-CDE         PIC  X(03).                  
                   15  TC004-RACT-MEDIA            PIC  X(01).                  
                   15  TC004-RACT-RESV1            PIC  X(02).                  
                   15  TC004-RACT-TERM-NBR         PIC  X(15).                  
                   15  TC004-RACT-RESV2            PIC  X(264).                 
               10  TC004-ACT-FILE-CNTL-REC                                      
                                         REDEFINES TC004-ADJ-FILLER.            
                   15  TC004-AFCN-REC-CNT          PIC  X(10).                  
                   15  TC004-AFCN-TOT-AMT          PIC  X(12).                  
                   15  TC004-AFCN-RESV1            PIC  X(290).                 
               10  TC004-ACT-FILE-EOF-REC                                       
                                         REDEFINES TC004-ADJ-FILLER.            
                   15 TC004-AFEO-RESV1             PIC  X(10).                  
                   15 TC004-AFEO-RESV2             PIC  X(302).                 
