*          DATA SET TFKM421    AT LEVEL 001 AS OF 09/19/96              00001**1
        PRINT  NOGEN                                                    00002   
TFKM421   DFHMSD TYPE=&SYSPARM,                                        X00003**1
               CTRL=(FREEKB),                                          X00004**1
               TERM=3270-2,                                            X00005**1
               LANG=COBOL,                                             X00006**1
               MODE=INOUT,                                             X00007**1
               TIOAPFX=YES,                                            X00008**1
               STORAGE=AUTO                                             00009**1
**************                                                          00009   
TF421A    DFHMDI LINE=2,                                               X00010**1
               COLUMN=1,                                               X00011**1
               MAPATTS=(COLOR,HILIGHT),                                X00012**1
               SIZE=(19,80),                                           X00013**1
               DSATTS=(COLOR,HILIGHT)                                   00014**1
**************                                                          00015   
          DFHMDF POS=(01,02),                                          X00016**4
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TRANSFER TYPE:'                                 00017**3
ATRTYPE   DFHMDF POS=(01,17),                                          X00018**7
               LENGTH=36,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00019   
          DFHMDF POS=(02,51),                                          X00016**4
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='ITEM'                                           00024   
ASTRTIT   DFHMDF POS=(02,56),                                          X00018**7
               LENGTH=05,                                              X00028   
               ATTRB=(NUM,UNPROT,NORM),                                X00026   
               COLOR=GREEN,                                            X00019   
               HILIGHT=UNDERLINE,                                      X00020   
               PICOUT='ZZZZ9'                                           00021   
          DFHMDF POS=(02,62),                                          X00022**3
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TO'                                             00024   
AENDIT    DFHMDF POS=(02,65),                                          X00025**3
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00026   
               PICOUT='ZZZZ9'                                           00027   
          DFHMDF POS=(02,71),                                          X00028**3
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00029   
               INITIAL='OF'                                             00030   
ATOTIT    DFHMDF POS=(02,74),                                          X00031**3
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00032   
               PICOUT='ZZZZ9'                                           00033   
          DFHMDF POS=(03,04),                                          X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               INITIAL='TRANSFER',                                     X00027   
               COLOR=NEUTRAL                                            00032   
          DFHMDF POS=(03,32),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               INITIAL='TRN',                                          X00027   
               COLOR=NEUTRAL                                            00032   
          DFHMDF POS=(03,38),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               INITIAL='REC',                                          X00027   
               COLOR=NEUTRAL                                            00032   
ALHDL1    DFHMDF POS=(03,42),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL                                            00032   
          DFHMDF POS=(04,02),                                          X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               INITIAL='S NUMBER',                                     X00027   
               COLOR=NEUTRAL                                            00032   
          DFHMDF POS=(04,16),                                          X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               INITIAL='ST  DATE',                                     X00027   
               COLOR=NEUTRAL                                            00032   
          DFHMDF POS=(04,32),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
          DFHMDF POS=(04,38),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
ALHDL2    DFHMDF POS=(04,42),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL                                            00032   
*                                                                               
ASEL01    DFHMDF POS=(05,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR01  DFHMDF POS=(05,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS01 DFHMDF POS=(05,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE01   DFHMDF POS=(05,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY01 DFHMDF POS=(05,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY01 DFHMDF POS=(05,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC01   DFHMDF POS=(05,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL02    DFHMDF POS=(06,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR02  DFHMDF POS=(06,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS02 DFHMDF POS=(06,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE02   DFHMDF POS=(06,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY02 DFHMDF POS=(06,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY02 DFHMDF POS=(06,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC02   DFHMDF POS=(06,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL03    DFHMDF POS=(07,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR03  DFHMDF POS=(07,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS03 DFHMDF POS=(07,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE03   DFHMDF POS=(07,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY03 DFHMDF POS=(07,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY03 DFHMDF POS=(07,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC03   DFHMDF POS=(07,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL04    DFHMDF POS=(08,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR04  DFHMDF POS=(08,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS04 DFHMDF POS=(08,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE04   DFHMDF POS=(08,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY04 DFHMDF POS=(08,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY04 DFHMDF POS=(08,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC04   DFHMDF POS=(08,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL05    DFHMDF POS=(09,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR05  DFHMDF POS=(09,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS05 DFHMDF POS=(09,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE05   DFHMDF POS=(09,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY05 DFHMDF POS=(09,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY05 DFHMDF POS=(09,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC05   DFHMDF POS=(09,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL06    DFHMDF POS=(10,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR06  DFHMDF POS=(10,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS06 DFHMDF POS=(10,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE06   DFHMDF POS=(10,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY06 DFHMDF POS=(10,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY06 DFHMDF POS=(10,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC06   DFHMDF POS=(10,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL07    DFHMDF POS=(11,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR07  DFHMDF POS=(11,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS07 DFHMDF POS=(11,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE07   DFHMDF POS=(11,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY07 DFHMDF POS=(11,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY07 DFHMDF POS=(11,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC07   DFHMDF POS=(11,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL08    DFHMDF POS=(12,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR08  DFHMDF POS=(12,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS08 DFHMDF POS=(12,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE08   DFHMDF POS=(12,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY08 DFHMDF POS=(12,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY08 DFHMDF POS=(12,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC08   DFHMDF POS=(12,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL09    DFHMDF POS=(13,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR09  DFHMDF POS=(13,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS09 DFHMDF POS=(13,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE09   DFHMDF POS=(13,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY09 DFHMDF POS=(13,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY09 DFHMDF POS=(13,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC09   DFHMDF POS=(13,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL10    DFHMDF POS=(14,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR10  DFHMDF POS=(14,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS10 DFHMDF POS=(14,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE10   DFHMDF POS=(14,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY10 DFHMDF POS=(14,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY10 DFHMDF POS=(14,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC10   DFHMDF POS=(14,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL11    DFHMDF POS=(15,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR11  DFHMDF POS=(15,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS11 DFHMDF POS=(15,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE11   DFHMDF POS=(15,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY11 DFHMDF POS=(15,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY11 DFHMDF POS=(15,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC11   DFHMDF POS=(15,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL12    DFHMDF POS=(16,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR12  DFHMDF POS=(16,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS12 DFHMDF POS=(16,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE12   DFHMDF POS=(16,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY12 DFHMDF POS=(16,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY12 DFHMDF POS=(16,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC12   DFHMDF POS=(16,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL13    DFHMDF POS=(17,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR13  DFHMDF POS=(17,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS13 DFHMDF POS=(17,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE13   DFHMDF POS=(17,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY13 DFHMDF POS=(17,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY13 DFHMDF POS=(17,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC13   DFHMDF POS=(17,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL14    DFHMDF POS=(18,02),                                          X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT),                                         X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AXFRNR14  DFHMDF POS=(18,04),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS14 DFHMDF POS=(18,16),                                          X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE14   DFHMDF POS=(18,20),                                          X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATRNQTY14 DFHMDF POS=(18,31),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
ARECQTY14 DFHMDF POS=(18,37),                                          X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE,                                             X00056   
               PICOUT='ZZZZ9'                                           00027   
AMISC14   DFHMDF POS=(18,43),                                          X00029   
               LENGTH=37,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ATOTSTITL DFHMDF POS=(19,21),                                          X00029   
               LENGTH=9,                                               X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL                                            00032   
ATRNQYTOT DFHMDF POS=(19,31),                                          X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARECQYTOT DFHMDF POS=(19,38),                                          X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AXFRETTOT DFHMDF POS=(19,45),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARCRETTOT DFHMDF POS=(19,57),                                          X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
**************                                                          00268   
         DFHMSD TYPE=FINAL                                              00269   
**************                                                          00270   
         END                                                            00271   
