        PRINT  NOGEN                                                    00002   
TFKM454   DFHMSD TYPE=&SYSPARM,                                        X00003**1
               CTRL=(FREEKB),                                          X00004**1
               TERM=3270-2,                                            X00005**1
               LANG=COBOL,                                             X00006**1
               MODE=INOUT,                                             X00007**1
               TIOAPFX=YES,                                            X00008**1
               STORAGE=AUTO                                             00009**1
**************                                                          00009   
TF454A    DFHMDI LINE=2,                                               X00010**1
               COLUMN=1,                                               X00011**1
               MAPATTS=(COLOR,HILIGHT),                                X00012**1
               SIZE=(19,80),                                           X00013**1
               DSATTS=(COLOR,HILIGHT)                                   00014**1
**************                                                          00015   
          DFHMDF POS=(01,02),                                          X00016**4
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='RECV STORE.:'                                   00017**3
ARCVSTR   DFHMDF POS=(01,15),                                          X00016**4
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00023   
          DFHMDF POS=(02,02),                                          X00016**4
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TRANSFER NO:'                                   00017**3
AXFERNO   DFHMDF POS=(02,15),                                          X00018**7
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00019   
          DFHMDF POS=(02,30),                                          X00016**4
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='TO STORE:'                                      00017**3
ATOSTR    DFHMDF POS=(02,40),                                          X00016**4
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00023   
          DFHMDF POS=(04,01),LENGTH=79,ATTRB=(ASKIP,BRT),              C00022**3
               COLOR=YELLOW,                                           C00023   
               INITIAL='**** BE SURE THERE ARE NO RF GUNS RECEIVING THIC00024   
               S TRANSFER BEFORE YOU RESET ****'                        00024   
*                                                                               
**************                                                          00268   
         DFHMSD TYPE=FINAL                                              00269   
**************                                                          00270   
         END                                                            00271   
