          PRINT  NOGEN                                                  00002**1
TFKM433   DFHMSD TYPE=&SYSPARM,                                        X00003**1
               CTRL=(FREEKB),                                          X00004**1
               TERM=3270-2,                                            X00005**1
               LANG=COBOL,                                             X00006**1
               MODE=INOUT,                                             X00007**1
               TIOAPFX=YES,                                            X00008**1
               STORAGE=AUTO                                             00009**1
TF433A    DFHMDI LINE=2,                                               X00010**1
               COLUMN=1,                                               X00011**1
               MAPATTS=(COLOR,HILIGHT),                                X00012**1
               SIZE=(15,80),                                           X00013**1
               DSATTS=(COLOR,HILIGHT)                                   00014**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='ORDER',                                        X00028**1
               POS=(2,2),                                              X00030**1
               LENGTH=05                                                00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='CRITERIA LISTINGS',                            X00028**1
               POS=(2,9),                                              X00030**1
               LENGTH=17                                                00031**1
ASXFRTYP  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(3,4),                                              X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(3,6),                                              X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='TRANSFER TYPE......:',                         X00028**1
               POS=(3,9),                                              X00030**1
               LENGTH=20                                                00031**1
AXFRTYP   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(3,30),                                             X00036**1
               LENGTH=2                                                 00037**1
AXFRTYPD  DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(3,33),                                             X00241**1
               LENGTH=20                                                00242**1
ASXFRSTA  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(4,4),                                              X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(4,6),                                              X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='TRANSFER STATUS....:',                         X00028**1
               POS=(4,9),                                              X00030**1
               LENGTH=20                                                00031**1
AXFRSTA   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(4,30),                                             X00036**1
               LENGTH=2                                                 00037**1
AXFRSTAD  DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(4,33),                                             X00241**1
               LENGTH=20                                                00242**1
ASFRSTOR  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(05,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(05,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='FROM STORE.........:',                         X00028**1
               POS=(05,9),                                             X00030**1
               LENGTH=20                                                00031**1
AFRSTOR   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(05,30),                                            X00036**1
               LENGTH=4                                                 00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(05,35),                                            X00040**1
               LENGTH=1                                                 00041**1
ASTOSTOR  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(06,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(06,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='TO   STORE.........:',                         X00028**1
               POS=(06,9),                                             X00030**1
               LENGTH=20                                                00031**1
ATOSTOR   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(06,30),                                            X00036**1
               LENGTH=4                                                 00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(06,35),                                            X00040**1
               LENGTH=1                                                 00041**1
ASCMDTER  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(07,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(07,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='COMPLETE DATE RANGE:',                         X00028**1
               POS=(07,9),                                             X00030**1
               LENGTH=20                                                00031**1
ACMPFDT   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(07,30),                                            X00036**1
               LENGTH=10                                                00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='TO',                                           X00028**1
               POS=(07,41),                                            X00030**1
               LENGTH=2                                                 00031**1
ACMPTDT   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(07,44),                                            X00036**1
               LENGTH=10                                                00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               INITIAL=' ',                                            X00039**1
               POS=(07,55),                                            X00030**1
               LENGTH=1                                                 00031**1
ASRCDTER  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(08,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(08,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='RECEIVE  DATE RANGE:',                         X00028**1
               POS=(08,9),                                             X00030**1
               LENGTH=20                                                00031**1
ARCVFDT   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(08,30),                                            X00036**1
               LENGTH=10                                                00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='TO',                                           X00028**1
               POS=(08,41),                                            X00030**1
               LENGTH=2                                                 00031**1
ARCVTDT   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(08,44),                                            X00036**1
               LENGTH=10                                                00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               INITIAL=' ',                                            X00039**1
               POS=(08,55),                                            X00030**1
               LENGTH=1                                                 00031**1
ASDEPTCL  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(09,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(09,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='D/M/S..............:',                         X00028**1
               POS=(09,9),                                             X00030**1
               LENGTH=20                                                00031**1
ADEPT     DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(09,30),                                            X00036**1
               LENGTH=3                                                 00037**1
ACLASS    DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(09,34),                                            X00036**1
               LENGTH=3                                                 00037**1
ASUBCL    DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(09,38),                                            X00036**1
               LENGTH=3                                                 00037**1
ASUPCNO   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(10,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(10,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='UPC................:',                         X00028**1
               POS=(10,9),                                             X00030**1
               LENGTH=20                                                00031**1
AUPCNO    DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(10,30),                                            X00036**1
               LENGTH=13                                                00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(10,44),                                            X00040**1
               LENGTH=1                                                 00041**1
ASCALLNO  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(11,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(11,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='CALLBACK NO........:',                         X00028**1
               POS=(11,9),                                             X00030**1
               LENGTH=20                                                00031**1
ACALLNO   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(11,30),                                            X00036**1
               LENGTH=4                                                 00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(11,35),                                            X00040**1
               LENGTH=1                                                 00041**1
ASAPPRNO  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(12,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(12,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='APPROVAL NO........:',                         X00028**1
               POS=(12,9),                                             X00030**1
               LENGTH=20                                                00031**1
AAPPRNO   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(12,30),                                            X00036**1
               LENGTH=9                                                 00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(12,40),                                            X00040**1
               LENGTH=1                                                 00041**1
ASCMPBY   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(13,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(13,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='COMPLETED BY.......:',                         X00028**1
               POS=(13,9),                                             X00030**1
               LENGTH=20                                                00031**1
ACMPBYIN  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(13,30),                                            X00036**1
               LENGTH=1                                                 00037**1
ACMPBYNM  DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(13,32),                                            X00241**1
               LENGTH=20                                                00242**1
ASRCVBY   DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(14,4),                                             X00030**1
               LENGTH=1                                                 00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(14,6),                                             X00040**1
               LENGTH=1                                                 00041**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='RECEIVED BY........:',                         X00028**1
               POS=(14,9),                                             X00030**1
               LENGTH=20                                                00031**1
ARCVBYIN  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(14,30),                                            X00036**1
               LENGTH=1                                                 00037**1
ARCVBYNM  DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(14,32),                                            X00241**1
               LENGTH=20                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='DISPLAY TOTALS?....:',                         X00028**1
               POS=(15,9),                                             X00030**1
               LENGTH=20                                                00031**1
ADISPTOT  DFHMDF ATTRB=(ASKIP),                                        X00032**1
               COLOR=BLUE,                                             X00033**1
               POS=(15,30),                                            X00036**1
               LENGTH=1                                                 00037**1
          DFHMDF ATTRB=(ASKIP),                                        X00038**1
               INITIAL=' ',                                            X00039**1
               POS=(15,32),                                            X00040**1
               LENGTH=1                                                 00041**1
         DFHMSD TYPE=FINAL                                              00279**1
         END                                                            00280**1
