        PRINT  NOGEN                                                    00002   
TFKM434 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
TF434A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
AXFRNBR DFHMDF POS=(01,15),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FROM',                                         X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
AFRNBR  DFHMDF POS=(01,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNAME DFHMDF POS=(01,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='NET RETAIL',                                   X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(02,13),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='DISCREPANCY:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
ANETDSC DFHMDF POS=(02,26),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,40),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TO',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(02,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
ATONBR  DFHMDF POS=(02,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONAME DFHMDF POS=(02,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER',                                     X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(03,27),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RECEIVE',                                      X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(03,40),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RECEIVE',                                      X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(03,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
ARCNBR  DFHMDF POS=(03,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARCNAME DFHMDF POS=(03,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIT1   DFHMDF POS=(04,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LG TOTE SEAL 1:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ATSEAL1 DFHMDF POS=(04,18),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARSEAL1 DFHMDF POS=(04,27),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIT2   DFHMDF POS=(05,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LG TOTE SEAL 2:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ATSEAL2 DFHMDF POS=(05,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARSEAL2 DFHMDF POS=(05,27),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIT3   DFHMDF POS=(06,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='SM TOTE SEAL  :',                              X00027   
               COLOR=NEUTRAL                                            00032   
ATSEAL3 DFHMDF POS=(06,18),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARSEAL3 DFHMDF POS=(06,27),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(06,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(06,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**7
               COLOR=GREEN,                                            C00019   
               HILIGHT=UNDERLINE,                                      C00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(06,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(06,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(06,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(06,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
        DFHMDF POS=(07,42),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='--TRANSFER--',                                 X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(07,56),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='--RECEIVED--',                                 X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='S',                                            X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,09),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,12),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='D/M/S     ',                                   X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,25),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='UPC',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,48),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='PRICE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,62),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='PRICE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(08,69),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='VARIANCE',                                     X00027   
               COLOR=NEUTRAL                                            00032   
*                                                                               
ASEL1   DFHMDF POS=(09,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT1   DFHMDF POS=(09,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN1   DFHMDF POS=(09,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS1   DFHMDF POS=(09,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC1   DFHMDF POS=(09,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY1  DFHMDF POS=(09,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC1  DFHMDF POS=(09,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY1  DFHMDF POS=(09,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC1  DFHMDF POS=(09,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR1   DFHMDF POS=(09,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL2   DFHMDF POS=(10,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT2   DFHMDF POS=(10,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN2   DFHMDF POS=(10,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS2   DFHMDF POS=(10,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC2   DFHMDF POS=(10,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY2  DFHMDF POS=(10,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC2  DFHMDF POS=(10,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY2  DFHMDF POS=(10,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC2  DFHMDF POS=(10,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR2   DFHMDF POS=(10,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL3   DFHMDF POS=(11,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT3   DFHMDF POS=(11,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN3   DFHMDF POS=(11,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS3   DFHMDF POS=(11,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC3   DFHMDF POS=(11,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY3  DFHMDF POS=(11,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC3  DFHMDF POS=(11,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY3  DFHMDF POS=(11,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC3  DFHMDF POS=(11,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR3   DFHMDF POS=(11,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL4   DFHMDF POS=(12,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT4   DFHMDF POS=(12,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN4   DFHMDF POS=(12,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS4   DFHMDF POS=(12,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC4   DFHMDF POS=(12,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY4  DFHMDF POS=(12,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC4  DFHMDF POS=(12,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY4  DFHMDF POS=(12,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC4  DFHMDF POS=(12,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR4   DFHMDF POS=(12,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL5   DFHMDF POS=(13,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT5   DFHMDF POS=(13,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN5   DFHMDF POS=(13,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS5   DFHMDF POS=(13,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC5   DFHMDF POS=(13,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY5  DFHMDF POS=(13,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC5  DFHMDF POS=(13,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY5  DFHMDF POS=(13,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC5  DFHMDF POS=(13,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR5   DFHMDF POS=(13,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL6   DFHMDF POS=(14,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT6   DFHMDF POS=(14,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN6   DFHMDF POS=(14,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS6   DFHMDF POS=(14,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC6   DFHMDF POS=(14,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY6  DFHMDF POS=(14,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC6  DFHMDF POS=(14,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY6  DFHMDF POS=(14,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC6  DFHMDF POS=(14,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR6   DFHMDF POS=(14,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL7   DFHMDF POS=(15,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT7   DFHMDF POS=(15,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN7   DFHMDF POS=(15,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS7   DFHMDF POS=(15,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC7   DFHMDF POS=(15,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY7  DFHMDF POS=(15,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC7  DFHMDF POS=(15,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY7  DFHMDF POS=(15,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC7  DFHMDF POS=(15,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR7   DFHMDF POS=(15,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL8   DFHMDF POS=(16,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT8   DFHMDF POS=(16,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN8   DFHMDF POS=(16,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS8   DFHMDF POS=(16,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC8   DFHMDF POS=(16,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY8  DFHMDF POS=(16,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC8  DFHMDF POS=(16,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY8  DFHMDF POS=(16,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC8  DFHMDF POS=(16,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR8   DFHMDF POS=(16,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL9   DFHMDF POS=(17,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT9   DFHMDF POS=(17,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN9   DFHMDF POS=(17,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS9   DFHMDF POS=(17,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC9   DFHMDF POS=(17,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY9  DFHMDF POS=(17,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC9  DFHMDF POS=(17,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY9  DFHMDF POS=(17,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC9  DFHMDF POS=(17,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR9   DFHMDF POS=(17,68),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL10  DFHMDF POS=(18,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT10  DFHMDF POS=(18,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN10  DFHMDF POS=(18,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS10  DFHMDF POS=(18,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC10  DFHMDF POS=(18,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY10 DFHMDF POS=(18,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC10 DFHMDF POS=(18,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY10 DFHMDF POS=(18,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC10 DFHMDF POS=(18,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR10 DFHMDF POS=(18,68),                                             X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL11  DFHMDF POS=(19,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT11  DFHMDF POS=(19,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN11  DFHMDF POS=(19,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS11  DFHMDF POS=(19,12),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC11  DFHMDF POS=(19,24),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY11 DFHMDF POS=(19,41),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC11 DFHMDF POS=(19,45),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY11 DFHMDF POS=(19,55),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC11 DFHMDF POS=(19,59),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AVAR11 DFHMDF POS=(19,68),                                             X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
