        PRINT  NOGEN                                                    00002   
TFKM441 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
TF441A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(02,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
ALITRL1 DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CONTROL NO...:',                               X00027   
               COLOR=NEUTRAL                                            00032   
ACTLNO  DFHMDF POS=(01,17),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(01,41),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TO STORE......:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ATONO   DFHMDF POS=(01,57),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
ATONAM  DFHMDF POS=(01,62),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER TYPE:',                               X00027   
               COLOR=NEUTRAL                                            00032   
AXFRTYP DFHMDF POS=(02,17),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AXFRDSC DFHMDF POS=(02,19),                                            X00029   
               LENGTH=21,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,41),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CONTAINER TYPE:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ACONTYP DFHMDF POS=(02,57),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ACONDSC DFHMDF POS=(02,59),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00009   
TF441B  DFHMDI LINE=4,COLUMN=01,                                       X00010**5
               SIZE=(04,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='COMPLETED BY.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
BCMPINT DFHMDF POS=(01,17),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BCMPNAM DFHMDF POS=(01,19),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF441C  DFHMDI LINE=4,COLUMN=01,                                       X00010**5
               SIZE=(04,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='COMPLETED BY.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
CCMPINT DFHMDF POS=(01,17),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CCMPNAM DFHMDF POS=(01,19),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL=' CALLBACK NO...:',                             X00027   
               COLOR=NEUTRAL                                            00032   
CCBAK   DFHMDF POS=(01,57),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,62),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF441D  DFHMDI LINE=4,COLUMN=01,                                       X00010**5
               SIZE=(04,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='COMPLETED BY.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
DCMPINT DFHMDF POS=(01,17),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
DCMPNAM DFHMDF POS=(01,19),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL=' APPROVAL NO...:',                             X00027   
               COLOR=NEUTRAL                                            00032   
DAPPNO  DFHMDF POS=(01,57),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF441E  DFHMDI LINE=4,COLUMN=01,                                       X00010**5
               SIZE=(04,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='COMPLETED BY.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
ECMPINT DFHMDF POS=(01,17),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
ECMPNAM DFHMDF POS=(01,19),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL=' REQUESTED BY..:',                             X00027   
               COLOR=NEUTRAL                                            00032   
EREQINT DFHMDF POS=(01,57),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
EREQNAM DFHMDF POS=(01,59),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,80),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CUSTOMER NAME:',                               X00027   
               COLOR=NEUTRAL                                            00032   
ECUSNAM DFHMDF POS=(02,17),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,38),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(02,41),                                            X00029   
               LENGTH=17,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CUSTOMER PHONE: (',                            X00027   
               COLOR=NEUTRAL                                            00032   
EPHAREA DFHMDF POS=(02,59),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,63),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL=')-',                                           X00027   
               COLOR=NEUTRAL                                            00032   
EPHEXCH DFHMDF POS=(02,66),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,70),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='-',                                            X00027   
               COLOR=NEUTRAL                                            00032   
EPHNMBR DFHMDF POS=(02,72),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,77),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(03,05),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ADDRESS...:',                                  X00027   
               COLOR=NEUTRAL                                            00032   
EADDR1  DFHMDF POS=(03,17),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,38),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(03,44),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CITY.......:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
ECITY   DFHMDF POS=(03,57),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
EADDR2  DFHMDF POS=(04,17),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,38),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(04,44),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STATE/ZIP..:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
ESTATE  DFHMDF POS=(04,57),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
EZIP    DFHMDF POS=(04,60),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,66),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='-',                                            X00027   
               COLOR=NEUTRAL                                            00032   
EZIPEXT DFHMDF POS=(04,68),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF441F  DFHMDI LINE=4,COLUMN=01,                                       X00010**5
               SIZE=(04,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='COMPLETED BY.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
FCMPINT DFHMDF POS=(01,17),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
FCMPNAM DFHMDF POS=(01,19),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL=' REQUESTED BY..:',                             X00027   
               COLOR=NEUTRAL                                            00032   
FREQINT DFHMDF POS=(01,57),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
FREQNAM DFHMDF POS=(01,59),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,80),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ATTENTION TO.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
FATNINT DFHMDF POS=(02,17),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
FATNNAM DFHMDF POS=(02,19),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,40),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF441G  DFHMDI LINE=8,COLUMN=01,                                       X00010**5
               SIZE=(01,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LG TOTE SEAL.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
GLGTOT1 DFHMDF POS=(01,17),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
GLGTOT2 DFHMDF POS=(01,25),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,33),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(01,41),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='SM TOTE SEAL..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
GSMTOT  DFHMDF POS=(01,57),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,65),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF441H  DFHMDI LINE=8,COLUMN=01,                                       X00010**5
               SIZE=(01,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRAILER SEAL.:',                               X00027   
               COLOR=NEUTRAL                                            00032   
HTRLRSL DFHMDF POS=(01,17),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,25),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(01,41),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRAILER NUMBER:',                              X00027   
               COLOR=NEUTRAL                                            00032   
HTRLRNO DFHMDF POS=(01,57),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,66),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF441I  DFHMDI LINE=10,COLUMN=1,                                       X00010**5
               SIZE=(11,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,04),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='UPC/SKU 000',                                  X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,20),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TICKET',                                       X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,44),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='UPC/SKU 000',                                  X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,60),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TICKET',                                       X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
ILIN01  DFHMDF POS=(02,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC01  DFHMDF POS=(02,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC01  DFHMDF POS=(02,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY01  DFHMDF POS=(02,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN02  DFHMDF POS=(02,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC02  DFHMDF POS=(02,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC02  DFHMDF POS=(02,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY02  DFHMDF POS=(02,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN03  DFHMDF POS=(03,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC03  DFHMDF POS=(03,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC03  DFHMDF POS=(03,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY03  DFHMDF POS=(03,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN04  DFHMDF POS=(03,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC04  DFHMDF POS=(03,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC04  DFHMDF POS=(03,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY04  DFHMDF POS=(03,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN05  DFHMDF POS=(04,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC05  DFHMDF POS=(04,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC05  DFHMDF POS=(04,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY05  DFHMDF POS=(04,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN06  DFHMDF POS=(04,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC06  DFHMDF POS=(04,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC06  DFHMDF POS=(04,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY06  DFHMDF POS=(04,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN07  DFHMDF POS=(05,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC07  DFHMDF POS=(05,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC07  DFHMDF POS=(05,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY07  DFHMDF POS=(05,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN08  DFHMDF POS=(05,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC08  DFHMDF POS=(05,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC08  DFHMDF POS=(05,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY08  DFHMDF POS=(05,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN09  DFHMDF POS=(06,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC09  DFHMDF POS=(06,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC09  DFHMDF POS=(06,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY09  DFHMDF POS=(06,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN10  DFHMDF POS=(06,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC10  DFHMDF POS=(06,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC10  DFHMDF POS=(06,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY10  DFHMDF POS=(06,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN11  DFHMDF POS=(07,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC11  DFHMDF POS=(07,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC11  DFHMDF POS=(07,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY11  DFHMDF POS=(07,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN12  DFHMDF POS=(07,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC12  DFHMDF POS=(07,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC12  DFHMDF POS=(07,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY12  DFHMDF POS=(07,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN13  DFHMDF POS=(08,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC13  DFHMDF POS=(08,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC13  DFHMDF POS=(08,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY13  DFHMDF POS=(08,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN14  DFHMDF POS=(08,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC14  DFHMDF POS=(08,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC14  DFHMDF POS=(08,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY14  DFHMDF POS=(08,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN15  DFHMDF POS=(09,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC15  DFHMDF POS=(09,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC15  DFHMDF POS=(09,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY15  DFHMDF POS=(09,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN16  DFHMDF POS=(09,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC16  DFHMDF POS=(09,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC16  DFHMDF POS=(09,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY16   DFHMDF POS=(09,67),                                           X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN17  DFHMDF POS=(10,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC17  DFHMDF POS=(10,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC17  DFHMDF POS=(10,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY17  DFHMDF POS=(10,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN18  DFHMDF POS=(10,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC18  DFHMDF POS=(10,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC18  DFHMDF POS=(10,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY18  DFHMDF POS=(10,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN19  DFHMDF POS=(11,01),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC19  DFHMDF POS=(11,04),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC19  DFHMDF POS=(11,18),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY19  DFHMDF POS=(11,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,31),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
ILIN20  DFHMDF POS=(11,41),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
IUPC20  DFHMDF POS=(11,44),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IPRC20  DFHMDF POS=(11,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
IQTY20  DFHMDF POS=(11,67),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,71),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
TF441J  DFHMDI LINE=10,COLUMN=1,                                       X00010**5
               SIZE=(11,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,06),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ITEM DESCRIPTION',                             X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,48),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FIXTURE',                                      X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,70),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='DPT',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
JLIN01  DFHMDF POS=(02,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC01  DFHMDF POS=(02,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX01  DFHMDF POS=(02,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT01  DFHMDF POS=(02,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY01  DFHMDF POS=(02,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN02  DFHMDF POS=(03,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC02  DFHMDF POS=(03,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX02  DFHMDF POS=(03,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT02  DFHMDF POS=(03,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY02  DFHMDF POS=(03,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN03  DFHMDF POS=(04,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC03  DFHMDF POS=(04,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX03  DFHMDF POS=(04,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT03  DFHMDF POS=(04,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY03  DFHMDF POS=(04,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN04  DFHMDF POS=(05,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC04  DFHMDF POS=(05,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX04  DFHMDF POS=(05,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT04  DFHMDF POS=(05,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY04  DFHMDF POS=(05,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN05  DFHMDF POS=(06,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC05  DFHMDF POS=(06,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX05  DFHMDF POS=(06,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT05  DFHMDF POS=(06,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY05  DFHMDF POS=(06,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN06  DFHMDF POS=(07,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC06  DFHMDF POS=(07,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX06  DFHMDF POS=(07,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT06  DFHMDF POS=(07,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY06  DFHMDF POS=(07,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN07  DFHMDF POS=(08,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC07  DFHMDF POS=(08,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX07  DFHMDF POS=(08,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT07  DFHMDF POS=(08,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY07  DFHMDF POS=(08,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN08  DFHMDF POS=(09,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC08  DFHMDF POS=(09,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX08  DFHMDF POS=(09,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT08  DFHMDF POS=(09,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY08  DFHMDF POS=(09,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN09  DFHMDF POS=(10,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC09  DFHMDF POS=(10,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX09  DFHMDF POS=(10,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT09  DFHMDF POS=(10,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY09  DFHMDF POS=(10,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(10,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JLIN10  DFHMDF POS=(11,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
JDSC10  DFHMDF POS=(11,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
JFIX10  DFHMDF POS=(11,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JDPT10  DFHMDF POS=(11,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
JQTY10  DFHMDF POS=(11,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(11,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
