          PRINT  NOGEN                                                  00002**1
TFKM440   DFHMSD TYPE=&SYSPARM,                                        X00003**1
               CTRL=(FREEKB),                                          X00004**1
               TERM=3270-2,                                            X00005**1
               LANG=COBOL,                                             X00006**1
               MODE=INOUT,                                             X00007**1
               TIOAPFX=YES,                                            X00008**1
               STORAGE=AUTO                                             00009**1
TF440A    DFHMDI LINE=2,                                               X00010**1
               COLUMN=1,                                               X00011**1
               MAPATTS=(COLOR,HILIGHT),                                X00012**1
               SIZE=(19,80),                                           X00013**1
               DSATTS=(COLOR,HILIGHT)                                   00014**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='STORE:',                                       X00028**1
               JUSTIFY=(LEFT,BLANK),                                   X00029**1
               POS=(2,02),                                             X00030**1
               LENGTH=06                                                00031**1
ASTRNBR   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(2,09),                                             X00030**1
               LENGTH=04                                                00242**1
ASTRNAM   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(2,14),                                             X00030**1
               LENGTH=10                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='TRANSFER TYPE',                                X00028**1
               JUSTIFY=(LEFT,BLANK),                                   X00029**1
               POS=(4,07),                                             X00030**1
               LENGTH=13                                                00031**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='CONTAINER TYPE',                               X00028**1
               JUSTIFY=(LEFT,BLANK),                                   X00029**1
               POS=(4,45),                                             X00030**1
               LENGTH=14                                                00031**1
AXTYP01   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(5,07),                                             X00030**1
               LENGTH=30                                                00242**1
ACTYP01   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(5,45),                                             X00030**1
               LENGTH=20                                                00242**1
AXTYP02   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(6,07),                                             X00030**1
               LENGTH=30                                                00242**1
ACTYP02   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(6,45),                                             X00030**1
               LENGTH=20                                                00242**1
AXTYP03   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(7,07),                                             X00030**1
               LENGTH=30                                                00242**1
ACTYP03   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(7,45),                                             X00030**1
               LENGTH=20                                                00242**1
AXTYP04   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(8,07),                                             X00030**1
               LENGTH=30                                                00242**1
ACTYP04   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(8,45),                                             X00030**1
               LENGTH=20                                                00242**1
AXTYP05   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(9,07),                                             X00030**1
               LENGTH=30                                                00242**1
ACTYP05   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(9,45),                                             X00030**1
               LENGTH=20                                                00242**1
AXTYP06   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(10,07),                                            X00030**1
               LENGTH=30                                                00242**1
ACTYP06   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(10,45),                                            X00030**1
               LENGTH=20                                                00242**1
AXTYP07   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(11,07),                                            X00030**1
               LENGTH=30                                                00242**1
ACTYP07   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(11,45),                                            X00030**1
               LENGTH=20                                                00242**1
AXTYP08   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(12,07),                                            X00030**1
               LENGTH=30                                                00242**1
ACTYP08   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(12,45),                                            X00030**1
               LENGTH=20                                                00242**1
AXTYP09   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(13,07),                                            X00030**1
               LENGTH=30                                                00242**1
ACTYP09   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(13,45),                                            X00030**1
               LENGTH=20                                                00242**1
AXTYP10   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(14,07),                                            X00030**1
               LENGTH=30                                                00242**1
ACTYP10   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(14,45),                                            X00030**1
               LENGTH=20                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='SELECT TRANSFER TYPE:',                        X00028**1
               JUSTIFY=(LEFT,BLANK),                                   X00029**1
               POS=(16,07),                                            X00030**1
               LENGTH=21                                                00031**1
ASXTYP    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(16,29),                                            X00030**1
               LENGTH=01                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00237**1
               POS=(16,31),                                            X00030**1
               LENGTH=01                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='SELECT CONTAINER TYPE:',                       X00028**1
               JUSTIFY=(LEFT,BLANK),                                   X00029**1
               POS=(16,45),                                            X00030**1
               LENGTH=22                                                00031**1
ASCTYP    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(16,68),                                            X00030**1
               LENGTH=01                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00237**1
               POS=(16,70),                                            X00030**1
               LENGTH=01                                                00242**1
         DFHMSD TYPE=FINAL                                              00279**1
         END                                                            00280**1
