        PRINT  NOGEN                                                    00002   
TFKM430 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
TF430A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(14,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
AMESG    DFHMDF POS=(01,25),                                           X00030   
               LENGTH=29,                                              X00031*37
               COLOR=BLUE,                                             X00036   
               ATTRB=(PROT)                                             00033*36
        DFHMDF POS=(03,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO...:',                              X00027   
               COLOR=NEUTRAL                                            00032   
AXFRNO  DFHMDF POS=(03,18),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(05,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STATUS........:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ASTAT   DFHMDF POS=(05,18),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AL5LIT  DFHMDF POS=(05,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CALLBACK NO....:',                             X00027   
               COLOR=NEUTRAL                                            00032   
AL5FLD  DFHMDF POS=(05,58),                                            X00029   
               LENGTH=22,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(06,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER TYPE.:',                              X00027   
               COLOR=NEUTRAL                                            00032   
AXFRTYP DFHMDF POS=(06,18),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AXFRDSC DFHMDF POS=(06,21),                                            X00029   
               LENGTH=19,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(06,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CONTAINER TYPE.:',                             X00027   
               COLOR=NEUTRAL                                            00032   
ACONTYP DFHMDF POS=(06,58),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ACONDSC DFHMDF POS=(06,61),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AL7LIT1 DFHMDF POS=(07,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LG TOTE SEAL..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
AL7FLD1 DFHMDF POS=(07,18),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AL7LIT2 DFHMDF POS=(07,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='SM TOTE SEAL...:',                             X00027   
               COLOR=NEUTRAL                                            00032   
AL7FLD2 DFHMDF POS=(07,58),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AL8LIT  DFHMDF POS=(08,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CUSTOMER NAME.:',                              X00027   
               COLOR=NEUTRAL                                            00032   
AL8FLD  DFHMDF POS=(08,18),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APHNLIT DFHMDF POS=(08,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CUSTOMER PHONE.:',                             X00027   
               COLOR=NEUTRAL                                            00032   
APHONE  DFHMDF POS=(08,58),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AADDLIT DFHMDF POS=(09,05),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ADDRESS....:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
AADDR   DFHMDF POS=(09,18),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ACTYLIT DFHMDF POS=(09,43),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CITY........:',                                X00027   
               COLOR=NEUTRAL                                            00032   
ACITY   DFHMDF POS=(09,58),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTLIT  DFHMDF POS=(10,43),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STATE/ZIP...:',                                X00027   
               COLOR=NEUTRAL                                            00032   
ASTZIP  DFHMDF POS=(10,58),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(12,02),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FROM STORE....:',                              X00027   
               COLOR=NEUTRAL                                            00032   
AFROMNO DFHMDF POS=(12,18),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFROM10 DFHMDF POS=(12,23),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(12,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='SCANNED?.......:',                             X00027   
               COLOR=NEUTRAL                                            00032   
AFRSCAN DFHMDF POS=(12,58),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(13,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='COMPLETED BY..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ACOMPBY DFHMDF POS=(13,18),                                            X00029   
               LENGTH=22,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(13,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='COMPLETION DATE:',                             X00027   
               COLOR=NEUTRAL                                            00032   
ACOMPDT DFHMDF POS=(13,58),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(14,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TOTAL QUANTITY:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ACMPQTY DFHMDF POS=(14,18),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AL14LIT DFHMDF POS=(14,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TOTAL RETAIL:..:',                             X00027   
               COLOR=NEUTRAL                                            00032   
AL14FLD DFHMDF POS=(14,58),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00009   
TF430B  DFHMDI LINE=16,COLUMN=01,                                      X00010**5
               SIZE=(05,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TO STORE......:',                              X00027   
               COLOR=NEUTRAL                                            00032   
BTONO   DFHMDF POS=(02,18),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTO10   DFHMDF POS=(02,23),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='SCANNED?.......:',                             X00027   
               COLOR=NEUTRAL                                            00032   
BTOSCAN DFHMDF POS=(02,58),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RECEIVED BY...:',                              X00027   
               COLOR=NEUTRAL                                            00032   
BRECVBY DFHMDF POS=(03,18),                                            X00029   
               LENGTH=22,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RECEIVED DATE..:',                             X00027   
               COLOR=NEUTRAL                                            00032   
BRECVDT DFHMDF POS=(03,58),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(04,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TOTAL QUANTITY:',                              X00027   
               COLOR=NEUTRAL                                            00032   
BRCVQTY DFHMDF POS=(04,18),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BL18LIT DFHMDF POS=(04,41),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TOTAL RETAIL:..:',                             X00027   
               COLOR=NEUTRAL                                            00032   
BL18FLD DFHMDF POS=(04,58),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00009   
TF430C  DFHMDI LINE=16,COLUMN=01,                                      X00010**5
               SIZE=(05,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,01),LENGTH=26,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='**************************'                     00024   
        DFHMDF POS=(01,28),LENGTH=11,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='COMMENTS BY'                                    00024   
CUSERID DFHMDF POS=(01,40),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(01,49),LENGTH=30,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='******************************'                 00024   
CCOMM1    DFHMDF ATTRB=(ASKIP,NORM),                                   X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(01,80),                                            X00030**1
               LENGTH=79                                                00242**1
CCOMM2    DFHMDF ATTRB=(ASKIP,NORM),                                   X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(02,80),                                            X00030**1
               LENGTH=79                                                00242**1
CCOMM3    DFHMDF ATTRB=(ASKIP,NORM),                                   X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(03,80),                                            X00030**1
               LENGTH=79                                                00242**1
CCOMM4    DFHMDF ATTRB=(ASKIP,NORM),                                   X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(04,80),                                            X00030**1
               LENGTH=79                                                00242**1
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
