        PRINT  NOGEN                                                    00002   
**********************************************************************          
*TFKM456 MAPSET - THIS IS THE BMS MAP FOR THE TRANSFERS ADD ITEM AFTER          
*    RECEIPT FUNCTION.                                                          
**********************************************************************          
**DATE:05/12/2003 CHANGED BY: JULIE TEWES  DUMMY UPC/SKU CHANGES                
**********************************************************************          
TFKM456 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
*                                                                       00009   
TF456A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(03,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
*                                                                       00015   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
AXFRNO  DFHMDF POS=(02,15),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                       00009   
TF456B  DFHMDI LINE=05,COLUMN=1,                                       X00010**5
               SIZE=(16,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN    ',                                       X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,05),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='UPC/SKU 000',                                  X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,23),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='PRICE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
BLIN01  DFHMDF POS=(02,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC01  DFHMDF POS=(02,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY01  DFHMDF POS=(02,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC01  DFHMDF POS=(02,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
BLIN02  DFHMDF POS=(03,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC02  DFHMDF POS=(03,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY02  DFHMDF POS=(03,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC02  DFHMDF POS=(03,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
BLIN03  DFHMDF POS=(04,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC03  DFHMDF POS=(04,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY03  DFHMDF POS=(04,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC03  DFHMDF POS=(04,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
BLIN04  DFHMDF POS=(05,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC04  DFHMDF POS=(05,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY04  DFHMDF POS=(05,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC04  DFHMDF POS=(05,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
BLIN05  DFHMDF POS=(06,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC05  DFHMDF POS=(06,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY05  DFHMDF POS=(06,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC05  DFHMDF POS=(06,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
BLIN06  DFHMDF POS=(07,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC06  DFHMDF POS=(07,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY06  DFHMDF POS=(07,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC06  DFHMDF POS=(07,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
BLIN07  DFHMDF POS=(08,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC07  DFHMDF POS=(08,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY07  DFHMDF POS=(08,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC07  DFHMDF POS=(08,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
BLIN08  DFHMDF POS=(09,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
BUPC08  DFHMDF POS=(09,05),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BQTY08  DFHMDF POS=(09,19),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BPRC08  DFHMDF POS=(09,23),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM,NUM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,32),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
        DFHMDF POS=(11,01),LENGTH=26,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='**************************'                     00024   
        DFHMDF POS=(11,28),LENGTH=11,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='COMMENTS BY'                                    00024   
BUSERID DFHMDF POS=(11,40),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(11,49),LENGTH=30,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='******************************'                 00024   
BCOMM1    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(11,80),                                            X00030**1
               LENGTH=79                                                00242**1
BCOMM2    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(12,80),                                            X00030**1
               LENGTH=79                                                00242**1
BCOMM3    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(13,80),                                            X00030**1
               LENGTH=79                                                00242**1
BCOMM4    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(14,80),                                            X00030**1
               LENGTH=79                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00237**1
               POS=(15,80),                                            X00030**1
               LENGTH=01                                                00242**1
**************                                                          00268   
TF456C  DFHMDI LINE=05,COLUMN=1,                                       X00010**5
               SIZE=(16,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,05),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ITEM DESCRIPTION',                             X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,46),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FIXTURE',                                      X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='DPT',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
CLIN01  DFHMDF POS=(02,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC01  DFHMDF POS=(02,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX01  DFHMDF POS=(02,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT01  DFHMDF POS=(02,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY01  DFHMDF POS=(02,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CLIN02  DFHMDF POS=(03,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC02  DFHMDF POS=(03,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX02  DFHMDF POS=(03,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT02  DFHMDF POS=(03,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY02  DFHMDF POS=(03,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(03,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CLIN03  DFHMDF POS=(04,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC03  DFHMDF POS=(04,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX03  DFHMDF POS=(04,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT03  DFHMDF POS=(04,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY03  DFHMDF POS=(04,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(04,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CLIN04  DFHMDF POS=(05,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC04  DFHMDF POS=(05,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX04  DFHMDF POS=(05,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT04  DFHMDF POS=(05,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY04  DFHMDF POS=(05,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(05,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CLIN05  DFHMDF POS=(06,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC05  DFHMDF POS=(06,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX05  DFHMDF POS=(06,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT05  DFHMDF POS=(06,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY05  DFHMDF POS=(06,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(06,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CLIN06  DFHMDF POS=(07,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC06  DFHMDF POS=(07,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX06  DFHMDF POS=(07,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT06  DFHMDF POS=(07,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY06  DFHMDF POS=(07,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(07,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CLIN07  DFHMDF POS=(08,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC07  DFHMDF POS=(08,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX07  DFHMDF POS=(08,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT07  DFHMDF POS=(08,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY07  DFHMDF POS=(08,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(08,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CLIN08  DFHMDF POS=(09,01),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(PROT,NORM),                                      X00026   
               COLOR=BLUE                                               00056   
CDSC08  DFHMDF POS=(09,05),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
CFIX08  DFHMDF POS=(09,46),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,67),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CDPT08  DFHMDF POS=(09,69),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,73),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
CQTY08  DFHMDF POS=(09,75),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(09,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
