        PRINT  NOGEN                                                    00002   
TFKM431 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
TF431A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**7
               COLOR=GREEN,                                            C00019   
               HILIGHT=UNDERLINE,                                      C00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
AXFRNO  DFHMDF POS=(02,15),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,30),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STATUS:',                                      X00027   
               COLOR=NEUTRAL                                            00032   
ASTATCD DFHMDF POS=(02,38),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTATUS DFHMDF POS=(02,41),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,44),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='--TRANSFER--',                                 X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(03,58),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='--RECEIVED--',                                 X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(03,75),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FILE',                                         X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='S',                                            X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,09),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,14),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='D/M/S',                                        X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,27),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='UPC',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,51),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='PRICE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY',                                          X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,65),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='PRICE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,74),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='PRICE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
*                                                                               
ASEL1   DFHMDF POS=(05,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT1   DFHMDF POS=(05,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN1   DFHMDF POS=(05,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS1   DFHMDF POS=(05,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC1   DFHMDF POS=(05,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY1  DFHMDF POS=(05,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC1  DFHMDF POS=(05,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY1  DFHMDF POS=(05,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC1  DFHMDF POS=(05,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC1  DFHMDF POS=(05,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL2   DFHMDF POS=(06,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT2   DFHMDF POS=(06,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN2   DFHMDF POS=(06,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS2   DFHMDF POS=(06,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC2   DFHMDF POS=(06,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY2  DFHMDF POS=(06,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC2  DFHMDF POS=(06,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY2  DFHMDF POS=(06,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC2  DFHMDF POS=(06,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC2  DFHMDF POS=(06,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL3   DFHMDF POS=(07,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT3   DFHMDF POS=(07,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN3   DFHMDF POS=(07,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS3   DFHMDF POS=(07,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC3   DFHMDF POS=(07,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY3  DFHMDF POS=(07,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC3  DFHMDF POS=(07,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY3  DFHMDF POS=(07,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC3  DFHMDF POS=(07,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC3  DFHMDF POS=(07,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL4   DFHMDF POS=(08,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT4   DFHMDF POS=(08,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN4   DFHMDF POS=(08,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS4   DFHMDF POS=(08,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC4   DFHMDF POS=(08,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY4  DFHMDF POS=(08,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC4  DFHMDF POS=(08,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY4  DFHMDF POS=(08,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC4  DFHMDF POS=(08,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC4  DFHMDF POS=(08,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL5   DFHMDF POS=(09,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT5   DFHMDF POS=(09,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN5   DFHMDF POS=(09,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS5   DFHMDF POS=(09,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC5   DFHMDF POS=(09,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY5  DFHMDF POS=(09,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC5  DFHMDF POS=(09,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY5  DFHMDF POS=(09,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC5  DFHMDF POS=(09,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC5  DFHMDF POS=(09,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL6   DFHMDF POS=(10,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT6   DFHMDF POS=(10,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN6   DFHMDF POS=(10,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS6   DFHMDF POS=(10,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC6   DFHMDF POS=(10,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY6  DFHMDF POS=(10,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC6  DFHMDF POS=(10,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY6  DFHMDF POS=(10,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC6  DFHMDF POS=(10,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC6  DFHMDF POS=(10,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL7   DFHMDF POS=(11,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT7   DFHMDF POS=(11,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN7   DFHMDF POS=(11,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS7   DFHMDF POS=(11,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC7   DFHMDF POS=(11,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY7  DFHMDF POS=(11,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC7  DFHMDF POS=(11,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY7  DFHMDF POS=(11,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC7  DFHMDF POS=(11,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC7  DFHMDF POS=(11,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL8   DFHMDF POS=(12,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT8   DFHMDF POS=(12,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN8   DFHMDF POS=(12,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS8   DFHMDF POS=(12,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC8   DFHMDF POS=(12,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY8  DFHMDF POS=(12,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC8  DFHMDF POS=(12,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY8  DFHMDF POS=(12,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC8  DFHMDF POS=(12,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC8  DFHMDF POS=(12,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL9   DFHMDF POS=(13,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT9   DFHMDF POS=(13,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN9   DFHMDF POS=(13,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS9   DFHMDF POS=(13,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC9   DFHMDF POS=(13,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY9  DFHMDF POS=(13,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC9  DFHMDF POS=(13,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY9  DFHMDF POS=(13,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC9  DFHMDF POS=(13,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC9  DFHMDF POS=(13,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL10  DFHMDF POS=(14,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT10  DFHMDF POS=(14,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN10  DFHMDF POS=(14,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS10  DFHMDF POS=(14,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC10  DFHMDF POS=(14,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY10 DFHMDF POS=(14,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC10 DFHMDF POS=(14,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY10 DFHMDF POS=(14,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC10 DFHMDF POS=(14,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC10 DFHMDF POS=(14,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL11  DFHMDF POS=(15,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT11  DFHMDF POS=(15,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN11  DFHMDF POS=(15,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS11  DFHMDF POS=(15,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC11  DFHMDF POS=(15,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY11 DFHMDF POS=(15,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC11 DFHMDF POS=(15,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY11 DFHMDF POS=(15,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC11 DFHMDF POS=(15,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC11 DFHMDF POS=(15,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL12  DFHMDF POS=(16,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT12  DFHMDF POS=(16,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN12  DFHMDF POS=(16,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS12  DFHMDF POS=(16,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC12  DFHMDF POS=(16,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY12 DFHMDF POS=(16,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC12 DFHMDF POS=(16,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY12 DFHMDF POS=(16,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC12 DFHMDF POS=(16,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC12 DFHMDF POS=(16,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL13  DFHMDF POS=(17,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT13  DFHMDF POS=(17,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN13  DFHMDF POS=(17,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS13  DFHMDF POS=(17,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC13  DFHMDF POS=(17,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY13 DFHMDF POS=(17,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC13 DFHMDF POS=(17,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY13 DFHMDF POS=(17,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC13 DFHMDF POS=(17,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC13 DFHMDF POS=(17,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL14  DFHMDF POS=(18,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT14  DFHMDF POS=(18,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN14  DFHMDF POS=(18,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS14  DFHMDF POS=(18,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC14  DFHMDF POS=(18,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY14 DFHMDF POS=(18,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC14 DFHMDF POS=(18,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY14 DFHMDF POS=(18,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC14 DFHMDF POS=(18,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC14 DFHMDF POS=(18,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASEL15  DFHMDF POS=(19,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
AACT15  DFHMDF POS=(19,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ALIN15  DFHMDF POS=(19,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADCS15  DFHMDF POS=(19,14),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AUPC15  DFHMDF POS=(19,27),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATQTY15 DFHMDF POS=(19,44),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATPRC15 DFHMDF POS=(19,48),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARQTY15 DFHMDF POS=(19,58),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARPRC15 DFHMDF POS=(19,62),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFPRC15 DFHMDF POS=(19,71),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00009   
TF431B  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(01,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
BSTRTIT DFHMDF POS=(01,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**7
               COLOR=GREEN,                                            C00019   
               HILIGHT=UNDERLINE,                                      C00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(01,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='TO'                                             00024   
BENDIT  DFHMDF POS=(01,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(01,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='OF'                                             00030   
BTOTIT  DFHMDF POS=(01,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
BXFRNO  DFHMDF POS=(02,15),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,30),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STATUS:',                                      X00027   
               COLOR=NEUTRAL                                            00032   
BSTATCD DFHMDF POS=(02,38),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BSTATUS DFHMDF POS=(02,41),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,53),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRN REC',                                      X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='S',                                            X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,09),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LN',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,12),                                            X00029   
               LENGTH=16,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ITEM DESCRIPTION',                             X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(04,53),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='QTY QTY',                                      X00027   
               COLOR=NEUTRAL                                            00032   
*                                                                               
BSEL1   DFHMDF POS=(05,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT1   DFHMDF POS=(05,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN1   DFHMDF POS=(05,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC1  DFHMDF POS=(05,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY1  DFHMDF POS=(05,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY1  DFHMDF POS=(05,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL2   DFHMDF POS=(06,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT2   DFHMDF POS=(06,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN2   DFHMDF POS=(06,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC2  DFHMDF POS=(06,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY2  DFHMDF POS=(06,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY2  DFHMDF POS=(06,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL3   DFHMDF POS=(07,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT3   DFHMDF POS=(07,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN3   DFHMDF POS=(07,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC3  DFHMDF POS=(07,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY3  DFHMDF POS=(07,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY3  DFHMDF POS=(07,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL4   DFHMDF POS=(08,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT4   DFHMDF POS=(08,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN4   DFHMDF POS=(08,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC4  DFHMDF POS=(08,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY4  DFHMDF POS=(08,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY4  DFHMDF POS=(08,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL5   DFHMDF POS=(09,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT5   DFHMDF POS=(09,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN5   DFHMDF POS=(09,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC5  DFHMDF POS=(09,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY5  DFHMDF POS=(09,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY5  DFHMDF POS=(09,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL6   DFHMDF POS=(10,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT6   DFHMDF POS=(10,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN6   DFHMDF POS=(10,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC6  DFHMDF POS=(10,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY6  DFHMDF POS=(10,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY6  DFHMDF POS=(10,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL7   DFHMDF POS=(11,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT7   DFHMDF POS=(11,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN7   DFHMDF POS=(11,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC7  DFHMDF POS=(11,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY7  DFHMDF POS=(11,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY7  DFHMDF POS=(11,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL8   DFHMDF POS=(12,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT8   DFHMDF POS=(12,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN8   DFHMDF POS=(12,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC8  DFHMDF POS=(12,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY8  DFHMDF POS=(12,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY8  DFHMDF POS=(12,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL9   DFHMDF POS=(13,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT9   DFHMDF POS=(13,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN9   DFHMDF POS=(13,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC9  DFHMDF POS=(13,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY9  DFHMDF POS=(13,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY9  DFHMDF POS=(13,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL10  DFHMDF POS=(14,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT10  DFHMDF POS=(14,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN10  DFHMDF POS=(14,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC10 DFHMDF POS=(14,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY10 DFHMDF POS=(14,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY10 DFHMDF POS=(14,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL11  DFHMDF POS=(15,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT11  DFHMDF POS=(15,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN11  DFHMDF POS=(15,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC11 DFHMDF POS=(15,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY11 DFHMDF POS=(15,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY11 DFHMDF POS=(15,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL12  DFHMDF POS=(16,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT12  DFHMDF POS=(16,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN12  DFHMDF POS=(16,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC12 DFHMDF POS=(16,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY12 DFHMDF POS=(16,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY12 DFHMDF POS=(16,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL13  DFHMDF POS=(17,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT13  DFHMDF POS=(17,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN13  DFHMDF POS=(17,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC13 DFHMDF POS=(17,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY13 DFHMDF POS=(17,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY13 DFHMDF POS=(17,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL14  DFHMDF POS=(18,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT14  DFHMDF POS=(18,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN14  DFHMDF POS=(18,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC14 DFHMDF POS=(18,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY14 DFHMDF POS=(18,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY14 DFHMDF POS=(18,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
BSEL15  DFHMDF POS=(19,02),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00020   
               COLOR=GREEN                                              00056   
BACT15  DFHMDF POS=(19,04),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BLIN15  DFHMDF POS=(19,08),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BDESC15 DFHMDF POS=(19,12),                                            X00029   
               LENGTH=40,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BTQTY15 DFHMDF POS=(19,53),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
BRQTY15 DFHMDF POS=(19,57),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
