        PRINT  NOGEN                                                    00010019
**********************************************************************  00020019
*TFKM452 MAPSET - THIS IS THE BMS MAP FOR RECEIVE TRANSFERS LINE ITEM   00030019
*    TRANSFER FUNCTION.                                                 00040019
**********************************************************************  00050019
**DATE:05/12/2003 CHANGED BY: JULIE TEWES  DUMMY UPC/SKU CHANGES        00060019
**********************************************************************  00070019
**DATE:03/09/2012 CHANGED BY: TUSHAR PANDIT LARGE RETAIL FIELD EXP.     00071025
**********************************************************************  00072025
TFKM452 DFHMSD TYPE=DSECT,                                             X00080019
               LANG=COBOL,                                             X00090019
               MODE=INOUT,                                             X00100019
               STORAGE=AUTO,                                           X00110019
               TERM=3270-2,                                            X00120019
               TIOAPFX=YES                                              00130019
*                                                                       00140019
TF452A  DFHMDI LINE=2,COLUMN=1,                                        X00150019
               SIZE=(19,80),                                           X00160019
               CTRL=(FREEKB),                                          X00170019
               MAPATTS=(COLOR,HILIGHT),                                X00180019
               DSATTS=(COLOR,HILIGHT)                                   00190019
          DFHMDF POS=(01,02),                                          X00200019
               LENGTH=15,                                              X00210019
               ATTRB=(ASKIP,NORM),                                     X00220019
               COLOR=NEUTRAL,                                          X00230019
               INITIAL='RECEIVE STORE.:'                                00240019
ARCVSTR   DFHMDF POS=(01,18),                                          X00250019
               LENGTH=04,                                              X00260023
               ATTRB=(ASKIP,NORM),                                     X00270019
               COLOR=BLUE                                               00280019
          DFHMDF POS=(01,51),                                          X00290019
               LENGTH=04,                                              X00300019
               ATTRB=(ASKIP,NORM),                                     X00310019
               COLOR=NEUTRAL,                                          X00320019
               INITIAL='ITEM'                                           00330019
ASTRTIT   DFHMDF POS=(01,56),                                          X00340019
               LENGTH=05,                                              X00350019
               ATTRB=(NUM,UNPROT,NORM),                                X00360019
               COLOR=GREEN,                                            X00370019
               HILIGHT=UNDERLINE,                                      X00380019
               PICOUT='ZZZZ9'                                           00390019
          DFHMDF POS=(01,62),                                          X00400019
               LENGTH=02,                                              X00410019
               ATTRB=(ASKIP,NORM),                                     X00420019
               COLOR=NEUTRAL,                                          X00430019
               INITIAL='TO'                                             00440019
AENDIT    DFHMDF POS=(01,65),                                          X00450019
               LENGTH=05,                                              X00460019
               ATTRB=(ASKIP,NORM),                                     X00470019
               COLOR=BLUE,                                             X00480019
               PICOUT='ZZZZ9'                                           00490019
          DFHMDF POS=(01,71),                                          X00500019
               LENGTH=02,                                              X00510019
               ATTRB=(ASKIP,NORM),                                     X00520019
               COLOR=NEUTRAL,                                          X00530019
               INITIAL='OF'                                             00540019
ATOTIT    DFHMDF POS=(01,74),                                          X00550019
               LENGTH=05,                                              X00560019
               ATTRB=(ASKIP,NORM),                                     X00570019
               COLOR=BLUE,                                             X00580019
               PICOUT='ZZZZ9'                                           00590019
        DFHMDF POS=(02,02),                                            X00600019
               LENGTH=15,                                              X00610019
               ATTRB=(ASKIP,BRT),                                      X00620019
               INITIAL='TRANSFER NO...:',                              X00630019
               COLOR=NEUTRAL                                            00640019
AXFERNO DFHMDF POS=(02,18),                                            X00650019
               LENGTH=13,                                              X00660023
               ATTRB=(ASKIP,NORM),                                     X00670019
               COLOR=BLUE                                               00680019
        DFHMDF POS=(03,48),                                            X00690019
               LENGTH=09,                                              X00700019
               ATTRB=(ASKIP,BRT),                                      X00710019
               INITIAL='TRN   REC',                                    X00720019
               COLOR=NEUTRAL                                            00730019
        DFHMDF POS=(03,61),                                            X00740025
               LENGTH=07,                                              X00750019
               ATTRB=(ASKIP,BRT),                                      X00760019
               INITIAL='TRNSFER',                                      X00770019
               COLOR=NEUTRAL                                            00780019
        DFHMDF POS=(03,71),                                            X00790025
               LENGTH=07,                                              X00800019
               ATTRB=(ASKIP,BRT),                                      X00810019
               INITIAL='RECEIVE',                                      X00820019
               COLOR=NEUTRAL                                            00830019
        DFHMDF POS=(04,03),                                            X00840019
               LENGTH=17,                                              X00850019
               ATTRB=(ASKIP,BRT),                                      X00860019
               INITIAL='LN D/M/S         ',                            X00870019
               COLOR=NEUTRAL                                            00880019
        DFHMDF POS=(04,23),                                            X00890019
               LENGTH=11,                                              X00900021
               ATTRB=(ASKIP,BRT),                                      X00910019
               INITIAL='UPC/SKU 000',                                  X00920021
               COLOR=NEUTRAL                                            00930019
        DFHMDF POS=(04,48),                                            X00940019
               LENGTH=09,                                              X00950019
               ATTRB=(ASKIP,BRT),                                      X00960019
               INITIAL='QTY   QTY',                                    X00970019
               COLOR=NEUTRAL                                            00980019
        DFHMDF POS=(04,63),                                            X00990025
               LENGTH=05,                                              X01000019
               ATTRB=(ASKIP,BRT),                                      X01010019
               INITIAL='PRICE',                                        X01020019
               COLOR=NEUTRAL                                            01030019
        DFHMDF POS=(04,73),                                            X01040025
               LENGTH=05,                                              X01050019
               ATTRB=(ASKIP,BRT),                                      X01060019
               INITIAL='PRICE',                                        X01070019
               COLOR=NEUTRAL                                            01080019
ALINE01 DFHMDF POS=(05,02),                                            X01090019
               LENGTH=03,                                              X01100019
               ATTRB=(ASKIP,NORM),                                     X01110019
               COLOR=BLUE                                               01120019
ADEPT01 DFHMDF POS=(05,06),                                            X01130019
               LENGTH=03,                                              X01140019
               ATTRB=(NUM,PROT,NORM),                                  X01150019
               COLOR=GREEN                                              01160019
ACLAS01 DFHMDF POS=(05,10),                                            X01170019
               LENGTH=03,                                              X01180019
               ATTRB=(NUM,PROT,NORM),                                  X01190019
               COLOR=GREEN                                              01200019
ASUBC01 DFHMDF POS=(05,14),                                            X01210019
               LENGTH=03,                                              X01220019
               ATTRB=(NUM,PROT,NORM),                                  X01230019
               COLOR=GREEN                                              01240019
        DFHMDF POS=(05,21),                                            X01250019
               LENGTH=01,                                              X01260019
               ATTRB=(ASKIP)                                            01270019
AUPC001  DFHMDF POS=(05,23),                                           X01280019
               LENGTH=13,                                              X01290019
               ATTRB=(NUM,UNPROT,NORM),                                X01300019
               HILIGHT=UNDERLINE,                                      X01310019
               COLOR=GREEN                                              01320019
        DFHMDF POS=(05,37),                                            X01330019
               LENGTH=01,                                              X01340019
               ATTRB=(ASKIP,BRT)                                        01350019
ATQTY01  DFHMDF POS=(05,48),                                           X01360019
               LENGTH=03,                                              X01370019
               ATTRB=(ASKIP,NORM),                                     X01380019
               COLOR=BLUE                                               01390019
ARQTY01  DFHMDF POS=(05,54),                                           X01400019
               LENGTH=03,                                              X01410019
               ATTRB=(NUM,UNPROT,NORM),                                X01420019
               HILIGHT=UNDERLINE,                                      X01430019
               COLOR=GREEN                                              01440019
        DFHMDF POS=(05,58),                                            X01450019
               LENGTH=01,                                              X01460019
               ATTRB=(ASKIP)                                            01470019
ATPRC01  DFHMDF POS=(05,60),                                           X01480019
               LENGTH=08,                                              X01490025
               ATTRB=(ASKIP,NORM),                                     X01500019
               COLOR=BLUE                                               01510019
ARPRC01  DFHMDF POS=(05,70),                                           X01520019
               LENGTH=08,                                              X01530025
               ATTRB=(NUM,UNPROT,NORM),                                X01540019
               HILIGHT=UNDERLINE,                                      X01550019
               COLOR=GREEN                                              01560019
        DFHMDF POS=(05,79),                                            X01570025
               LENGTH=01,                                              X01580019
               ATTRB=(ASKIP)                                            01590019
ALINE02 DFHMDF POS=(06,02),                                            X01600019
               LENGTH=03,                                              X01610019
               ATTRB=(ASKIP,NORM),                                     X01620019
               COLOR=BLUE                                               01630019
ADEPT02 DFHMDF POS=(06,06),                                            X01640019
               LENGTH=03,                                              X01650019
               ATTRB=(NUM,PROT,NORM),                                  X01660019
               COLOR=GREEN                                              01670019
ACLAS02 DFHMDF POS=(06,10),                                            X01680019
               LENGTH=03,                                              X01690019
               ATTRB=(NUM,PROT,NORM),                                  X01700019
               COLOR=GREEN                                              01710019
ASUBC02 DFHMDF POS=(06,14),                                            X01720019
               LENGTH=03,                                              X01730019
               ATTRB=(NUM,PROT,NORM),                                  X01740019
               COLOR=GREEN                                              01750019
        DFHMDF POS=(06,21),                                            X01760019
               LENGTH=01,                                              X01770019
               ATTRB=(ASKIP)                                            01780019
AUPC002  DFHMDF POS=(06,23),                                           X01790019
               LENGTH=13,                                              X01800019
               ATTRB=(NUM,UNPROT,NORM),                                X01810019
               HILIGHT=UNDERLINE,                                      X01820019
               COLOR=GREEN                                              01830019
        DFHMDF POS=(06,37),                                            X01840019
               LENGTH=01,                                              X01850019
               ATTRB=(ASKIP,BRT)                                        01860019
ATQTY02  DFHMDF POS=(06,48),                                           X01870019
               LENGTH=03,                                              X01880019
               ATTRB=(ASKIP,NORM),                                     X01890019
               COLOR=BLUE                                               01900019
ARQTY02  DFHMDF POS=(06,54),                                           X01910019
               LENGTH=03,                                              X01920019
               ATTRB=(NUM,UNPROT,NORM),                                X01930019
               HILIGHT=UNDERLINE,                                      X01940019
               COLOR=GREEN                                              01950019
        DFHMDF POS=(06,58),                                            X01960019
               LENGTH=01,                                              X01970019
               ATTRB=(ASKIP)                                            01980019
ATPRC02  DFHMDF POS=(06,60),                                           X01990019
               LENGTH=08,                                              X02000025
               ATTRB=(ASKIP,NORM),                                     X02010019
               COLOR=BLUE                                               02020019
ARPRC02  DFHMDF POS=(06,70),                                           X02030019
               LENGTH=08,                                              X02040025
               ATTRB=(NUM,UNPROT,NORM),                                X02050019
               HILIGHT=UNDERLINE,                                      X02060019
               COLOR=GREEN                                              02070019
        DFHMDF POS=(06,79),                                            X02080025
               LENGTH=01,                                              X02090019
               ATTRB=(ASKIP)                                            02100019
ALINE03 DFHMDF POS=(07,02),                                            X02110019
               LENGTH=03,                                              X02120019
               ATTRB=(ASKIP,NORM),                                     X02130019
               COLOR=BLUE                                               02140019
ADEPT03 DFHMDF POS=(07,06),                                            X02150019
               LENGTH=03,                                              X02160019
               ATTRB=(NUM,PROT,NORM),                                  X02170019
               COLOR=GREEN                                              02180019
ACLAS03 DFHMDF POS=(07,10),                                            X02190019
               LENGTH=03,                                              X02200019
               ATTRB=(NUM,PROT,NORM),                                  X02210019
               COLOR=GREEN                                              02220019
ASUBC03 DFHMDF POS=(07,14),                                            X02230019
               LENGTH=03,                                              X02240019
               ATTRB=(NUM,PROT,NORM),                                  X02250019
               COLOR=GREEN                                              02260019
        DFHMDF POS=(07,21),                                            X02270019
               LENGTH=01,                                              X02280019
               ATTRB=(ASKIP)                                            02290019
AUPC003  DFHMDF POS=(07,23),                                           X02300019
               LENGTH=13,                                              X02310019
               ATTRB=(NUM,UNPROT,NORM),                                X02320019
               HILIGHT=UNDERLINE,                                      X02330019
               COLOR=GREEN                                              02340019
        DFHMDF POS=(07,37),                                            X02350019
               LENGTH=01,                                              X02360019
               ATTRB=(ASKIP,BRT)                                        02370019
ATQTY03  DFHMDF POS=(07,48),                                           X02380019
               LENGTH=03,                                              X02390019
               ATTRB=(ASKIP,NORM),                                     X02400019
               COLOR=BLUE                                               02410019
ARQTY03  DFHMDF POS=(07,54),                                           X02420019
               LENGTH=03,                                              X02430019
               ATTRB=(NUM,UNPROT,NORM),                                X02440019
               HILIGHT=UNDERLINE,                                      X02450019
               COLOR=GREEN                                              02460019
        DFHMDF POS=(07,58),                                            X02470019
               LENGTH=01,                                              X02480019
               ATTRB=(ASKIP)                                            02490019
ATPRC03  DFHMDF POS=(07,60),                                           X02500019
               LENGTH=08,                                              X02510025
               ATTRB=(ASKIP,NORM),                                     X02520019
               COLOR=BLUE                                               02530019
ARPRC03  DFHMDF POS=(07,70),                                           X02540019
               LENGTH=08,                                              X02550025
               ATTRB=(NUM,UNPROT,NORM),                                X02560019
               HILIGHT=UNDERLINE,                                      X02570019
               COLOR=GREEN                                              02580019
        DFHMDF POS=(07,79),                                            X02590025
               LENGTH=01,                                              X02600019
               ATTRB=(ASKIP)                                            02610019
ALINE04 DFHMDF POS=(08,02),                                            X02620019
               LENGTH=03,                                              X02630019
               ATTRB=(ASKIP,NORM),                                     X02640019
               COLOR=BLUE                                               02650019
ADEPT04 DFHMDF POS=(08,06),                                            X02660019
               LENGTH=03,                                              X02670019
               ATTRB=(NUM,PROT,NORM),                                  X02680019
               COLOR=GREEN                                              02690019
ACLAS04 DFHMDF POS=(08,10),                                            X02700019
               LENGTH=03,                                              X02710019
               ATTRB=(NUM,PROT,NORM),                                  X02720019
               COLOR=GREEN                                              02730019
ASUBC04 DFHMDF POS=(08,14),                                            X02740019
               LENGTH=03,                                              X02750019
               ATTRB=(NUM,PROT,NORM),                                  X02760019
               COLOR=GREEN                                              02770019
        DFHMDF POS=(08,21),                                            X02780019
               LENGTH=01,                                              X02790019
               ATTRB=(ASKIP)                                            02800019
AUPC004  DFHMDF POS=(08,23),                                           X02810019
               LENGTH=13,                                              X02820019
               ATTRB=(NUM,UNPROT,NORM),                                X02830019
               HILIGHT=UNDERLINE,                                      X02840019
               COLOR=GREEN                                              02850019
        DFHMDF POS=(08,37),                                            X02860019
               LENGTH=01,                                              X02870019
               ATTRB=(ASKIP,BRT)                                        02880019
ATQTY04  DFHMDF POS=(08,48),                                           X02890019
               LENGTH=03,                                              X02900019
               ATTRB=(ASKIP,NORM),                                     X02910019
               COLOR=BLUE                                               02920019
ARQTY04  DFHMDF POS=(08,54),                                           X02930019
               LENGTH=03,                                              X02940019
               ATTRB=(NUM,UNPROT,NORM),                                X02950019
               HILIGHT=UNDERLINE,                                      X02960019
               COLOR=GREEN                                              02970019
        DFHMDF POS=(08,58),                                            X02980019
               LENGTH=01,                                              X02990019
               ATTRB=(ASKIP)                                            03000019
ATPRC04  DFHMDF POS=(08,60),                                           X03010019
               LENGTH=08,                                              X03020025
               ATTRB=(ASKIP,NORM),                                     X03030019
               COLOR=BLUE                                               03040019
ARPRC04  DFHMDF POS=(08,70),                                           X03050019
               LENGTH=08,                                              X03060025
               ATTRB=(NUM,UNPROT,NORM),                                X03070019
               HILIGHT=UNDERLINE,                                      X03080019
               COLOR=GREEN                                              03090019
        DFHMDF POS=(08,79),                                            X03100025
               LENGTH=01,                                              X03110019
               ATTRB=(ASKIP)                                            03120019
ALINE05 DFHMDF POS=(09,02),                                            X03130019
               LENGTH=03,                                              X03140019
               ATTRB=(ASKIP,NORM),                                     X03150019
               COLOR=BLUE                                               03160019
ADEPT05 DFHMDF POS=(09,06),                                            X03170019
               LENGTH=03,                                              X03180019
               ATTRB=(NUM,PROT,NORM),                                  X03190019
               COLOR=GREEN                                              03200019
ACLAS05 DFHMDF POS=(09,10),                                            X03210019
               LENGTH=03,                                              X03220019
               ATTRB=(NUM,PROT,NORM),                                  X03230019
               COLOR=GREEN                                              03240019
ASUBC05 DFHMDF POS=(09,14),                                            X03250019
               LENGTH=03,                                              X03260019
               ATTRB=(NUM,PROT,NORM),                                  X03270019
               COLOR=GREEN                                              03280019
        DFHMDF POS=(09,21),                                            X03290019
               LENGTH=01,                                              X03300019
               ATTRB=(ASKIP)                                            03310019
AUPC005  DFHMDF POS=(09,23),                                           X03320019
               LENGTH=13,                                              X03330019
               ATTRB=(NUM,UNPROT,NORM),                                X03340019
               HILIGHT=UNDERLINE,                                      X03350019
               COLOR=GREEN                                              03360019
        DFHMDF POS=(09,37),                                            X03370019
               LENGTH=01,                                              X03380019
               ATTRB=(ASKIP,BRT)                                        03390019
ATQTY05  DFHMDF POS=(09,48),                                           X03400019
               LENGTH=03,                                              X03410019
               ATTRB=(ASKIP,NORM),                                     X03420019
               COLOR=BLUE                                               03430019
ARQTY05  DFHMDF POS=(09,54),                                           X03440019
               LENGTH=03,                                              X03450019
               ATTRB=(NUM,UNPROT,NORM),                                X03460019
               HILIGHT=UNDERLINE,                                      X03470019
               COLOR=GREEN                                              03480019
        DFHMDF POS=(09,58),                                            X03490019
               LENGTH=01,                                              X03500019
               ATTRB=(ASKIP)                                            03510019
ATPRC05  DFHMDF POS=(09,60),                                           X03520019
               LENGTH=08,                                              X03530025
               ATTRB=(ASKIP,NORM),                                     X03540019
               COLOR=BLUE                                               03550019
ARPRC05  DFHMDF POS=(09,70),                                           X03560019
               LENGTH=08,                                              X03570025
               ATTRB=(NUM,UNPROT,NORM),                                X03580019
               HILIGHT=UNDERLINE,                                      X03590019
               COLOR=GREEN                                              03600019
        DFHMDF POS=(09,79),                                            X03610025
               LENGTH=01,                                              X03620019
               ATTRB=(ASKIP)                                            03630019
ALINE06 DFHMDF POS=(10,02),                                            X03640019
               LENGTH=03,                                              X03650019
               ATTRB=(ASKIP,NORM),                                     X03660019
               COLOR=BLUE                                               03670019
ADEPT06 DFHMDF POS=(10,06),                                            X03680019
               LENGTH=03,                                              X03690019
               ATTRB=(NUM,PROT,NORM),                                  X03700019
               COLOR=GREEN                                              03710019
ACLAS06 DFHMDF POS=(10,10),                                            X03720019
               LENGTH=03,                                              X03730019
               ATTRB=(NUM,PROT,NORM),                                  X03740019
               COLOR=GREEN                                              03750019
ASUBC06 DFHMDF POS=(10,14),                                            X03760019
               LENGTH=03,                                              X03770019
               ATTRB=(NUM,PROT,NORM),                                  X03780019
               COLOR=GREEN                                              03790019
        DFHMDF POS=(10,21),                                            X03800019
               LENGTH=01,                                              X03810019
               ATTRB=(ASKIP)                                            03820019
AUPC006  DFHMDF POS=(10,23),                                           X03830019
               LENGTH=13,                                              X03840019
               ATTRB=(NUM,UNPROT,NORM),                                X03850019
               HILIGHT=UNDERLINE,                                      X03860019
               COLOR=GREEN                                              03870019
        DFHMDF POS=(10,37),                                            X03880019
               LENGTH=01,                                              X03890019
               ATTRB=(ASKIP,BRT)                                        03900019
ATQTY06  DFHMDF POS=(10,48),                                           X03910019
               LENGTH=03,                                              X03920019
               ATTRB=(ASKIP,NORM),                                     X03930019
               COLOR=BLUE                                               03940019
ARQTY06  DFHMDF POS=(10,54),                                           X03950019
               LENGTH=03,                                              X03960019
               ATTRB=(NUM,UNPROT,NORM),                                X03970019
               HILIGHT=UNDERLINE,                                      X03980019
               COLOR=GREEN                                              03990019
        DFHMDF POS=(10,58),                                            X04000019
               LENGTH=01,                                              X04010019
               ATTRB=(ASKIP)                                            04020019
ATPRC06  DFHMDF POS=(10,60),                                           X04030019
               LENGTH=08,                                              X04040025
               ATTRB=(ASKIP,NORM),                                     X04050019
               COLOR=BLUE                                               04060019
ARPRC06  DFHMDF POS=(10,70),                                           X04070019
               LENGTH=08,                                              X04080025
               ATTRB=(NUM,UNPROT,NORM),                                X04090019
               HILIGHT=UNDERLINE,                                      X04100019
               COLOR=GREEN                                              04110019
        DFHMDF POS=(10,79),                                            X04120025
               LENGTH=01,                                              X04130019
               ATTRB=(ASKIP)                                            04140019
ALINE07 DFHMDF POS=(11,02),                                            X04150019
               LENGTH=03,                                              X04160019
               ATTRB=(ASKIP,NORM),                                     X04170019
               COLOR=BLUE                                               04180019
ADEPT07 DFHMDF POS=(11,06),                                            X04190019
               LENGTH=03,                                              X04200019
               ATTRB=(NUM,PROT,NORM),                                  X04210019
               COLOR=GREEN                                              04220019
ACLAS07 DFHMDF POS=(11,10),                                            X04230019
               LENGTH=03,                                              X04240019
               ATTRB=(NUM,PROT,NORM),                                  X04250019
               COLOR=GREEN                                              04260019
ASUBC07 DFHMDF POS=(11,14),                                            X04270019
               LENGTH=03,                                              X04280019
               ATTRB=(NUM,PROT,NORM),                                  X04290019
               COLOR=GREEN                                              04300019
        DFHMDF POS=(11,21),                                            X04310019
               LENGTH=01,                                              X04320019
               ATTRB=(ASKIP)                                            04330019
AUPC007  DFHMDF POS=(11,23),                                           X04340019
               LENGTH=13,                                              X04350019
               ATTRB=(NUM,UNPROT,NORM),                                X04360019
               HILIGHT=UNDERLINE,                                      X04370019
               COLOR=GREEN                                              04380019
        DFHMDF POS=(11,37),                                            X04390019
               LENGTH=01,                                              X04400019
               ATTRB=(ASKIP,BRT)                                        04410019
ATQTY07  DFHMDF POS=(11,48),                                           X04420019
               LENGTH=03,                                              X04430019
               ATTRB=(ASKIP,NORM),                                     X04440019
               COLOR=BLUE                                               04450019
ARQTY07  DFHMDF POS=(11,54),                                           X04460019
               LENGTH=03,                                              X04470019
               ATTRB=(NUM,UNPROT,NORM),                                X04480019
               HILIGHT=UNDERLINE,                                      X04490019
               COLOR=GREEN                                              04500019
        DFHMDF POS=(11,58),                                            X04510019
               LENGTH=01,                                              X04520019
               ATTRB=(ASKIP)                                            04530019
ATPRC07  DFHMDF POS=(11,60),                                           X04540019
               LENGTH=08,                                              X04550025
               ATTRB=(ASKIP,NORM),                                     X04560019
               COLOR=BLUE                                               04570019
ARPRC07  DFHMDF POS=(11,70),                                           X04580019
               LENGTH=08,                                              X04590025
               ATTRB=(NUM,UNPROT,NORM),                                X04600019
               HILIGHT=UNDERLINE,                                      X04610019
               COLOR=GREEN                                              04620019
        DFHMDF POS=(11,79),                                            X04630025
               LENGTH=01,                                              X04640019
               ATTRB=(ASKIP)                                            04650019
ALINE08 DFHMDF POS=(12,02),                                            X04660019
               LENGTH=03,                                              X04670019
               ATTRB=(ASKIP,NORM),                                     X04680019
               COLOR=BLUE                                               04690019
ADEPT08 DFHMDF POS=(12,06),                                            X04700019
               LENGTH=03,                                              X04710019
               ATTRB=(NUM,PROT,NORM),                                  X04720019
               COLOR=GREEN                                              04730019
ACLAS08 DFHMDF POS=(12,10),                                            X04740019
               LENGTH=03,                                              X04750019
               ATTRB=(NUM,PROT,NORM),                                  X04760019
               COLOR=GREEN                                              04770019
ASUBC08 DFHMDF POS=(12,14),                                            X04780019
               LENGTH=03,                                              X04790019
               ATTRB=(NUM,PROT,NORM),                                  X04800019
               COLOR=GREEN                                              04810019
        DFHMDF POS=(12,21),                                            X04820019
               LENGTH=01,                                              X04830019
               ATTRB=(ASKIP)                                            04840019
AUPC008  DFHMDF POS=(12,23),                                           X04850019
               LENGTH=13,                                              X04860019
               ATTRB=(NUM,UNPROT,NORM),                                X04870019
               HILIGHT=UNDERLINE,                                      X04880019
               COLOR=GREEN                                              04890019
        DFHMDF POS=(12,37),                                            X04900019
               LENGTH=01,                                              X04910019
               ATTRB=(ASKIP,BRT)                                        04920019
ATQTY08  DFHMDF POS=(12,48),                                           X04930019
               LENGTH=03,                                              X04940019
               ATTRB=(ASKIP,NORM),                                     X04950019
               COLOR=BLUE                                               04960019
ARQTY08  DFHMDF POS=(12,54),                                           X04970019
               LENGTH=03,                                              X04980019
               ATTRB=(NUM,UNPROT,NORM),                                X04990019
               HILIGHT=UNDERLINE,                                      X05000019
               COLOR=GREEN                                              05010019
        DFHMDF POS=(12,58),                                            X05020019
               LENGTH=01,                                              X05030019
               ATTRB=(ASKIP)                                            05040019
ATPRC08  DFHMDF POS=(12,60),                                           X05050019
               LENGTH=08,                                              X05060025
               ATTRB=(ASKIP,NORM),                                     X05070019
               COLOR=BLUE                                               05080019
ARPRC08  DFHMDF POS=(12,70),                                           X05090019
               LENGTH=08,                                              X05100025
               ATTRB=(NUM,UNPROT,NORM),                                X05110019
               HILIGHT=UNDERLINE,                                      X05120019
               COLOR=GREEN                                              05130019
        DFHMDF POS=(12,79),                                            X05140025
               LENGTH=01,                                              X05150019
               ATTRB=(ASKIP)                                            05160019
ALINE09 DFHMDF POS=(13,02),                                            X05170019
               LENGTH=03,                                              X05180019
               ATTRB=(ASKIP,NORM),                                     X05190019
               COLOR=BLUE                                               05200019
ADEPT09 DFHMDF POS=(13,06),                                            X05210019
               LENGTH=03,                                              X05220019
               ATTRB=(NUM,PROT,NORM),                                  X05230019
               COLOR=GREEN                                              05240019
ACLAS09 DFHMDF POS=(13,10),                                            X05250019
               LENGTH=03,                                              X05260019
               ATTRB=(NUM,PROT,NORM),                                  X05270019
               COLOR=GREEN                                              05280019
ASUBC09 DFHMDF POS=(13,14),                                            X05290019
               LENGTH=03,                                              X05300019
               ATTRB=(NUM,PROT,NORM),                                  X05310019
               COLOR=GREEN                                              05320019
        DFHMDF POS=(13,21),                                            X05330019
               LENGTH=01,                                              X05340019
               ATTRB=(ASKIP)                                            05350019
AUPC009  DFHMDF POS=(13,23),                                           X05360019
               LENGTH=13,                                              X05370019
               ATTRB=(NUM,UNPROT,NORM),                                X05380019
               HILIGHT=UNDERLINE,                                      X05390019
               COLOR=GREEN                                              05400019
        DFHMDF POS=(13,37),                                            X05410019
               LENGTH=01,                                              X05420019
               ATTRB=(ASKIP,BRT)                                        05430019
ATQTY09  DFHMDF POS=(13,48),                                           X05440020
               LENGTH=03,                                              X05450020
               ATTRB=(ASKIP,NORM),                                     X05460020
               COLOR=BLUE                                               05470020
ARQTY09  DFHMDF POS=(13,54),                                           X05480020
               LENGTH=03,                                              X05490020
               ATTRB=(NUM,UNPROT,NORM),                                X05500020
               HILIGHT=UNDERLINE,                                      X05510020
               COLOR=GREEN                                              05520020
        DFHMDF POS=(13,58),                                            X05530020
               LENGTH=01,                                              X05540020
               ATTRB=(ASKIP)                                            05550020
ATPRC09  DFHMDF POS=(13,60),                                           X05560019
               LENGTH=08,                                              X05570025
               ATTRB=(ASKIP,NORM),                                     X05580019
               COLOR=BLUE                                               05590019
ARPRC09  DFHMDF POS=(13,70),                                           X05600019
               LENGTH=08,                                              X05610025
               ATTRB=(NUM,UNPROT,NORM),                                X05620019
               HILIGHT=UNDERLINE,                                      X05630019
               COLOR=GREEN                                              05640019
        DFHMDF POS=(13,79),                                            X05650025
               LENGTH=01,                                              X05660019
               ATTRB=(ASKIP)                                            05670019
ALINE10 DFHMDF POS=(14,02),                                            X05680019
               LENGTH=03,                                              X05690019
               ATTRB=(ASKIP,NORM),                                     X05700019
               COLOR=BLUE                                               05710019
ADEPT10 DFHMDF POS=(14,06),                                            X05720019
               LENGTH=03,                                              X05730019
               ATTRB=(NUM,PROT,NORM),                                  X05740019
               COLOR=GREEN                                              05750019
ACLAS10 DFHMDF POS=(14,10),                                            X05760019
               LENGTH=03,                                              X05770019
               ATTRB=(NUM,PROT,NORM),                                  X05780019
               COLOR=GREEN                                              05790019
ASUBC10 DFHMDF POS=(14,14),                                            X05800019
               LENGTH=03,                                              X05810019
               ATTRB=(NUM,PROT,NORM),                                  X05820019
               COLOR=GREEN                                              05830019
        DFHMDF POS=(14,21),                                            X05840019
               LENGTH=01,                                              X05850019
               ATTRB=(ASKIP)                                            05860019
AUPC010  DFHMDF POS=(14,23),                                           X05870019
               LENGTH=13,                                              X05880019
               ATTRB=(NUM,UNPROT,NORM),                                X05890019
               HILIGHT=UNDERLINE,                                      X05900019
               COLOR=GREEN                                              05910019
        DFHMDF POS=(14,37),                                            X05920019
               LENGTH=01,                                              X05930019
               ATTRB=(ASKIP,BRT)                                        05940019
ATQTY10  DFHMDF POS=(14,48),                                           X05950019
               LENGTH=03,                                              X05960019
               ATTRB=(ASKIP,NORM),                                     X05970019
               COLOR=BLUE                                               05980019
ARQTY10  DFHMDF POS=(14,54),                                           X05990019
               LENGTH=03,                                              X06000019
               ATTRB=(NUM,UNPROT,NORM),                                X06010019
               HILIGHT=UNDERLINE,                                      X06020019
               COLOR=GREEN                                              06030019
        DFHMDF POS=(14,58),                                            X06040019
               LENGTH=01,                                              X06050019
               ATTRB=(ASKIP)                                            06060019
ATPRC10  DFHMDF POS=(14,60),                                           X06070019
               LENGTH=08,                                              X06080025
               ATTRB=(ASKIP,NORM),                                     X06090019
               COLOR=BLUE                                               06100019
ARPRC10  DFHMDF POS=(14,70),                                           X06110019
               LENGTH=08,                                              X06120025
               ATTRB=(NUM,UNPROT,NORM),                                X06130019
               HILIGHT=UNDERLINE,                                      X06140019
               COLOR=GREEN                                              06150019
        DFHMDF POS=(14,79),                                            X06160025
               LENGTH=01,                                              X06170019
               ATTRB=(ASKIP)                                            06180019
ALINE11 DFHMDF POS=(15,02),                                            X06190019
               LENGTH=03,                                              X06200019
               ATTRB=(ASKIP,NORM),                                     X06210019
               COLOR=BLUE                                               06220019
ADEPT11 DFHMDF POS=(15,06),                                            X06230019
               LENGTH=03,                                              X06240019
               ATTRB=(NUM,PROT,NORM),                                  X06250019
               COLOR=GREEN                                              06260019
ACLAS11 DFHMDF POS=(15,10),                                            X06270019
               LENGTH=03,                                              X06280019
               ATTRB=(NUM,PROT,NORM),                                  X06290019
               COLOR=GREEN                                              06300019
ASUBC11 DFHMDF POS=(15,14),                                            X06310019
               LENGTH=03,                                              X06320019
               ATTRB=(NUM,PROT,NORM),                                  X06330019
               COLOR=GREEN                                              06340019
        DFHMDF POS=(15,21),                                            X06350019
               LENGTH=01,                                              X06360019
               ATTRB=(ASKIP)                                            06370019
AUPC011  DFHMDF POS=(15,23),                                           X06380019
               LENGTH=13,                                              X06390019
               ATTRB=(NUM,UNPROT,NORM),                                X06400019
               HILIGHT=UNDERLINE,                                      X06410019
               COLOR=GREEN                                              06420019
        DFHMDF POS=(15,37),                                            X06430019
               LENGTH=01,                                              X06440019
               ATTRB=(ASKIP,BRT)                                        06450019
ATQTY11  DFHMDF POS=(15,48),                                           X06460019
               LENGTH=03,                                              X06470019
               ATTRB=(ASKIP,NORM),                                     X06480019
               COLOR=BLUE                                               06490019
ARQTY11  DFHMDF POS=(15,54),                                           X06500019
               LENGTH=03,                                              X06510019
               ATTRB=(NUM,UNPROT,NORM),                                X06520019
               HILIGHT=UNDERLINE,                                      X06530019
               COLOR=GREEN                                              06540019
        DFHMDF POS=(15,58),                                            X06550019
               LENGTH=01,                                              X06560019
               ATTRB=(ASKIP)                                            06570019
ATPRC11  DFHMDF POS=(15,60),                                           X06580019
               LENGTH=08,                                              X06590025
               ATTRB=(ASKIP,NORM),                                     X06600019
               COLOR=BLUE                                               06610019
ARPRC11  DFHMDF POS=(15,70),                                           X06620019
               LENGTH=08,                                              X06630025
               ATTRB=(NUM,UNPROT,NORM),                                X06640019
               HILIGHT=UNDERLINE,                                      X06650019
               COLOR=GREEN                                              06660019
        DFHMDF POS=(15,79),                                            X06670025
               LENGTH=01,                                              X06680019
               ATTRB=(ASKIP)                                            06690019
ALINE12 DFHMDF POS=(16,02),                                            X06700019
               LENGTH=03,                                              X06710019
               ATTRB=(ASKIP,NORM),                                     X06720019
               COLOR=BLUE                                               06730019
ADEPT12 DFHMDF POS=(16,06),                                            X06740019
               LENGTH=03,                                              X06750019
               ATTRB=(NUM,PROT,NORM),                                  X06760019
               COLOR=GREEN                                              06770019
ACLAS12 DFHMDF POS=(16,10),                                            X06780019
               LENGTH=03,                                              X06790019
               ATTRB=(NUM,PROT,NORM),                                  X06800019
               COLOR=GREEN                                              06810019
ASUBC12 DFHMDF POS=(16,14),                                            X06820019
               LENGTH=03,                                              X06830019
               ATTRB=(NUM,PROT,NORM),                                  X06840019
               COLOR=GREEN                                              06850019
        DFHMDF POS=(16,21),                                            X06860019
               LENGTH=01,                                              X06870019
               ATTRB=(ASKIP)                                            06880019
AUPC012  DFHMDF POS=(16,23),                                           X06890019
               LENGTH=13,                                              X06900019
               ATTRB=(NUM,UNPROT,NORM),                                X06910019
               HILIGHT=UNDERLINE,                                      X06920019
               COLOR=GREEN                                              06930019
        DFHMDF POS=(16,37),                                            X06940019
               LENGTH=01,                                              X06950019
               ATTRB=(ASKIP,BRT)                                        06960019
ATQTY12  DFHMDF POS=(16,48),                                           X06970020
               LENGTH=03,                                              X06980020
               ATTRB=(ASKIP,NORM),                                     X06990020
               COLOR=BLUE                                               07000020
ARQTY12  DFHMDF POS=(16,54),                                           X07010020
               LENGTH=03,                                              X07020020
               ATTRB=(NUM,UNPROT,NORM),                                X07030020
               HILIGHT=UNDERLINE,                                      X07040020
               COLOR=GREEN                                              07050020
        DFHMDF POS=(16,58),                                            X07060020
               LENGTH=01,                                              X07070020
               ATTRB=(ASKIP)                                            07080020
ATPRC12  DFHMDF POS=(16,60),                                           X07090019
               LENGTH=08,                                              X07100025
               ATTRB=(ASKIP,NORM),                                     X07110019
               COLOR=BLUE                                               07120019
ARPRC12  DFHMDF POS=(16,70),                                           X07130019
               LENGTH=08,                                              X07140025
               ATTRB=(NUM,UNPROT,NORM),                                X07150019
               HILIGHT=UNDERLINE,                                      X07160019
               COLOR=GREEN                                              07170019
        DFHMDF POS=(16,79),                                            X07180025
               LENGTH=01,                                              X07190019
               ATTRB=(ASKIP)                                            07200019
ALINE13 DFHMDF POS=(17,02),                                            X07210019
               LENGTH=03,                                              X07220019
               ATTRB=(ASKIP,NORM),                                     X07230019
               COLOR=BLUE                                               07240019
ADEPT13 DFHMDF POS=(17,06),                                            X07250019
               LENGTH=03,                                              X07260019
               ATTRB=(NUM,PROT,NORM),                                  X07270019
               COLOR=GREEN                                              07280019
ACLAS13 DFHMDF POS=(17,10),                                            X07290019
               LENGTH=03,                                              X07300019
               ATTRB=(NUM,PROT,NORM),                                  X07310019
               COLOR=GREEN                                              07320019
ASUBC13 DFHMDF POS=(17,14),                                            X07330019
               LENGTH=03,                                              X07340019
               ATTRB=(NUM,PROT,NORM),                                  X07350019
               COLOR=GREEN                                              07360019
        DFHMDF POS=(17,21),                                            X07370019
               LENGTH=01,                                              X07380019
               ATTRB=(ASKIP)                                            07390019
AUPC013  DFHMDF POS=(17,23),                                           X07400019
               LENGTH=13,                                              X07410019
               ATTRB=(NUM,UNPROT,NORM),                                X07420019
               HILIGHT=UNDERLINE,                                      X07430019
               COLOR=GREEN                                              07440019
        DFHMDF POS=(17,37),                                            X07450019
               LENGTH=01,                                              X07460019
               ATTRB=(ASKIP,BRT)                                        07470019
ATQTY13  DFHMDF POS=(17,48),                                           X07480019
               LENGTH=03,                                              X07490019
               ATTRB=(ASKIP,NORM),                                     X07500019
               COLOR=BLUE                                               07510019
ARQTY13  DFHMDF POS=(17,54),                                           X07520019
               LENGTH=03,                                              X07530019
               ATTRB=(NUM,UNPROT,NORM),                                X07540019
               HILIGHT=UNDERLINE,                                      X07550019
               COLOR=GREEN                                              07560019
        DFHMDF POS=(17,58),                                            X07570019
               LENGTH=01,                                              X07580019
               ATTRB=(ASKIP)                                            07590019
ATPRC13  DFHMDF POS=(17,60),                                           X07600019
               LENGTH=08,                                              X07610025
               ATTRB=(ASKIP,NORM),                                     X07620019
               COLOR=BLUE                                               07630019
ARPRC13  DFHMDF POS=(17,70),                                           X07640019
               LENGTH=08,                                              X07650025
               ATTRB=(NUM,UNPROT,NORM),                                X07660019
               HILIGHT=UNDERLINE,                                      X07670019
               COLOR=GREEN                                              07680019
        DFHMDF POS=(17,79),                                            X07690025
               LENGTH=01,                                              X07700019
               ATTRB=(ASKIP)                                            07710019
ALINE14 DFHMDF POS=(18,02),                                            X07720019
               LENGTH=03,                                              X07730019
               ATTRB=(ASKIP,NORM),                                     X07740019
               COLOR=BLUE                                               07750019
ADEPT14 DFHMDF POS=(18,06),                                            X07760019
               LENGTH=03,                                              X07770019
               ATTRB=(NUM,PROT,NORM),                                  X07780019
               COLOR=GREEN                                              07790019
ACLAS14 DFHMDF POS=(18,10),                                            X07800019
               LENGTH=03,                                              X07810019
               ATTRB=(NUM,PROT,NORM),                                  X07820019
               COLOR=GREEN                                              07830019
ASUBC14 DFHMDF POS=(18,14),                                            X07840019
               LENGTH=03,                                              X07850019
               ATTRB=(NUM,PROT,NORM),                                  X07860019
               COLOR=GREEN                                              07870019
        DFHMDF POS=(18,21),                                            X07880019
               LENGTH=01,                                              X07890019
               ATTRB=(ASKIP)                                            07900019
AUPC014  DFHMDF POS=(18,23),                                           X07910019
               LENGTH=13,                                              X07920019
               ATTRB=(NUM,UNPROT,NORM),                                X07930019
               HILIGHT=UNDERLINE,                                      X07940019
               COLOR=GREEN                                              07950019
        DFHMDF POS=(18,37),                                            X07960019
               LENGTH=01,                                              X07970019
               ATTRB=(ASKIP,BRT)                                        07980019
ATQTY14  DFHMDF POS=(18,48),                                           X07990019
               LENGTH=03,                                              X08000019
               ATTRB=(ASKIP,NORM),                                     X08010019
               COLOR=BLUE                                               08020019
ARQTY14  DFHMDF POS=(18,54),                                           X08030019
               LENGTH=03,                                              X08040019
               ATTRB=(NUM,UNPROT,NORM),                                X08050019
               HILIGHT=UNDERLINE,                                      X08060019
               COLOR=GREEN                                              08070019
        DFHMDF POS=(18,58),                                            X08080019
               LENGTH=01,                                              X08090019
               ATTRB=(ASKIP)                                            08100019
ATPRC14  DFHMDF POS=(18,60),                                           X08110019
               LENGTH=08,                                              X08120025
               ATTRB=(ASKIP,NORM),                                     X08130019
               COLOR=BLUE                                               08140019
ARPRC14  DFHMDF POS=(18,70),                                           X08150019
               LENGTH=08,                                              X08160025
               ATTRB=(NUM,UNPROT,NORM),                                X08170019
               HILIGHT=UNDERLINE,                                      X08180019
               COLOR=GREEN                                              08190019
        DFHMDF POS=(18,79),                                            X08200025
               LENGTH=01,                                              X08210019
               ATTRB=(ASKIP)                                            08220019
ALINE15 DFHMDF POS=(19,02),                                            X08230019
               LENGTH=03,                                              X08240019
               ATTRB=(ASKIP,NORM),                                     X08250019
               COLOR=BLUE                                               08260019
ADEPT15 DFHMDF POS=(19,06),                                            X08270019
               LENGTH=03,                                              X08280019
               ATTRB=(NUM,PROT,NORM),                                  X08290019
               COLOR=GREEN                                              08300019
ACLAS15 DFHMDF POS=(19,10),                                            X08310019
               LENGTH=03,                                              X08320019
               ATTRB=(NUM,PROT,NORM),                                  X08330019
               COLOR=GREEN                                              08340019
ASUBC15 DFHMDF POS=(19,14),                                            X08350019
               LENGTH=03,                                              X08360019
               ATTRB=(NUM,PROT,NORM),                                  X08370019
               COLOR=GREEN                                              08380019
        DFHMDF POS=(19,21),                                            X08390019
               LENGTH=01,                                              X08400019
               ATTRB=(ASKIP)                                            08410019
AUPC015  DFHMDF POS=(19,23),                                           X08420019
               LENGTH=13,                                              X08430019
               ATTRB=(NUM,UNPROT,NORM),                                X08440019
               HILIGHT=UNDERLINE,                                      X08450019
               COLOR=GREEN                                              08460019
        DFHMDF POS=(19,37),                                            X08470019
               LENGTH=01,                                              X08480019
               ATTRB=(ASKIP,BRT)                                        08490019
ATQTY15  DFHMDF POS=(19,48),                                           X08500019
               LENGTH=03,                                              X08510019
               ATTRB=(ASKIP,NORM),                                     X08520019
               COLOR=BLUE                                               08530019
ARQTY15  DFHMDF POS=(19,54),                                           X08540019
               LENGTH=03,                                              X08550019
               ATTRB=(NUM,UNPROT,NORM),                                X08560019
               HILIGHT=UNDERLINE,                                      X08570019
               COLOR=GREEN                                              08580019
        DFHMDF POS=(19,58),                                            X08590019
               LENGTH=01,                                              X08600019
               ATTRB=(ASKIP)                                            08610019
ATPRC15  DFHMDF POS=(19,60),                                           X08620019
               LENGTH=08,                                              X08630025
               ATTRB=(ASKIP,NORM),                                     X08640019
               COLOR=BLUE                                               08650019
ARPRC15  DFHMDF POS=(19,70),                                           X08660019
               LENGTH=08,                                              X08670025
               ATTRB=(NUM,UNPROT,NORM),                                X08680019
               HILIGHT=UNDERLINE,                                      X08690019
               COLOR=GREEN                                              08700019
        DFHMDF POS=(19,79),                                            X08710025
               LENGTH=01,                                              X08720019
               ATTRB=(ASKIP)                                            08730019
*                                                                       08740019
TF452B  DFHMDI LINE=2,COLUMN=1,                                        X08750019
               SIZE=(19,80),                                           X08760019
               CTRL=(FREEKB),                                          X08770019
               MAPATTS=(COLOR,HILIGHT),                                X08780019
               DSATTS=(COLOR,HILIGHT)                                   08790019
*                                                                       08800019
          DFHMDF POS=(01,51),                                          X08810019
               LENGTH=04,                                              X08820019
               ATTRB=(ASKIP,NORM),                                     X08830019
               COLOR=NEUTRAL,                                          X08840019
               INITIAL='ITEM'                                           08850019
          DFHMDF POS=(01,02),                                          X08860019
               LENGTH=15,                                              X08870019
               ATTRB=(ASKIP,NORM),                                     X08880019
               COLOR=NEUTRAL,                                          X08890019
               INITIAL='RECEIVE STORE.:'                                08900019
BRCVSTR   DFHMDF POS=(01,18),                                          X08910019
               LENGTH=04,                                              X08920023
               ATTRB=(ASKIP,NORM),                                     X08930019
               COLOR=BLUE                                               08940019
BSTRTIT   DFHMDF POS=(01,56),                                          X08950019
               LENGTH=05,                                              X08960019
               ATTRB=(NUM,UNPROT,NORM),                                X08970019
               COLOR=GREEN,                                            X08980019
               HILIGHT=UNDERLINE,                                      X08990019
               PICOUT='ZZZZ9'                                           09000019
          DFHMDF POS=(01,62),                                          X09010019
               LENGTH=02,                                              X09020019
               ATTRB=(ASKIP,NORM),                                     X09030019
               COLOR=NEUTRAL,                                          X09040019
               INITIAL='TO'                                             09050019
BENDIT    DFHMDF POS=(01,65),                                          X09060019
               LENGTH=05,                                              X09070019
               ATTRB=(ASKIP,NORM),                                     X09080019
               COLOR=BLUE,                                             X09090019
               PICOUT='ZZZZ9'                                           09100019
          DFHMDF POS=(01,71),                                          X09110019
               LENGTH=02,                                              X09120019
               ATTRB=(ASKIP,NORM),                                     X09130019
               COLOR=NEUTRAL,                                          X09140019
               INITIAL='OF'                                             09150019
BTOTIT    DFHMDF POS=(01,74),                                          X09160019
               LENGTH=05,                                              X09170019
               ATTRB=(ASKIP,NORM),                                     X09180019
               COLOR=BLUE,                                             X09190019
               PICOUT='ZZZZ9'                                           09200019
        DFHMDF POS=(02,02),                                            X09210019
               LENGTH=15,                                              X09220019
               ATTRB=(ASKIP,BRT),                                      X09230019
               INITIAL='TRANSFER NO...:',                              X09240019
               COLOR=NEUTRAL                                            09250019
BXFERNO DFHMDF POS=(02,18),                                            X09260019
               LENGTH=13,                                              X09270024
               ATTRB=(ASKIP,NORM),                                     X09280019
               COLOR=BLUE                                               09290019
        DFHMDF POS=(03,71),                                            X09300019
               LENGTH=07,                                              X09310019
               ATTRB=(ASKIP,BRT),                                      X09320019
               INITIAL='TRN REC',                                      X09330019
               COLOR=NEUTRAL                                            09340019
        DFHMDF POS=(04,02),                                            X09350019
               LENGTH=19,                                              X09360019
               ATTRB=(ASKIP,BRT),                                      X09370019
               INITIAL='LN ITEM DESCRIPTION',                          X09380019
               COLOR=NEUTRAL                                            09390019
        DFHMDF POS=(04,46),                                            X09400019
               LENGTH=14,                                              X09410019
               ATTRB=(ASKIP,BRT),                                      X09420019
               INITIAL='FIXTURE NUMBER',                               X09430019
               COLOR=NEUTRAL                                            09440019
        DFHMDF POS=(04,67),                                            X09450019
               LENGTH=11,                                              X09460019
               ATTRB=(ASKIP,BRT),                                      X09470019
               INITIAL='DPT QTY QTY',                                  X09480019
               COLOR=NEUTRAL                                            09490019
BLINE01 DFHMDF POS=(05,01),                                            X09500019
               LENGTH=03,                                              X09510019
               ATTRB=(ASKIP,NORM),                                     X09520019
               COLOR=BLUE                                               09530019
BDESC01 DFHMDF POS=(05,05),                                            X09540019
               LENGTH=40,                                              X09550019
               ATTRB=(UNPROT,NORM),                                    X09560019
               HILIGHT=UNDERLINE,                                      X09570019
               COLOR=GREEN                                              09580019
BFIXT01 DFHMDF POS=(05,46),                                            X09590019
               LENGTH=20,                                              X09600019
               ATTRB=(UNPROT,NORM),                                    X09610019
               HILIGHT=UNDERLINE,                                      X09620019
               COLOR=GREEN                                              09630019
BDEPT01 DFHMDF POS=(05,67),                                            X09640019
               LENGTH=03,                                              X09650019
               ATTRB=(UNPROT,NORM),                                    X09660019
               HILIGHT=UNDERLINE,                                      X09670019
               COLOR=GREEN                                              09680019
BTQTY01  DFHMDF POS=(05,71),                                           X09690019
               LENGTH=03,                                              X09700019
               ATTRB=(ASKIP,NORM),                                     X09710019
               COLOR=BLUE                                               09720019
BRQTY01  DFHMDF POS=(05,75),                                           X09730019
               LENGTH=03,                                              X09740019
               ATTRB=(NUM,UNPROT,NORM),                                X09750019
               HILIGHT=UNDERLINE,                                      X09760019
               COLOR=GREEN                                              09770019
        DFHMDF POS=(05,79),                                            X09780019
               LENGTH=01,                                              X09790019
               ATTRB=(ASKIP)                                            09800019
BLINE02 DFHMDF POS=(06,01),                                            X09810019
               LENGTH=03,                                              X09820019
               ATTRB=(ASKIP,NORM),                                     X09830019
               COLOR=BLUE                                               09840019
BDESC02 DFHMDF POS=(06,05),                                            X09850019
               LENGTH=40,                                              X09860019
               ATTRB=(UNPROT,NORM),                                    X09870019
               HILIGHT=UNDERLINE,                                      X09880019
               COLOR=GREEN                                              09890019
BFIXT02 DFHMDF POS=(06,46),                                            X09900019
               LENGTH=20,                                              X09910019
               ATTRB=(UNPROT,NORM),                                    X09920019
               HILIGHT=UNDERLINE,                                      X09930019
               COLOR=GREEN                                              09940019
BDEPT02 DFHMDF POS=(06,67),                                            X09950019
               LENGTH=03,                                              X09960019
               ATTRB=(UNPROT,NORM),                                    X09970019
               HILIGHT=UNDERLINE,                                      X09980019
               COLOR=GREEN                                              09990019
BTQTY02  DFHMDF POS=(06,71),                                           X10000019
               LENGTH=03,                                              X10010019
               ATTRB=(ASKIP,NORM),                                     X10020019
               COLOR=BLUE                                               10030019
BRQTY02  DFHMDF POS=(06,75),                                           X10040019
               LENGTH=03,                                              X10050019
               ATTRB=(NUM,UNPROT,NORM),                                X10060019
               HILIGHT=UNDERLINE,                                      X10070019
               COLOR=GREEN                                              10080019
        DFHMDF POS=(06,79),                                            X10090019
               LENGTH=01,                                              X10100019
               ATTRB=(ASKIP)                                            10110019
BLINE03 DFHMDF POS=(07,01),                                            X10120019
               LENGTH=03,                                              X10130019
               ATTRB=(ASKIP,NORM),                                     X10140019
               COLOR=BLUE                                               10150019
BDESC03 DFHMDF POS=(07,05),                                            X10160019
               LENGTH=40,                                              X10170019
               ATTRB=(UNPROT,NORM),                                    X10180019
               HILIGHT=UNDERLINE,                                      X10190019
               COLOR=GREEN                                              10200019
BFIXT03 DFHMDF POS=(07,46),                                            X10210019
               LENGTH=20,                                              X10220019
               ATTRB=(UNPROT,NORM),                                    X10230019
               HILIGHT=UNDERLINE,                                      X10240019
               COLOR=GREEN                                              10250019
BDEPT03 DFHMDF POS=(07,67),                                            X10260019
               LENGTH=03,                                              X10270019
               ATTRB=(UNPROT,NORM),                                    X10280019
               HILIGHT=UNDERLINE,                                      X10290019
               COLOR=GREEN                                              10300019
BTQTY03  DFHMDF POS=(07,71),                                           X10310019
               LENGTH=03,                                              X10320019
               ATTRB=(ASKIP,NORM),                                     X10330019
               COLOR=BLUE                                               10340019
BRQTY03  DFHMDF POS=(07,75),                                           X10350019
               LENGTH=03,                                              X10360019
               ATTRB=(NUM,UNPROT,NORM),                                X10370019
               HILIGHT=UNDERLINE,                                      X10380019
               COLOR=GREEN                                              10390019
        DFHMDF POS=(07,79),                                            X10400019
               LENGTH=01,                                              X10410019
               ATTRB=(ASKIP)                                            10420019
BLINE04 DFHMDF POS=(08,01),                                            X10430019
               LENGTH=03,                                              X10440019
               ATTRB=(ASKIP,NORM),                                     X10450019
               COLOR=BLUE                                               10460019
BDESC04 DFHMDF POS=(08,05),                                            X10470019
               LENGTH=40,                                              X10480019
               ATTRB=(UNPROT,NORM),                                    X10490019
               HILIGHT=UNDERLINE,                                      X10500019
               COLOR=GREEN                                              10510019
BFIXT04 DFHMDF POS=(08,46),                                            X10520019
               LENGTH=20,                                              X10530019
               ATTRB=(UNPROT,NORM),                                    X10540019
               HILIGHT=UNDERLINE,                                      X10550019
               COLOR=GREEN                                              10560019
BDEPT04 DFHMDF POS=(08,67),                                            X10570019
               LENGTH=03,                                              X10580019
               ATTRB=(UNPROT,NORM),                                    X10590019
               HILIGHT=UNDERLINE,                                      X10600019
               COLOR=GREEN                                              10610019
BTQTY04  DFHMDF POS=(08,71),                                           X10620019
               LENGTH=03,                                              X10630019
               ATTRB=(ASKIP,NORM),                                     X10640019
               COLOR=BLUE                                               10650019
BRQTY04  DFHMDF POS=(08,75),                                           X10660019
               LENGTH=03,                                              X10670019
               ATTRB=(NUM,UNPROT,NORM),                                X10680019
               HILIGHT=UNDERLINE,                                      X10690019
               COLOR=GREEN                                              10700019
        DFHMDF POS=(08,79),                                            X10710019
               LENGTH=01,                                              X10720019
               ATTRB=(ASKIP)                                            10730019
BLINE05 DFHMDF POS=(09,01),                                            X10740019
               LENGTH=03,                                              X10750019
               ATTRB=(ASKIP,NORM),                                     X10760019
               COLOR=BLUE                                               10770019
BDESC05 DFHMDF POS=(09,05),                                            X10780019
               LENGTH=40,                                              X10790019
               ATTRB=(UNPROT,NORM),                                    X10800019
               HILIGHT=UNDERLINE,                                      X10810019
               COLOR=GREEN                                              10820019
BFIXT05 DFHMDF POS=(09,46),                                            X10830019
               LENGTH=20,                                              X10840019
               ATTRB=(UNPROT,NORM),                                    X10850019
               HILIGHT=UNDERLINE,                                      X10860019
               COLOR=GREEN                                              10870019
BDEPT05 DFHMDF POS=(09,67),                                            X10880019
               LENGTH=03,                                              X10890019
               ATTRB=(UNPROT,NORM),                                    X10900019
               HILIGHT=UNDERLINE,                                      X10910019
               COLOR=GREEN                                              10920019
BTQTY05  DFHMDF POS=(09,71),                                           X10930019
               LENGTH=03,                                              X10940019
               ATTRB=(ASKIP,NORM),                                     X10950019
               COLOR=BLUE                                               10960019
BRQTY05  DFHMDF POS=(09,75),                                           X10970019
               LENGTH=03,                                              X10980019
               ATTRB=(NUM,UNPROT,NORM),                                X10990019
               HILIGHT=UNDERLINE,                                      X11000019
               COLOR=GREEN                                              11010019
        DFHMDF POS=(09,79),                                            X11020019
               LENGTH=01,                                              X11030019
               ATTRB=(ASKIP)                                            11040019
BLINE06 DFHMDF POS=(10,01),                                            X11050019
               LENGTH=03,                                              X11060019
               ATTRB=(ASKIP,NORM),                                     X11070019
               COLOR=BLUE                                               11080019
BDESC06 DFHMDF POS=(10,05),                                            X11090019
               LENGTH=40,                                              X11100019
               ATTRB=(UNPROT,NORM),                                    X11110019
               HILIGHT=UNDERLINE,                                      X11120019
               COLOR=GREEN                                              11130019
BFIXT06 DFHMDF POS=(10,46),                                            X11140019
               LENGTH=20,                                              X11150019
               ATTRB=(UNPROT,NORM),                                    X11160019
               HILIGHT=UNDERLINE,                                      X11170019
               COLOR=GREEN                                              11180019
BDEPT06 DFHMDF POS=(10,67),                                            X11190019
               LENGTH=03,                                              X11200019
               ATTRB=(UNPROT,NORM),                                    X11210019
               HILIGHT=UNDERLINE,                                      X11220019
               COLOR=GREEN                                              11230019
BTQTY06  DFHMDF POS=(10,71),                                           X11240019
               LENGTH=03,                                              X11250019
               ATTRB=(ASKIP,NORM),                                     X11260019
               COLOR=BLUE                                               11270019
BRQTY06  DFHMDF POS=(10,75),                                           X11280019
               LENGTH=03,                                              X11290019
               ATTRB=(NUM,UNPROT,NORM),                                X11300019
               HILIGHT=UNDERLINE,                                      X11310019
               COLOR=GREEN                                              11320019
        DFHMDF POS=(10,79),                                            X11330019
               LENGTH=01,                                              X11340019
               ATTRB=(ASKIP)                                            11350019
BLINE07 DFHMDF POS=(11,01),                                            X11360019
               LENGTH=03,                                              X11370019
               ATTRB=(ASKIP,NORM),                                     X11380019
               COLOR=BLUE                                               11390019
BDESC07 DFHMDF POS=(11,05),                                            X11400019
               LENGTH=40,                                              X11410019
               ATTRB=(UNPROT,NORM),                                    X11420019
               HILIGHT=UNDERLINE,                                      X11430019
               COLOR=GREEN                                              11440019
BFIXT07 DFHMDF POS=(11,46),                                            X11450019
               LENGTH=20,                                              X11460019
               ATTRB=(UNPROT,NORM),                                    X11470019
               HILIGHT=UNDERLINE,                                      X11480019
               COLOR=GREEN                                              11490019
BDEPT07 DFHMDF POS=(11,67),                                            X11500019
               LENGTH=03,                                              X11510019
               ATTRB=(UNPROT,NORM),                                    X11520019
               HILIGHT=UNDERLINE,                                      X11530019
               COLOR=GREEN                                              11540019
BTQTY07  DFHMDF POS=(11,71),                                           X11550019
               LENGTH=03,                                              X11560019
               ATTRB=(ASKIP,NORM),                                     X11570019
               COLOR=BLUE                                               11580019
BRQTY07  DFHMDF POS=(11,75),                                           X11590019
               LENGTH=03,                                              X11600019
               ATTRB=(NUM,UNPROT,NORM),                                X11610019
               HILIGHT=UNDERLINE,                                      X11620019
               COLOR=GREEN                                              11630019
        DFHMDF POS=(11,79),                                            X11640019
               LENGTH=01,                                              X11650019
               ATTRB=(ASKIP)                                            11660019
BLINE08 DFHMDF POS=(12,01),                                            X11670019
               LENGTH=03,                                              X11680019
               ATTRB=(ASKIP,NORM),                                     X11690019
               COLOR=BLUE                                               11700019
BDESC08 DFHMDF POS=(12,05),                                            X11710019
               LENGTH=40,                                              X11720019
               ATTRB=(UNPROT,NORM),                                    X11730019
               HILIGHT=UNDERLINE,                                      X11740019
               COLOR=GREEN                                              11750019
BFIXT08 DFHMDF POS=(12,46),                                            X11760019
               LENGTH=20,                                              X11770019
               ATTRB=(UNPROT,NORM),                                    X11780019
               HILIGHT=UNDERLINE,                                      X11790019
               COLOR=GREEN                                              11800019
BDEPT08 DFHMDF POS=(12,67),                                            X11810019
               LENGTH=03,                                              X11820019
               ATTRB=(UNPROT,NORM),                                    X11830019
               HILIGHT=UNDERLINE,                                      X11840019
               COLOR=GREEN                                              11850019
BTQTY08  DFHMDF POS=(12,71),                                           X11860019
               LENGTH=03,                                              X11870019
               ATTRB=(ASKIP,NORM),                                     X11880019
               COLOR=BLUE                                               11890019
BRQTY08  DFHMDF POS=(12,75),                                           X11900019
               LENGTH=03,                                              X11910019
               ATTRB=(NUM,UNPROT,NORM),                                X11920019
               HILIGHT=UNDERLINE,                                      X11930019
               COLOR=GREEN                                              11940019
        DFHMDF POS=(12,79),                                            X11950019
               LENGTH=01,                                              X11960019
               ATTRB=(ASKIP)                                            11970019
BLINE09 DFHMDF POS=(13,01),                                            X11980019
               LENGTH=03,                                              X11990019
               ATTRB=(ASKIP,NORM),                                     X12000019
               COLOR=BLUE                                               12010019
BDESC09 DFHMDF POS=(13,05),                                            X12020019
               LENGTH=40,                                              X12030019
               ATTRB=(UNPROT,NORM),                                    X12040019
               HILIGHT=UNDERLINE,                                      X12050019
               COLOR=GREEN                                              12060019
BFIXT09 DFHMDF POS=(13,46),                                            X12070019
               LENGTH=20,                                              X12080019
               ATTRB=(UNPROT,NORM),                                    X12090019
               HILIGHT=UNDERLINE,                                      X12100019
               COLOR=GREEN                                              12110019
BDEPT09 DFHMDF POS=(13,67),                                            X12120019
               LENGTH=03,                                              X12130019
               ATTRB=(UNPROT,NORM),                                    X12140019
               HILIGHT=UNDERLINE,                                      X12150019
               COLOR=GREEN                                              12160019
BTQTY09  DFHMDF POS=(13,71),                                           X12170019
               LENGTH=03,                                              X12180019
               ATTRB=(ASKIP,NORM),                                     X12190019
               COLOR=BLUE                                               12200019
BRQTY09  DFHMDF POS=(13,75),                                           X12210019
               LENGTH=03,                                              X12220019
               ATTRB=(NUM,UNPROT,NORM),                                X12230019
               HILIGHT=UNDERLINE,                                      X12240019
               COLOR=GREEN                                              12250019
        DFHMDF POS=(13,79),                                            X12260019
               LENGTH=01,                                              X12270019
               ATTRB=(ASKIP)                                            12280019
BLINE10 DFHMDF POS=(14,01),                                            X12290019
               LENGTH=03,                                              X12300019
               ATTRB=(ASKIP,NORM),                                     X12310019
               COLOR=BLUE                                               12320019
BDESC10 DFHMDF POS=(14,05),                                            X12330019
               LENGTH=40,                                              X12340019
               ATTRB=(UNPROT,NORM),                                    X12350019
               HILIGHT=UNDERLINE,                                      X12360019
               COLOR=GREEN                                              12370019
BFIXT10 DFHMDF POS=(14,46),                                            X12380019
               LENGTH=20,                                              X12390019
               ATTRB=(UNPROT,NORM),                                    X12400019
               HILIGHT=UNDERLINE,                                      X12410019
               COLOR=GREEN                                              12420019
BDEPT10 DFHMDF POS=(14,67),                                            X12430019
               LENGTH=03,                                              X12440019
               ATTRB=(UNPROT,NORM),                                    X12450019
               HILIGHT=UNDERLINE,                                      X12460019
               COLOR=GREEN                                              12470019
BTQTY10  DFHMDF POS=(14,71),                                           X12480019
               LENGTH=03,                                              X12490019
               ATTRB=(ASKIP,NORM),                                     X12500019
               COLOR=BLUE                                               12510019
BRQTY10  DFHMDF POS=(14,75),                                           X12520019
               LENGTH=03,                                              X12530019
               ATTRB=(NUM,UNPROT,NORM),                                X12540019
               HILIGHT=UNDERLINE,                                      X12550019
               COLOR=GREEN                                              12560019
        DFHMDF POS=(14,79),                                            X12570019
               LENGTH=01,                                              X12580019
               ATTRB=(ASKIP)                                            12590019
BLINE11 DFHMDF POS=(15,01),                                            X12600019
               LENGTH=03,                                              X12610019
               ATTRB=(ASKIP,NORM),                                     X12620019
               COLOR=BLUE                                               12630019
BDESC11 DFHMDF POS=(15,05),                                            X12640019
               LENGTH=40,                                              X12650019
               ATTRB=(UNPROT,NORM),                                    X12660019
               HILIGHT=UNDERLINE,                                      X12670019
               COLOR=GREEN                                              12680019
BFIXT11 DFHMDF POS=(15,46),                                            X12690019
               LENGTH=20,                                              X12700019
               ATTRB=(UNPROT,NORM),                                    X12710019
               HILIGHT=UNDERLINE,                                      X12720019
               COLOR=GREEN                                              12730019
BDEPT11 DFHMDF POS=(15,67),                                            X12740019
               LENGTH=03,                                              X12750019
               ATTRB=(UNPROT,NORM),                                    X12760019
               HILIGHT=UNDERLINE,                                      X12770019
               COLOR=GREEN                                              12780019
BTQTY11  DFHMDF POS=(15,71),                                           X12790019
               LENGTH=03,                                              X12800019
               ATTRB=(ASKIP,NORM),                                     X12810019
               COLOR=BLUE                                               12820019
BRQTY11  DFHMDF POS=(15,75),                                           X12830019
               LENGTH=03,                                              X12840019
               ATTRB=(NUM,UNPROT,NORM),                                X12850019
               HILIGHT=UNDERLINE,                                      X12860019
               COLOR=GREEN                                              12870019
        DFHMDF POS=(15,79),                                            X12880019
               LENGTH=01,                                              X12890019
               ATTRB=(ASKIP)                                            12900019
BLINE12 DFHMDF POS=(16,01),                                            X12910019
               LENGTH=03,                                              X12920019
               ATTRB=(ASKIP,NORM),                                     X12930019
               COLOR=BLUE                                               12940019
BDESC12 DFHMDF POS=(16,05),                                            X12950019
               LENGTH=40,                                              X12960019
               ATTRB=(UNPROT,NORM),                                    X12970019
               HILIGHT=UNDERLINE,                                      X12980019
               COLOR=GREEN                                              12990019
BFIXT12 DFHMDF POS=(16,46),                                            X13000019
               LENGTH=20,                                              X13010019
               ATTRB=(UNPROT,NORM),                                    X13020019
               HILIGHT=UNDERLINE,                                      X13030019
               COLOR=GREEN                                              13040019
BDEPT12 DFHMDF POS=(16,67),                                            X13050019
               LENGTH=03,                                              X13060019
               ATTRB=(UNPROT,NORM),                                    X13070019
               HILIGHT=UNDERLINE,                                      X13080019
               COLOR=GREEN                                              13090019
BTQTY12  DFHMDF POS=(16,71),                                           X13100019
               LENGTH=03,                                              X13110019
               ATTRB=(ASKIP,NORM),                                     X13120019
               COLOR=BLUE                                               13130019
BRQTY12  DFHMDF POS=(16,75),                                           X13140019
               LENGTH=03,                                              X13150019
               ATTRB=(NUM,UNPROT,NORM),                                X13160019
               HILIGHT=UNDERLINE,                                      X13170019
               COLOR=GREEN                                              13180019
        DFHMDF POS=(16,79),                                            X13190019
               LENGTH=01,                                              X13200019
               ATTRB=(ASKIP)                                            13210019
BLINE13 DFHMDF POS=(17,01),                                            X13220019
               LENGTH=03,                                              X13230019
               ATTRB=(ASKIP,NORM),                                     X13240019
               COLOR=BLUE                                               13250019
BDESC13 DFHMDF POS=(17,05),                                            X13260019
               LENGTH=40,                                              X13270019
               ATTRB=(UNPROT,NORM),                                    X13280019
               HILIGHT=UNDERLINE,                                      X13290019
               COLOR=GREEN                                              13300019
BFIXT13 DFHMDF POS=(17,46),                                            X13310019
               LENGTH=20,                                              X13320019
               ATTRB=(UNPROT,NORM),                                    X13330019
               HILIGHT=UNDERLINE,                                      X13340019
               COLOR=GREEN                                              13350019
BDEPT13 DFHMDF POS=(17,67),                                            X13360019
               LENGTH=03,                                              X13370019
               ATTRB=(UNPROT,NORM),                                    X13380019
               HILIGHT=UNDERLINE,                                      X13390019
               COLOR=GREEN                                              13400019
BTQTY13  DFHMDF POS=(17,71),                                           X13410019
               LENGTH=03,                                              X13420019
               ATTRB=(ASKIP,NORM),                                     X13430019
               COLOR=BLUE                                               13440019
BRQTY13  DFHMDF POS=(17,75),                                           X13450019
               LENGTH=03,                                              X13460019
               ATTRB=(NUM,UNPROT,NORM),                                X13470019
               HILIGHT=UNDERLINE,                                      X13480019
               COLOR=GREEN                                              13490019
        DFHMDF POS=(17,79),                                            X13500019
               LENGTH=01,                                              X13510019
               ATTRB=(ASKIP)                                            13520019
BLINE14 DFHMDF POS=(18,01),                                            X13530019
               LENGTH=03,                                              X13540019
               ATTRB=(ASKIP,NORM),                                     X13550019
               COLOR=BLUE                                               13560019
BDESC14 DFHMDF POS=(18,05),                                            X13570019
               LENGTH=40,                                              X13580019
               ATTRB=(UNPROT,NORM),                                    X13590019
               HILIGHT=UNDERLINE,                                      X13600019
               COLOR=GREEN                                              13610019
BFIXT14 DFHMDF POS=(18,46),                                            X13620019
               LENGTH=20,                                              X13630019
               ATTRB=(UNPROT,NORM),                                    X13640019
               HILIGHT=UNDERLINE,                                      X13650019
               COLOR=GREEN                                              13660019
BDEPT14 DFHMDF POS=(18,67),                                            X13670019
               LENGTH=03,                                              X13680019
               ATTRB=(UNPROT,NORM),                                    X13690019
               HILIGHT=UNDERLINE,                                      X13700019
               COLOR=GREEN                                              13710019
BTQTY14  DFHMDF POS=(18,71),                                           X13720019
               LENGTH=03,                                              X13730019
               ATTRB=(ASKIP,NORM),                                     X13740019
               COLOR=BLUE                                               13750019
BRQTY14  DFHMDF POS=(18,75),                                           X13760019
               LENGTH=03,                                              X13770019
               ATTRB=(NUM,UNPROT,NORM),                                X13780019
               HILIGHT=UNDERLINE,                                      X13790019
               COLOR=GREEN                                              13800019
        DFHMDF POS=(18,79),                                            X13810019
               LENGTH=01,                                              X13820019
               ATTRB=(ASKIP)                                            13830019
BLINE15 DFHMDF POS=(19,01),                                            X13840019
               LENGTH=03,                                              X13850019
               ATTRB=(ASKIP,NORM),                                     X13860019
               COLOR=BLUE                                               13870019
BDESC15 DFHMDF POS=(19,05),                                            X13880019
               LENGTH=40,                                              X13890019
               ATTRB=(UNPROT,NORM),                                    X13900019
               HILIGHT=UNDERLINE,                                      X13910019
               COLOR=GREEN                                              13920019
BFIXT15 DFHMDF POS=(19,46),                                            X13930019
               LENGTH=20,                                              X13940019
               ATTRB=(UNPROT,NORM),                                    X13950019
               HILIGHT=UNDERLINE,                                      X13960019
               COLOR=GREEN                                              13970019
BDEPT15 DFHMDF POS=(19,67),                                            X13980019
               LENGTH=03,                                              X13990019
               ATTRB=(UNPROT,NORM),                                    X14000019
               HILIGHT=UNDERLINE,                                      X14010019
               COLOR=GREEN                                              14020019
BTQTY15  DFHMDF POS=(19,71),                                           X14030019
               LENGTH=03,                                              X14040019
               ATTRB=(ASKIP,NORM),                                     X14050019
               COLOR=BLUE                                               14060019
BRQTY15  DFHMDF POS=(19,75),                                           X14070019
               LENGTH=03,                                              X14080019
               ATTRB=(NUM,UNPROT,NORM),                                X14090019
               HILIGHT=UNDERLINE,                                      X14100019
               COLOR=GREEN                                              14110019
        DFHMDF POS=(19,79),                                            X14120019
               LENGTH=01,                                              X14130019
               ATTRB=(ASKIP)                                            14140019
*                                                                       14150019
        DFHMSD TYPE=FINAL                                               14160019
*                                                                       14170019
        END                                                             14180019
