        PRINT  NOGEN                                                    00002   
TFKM435 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
TF435A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
AXFRNBR DFHMDF POS=(01,15),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FROM',                                         X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
AFRNBR  DFHMDF POS=(01,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNAME DFHMDF POS=(01,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,40),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TO',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(02,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
ATONBR  DFHMDF POS=(02,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONAME DFHMDF POS=(02,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,40),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RECEIVE',                                      X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(03,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
ARCNBR  DFHMDF POS=(03,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARCNAME DFHMDF POS=(03,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(04,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**4
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(04,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**7
               COLOR=GREEN,                                            C00019   
               HILIGHT=UNDERLINE,                                      C00020   
               PICOUT='ZZZZ9'                                           00021   
        DFHMDF POS=(04,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='TO'                                             00024   
AENDIT  DFHMDF POS=(04,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026   
               PICOUT='ZZZZ9'                                           00027   
        DFHMDF POS=(04,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029   
               INITIAL='OF'                                             00030   
ATOTIT  DFHMDF POS=(04,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032   
               PICOUT='ZZZZ9'                                           00033   
        DFHMDF POS=(05,02),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(05,21),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='DATE',                                         X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(05,34),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STATUS',                                       X00027   
               COLOR=NEUTRAL                                            00032   
*                                                                               
ASTNO1  DFHMDF POS=(06,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM1  DFHMDF POS=(06,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE1  DFHMDF POS=(06,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT1  DFHMDF POS=(06,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO2  DFHMDF POS=(07,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM2  DFHMDF POS=(07,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE2  DFHMDF POS=(07,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT2  DFHMDF POS=(07,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO3  DFHMDF POS=(08,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM3  DFHMDF POS=(08,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE3  DFHMDF POS=(08,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT3  DFHMDF POS=(08,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO4  DFHMDF POS=(09,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM4  DFHMDF POS=(09,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE4  DFHMDF POS=(09,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT4  DFHMDF POS=(09,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO5  DFHMDF POS=(10,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM5  DFHMDF POS=(10,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE5  DFHMDF POS=(10,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT5  DFHMDF POS=(10,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO6  DFHMDF POS=(11,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM6  DFHMDF POS=(11,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE6  DFHMDF POS=(11,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT6  DFHMDF POS=(11,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO7  DFHMDF POS=(12,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM7  DFHMDF POS=(12,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE7  DFHMDF POS=(12,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT7  DFHMDF POS=(12,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO8  DFHMDF POS=(13,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM8  DFHMDF POS=(13,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE8  DFHMDF POS=(13,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT8  DFHMDF POS=(13,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO9  DFHMDF POS=(14,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM9  DFHMDF POS=(14,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE9  DFHMDF POS=(14,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT9  DFHMDF POS=(14,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO10 DFHMDF POS=(15,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM10 DFHMDF POS=(15,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE10 DFHMDF POS=(15,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT10 DFHMDF POS=(15,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO11 DFHMDF POS=(16,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM11 DFHMDF POS=(16,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE11 DFHMDF POS=(16,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT11 DFHMDF POS=(16,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO12 DFHMDF POS=(17,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM12 DFHMDF POS=(17,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE12 DFHMDF POS=(17,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT12 DFHMDF POS=(17,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO13 DFHMDF POS=(18,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM13 DFHMDF POS=(18,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE13 DFHMDF POS=(18,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT13 DFHMDF POS=(18,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
*                                                                               
ASTNO14 DFHMDF POS=(19,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ASTNM14 DFHMDF POS=(19,07),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ADATE14 DFHMDF POS=(19,21),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               PICOUT='99/99/9999',                                    X00026   
               COLOR=BLUE                                               00056   
ASTAT14 DFHMDF POS=(19,34),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
