        PRINT  NOGEN                                                    00002   
TFKM451 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
TF451A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(02,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
          DFHMDF POS=(01,02),                                          X00016**4
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL,                                          X00023   
               INITIAL='RECEIVE STORE.:'                                00017**3
ARCVSTR   DFHMDF POS=(01,18),                                          X00016**4
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00023   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO...:',                              X00027   
               COLOR=NEUTRAL                                            00032   
AXFERNO DFHMDF POS=(02,18),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RECEIVED BY...:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ARCVINT DFHMDF POS=(02,56),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
ARCVNAM DFHMDF POS=(02,58),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(02,79),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF451B  DFHMDI LINE=4,COLUMN=01,                                       X00010**5
               SIZE=(02,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='LG TOTE SEAL..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
BLGTOT1 DFHMDF POS=(01,18),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
BLGTOT2 DFHMDF POS=(01,26),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,34),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='SM TOTE SEAL..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
BSMTOT  DFHMDF POS=(01,56),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,64),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF451C  DFHMDI LINE=4,COLUMN=01,                                       X00010**5
               SIZE=(02,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRAILER SEAL..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
CTRLRSL DFHMDF POS=(01,18),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,26),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRAILER NO....:',                              X00027   
               COLOR=NEUTRAL                                            00032   
CTRLRNO DFHMDF POS=(01,56),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(UNPROT,NORM),                                    X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,65),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF451D  DFHMDI LINE=6,COLUMN=01,                                       X00010**5
               SIZE=(03,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER TYPE.:',                              X00027   
               COLOR=NEUTRAL                                            00032   
DXFRTYP DFHMDF POS=(01,18),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
DXFRDSC DFHMDF POS=(01,20),                                            X00029   
               LENGTH=19,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CONTAINER TYPE:',                              X00027   
               COLOR=NEUTRAL                                            00032   
DCONTYP DFHMDF POS=(01,56),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
DCONDSC DFHMDF POS=(01,58),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FROM STORE....:',                              X00027   
               COLOR=NEUTRAL                                            00032   
DFRNO   DFHMDF POS=(02,18),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
DFRNAM  DFHMDF POS=(02,23),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TO STORE......:',                              X00027   
               COLOR=NEUTRAL                                            00032   
DTONO   DFHMDF POS=(02,56),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
DTONAM  DFHMDF POS=(02,61),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00009   
TF451E  DFHMDI LINE=9,COLUMN=01,                                       X00010**5
               SIZE=(01,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CALLBACK NO...:',                              X00027   
               COLOR=NEUTRAL                                            00032   
ECALLBK DFHMDF POS=(01,18),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(NUM,UNPROT,NORM),                                X00026   
               HILIGHT=UNDERLINE,                                      X00026   
               COLOR=GREEN                                              00056   
        DFHMDF POS=(01,23),                                            X00029   
               LENGTH=01,                                              X00028   
               ATTRB=(ASKIP)                                            00026   
**************                                                          00009   
TF451F  DFHMDI LINE=9,COLUMN=01,                                       X00010**5
               SIZE=(01,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
FLITRL  DFHMDF POS=(01,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='APPROVAL NO...:',                              X00027   
               COLOR=NEUTRAL                                            00032   
FFIELD  DFHMDF POS=(01,18),                                            X00029   
               LENGTH=21,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
FATLIT  DFHMDF POS=(01,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ATTENTION TO..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
FATNINT DFHMDF POS=(01,56),                                            X00029   
               LENGTH=22,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00009   
TF451G  DFHMDI LINE=10,COLUMN=01,                                      X00010**5
               SIZE=(10,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
GNAMLIT DFHMDF POS=(01,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CUSTOMER NAME.:',                              X00027   
               COLOR=NEUTRAL                                            00032   
GCUSNAM DFHMDF POS=(01,18),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
GPHNLIT DFHMDF POS=(01,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=NEUTRAL                                            00056   
GPHONE  DFHMDF POS=(01,56),                                            X00029   
               LENGTH=14,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
GADDLIT DFHMDF POS=(02,05),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='ADDRESS....:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
GADDR1  DFHMDF POS=(02,18),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
GCTYLIT DFHMDF POS=(02,43),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='CITY.......:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
GCITY   DFHMDF POS=(02,56),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
GADDR2  DFHMDF POS=(03,18),                                            X00029   
               LENGTH=20,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
GSTLIT  DFHMDF POS=(03,43),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STATE/ZIP..:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
GSTATE  DFHMDF POS=(03,56),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
GZIP    DFHMDF POS=(03,59),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(05,02),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TOTAL QUANTITY:',                              X00027   
               COLOR=NEUTRAL                                            00032   
GTOTQTY DFHMDF POS=(05,18),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(05,40),                                            X00029   
               LENGTH=15,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TOTAL RETAIL..:',                              X00027   
               COLOR=NEUTRAL                                            00032   
GTOTRTL DFHMDF POS=(05,56),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00268   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
