          PRINT  NOGEN                                                  00002**1
TFKM446   DFHMSD TYPE=&SYSPARM,                                        X00003**1
               CTRL=(FREEKB),                                          X00004**1
               TERM=3270-2,                                            X00005**1
               LANG=COBOL,                                             X00006**1
               MODE=INOUT,                                             X00007**1
               TIOAPFX=YES,                                            X00008**1
               STORAGE=AUTO                                             00009**1
TF446A    DFHMDI LINE=2,                                               X00010**1
               COLUMN=1,                                               X00011**1
               MAPATTS=(COLOR,HILIGHT),                                X00012**1
               SIZE=(19,80),                                           X00013**1
               DSATTS=(COLOR,HILIGHT)                                   00014**1
          DFHMDF ATTRB=(ASKIP),                                        X00026**1
               COLOR=NEUTRAL,                                          X00027**1
               INITIAL='ENTER FROM STORE:',                            X00028**1
               POS=(2,22),                                             X00030**1
               LENGTH=17                                                00031**1
ASTRNBR   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(2,40),                                             X00030**1
               LENGTH=04                                                00242**1
ASTRNAM   DFHMDF ATTRB=(ASKIP),                                        X00237**1
               COLOR=BLUE,                                             X00238**1
               POS=(2,45),                                             X00030**1
               LENGTH=10                                                00242**1
         DFHMSD TYPE=FINAL                                              00279**1
         END                                                            00280**1
