        PRINT  NOGEN                                                    00002   
TFKM438 DFHMSD TYPE=DSECT,                                             X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               STORAGE=AUTO,                                           X00006   
               TERM=3270-2,                                            X00007   
               TIOAPFX=YES                                              00008   
**************                                                          00009   
TF438A  DFHMDI LINE=2,COLUMN=1,                                        X00010**5
               SIZE=(19,80),                                           X00011**5
               CTRL=(FREEKB),                                          X00012   
               MAPATTS=(COLOR,HILIGHT),                                X00013   
               DSATTS=(COLOR,HILIGHT)                                   00014   
**************                                                          00015   
        DFHMDF POS=(01,02),                                            X00029   
               LENGTH=12,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TRANSFER NO:',                                 X00027   
               COLOR=NEUTRAL                                            00032   
AXFRNBR DFHMDF POS=(01,15),                                            X00029   
               LENGTH=11,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(01,40),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FROM',                                         X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(01,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
AFRNBR  DFHMDF POS=(01,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNAME DFHMDF POS=(01,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(02,40),                                            X00029   
               LENGTH=02,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='TO',                                           X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(02,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
ATONBR  DFHMDF POS=(02,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONAME DFHMDF POS=(02,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(03,40),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RECEIVE',                                      X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(03,48),                                            X00029   
               LENGTH=06,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='STORE:',                                       X00027   
               COLOR=NEUTRAL                                            00032   
ARCNBR  DFHMDF POS=(03,55),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ARCNAME DFHMDF POS=(03,60),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(04,01),LENGTH=79,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='***********************************************C00024   
               ********************************'                        00024   
        DFHMDF POS=(05,02),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='DATE',                                         X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(05,16),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='FRM STORE',                                    X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(05,28),                                            X00029   
               LENGTH=13,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='RCV STORE QTY',                                X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(05,45),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='PRICE',                                        X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(05,52),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='EXTENDED',                                     X00027   
               COLOR=NEUTRAL                                            00032   
        DFHMDF POS=(05,62),                                            X00029   
               LENGTH=07,                                              X00028   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='REASON',                                       X00027   
               COLOR=NEUTRAL                                            00032   
**************                                                          00015   
ADATE1  DFHMDF POS=(06,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO1  DFHMDF POS=(06,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM1  DFHMDF POS=(06,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO1  DFHMDF POS=(06,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM1  DFHMDF POS=(06,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY1   DFHMDF POS=(06,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC1  DFHMDF POS=(06,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT1   DFHMDF POS=(06,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS1  DFHMDF POS=(06,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00015   
ADATE2  DFHMDF POS=(07,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO2  DFHMDF POS=(07,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM2  DFHMDF POS=(07,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO2  DFHMDF POS=(07,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM2  DFHMDF POS=(07,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY2   DFHMDF POS=(07,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC2  DFHMDF POS=(07,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT2   DFHMDF POS=(07,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS2  DFHMDF POS=(07,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00015   
ADATE3  DFHMDF POS=(08,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO3  DFHMDF POS=(08,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM3  DFHMDF POS=(08,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO3  DFHMDF POS=(08,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM3  DFHMDF POS=(08,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY3   DFHMDF POS=(08,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC3  DFHMDF POS=(08,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT3   DFHMDF POS=(08,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS3  DFHMDF POS=(08,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00015   
ADATE4  DFHMDF POS=(09,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO4  DFHMDF POS=(09,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM4  DFHMDF POS=(09,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO4  DFHMDF POS=(09,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM4  DFHMDF POS=(09,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY4   DFHMDF POS=(09,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC4  DFHMDF POS=(09,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT4   DFHMDF POS=(09,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS4  DFHMDF POS=(09,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00015   
ADATE5  DFHMDF POS=(10,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO5  DFHMDF POS=(10,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM5  DFHMDF POS=(10,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO5  DFHMDF POS=(10,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM5  DFHMDF POS=(10,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY5   DFHMDF POS=(10,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC5  DFHMDF POS=(10,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT5   DFHMDF POS=(10,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS5  DFHMDF POS=(10,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00015   
ADATE6  DFHMDF POS=(11,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO6  DFHMDF POS=(11,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM6  DFHMDF POS=(11,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO6  DFHMDF POS=(11,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM6  DFHMDF POS=(11,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY6   DFHMDF POS=(11,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC6  DFHMDF POS=(11,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT6   DFHMDF POS=(11,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS6  DFHMDF POS=(11,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00015   
ADATE7  DFHMDF POS=(12,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO7  DFHMDF POS=(12,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM7  DFHMDF POS=(12,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO7  DFHMDF POS=(12,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM7  DFHMDF POS=(12,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY7   DFHMDF POS=(12,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC7  DFHMDF POS=(12,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT7   DFHMDF POS=(12,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS7  DFHMDF POS=(12,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00015   
ADATE8  DFHMDF POS=(13,02),                                            X00029   
               LENGTH=10,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNO8  DFHMDF POS=(13,14),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AFRNM8  DFHMDF POS=(13,20),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONO8  DFHMDF POS=(13,26),                                            X00029   
               LENGTH=04,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
ATONM8  DFHMDF POS=(13,32),                                            X00029   
               LENGTH=05,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AQTY8   DFHMDF POS=(13,38),                                            X00029   
               LENGTH=03,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
APRIC8  DFHMDF POS=(13,42),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AEXT8   DFHMDF POS=(13,51),                                            X00029   
               LENGTH=09,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
AREAS8  DFHMDF POS=(13,62),                                            X00029   
               LENGTH=18,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
**************                                                          00268   
        DFHMDF POS=(14,01),LENGTH=26,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='**************************'                     00024   
        DFHMDF POS=(14,28),LENGTH=11,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='COMMENTS BY'                                    00024   
AUSERID DFHMDF POS=(14,40),                                            X00029   
               LENGTH=08,                                              X00028   
               ATTRB=(ASKIP,NORM),                                     X00026   
               COLOR=BLUE                                               00056   
        DFHMDF POS=(14,49),LENGTH=30,                                  C00022**3
               ATTRB=(ASKIP,NORM),                                     C00022**3
               COLOR=NEUTRAL,                                          C00023   
               INITIAL='******************************'                 00024   
ACOMM1    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(14,80),                                            X00030**1
               LENGTH=79                                                00242**1
ACOMM2    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(15,80),                                            X00030**1
               LENGTH=79                                                00242**1
ACOMM3    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(16,80),                                            X00030**1
               LENGTH=79                                                00242**1
ACOMM4    DFHMDF ATTRB=(UNPROT,NORM),                                  X00237**1
               COLOR=GREEN,                                            X00238**1
               HILIGHT=UNDERLINE,                                      X00238**1
               POS=(17,80),                                            X00030**1
               LENGTH=79                                                00242**1
          DFHMDF ATTRB=(ASKIP),                                        X00237**1
               POS=(18,80),                                            X00030**1
               LENGTH=01                                                00242**1
**************                                                          00270   
        DFHMSD TYPE=FINAL                                               00269   
**************                                                          00270   
        END                                                             00271   
