000100 IDENTIFICATION DIVISION.                                         00010001
000200                                                                  00020001
000300 PROGRAM-ID.      TFKUT507.                                       00030001
000400 AUTHOR.          STEVEN NOWAK.                                   00040001
000500 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00050001
000600 DATE-WRITTEN.    03/22/10.                                       00060001
000700 DATE-COMPILED.                                                   00070001
000800                                                                  00080001
000900******************************************************************00090001
001000*  IDENTIFY F.A.S.T. TRANSFER RECORDS WHICH ARE MORE THATN 25     00100001
001100*  MONTHS OLD THAT NEED TO BE PURGED                              00110001
001200******************************************************************00120001
001300                                                                  00130001
001400 ENVIRONMENT DIVISION.                                            00140001
001500 CONFIGURATION SECTION.                                           00150001
001600                                                                  00160001
001700 SOURCE-COMPUTER.        IBM-3090.                                00170001
001800 OBJECT-COMPUTER.        IBM-3090.                                00180001
001900                                                                  00190001
002000 INPUT-OUTPUT SECTION.                                            00200001
002100 FILE-CONTROL.                                                    00210001
002200                                                                  00220001
002300     SELECT DATE-FILE ASSIGN TO INP01.                            00230004
002400     SELECT KEY-FILE  ASSIGN TO OUT01.                            00240004
002500                                                                  00250001
002600 DATA DIVISION.                                                   00260001
002700 FILE SECTION.                                                    00270001
002800                                                                  00280001
002900 FD  DATE-FILE                                                    00290001
003000     LABEL RECORDS ARE STANDARD                                   00300001
003100     RECORDING MODE IS F                                          00310001
003200     BLOCK CONTAINS 0 RECORDS                                     00320001
003300     RECORD CONTAINS 80 CHARACTERS                                00330001
003400     DATA RECORD IS DATE-REC.                                     00340001
003500                                                                  00350001
003600 01  DATE-REC                         PIC  X(80).                 00360001
003700                                                                  00370001
003800 FD  KEY-FILE                                                     00380001
003900     LABEL RECORDS ARE STANDARD                                   00390001
004000     RECORDING MODE IS F                                          00400001
004100     BLOCK CONTAINS 0 RECORDS                                     00410001
004200     RECORD CONTAINS 04 CHARACTERS                                00420001
004300     DATA RECORD IS KEY-REC.                                      00430001
004400                                                                  00440001
004500 01  KEY-REC                          PIC  X(04).                 00450001
004600                                                                  00460001
004700***************************************************************** 00470001
004800*                       WORKING STORAGE                           00480001
004900***************************************************************** 00490001
005000 WORKING-STORAGE SECTION.                                         00500001
005100                                                                  00510001
005200 01  W-START                          PIC  X(40)                  00520001
005300     VALUE 'TFKUT507 - WORKING STORAGE BEGINS HERE'.              00530001
005400                                                                  00540001
005500                                                                  00550001
005600***************************************************************** 00560001
005700*                         SWITCHES                                00570001
005800***************************************************************** 00580001
005900 01  PS-PROGRAM-SWITCHES.                                         00590001
006000     05  PS-END-OF-DELETES-IND        PIC  X(01) VALUE 'N'.       00600001
006100         88  PS-MORE-DELETES                     VALUE 'N'.       00610001
006200         88  PS-END-OF-DELETES                   VALUE 'Y'.       00620001
006300                                                                  00630001
006400     05  PS-EOF-CARDIN-SWITCH         PIC  X(01) VALUE 'N'.       00640001
006500         88  PS-EOF-CARDIN                       VALUE 'Y'.       00650001
006600         88  PS-NOT-EOF-CARDIN                   VALUE 'N'.       00660001
006700                                                                  00670001
006800******************************************************************00680001
006900*                       ACCUMULATORS                              00690001
007000******************************************************************00700001
007100 01  PROGRAM-ACCUMULATORS.                                        00710001
007200     05  PA-READ                      PIC  9(08) VALUE ZEROS.     00720001
007300     05  PA-WRITTEN                   PIC  9(08) VALUE ZEROS.     00730001
007400                                                                  00740001
007500******************************************************************00750001
007600*                           CONSTANTS                             00760001
007700******************************************************************00770001
007800 01  PC-PROGRAM-CONSTANTS.                                        00780001
007900     05  PC-PGM-NAME                  PIC  X(08) VALUE 'TFKUT507'.00790001
008000     05  PC-JOB-NAME                  PIC  X(08) VALUE 'SIK125'.  00800001
008100     05  PC-750-DAYS                  PIC  9(05) VALUE 750.       00810001
008200                                                                  00820001
008300******************************************************************00830001
008400*                          VARIABLES                              00840001
008500******************************************************************00850001
008600 01  PV-PROGRAM-VARIABLES.                                        00860001
008700     05  PV-PARAGRAPH-NAME            PIC  X(30) VALUE SPACE.     00870001
008800     05  PV-DB2-OPERATION             PIC  X(30) VALUE SPACE.     00880001
008900     05  PV-OPERATION-MSG             PIC  X(30) VALUE SPACE.     00890001
009000                                                                  00900001
009100     05  PV-CURR-DATE-MINUS-750       PIC  X(10) VALUE SPACES.    00910001
009200     05  PV-DISPLAY-XFER-DKEY-ID      PIC  9(09) VALUE ZEROS.     00920001
009300                                                                  00930001
009400******************************************************************00940001
009500*               SYSTEM TIME AND DATE VARIABLES                    00950001
009600******************************************************************00960001
009700 01  CC-CARDIN.                                                   00970001
009800     05  CC-CURR-DATE                 PIC  X(10) VALUE SPACES.    00980001
009900     05  FILLER                       PIC  X(70) VALUE SPACES.    00990001
010000                                                                  01000001
010100 01  SYS-DATE-TIME.                                               01010001
010200     05  SYS-DATE                     PIC  X(08) VALUE SPACES.    01020001
010300     05  SYS-TIME                     PIC  X(08) VALUE SPACES.    01030001
010400                                                                  01040001
010500 01  ST-BEG-TIME.                                                 01050001
010600     05  ST-BEG-HR                    PIC  9(02) VALUE ZEROS.     01060001
010700     05  FILLER                       PIC  X(01) VALUE ':'.       01070001
010800     05  ST-BEG-MN                    PIC  9(02) VALUE ZEROS.     01080001
010900                                                                  01090001
011000 01  ST-END-TIME.                                                 01100001
011100     05  ST-END-HR                    PIC  9(02) VALUE ZEROS.     01110001
011200     05  FILLER                       PIC  X(01) VALUE ':'.       01120001
011300     05  ST-END-MN                    PIC  9(02) VALUE ZEROS.     01130001
011400                                                                  01140001
011500 01  SD-EDIT-DATE.                                                01150001
011600     05  SD-MONTH                     PIC  9(02) VALUE ZEROS.     01160001
011700     05  FILLER                       PIC  X(01) VALUE '-'.       01170001
011800     05  SD-DAY                       PIC  9(02) VALUE ZEROS.     01180001
011900     05  FILLER                       PIC  X(01) VALUE '-'.       01190001
012000     05  SD-CENT                      PIC  9(02) VALUE ZEROS.     01200001
012100     05  SD-YEAR                      PIC  9(02) VALUE ZEROS.     01210001
012200                                                                  01220001
012300******************************************************************01230001
012400*                        ERROR HANDLING                           01240001
012500******************************************************************01250001
012600 01  ABEND-CODE                       PIC S9(04) VALUE ZEROS      01260001
012700                                                 COMP SYNC.       01270001
012800     88  ABEND-4003-CTRL-CARD-ERROR              VALUE +4003.     01280001
012900     88  ABEND-4013-DB2-ERROR                    VALUE +4013.     01290001
013000     88  ABEND-4019-CAL-SUB-ERROR                VALUE +4019.     01300004
013100                                                                  01310001
013200                                                                  01320001
013300******************************************************************01330001
013400* RECORD LAYOUT                                                   01340001
013500******************************************************************01350001
013600     COPY TFRD059.                                                01360001
013700                                                                  01370001
013800******************************************************************01380001
013900* CALENDAR ROUTINE WORK AREA                                      01390001
014000******************************************************************01400001
014100     COPY DPWS500.                                                01410001
014200                                                                  01420001
014300******************************************************************01430001
014400* VARIABLES REQUIRED FOR THE FORMAT SQLCA ROUTINE DPPD004         01440001
014500******************************************************************01450001
014600     COPY DPWS004.                                                01460001
014700                                                                  01470001
014800******************************************************************01480001
014900* DB2 MESSAGE AREA                                                01490001
015000******************************************************************01500001
015100     COPY SQLCA2.                                                 01510001
015200                                                                  01520001
015300******************************************************************01530001
015400* DB2 COMMUNICATION AREA                                          01540001
015500******************************************************************01550001
015600     EXEC SQL                                                     01560001
015700        INCLUDE SQLCA                                             01570001
015800     END-EXEC.                                                    01580001
015900                                                                  01590001
016000******************************************************************01600001
016100* DCLGEN LAYOUT AND COBOL DECLARATION FOR TRANSFER MASTER TABLE   01610001
016200******************************************************************01620001
016300     EXEC SQL                                                     01630001
016400         INCLUDE TTFMSTR                                          01640001
016500     END-EXEC.                                                    01650001
016600                                                                  01660001
016700******************************************************************01670001
016800* CURSOR TO RETRIEVE ALL TRANSFERS THAT WILL BE DELETED           01680001
016900******************************************************************01690001
017000     EXEC SQL                                                     01700001
017100        DECLARE  DELETE_CSR CURSOR FOR                            01710004
017200         SELECT XFER_DKEY_ID                                      01720001
017300           FROM  TTFMSTR                                          01730001
017400          WHERE  DATE (CMPT_XFER_END_TMST)                        01740001
017500                                       < :PV-CURR-DATE-MINUS-750  01750001
017600     END-EXEC.                                                    01760001
017700                                                                  01770001
017800                                                                  01780001
017900                                                                  01790001
018000 PROCEDURE DIVISION.                                              01800001
018100******************************************************************01810001
018200* MAINLINE                                                        01820001
018300******************************************************************01830001
018400 0000-MAINLINE.                                                   01840001
018500                                                                  01850001
018600     PERFORM 1000-INITIALIZE.                                     01860001
018700                                                                  01870001
018800     PERFORM 2000-PROCESS-DELETES                                 01880001
018900         UNTIL PS-END-OF-DELETES.                                 01890001
019000                                                                  01900001
019100     PERFORM 3200-CLOSE-DELETE-CSR.                               01910001
019200                                                                  01920001
019300     PERFORM 9900-EOJ-ROUTINE.                                    01930001
019400                                                                  01940001
019500     STOP RUN.                                                    01950001
019600                                                                  01960001
019700                                                                  01970001
019800******************************************************************01980001
019900* INITIALIZATION ROUTINE.                                         01990001
020000******************************************************************02000001
020100 1000-INITIALIZE.                                                 02010001
020200                                                                  02020001
020300     OPEN INPUT DATE-FILE                                         02030001
020400          OUTPUT KEY-FILE.                                        02040001
020500                                                                  02050001
020600     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 02060001
020700                                                                  02070001
020800     MOVE SYS-TIME (1:2) TO ST-BEG-HR.                            02080001
020900     MOVE SYS-TIME (3:2) TO ST-BEG-MN.                            02090001
021000                                                                  02100001
021100     MOVE SYS-DATE (1:2) TO SD-CENT.                              02110001
021200     MOVE SYS-DATE (3:2) TO SD-YEAR.                              02120001
021300     MOVE SYS-DATE (5:2) TO SD-MONTH.                             02130001
021400     MOVE SYS-DATE (7:2) TO SD-DAY.                               02140001
021500                                                                  02150001
021600     PERFORM 1100-READ-CARDIN.                                    02160001
021700     PERFORM 1200-CALL-CALENDAR.                                  02170001
021800                                                                  02180001
021900     PERFORM 3000-OPEN-DELETE-CSR.                                02190001
022000     PERFORM 3100-FETCH-DELETE-CSR.                               02200001
022100                                                                  02210001
022200                                                                  02220001
022300******************************************************************02230001
022400* READ THE INPUT DATE FILE                                        02240001
022500******************************************************************02250001
022600 1100-READ-CARDIN.                                                02260001
022700                                                                  02270001
022800     READ DATE-FILE INTO CC-CARDIN                                02280001
022900         AT END SET PS-EOF-CARDIN TO TRUE                         02290001
023000     END-READ.                                                    02300001
023100                                                                  02310001
023200     IF PS-EOF-CARDIN                                             02320001
023300        MOVE '1100-READ-CARDIN'               TO PV-PARAGRAPH-NAME02330001
023400        MOVE 'CARD (CURR DATE) FILE IS EMPTY' TO PV-OPERATION-MSG 02340001
023500                                                                  02350001
023600        SET ABEND-4003-CTRL-CARD-ERROR TO TRUE                    02360001
023700                                                                  02370001
023800        PERFORM 9000-ABEND                                        02380001
023900     END-IF.                                                      02390001
024000                                                                  02400001
024100                                                                  02410001
024200******************************************************************02420001
024300* CALL CALENDAR ROUTINE TO DECREMENT CURRENT DATE BY 750 DAYS,    02430001
024400* OR APPROXIMATELY 25 MONTHS                                      02440001
024500******************************************************************02450001
024600 1200-CALL-CALENDAR.                                              02460001
024700                                                                  02470001
024800     INITIALIZE DPG51 DPG52 DPG53 DPG54 DPG55 DPG56.              02480003
024900                                                                  02490003
025000     MOVE CC-CURR-DATE TO DPG52-DB2-ISO-DATE-FMT.                 02500002
025100                                                                  02510002
025200     SET DPG51-ACTUAL-CALENDAR-ONLY                               02520001
025300         DPG51-DECREMENT-DATE                                     02530001
025400         DPG52-LK-DTE-ISO-FMT TO TRUE.                            02540001
025500                                                                  02550001
025600     MOVE PC-750-DAYS  TO DPG51-INCR-DECR-DAYS-9.                 02560003
025700                                                                  02570001
025800     CALL DP500-KOHLS-CALENDAR-ROUTINE                            02580001
025900                USING DPG51 DPG52 DPG53 DPG54 DPG55 DPG56.        02590001
026000                                                                  02600001
026100     EVALUATE TRUE                                                02610001
026200         WHEN DPG54-DATE-VALID                                    02620001
026300             MOVE DPG55-DB2-ISO-DATE-FMT                          02630001
026400                 TO PV-CURR-DATE-MINUS-750                        02640001
026500                                                                  02650001
026600         WHEN OTHER                                               02660001
026700             DISPLAY '                                       '    02670001
026800             DISPLAY '** INVALID RETURN FROM CALENDAR ROUTINE'    02680001
026900             DISPLAY '** ERROR MESSAGE = ' DPG54-ERROR-MESSAGE    02690001
027000             DISPLAY '** DPG51 = ' DPG51                          02700001
027100             DISPLAY '** DPG52 = ' DPG52                          02710001
027200             DISPLAY '** DPG53 = ' DPG53                          02720001
027300             DISPLAY '** DPG54 = ' DPG54                          02730001
027400             DISPLAY '** CC-CURR-DATE = ' CC-CURR-DATE            02740002
027500                                                                  02750001
027600             MOVE '1200-CALL-CALENDAR'   TO PV-PARAGRAPH-NAME     02760002
027700             MOVE 'INVALID CNTL DATE'    TO PV-OPERATION-MSG      02770002
027800                                                                  02780001
027900             SET ABEND-4019-CAL-SUB-ERROR TO TRUE                 02790004
028000                                                                  02800001
028100             PERFORM 9000-ABEND                                   02810001
028200     END-EVALUATE.                                                02820001
028300                                                                  02830001
028400                                                                  02840001
028500***************************************************************** 02850001
028600* RETRIEVE RECORDS FOR PROCESSING                                 02860001
028700***************************************************************** 02870001
028800 2000-PROCESS-DELETES.                                            02880001
028900                                                                  02890001
029000     PERFORM 2100-WRITE-DEL-KEY.                                  02900001
029100                                                                  02910001
029200     PERFORM 3100-FETCH-DELETE-CSR.                               02920001
029300                                                                  02930001
029400                                                                  02940001
029500***************************************************************** 02950001
029600* WRITE OUT DELETE KEY                                            02960001
029700***************************************************************** 02970001
029800 2100-WRITE-DEL-KEY.                                              02980001
029900                                                                  02990001
030000     MOVE TFMSTR-XFER-DKEY-ID TO TF059-XFER-DKEY-ID.              03000001
030100                                                                  03010001
030200     WRITE KEY-REC FROM TF059-KEY-REC.                            03020001
030300                                                                  03030001
030400     ADD 1 TO PA-WRITTEN.                                         03040001
030500                                                                  03050001
030600                                                                  03060001
030700******************************************************************03070001
030800* OPEN CURSOR                                                     03080001
030900******************************************************************03090001
031000 3000-OPEN-DELETE-CSR.                                            03100001
031100                                                                  03110001
031200     EXEC SQL                                                     03120001
031300         OPEN DELETE_CSR                                          03130001
031400     END-EXEC.                                                    03140001
031500                                                                  03150001
031600     EVALUATE TRUE                                                03160001
031700         WHEN SQLCODE = +0                                        03170001
031800             CONTINUE                                             03180001
031900                                                                  03190001
032000         WHEN SQLWARN0 NOT = SPACES                               03200001
032100         WHEN SQLCODE < ZERO                                      03210001
032200         WHEN SQLCODE > ZERO                                      03220001
032300             MOVE '3000-OPEN-DELETE-CSR' TO PV-PARAGRAPH-NAME     03230001
032400             MOVE 'OPEN DELETE CURSOR'   TO PV-DB2-OPERATION      03240001
032500                                                                  03250001
032600             PERFORM 9100-SQL-ABEND                               03260001
032700     END-EVALUATE.                                                03270001
032800                                                                  03280001
032900                                                                  03290001
033000******************************************************************03300001
033100* FETCH CURSOR                                                    03310001
033200******************************************************************03320001
033300 3100-FETCH-DELETE-CSR.                                           03330001
033400                                                                  03340001
033500     INITIALIZE DCLTTFMSTR.                                       03350001
033600                                                                  03360001
033700     EXEC SQL                                                     03370001
033800         FETCH  DELETE_CSR                                        03380001
033900          INTO  :TFMSTR-XFER-DKEY-ID                              03390001
034000     END-EXEC.                                                    03400001
034100                                                                  03410001
034200     EVALUATE TRUE                                                03420001
034300         WHEN SQLCODE = +0                                        03430001
034400             ADD 1 TO PA-READ                                     03440001
034500                                                                  03450001
034600         WHEN SQLCODE = +100                                      03460001
034700             SET PS-END-OF-DELETES TO TRUE                        03470001
034800                                                                  03480001
034900         WHEN SQLWARN0 NOT = SPACES                               03490001
035000         WHEN SQLCODE < ZERO                                      03500001
035100         WHEN SQLCODE > ZERO                                      03510001
035200             MOVE '3100-FETCH-DELETE-CSR' TO PV-PARAGRAPH-NAME    03520001
035300             MOVE 'FETCH DELETE CURSOR'   TO PV-DB2-OPERATION     03530001
035400                                                                  03540001
035500             PERFORM 9100-SQL-ABEND                               03550001
035600     END-EVALUATE.                                                03560001
035700                                                                  03570001
035800                                                                  03580001
035900******************************************************************03590001
036000* CLOSE CURSOR                                                    03600001
036100******************************************************************03610001
036200 3200-CLOSE-DELETE-CSR.                                           03620001
036300                                                                  03630001
036400     EXEC SQL                                                     03640001
036500         CLOSE DELETE_CSR                                         03650001
036600     END-EXEC.                                                    03660001
036700                                                                  03670001
036800     EVALUATE TRUE                                                03680001
036900         WHEN SQLCODE = +0                                        03690001
037000             CONTINUE                                             03700001
037100                                                                  03710001
037200         WHEN SQLWARN0 NOT = SPACES                               03720001
037300         WHEN SQLCODE < ZERO                                      03730001
037400         WHEN SQLCODE > ZERO                                      03740001
037500             MOVE '3200-CLOSE-DELETE-CSR' TO PV-PARAGRAPH-NAME    03750001
037600             MOVE 'CLOSE DELETE CURSOR'   TO PV-DB2-OPERATION     03760001
037700                                                                  03770001
037800             PERFORM 9100-SQL-ABEND                               03780001
037900     END-EVALUATE.                                                03790001
038000                                                                  03800001
038100                                                                  03810001
038200******************************************************************03820001
038300* NON-DB2 ABEND                                                   03830001
038400******************************************************************03840001
038500 9000-ABEND.                                                      03850001
038600                                                                  03860001
038700     PERFORM 9900-EOJ-ROUTINE.                                    03870001
038800                                                                  03880001
038900     DISPLAY '                     '.                             03890001
039000     DISPLAY '** ABEND           **'.                             03900001
039100     DISPLAY '** PROGRAM         ** = ' PC-PGM-NAME.              03910001
039200     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.        03920001
039300     DISPLAY '** OPERATION       ** = ' PV-OPERATION-MSG.         03930001
039400                                                                  03940001
039500     CALL 'ILBOABN0' USING ABEND-CODE.                            03950001
039600                                                                  03960001
039700                                                                  03970001
039800******************************************************************03980001
039900*  PERFORMS THE ABEND FOR THE PROGRAM IN THE EVENT THAT AN SQL    03990001
040000*  ERROR OR WARNING CODE OCCURS.                                  04000001
040100******************************************************************04010001
040200 9100-SQL-ABEND.                                                  04020001
040300                                                                  04030001
040400     MOVE TFMSTR-XFER-DKEY-ID TO PV-DISPLAY-XFER-DKEY-ID.         04040001
040500                                                                  04050001
040600     DISPLAY '                               '                    04060001
040700     DISPLAY 'DELETING TFMSTR-XFER-DKEY-ID = '                    04070001
040800                                 PV-DISPLAY-XFER-DKEY-ID.         04080001
040900                                                                  04090001
041000     PERFORM 9900-EOJ-ROUTINE.                                    04100001
041100                                                                  04110001
041200     DISPLAY '               '.                                   04120001
041300     DISPLAY '** ABEND     **'.                                   04130001
041400     DISPLAY '** PROGRAM   ** = ' PC-PGM-NAME.                    04140001
041500     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH-NAME.              04150001
041600     DISPLAY '** OPERATION ** = ' PV-DB2-OPERATION.               04160001
041700     DISPLAY '** SQLCODE   ** = ' SQLCODE.                        04170001
041800                                                                  04180001
041900******************************************************************04190001
042000* THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION STATE-    04200001
042100* MENTS THAT ARE REQUIRED TO UTILIZE THE DB2 ABEND MODULE         04210001
042200* 'DSNTIAR' AND CONVERT THE SQLCA INFORMATION INTO A READABLE     04220001
042300* FORMAT.                                                         04230001
042400******************************************************************04240001
042500     COPY DPPD004.                                                04250001
042600                                                                  04260001
042700     SET ABEND-4013-DB2-ERROR TO TRUE.                            04270001
042800                                                                  04280001
042900     CALL 'ILBOABN0' USING ABEND-CODE.                            04290001
043000                                                                  04300001
043100                                                                  04310001
043200******************************************************************04320001
043300* PREFORMS TASK TERMINATION PROCESSING                            04330001
043400******************************************************************04340001
043500 9900-EOJ-ROUTINE.                                                04350001
043600                                                                  04360001
043700     CLOSE DATE-FILE                                              04370001
043800           KEY-FILE.                                              04380001
043900                                                                  04390001
044000     PERFORM 9999-CONTROLS.                                       04400001
044100                                                                  04410001
044200                                                                  04420001
044300******************************************************************04430001
044400* DISPLAY CONTROLS FROM THE PROGRAM                               04440001
044500******************************************************************04450001
044600 9999-CONTROLS.                                                   04460001
044700                                                                  04470001
044800     MOVE FUNCTION CURRENT-DATE TO SYS-DATE-TIME.                 04480001
044900                                                                  04490001
045000     MOVE SYS-TIME (1:2) TO ST-END-HR.                            04500001
045100     MOVE SYS-TIME (3:2) TO ST-END-MN.                            04510001
045200                                                                  04520001
045300     DISPLAY '                    '.                              04530001
045400     DISPLAY '**********************'.                            04540001
045500     DISPLAY '   TFKUT507 CONTROLS  '.                            04550001
045600     DISPLAY '**********************'.                            04560001
045700     DISPLAY 'RUN DATE  = ' SD-EDIT-DATE.                         04570001
045800     DISPLAY 'BEG TIME  = ' ST-BEG-TIME.                          04580001
045900     DISPLAY 'END TIME  = ' ST-END-TIME.                          04590001
046000     DISPLAY '======================'.                            04600001
046100     DISPLAY 'INPUT DATE = ' CC-CURR-DATE.                        04610001
046200     DISPLAY 'CURR DATE - 750 DAYS = ' PV-CURR-DATE-MINUS-750.    04620001
046300     DISPLAY '             '.                                     04630001
046400     DISPLAY 'ROWS READ    = '  PA-READ.                          04640001
046500     DISPLAY 'ROWS WRITTEN = '  PA-WRITTEN.                       04650001
046600                                                                  04660001
046700                                                                  04670001
