000100***************************************************************** 00010000
000200*    RECORD PURPOSE: IDENTIFY THE STORE CREATING THE TRANSFER   * 00020002
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030008
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  TF001-XFER-FROM-PTC-RECORD.                                  00060002
000700     05  TF001-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070001
000800     05  TF001-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080001
000900     05  TF001-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090007
001000     05  TF001-STR-NBR                   PIC  9(04)  VALUE ZEROS. 00100006
           05  FILLER                          PIC X(4103) VALUE SPACE. 00110008
003300     05  TF001-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00120008
003400         88  TF001-MQ-INDICATOR-N                    VALUE 'N'.   00130008
003400         88  TF001-MQ-INDICATOR-Y                    VALUE 'Y'.   00140008
000900     05  TF001-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00150008
000900     05  TF001-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00160008
000900     05  TF001-MSGID                     PIC  X(24)  VALUE SPACE. 00170008
