000100***************************************************************** 00010000
000200*    RECORD PURPOSE: COMPLETE RECEIVE TRANSFER                  * 00020000
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030007
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  TF025-XFER-FROM-PTC-RECORD.                                  00060000
000700     05  TF025-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070000
000800     05  TF025-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080000
000900     05  TF025-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090006
001000     05  TF025-XFER-DKEY                 PIC  9(09)  VALUE ZEROS. 00100001
001100     05  TF025-DTL-CHK-BYPASS-IND        PIC  X(01)  VALUE SPACE. 00110000
001200         88  TF025-DTL-CHK                           VALUE 'N'.   00120002
001300         88  TF025-DTL-CHK-BYPASSED                  VALUE 'Y'.   00130002
001400     05  TF025-COMPLETION-IND            PIC  X(01)  VALUE SPACE. 00140000
001500         88  TF025-COMPLETE-XFER                     VALUE 'C'.   00150000
001600         88  TF025-PURGE-XFER                        VALUE 'P'.   00160000
001700     05  TF025-STR-NBR-X                 PIC  X(04)  VALUE SPACE. 00170005
001800     05  TF025-STR-NBR     REDEFINES  TF025-STR-NBR-X             00180005
001900                                         PIC  9(04).              00190005
           05  FILLER                          PIC X(4092) VALUE SPACE. 00200007
003300     05  TF025-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00210007
003400         88  TF025-MQ-INDICATOR-N                    VALUE 'N'.   00220007
003400         88  TF025-MQ-INDICATOR-Y                    VALUE 'Y'.   00230007
000900     05  TF025-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00240007
000900     05  TF025-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00250007
000900     05  TF025-MSGID                     PIC  X(24)  VALUE SPACE. 00260007
