      ******************************************************************        
      **TFRD052 - BATCH CONTROL FILE                                            
      ******************************************************************        
       01  TFRD052-BATCH-CONTROL-FILE.                                          
           05  TFRD052-BATCH-DKEY-ID         PIC 9(10) VALUE ZEROS.             
           05  FILLER                        PIC X(01) VALUE SPACES.            
           05  TFRD052-JULIAN-DAY            PIC 9(04) VALUE ZEROS.             
           05  TFRD052-BTCH-CRE-DTE          PIC X(10) VALUE SPACES.            
           05  FILLER                        PIC X(55) VALUE SPACES.            
