000100***************************************************************** 00010000
000200*    RECORD PURPOSE: UPDATE TRANSFER ITEM                       * 00020002
000300*    RECORD LENGTH:  55 BYTES (ALL TRANSFER TYPES EXCEPT        * 00030018
000400*                                NON-RETAIL)                    * 00040002
000500*                    90 BYTES (NON-RETAIL TRANSFER)             * 00050004
000600*    RECORD FORMAT:  SEQUENTIAL                                 * 00060000
000700***************************************************************** 00070000
000800 01  TF011-XFER-FROM-PTC-RECORD.                                  00080002
000900     05  TF011-XFER-FROM-PTC-FIXED-DATA.                          00090002
001000         10  TF011-TOT-REC-LENGTH        PIC  9(04)  VALUE ZEROS. 00100002
001100         10  TF011-MATCHING-NBR-FIELD    PIC  9(08)  VALUE ZEROS. 00110002
001200         10  TF011-LISTENER-CODE         PIC  X(01)  VALUE SPACE. 00120018
001300         10  TF011-XFER-DKEY             PIC  9(09)  VALUE ZEROS. 00130008
001400         10  TF011-XFER-TYP-CDE-X        PIC  X(02)  VALUE SPACE. 00140008
001500         10  TF011-XFER-TYP-CDE  REDEFINES  TF011-XFER-TYP-CDE-X  00150005
001600                                         PIC  9(02).              00160002
001700         10  TF011-SIGN-IND              PIC  X(01)  VALUE '+'.   00170002
001800             88  TF011-POSITIVE                      VALUE '+'.   00180002
001900             88  TF011-NEGATIVE                      VALUE '-'.   00190002
002000         10  TF011-XFER-QTY              PIC  9(03)  VALUE ZEROS. 00200007
002100                                                                  00210006
002200     05  TF011-XFER-TYPE                 PIC  X(63)  VALUE SPACE. 00220014
002300******************************************************************00230016
002400*  WILL BE FILLED IN IF NON-RETAIL TRANSFER TYPE                 *00240016
002500******************************************************************00250016
002600     05  TF011-NON-RTL-XFER  REDEFINES  TF011-XFER-TYPE.          00260014
002700         10  TF011-ITEM-DESC-LN1         PIC  X(20).              00270014
002800         10  TF011-ITEM-DESC-LN2         PIC  X(20).              00280014
002900         10  TF011-FIXTURE-NBR           PIC  X(20).              00290014
003000         10  TF011-DEPT-NBR-X            PIC  X(03).              00300014
003100         10  TF011-DEPT-NBR  REDEFINES  TF011-DEPT-NBR-X          00310001
003200                                         PIC  9(03).              00320001
003300                                                                  00330002
003400*                                                                 00340002
003500*  OR                                                             00350002
003600*                                                                 00360002
003700                                                                  00370002
003800******************************************************************00380002
003900*  WILL BE FILLED IN FOR ALL TRANSFER TYPES EXCEPT NON-RETAIL    *00390002
004000******************************************************************00400002
004100     05  TF011-RTL-XFER  REDEFINES  TF011-XFER-TYPE.              00410014
004200         10  TF011-UPC-NBR-X             PIC  X(13).              00420014
004300         10  TF011-UPC-NBR  REDEFINES  TF011-UPC-NBR-X            00430001
004400                                         PIC  9(13).              00440001
004500         10  TF011-SKU-NBR-X             PIC  X(08).              00450020
SR3403         10  TF011-TKT-PRICE             PIC  9(09).              00491021
SR3403         10  TF011-CUR-UNT-RTL-AMT       PIC  9(09).              00501021
005100         10  TF011-SKU-RENUM-IND         PIC  X(01).              00510014
005200         10  FILLER                      PIC  X(23).              00520022
           05  FILLER                          PIC X(4029) VALUE SPACE. 00530019
003300     05  TF011-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00540019
003400         88  TF011-MQ-INDICATOR-N                    VALUE 'N'.   00550019
003400         88  TF011-MQ-INDICATOR-Y                    VALUE 'Y'.   00560019
000900     05  TF011-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00570019
000900     05  TF011-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00580019
000900     05  TF011-MSGID                     PIC  X(24)  VALUE SPACE. 00590019
