      ******************************************************************00010008
      *  RECEIVED TRANSFER RECORD LAYOUT.                               00020008
      *  USED TO PRODUCE THE FISCAL MONTH RECEIVE TRANSFER REPORT       00030008
      *                                            RECORD LENGTH = 80   00040011
      ******************************************************************00050008
      **DATE:10/04/2004 MADE BY: RAY GRAF EXPAND STORE AND XFER NUMBER  00051009
      ******************************************************************00052009
       01  TF034-RECEIVED-XFER-RECORD.                                  00060008
           05  TF034-RECV-STR-NBR-X            PIC  X(05)  VALUE SPACE. 00070010
           05  TF034-RECV-STR-NBR REDEFINES     TF034-RECV-STR-NBR-X    00080008
                                               PIC  9(05).              00090010
           05  TF034-XFER-NBR.                                          00100008
               10  TF034-FROM-STR-NBR-X        PIC  X(05)  VALUE SPACE. 00110010
               10  TF034-FROM-STR-NBR  REDEFINES  TF034-FROM-STR-NBR-X  00120008
                                               PIC  9(05).              00130010
               10  TF034-XFER-SEQ-NBR-X        PIC  X(06)  VALUE SPACE. 00140008
               10  TF034-XFER-SEQ-NBR  REDEFINES  TF034-XFER-SEQ-NBR-X  00150008
                                               PIC  9(06).              00160008
           05  TF034-XFER-STATUS               PIC  X(02)  VALUE SPACE. 00170008
               88  TF034-AR                                VALUE '01'.  00180008
               88  TF034-PR-AND-NO-DTL-CHK                 VALUE '02'.  00190008
               88  TF034-PR-AND-DTL-CHK                    VALUE '03'.  00200008
               88  TF034-VOIDED                            VALUE '04'.  00210008
           05  TF034-XFER-TOT-UNITS            PIC S9(09)  VALUE ZEROS  00220008
                                                           COMP-3.      00230008
           05  TF034-XFER-TOT-RETAIL           PIC S9(09)V9(02)         00240008
                                                           VALUE ZEROS  00250008
                                                           COMP-3.      00260008
           05  TF034-XFER-RECV-DATE.                                    00270008
               10  TF034-XFER-RECV-CC          PIC  X(02)  VALUE SPACE. 00280008
               10  TF034-XFER-RECV-YY          PIC  X(02)  VALUE SPACE. 00290008
               10  TF034-XFER-RECV-MM          PIC  X(02)  VALUE SPACE. 00300008
               10  TF034-XFER-RECV-DD          PIC  X(02)  VALUE SPACE. 00310008
           05  TF034-RECV-BY-1ST-INIT-NAME     PIC  X(01)  VALUE SPACE. 00320008
           05  TF034-RECV-BY-LAST-NAME         PIC  X(20)  VALUE SPACE. 00330008
           05  FILLER                          PIC  X(22)  VALUE SPACE. 00340010
