      ******************************************************************00010001
      *  TRANSFER DISCREPANCY REPORT RECORD LAYOUT.                     00020001
      *                                              RECORD LENGTH = 43 00030003
      ******************************************************************00040001
      **DATE:10/04/2004 MADE BY: RAY GRAF EXPAND STORE AND XFER NUMBER  00041002
      ******************************************************************00042002
       01  TF038-XFER-DSCRP-RPT-RECORD.                                 00050001
           05  TF038-XFER-NBR-X                PIC  X(11)  VALUE SPACE. 00060003
           05  TF038-XFER-NBR  REDEFINES  TF038-XFER-NBR-X.             00070001
               10  TF038-FROM-STR-NBR          PIC  9(05).              00080003
               10  TF038-XFER-SEQ-NBR          PIC  9(06).              00090001
           05  TF038-COMPLETED-DATE.                                    00100001
               10  TF038-COMPLETED-MONTH       PIC  9(02)  VALUE ZEROS. 00110001
               10  TF038-COMPLETED-DAY         PIC  9(02)  VALUE ZEROS. 00120001
               10  TF038-COMPLETED-CENTURY     PIC  9(02)  VALUE ZEROS. 00130001
               10  TF038-COMPLETED-YEAR        PIC  9(02)  VALUE ZEROS. 00140001
           05  TF038-RECEIVED-DATE.                                     00150001
               10  TF038-RECEIVED-MONTH        PIC  9(02)  VALUE ZEROS. 00160001
               10  TF038-RECEIVED-DAY          PIC  9(02)  VALUE ZEROS. 00170001
               10  TF038-RECEIVED-CENTURY      PIC  9(02)  VALUE ZEROS. 00180001
               10  TF038-RECEIVED-YEAR         PIC  9(02)  VALUE ZEROS. 00190001
           05  TF038-ADJ-UNITS                 PIC  9(06)  VALUE ZEROS. 00200001
           05  TF038-ADJ-RTL                   PIC S9(08)V9(02)         00210001
                                                           VALUE ZEROS. 00220001
