000100***************************************************************** 00010000
000200*    RECORD PURPOSE: SEND STORE NAME                            * 00020004
000300*    RECORD LENGTH:  103 BYTES                                  * 00030001
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600                                                                  00060000
000700 01  TF006-XFER-TO-PTC-RECORD.                                    00070001
000900     05  TF006-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00090000
001000     05  TF006-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00100000
001100     05  TF006-ERR-TYP-IND               PIC  X(01)  VALUE SPACE. 00110000
001200     05  TF006-ERR-MSG                   PIC  X(70)  VALUE SPACE. 00120000
001210     05  TF006-STR-NAME                  PIC  X(20)  VALUE SPACE. 00121003
