      ******************************************************************        
      *     INVENTORY SNAPSHOT EXTRACT FILE FORMAT                              
      *                                            RECORD LENGTH = 078          
      ******************************************************************        
       01  TFRD060-INV-SNAPSHOT-EXTRACT.                                        
           05  TFRD060-XFER-DKEY-ID          PIC S9(09)  COMP                   
                                                         VALUE ZEROS.           
           05  TFRD060-FR-LOC-NBR            PIC S9(04)  COMP                   
                                                         VALUE ZEROS.           
           05  TFRD060-XFER-SEQ-NBR          PIC S9(09)  COMP                   
                                                         VALUE ZEROS.           
           05  TFRD060-CREATE-DATE           PIC  X(11)  VALUE SPACES.          
           05  TFRD060-TO-PSTG-LOC-NBR       PIC S9(04)  COMP                   
                                                         VALUE ZEROS.           
           05  TFRD060-TO-LOC-NM             PIC  X(20)  VALUE SPACES.          
           05  TFRD060-BTCH-DKEY-ID          PIC S9(09)  COMP                   
                                                         VALUE ZEROS.           
           05  TFRD060-BTCH-JLN-DAY          PIC S9(04)  COMP                   
                                                         VALUE ZEROS.           
           05  TFRD060-XFER-LNE-NBR          PIC S9(04)  COMP                   
                                                         VALUE ZEROS.           
           05  TFRD060-DEPT-NBR              PIC S9(04)  COMP-3                 
                                                         VALUE ZEROS.           
           05  TFRD060-SUB-CL-NBR            PIC S9(04)  COMP-3                 
                                                         VALUE ZEROS.           
           05  TFRD060-SKU-NBR               PIC S9(08)  COMP-3                 
                                                         VALUE ZEROS.           
           05  TFRD060-ITM-QTY               PIC S9(04)  COMP                   
                                                         VALUE ZEROS.           
SR3403     05  TFRD060-ITM-RTL-PRCE-AMT      PIC S9(07)V99 COMP-3               
                                                         VALUE ZEROS.           
           05  TFRD060-ACTL-INV-DATE         PIC  X(10)  VALUE SPACES.          
