000100***************************************************************** 00010000
000200*    RECORD PURPOSE: CONTAINER TYPE DATA                        * 00020011
000300*    RECORD LENGTH:  VARIABLE - 525  BYTES MAXIMUM              * 00030013
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600                                                                  00060000
000700 01  TF004-XFER-TO-PTC-RECORD.                                    00070005
000800     05  TF004-XFER-TO-PTC-FIXED-DATA.                            00080005
000900         10  TF004-TOT-REC-LENGTH        PIC  9(04)  VALUE ZEROS. 00090000
001000         10  TF004-MATCHING-NBR-FIELD    PIC  9(08)  VALUE ZEROS. 00100000
001100         10  TF004-ERR-TYP-IND           PIC  X(01)  VALUE SPACE. 00110000
001200         10  TF004-ERR-MSG               PIC  X(70)  VALUE SPACE. 00120000
001214         10  TF004-NBR-OF-OCCURS         PIC  9(02)  VALUE ZEROS. 00130012
001215                                                                  00140012
001217*                                                                 00150006
001218*  TABLED DATA MUST BE AT THE END OF THE RECORD LAYOUT            00160006
001219*                                                                 00170006
001220     05  TF004-XFER-TO-PTC-TABLED-DATA.                           00180007
001221         10  TF004-CONTNR-TYP-CDE-TBL OCCURS 20 TIMES             00190009
001222                       INDEXED BY TYP-CDE-IDX.                    00200008
001223             15  TF004-CONTNR-TYP-CDE-X  PIC  X(02)  VALUE SPACE. 00210009
001225             15  TF004-CONTNR-TYP-CDE  REDEFINES                  00220009
001226                     TF004-CONTNR-TYP-CDE-X                       00230009
001227                                         PIC  9(02).              00240003
001228             15  TF004-CONTNR-TYP-IND    PIC  X(01)  VALUE SPACE. 00250009
001230             15  TF004-SEAL-REQ-IND      PIC  X(01)  VALUE SPACE. 00260000
001231             15  TF004-CONTNR-TYP-CDE-DESC                        00270010
001232                                         PIC  X(18)  VALUE SPACE. 00280010
