      ******************************************************************00010034
      **TFRD054 - ML DAILY TRANSFER FILE                                00020011
      ******************************************************************00030008
       01  TFRD054-ML-DAILY-TRANSFER-FILE.                              00040011
           05  TFRD054-BATCH-NBR                 PIC S9(04) COMP        00050012
                                                            VALUE ZEROS.00060012
           05  TRANSFER-DOCUMENT-INFORMATION.                           00070012
               10  TFRD054-DOC-NBR.                                     00080013
                   15  TFRD054-DOC-FROM-LOC-NBR  PIC S9(04) COMP        00090013
                                                            VALUE ZEROS.00100012
                   15  TFRD054-DOC-SEQ-NBR       PIC S9(09) COMP        00110013
                                                            VALUE ZEROS.00120012
               10  TFRD054-INVENTORY-SNAP-IND    PIC X(01)  VALUE ' '.  00130013
                   88  TFRD054-INVENTORY-SNAP-YES           VALUE 'Y'.  00140012
                   88  TFRD054-INVENTORY-SNAP-NO            VALUE 'N'.  00150012
               10  TFRD054-TO-LOC-NBR            PIC S9(04) COMP        00160013
                                                            VALUE ZEROS.00170012
               10  TFRD054-TO-LOC-INV-IND        PIC X(02)  VALUE '  '. 00180013
                   88  TFRD054-TO-LOC-INV-AFTER             VALUE 'AI'. 00190012
                   88  TFRD054-TO-LOC-INV-BEFORE            VALUE 'BI'. 00200012
                   88  TFRD054-TO-LOC-INV-NORMAL            VALUE 'NM'. 00210012
               10  TFRD054-FROM-LOC-NBR          PIC S9(04) COMP        00220013
                                                            VALUE ZEROS.00230012
               10  TFRD054-FROM-LOC-INV-IND      PIC X(02)  VALUE '  '. 00240013
                   88  TFRD054-FROM-LOC-INV-AFTER           VALUE 'AI'. 00250012
                   88  TFRD054-FROM-LOC-INV-BEFORE          VALUE 'BI'. 00260012
                   88  TFRD054-FROM-LOC-INV-NORMAL          VALUE 'NM'. 00270012
               10  TFRD054-CREATE-DATE.                                 00280013
                   15  TFRD054-CREATE-DATE-YY    PIC 9(04) VALUE ZEROS. 00290014
                   15  FILLER                    PIC X(01) VALUE '-'.   00300014
                   15  TFRD054-CREATE-DATE-MM    PIC 9(02) VALUE ZEROS. 00310014
                   15  FILLER                    PIC X(01) VALUE '-'.   00320014
                   15  TFRD054-CREATE-DATE-DD    PIC 9(02) VALUE ZEROS. 00330014
               10  TFRD054-RECEIVE-DATE.                                00340013
                   15  TFRD054-RECEIVE-DATE-YY   PIC 9(04) VALUE ZEROS. 00350014
                   15  FILLER                    PIC X(01) VALUE '-'.   00360014
                   15  TFRD054-RECEIVE-DATE-MM   PIC 9(02) VALUE ZEROS. 00370014
                   15  FILLER                    PIC X(01) VALUE '-'.   00380014
                   15  TFRD054-RECEIVE-DATE-DD   PIC 9(02) VALUE ZEROS. 00390014
               10  TFRD054-ORIG-TO-LOC-NBR       PIC S9(04) COMP        00391030
                                                           VALUE ZEROS. 00392029
           05  TRANSFER-ITEM-INFORMATION.                               00400012
               10  TFRD054-LNE-NBR               PIC S9(04) COMP-4      00410013
                                                            VALUE ZEROS.00420012
               10  TFRD054-SKU-NBR               PIC S9(09) COMP        00430013
                                                           VALUE ZEROS. 00440012
               10  TFRD054-ITEM-QTY              PIC S9(04) COMP        00450013
                                                           VALUE ZEROS. 00460012
SR3403         10  TFRD054-ITEM-PRICE            PIC S9(07)V99 COMP-3   00471033
                                                           VALUE ZEROS. 00480135
           05  TFRD054-ADJ-RSN-CDE               PIC X(02) VALUE SPACES.00481015
           05  TFRD054-TYP-1ST-LNE-DESC          PIC X(18) VALUE SPACES.00482016
           05  TFRD054-TYP-2ND-LNE-DESC          PIC X(18) VALUE SPACES.00483016
           05  TFRD054-DEPT                      PIC S9(04) COMP-3      00484022
                                                           VALUE ZEROS. 00485021
           05  TFRD054-SUBCLASS                  PIC S9(04) COMP-3      00486022
                                                           VALUE ZEROS. 00487021
           05  TFRD054-EXTENDED-RETAIL           PIC S9(10)V99 COMP-3   00487127
                                                           VALUE ZEROS. 00487227
SR3403     05  FILLER                            PIC X(17) VALUE SPACES.00500032
