      ******************************************************************00010007
      *  MISDIRECTED TRANSFER RECORD LAYOUT.                            00020007
      *  USED TO PRODUCE THE FISCAL MONTH MISDIRECTED TRANSFER REPORT   00030007
      *                                            RECORD LENGTH = 60   00040007
      ******************************************************************00050007
      **DATE:10/04/2004 MADE BY: RAY GRAF EXPAND STORE AND XFER NUMBER  00051008
      ******************************************************************00052008
       01  TF032-XFER-MISDIRECT-RECORD.                                 00060007
           05  TF032-DIST-FACILITY-X           PIC  X(05)  VALUE SPACE. 00070011
           05  TF032-DIST-FACILITY REDEFINES TF032-DIST-FACILITY-X      00071007
                                               PIC  9(05).              00072011
           05  TF032-XFER-NBR.                                          00080007
               10  TF032-FROM-STR-NBR-X        PIC  X(05)  VALUE SPACE. 00090009
               10  TF032-FROM-STR-NBR  REDEFINES  TF032-FROM-STR-NBR-X  00100007
                                               PIC  9(05).              00110009
               10  TF032-XFER-SEQ-NBR-X        PIC  X(06)  VALUE SPACE. 00120007
               10  TF032-XFER-SEQ-NBR  REDEFINES  TF032-XFER-SEQ-NBR-X  00130007
                                               PIC  9(06).              00140007
           05  TF032-RECEIVE-DATE.                                      00141007
               10  TF032-RECEIVE-CC            PIC  X(02)  VALUE SPACE. 00142007
               10  TF032-RECEIVE-YY            PIC  X(02)  VALUE SPACE. 00143007
               10  TF032-RECEIVE-MM            PIC  X(02)  VALUE SPACE. 00145007
               10  TF032-RECEIVE-DD            PIC  X(02)  VALUE SPACE. 00147007
           05  TF032-XFER-STATUS               PIC  X(02)  VALUE SPACE. 00150007
           05  TF032-RECV-STR-NBR-X            PIC  X(05)  VALUE SPACE. 00160009
           05  TF032-RECV-STR-NBR  REDEFINES  TF032-RECV-STR-NBR-X      00170007
                                               PIC  9(05).              00180009
           05  TF032-TO-STR-NBR-X              PIC  X(05)  VALUE SPACE. 00190009
           05  TF032-TO-STR-NBR    REDEFINES  TF032-TO-STR-NBR-X        00200007
                                               PIC  9(05).              00210009
           05  TF032-COMPLETE-DATE.                                     00220007
               10  TF032-COMPLETE-CC           PIC  X(02)  VALUE SPACE. 00230007
               10  TF032-COMPLETE-YY           PIC  X(02)  VALUE SPACE. 00240007
               10  TF032-COMPLETE-MM           PIC  X(02)  VALUE SPACE. 00260007
               10  TF032-COMPLETE-DD           PIC  X(02)  VALUE SPACE. 00280007
           05  TF032-XFER-TOT-UNITS            PIC S9(07)  VALUE ZEROS  00290007
                                                           COMP-3.      00300007
           05  TF032-XFER-TOT-RETAIL           PIC S9(07)V9(02)         00310007
                                                           VALUE ZEROS  00320007
                                                           COMP-3.      00330007
           05  FILLER                          PIC  X(07)  VALUE SPACES.00340012
