000100***************************************************************** 00010000
000200*    RECORD PURPOSE: SEND TRANSFER ITEM DETAIL TO PTC           * 00020000
000300*    RECORD LENGTH:  VARIABLE - 9257 BYTES                      * 00030000
000310*                                                               * 00040000
000320*                                                               * 00050000
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00060000
000500***************************************************************** 00070000
000600                                                                  00080000
000700 01  TF071-XFER-TO-PTC-RECORD.                                    00090000
000710     05  TF071-XFER-TO-PTC-FIXED-DATA.                            00100000
000800         10  TF071-TOT-REC-LENGTH        PIC  9(04)  VALUE ZEROS. 00110000
000900         10  TF071-MATCHING-NBR-FIELD    PIC  9(08)  VALUE ZEROS. 00120000
001000         10  TF071-ERR-TYP-IND           PIC  X(01)  VALUE SPACE. 00130000
001100         10  TF071-ERR-MSG               PIC  X(70)  VALUE SPACE. 00140000
001102         10  TF071-XFER-RESET-IND        PIC  X(01)  VALUE SPACE. 00150000
001110             88  TF071-XFER-NOT-RESET                VALUE 'N'.   00160000
001200             88  TF071-XFER-RESET                    VALUE 'Y'.   00170000
001500         10  TF071-DTL-CHK-REQ-IND       PIC  X(01)  VALUE SPACE. 00180000
001600             88  TF071-DTL-CHK-REQ                   VALUE 'Y'.   00190000
001700             88  TF071-DTL-CHK-NOT-REQ               VALUE 'N'.   00200000
003000         10  TF071-MORE-DATA-IND         PIC  X(01)  VALUE SPACE. 00210000
003100             88  TF071-MORE-DATA                     VALUE 'Y'.   00220000
003110             88  TF071-NO-MORE-DATA                  VALUE 'N'.   00230000
003200         10  TF071-NBR-OF-OCCURS         PIC  9(03)  VALUE ZEROS. 00240000
003410                                                                  00250000
003420     05  TF071-XFER-DATA                 PIC X(9168) VALUE SPACE. 00260000
003421                                                                  00270000
003430     05  TF071-NON-RTL-XFER-TABLED-DATA REDEFINES TF071-XFER-DATA.00280000
003500         10  TF071-NON-RTL-TBL OCCURS 87 TIMES                    00290000
003600                       INDEXED BY NON-RTL-IDX.                    00300000
003700             15  TF071-NON-RTL-LINE-NBR-X                         00310000
003701                                         PIC  X(03).              00320000
003710             15  TF071-NON-RTL-LINE-NBR  REDEFINES                00330000
003711                     TF071-NON-RTL-LINE-NBR-X                     00340000
003720                                         PIC  9(03).              00350000
003800             15  TF071-NON-RTL-XFER-QTY-X                         00360000
003810                                         PIC  X(03).              00370000
003820             15  TF071-NON-RTL-XFER-QTY  REDEFINES                00380000
003900                     TF071-NON-RTL-XFER-QTY-X                     00390000
004000                                         PIC  9(03).              00400000
004100             15  TF071-ITM-DESC-LN1      PIC  X(20).              00410000
004110             15  TF071-ITM-DESC-LN2      PIC  X(20).              00420000
004120         10  FILLER                      PIC  X(5166).            00430000
004200                                                                  00440000
004210     05  TF071-ALL-RTL-XFER-TABLED-DATA REDEFINES TF071-XFER-DATA.00450000
004220         10  TF071-RTL-TBL OCCURS 191 TIMES                       00460000
004230                       INDEXED BY RTL-IDX.                        00470000
004241             15  TF071-RTL-LINE-NBR-X    PIC  X(03).              00480000
004242             15  TF071-RTL-LINE-NBR REDEFINES TF071-RTL-LINE-NBR-X00490000
004243                                         PIC  9(03).              00500000
004250             15  TF071-SKU-NBR           PIC  9(08).              00510000
002000             15  TF071-UPC-NBR           PIC  9(15).              00520000
                   15  TF071-DEPT              PIC  9(04).              00530000
                   15  TF071-CLASS             PIC  9(04).              00540000
                   15  TF071-SUBCLASS          PIC  9(04).              00550000
SR3403             15  TF071-TKT-PRICE-X       PIC  X(09).              00560000
SR3403             15  TF071-TKT-PRICE  REDEFINES  TF071-TKT-PRICE-X    00570000
SR3403                                         PIC  9(09).              00580000
004400             15  TF071-SKU-RENUM-IND     PIC  X(01).              00590000
004500             15  TF071-RTL-XFER-QTY-X    PIC  X(03).              00600000
004600             15  TF071-RTL-XFER-QTY REDEFINES TF071-RTL-XFER-QTY-X00610000
004700                                         PIC  9(03).              00620000
