      ******************************************************************00010008
      **TFRD057 - UNLOAD OF INVALID TRANSFER ITEMS                      00020030
      ******************************************************************00030008
       01  TFRD057-INVALID-TRANSFER-ITEMS.                              00040031
           05  TFRD057-XFER-DKEY-ID            PIC S9(09) COMP          00050031
                                                          VALUE ZEROS.  00060013
           05  TFRD057-XFER-LNE-NBR            PIC S9(04) COMP          00070031
                                                          VALUE ZEROS.  00080013
           05  TFRD057-PSTG-SEQ-NBR            PIC S9(04) COMP          00090031
                                                          VALUE ZEROS.  00100013
           05  TFRD057-FRM-PSTG-STR-NBR        PIC S9(04) COMP          00110031
                                                          VALUE ZEROS.  00120013
           05  TFRD057-TO-PSTG-STR-NBR         PIC S9(04) COMP          00130031
                                                          VALUE ZEROS.  00140013
           05  TFRD057-XFER-SEQ-NBR            PIC S9(09) COMP          00150031
                                                          VALUE ZEROS.  00160013
           05  FILLER                          PIC X(01)  VALUE SPACES. 00170013
           05  TFRD057-TYP-1ST-LNE-DESC        PIC X(18)  VALUE SPACES. 00180031
           05  TFRD057-TYP-2ND-LNE-DESC        PIC X(18)  VALUE SPACES. 00190031
           05  TFRD057-ADJ-RSN-CDE             PIC X(02)  VALUE SPACES. 00200031
           05  TFRD057-XFER-RCPT-DATE.                                  00210031
               10  TFRD057-XFER-RCPT-DATE-YY   PIC 9(04)  VALUE ZEROS.  00220031
               10  FILLER                      PIC X(01)  VALUE '-'.    00230013
               10  TFRD057-XFER-RCPT-DATE-MM   PIC 9(02)  VALUE ZEROS.  00240031
               10  FILLER                      PIC X(01)  VALUE '-'.    00250013
               10  TFRD057-XFER-RCPT-DATE-DD   PIC 9(02)  VALUE ZEROS.  00260031
           05  TFRD057-ITM-NBR                 PIC S9(15)V COMP-3       00270031
                                                          VALUE ZEROS.  00280013
           05  TFRD057-SKU-NBR                 PIC S9(08) COMP-3        00290031
                                                          VALUE ZEROS.  00300031
           05  TFRD057-ITM-RTL-PRIC-AMT        PIC S9(05)V99 COMP-3     00310031
                                                          VALUE ZEROS.  00320013
           05  TFRD057-ITM-QTY                 PIC S9(04) COMP          00330031
                                                          VALUE ZEROS.  00340013
           05  TFRD057-XFER-CRTE-DATE.                                  00350031
               10  TFRD057-XFER-CRTE-DATE-YY   PIC 9(04)  VALUE ZEROS.  00360031
               10  FILLER                      PIC X(01)  VALUE '-'.    00370013
               10  TFRD057-XFER-CRTE-DATE-MM   PIC 9(02)  VALUE ZEROS.  00380031
               10  FILLER                      PIC X(01)  VALUE '-'.    00390013
               10  TFRD057-XFER-CRTE-DATE-DD   PIC 9(02)  VALUE ZEROS.  00400031
           05  TFRD057-DEPT                    PIC S9(04) COMP-3        00410031
                                                          VALUE ZEROS.  00420018
           05  TFRD057-SUBCLASS                PIC S9(04) COMP-3        00430031
                                                          VALUE ZEROS.  00430120
           05  TFRD057-FR-STR-NBR              PIC S9(04) COMP          00431031
                                                          VALUE ZEROS.  00440018
           05  TFRD057-TO-STR-NBR              PIC S9(04) COMP          00441031
                                                          VALUE ZEROS.  00442029
           05  TFRD057-EXTENDED-RETAIL         PIC S9(10)V99 COMP-3     00450031
                                                          VALUE ZEROS.  00460021
