000100******************************************************************        
000200*  PROCESS DATES RECORD LAYOUT. USED AS INPUT INTO VARIOUS                
000210*  TRANSFERS REPORT AND EXTRACT PROGRAMS THAT USE BEGINNING AND           
000220*  ENDING DATES BASED ON FISCAL MONTH OR REQUESTED INPUT DATES.           
000300*                                            RECORD LENGTH = 16           
000400******************************************************************        
000500 01  TF029-PROCESS-DATES-RECORD.                                          
000600     05  TF029-PROCESS-START-DATE.                                        
000610         10  TF029-PROCESS-START-MONTH   PIC  9(02)  VALUE ZEROS.         
000620         10  TF029-PROCESS-START-DAY     PIC  9(02)  VALUE ZEROS.         
000630         10  TF029-PROCESS-START-CENTURY PIC  9(02)  VALUE ZEROS.         
000640         10  TF029-PROCESS-START-YEAR    PIC  9(02)  VALUE ZEROS.         
000641     05  TF029-PROCESS-END-DATE.                                          
000642         10  TF029-PROCESS-END-MONTH     PIC  9(02)  VALUE ZEROS.         
000643         10  TF029-PROCESS-END-DAY       PIC  9(02)  VALUE ZEROS.         
000644         10  TF029-PROCESS-END-CENTURY   PIC  9(02)  VALUE ZEROS.         
000645         10  TF029-PROCESS-END-YEAR      PIC  9(02)  VALUE ZEROS.         
