      ******************************************************************00010011
      *  RTV TRANSFER DISCREPANCY REPORT RECORD LAYOUT.                 00020011
      *  USED TO PRODUCE THE FISCAL MONTH RTV DISCREPANCY REPORT.       00030011
      *                                            RECORD LENGTH = 60   00040011
010209*  01/02/09 WR35615 D WELLER                                      00050011
010209*      EXPAND DISTRICT NUMBER                                     00060011
      ******************************************************************00070011
C98011*  11/03/14 CHG0098011 COGNIZANT                                  00080011
C98011*      INCREASED SPACE OF DOLLARS-XFER AND DOLLARS-RCVD           00090011
      ******************************************************************00100011
       01  TF043-RTV-TRANSFER-RECORD.                                   00110011
           05  TF043-RCV-STR-NBR               PIC  9(04)  VALUE ZEROS. 00120011
010209     05  TF043-DISTRICT-NBR              PIC  X(04)  VALUE SPACE. 00130011
           05  TF043-FR-STR-NBR                PIC  9(04)  VALUE ZEROS. 00140011
           05  TF043-XFERS-RCVD                PIC  S9(05) VALUE ZEROS. 00150011
           05  TF043-XFERS-WITH-DISCREP        PIC  S9(05) VALUE ZEROS. 00160011
           05  TF043-UNITS-RCVD                PIC  S9(06) VALUE ZEROS. 00170011
           05  TF043-UNITS-VARIANCE            PIC  S9(06) VALUE ZEROS. 00180011
C98011     05  TF043-DOLLARS-XFER              PIC  S9(08)V99           00190011
                                                           VALUE ZEROS. 00200011
C98011     05  TF043-DOLLARS-RCVD              PIC  S9(08)V99           00210011
                                                           VALUE ZEROS. 00220011
010209     05  FILLER                          PIC  X(06)  VALUE SPACE. 00230011
