      ***************************************************************** 00010000
      *    RECORD PURPOSE: TRANSFER DOCUMENT LOOK UP DATA             * 00020000
      *    RECORD LENGTH:  289 BYTES                                  * 00030000
      *    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
      ***************************************************************** 00050000
                                                                        00060000
       01  TF048-XFER-TO-PTC-RECORD.                                    00070000
           05  TF048-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00080000
           05  TF048-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00090000
           05  TF048-ERR-TYP-IND               PIC  X(01)  VALUE SPACE. 00100000
           05  TF048-ERR-MSG                   PIC  X(70)  VALUE SPACE. 00110000
           05  TF048-PRICE-REQ-IND             PIC  X(01)  VALUE SPACE. 00111000
           05  TF048-XFER-DKEY                 PIC  9(09)  VALUE ZEROS. 00112000
           05  TF048-XFER-TYP-CDE-X            PIC  X(02)  VALUE SPACE. 00113000
           05  TF048-XFER-TYP-CDE  REDEFINES  TF048-XFER-TYP-CDE-X      00114000
                                               PIC  9(02).              00115000
           05  TF048-PROCESSING-IND            PIC  X(01)  VALUE SPACE. 00116000
               88  TF048-CONTINUE-PROCESSING               VALUE 'C'.   00117000
               88  TF048-STOP-PROCESSING                   VALUE 'S'.   00118000
               88  TF048-WARNING-PROCESSING                VALUE 'W'.   00119000
               88  TF048-VOID-PROCESSING                   VALUE 'V'.   00120000
           05  TF048-XFER-TYPE-DESC-LN1        PIC  X(18)  VALUE SPACE. 00130000
           05  TF048-XFER-TYPE-DESC-LN2        PIC  X(18)  VALUE SPACE. 00140000
           05  TF048-FROM-LOC-NBR-X            PIC  X(05)  VALUE SPACE. 00150001
           05  TF048-FROM-LOC-NBR  REDEFINES  TF048-FROM-LOC-NBR-X      00160001
                                               PIC  9(05).              00170000
           05  TF048-FROM-LOC-NAME             PIC  X(05)  VALUE SPACE. 00180001
           05  TF048-TO-LOC-NBR-X              PIC  X(05)  VALUE SPACE. 00190001
           05  TF048-TO-LOC-NBR  REDEFINES  TF048-TO-LOC-NBR-X          00200001
                                               PIC  9(05).              00210000
           05  TF048-TO-LOC-NAME               PIC  X(05)  VALUE SPACE. 00220001
           05  TF048-CONTAINER-TYP-CDE-X       PIC  X(02)  VALUE SPACE. 00230000
           05  TF048-CONTAINER-TYP-CDE  REDEFINES                       00240000
                   TF048-CONTAINER-TYP-CDE-X   PIC  9(02).              00250000
           05  TF048-CONTAINER-TYPE-IND        PIC  X(01)  VALUE SPACE. 00260000
               88  TF048-CONTAINER-TYPE                    VALUE 'C'.   00270000
               88  TF048-TRAILER-TYPE                      VALUE 'T'.   00280000
           05  TF048-LG-TOTE-SEAL-ONE          PIC  X(07)  VALUE SPACE. 00290000
           05  TF048-LG-TOTE-SEAL-TWO          PIC  X(07)  VALUE SPACE. 00300000
           05  TF048-SM-TOTE-BAG-SEAL          PIC  X(07)  VALUE SPACE. 00310000
           05  TF048-TRAILER-NBR               PIC  X(08)  VALUE SPACE. 00320000
           05  TF048-TRAILER-SEAL-NBR          PIC  X(07)  VALUE SPACE. 00330000
           05  TF048-TOT-QTY-X                 PIC  X(05)  VALUE SPACE. 00340000
           05  TF048-TOT-QTY  REDEFINES  TF048-TOT-QTY-X                00350000
                                               PIC  9(05).              00360000
           05  TF048-TOT-RTL-X                 PIC  X(08)  VALUE SPACE. 00370000
           05  TF048-TOT-RTL  REDEFINES  TF048-TOT-RTL-X                00380000
                                               PIC  9(08).              00390000
           05  TF048-REQUESTED-BY-FIRST-INIT   PIC  X(01)  VALUE SPACE. 00400000
           05  TF048-REQUESTED-BY-LAST-NAME    PIC  X(20)  VALUE SPACE. 00410000
           05  TF048-ATTN-TO-FIRST-INIT        PIC  X(01)  VALUE SPACE. 00420000
           05  TF048-ATTN-TO-LAST-NAME         PIC  X(20)  VALUE SPACE. 00430000
           05  TF048-CALLBACK-NBR              PIC  9(04)  VALUE ZEROS. 00440000
           05  TF048-CORP-STK-BAL-APP-NBR      PIC  9(09)  VALUE ZEROS. 00450000
           05  TF048-CUST-NAME                 PIC  X(20)  VALUE SPACE. 00460000
           05  TF048-CUST-PHONE                PIC  X(10)  VALUE SPACE. 00470000
