      ***************************************************************** 00010000
      *    RECORD PURPOSE: PURGE TFT_PHY_INV_ITM TABLE                * 00020000
      *    RECORD LENGTH:  100 BYTES                                  * 00030000
      *    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
      ***************************************************************** 00050000
       01  TF063-PURGE-XFER-RECORD.                                             
           05  TF063-XFER-DKEY-ID          PIC S9(08)  COMP                     
                                                       VALUE ZEROS.             
           05  TF063-XFER-LNE-NBR          PIC S9(04)  COMP                     
                                                       VALUE ZEROS.             
           05  TF063-BTCH-DKEY-ID          PIC S9(08)  COMP                     
                                                       VALUE ZEROS.             
           05  TF063-FRM-PSTG-STR-NBR      PIC S9(04)  COMP                     
                                                       VALUE ZEROS.             
           05  TF063-TO-PSTG-STR-NBR       PIC S9(04)  COMP                     
                                                       VALUE ZEROS.             
           05  TF063-UNT-RTL-AMT           PIC S9(7)V99 COMP-3                  
                                                       VALUE ZEROS.             
           05  TF063-UNT-QTY               PIC S9(04)  COMP                     
                                                       VALUE ZEROS.             
           05  FILLER                      PIC  X(02)  VALUE SPACES.            
           05  TF063-XFER-DKEY-ID-X        PIC  X(11)  VALUE ZEROS.             
           05  FILLER                      PIC  X(03)  VALUE SPACES.            
           05  TF063-XFER-LNE-NBR-X        PIC  X(05)  VALUE ZEROS.             
           05  FILLER                      PIC  X(03)  VALUE SPACES.            
           05  TF063-BTCH-DKEY-ID-X        PIC  X(10)  VALUE ZEROS.             
           05  FILLER                      PIC  X(03)  VALUE SPACES.            
           05  TF063-FRM-PSTG-STR-NBR-X    PIC  X(05)  VALUE ZEROS.             
           05  FILLER                      PIC  X(03)  VALUE SPACES.            
           05  TF063-TO-PSTG-STR-NBR-X     PIC  X(05)  VALUE ZEROS.             
           05  FILLER                      PIC  X(29)  VALUE SPACES.            
