000100***************************************************************** 00010000
000200*    RECORD PURPOSE: VERIFY TO STORE INPUT                      * 00020003
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030007
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  TF005-XFER-FROM-PTC-RECORD.                                  00060002
000700     05  TF005-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070002
000800     05  TF005-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080002
000900     05  TF005-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090006
001000     05  TF005-FROM-STR-NBR-X            PIC  X(04)  VALUE SPACE. 00100005
001100     05  TF005-FROM-STR-NBR  REDEFINES  TF005-FROM-STR-NBR-X      00110005
001200                                         PIC  9(04).              00120002
001300     05  TF005-TO-STR-NBR-X              PIC  X(04)  VALUE SPACE. 00130005
001400     05  TF005-TO-STR-NBR  REDEFINES  TF005-TO-STR-NBR-X          00140005
001500                                         PIC  9(04).              00150005
001600     05  TF005-XFER-TYP-CDE-X            PIC  X(02)  VALUE SPACE. 00160004
001700     05  TF005-XFER-TYP-CDE  REDEFINES  TF005-XFER-TYP-CDE-X      00170004
001800                                         PIC  9(02).              00180002
           05  FILLER                          PIC X(4097) VALUE SPACE. 00190007
003300     05  TF005-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00200007
003400         88  TF005-MQ-INDICATOR-N                    VALUE 'N'.   00210007
003400         88  TF005-MQ-INDICATOR-Y                    VALUE 'Y'.   00220007
000900     05  TF005-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00230007
000900     05  TF005-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00240007
000900     05  TF005-MSGID                     PIC  X(24)  VALUE SPACE. 00250007
