      ******************************************************************00010008
      **TFRD055 - UNLOAD OF TRANSFERS TO PASS TO ML/FS                  00020013
      ******************************************************************00030008
       01  TFRD055-TRANSFER-TO-PROCESS.                                 00040013
           05  TFRD055-XFER-DKEY-ID            PIC S9(09) COMP          00050013
                                                          VALUE ZEROS.  00060013
           05  TFRD055-XFER-LNE-NBR            PIC S9(04) COMP          00070013
                                                          VALUE ZEROS.  00080013
           05  TFRD055-PSTG-SEQ-NBR            PIC S9(04) COMP          00090013
                                                          VALUE ZEROS.  00100013
           05  TFRD055-FRM-PSTG-STR-NBR        PIC S9(04) COMP          00110013
                                                          VALUE ZEROS.  00120013
           05  TFRD055-TO-PSTG-STR-NBR         PIC S9(04) COMP          00130013
                                                          VALUE ZEROS.  00140013
           05  TFRD055-XFER-SEQ-NBR            PIC S9(09) COMP          00150013
                                                          VALUE ZEROS.  00160013
           05  FILLER                          PIC X(01)  VALUE SPACES. 00170013
           05  TFRD055-TYP-1ST-LNE-DESC        PIC X(18)  VALUE SPACES. 00180013
           05  TFRD055-TYP-2ND-LNE-DESC        PIC X(18)  VALUE SPACES. 00190013
           05  TFRD055-ADJ-RSN-CDE             PIC X(02)  VALUE SPACES. 00200013
           05  TFRD055-XFER-RCPT-DATE.                                  00210013
               10  TFRD055-XFER-RCPT-DATE-YY   PIC 9(04)  VALUE ZEROS.  00220013
               10  FILLER                      PIC X(01)  VALUE '-'.    00230013
               10  TFRD055-XFER-RCPT-DATE-MM   PIC 9(02)  VALUE ZEROS.  00240013
               10  FILLER                      PIC X(01)  VALUE '-'.    00250013
               10  TFRD055-XFER-RCPT-DATE-DD   PIC 9(02)  VALUE ZEROS.  00260013
           05  TFRD055-ITM-NBR                 PIC S9(15)V COMP-3       00270013
                                                          VALUE ZEROS.  00280013
           05  TFRD055-SKU-NBR                 PIC S9(08) COMP-3        00290015
                                                          VALUE ZEROS.  00300013
           05  TFRD055-ITM-RTL-PRIC-AMT        PIC S9(05)V99 COMP-3     00310013
                                                          VALUE ZEROS.  00320013
           05  TFRD055-ITM-QTY                 PIC S9(04) COMP          00330013
                                                          VALUE ZEROS.  00340013
           05  TFRD055-XFER-CRTE-DATE.                                  00350014
               10  TFRD055-XFER-CRTE-DATE-YY   PIC 9(04)  VALUE ZEROS.  00360013
               10  FILLER                      PIC X(01)  VALUE '-'.    00370013
               10  TFRD055-XFER-CRTE-DATE-MM   PIC 9(02)  VALUE ZEROS.  00380013
               10  FILLER                      PIC X(01)  VALUE '-'.    00390013
               10  TFRD055-XFER-CRTE-DATE-DD   PIC 9(02)  VALUE ZEROS.  00400013
           05  TFRD055-DEPT                    PIC S9(04) COMP-3        00410019
                                                          VALUE ZEROS.  00420018
           05  TFRD055-SUBCLASS                PIC S9(04) COMP-3        00430019
                                                          VALUE ZEROS.  00430120
           05  TFRD055-FR-STR-NBR              PIC S9(04) COMP          00431020
                                                          VALUE ZEROS.  00440018
           05  TFRD055-TO-STR-NBR              PIC S9(04) COMP          00441029
                                                          VALUE ZEROS.  00442029
           05  TFRD055-EXTENDED-RETAIL         PIC S9(10)V99 COMP-3     00450028
                                                          VALUE ZEROS.  00460021
