      ******************************************************************00010008
      **TFRD056 - TRANSFERS WITH UPDATED TTFITPS BTCH_DKEY_ID           00020017
      ******************************************************************00030008
       01  TFRD056-TRANSFER-TO-PROCESS.                                 00040017
           05  TFRD056-XFER-DKEY-ID            PIC S9(09) COMP          00050017
                                                          VALUE ZEROS.  00060013
           05  TFRD056-XFER-LNE-NBR            PIC S9(04) COMP          00070017
                                                          VALUE ZEROS.  00080013
           05  TFRD056-PSTG-SEQ-NBR            PIC S9(04) COMP          00090017
                                                          VALUE ZEROS.  00100013
           05  TFRD056-FRM-PSTG-STR-NBR        PIC S9(04) COMP          00110017
                                                          VALUE ZEROS.  00120013
           05  TFRD056-TO-PSTG-STR-NBR         PIC S9(04) COMP          00130017
                                                          VALUE ZEROS.  00140013
           05  TFRD056-XFER-SEQ-NBR            PIC S9(09) COMP          00150017
                                                          VALUE ZEROS.  00160013
           05  FILLER                          PIC X(01)  VALUE SPACES. 00170013
           05  TFRD056-TYP-1ST-LNE-DESC        PIC X(18)  VALUE SPACES. 00180017
           05  TFRD056-TYP-2ND-LNE-DESC        PIC X(18)  VALUE SPACES. 00190017
           05  TFRD056-ADJ-RSN-CDE             PIC X(02)  VALUE SPACES. 00200017
           05  TFRD056-XFER-RCPT-DATE.                                  00210017
               10  TFRD056-XFER-RCPT-DATE-YY   PIC 9(04)  VALUE ZEROS.  00220017
               10  FILLER                      PIC X(01)  VALUE '-'.    00230013
               10  TFRD056-XFER-RCPT-DATE-MM   PIC 9(02)  VALUE ZEROS.  00240017
               10  FILLER                      PIC X(01)  VALUE '-'.    00250013
               10  TFRD056-XFER-RCPT-DATE-DD   PIC 9(02)  VALUE ZEROS.  00260017
           05  TFRD056-ITM-NBR                 PIC S9(15)V COMP-3       00270017
                                                          VALUE ZEROS.  00280013
           05  TFRD056-SKU-NBR                 PIC S9(08) COMP-3        00290017
                                                          VALUE ZEROS.  00300013
           05  TFRD056-ITM-RTL-PRIC-AMT        PIC S9(05)V99 COMP-3     00310017
                                                          VALUE ZEROS.  00320013
           05  TFRD056-ITM-QTY                 PIC S9(04) COMP          00330017
                                                          VALUE ZEROS.  00340013
           05  TFRD056-XFER-CRTE-DATE.                                  00350017
               10  TFRD056-XFER-CRTE-DATE-YY   PIC 9(04)  VALUE ZEROS.  00360017
               10  FILLER                      PIC X(01)  VALUE '-'.    00370013
               10  TFRD056-XFER-CRTE-DATE-MM   PIC 9(02)  VALUE ZEROS.  00380017
               10  FILLER                      PIC X(01)  VALUE '-'.    00390013
               10  TFRD056-XFER-CRTE-DATE-DD   PIC 9(02)  VALUE ZEROS.  00400017
           05  TFRD056-DEPT                    PIC S9(04) COMP-3        00401018
                                                          VALUE ZEROS.  00402018
           05  TFRD056-SUBCLASS                PIC S9(04) COMP-3        00403018
                                                          VALUE ZEROS.  00404018
           05  TFRD056-FR-STR-NBR              PIC S9(04) COMP          00405019
                                                          VALUE ZEROS.  00406019
           05  TFRD056-TO-STR-NBR              PIC S9(04) COMP          00407022
                                                          VALUE ZEROS.  00408022
           05  TFRD056-EXTENDED-RETAIL         PIC S9(10)V99 COMP-3     00409021
                                                          VALUE ZEROS.  00409121
           05  TFRD056-BTCH-DKEY-ID            PIC S9(09) COMP          00410017
                                                          VALUE ZEROS.  00420016
           05  TFRD056-JULIAN-DATE             PIC S9(04) COMP          00430017
                                                          VALUE ZEROS.  00440016
