000100***************************************************************** 00010000
000200*    RECORD PURPOSE: UPC/SKU LOOK UP FOR RECEIVE TRANSFER       * 00020000
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030007
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  TF019-XFER-FROM-PTC-RECORD.                                  00060000
000700     05  TF019-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070000
000800     05  TF019-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080000
000900     05  TF019-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090006
001000     05  TF019-XFER-DKEY                 PIC  9(09)  VALUE ZEROS. 00100001
001100     05  TF019-XFER-TYP-CDE-X            PIC  X(02)  VALUE SPACE. 00110001
001200     05  TF019-XFER-TYP-CDE  REDEFINES  TF019-XFER-TYP-CDE-X      00120001
001300                                         PIC  9(02).              00130000
001400     05  TF019-UPC-NBR-X                 PIC  X(13)  VALUE SPACE. 00140000
001500     05  TF019-UPC-NBR  REDEFINES  TF019-UPC-NBR-X                00150000
001600                                         PIC  9(13).              00160000
001700     05  TF019-SKU-NBR-X                 PIC  X(08).              00170008
002700     05  TF019-UNDO-IND                  PIC  X(01)  VALUE SPACE. 00270001
002800     05  TF019-STR-NBR-X                 PIC  X(04)  VALUE SPACE. 00280005
002900     05  TF019-STR-NBR     REDEFINES  TF019-STR-NBR-X             00290005
003000                                         PIC  9(04).              00300005
003100     05  TF019-FROM-STR-NBR-X            PIC  X(04)  VALUE SPACE. 00310005
003200     05  TF019-FROM-STR-NBR REDEFINES TF019-FROM-STR-NBR-X        00320005
003300                                         PIC  9(04).              00330004
           05  FILLER                          PIC X(4066) VALUE SPACE. 00340007
003300     05  TF019-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00350007
003400         88  TF019-MQ-INDICATOR-N                    VALUE 'N'.   00360007
003400         88  TF019-MQ-INDICATOR-Y                    VALUE 'Y'.   00370007
000900     05  TF019-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00380007
000900     05  TF019-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00390007
000900     05  TF019-MSGID                     PIC  X(24)  VALUE SPACE. 00400007
