000100***************************************************************** 00010000
000200*    RECORD PURPOSE: TRANSFER TYPE & DEFAULT DATA               * 00020007
000300*    RECORD LENGTH:  VARIABLE - 744  BYTES MAXIMUM              * 00030019
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600                                                                  00060000
000700 01  TF002-XFER-TO-PTC-RECORD.                                    00070006
000800     05  TF002-XFER-TO-PTC-FIXED-DATA.                            00080006
000900         10  TF002-TOT-REC-LENGTH        PIC  9(04)  VALUE ZEROS. 00090000
001000         10  TF002-MATCHING-NBR-FIELD    PIC  9(08)  VALUE ZEROS. 00100000
001100         10  TF002-ERR-TYP-IND           PIC  X(01)  VALUE SPACE. 00110000
001200         10  TF002-ERR-MSG               PIC  X(70)  VALUE SPACE. 00120000
001201         10  TF002-XFER-DKEY             PIC  9(09)  VALUE ZEROS. 00130015
001500         10  TF002-NBR-OF-OCCURS         PIC  9(02)  VALUE ZEROS. 00140015
001510                                                                  00150015
001521*                                                                 00160007
001522*  TABLED DATA MUST BE AT THE END OF THE RECORD LAYOUT            00170007
001523*                                                                 00180008
001700     05  TF002-XFER-TO-PTC-TABLED-DATA.                           00190008
001800         10  TF002-XFER-TYP-CDE-TBL OCCURS 10 TIMES               00200010
001900                       INDEXED BY TYP-CDE-IDX.                    00210009
002000             15  TF002-XFER-TYP-CDE-X    PIC  X(02)  VALUE SPACE. 00220012
002010             15  TF002-XFER-TYP-CDE REDEFINES TF002-XFER-TYP-CDE-X00230012
002020                                         PIC  9(02).              00240003
002100             15  TF002-XFER-PATH-CDE     PIC  X(01)  VALUE SPACE. 00250013
002200             15  TF002-XFER-TYP-CDE-DESC-LN1                      00260010
002210                                         PIC  X(18)  VALUE SPACE. 00270000
002211             15  TF002-XFER-TYP-CDE-DESC-LN2                      00280014
002230                                         PIC  X(18)  VALUE SPACE. 00290000
002240             15  TF002-XFER-PRICE-REQ-IND                         00300016
002250                                         PIC  X(01)  VALUE SPACE. 00310016
002260             15  TF002-DEFAULT-TO-STR-IND                         00320018
002270                                         PIC  X(01)  VALUE SPACE. 00330018
002280             15  TF002-DEFAULT-STR-LOC-NBR                        00340018
002281                                         PIC  9(04)  VALUE ZEROS. 00350018
002290             15  TF002-DEFAULT-STR-LOC-NAME                       00360018
002300                                         PIC  X(20)  VALUE SPACE. 00370018
