      ******************************************************************00010004
      *  TRANSFER RECEIPTS RECORD LAYOUT.                               00020004
      *  USED TO PRODUCE THE FISCAL MONTH ASSUMPTIVE VERSUS POSITIVE    00030004
      *  RECEIPT REPORT                                                 00031004
      *                                            RECORD LENGTH = 40   00040004
      ******************************************************************00050004
      **DATE:10/04/2004 MADE BY: RAY GRAF EXPAND STORE                  00051007
      ******************************************************************00052005
      **DATE:12/04/2008 MADE BY: DAVID WELLER EXPAND DISTRICT           00053011
      ******************************************************************00054011
       01  TF039-XFER-RECEIPTS-RECORD.                                  00060004
           05  TF039-DISTRICT-NMBR-X           PIC  X(04)  VALUE '0000'.00060112
           05  TF039-DISTRICT-NMBR REDEFINES    TF039-DISTRICT-NMBR-X   00061012
                                               PIC  9(04).              00062013
           05  TF039-RECV-STR-NBR-X            PIC  X(05)  VALUE SPACE. 00070006
           05  TF039-RECV-STR-NBR REDEFINES     TF039-RECV-STR-NBR-X    00080004
                                               PIC  9(05).              00090006
           05  TF039-XFER-STATUS               PIC  X(02)  VALUE SPACE. 00170004
               88  TF039-AR                                VALUE '01'.  00180004
               88  TF039-PR-AND-NO-DTL-CHK                 VALUE '02'.  00181104
               88  TF039-PR-AND-DTL-CHK                    VALUE '03'.  00182004
               88  TF039-VOID                              VALUE '04'.  00210004
           05  TF039-XFER-COUNT                PIC S9(09)  VALUE ZEROS  00220004
                                                           COMP-3.      00230004
           05  FILLER                          PIC  X(24)  VALUE SPACE. 00340010
