000100***************************************************************** 00010000
000200*    RECORD PURPOSE: CONTROL CARD CONTAINING RUN TYPE           * 00020000
000300*                    AND, IF SPECIAL RUN, BEGIN & END DATES     * 00030000
000400*    RECORD LENGTH:  80 BYTES                                   * 00040000
000500*    RECORD FORMAT:  SEQUENTIAL                                 * 00050000
000600***************************************************************** 00060000
000700 01  TF035-CONTROL-CARD-RECORD.                                   00070000
000800     05  TF035-RUN-TYPE                  PIC  X(01)  VALUE SPACE. 00080000
000900         88  TF035-NORMAL-RUN                        VALUE 'N'.   00090000
001000         88  TF035-SPECIAL-RUN                       VALUE 'S'.   00100000
001100     05  FILLER                          PIC  X(01)  VALUE SPACE. 00110001
001200     05  TF035-BEGIN-DATE.                                        00120000
001300         10  TF035-BEGIN-MONTH           PIC  9(02)  VALUE ZEROS. 00130000
001400         10  FILLER                      PIC  X(01)  VALUE SPACE. 00140000
001500         10  TF035-BEGIN-DAY             PIC  9(02)  VALUE ZEROS. 00150000
001600         10  FILLER                      PIC  X(01)  VALUE SPACE. 00160000
001800         10  TF035-BEGIN-CENTURY         PIC  9(02)  VALUE ZEROS. 00180000
001700         10  TF035-BEGIN-YEAR            PIC  9(02)  VALUE ZEROS. 00181003
001900     05  FILLER                          PIC  X(01)  VALUE SPACE. 00190002
002000     05  TF035-END-DATE.                                          00200000
002100         10  TF035-END-MONTH             PIC  9(02)  VALUE ZEROS. 00210000
002200         10  FILLER                      PIC  X(01)  VALUE SPACE. 00220000
002300         10  TF035-END-DAY               PIC  9(02)  VALUE ZEROS. 00230000
002400         10  FILLER                      PIC  X(01)  VALUE SPACE. 00240000
002600         10  TF035-END-CENTURY           PIC  9(02)  VALUE ZEROS. 00260000
002500         10  TF035-END-YEAR              PIC  9(02)  VALUE ZEROS. 00261003
002700     05  FILLER                          PIC  X(57)  VALUE SPACE. 00270000
