      ******************************************************************00010016
      *  TRANSFER OFFSITE STORAGE REPORT RECORD LAYOUT.                 00020016
      *  USED TO PRODUCE THE OFFSITE STORAGE REPORTS.                   00030016
      *                                            RECORD LENGTH = 60   00031016
      ******************************************************************00032016
      **DATE:10/04/2004 MADE BY: RAY GRAF EXPAND STORE AND XFER NUMBER  00032117
      ******************************************************************00032217
       01  TF040-OFFSITE-STORAGE-RECORD.                                00033016
           05  TF040-XFER-NBR.                                          00034016
               10  TF040-FR-STR-NBR            PIC  9(05)  VALUE ZEROS. 00035018
               10  TF040-XFER-SEQ-NBR          PIC  9(06)  VALUE ZEROS. 00035116
           05  TF040-DEPT                      PIC  9(04)  VALUE ZEROS. 00035316
           05  TF040-CLASS                     PIC  9(04)  VALUE ZEROS. 00035416
           05  TF040-SUBCLASS                  PIC  9(04)  VALUE ZEROS. 00035516
           05  TF040-SCN-UPC-NBR               PIC  S9(15) VALUE ZEROS  00035716
                                                           COMP-3.      00035816
           05  TF040-XFER-QTY                  PIC  S9(05) VALUE ZEROS  00035916
                                                           COMP-3.      00036016
           05  TF040-XFER-PRIC-AMT             PIC  S9(05)V99           00036116
                                                           VALUE ZEROS  00037016
                                                           COMP-3.      00038016
           05  TF040-XFER-STAT-CDE             PIC  X(02)  VALUE SPACE. 00039016
           05  TF040-ITM-NBR                   PIC  9(15)  VALUE ZEROS. 00039116
           05  FILLER                          PIC  X(05)  VALUE SPACE. 00040019
