000100***************************************************************** 00010000
000200*    RECORD PURPOSE: UPC LOOK UP                                * 00020000
000300*    RECORD LENGTH:  4241 BYTES                                 * 00030000
000400*    RECORD FORMAT:  SEQUENTIAL                                 * 00040000
000500***************************************************************** 00050000
000600 01  TF009-XFER-FROM-PTC-RECORD.                                  00060000
000700     05  TF009-TOT-REC-LENGTH            PIC  9(04)  VALUE ZEROS. 00070000
000800     05  TF009-MATCHING-NBR-FIELD        PIC  9(08)  VALUE ZEROS. 00080000
000900     05  TF009-LISTENER-CODE             PIC  X(01)  VALUE SPACE. 00090000
001000     05  TF009-UPC-NBR-X                 PIC  X(15)  VALUE SPACE. 00100001
001100     05  TF009-UPC-NBR  REDEFINES  TF009-UPC-NBR-X                00110000
001200                                         PIC  9(15).              00120001
001300     05  TF009-SKU-NBR-X                 PIC  X(08)  VALUE SPACE. 00130000
001100     05  TF009-SKU-NBR  REDEFINES  TF009-SKU-NBR-X                00140000
001200                                         PIC  9(08).              00150000
001800     05  TF009-XFER-TYP-CDE              PIC  9(02)  VALUE ZEROS. 00180000
001900     05  TF009-XFER-TYP-CDE-X  REDEFINES  TF009-XFER-TYP-CDE      00190000
002000                                         PIC  X(02).              00200000
002100     05  TF009-CONTNR-TYP-CDE            PIC  X(02)  VALUE SPACE. 00210000
002200     05  TF009-STR-NBR-X                 PIC  X(04)  VALUE SPACE. 00220000
002300     05  TF009-STR-NBR     REDEFINES  TF009-STR-NBR-X             00230000
002400                                         PIC  9(04).              00240000
002500     05  TF009-TO-STR-NBR-X              PIC  X(04)  VALUE SPACE. 00250000
002600     05  TF009-TO-STR-NBR  REDEFINES  TF009-TO-STR-NBR-X          00260000
002700                                         PIC  9(04).              00270000
           05  FILLER                          PIC X(4072) VALUE SPACE. 00280001
003300     05  TF009-MQ-INDICATOR              PIC  X(01)  VALUE SPACE. 00290000
003400         88  TF009-MQ-INDICATOR-N                    VALUE 'N'.   00300000
003400         88  TF009-MQ-INDICATOR-Y                    VALUE 'Y'.   00310000
000900     05  TF009-REPLYTOQ                  PIC  X(48)  VALUE SPACE. 00320000
000900     05  TF009-REPLYTOQMGR               PIC  X(48)  VALUE SPACE. 00330000
000900     05  TF009-MSGID                     PIC  X(24)  VALUE SPACE. 00340000
