      ******************************************************************00001000
      * WORKING STORAGE PORTION OF TRANSFER NUMBER CHECK DIGIT          00002000
      * CALCULATION ROUTINE.                                            00003000
      * ALSO REQUIRES TFPD008.                                          00004000
      ******************************************************************00005000
      * 11/15/2004 - DAVE WELLER - CREATED                              00005100
      ******************************************************************00005200
      * 02/16/2005 - DAVE WELLER - STANDARDS COMPLIANCE                 00005300
      *              CHANGED TFWS008- TO TF008-                         00005400
      ******************************************************************00005500
       01  TF008-CHECK-DIGIT-WS.                                        00005600
           05  TF008-XFER-NBR.                                          00005700
               10  TF008-XFER-FROM-STORE-NBR PIC 9(05).                 00005800
               10  TF008-XFER-SEQ-NBR          PIC 9(06).               00005900
           05  FILLER  REDEFINES  TF008-XFER-NBR.                       00006000
               10  TF008-XFER-DIGIT            OCCURS 11 TIMES          00007000
                                               INDEXED BY               00008000
                                               TF008-XFER-IDX           00009000
                                               PIC  9(01).              00010000
           05  TF008-CHK-DIGIT                 PIC  9(01)  VALUE ZEROS. 00020000
           05  TF008-DBL-DIGIT                 PIC  9(02)  VALUE ZEROS. 00030000
           05  TF008-DIGIT-SUM                 PIC  9(02)  VALUE ZEROS. 00040000
           05  TF008-IDX-VALUE                 PIC  9(01)  VALUE ZEROS. 00050000
           05  TF008-QUOTIENT                  PIC  9(01)  VALUE ZEROS. 00060000
           05  TF008-REMAINDER                 PIC  9(01)  VALUE ZEROS. 00070000
