      *----------------------------------------------------------------*00010006
      *                         TFWS002                                *00020006
      *                                                                *00030006
      *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE TRANSFER SYSTEM   *00040006
      *                                                                *00050006
      *----------------------------------------------------------------*00060006
100404* 10/04/2004 R GRAF   - EXPAND TRANSFER NUMBER                    00061008
100404******************************************************************00062007
                                                                        00070006
       01  TF002-TRANSFER-SEL-REC.                                      00080006
             05  TF002-SELECTED-ITEMS           PIC S9(05)  COMP-3      00090006
                                                            VALUE ZERO. 00100006
             05  TF002-MAX-ITEMS                PIC  9(02)  VALUE 20.   00110006
             05  TF002-SELECTED-ITEM-ARRAY.                             00120006
                 10  FILLER                     OCCURS 20 TIMES         00130006
                                                INDEXED BY TF002-IDX.   00140006
                     15  TF002-ITEM             PIC S9(09)  COMP-3.     00150006
                     15  TF002-ACTION-SW        PIC  X(01).             00160006
                         88  TF002-INQ                    VALUE 'I'.    00170006
                         88  TF002-UPD                    VALUE 'U'.    00180006
                         88  TF002-DEL                    VALUE 'D'.    00190006
                         88  TF002-ERR                    VALUE 'E'.    00200006
                         88  TF002-PRT                    VALUE 'P'.    00210006
                     15  TF002-KEY-DATA.                                00220006
100404*                  20  TF002-TRANSFER-NBR PIC X(10).              00230010
100404                   20  TF002-TRANSFER-NBR PIC X(11).              00231009
                         20  TF002-LINE-NBR     PIC 9(03).              00240006
