00001 *----------------------------------------------------------------*02/17/93
00002 *                         TFWS004                                *DPWS057 
00003 *                                                                *   LV007
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE TRANSFER SYSTEM   *DPWS057 
00006 *                                                                *DPWS057 
00007 *----------------------------------------------------------------*DPWS057 
00008                                                                   DPWS057 
00009  01  TF004-TRANSFER-SEL-REC.                                         CL**4
00010        05  TF004-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
00011                                                     VALUE ZERO.      CL**2
00012        05  TF004-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
00023        05  TF004-XFER-DKEY-ID           PIC S9(09)  COMP.            CL**6
00023        05  TF004-XFER-LINE-NBR          PIC S9(04)  COMP.            CL**6
00013        05  TF004-SELECTED-ITEM-ARRAY.                                CL**6
00014            10  FILLER                   OCCURS 20 TIMES              CL**6
00015                                         INDEXED BY TF004-IDX.        CL**2
00016                15  TF004-ITEM           PIC S9(09)  COMP-3.          CL**7
00017                15  TF004-ACTION-SW      PIC  X(01).                  CL**6
00018                    88  TF004-INQ                    VALUE 'I'.       CL**6
00019                    88  TF004-UPD                    VALUE 'U'.       CL**6
00020                    88  TF004-DEL                    VALUE 'D'.       CL**6
00021                    88  TF004-ERR                    VALUE 'E'.       CL**6
00022                15  TF004-KEY-DATA.                                   CL**6
00023                    20  TF004-POSTING-SEQ-NBR                         CL**6
00016                                         PIC S9(04)  COMP.            CL**7
