      *                                                                 00010008
      *  THIS IS THE WORKING STORAGE LAYOUT USED THROUGHOUT THE TRANSFER00020008
      *  SYSTEM TO PASS DATA TO THE TRANSFER DOCUMENT PRINT PROGRAM.    00030008
      *                                                                 00040008
102804******************************************************************00041008
102804* 10/28/2004 D WELLER - EXPAND FROM STORE TO 5 DIGITS             00041108
102804******************************************************************00042008
       01  TF005-COMMAREA.                                              00050008
102804*    05  TF005-XFER-DOC-NBR              PIC  9(09)  VALUE ZEROS. 00060008
102804     05  TF005-XFER-DOC-NBR              PIC  9(11)  VALUE ZEROS. 00061008
           05  FILLER  REDEFINES  TF005-XFER-DOC-NBR.                   00070008
102804*        10  TF005-XFER-FROM-STORE-NBR   PIC  9(03).              00080008
102804         10  TF005-XFER-FROM-STORE-NBR   PIC  9(05).              00081008
               10  TF005-XFER-SEQ-NBR          PIC  9(06).              00090008
           05  TF005-PRINTER-DEST              PIC  X(08)  VALUE SPACE. 00100008
           05  TF005-USER-ID                   PIC  X(08)  VALUE SPACE. 00110008
