        PRINT  NOGEN                                                            
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  TMKM512                                            *           
*        MAP     TM512A                                             *           
*        PROGRAM TMKCS512                                           *           
*        TRANSID E512 - TM-PO NOTIFICATION/TROUBLE LIST             *           
*        SYSTEM  TROUBLE MANAGEMENT                                 *           
*                                                                   *           
*-------------------------------------------------------------------*           
TMKM512 DFHMSD TYPE=DSECT,                                             C        
               LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES                                                      
***********************************************************************         
TM512A  DFHMDI LINE=2,COLUMN=1,                                        C        
               SIZE=(19,80),                                           C        
               CTRL=(FREEKB),                                          C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               DSATTS=(COLOR,HILIGHT)                                           
***********************************************************************         
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='ITEMS',                                        C        
               LENGTH=05,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(02,44)                                                      
ASTRTIT DFHMDF ATTRB=(NUM,UNPROT,NORM),                                C        
               LENGTH=05,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(02,50),                                            C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='TO',                                           C        
               LENGTH=02,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(02,56)                                                      
AENDIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=05,                                              C        
               COLOR=BLUE,                                             C        
               POS=(02,59),                                            C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='OF',                                           C        
               LENGTH=02,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(02,65)                                                      
ATOTIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=05,                                              C        
               COLOR=BLUE,                                             C        
               POS=(02,68),                                            C        
               PICOUT='ZZZZ9'                                                   
***********************************************************************         
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='S',                                            C        
               LENGTH=01,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(03,01)                                                      
***********************************************************************         
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='E',                                            C        
               LENGTH=01,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,01)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DPT',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,07)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='RCV',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,20)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='TROUBLE',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,41)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='ARRIVAL',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,52)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='NOTFCTN',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,61)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='RESP/RSLV',                                    C        
               LENGTH=09,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,71)                                                      
***********************************************************************         
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='L',                                            C        
               LENGTH=01,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,01)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='ACT',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,03)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='NBR',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,07)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='PO NBR',                                       C        
               LENGTH=06,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,11)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='SEQ',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,20)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='VENDR NAME',                                   C        
               LENGTH=10,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,25)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='FAC',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,36)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='REASON',                                       C        
               LENGTH=06,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,41)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DTE/TME',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,52)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DTE/TME',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,61)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DTE/TME',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,71)                                                      
***********************************************************************         
ASEL01  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(06,01)                                                      
AACT01  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,03)                                                      
ADPTN01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,07)                                                      
APONR01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,20)                                                      
AVNME01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,25)                                                      
AFCLY01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,36)                                                      
ATBRS01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,41)                                                      
AADTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,52)                                                      
ANDTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,61)                                                      
ARDTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,71)                                                      
***********************************************************************         
ASEL02  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(07,01)                                                      
AACT02  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,03)                                                      
ADPTN02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,07)                                                      
APONR02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,20)                                                      
AVNME02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,25)                                                      
AFCLY02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,36)                                                      
ATBRS02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,41)                                                      
AADTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,52)                                                      
ANDTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,61)                                                      
ARDTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,71)                                                      
***********************************************************************         
ASEL03  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(08,01)                                                      
AACT03  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,03)                                                      
ADPTN03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,07)                                                      
APONR03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,20)                                                      
AVNME03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,25)                                                      
AFCLY03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,36)                                                      
ATBRS03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,41)                                                      
AADTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,52)                                                      
ANDTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,61)                                                      
ARDTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,71)                                                      
***********************************************************************         
ASEL04  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(09,01)                                                      
AACT04  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,03)                                                      
ADPTN04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,07)                                                      
APONR04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,20)                                                      
AVNME04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,25)                                                      
AFCLY04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,36)                                                      
ATBRS04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,41)                                                      
AADTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,52)                                                      
ANDTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,61)                                                      
ARDTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,71)                                                      
***********************************************************************         
ASEL05  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(10,01)                                                      
AACT05  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,03)                                                      
ADPTN05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,07)                                                      
APONR05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,20)                                                      
AVNME05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,25)                                                      
AFCLY05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,36)                                                      
ATBRS05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,41)                                                      
AADTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,52)                                                      
ANDTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,61)                                                      
ARDTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,71)                                                      
***********************************************************************         
ASEL06  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(11,01)                                                      
AACT06  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,03)                                                      
ADPTN06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,07)                                                      
APONR06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,20)                                                      
AVNME06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,25)                                                      
AFCLY06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,36)                                                      
ATBRS06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,41)                                                      
AADTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,52)                                                      
ANDTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,61)                                                      
ARDTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,71)                                                      
***********************************************************************         
ASEL07  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(12,01)                                                      
AACT07  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,03)                                                      
ADPTN07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,07)                                                      
APONR07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,20)                                                      
AVNME07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,25)                                                      
AFCLY07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,36)                                                      
ATBRS07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,41)                                                      
AADTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,52)                                                      
ANDTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,61)                                                      
ARDTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,71)                                                      
***********************************************************************         
ASEL08  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(13,01)                                                      
AACT08  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,03)                                                      
ADPTN08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,07)                                                      
APONR08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,20)                                                      
AVNME08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,25)                                                      
AFCLY08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,36)                                                      
ATBRS08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,41)                                                      
AADTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,52)                                                      
ANDTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,61)                                                      
ARDTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,71)                                                      
***********************************************************************         
ASEL09  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(14,01)                                                      
AACT09  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,03)                                                      
ADPTN09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,07)                                                      
APONR09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,20)                                                      
AVNME09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,25)                                                      
AFCLY09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,36)                                                      
ATBRS09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,41)                                                      
AADTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,52)                                                      
ANDTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,61)                                                      
ARDTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,71)                                                      
***********************************************************************         
ASEL10  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(15,01)                                                      
AACT10  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,03)                                                      
ADPTN10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,07)                                                      
APONR10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,20)                                                      
AVNME10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,25)                                                      
AFCLY10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,36)                                                      
ATBRS10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,41)                                                      
AADTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,52)                                                      
ANDTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,61)                                                      
ARDTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,71)                                                      
***********************************************************************         
ASEL11  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(16,01)                                                      
AACT11  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,03)                                                      
ADPTN11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,07)                                                      
APONR11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,20)                                                      
AVNME11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,25)                                                      
AFCLY11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,36)                                                      
ATBRS11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,41)                                                      
AADTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,52)                                                      
ANDTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,61)                                                      
ARDTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,71)                                                      
***********************************************************************         
ASEL12  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(17,01)                                                      
AACT12  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,03)                                                      
ADPTN12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,07)                                                      
APONR12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,20)                                                      
AVNME12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,25)                                                      
AFCLY12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,36)                                                      
ATBRS12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,41)                                                      
AADTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,52)                                                      
ANDTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,61)                                                      
ARDTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,71)                                                      
***********************************************************************         
ASEL13  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(18,01)                                                      
AACT13  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,03)                                                      
ADPTN13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,07)                                                      
APONR13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,11),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,20)                                                      
AVNME13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,25)                                                      
AFCLY13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,36)                                                      
ATBRS13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,41)                                                      
AADTT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,52)                                                      
ANDTT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,61)                                                      
ARDTT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,71)                                                      
***********************************************************************         
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='NUMBER OF SELECTED ITEMS:',                    C        
               LENGTH=25,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(19,40)                                                      
ASELIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=07,                                              C        
               COLOR=BLUE,                                             C        
               POS=(19,67),                                            C        
               PICOUT='ZZZ,ZZ9'                                                 
***********************************************************************         
        DFHMSD TYPE=FINAL                                                       
***********************************************************************         
        END                                                                     
