*                                                                               
  PRINT  NOGEN                                                                  
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  TMKM531                                            *           
*        MAP     TM531A                                             *           
*        PROGRAM TMKCS531                                           *           
*        TRANSID E531 - DC TROUBLE CRITERIA SPEC                    *           
*        SYSTEM  TROUBLE MANAGEMENT                                 *           
*                                                                   *           
*-------------------------------------------------------------------*           
TMKM531 DFHMSD TYPE=MAP,                                               X        
               MODE=INOUT,                                             X        
               LANG=COBOL,                                             X        
               TIOAPFX=YES,                                            X        
               CTRL=(FREEKB)                                                    
TM531A  DFHMDI LINE=2,COLUMN=1,                                        X        
               SIZE=(19,80),                                           X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                           
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENTER OPERATING UNIT AND/OR ONE OF THE FOLLOWINX        
               G:',                                                    X        
               LENGTH=49,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(03,04)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='OPERATING UNIT.......:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(05,06)                                                      
AOPRID  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(05,29)                                                      
AOPDES  DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=25,                                              X        
               COLOR=BLUE,                                             X        
               POS=(05,34)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(05,60)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='DEPARTMENT...........:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,06)                                                      
ADPTNR  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=03,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(06,29)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,33)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='BUYER:',                                       X        
               LENGTH=06,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,35)                                                      
ABYRNR  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=03,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(06,42)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(06,46)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='PO/RECEIVER NUMBER...:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(07,06)                                                      
APONBR  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=08,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(07,29)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='-',                                            X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(07,38)                                                      
ARCVSQ  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(07,40)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(07,45)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SELECT FROM THE FOLLOWING:',                   X        
               LENGTH=26,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(09,04)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='LIST SEQUENCE........:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(10,06)                                                      
ASEQAR  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(10,29)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ARRIVAL DATE',                                 X        
               LENGTH=12,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(10,31)                                                      
ASEQOT  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(10,51)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='OLDEST TO NEWEST TROUBLE',                     X        
               LENGTH=24,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(10,53)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='RESPONSIBILITY AREA..:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(11,06)                                                      
ABYANL  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(11,29)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='BUYER AND ANALYST',                            X        
               LENGTH=17,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(11,31)                                                      
ADCTR   DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(11,51)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='DC      (DEFAULT IS ALL)',                     X        
               LENGTH=25,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(11,53)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(11,79)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='RECEIVER STATUS......:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(12,06)                                                      
ARCARV  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(12,29)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ARRIVED',                                      X        
               LENGTH=07,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(12,31)                                                      
ARCENR  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(12,51)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='ENROUTE (DEFAULT IS BOTH)',                    X        
               LENGTH=25,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(12,53)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='TROUBLE REASON.......:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(13,06)                                                      
ATRESN  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=03,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(13,29)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(13,33)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='(DEFAULT IS ALL EXCEPT 9XX)',                  X        
               LENGTH=27,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(13,51)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='LIMIT SEASONAL SET.....: INCLUDE:',            X        
               LENGTH=33,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(15,04)                                                      
AINCLD  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL=' ',                                            X        
               POS=(15,38)                                                      
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='  EXCLUDE:',                                   X        
               LENGTH=10,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(15,40)                                                      
AEXCLD  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=01,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               INITIAL=' ',                                            X        
               POS=(15,51)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               INITIAL=' ',                                            X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(15,53)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SET YEAR/CODE........:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(16,06)                                                      
ASTYR1  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(16,29)                                                      
ASTCD1  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=05,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(16,34)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(16,40)                                                      
ASTYR2  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(16,44)                                                      
ASTCD2  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=05,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(16,49)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(16,55)                                                      
ASTYR3  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(16,59)                                                      
ASTCD3  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=05,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(16,64)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(16,70)                                                      
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='SET YEAR/CODE........:',                       X        
               LENGTH=22,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(17,06)                                                      
ASTYR4  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(17,29)                                                      
ASTCD4  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=05,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(17,34)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(17,40)                                                      
ASTYR5  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(17,44)                                                      
ASTCD5  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=05,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(17,49)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(17,55)                                                      
ASTYR6  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=04,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(17,59)                                                      
ASTCD6  DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=05,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(17,64)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=01,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(17,70)                                                      
*                                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
