        PRINT  NOGEN                                                            
*-------------------------------------------------------------------*           
*                                                                   *           
*        MAPSET  TMKM601                                            *           
*        MAP     TM601A                                             *           
*        PROGRAM TMKCS601                                           *           
*        TRANSID Y601 - TM-TR NOTIFICATION/TROUBLE LIST             *           
*        SYSTEM  TROUBLE MANAGEMENT                                 *           
*                                                                   *           
*-------------------------------------------------------------------*           
TMKM601 DFHMSD TYPE=DSECT,                                             C        
               LANG=COBOL,                                             C        
               MODE=INOUT,                                             C        
               STORAGE=AUTO,                                           C        
               TERM=3270-2,                                            C        
               TIOAPFX=YES                                                      
***********************************************************************         
TM601A  DFHMDI LINE=2,COLUMN=1,                                        C        
               SIZE=(19,80),                                           C        
               CTRL=(FREEKB),                                          C        
               MAPATTS=(COLOR,HILIGHT),                                C        
               DSATTS=(COLOR,HILIGHT)                                           
***********************************************************************         
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='ITEMS',                                        C        
               LENGTH=05,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(02,44)                                                      
ASTRTIT DFHMDF ATTRB=(NUM,UNPROT,NORM),                                C        
               LENGTH=05,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(02,50),                                            C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='TO',                                           C        
               LENGTH=02,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(02,56)                                                      
AENDIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=05,                                              C        
               COLOR=BLUE,                                             C        
               POS=(02,59),                                            C        
               PICOUT='ZZZZ9'                                                   
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='OF',                                           C        
               LENGTH=02,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(02,65)                                                      
ATOTIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=05,                                              C        
               COLOR=BLUE,                                             C        
               POS=(02,68),                                            C        
               PICOUT='ZZZZ9'                                                   
***********************************************************************         
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='S',                                            C        
               LENGTH=01,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(03,02)                                                      
***********************************************************************         
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='E',                                            C        
               LENGTH=01,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,02)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DPT',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,08)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='RCV',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,21)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='FOB/',                                         C        
               LENGTH=04,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,37)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='TROUBLE',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,42)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='ARRIVAL',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,53)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='NOTFCTN',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,62)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='RESP/RSLV',                                    C        
               LENGTH=09,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(04,71)                                                      
***********************************************************************         
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='L',                                            C        
               LENGTH=01,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,02)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='ACT',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,04)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='NBR',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,08)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='PO NBR',                                       C        
               LENGTH=06,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,12)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='SEQ',                                          C        
               LENGTH=03,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,21)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='VENDR NAME',                                   C        
               LENGTH=10,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,26)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='POE ',                                         C        
               LENGTH=04,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,37)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='REASON',                                       C        
               LENGTH=06,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,42)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DTE/TME',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,53)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DTE/TME',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,62)                                                      
        DFHMDF ATTRB=(PROT,NORM),                                      C        
               INITIAL='DTE/TME',                                      C        
               LENGTH=07,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(05,71)                                                      
***********************************************************************         
ASEL01  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(06,02)                                                      
AACT01  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,04)                                                      
ADPTN01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,08)                                                      
APONR01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               PICOUT='ZZZZZZZZ',                                      C        
               POS=(06,12)                                                      
ARCSQ01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,21)                                                      
AVNME01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,26)                                                      
AFOB01  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,37)                                                      
ATBRS01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,42)                                                      
AADTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,53)                                                      
ANDTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,62)                                                      
ARDTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(06,71)                                                      
***********************************************************************         
ASEL02  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(07,02)                                                      
AACT02  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,04)                                                      
ADPTN02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,08)                                                      
APONR02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,21)                                                      
AVNME02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,26)                                                      
AFOB02  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,37)                                                      
ATBRS02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,42)                                                      
AADTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,53)                                                      
ANDTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,62)                                                      
ARDTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(07,71)                                                      
***********************************************************************         
ASEL03  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(08,02)                                                      
AACT03  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,04)                                                      
ADPTN03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,08)                                                      
APONR03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,21)                                                      
AVNME03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,26)                                                      
AFOB03  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,37)                                                      
ATBRS03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,42)                                                      
AADTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,53)                                                      
ANDTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,62)                                                      
ARDTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(08,71)                                                      
***********************************************************************         
ASEL04  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(09,02)                                                      
AACT04  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,04)                                                      
ADPTN04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,08)                                                      
APONR04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,21)                                                      
AVNME04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,26)                                                      
AFOB04  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,37)                                                      
ATBRS04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,42)                                                      
AADTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,53)                                                      
ANDTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,62)                                                      
ARDTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(09,71)                                                      
***********************************************************************         
ASEL05  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(10,02)                                                      
AACT05  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,04)                                                      
ADPTN05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,08)                                                      
APONR05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,21)                                                      
AVNME05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,26)                                                      
AFOB05  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,37)                                                      
ATBRS05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,42)                                                      
AADTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,53)                                                      
ANDTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,62)                                                      
ARDTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(10,71)                                                      
***********************************************************************         
ASEL06  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(11,02)                                                      
AACT06  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,04)                                                      
ADPTN06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,08)                                                      
APONR06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,21)                                                      
AVNME06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,26)                                                      
AFOB06  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,37)                                                      
ATBRS06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,42)                                                      
AADTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,53)                                                      
ANDTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,62)                                                      
ARDTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(11,71)                                                      
***********************************************************************         
ASEL07  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(12,02)                                                      
AACT07  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,04)                                                      
ADPTN07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,08)                                                      
APONR07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,21)                                                      
AVNME07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,26)                                                      
AFOB07  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,37)                                                      
ATBRS07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,42)                                                      
AADTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,53)                                                      
ANDTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,62)                                                      
ARDTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(12,71)                                                      
***********************************************************************         
ASEL08  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(13,02)                                                      
AACT08  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,04)                                                      
ADPTN08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,08)                                                      
APONR08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,21)                                                      
AVNME08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,26)                                                      
AFOB08  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,37)                                                      
ATBRS08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,42)                                                      
AADTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,53)                                                      
ANDTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,62)                                                      
ARDTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(13,71)                                                      
***********************************************************************         
ASEL09  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(14,02)                                                      
AACT09  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,04)                                                      
ADPTN09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,08)                                                      
APONR09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,21)                                                      
AVNME09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,26)                                                      
AFOB09  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,37)                                                      
ATBRS09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,42)                                                      
AADTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,53)                                                      
ANDTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,62)                                                      
ARDTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(14,71)                                                      
***********************************************************************         
ASEL10  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(15,02)                                                      
AACT10  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,04)                                                      
ADPTN10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,08)                                                      
APONR10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,21)                                                      
AVNME10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,26)                                                      
AFOB10  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,37)                                                      
ATBRS10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,42)                                                      
AADTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,53)                                                      
ANDTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,62)                                                      
ARDTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(15,71)                                                      
***********************************************************************         
ASEL11  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(16,02)                                                      
AACT11  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,04)                                                      
ADPTN11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,08)                                                      
APONR11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,21)                                                      
AVNME11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,26)                                                      
AFOB11  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,37)                                                      
ATBRS11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,42)                                                      
AADTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,53)                                                      
ANDTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,62)                                                      
ARDTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(16,71)                                                      
***********************************************************************         
ASEL12  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(17,02)                                                      
AACT12  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,04)                                                      
ADPTN12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,08)                                                      
APONR12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,21)                                                      
AVNME12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,26)                                                      
AFOB12  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,37)                                                      
ATBRS12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,42)                                                      
AADTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,53)                                                      
ANDTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,62)                                                      
ARDTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(17,71)                                                      
***********************************************************************         
ASEL13  DFHMDF ATTRB=(UNPROT,NORM),                                    C        
               LENGTH=01,                                              C        
               COLOR=GREEN,                                            C        
               HILIGHT=UNDERLINE,                                      C        
               POS=(18,02)                                                      
AACT13  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,04)                                                      
ADPTN13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=03,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,08)                                                      
APONR13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,12),                                            C        
               PICOUT='ZZZZZZZZ'                                                
ARCSQ13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,21)                                                      
AVNME13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,26)                                                      
AFOB13  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=04,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,37)                                                      
ATBRS13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=10,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,42)                                                      
AADTT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,53)                                                      
ANDTT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,62)                                                      
ARDTT13 DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=08,                                              C        
               COLOR=BLUE,                                             C        
               POS=(18,71)                                                      
***********************************************************************         
        DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               INITIAL='NUMBER OF SELECTED ITEMS:',                    C        
               LENGTH=25,                                              C        
               COLOR=NEUTRAL,                                          C        
               POS=(19,40)                                                      
ASELIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C        
               LENGTH=07,                                              C        
               COLOR=BLUE,                                             C        
               POS=(19,67),                                            C        
               PICOUT='ZZZ,ZZ9'                                                 
***********************************************************************         
        DFHMSD TYPE=FINAL                                                       
***********************************************************************         
        END                                                                     
