*          DATA SET TMKM503    AT LEVEL 006 AS OF 05/13/94              00010003
*          DATA SET TMKM503    AT LEVEL 008 AS OF 04/08/94              00020003
        PRINT  NOGEN                                                    00030003
TMKM503 DFHMSD TYPE=DSECT,                                             C00040003
               LANG=COBOL,                                             C00050003
               MODE=INOUT,                                             C00060003
               STORAGE=AUTO,                                           C00070003
               TERM=3270-2,                                            C00080003
               TIOAPFX=YES                                              00090003
*********************************************************************** 00100003
TM503A  DFHMDI LINE=2,COLUMN=1,                                        C00110003
               SIZE=(19,80),                                           C00120003
               CTRL=(FREEKB),                                          C00130003
               MAPATTS=(COLOR,HILIGHT),                                C00140003
               DSATTS=(COLOR,HILIGHT)                                   00150003
*********************************************************************** 00160003
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00170003
               INITIAL='FACILITY...:',                                 C00180003
               LENGTH=12,                                              C00190003
               COLOR=NEUTRAL,                                          C00200003
               POS=(01,02)                                              00210003
AFCLYNM DFHMDF ATTRB=(ASKIP,NORM),                                     C00220003
               LENGTH=25,                                              C00230003
               COLOR=BLUE,                                             C00240003
               POS=(01,15)                                              00250003
*********************************************************************** 00260003
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00270003
               INITIAL='VENDOR NAME:',                                 C00280003
               LENGTH=12,                                              C00290003
               COLOR=NEUTRAL,                                          C00300003
               POS=(02,02)                                              00310003
AVNDNME DFHMDF ATTRB=(ASKIP,NORM),                                     C00320003
               LENGTH=25,                                              C00330003
               COLOR=BLUE,                                             C00340003
               POS=(02,15)                                              00350003
*********************************************************************** 00360003
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00370003
               INITIAL='PO/RCVR NBR:',                                 C00380003
               LENGTH=12,                                              C00390003
               COLOR=NEUTRAL,                                          C00400003
               POS=(03,02)                                              00410003
APORCVR DFHMDF ATTRB=(ASKIP,NORM),                                     C00420003
               LENGTH=13,                                              C00430010
               COLOR=BLUE,                                             C00440003
               POS=(03,15)                                              00450003
*-------------------------------------------------------------------*   00461007
* ADDED DEPT : AT THE HEADER.                      WR # 230ZZ       *   00462007
*-------------------------------------------------------------------*   00463007
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00464007
               INITIAL='DEPT:',                                        C00470011
               LENGTH=05,                                              C00480011
               COLOR=NEUTRAL,                                          C00490003
               POS=(03,29)                                              00500011
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     C00501207
               LENGTH=03,                                              C00502005
               COLOR=BLUE,                                             C00503004
               POS=(03,35)                                              00504004
*-------------------------------------------------------------------*   00505007
* CHANGES MADE FOR WR # 230ZZ ENDS HERE                             *   00506007
*-------------------------------------------------------------------*   00507007
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00561004
               INITIAL='ITEMS',                                        C00562004
               LENGTH=05,                                              C00563004
               COLOR=NEUTRAL,                                          C00564004
               POS=(03,44)                                              00565004
ASTRTIT DFHMDF ATTRB=(NUM,UNPROT,NORM),                                C00566004
               LENGTH=05,                                              C00567004
               COLOR=GREEN,                                            C00568004
               HILIGHT=UNDERLINE,                                      C00569004
               POS=(03,50),                                            C00569104
               PICOUT='ZZZZ9'                                           00569204
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00570003
               INITIAL='TO',                                           C00580003
               LENGTH=02,                                              C00590003
               COLOR=NEUTRAL,                                          C00600003
               POS=(03,56)                                              00610003
AENDIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C00620003
               LENGTH=05,                                              C00630003
               COLOR=BLUE,                                             C00640003
               POS=(03,59),                                            C00650003
               PICOUT='ZZZZ9'                                           00660003
        DFHMDF ATTRB=(ASKIP,NORM),                                     C00670003
               INITIAL='OF',                                           C00680003
               LENGTH=02,                                              C00690003
               COLOR=NEUTRAL,                                          C00700003
               POS=(03,65)                                              00710003
ATOTIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C00720003
               LENGTH=05,                                              C00730003
               COLOR=BLUE,                                             C00740003
               POS=(03,68),                                            C00750003
               PICOUT='ZZZZ9'                                           00760003
*********************************************************************** 00770003
        DFHMDF ATTRB=(PROT,NORM),                                      C00780003
               INITIAL='S',                                            C00790003
               LENGTH=01,                                              C00800003
               COLOR=NEUTRAL,                                          C00810003
               POS=(04,01)                                              00820003
*********************************************************************** 00830003
        DFHMDF ATTRB=(PROT,NORM),                                      C00840003
               INITIAL='E',                                            C00850003
               LENGTH=01,                                              C00860003
               COLOR=NEUTRAL,                                          C00870003
               POS=(05,01)                                              00880003
        DFHMDF ATTRB=(PROT,NORM),                                      C00890003
               INITIAL='PO',                                           C00900003
               LENGTH=02,                                              C00910003
               COLOR=NEUTRAL,                                          C00920003
               POS=(05,07)                                              00930003
        DFHMDF ATTRB=(PROT,NORM),                                      C00940003
               INITIAL='PACK',                                         C00950003
               LENGTH=04,                                              C00960003
               COLOR=NEUTRAL,                                          C00970003
               POS=(05,12)                                              00980003
        DFHMDF ATTRB=(PROT,NORM),                                      C00990003
               INITIAL='A',                                            C01000003
               LENGTH=01,                                              C01010003
               COLOR=NEUTRAL,                                          C01020003
               POS=(05,29)                                              01030003
        DFHMDF ATTRB=(PROT,NORM),                                      C01040003
               INITIAL='TROUBLE',                                      C01050003
               LENGTH=07,                                              C01060003
               COLOR=NEUTRAL,                                          C01070003
               POS=(05,32)                                              01080003
        DFHMDF ATTRB=(PROT,NORM),                                      C01090003
               INITIAL='NOTIFICATION',                                 C01100003
               LENGTH=12,                                              C01110003
               COLOR=NEUTRAL,                                          C01120003
               POS=(05,42)                                              01130003
        DFHMDF ATTRB=(PROT,NORM),                                      C01140003
               INITIAL='RSP/RSL/ACK',                                  C01150003
               LENGTH=11,                                              C01160003
               COLOR=NEUTRAL,                                          C01170003
               POS=(05,55)                                              01180003
        DFHMDF ATTRB=(PROT,NORM),                                      C01190003
               INITIAL='PROC',                                         C01200003
               LENGTH=04,                                              C01210003
               COLOR=NEUTRAL,                                          C01220003
               POS=(05,69)                                              01230003
        DFHMDF ATTRB=(PROT,NORM),                                      C01240003
               INITIAL='PROC',                                         C01250003
               LENGTH=04,                                              C01260003
               COLOR=NEUTRAL,                                          C01270003
               POS=(05,75)                                              01280003
*********************************************************************** 01290003
        DFHMDF ATTRB=(PROT,NORM),                                      C01300003
               INITIAL='L',                                            C01310003
               LENGTH=01,                                              C01320003
               COLOR=NEUTRAL,                                          C01330003
               POS=(06,01)                                              01340003
        DFHMDF ATTRB=(PROT,NORM),                                      C01350003
               INITIAL='ACT',                                          C01360003
               LENGTH=03,                                              C01370003
               COLOR=NEUTRAL,                                          C01380003
               POS=(06,03)                                              01390003
        DFHMDF ATTRB=(PROT,NORM),                                      C01400003
               INITIAL='LINE/ ID',                                     C01410003
               LENGTH=08,                                              C01420003
               COLOR=NEUTRAL,                                          C01430003
               POS=(06,07)                                              01440003
        DFHMDF ATTRB=(PROT,NORM),                                      C01450003
               INITIAL='CL SKU',                                       C01460009
               LENGTH=06,                                              C01470009
               COLOR=NEUTRAL,                                          C01480003
               POS=(06,17)                                              01490009
        DFHMDF ATTRB=(PROT,NORM),                                      C01500003
               INITIAL='D',                                            C01510003
               LENGTH=01,                                              C01520003
               COLOR=NEUTRAL,                                          C01530003
               POS=(06,29)                                              01540003
        DFHMDF ATTRB=(PROT,NORM),                                      C01550003
               INITIAL='REASON',                                       C01560003
               LENGTH=06,                                              C01570003
               COLOR=NEUTRAL,                                          C01580003
               POS=(06,32)                                              01590003
        DFHMDF ATTRB=(PROT,NORM),                                      C01600003
               INITIAL='DATE/TIME',                                    C01610003
               LENGTH=09,                                              C01620003
               COLOR=NEUTRAL,                                          C01630003
               POS=(06,44)                                              01640003
        DFHMDF ATTRB=(PROT,NORM),                                      C01650003
               INITIAL='DATE/TIME',                                    C01660003
               LENGTH=09,                                              C01670003
               COLOR=NEUTRAL,                                          C01680003
               POS=(06,56)                                              01690003
        DFHMDF ATTRB=(PROT,NORM),                                      C01700003
               INITIAL='AREA',                                         C01710003
               LENGTH=04,                                              C01720003
               COLOR=NEUTRAL,                                          C01730003
               POS=(06,69)                                              01740003
        DFHMDF ATTRB=(PROT,NORM),                                      C01750003
               INITIAL='LINE',                                         C01760003
               LENGTH=04,                                              C01770003
               COLOR=NEUTRAL,                                          C01780003
               POS=(06,75)                                              01790003
*********************************************************************** 01800003
ASEL01  DFHMDF ATTRB=(UNPROT,NORM),                                    C01810003
               LENGTH=01,                                              C01820003
               COLOR=GREEN,                                            C01830003
               HILIGHT=UNDERLINE,                                      C01840003
               POS=(07,01)                                              01850003
AACT01  DFHMDF ATTRB=(ASKIP,NORM),                                     C01860003
               LENGTH=03,                                              C01870003
               COLOR=BLUE,                                             C01880003
               POS=(07,03)                                              01890003
APOLN01 DFHMDF ATTRB=(ASKIP,NORM),                                     C01900003
               LENGTH=04,                                              C01910003
               COLOR=BLUE,                                             C01920003
               POS=(07,07)                                              01930003
APACK01 DFHMDF ATTRB=(ASKIP,NORM),                                     C01940003
               LENGTH=04,                                              C01950003
               COLOR=BLUE,                                             C01960003
               POS=(07,12)                                              01970003
ASKU01  DFHMDF ATTRB=(ASKIP,NORM),                                     C01980003
               LENGTH=11,                                              C01990004
               COLOR=BLUE,                                             C02000003
               POS=(07,17)                                              02010003
AADID01 DFHMDF ATTRB=(ASKIP,NORM),                                     C02020003
               LENGTH=01,                                              C02030003
               COLOR=BLUE,                                             C02040003
               POS=(07,29)                                              02050004
ATBRS01 DFHMDF ATTRB=(ASKIP,NORM),                                     C02060003
               LENGTH=10,                                              C02070003
               COLOR=BLUE,                                             C02080003
               POS=(07,31)                                              02090003
ANDTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C02100003
               LENGTH=11,                                              C02110003
               COLOR=BLUE,                                             C02120003
               POS=(07,42)                                              02130003
ARDTT01 DFHMDF ATTRB=(ASKIP,NORM),                                     C02140003
               LENGTH=11,                                              C02150003
               COLOR=BLUE,                                             C02160003
               POS=(07,55)                                              02170003
APRAR01 DFHMDF ATTRB=(ASKIP,NORM),                                     C02180003
               LENGTH=06,                                              C02190003
               COLOR=BLUE,                                             C02200003
               POS=(07,68)                                              02210003
APRLN01 DFHMDF ATTRB=(ASKIP,NORM),                                     C02220003
               LENGTH=04,                                              C02230003
               COLOR=BLUE,                                             C02240003
               POS=(07,75)                                              02250003
*********************************************************************** 02260003
ASEL02  DFHMDF ATTRB=(UNPROT,NORM),                                    C02270003
               LENGTH=01,                                              C02280003
               COLOR=GREEN,                                            C02290003
               HILIGHT=UNDERLINE,                                      C02300003
               POS=(08,01)                                              02310003
AACT02  DFHMDF ATTRB=(ASKIP,NORM),                                     C02320003
               LENGTH=03,                                              C02330003
               COLOR=BLUE,                                             C02340003
               POS=(08,03)                                              02350003
APOLN02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02360003
               LENGTH=04,                                              C02370003
               COLOR=BLUE,                                             C02380003
               POS=(08,07)                                              02390003
APACK02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02400003
               LENGTH=04,                                              C02410003
               COLOR=BLUE,                                             C02420003
               POS=(08,12)                                              02430003
ASKU02  DFHMDF ATTRB=(ASKIP,NORM),                                     C02440003
               LENGTH=11,                                              C02450006
               COLOR=BLUE,                                             C02460003
               POS=(08,17)                                              02470003
AADID02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02480003
               LENGTH=01,                                              C02490003
               COLOR=BLUE,                                             C02500003
               POS=(08,29)                                              02510006
ATBRS02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02520003
               LENGTH=10,                                              C02530003
               COLOR=BLUE,                                             C02540003
               POS=(08,31)                                              02550003
ANDTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02560003
               LENGTH=11,                                              C02570003
               COLOR=BLUE,                                             C02580003
               POS=(08,42)                                              02590003
ARDTT02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02600003
               LENGTH=11,                                              C02610003
               COLOR=BLUE,                                             C02620003
               POS=(08,55)                                              02630003
APRAR02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02640003
               LENGTH=06,                                              C02650003
               COLOR=BLUE,                                             C02660003
               POS=(08,68)                                              02670003
APRLN02 DFHMDF ATTRB=(ASKIP,NORM),                                     C02680003
               LENGTH=04,                                              C02690003
               COLOR=BLUE,                                             C02700003
               POS=(08,75)                                              02710003
*********************************************************************** 02720003
ASEL03  DFHMDF ATTRB=(UNPROT,NORM),                                    C02730003
               LENGTH=01,                                              C02740003
               COLOR=GREEN,                                            C02750003
               HILIGHT=UNDERLINE,                                      C02760003
               POS=(09,01)                                              02770003
AACT03  DFHMDF ATTRB=(ASKIP,NORM),                                     C02780003
               LENGTH=03,                                              C02790003
               COLOR=BLUE,                                             C02800003
               POS=(09,03)                                              02810003
APOLN03 DFHMDF ATTRB=(ASKIP,NORM),                                     C02820003
               LENGTH=04,                                              C02830003
               COLOR=BLUE,                                             C02840003
               POS=(09,07)                                              02850003
APACK03 DFHMDF ATTRB=(ASKIP,NORM),                                     C02860003
               LENGTH=04,                                              C02870003
               COLOR=BLUE,                                             C02880003
               POS=(09,12)                                              02890003
ASKU03  DFHMDF ATTRB=(ASKIP,NORM),                                     C02900003
               LENGTH=11,                                              C02910006
               COLOR=BLUE,                                             C02920003
               POS=(09,17)                                              02930003
AADID03 DFHMDF ATTRB=(ASKIP,NORM),                                     C02940003
               LENGTH=01,                                              C02950003
               COLOR=BLUE,                                             C02960003
               POS=(09,29)                                              02970006
ATBRS03 DFHMDF ATTRB=(ASKIP,NORM),                                     C02980003
               LENGTH=10,                                              C02990003
               COLOR=BLUE,                                             C03000003
               POS=(09,31)                                              03010003
ANDTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C03020003
               LENGTH=11,                                              C03030003
               COLOR=BLUE,                                             C03040003
               POS=(09,42)                                              03050003
ARDTT03 DFHMDF ATTRB=(ASKIP,NORM),                                     C03060003
               LENGTH=11,                                              C03070003
               COLOR=BLUE,                                             C03080003
               POS=(09,55)                                              03090003
APRAR03 DFHMDF ATTRB=(ASKIP,NORM),                                     C03100003
               LENGTH=06,                                              C03110003
               COLOR=BLUE,                                             C03120003
               POS=(09,68)                                              03130003
APRLN03 DFHMDF ATTRB=(ASKIP,NORM),                                     C03140003
               LENGTH=04,                                              C03150003
               COLOR=BLUE,                                             C03160003
               POS=(09,75)                                              03170003
*********************************************************************** 03180003
ASEL04  DFHMDF ATTRB=(UNPROT,NORM),                                    C03190003
               LENGTH=01,                                              C03200003
               COLOR=GREEN,                                            C03210003
               HILIGHT=UNDERLINE,                                      C03220003
               POS=(10,01)                                              03230003
AACT04  DFHMDF ATTRB=(ASKIP,NORM),                                     C03240003
               LENGTH=03,                                              C03250003
               COLOR=BLUE,                                             C03260003
               POS=(10,03)                                              03270003
APOLN04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03280003
               LENGTH=04,                                              C03290003
               COLOR=BLUE,                                             C03300003
               POS=(10,07)                                              03310003
APACK04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03320003
               LENGTH=04,                                              C03330003
               COLOR=BLUE,                                             C03340003
               POS=(10,12)                                              03350003
ASKU04  DFHMDF ATTRB=(ASKIP,NORM),                                     C03360003
               LENGTH=11,                                              C03370006
               COLOR=BLUE,                                             C03380003
               POS=(10,17)                                              03390003
AADID04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03400003
               LENGTH=01,                                              C03410003
               COLOR=BLUE,                                             C03420003
               POS=(10,29)                                              03430006
ATBRS04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03440003
               LENGTH=10,                                              C03450003
               COLOR=BLUE,                                             C03460003
               POS=(10,31)                                              03470003
ANDTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03480003
               LENGTH=11,                                              C03490003
               COLOR=BLUE,                                             C03500003
               POS=(10,42)                                              03510003
ARDTT04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03520003
               LENGTH=11,                                              C03530003
               COLOR=BLUE,                                             C03540003
               POS=(10,55)                                              03550003
APRAR04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03560003
               LENGTH=06,                                              C03570003
               COLOR=BLUE,                                             C03580003
               POS=(10,68)                                              03590003
APRLN04 DFHMDF ATTRB=(ASKIP,NORM),                                     C03600003
               LENGTH=04,                                              C03610003
               COLOR=BLUE,                                             C03620003
               POS=(10,75)                                              03630003
*********************************************************************** 03640003
ASEL05  DFHMDF ATTRB=(UNPROT,NORM),                                    C03650003
               LENGTH=01,                                              C03660003
               COLOR=GREEN,                                            C03670003
               HILIGHT=UNDERLINE,                                      C03680003
               POS=(11,01)                                              03690003
AACT05  DFHMDF ATTRB=(ASKIP,NORM),                                     C03700003
               LENGTH=03,                                              C03710003
               COLOR=BLUE,                                             C03720003
               POS=(11,03)                                              03730003
APOLN05 DFHMDF ATTRB=(ASKIP,NORM),                                     C03740003
               LENGTH=04,                                              C03750003
               COLOR=BLUE,                                             C03760003
               POS=(11,07)                                              03770003
APACK05 DFHMDF ATTRB=(ASKIP,NORM),                                     C03780003
               LENGTH=04,                                              C03790003
               COLOR=BLUE,                                             C03800003
               POS=(11,12)                                              03810003
ASKU05  DFHMDF ATTRB=(ASKIP,NORM),                                     C03820003
               LENGTH=11,                                              C03830006
               COLOR=BLUE,                                             C03840003
               POS=(11,17)                                              03850003
AADID05 DFHMDF ATTRB=(ASKIP,NORM),                                     C03860003
               LENGTH=01,                                              C03870003
               COLOR=BLUE,                                             C03880003
               POS=(11,29)                                              03890006
ATBRS05 DFHMDF ATTRB=(ASKIP,NORM),                                     C03900003
               LENGTH=10,                                              C03910003
               COLOR=BLUE,                                             C03920003
               POS=(11,31)                                              03930003
ANDTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C03940003
               LENGTH=11,                                              C03950003
               COLOR=BLUE,                                             C03960003
               POS=(11,42)                                              03970003
ARDTT05 DFHMDF ATTRB=(ASKIP,NORM),                                     C03980003
               LENGTH=11,                                              C03990003
               COLOR=BLUE,                                             C04000003
               POS=(11,55)                                              04010003
APRAR05 DFHMDF ATTRB=(ASKIP,NORM),                                     C04020003
               LENGTH=06,                                              C04030003
               COLOR=BLUE,                                             C04040003
               POS=(11,68)                                              04050003
APRLN05 DFHMDF ATTRB=(ASKIP,NORM),                                     C04060003
               LENGTH=04,                                              C04070003
               COLOR=BLUE,                                             C04080003
               POS=(11,75)                                              04090003
*********************************************************************** 04100003
ASEL06  DFHMDF ATTRB=(UNPROT,NORM),                                    C04110003
               LENGTH=01,                                              C04120003
               COLOR=GREEN,                                            C04130003
               HILIGHT=UNDERLINE,                                      C04140003
               POS=(12,01)                                              04150003
AACT06  DFHMDF ATTRB=(ASKIP,NORM),                                     C04160003
               LENGTH=03,                                              C04170003
               COLOR=BLUE,                                             C04180003
               POS=(12,03)                                              04190003
APOLN06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04200003
               LENGTH=04,                                              C04210003
               COLOR=BLUE,                                             C04220003
               POS=(12,07)                                              04230003
APACK06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04240003
               LENGTH=04,                                              C04250003
               COLOR=BLUE,                                             C04260003
               POS=(12,12)                                              04270003
ASKU06  DFHMDF ATTRB=(ASKIP,NORM),                                     C04280003
               LENGTH=11,                                              C04290006
               COLOR=BLUE,                                             C04300003
               POS=(12,17)                                              04310003
AADID06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04320003
               LENGTH=01,                                              C04330003
               COLOR=BLUE,                                             C04340003
               POS=(12,29)                                              04350006
ATBRS06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04360003
               LENGTH=10,                                              C04370003
               COLOR=BLUE,                                             C04380003
               POS=(12,31)                                              04390003
ANDTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04400003
               LENGTH=11,                                              C04410003
               COLOR=BLUE,                                             C04420003
               POS=(12,42)                                              04430003
ARDTT06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04440003
               LENGTH=11,                                              C04450003
               COLOR=BLUE,                                             C04460003
               POS=(12,55)                                              04470003
APRAR06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04480003
               LENGTH=06,                                              C04490003
               COLOR=BLUE,                                             C04500003
               POS=(12,68)                                              04510003
APRLN06 DFHMDF ATTRB=(ASKIP,NORM),                                     C04520003
               LENGTH=04,                                              C04530003
               COLOR=BLUE,                                             C04540003
               POS=(12,75)                                              04550003
*********************************************************************** 04560003
ASEL07  DFHMDF ATTRB=(UNPROT,NORM),                                    C04570003
               LENGTH=01,                                              C04580003
               COLOR=GREEN,                                            C04590003
               HILIGHT=UNDERLINE,                                      C04600003
               POS=(13,01)                                              04610003
AACT07  DFHMDF ATTRB=(ASKIP,NORM),                                     C04620003
               LENGTH=03,                                              C04630003
               COLOR=BLUE,                                             C04640003
               POS=(13,03)                                              04650003
APOLN07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04660003
               LENGTH=04,                                              C04670003
               COLOR=BLUE,                                             C04680003
               POS=(13,07)                                              04690003
APACK07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04700003
               LENGTH=04,                                              C04710003
               COLOR=BLUE,                                             C04720003
               POS=(13,12)                                              04730003
ASKU07  DFHMDF ATTRB=(ASKIP,NORM),                                     C04740003
               LENGTH=11,                                              C04750006
               COLOR=BLUE,                                             C04760003
               POS=(13,17)                                              04770003
AADID07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04780003
               LENGTH=01,                                              C04790003
               COLOR=BLUE,                                             C04800003
               POS=(13,29)                                              04810006
ATBRS07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04820003
               LENGTH=10,                                              C04830003
               COLOR=BLUE,                                             C04840003
               POS=(13,31)                                              04850003
ANDTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04860003
               LENGTH=11,                                              C04870003
               COLOR=BLUE,                                             C04880003
               POS=(13,42)                                              04890003
ARDTT07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04900003
               LENGTH=11,                                              C04910003
               COLOR=BLUE,                                             C04920003
               POS=(13,55)                                              04930003
APRAR07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04940003
               LENGTH=06,                                              C04950003
               COLOR=BLUE,                                             C04960003
               POS=(13,68)                                              04970003
APRLN07 DFHMDF ATTRB=(ASKIP,NORM),                                     C04980003
               LENGTH=04,                                              C04990003
               COLOR=BLUE,                                             C05000003
               POS=(13,75)                                              05010003
*********************************************************************** 05020003
ASEL08  DFHMDF ATTRB=(UNPROT,NORM),                                    C05030003
               LENGTH=01,                                              C05040003
               COLOR=GREEN,                                            C05050003
               HILIGHT=UNDERLINE,                                      C05060003
               POS=(14,01)                                              05070003
AACT08  DFHMDF ATTRB=(ASKIP,NORM),                                     C05080003
               LENGTH=03,                                              C05090003
               COLOR=BLUE,                                             C05100003
               POS=(14,03)                                              05110003
APOLN08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05120003
               LENGTH=04,                                              C05130003
               COLOR=BLUE,                                             C05140003
               POS=(14,07)                                              05150003
APACK08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05160003
               LENGTH=04,                                              C05170003
               COLOR=BLUE,                                             C05180003
               POS=(14,12)                                              05190003
ASKU08  DFHMDF ATTRB=(ASKIP,NORM),                                     C05200003
               LENGTH=11,                                              C05210006
               COLOR=BLUE,                                             C05220003
               POS=(14,17)                                              05230003
AADID08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05240003
               LENGTH=01,                                              C05250003
               COLOR=BLUE,                                             C05260003
               POS=(14,29)                                              05270006
ATBRS08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05280003
               LENGTH=10,                                              C05290003
               COLOR=BLUE,                                             C05300003
               POS=(14,31)                                              05310003
ANDTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05320003
               LENGTH=11,                                              C05330003
               COLOR=BLUE,                                             C05340003
               POS=(14,42)                                              05350003
ARDTT08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05360003
               LENGTH=11,                                              C05370003
               COLOR=BLUE,                                             C05380003
               POS=(14,55)                                              05390003
APRAR08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05400003
               LENGTH=06,                                              C05410003
               COLOR=BLUE,                                             C05420003
               POS=(14,68)                                              05430003
APRLN08 DFHMDF ATTRB=(ASKIP,NORM),                                     C05440003
               LENGTH=04,                                              C05450003
               COLOR=BLUE,                                             C05460003
               POS=(14,75)                                              05470003
*********************************************************************** 05480003
ASEL09  DFHMDF ATTRB=(UNPROT,NORM),                                    C05490003
               LENGTH=01,                                              C05500003
               COLOR=GREEN,                                            C05510003
               HILIGHT=UNDERLINE,                                      C05520003
               POS=(15,01)                                              05530003
AACT09  DFHMDF ATTRB=(ASKIP,NORM),                                     C05540003
               LENGTH=03,                                              C05550003
               COLOR=BLUE,                                             C05560003
               POS=(15,03)                                              05570003
APOLN09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05580003
               LENGTH=04,                                              C05590003
               COLOR=BLUE,                                             C05600003
               POS=(15,07)                                              05610003
APACK09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05620003
               LENGTH=04,                                              C05630003
               COLOR=BLUE,                                             C05640003
               POS=(15,12)                                              05650003
ASKU09  DFHMDF ATTRB=(ASKIP,NORM),                                     C05660003
               LENGTH=11,                                              C05670006
               COLOR=BLUE,                                             C05680003
               POS=(15,17)                                              05690003
AADID09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05700003
               LENGTH=01,                                              C05710003
               COLOR=BLUE,                                             C05720003
               POS=(15,29)                                              05730006
ATBRS09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05740003
               LENGTH=10,                                              C05750003
               COLOR=BLUE,                                             C05760003
               POS=(15,31)                                              05770003
ANDTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05780003
               LENGTH=11,                                              C05790003
               COLOR=BLUE,                                             C05800003
               POS=(15,42)                                              05810003
ARDTT09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05820003
               LENGTH=11,                                              C05830003
               COLOR=BLUE,                                             C05840003
               POS=(15,55)                                              05850003
APRAR09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05860003
               LENGTH=06,                                              C05870003
               COLOR=BLUE,                                             C05880003
               POS=(15,68)                                              05890003
APRLN09 DFHMDF ATTRB=(ASKIP,NORM),                                     C05900003
               LENGTH=04,                                              C05910003
               COLOR=BLUE,                                             C05920003
               POS=(15,75)                                              05930003
*********************************************************************** 05940003
ASEL10  DFHMDF ATTRB=(UNPROT,NORM),                                    C05950003
               LENGTH=01,                                              C05960003
               COLOR=GREEN,                                            C05970003
               HILIGHT=UNDERLINE,                                      C05980003
               POS=(16,01)                                              05990003
AACT10  DFHMDF ATTRB=(ASKIP,NORM),                                     C06000003
               LENGTH=03,                                              C06010003
               COLOR=BLUE,                                             C06020003
               POS=(16,03)                                              06030003
APOLN10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06040003
               LENGTH=04,                                              C06050003
               COLOR=BLUE,                                             C06060003
               POS=(16,07)                                              06070003
APACK10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06080003
               LENGTH=04,                                              C06090003
               COLOR=BLUE,                                             C06100003
               POS=(16,12)                                              06110003
ASKU10  DFHMDF ATTRB=(ASKIP,NORM),                                     C06120003
               LENGTH=11,                                              C06130006
               COLOR=BLUE,                                             C06140003
               POS=(16,17)                                              06150003
AADID10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06160003
               LENGTH=01,                                              C06170003
               COLOR=BLUE,                                             C06180003
               POS=(16,29)                                              06190006
ATBRS10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06200003
               LENGTH=10,                                              C06210003
               COLOR=BLUE,                                             C06220003
               POS=(16,31)                                              06230003
ANDTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06240003
               LENGTH=11,                                              C06250003
               COLOR=BLUE,                                             C06260003
               POS=(16,42)                                              06270003
ARDTT10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06280003
               LENGTH=11,                                              C06290003
               COLOR=BLUE,                                             C06300003
               POS=(16,55)                                              06310003
APRAR10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06320003
               LENGTH=06,                                              C06330003
               COLOR=BLUE,                                             C06340003
               POS=(16,68)                                              06350003
APRLN10 DFHMDF ATTRB=(ASKIP,NORM),                                     C06360003
               LENGTH=04,                                              C06370003
               COLOR=BLUE,                                             C06380003
               POS=(16,75)                                              06390003
*********************************************************************** 06400003
ASEL11  DFHMDF ATTRB=(UNPROT,NORM),                                    C06410003
               LENGTH=01,                                              C06420003
               COLOR=GREEN,                                            C06430003
               HILIGHT=UNDERLINE,                                      C06440003
               POS=(17,01)                                              06450003
AACT11  DFHMDF ATTRB=(ASKIP,NORM),                                     C06460003
               LENGTH=03,                                              C06470003
               COLOR=BLUE,                                             C06480003
               POS=(17,03)                                              06490003
APOLN11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06500003
               LENGTH=04,                                              C06510003
               COLOR=BLUE,                                             C06520003
               POS=(17,07)                                              06530003
APACK11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06540003
               LENGTH=04,                                              C06550003
               COLOR=BLUE,                                             C06560003
               POS=(17,12)                                              06570003
ASKU11  DFHMDF ATTRB=(ASKIP,NORM),                                     C06580003
               LENGTH=11,                                              C06590006
               COLOR=BLUE,                                             C06600003
               POS=(17,17)                                              06610003
AADID11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06620003
               LENGTH=01,                                              C06630003
               COLOR=BLUE,                                             C06640003
               POS=(17,29)                                              06650006
ATBRS11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06660003
               LENGTH=10,                                              C06670003
               COLOR=BLUE,                                             C06680003
               POS=(17,31)                                              06690003
ANDTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06700003
               LENGTH=11,                                              C06710003
               COLOR=BLUE,                                             C06720003
               POS=(17,42)                                              06730003
ARDTT11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06740003
               LENGTH=11,                                              C06750003
               COLOR=BLUE,                                             C06760003
               POS=(17,55)                                              06770003
APRAR11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06780003
               LENGTH=06,                                              C06790003
               COLOR=BLUE,                                             C06800003
               POS=(17,68)                                              06810003
APRLN11 DFHMDF ATTRB=(ASKIP,NORM),                                     C06820003
               LENGTH=04,                                              C06830003
               COLOR=BLUE,                                             C06840003
               POS=(17,75)                                              06850003
*********************************************************************** 06860003
ASEL12  DFHMDF ATTRB=(UNPROT,NORM),                                    C06870003
               LENGTH=01,                                              C06880003
               COLOR=GREEN,                                            C06890003
               HILIGHT=UNDERLINE,                                      C06900003
               POS=(18,01)                                              06910003
AACT12  DFHMDF ATTRB=(ASKIP,NORM),                                     C06920003
               LENGTH=03,                                              C06930003
               COLOR=BLUE,                                             C06940003
               POS=(18,03)                                              06950003
APOLN12 DFHMDF ATTRB=(ASKIP,NORM),                                     C06960003
               LENGTH=04,                                              C06970003
               COLOR=BLUE,                                             C06980003
               POS=(18,07)                                              06990003
APACK12 DFHMDF ATTRB=(ASKIP,NORM),                                     C07000003
               LENGTH=04,                                              C07010003
               COLOR=BLUE,                                             C07020003
               POS=(18,12)                                              07030003
ASKU12  DFHMDF ATTRB=(ASKIP,NORM),                                     C07040003
               LENGTH=11,                                              C07050006
               COLOR=BLUE,                                             C07060003
               POS=(18,17)                                              07070003
AADID12 DFHMDF ATTRB=(ASKIP,NORM),                                     C07080003
               LENGTH=01,                                              C07090003
               COLOR=BLUE,                                             C07100003
               POS=(18,29)                                              07110006
ATBRS12 DFHMDF ATTRB=(ASKIP,NORM),                                     C07120003
               LENGTH=10,                                              C07130003
               COLOR=BLUE,                                             C07140003
               POS=(18,31)                                              07150003
ANDTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C07160003
               LENGTH=11,                                              C07170003
               COLOR=BLUE,                                             C07180003
               POS=(18,42)                                              07190003
ARDTT12 DFHMDF ATTRB=(ASKIP,NORM),                                     C07200003
               LENGTH=11,                                              C07210003
               COLOR=BLUE,                                             C07220003
               POS=(18,55)                                              07230003
APRAR12 DFHMDF ATTRB=(ASKIP,NORM),                                     C07240003
               LENGTH=06,                                              C07250003
               COLOR=BLUE,                                             C07260003
               POS=(18,68)                                              07270003
APRLN12 DFHMDF ATTRB=(ASKIP,NORM),                                     C07280003
               LENGTH=04,                                              C07290003
               COLOR=BLUE,                                             C07300003
               POS=(18,75)                                              07310003
*********************************************************************** 07320003
        DFHMDF ATTRB=(ASKIP,NORM),                                     C07330003
               INITIAL='NUMBER OF SELECTED ITEMS:',                    C07340003
               LENGTH=25,                                              C07350003
               COLOR=NEUTRAL,                                          C07360003
               POS=(19,40)                                              07370003
ASELIT  DFHMDF ATTRB=(ASKIP,NORM),                                     C07380003
               LENGTH=07,                                              C07390003
               COLOR=BLUE,                                             C07400003
               POS=(19,67),                                            C07410003
               PICOUT='ZZZ,ZZ9'                                         07420003
*********************************************************************** 07430003
        DFHMSD TYPE=FINAL                                               07440003
*********************************************************************** 07450003
        END                                                             07460003
