*          DATA SET TMKM504    AT LEVEL 001 AS OF 06/10/94                      
*          DATA SET TMKM504    AT LEVEL 006 AS OF 04/17/94              00001   
  PRINT  NOGEN                                                          00002   
*-------------------------------------------------------------------*   00003   
*                                                                   *   00004   
*        MAPSET  TMKM504                                            *   00005   
*        MAP     TM504A                                             *   00006   
*        PROGRAM TMKCS504                                           *   00007   
*        TRANSID E504 - NOTIFICATION/TROUBLE LIST - DETAILS         *   00008   
*        SYSTEM  CICS ARCHITECTURE                                  *   00009   
*                                                                   *   00010   
*-------------------------------------------------------------------*   00011   
TMKM504 DFHMSD TYPE=MAP,                                               X00012   
               MODE=INOUT,                                             X00013   
               LANG=COBOL,                                             X00014   
               TIOAPFX=YES,                                            X00015   
               CTRL=(FREEKB)                                            00016   
TM504A  DFHMDI LINE=2,COLUMN=1,                                        X00017   
               SIZE=(19,80),                                           X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
*                                                                       00021   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00022   
               INITIAL='FACILITY............:',                        X00023   
               LENGTH=21,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(02,02)                                              00026   
AFCLTNM DFHMDF ATTRB=(ASKIP),                                          X00027   
               LENGTH=25,                                              X00028   
               COLOR=BLUE,                                             X00029   
               POS=(02,24)                                              00030   
*                                                                       00031   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00032   
               INITIAL='VENDOR NAME.........:',                        X00033   
               LENGTH=21,                                              X00034   
               COLOR=NEUTRAL,                                          X00035   
               POS=(03,02)                                              00036   
AVENDNM DFHMDF ATTRB=(ASKIP),                                          X00037   
               LENGTH=25,                                              X00038   
               COLOR=BLUE,                                             X00039   
               POS=(03,24)                                              00040   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00032   
               INITIAL='PRO OV/SH/TH:',                                X00033   
               LENGTH=13,                                              X00034   
               COLOR=NEUTRAL,                                          X00035   
               POS=(03,55)                                              00036   
AOVSHTH DFHMDF ATTRB=(ASKIP),                                          X00037   
               LENGTH=05,                                              X00038   
               COLOR=BLUE,                                             X00039   
               POS=(03,69)                                              00040   
*                                                                       00041   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00042   
               INITIAL='PO/RC/LN/PK/SKU:',                             X00043   
               LENGTH=16,                                              X00044   
               COLOR=NEUTRAL,                                          X00045   
               POS=(04,02)                                              00046   
APOREC  DFHMDF ATTRB=(ASKIP),                                          X00047   
               LENGTH=32,                                              X00048   
               COLOR=BLUE,                                             X00049   
               POS=(04,19)                                              00050   
ANEWSTR DFHMDF ATTRB=(ASKIP),                                          X00051   
               LENGTH=09,                                              X00052   
               COLOR=BLUE,                                             X00053   
               POS=(04,53)                                              00054   
*                                                                       00041   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00042   
               INITIAL='SEAS SET:',                                    X00043   
               LENGTH=09,                                              X00044   
               COLOR=NEUTRAL,                                          X00045   
               POS=(04,63)                                              00046   
ASEASON DFHMDF ATTRB=(ASKIP),                                          X00051   
               LENGTH=06,                                              X00052   
               COLOR=BLUE,                                             X00053   
               POS=(04,73)                                              00054   
*                                                                       00041   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00042   
               INITIAL='TROUBLE........:',                             X00043   
               LENGTH=16,                                              X00044   
               COLOR=NEUTRAL,                                          X00045   
               POS=(05,02)                                              00046   
ATROUBL DFHMDF ATTRB=(ASKIP),                                          X00051   
               LENGTH=60,                                              X00052   
               COLOR=BLUE,                                             X00053   
               POS=(05,19)                                              00054   
*                                                                       00041   
        DFHMDF POS=(06,48),LENGTH=05,ATTRB=(ASKIP,DRK),                C00055   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00056   
ASTRTIT DFHMDF POS=(06,54),LENGTH=05,ATTRB=(PROT,DRK),                 C00057   
               COLOR=GREEN,                                            C00058   
               HILIGHT=UNDERLINE,                                      C00059   
               PICOUT='ZZZZ9'                                           00060   
        DFHMDF POS=(06,60),LENGTH=02,ATTRB=(ASKIP,DRK),                C00061   
               COLOR=NEUTRAL,                                          C00062   
               INITIAL='TO'                                             00063   
AENDIT  DFHMDF POS=(06,63),LENGTH=05,ATTRB=(ASKIP,DRK),                C00064   
               COLOR=BLUE,                                             C00065   
               PICOUT='ZZZZ9'                                           00066   
        DFHMDF POS=(06,69),LENGTH=02,ATTRB=(ASKIP,DRK),                C00067   
               COLOR=NEUTRAL,                                          C00068   
               INITIAL='OF'                                             00069   
ATOTIT  DFHMDF POS=(06,72),LENGTH=05,ATTRB=(ASKIP,DRK),                C00070   
               COLOR=BLUE,                                             C00071   
               PICOUT='ZZZZ9'                                           00072   
*                                                                       00073   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00074   
               INITIAL='NOTIF/RESPONSE',                               X00075   
               LENGTH=14,                                              X00076   
               COLOR=NEUTRAL,                                          X00077   
               POS=(07,02)                                              00078   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00079   
               INITIAL='CREATED/',                                     X00080   
               LENGTH=08,                                              X00081   
               COLOR=NEUTRAL,                                          X00082   
               POS=(07,17)                                              00083   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00079   
               INITIAL='TROUBLE RESPONSE',                             X00080   
               LENGTH=16,                                              X00081   
               COLOR=NEUTRAL,                                          X00082   
               POS=(07,30)                                              00083   
*                                                                       00084   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00085   
               INITIAL='DATE AND TIME',                                X00086   
               LENGTH=13,                                              X00087   
               COLOR=NEUTRAL,                                          X00088   
               POS=(08,02)                                              00089   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00095   
               INITIAL='RESOLVED BY',                                  X00096   
               LENGTH=11,                                              X00097   
               COLOR=NEUTRAL,                                          X00098   
               POS=(08,17)                                              00099   
*                                                                       00105   
ADTLN1  DFHMDF ATTRB=ASKIP,                                            X00106   
               LENGTH=77,                                              X00107   
               COLOR=BLUE,                                             X00108   
               POS=(09,02)                                              00109   
*                                                                       00110   
ADTLN2  DFHMDF ATTRB=ASKIP,                                            X00111   
               LENGTH=77,                                              X00112   
               COLOR=BLUE,                                             X00113   
               POS=(10,02)                                              00114   
*                                                                       00115   
ADTLN3  DFHMDF ATTRB=ASKIP,                                            X00116   
               LENGTH=77,                                              X00117   
               COLOR=BLUE,                                             X00118   
               POS=(11,02)                                              00119   
*                                                                       00120   
ADTLN4  DFHMDF ATTRB=ASKIP,                                            X00121   
               LENGTH=77,                                              X00122   
               COLOR=BLUE,                                             X00123   
               POS=(12,02)                                              00124   
*                                                                       00125   
ADTLN5  DFHMDF ATTRB=ASKIP,                                            X00126   
               LENGTH=77,                                              X00127   
               COLOR=BLUE,                                             X00128   
               POS=(13,02)                                              00129   
*                                                                       00130   
ADTLN6  DFHMDF ATTRB=ASKIP,                                            X00131   
               LENGTH=77,                                              X00132   
               COLOR=BLUE,                                             X00133   
               POS=(14,02)                                              00134   
*                                                                       00135   
ADTLN7  DFHMDF ATTRB=ASKIP,                                            X00136   
               LENGTH=77,                                              X00137   
               COLOR=BLUE,                                             X00138   
               POS=(15,02)                                              00139   
*                                                                       00140   
ADTLN8  DFHMDF ATTRB=ASKIP,                                            X00141   
               LENGTH=77,                                              X00142   
               COLOR=BLUE,                                             X00143   
               POS=(16,02)                                              00144   
*                                                                       00145   
ADTLN9  DFHMDF ATTRB=ASKIP,                                            X00146   
               LENGTH=77,                                              X00147   
               COLOR=BLUE,                                             X00148   
               POS=(17,02)                                              00149   
*                                                                       00150   
ADTLN10 DFHMDF ATTRB=ASKIP,                                            X00151   
               LENGTH=77,                                              X00152   
               COLOR=BLUE,                                             X00153   
               POS=(18,02)                                              00154   
*                                                                       00155   
ADTLN11 DFHMDF ATTRB=ASKIP,                                            X00156   
               LENGTH=77,                                              X00157   
               COLOR=BLUE,                                             X00158   
               POS=(19,02)                                              00159   
*                                                                       00160   
         DFHMSD TYPE=FINAL                                              00161   
         END                                                            00162   
