000100******************************************************************00010000
000200*    COPY MEMBER:  TMRD008                       LRECL = 200     *00020005
000300*                                                                *00030000
000400*    THIS MEMBER IS USED AS A FILE LAYOUT FOR A FILE WHICH       *00040000
000500*    CONTAINS FLOWBACK PURCHASE ORDER EXTRACT RECORDS.           *00050001
000800*                                                                *00080000
000900*    THIS FILE LAYOUT WILL BE USED FOR FLOWBACK REPORTS.         *00090001
001000*                                                                *00100000
001100******************************************************************00110000
001200 01  TM008-RECEIVER-EXT-RECORD.                                   00120005
001300     05  TM008-STATUS-CDE                PIC  X(02)  VALUE SPACE. 00130005
001400     05  TM008-PROCESS-AREA              PIC  X(06)  VALUE SPACE. 00140005
001500     05  TM008-PO-NBR                    PIC  9(08)  VALUE ZEROS. 00150005
001600     05  TM008-REC-SEQ-NBR               PIC  9(03)  VALUE ZEROS. 00160005
001700     05  TM008-REC-DATE                  PIC  X(10)  VALUE SPACE. 00170005
001710     05  TM008-PACK-TYPE                 PIC  X(05)  VALUE SPACE. 00171005
001800     05  TM008-CART-CNT                  PIC  9(07)  VALUE ZEROS. 00180005
001900     05  TM008-VNDR-NME                  PIC  X(25)  VALUE SPACE. 00190005
002000     05  TM008-DEPT-NBR                  PIC  X(03)  VALUE SPACE. 00200005
002100     05  TM008-PKSL-ITM-QTY              PIC  9(07)  VALUE ZEROS. 00210005
002200     05  TM008-LOGICAL-OPER              PIC  9(04)  VALUE ZEROS. 00220005
002300     05  TM008-LOGICAL-FCLTY             PIC  9(04)  VALUE ZEROS. 00230005
002400     05  TM008-CURRENT-OPER              PIC  9(04)  VALUE ZEROS. 00240005
002500     05  TM008-CURRENT-FCLTY             PIC  9(04)  VALUE ZEROS. 00250005
002600     05  TM008-NEW-STR-IND               PIC  X(01)  VALUE SPACES.00260005
002700     05  TM008-AD-PICTURE-IND            PIC  X(01)  VALUE SPACES.00270005
002800     05  TM008-UNRESOLVED-TROUBLE        PIC  X(01)  VALUE SPACES.00280005
002900     05  TM008-LATEST-TROUBLE            PIC  X(10)  VALUE SPACES.00290005
003000     05  TM008-MULTI-TROUBLE             PIC  X(01)  VALUE SPACES.00300005
003100     05  TM008-LNE-LOC-CDE               PIC  X(07)  VALUE SPACES.00310005
003200     05  TM008-PRE-RECEIVED-IND          PIC  X(01)  VALUE SPACES.00320005
003300         88  TM008-PRE-RECEIVED                      VALUE 'Y'.   00330005
003400         88  TM008-NOT-PRE-RECEIVED                  VALUE 'N'.   00340005
003500     05  TM008-PACKSLIP-IND              PIC  X(01)  VALUE SPACES.00350005
003600         88  TM008-PACKSLIP-PRESENT                  VALUE 'Y'.   00360005
003700         88  TM008-NO-PACKSLIP-PRESENT               VALUE 'N'.   00370005
003800     05  TM008-RECORD-TYPE-IND           PIC  X(01)  VALUE SPACES.00380005
003900         88  TM008-HEADER-RECORD                     VALUE 'A'.   00390005
004000         88  TM008-DETAIL-RECORD                     VALUE 'B'.   00400005
004100     05  TM008-PO-LINE-NBR               PIC  9(04)  VALUE ZEROS. 00410005
004200     05  TM008-PROCESS-IND               PIC  X(01)  VALUE SPACES.00420005
004300         88  TM008-PACK-BY-STORE                     VALUE 'A'.   00430005
004400         88  TM008-FULLCASE                          VALUE 'B'.   00440005
004500         88  TM008-PACK-TO-LIGHT                     VALUE 'C'.   00450005
004600         88  TM008-FULLCASE-P2L                      VALUE 'D'.   00460005
004700         88  TM008-NA                                VALUE 'N'.   00470005
004710     05  TM008-TRAILER-TOTAL-CDE         PIC  X(01)  VALUE SPACES.00471005
004720         88  TM008-TRAILER-TOTAL-NEEDED              VALUE 'Y'.   00472005
004730         88  TM008-NO-TRAILER-TOTAL                  VALUE 'N'.   00473005
004740     05  TM008-SORT-FIELD                PIC  X(25)  VALUE SPACES.00474005
004750*    SORT FIELD FORMAT 1 DEFINED AS:                              00475000
004760*        PO NUMBER                       PIC  9(08)               00476000
004770*        RECEIVER SEQUENCE NUMBER        PIC  9(03)               00477000
004780*        FILLER                          PIC  X(14)               00478000
004781*                                                                 00478100
004790*    SORT FIELD FORMAT 2 DEFINED AS:                              00479000
004791*        SCAC                            PIC  X(04)               00479100
004792*        TRAILER NUMBER                  PIC  X(10)               00479200
004793*        PO NUMBER                       PIC  9(08)               00479300
004794*        RECEIVER SEQUENCE NUMBER        PIC  9(03)               00479400
004800     05  TM008-SEASET-NM                 PIC  X(05)  VALUE SPACES.00480005
004900     05  TM008-PKGNG-CDE                 PIC  X(01)  VALUE SPACES.00490005
004910     05  TM008-STORE-COUNT-CDE           PIC  X(01)  VALUE 'N'.   00491006
004920         88  TM008-STORE-COUNT-ONE                   VALUE 'Y'.   00492006
004930         88  TM008-STORE-COUNT-NOT-ONE               VALUE 'N'.   00493006
005000     05  FILLER                          PIC  X(46)  VALUE SPACES.00500006
