000100******************************************************************00010000
000200*    COPY MEMBER:  TMRD009                       LRECL = 114     *00020017
000300*                                                                *00030000
000400*    THIS MEMBER IS USED AS A FILE LAYOUT FOR A FILE WHICH       *00040000
000500*    CONTAINS UNRESOLVED NODISTRO TROUBLE RECORDS.              * 00050007
000800*                                                                *00080000
000900*    THIS FILE LAYOUT WILL BE USED TO CREATE A COMMA DELIMITED   *00090007
001000*    FILE WHICH WILL BE SENT (VIA FTP) TO A SERVER.              *00100007
001100******************************************************************00110000
001200 01  TM009-NODIS-TRBL-RECORD.                                     00120007
001300     05  TM009-PO-NBR                    PIC  ZZZZZZZZ9.          00130007
001310     05  TM009-COMMA-01                  PIC  X(01)  VALUE ','.   00131007
001400     05  TM009-NOTIFY-TMST               PIC  X(10).              00140007
001410     05  TM009-COMMA-02                  PIC  X(01)  VALUE ','.   00141007
001500     05  TM009-ARRIVE-TMST               PIC  X(10).              00150007
001501     05  TM009-COMMA-03                  PIC  X(01)  VALUE ','.   00150107
001510     05  TM009-NAME-DESC                 PIC  X(30).              00151007
001520     05  TM009-COMMA-04                  PIC  X(01)  VALUE ','.   00152007
001600     05  TM009-PO-TYP-CDE                PIC  X(03).              00160008
001610     05  TM009-COMMA-05                  PIC  X(01)  VALUE ','.   00161007
001700     05  TM009-DEPT-NBR                  PIC  X(03).              00170017
001703     05  TM009-COMMA-06                  PIC  X(01)  VALUE ','.   00170307
001710     05  TM009-TOT-UNT-QTY               PIC  ZZZZZZZZ9.          00171007
001720     05  TM009-COMMA-07                  PIC  X(01)  VALUE ','.   00172007
001800     05  TM009-TOT-RTL-AMT               PIC  ZZZZZZZZZ9.99.      00180007
001810     05  TM009-COMMA-08                  PIC  X(01)  VALUE ','.   00181007
001900     05  TM009-OTB                       PIC  X(06).              00190007
001910     05  TM009-COMMA-09                  PIC  X(01)  VALUE ','.   00191007
002000     05  TM009-SEASET-SHRT-NM            PIC  X(06).              00200007
002010     05  TM009-COMMA-10                  PIC  X(01)  VALUE ','.   00201007
002100     05  TM009-SEASET-YR                 PIC  X(04).              00210007
005000     05  TM009-COMMA-11                  PIC  X(01)  VALUE ','.   00500012
