000001***************************************************************** 00000100
000002*    RECORD PURPOSE: ERROR REPORT RECORD LAYOUT FOR PROCESSING  * 00000200
000003*                    WORK TABLE (TOUTTM2).                      * 00000300
000005*    RECORD LENGTH:  508                                        * 00000500
000006*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TMRD600   * 00000600
000010***************************************************************** 00001000
000110 01  TM600-RECORD.                                                00011000
000120     05  TM600-RPT-PAR-1-ODR.                                     00012000
000121         10  TM600-RPT-PAR-1-ODR-KEY.                             00012100
000130             15  TM600-ODR-RECORD-TYP      PIC  X(01).            00013000
000140             15  TM600-PO-NBR              PIC  9(09).            00014000
000150             15  TM600-PO-NBR-X REDEFINES                         00015000
000160                 TM600-PO-NBR              PIC  X(09).            00016000
000170             15  TM600-CNTRL-NBR           PIC  9(09).            00017000
000180             15  TM600-CNTRL-NBR-X REDEFINES                      00018000
000190                 TM600-CNTRL-NBR           PIC  X(09).            00019000
000200             15  TM600-TRBL-RSN-CDE        PIC  9(04).            00020000
000210             15  TM600-TRBL-RSN-CDE-X REDEFINES                   00021000
000220                 TM600-TRBL-RSN-CDE        PIC  X(04).            00022000
000300             15  TM600-GROUP-TYP-CDE       PIC  X(02)  VALUE '05'.00030000
000303             15  TM600-GROUP-SEQ-NBR       PIC  9(04).            00030300
000304             15  TM600-GROUP-SEQ-NBR-X REDEFINES                  00030400
000305                 TM600-GROUP-SEQ-NBR       PIC  X(04).            00030500
000306         10  TM600-CURR-PARAGRAPH          PIC  X(32).            00030600
000307         10  TM600-FOB-CDE                 PIC  X(05).            00030703
000308         10  TM600-CURR-RUL-NAME           PIC  X(30).            00030800
000309         10  TM600-TRBL-ERROR-TEXT         PIC  X(50).            00030900
000310         10  FILLER                        PIC  X(108).           00031003
000431     05  TM600-RPT-PAR-2-ODR.                                     00043100
000432         10  FILLER                        PIC  X(254).           00043200
