000100******************************************************************00010001
000200*    COPY MEMBER:  TMRD004                       LRECL = XXX     *00020001
000300*                                                                *00030001
000400*    THIS MEMBER IS USED AS A FILE LAYOUT FOR A FILE WHICH       *00040001
000500*    CONTAINS TROUBLE INFORMATION WHICH WILL BE USED TO CREATE   *00050001
000600*    'AUTO VE TROUBLE TRACKING' REPORTS.                         *00060001
000700*                                                                *00070001
000800*    THIS FILE LAYOUT WILL BE USED FOR BOTH DAILY AND MONTHLY    *00080001
000900*    SUMMARY REPORTING.                                          *00090001
001000*                                                                *00100001
001100******************************************************************00110001
001200 01  TM004-TROUBLE-EXT-RECORD.                                    00120001
001300     05  TM004-DETAIL-LAYOUT.                                     00130001
001400         10  TM004-REC-TYPE-CDE          PIC   X(1).              00140002
001500             88 TM004-REC-TYPE-DTL       VALUE 'A'.               00150001
001600         10  TM004-OPER-UNT-ID           PIC  S9(4) COMP.         00160003
001700         10  TM004-TRBL-RSN-CDE          PIC  S9(4) COMP.         00170003
001800         10  TM004-TRBL-RSN-CDE-DESC     PIC   X(20).             00180003
001900         10  TM004-TRBL-RSN-NOTIF-CDE    PIC   X(1).              00190003
002000             88  TM004-TRBL-RSN-NOTIF           VALUE 'N'.        00200003
002100             88  TM004-TRBL-RSN-TROUBLE         VALUE 'T'.        00210003
002200         10  TM004-TOTAL-RECEIVERS       PIC  S9(7) COMP-3.       00220003
002300         10  FILLER                      PIC   X(20).             00230003
002400     05  TM004-TOTAL-LAYOUT  REDEFINES                            00240001
002500         TM004-DETAIL-LAYOUT.                                     00250001
002600         10  TM004-REC-TYPE-CDE-TOT      PIC   X(1).              00260001
002700             88 TM004-REC-TYPE-TOT       VALUE 'B'.               00270001
002800         10  TM004-TOT-OPER-UNIT-ID      PIC  S9(4) COMP.         00280001
002810         10  TM004-ASSOCIATE-TK          PIC   X(08).             00281006
002900         10  TM004-TOT-TK-IDS            PIC  S9(4) COMP-3.       00290004
003000         10  FILLER                      PIC   X(36).             00300007
