000001*****************************************************************         
000002*    RECORD PURPOSE: RECORD LAYOUT PASSED TO SUBROUTINE THAT    *         
000003*                    INSERTS, UPDATES, AND RESOLVES TROUBLES    *         
000004*                    ON THE TROUBLE TABLES.                     *         
000005*    RECORD LENGTH:  11757                                      *         
000006*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TMRD601   *         
000010*****************************************************************         
000020 01  TM601-TRBL-UPDATE-FORMAT              PIC X(08)   VALUE              
000030                                                      'TMKUP630'.         
000104 01  TM601-RECORD.                                                        
000105     05  TM601-CONTROL-RECORD.                                            
000106         10  TM601-CALLING-PGM-NME         PIC  X(10).                    
000109         10  TM601-TRBL-PROCESS-SW         PIC  X(01).                    
000110         10  TM601-RSLV-PROCESS-SW         PIC  X(01).                    
000111         10  TM601-UPD-PROCESS-SW          PIC  X(01).                    
000112         10  TM601-ACKNOWL-PROCESS-SW      PIC  X(01).                    
000113         10  TM601-DATA-SOURCE             PIC  X(02).                    
000114         10  TM601-CNTRL-NBR               PIC  9(09).                    
000117     05  TM601-TROUBLE-DATA.                                              
000118         10  TM601-PO-NBR                  PIC S9(09)  VALUE +0.          
000119         10  TM601-TRBL-RSN-CDE            PIC S9(04)  VALUE +0.          
000121         10  TM601-TRBL-NOTIF-NBR          PIC S9(09)  VALUE +0.          
000123         10  TM601-OVER-SHRT-PCT           PIC S9(04)  VALUE +0.          
000125         10  TM601-ERLY-LTE-DAY-QTY        PIC S9(04)  VALUE +0.          
000127         10  TM601-PURCHS-VER-NBR          PIC S9(09)  VALUE +0.          
000129         10  TM601-PLNSHP-VER-NBR          PIC S9(09)  VALUE +0.          
000131         10  TM601-PURITM-VER-NBR          PIC S9(09)  VALUE +0.          
000133         10  TM601-PO-LNE-NBR              PIC S9(09)  VALUE +0.          
000134         10  TM601-FOB-CDE                 PIC X(05).                     
000135         10  TM601-POE-CDE                 PIC X(05).                     
000136         10  TM601-BKG-SEQ-NBR             PIC S9(04)  VALUE +0.          
000137         10  TM601-RCVD-SEQ-NBR            PIC S9(04)  VALUE +0.          
000138         10  TM601-CONTNR-ID               PIC X(12).                     
000140         10  TM601-CONTNR-SEQ-NBR          PIC S9(04)  VALUE +0.          
000141         10  TM601-CSTM-ENTR-ID            PIC X(12).                     
000142         10  TM601-INITR-ID                PIC S9(04)  VALUE +0.          
000143         10  TM601-INITR-ENT-ID            PIC S9(09)  VALUE +0.          
000144         10  TM601-RSPNB-RSLU-ID           PIC S9(04)  VALUE +0.          
000145         10  TM601-PFMC-TRKG-ID            PIC S9(04)  VALUE +0.          
000146         10  TM601-ACTVY-RSLU-CDE          PIC  X(02).                    
000147         10  TM601-NOTIF-UID               PIC  X(08).                    
000148         10  TM601-RSLVD-UID               PIC  X(08).                    
000149         10  TM601-ACKNOWL-UID             PIC  X(08).                    
000150         10  TM601-IMPRT-ARRAY-CNT         PIC S9(04)  VALUE +0           
000151                                                       COMP.              
000152         10  TM601-IMPRT-ARRAY             OCCURS 40 TIMES.               
000154             15  TM601-AR-CONTNR-ID        PIC  X(12).                    
000155             15  TM601-AR-IMPRT-TRIP-ID    PIC  X(10).                    
000156             15  TM601-AR-CONTNR-SEQ-NBR   PIC S9(04)  VALUE +0.          
000157             15  TM601-AR-CSTM-ENTR-ID     PIC X(12).                     
000158             15  TM601-AR-BKG-SEQ-NBR      PIC S9(04)  VALUE +0.          
000159             15  TM601-AR-RCVD-SEQ-NBR     PIC S9(04)  VALUE +0.          
000161         10  TM601-TRBL-DETAIL-COUNT       PIC S9(04)  VALUE +0           
000162                                                       COMP.              
000163         10  TM601-TRBL-DETAIL             OCCURS 40 TIMES.               
000166             15  TM601-TRBL-DTL-TXT.                                      
000167                 20 TM601-TRBL-DTL-TXT-LEN PIC S9(04)  VALUE +0.          
000168                 20 TM601-TRBL-DTL-TXT-TXT PIC X(250).                    
000169     05  TM601-TMST-DATA.                                                 
000170         10  TM601-PURCHS-LAST-UPD-TMST    PIC  X(26).                    
000171         10  TM601-PLNSHP-LAST-UPD-TMST    PIC  X(26).                    
000172         10  TM601-IMBKPO-LAST-UPD-TMST    PIC  X(26).                    
000173         10  TM601-IMRCPO-LAST-UPD-TMST    PIC  X(26).                    
000180         10  TM601-IMCNPO-LAST-UPD-TMST    PIC  X(26).                    
000181         10  TM601-IMCSEN-LAST-UPD-TMST    PIC  X(26).                    
000190     05  TM601-RETURN-DATA.                                               
000200         10  TM601-RETURN-CODE             PIC  X(02).                    
000300             88  TM601-CALL-SUCCESSFUL                 VALUE '00'.        
000410             88  TM601-TTRBNTF-RESOLVE-ERROR           VALUE '08'.        
000420             88  TM601-TTRBNTF-ACKNOWLG-ERROR          VALUE '09'.        
000430             88  TM601-TTRBNTF-UPDATE-ERROR            VALUE '10'.        
000500             88  TM601-TTRBNTF-CREATE-ERROR            VALUE '11'.        
000600             88  TM601-TTRDTL-UPDATE-ERROR             VALUE '12'.        
000700             88  TM601-TTRRSN-SELECT-ERROR             VALUE '13'.        
000800             88  TM601-DUPLICATE-TROUBLE               VALUE '14'.        
000900             88  TM601-TIMTBKY-CREATE-ERROR            VALUE '15'.        
001000             88  TM601-RANDOM-GEN-ERROR                VALUE '16'.        
001010             88  TM601-TPURCHS-SELECT-ERROR            VALUE '17'.        
001100             88  TM601-SET-TIMESTAMP-FAILED            VALUE '18'.        
001101             88  TM601-TTRRSN-NOTIF-IND-ERROR          VALUE '19'.        
001110             88  TM601-BK-TIMESTAMP-MISMATCH           VALUE '80'.        
001200             88  TM601-RC-TIMESTAMP-MISMATCH           VALUE '81'.        
001300             88  TM601-CN-TIMESTAMP-MISMATCH           VALUE '82'.        
001400             88  TM601-CS-TIMESTAMP-MISMATCH           VALUE '83'.        
001401             88  TM601-PO-TIMESTAMP-MISMATCH           VALUE '84'.        
001410             88  TM601-BK-TIMESTAMP-NOTFOUND           VALUE '85'.        
001420             88  TM601-RC-TIMESTAMP-NOTFOUND           VALUE '86'.        
001430             88  TM601-CN-TIMESTAMP-NOTFOUND           VALUE '87'.        
001440             88  TM601-PL-TIMESTAMP-NOTFOUND           VALUE '88'.        
001450             88  TM601-PO-TIMESTAMP-NOTFOUND           VALUE '89'.        
001460             88  TM601-CS-TIMESTAMP-NOTFOUND           VALUE '90'.        
001500             88  TM601-DATA-SOURCE-NOTFOUND            VALUE '95'.        
001501             88  TM601-DATA-SOURCE-MISMATCH            VALUE '96'.        
001510             88  TM601-INVALID-DATA-SOURCE             VALUE '97'.        
001600             88  TM601-INVALID-CALLING-PGM             VALUE '98'.        
001700             88  TM601-INVALID-PRCS-SWITCH             VALUE '99'.        
