000100******************************************************************00010003
000101* RECORD PURPOSE: LAYOUT TO MATCH THE DB2 WORK TABLE TOUTTM1.     00010132
000102* --------------- THIS IS USED TO MAKE THE PO EXTRACT INPUT FOR   00010229
000103*                 PROGRAM TMKUT620 -- EXCEPTION REPORTING.        00010334
000104* RECORD LENGTH:  517 BYTES                                       00010429
000105* ---------------                                                 00010529
000106* RECORD FORMAT:  SEQUENTIAL       DATES: CCYYMMDD      TMRD606   00010633
000107* ---------------                  -------                        00010729
000108******************************************************************00010829
000110 01  TM606-RECORD.                                                00011033
000200     05  TM606-PO-NBR                      PIC   9(09).           00020033
000210     05  TM606-PO-NBR-X REDEFINES                                 00021033
000220         TM606-PO-NBR                      PIC   X(09).           00022033
000300     05  TM606-ODR.                                               00030033
000400         10  TM606-EXTR-NOTIF-NBR          PIC   9(09).           00040044
000401         10  TM606-PURCHS-VER-NBR          PIC   9(09).           00040136
000410         10  TM606-PURCHS-VER-NBR-X REDEFINES                     00041033
000420             TM606-PURCHS-VER-NBR          PIC   X(09).           00042033
000500         10  TM606-PLNSHP-VER-NBR          PIC   9(09).           00050033
000510         10  TM606-PLNSHP-VER-NBR-X REDEFINES                     00051033
000520             TM606-PLNSHP-VER-NBR          PIC   X(09).           00052033
000600         10  TM606-CONTNR-ID               PIC   X(12).           00060033
000700         10  TM606-CONTNR-SEQ-NBR          PIC   9(09).           00070033
000710         10  TM606-CONTNR-SEQ-NBR-X REDEFINES                     00071033
000720             TM606-CONTNR-SEQ-NBR          PIC   X(09).           00072033
000800         10  TM606-PO-RCVD-SEQ-NBR         PIC   9(09).           00080033
000900         10  TM606-PO-RCVD-SEQ-NBR-X REDEFINES                    00090033
000910             TM606-PO-RCVD-SEQ-NBR         PIC   X(09).           00091033
001000         10  TM606-PO-BKG-SEQ-NBR          PIC   9(09).           00100033
001010         10  TM606-PO-BKG-SEQ-NBR-X REDEFINES                     00101033
001020             TM606-PO-BKG-SEQ-NBR          PIC   X(09).           00102033
001100         10  TM606-CSTM-ENTR-ID            PIC   X(12).           00110038
001101         10  TM606-MOM-IMPRT-TRIP-ID       PIC   X(10).           00111038
001102         10  TM606-STRT-FCTRY-DTE          PIC   X(10).           00112038
001200         10  TM606-LAST-FCTRY-DTE          PIC   X(10).           00120033
001300         10  TM606-PO-BKG-DELY-DTE         PIC   X(10).           00130033
001310         10  TM606-PO-RCVD-DELY-DTE        PIC   X(10).           00131033
001400         10  TM606-EST-DPRTR-DTE           PIC   X(10).           00140033
001500         10  TM606-MOM-POE-DELY-DTE        PIC   X(10).           00150033
001501         10  TM606-CONTNR-PKUP-DTE         PIC   X(10).           00151041
001502         10  TM606-CUSTOMS-FILE-DTE        PIC   X(10).           00152041
001600         10  TM606-DATA-SOURCE             PIC   X(02).           00160033
001601         10  TM606-EXTR-PRCG-APPL-CDE      PIC   X(02).           00160139
001610         10  FILLER                        PIC   X(82).           00161038
001700     05  TM606-TMST-ODR.                                          00170033
001710         10  TM606-PURCHS-LAST-UPD-TMST    PIC   X(26).           00171033
001720         10  TM606-PLNSHP-LAST-UPD-TMST    PIC   X(26).           00172033
001730         10  TM606-IMBKPO-LAST-UPD-TMST    PIC   X(26).           00173033
001740         10  TM606-IMRCPO-LAST-UPD-TMST    PIC   X(26).           00174033
001750         10  TM606-IMCNPO-LAST-UPD-TMST    PIC   X(26).           00175033
001751         10  TM606-IMCNTK-LAST-UPD-TMST    PIC   X(26).           00175138
001752         10  TM606-IMCSEN-LAST-UPD-TMST    PIC   X(26).           00176035
001800         10  FILLER                        PIC   X(72).           00180038
001900                                                                  00190030
002000******************************************************************00200030
