000100****************************************************************  00010000
000200*                                                              *  00020000
000300*    COMMAREA FOR TROUBLE CENTRAL PROCESSING                   *  00030000
000400*                                                              *  00040000
000500*    LRECL = 600                                               *  00050000
000600*                                                              *  00060000
000700****************************************************************  00070000
000800*                                                                 00080000
000900*                                                                 00090000
001000 01  TM500-FIELDS.                                                00100000
001100     05  TM500-REQUIRED-FIELDS.                                   00110000
001200         10  TM500-PROCESS-IND           PIC X(03) VALUE SPACES.  00120000
001300             88  TM500-CREATE-AUTO                 VALUE 'CRA'.   00130000
001400             88  TM500-CREATE-MANUAL               VALUE 'CRM'.   00140000
001500             88  TM500-IN-PROCESS                  VALUE 'INP'.   00150000
001600             88  TM500-RESPOND                     VALUE 'RSP'.   00160000
001700             88  TM500-RESOLVE-AUTO                VALUE 'RLA'.   00170000
001800             88  TM500-RESOLVE-MANUAL              VALUE 'RLM'.   00180000
001810             88  TM500-RESOLVE-SPECIFIC            VALUE 'RLS'.   00181000
001900             88  TM500-ACKNOWLEDGE                 VALUE 'ACK'.   00190000
002000             88  TM500-UPDATE-NOTIF                VALUE 'UPD'.   00200000
002100             88  TM500-PREPACK-EDIT-ONLY           VALUE 'EDT'.   00210000
002200         10  TM500-LEVEL-IND             PIC X(01) VALUE SPACE.   00220000
002300             88  TM500-PO-LEVEL                    VALUE 'P'.     00230000
002400             88  TM500-LINE-LEVEL                  VALUE 'L'.     00240000
002500             88  TM500-PACK-LEVEL                  VALUE 'M'.     00250000
002600         10  TM500-DETAILS-IND           PIC X(01) VALUE SPACE.   00260000
002700             88  TM500-ADD-DETAILS                 VALUE 'Y'.     00270000
002800             88  TM500-NO-DETAILS                  VALUE 'N'.     00280000
002900         10  TM500-OPER-UNT-ID           PIC S9(4) COMP.          00290000
003000         10  TM500-FCLTY-ID              PIC S9(4) COMP.          00300000
003100         10  TM500-PO-NBR                PIC S9(9) COMP.          00310000
003200         10  TM500-PO-LNE-NBR            PIC S9(9) COMP.          00320000
003300         10  TM500-REC-SEQ-NBR           PIC S9(9) COMP.          00330000
003400*                                                                 00340000
003500     05  TM500-REQUIRED-HDR-FIELDS.                               00350000
003600         10  TM500-VEND-SHIP-DTE         PIC X(10).               00360000
003700*                                                                 00370000
003800     05  TM500-REQUIRED-LNE-FIELDS.                               00380000
003900         10  TM500-UNITS-TO-ALLOC        PIC S9(9) COMP.          00390000
004000         10  TM500-AD-SW                 PIC X(01) VALUE SPACE.   00400000
004100             88  TM500-AD-NO                       VALUE 'N'.     00410000
004200             88  TM500-AD-YES                      VALUE 'Y'.     00420000
004300         10  TM500-RTV-SW                PIC X(01) VALUE SPACE.   00430000
004400             88  TM500-RTV-NO                      VALUE 'N'.     00440000
004500             88  TM500-RTV-YES                     VALUE 'Y'.     00450000
004600         10  TM500-REDISTRO-SW           PIC X(01) VALUE SPACE.   00460000
004700             88  TM500-REDISTRO-NO                 VALUE 'N'.     00470000
004800             88  TM500-REDISTRO-YES                VALUE 'Y'.     00480000
004900*                                                                 00490000
005000     05  TM500-OPTIONAL-FIELDS.                                   00500000
005100         10  TM500-TRBL-RSN-CDE          PIC S9(4) COMP.          00510000
005200         10  TM500-NOTIF-UID             PIC X(8).                00520000
005300         10  TM500-RESOLVED-UID          PIC X(8).                00530000
005400         10  TM500-ACKNOWLG-UID          PIC X(8).                00540000
005500         10  TM500-CRE-UID               PIC X(8).                00550000
005600         10  TM500-FREEFORM-TEXT         PIC X(250).              00560000
005700         10  TM500-FCLTY-AREA-ID         PIC X(6).                00570000
005800         10  TM500-PREPK-ID              PIC S9(4) COMP.          00580000
005900         10  TM500-LINES-IN-TRBL-COUNT   PIC S9(4) COMP.          00590000
006000         10  TM500-PREPK-TRBL-SW         PIC X(01).               00600000
006100             88  TM500-CREATE-DC-BAD-PACK          VALUE 'Y'.     00610000
006200         10  FILLER                      PIC X(08).               00620000
006200         10  TM500-ASN-SENT-TO-WMS       PIC X(1).                00621001
002700             88  TM500-ASN-SENT-TO-WMS-YES         VALUE 'Y'.     00622001
002800             88  TM500-ASN-SENT-TO-WMS-NO          VALUE 'N'.     00623001
006300         10  TM500-DEPT-NBR              PIC X(3).                00630000
006400         10  TM500-PRORATE-IND           PIC X(1).                00640000
006500*                                                                 00650000
006600     05  TM500-WORKING-FIELDS.                                    00660000
006700         10  TM500-NOTIF-NBR             PIC S9(9) COMP.          00670000
006800         10  TM500-RESOLVED-IND          PIC X(1).                00680000
006900         10  TM500-CRUD-IND              PIC X(01) VALUE SPACE.   00690000
007000             88  TM500-CREATE                      VALUE 'C'.     00700000
007100             88  TM500-UPDATE                      VALUE 'U'.     00710000
007200             88  TM500-DELETE                      VALUE 'D'.     00720000
007300*                                                                 00730000
007400     05  TM500-OUTPUT-FIELDS.                                     00740000
007500         10  TM500-OVER-SHORT-PCT        PIC S9(4) COMP.          00750000
007600         10  TM500-TROUBLE-SW            PIC X(01) VALUE SPACE.   00760000
007700             88  TM500-NO-TROUBLE                  VALUE 'N'.     00770000
007800             88  TM500-IN-TROUBLE                  VALUE 'Y'.     00780000
007900*                                                                 00790000
008000         10  TM500-RETURN-DATA.                                   00800000
008100             15  TM500-RETURN-CODE       PIC X(02).               00810000
008200                 88  TM500-CALL-SUCCESSFUL         VALUE '00'.    00820000
008300                 88  TM500-DIDNT-ALLOC-DUE-TO-TRBL VALUE '01'.    00830000
008400                 88  TM500-SHIPPING-WINDOW-ERROR   VALUE '02'.    00840000
008500                 88  TM500-BUYER-ACTION-PENDING    VALUE '03'.    00850000
008600                 88  TM500-TPURCHS-SELECT-NOT-FND  VALUE '1A'.    00860000
008700                 88  TM500-RECORD-IN-PROCESS       VALUE '40'.    00870000
008800                 88  TM500-RECORD-RESOLVED         VALUE '41'.    00880000
008900                 88  TM500-RECORD-ACKNOWLEDGED     VALUE '42'.    00890000
009000                 88  TM500-RECORD-NOT-RESOLVED     VALUE '43'.    00900000
009100                 88  TM500-IN-PROC-UPDATE-NOT-FND  VALUE '44'.    00910000
009200                 88  TM500-RESPOND-UPDATE-NOT-FND  VALUE '45'.    00920000
009300                 88  TM500-ACKNWLG-UPDATE-NOT-FND  VALUE '45'.    00930000
009400                 88  TM500-RESOLVE-UPDATE-NOT-FND  VALUE '47'.    00940000
009500                 88  TM500-DUPLICATE-TROUBLE       VALUE '50'.    00950000
009600                 88  TM500-TTRBNTF-UPDATE-NOT-FND  VALUE '51'.    00960000
009700                 88  TM500-SKU-NOT-FOUND-FOR-LINE  VALUE '60'.    00970000
009800* CODES 61 THRU 69 ARE FOR PREPACK                                00980000
009900                 88  TM500-PREPACK-ERROR    VALUES '61' THRU '69'.00990000
010000                 88  TM500-RECEIVER-NOT-PREPACK    VALUE '61'.    01000000
010100                 88  TM500-DRIVER-LINE-MISSING     VALUE '62'.    01010000
010200                 88  TM500-TROUBLE-PREVENTS-ALLOC  VALUE '63'.    01020000
010300                 88  TM500-PREPACK-DB2-TIMEOUT     VALUE '64'.    01030000
010400                 88  TM500-DB2-UNRECOVERABLE-ERROR VALUE '66'.    01040000
010500                 88  TM500-PREPACK-OTR-ERROR       VALUE '67'.    01050000
010600                 88  TM500-INVALID-PRORATION       VALUE '68'.    01060000
010600                 88  TM500-AUTO-ACKNOW-DONE        VALUE '70'.    01061000
010600                 88  TM500-ACK-REDISTRO-DONE       VALUE '71'.    01062000
010600                 88  TM500-AUTO-ACKNOW-FAILED      VALUE '72'.    01063000
010600                 88  TM500-AUTO-REDISTRO-FAILED    VALUE '73'.    01064000
010600                 88  TM500-DB2-CONTENTION-IN-ALLOC VALUE '74'.    01065000
010600                 88  TM500-AUTO-ACKNOW-ALRDY-DONE  VALUE '75'.    01066000
010600                 88  TM500-AUTO-ACKNOW-NOT-FOUND   VALUE '76'.    01067000
010600                 88  TM500-CASEPACK-SPLIT-FOUND    VALUE '77'.    01068000
010700*                                                                 01070000
010800             15  TM500-RETURN-MSG        PIC X(40).               01080000
010900         10  TM500-SQLCODE               PIC ZZZZZZZZ9-.          01090000
011000         10  TM500-SQLCA                 PIC X(150).              01100000
011100     05  TM500-RTV-ACCESS-SW             PIC X(01).               01110000
011200         88  TM500-MERCHANT-ACCESS                 VALUE 'Y'.     01120000
011300         88  TM500-DC-ACCESS                       VALUE 'N'.     01130000
011400     05  TM500-LIST-VS-MANUAL-SCREEN     PIC X(04).               01140000
011500         88  TM500-FROM-LIST-SCREEN            VALUE 'LIST'.      01150000
011600         88  TM500-FROM-MANUAL-SCREEN          VALUE 'MANL'.      01160000
011700     05  TM500-NEW-STR-PO-IND            PIC X(01).               01170000
011800     05  TM500-IMPORT-PO-IND             PIC X(01).               01180000
011900     05  TM500-AD-ITM-IND                PIC X(01).               01190000
012000     05  TM500-PKGNG-CDE                 PIC X(01).               01200000
012100     05  FILLER                          PIC X(03).               01210000
012200     05  TM500-PREPACK-RETURN-AREA.                               01220000
012300         10  TM500-PREPACK-PGM-NBR       PIC X(3) VALUE SPACES.   01230000
012400         10  TM500-PREPACK-ERROR-NBR     PIC X(3) VALUE SPACES.   01240000
012500     05  FILLER                          PIC X(25).               01250000
