00001 ******************************************************************05/25/94
00002 *                         TMWS001                                *TMWS001 
00003 *                                                                *   LV002
00004 *   THIS IS THE INTER APPLICATION COMMAREA FOR: TMKCS501         *TMWS001 
00005 *                                                                *TMWS001 
00006 *   LENGTH:  200  BYTES                                          *TMWS001 
00007 ******************************************************************TMWS001 
00008          10  TM001-INTER-APPL-COMMAREA  REDEFINES                 TMWS001 
00009                  INTER-APPL-COMM-AREA.                            TMWS001 
00010              15  FILLER                         PIC X(01).        TMWS001 
00011              15  TM001-NUMBER-OF-SELECTED-ITEMS PIC S9(09)        TMWS001 
00012                                                     COMP-3.       TMWS001 
00013              15  TM001-NUMBER-OF-TS-ITEMS       PIC S9(05)        TMWS001 
00014                                                     COMP-3.       TMWS001 
00015              15  TM001-SEL-QUEUE-NAME           PIC X(8).         TMWS001 
00016              15  TM001-OPER-UNT-ID              PIC X(04).        TMWS001 
00017              15  TM001-OPER-UNT-ID-N  REDEFINES                   TMWS001 
00018                  TM001-OPER-UNT-ID              PIC 9(04).        TMWS001 
00019              15  TM001-FCLTY-ID                 PIC X(04).        TMWS001 
00020              15  TM001-FCLTY-ID-N  REDEFINES                      TMWS001 
00021                  TM001-FCLTY-ID                 PIC 9(04).        TMWS001 
00022              15  TM001-FCLTY-NME                PIC X(20).        TMWS001 
00023              15  TM001-FCLTY-SHORT-NME          PIC X(04).        TMWS001 
00024              15  TM001-DEPT                     PIC X(03).        TMWS001 
00025              15  TM001-BUYER                    PIC X(02).        TMWS001 
00026              15  TM001-DMM                      PIC X(02).        TMWS001 
00027              15  TM001-GMM                      PIC X(02).        TMWS001 
00028              15  TM001-SAN-ANM                  PIC X(02).        TMWS001 
00029              15  TM001-VENDOR-NME               PIC X(25).        TMWS001 
00030 *EXPANDED THE PO NUMBER FIELD FROM 7 TO 9                         TMWS001 
00030              15  TM001-PO-NBR                   PIC X(09).        TMWS001 
00031              15  TM001-PO-NBR-N  REDEFINES                        TMWS001 
00032                  TM001-PO-NBR                   PIC 9(09).        TMWS001 
00033              15  TM001-RCVR-SEQ-NBR             PIC X(04).        TMWS001 
00034              15  TM001-RCVR-SEQ-NBR-N  REDEFINES                  TMWS001 
00035                  TM001-RCVR-SEQ-NBR             PIC 9(04).        TMWS001 
00036              15  TM001-PO-LINE-NBR              PIC X(04).        TMWS001 
00037              15  TM001-PO-LINE-NBR-N  REDEFINES                   TMWS001 
00038                  TM001-PO-LINE-NBR              PIC 9(04).        TMWS001 
00039              15  TM001-NOTIF-FROM-DATE-ISO      PIC X(10).        TMWS001 
00040              15  TM001-NOTIF-TO-DATE-ISO        PIC X(10).        TMWS001 
00041              15  TM001-RSLVD-FROM-DATE-ISO      PIC X(10).        TMWS001 
00042              15  TM001-RSLVD-TO-DATE-ISO        PIC X(10).        TMWS001 
00043              15  TM001-TRBL-REASON              PIC X(03).        TMWS001 
00044              15  TM001-NOTIF-TYPE               PIC X(01).        TMWS001 
00045                  88  TM001-ALL-NOTIF-TYPES      VALUE 'A'.        TMWS001 
00046                  88  TM001-NOTIF-TYPE-ONLY      VALUE 'N'.        TMWS001 
00047                  88  TM001-TRBL-TYPE-ONLY       VALUE 'T'.        TMWS001 
00048              15  TM001-NOTIF-STAT               PIC X(01).        TMWS001 
00049                  88  TM001-ALL-NOTIF-STATS      VALUE ' '.           CL**2
00050                  88  TM001-NEW-STAT-ONLY        VALUE 'N'.        TMWS001 
00051                  88  TM001-IN-PRC-STAT-ONLY     VALUE 'I'.        TMWS001 
00052                  88  TM001-UNRSLVD-STAT-ONLY    VALUE 'U'.        TMWS001 
00053                  88  TM001-RSLVD-STAT-ONLY      VALUE 'R'.        TMWS001 
00054                  88  TM001-ACKNW-STAT-ONLY      VALUE 'A'.        TMWS001 
00055              15  TM001-DIRECT-STORE             PIC X(01).        TMWS001 
00030 *REDUCED THE FILLER FIELD FROM 54 TO 52                           TMWS001 
00056              15  FILLER                         PIC X(52).        TMWS001 
