000010******************************************************************00001001
000020*                         TMWS007                                *00002001
000030*                                                                *00003001
000040* SELECTION QUEUE FOR LIST SCREENS FOR THE TROUBLE LIST SCREEN   *00004001
000050*                                                                *00005001
000060******************************************************************00006001
000070                                                                  00007001
000080 01  TM007-SELECT-RECORD.                                         00008001
000090     05  TM007-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00009001
000100                                                COMP-3.           00010001
000200     05  TM007-MAX-ITEMS              PIC 99    VALUE 20.         00020001
000300     05  TM007-SELECTED-ITEM-ARRAY.                               00030001
000400         10  FILLER                   OCCURS 20 TIMES             00040001
000500                                      INDEXED BY TM007-IDX.       00050001
000600             15  TM007-ITEM           PIC S9(9) COMP-3.           00060001
000700             15  TM007-ACTION-SW      PIC X.                      00070001
000800                 88  TM007-INQ                  VALUE 'I'.        00080001
000900                 88  TM007-UPD                  VALUE 'U'.        00090001
001000                 88  TM007-DEL                  VALUE 'D'.        00100001
001100                 88  TM007-ERR                  VALUE 'E'.        00110001
001200             15  TM007-TRBL-CDE       PIC  9(03).                 00120002
001210             15  TM007-LONG-DESC      PIC  X(20).                 00121001
001220             15  TM007-SHORT-DESC     PIC  X(10).                 00122001
001240             15  FILLER               PIC  X(16).                 00124001
001250*                                                                 00125001
