000100 01  TM003-TRB-QUEUE-WORK-AREA.                                   PCKCS123
000200        10  TM003-OPER-UNT-ID           PIC S9(4) COMP.           TMWS500 
000300        10  TM003-FCLTY-ID              PIC S9(4) COMP.           TMWS500 
000400        10  TM003-PO-NBR                PIC S9(9) COMP.           TMWS500 
000500        10  TM003-PO-LNE-NBR            PIC S9(9) COMP.           TMWS500 
000600        10  TM003-REC-SEQ-NBR           PIC S9(9) COMP.           TMWS500 
000700*                                                                 TMWS500 
000800     05  TM003-OPTIONAL-FIELDS.                                   TMWS500 
000900         10  TM003-TRBL-RSN-CDE          PIC S9(4) COMP.          TMWS500 
001000         10  TM003-NOTIF-UID             PIC X(8).                TMWS500 
001100         10  TM003-RESOLVED-UID          PIC X(8).                TMWS500 
001200         10  TM003-ACKNOWLG-UID          PIC X(8).                TMWS500 
001300         10  TM003-CRE-UID               PIC X(8).                TMWS500 
001400         10  TM003-FREEFORM-TEXT         PIC X(250).              TMWS500 
001410         10  TM003-LINE-TEXT   REDEFINES                                  
001420             TM003-FREEFORM-TEXT.                                         
001430             15  TM003-TEXT1             PIC X(50).                       
001440             15  TM003-TEXT2             PIC X(50).                       
001450             15  TM003-TEXT3             PIC X(50).                       
001460             15  TM003-TEXT4             PIC X(50).                       
001470             15  TM003-TEXT5             PIC X(50).                       
001500         10  TM003-FCLTY-AREA-ID         PIC X(6).                TMWS500 
001600         10  TM003-DEPT-NBR              PIC X(3).                TMWS500 
001700         10  TM003-PRORATE-IND           PIC X(1).                TMWS500 
003100         10  TM003-TROUBLE-UPDATE-SW     PIC X(01) VALUE 'N'.     PCWS016 
003200             88  TM003-TROUBLE-UPDATED             VALUE 'Y'.             
003210             88  TM003-TROUBLE-NOT-UPDATED         VALUE 'N'.             
003230*                                                                 TMWS500 
003240     05  TM003-WORKING-FIELDS.                                    TMWS500 
003250         10  TM003-NOTIF-NBR             PIC S9(9) COMP.          TMWS500 
003251         10  TM003-CYC-ADJ-NBR           PIC S9(9) COMP.          TMWS500 
003260         10  TM003-RESOLVED-IND          PIC X(1).                TMWS500 
003270         10  TM003-CRUD-IND              PIC X(01) VALUE SPACE.   TMWS500 
003280             88  TM003-CREATE                      VALUE 'C'.     TMWS500 
003290             88  TM003-UPDATE                      VALUE 'U'.     TMWS500 
003300             88  TM003-DELETE                      VALUE 'D'.     TMWS500 
003301     05  TM003-TRB-UPDATE-INFO.                                         RC
003302         10  TM003-TRB-LNE-TABLE OCCURS 999 TIMES INDEXED               RC
003303                 BY LINE-INDEX.                                         RC
003320             15  TM003-TBL-LNE-NBR           PIC S9(9) COMP.      TMWS500 
003330             15  TM003-TBL-NOTIF-NBR         PIC S9(9) COMP.      TMWS500 
003340             15  TM003-TBL-LNE-UPDATE-SW     PIC X(01) VALUE 'N'.     PCWS
003350                 88  TM003-TBL-LNE-UPDATED             VALUE 'Y'.         
003360                 88  TM003-TBL-LNE-NOT-UPDATED         VALUE 'N'.         
003400*                                                                 TMWS500 
