000100******************************************************************00010000
000200*                         TMWS006                                *00020000
000300*                                                                *00030000
000400*   THIS IS THE INTER APPLICATION COMMAREA FOR: TMKCS600         *00040000
000500*                                                                *00050000
000600*   LENGTH:  200  BYTES                                          *00060000
000700******************************************************************00070000
000800         10  TM006-INTER-APPL-COMMAREA  REDEFINES                 00080000
000900                 INTER-APPL-COMM-AREA.                            00090000
001000             15  FILLER                         PIC X(01).        00100000
001100             15  TM006-NUMBER-OF-SELECTED-ITEMS PIC S9(09)        00110000
001200                                                    COMP-3.       00120000
001300             15  TM006-NUMBER-OF-TS-ITEMS       PIC S9(05)        00130000
001400                                                    COMP-3.       00140000
001500             15  TM006-SEL-QUEUE-NAME           PIC X(8).         00150000
001510             15  TM006-FOB-CDE                  PIC X(04).                
001520             15  TM006-POE-CDE                  PIC X(03).                
001521             15  TM006-OTB                      PIC X(04).                
001522             15  TM006-OTB-N  REDEFINES                                   
001523                 TM006-OTB                      PIC 9(04).                
001530             15  TM006-DEPT                     PIC X(03).        00230000
001531             15  TM006-DEPT-N  REDEFINES                                  
001532                 TM006-DEPT                     PIC 9(03).                
001540             15  TM006-PO-NBR                   PIC X(09).        00260002
001550             15  TM006-PO-NBR-N  REDEFINES                        00270000
001560                 TM006-PO-NBR                   PIC 9(09).        00280002
001570             15  TM006-BUYER                    PIC X(03).        00240000
001571             15  TM006-BUYER-N  REDEFINES                                 
001572                 TM006-BUYER                    PIC 9(03).                
001600             15  TM006-OPER-UNT-ID              PIC X(04).        00160000
001700             15  TM006-OPER-UNT-ID-N  REDEFINES                   00170000
001800                 TM006-OPER-UNT-ID              PIC 9(04).        00180000
001900             15  TM006-FCLTY-ID                 PIC X(04).        00190000
002000             15  TM006-FCLTY-ID-N  REDEFINES                      00200000
002100                 TM006-FCLTY-ID                 PIC 9(04).        00210000
002200             15  TM006-FCLTY-NME                PIC X(20).        00220000
002300             15  TM006-FCLTY-SHORT-NME          PIC X(04).        00221000
002400             15  TM006-ALL-TRBL                 PIC X(04).                
003300             15  TM006-LIST-SEQ-SW              PIC X(01).        00320000
003400                 88  TM006-LS-PO                VALUE 'P'.                
003500                 88  TM006-LS-OLDEST-TRBL       VALUE 'O'.                
003501             15  TM006-RESPONSIBILITY-AREA-SW   PIC X(01).                
003502                 88  TM006-RA-BUY-ANALYST-SW    VALUE 'Y'.                
003503                 88  TM006-RA-BUY-ANALYST-DC-SW VALUE 'A'.                
003504                 88  TM006-RA-DC-SW             VALUE 'D'.                
003505             15  TM006-RESPONSIBILITY-AREA.                               
003506                 20  TM006-RA-BUYER             PIC X(01).                
003510                 20  TM006-RA-ANALYST           PIC X(01).                
003600                 20  TM006-RA-DC                PIC X(01).                
004400             15  TM006-TRBL-REASON              PIC X(03).                
004500             15  TM006-TRBL-RSN-DESC            PIC X(20).                
004600             15  TM006-NOTIF-STATUS             PIC X(01).                
004700                 88  TM006-ALL-NOTIF-STATS      VALUE ' '.                
004800                 88  TM006-RESOLVD-STAT-ONLY    VALUE 'R'.                
004900                 88  TM006-UNRSLVD-STAT-ONLY    VALUE 'U'.                
005000             15  TM006-STAT-NEW                 PIC X(01).        00470000
005100             15  TM006-STAT-IN-PRC              PIC X(01).        00480000
005200             15  TM006-STAT-RSLVD               PIC X(01).        00490000
005300             15  TM006-STAT-ACKNW               PIC X(01).        00500000
005800             15  TM006-LIST-TRBL-HOURS          PIC 9(02).        00541000
005900             15  TM006-LIST-TRBL-DAYS           PIC 9(01).        00542000
006000             15  FILLER                         PIC X(85).        00550000
