000100*-----------------------*                                         05/02/95
000200 IDENTIFICATION DIVISION.                                         DPKCS036
000300*-----------------------*                                            LV002
000400 PROGRAM-ID.    TRKCS183.                                         DPKCS036
000500 AUTHOR.        MARGARET MORRISON.                                DPKCS036
000600 INSTALLATION.  KOHLS DEPARTMENT STORES.                          DPKCS036
000700 DATE-WRITTEN.  06-25-03.                                         DPKCS036
000800 DATE-COMPILED.                                                   DPKCS036
000900                                                                  DPKCS036
001000*---------------------------------------------------------------* DPKCS036
001100*   Y183 - CONTAINER MANIFEST PO PACK DETAIL PROGRAM.           * DPKCS036
001110*                                                               * DPKCS036
001300*   THIS PROGRAM GENERATES A LIST OF PO PACK DETAIL FOR ALL     * DPKCS036
001301*   VENDOR STYLES FOR A PURCHASE ORDER IN A CONTAINER.          * DPKCS036
001800*---------------------------------------------------------------* DPKCS036
001807* CHANGE HISTORY                                                *         
001300*     MADE BY: PRITHIVIRAJ SUBRAMANIAN (COGNIZANT)              *         
001300*     DATE:    10/30/2014                                       *         
001300*                                                               *         
001300*      CHANGES THRU OUT THE PROGRAM TO INCREASE THE SIZE OF PO# *         
001300*      FROM 7 DIGITS TO 8 DIGITS. TAGGED WITH *PS 10/30/2014    *         
003250*---------------------------------------------------------------*         
263697* CHANGED 11/08/2021    BY JIM HUNTER      WR: CHG0263697                 
263697* CHANGE CALL OF DPKUT100 TO CALL DP010I-NUMERIC-EDIT-ROUTINE             
263697* MAKING THE CALL DYNAMIC VS STATIC.                                      
263697*---------------------------------------------------------------*         
CICS  * CHANGED  1/16/2023    BY JIM HUNTER      WR: CHG0278495                 
CICS  * ADD COPYBOOK DPWS930 AND MAKE THE CICS ARCHITECTURE CALL                
CICS  * DYNAMIC INSTEAD OF STATIC BY CALLING DP930-CICS-ARCH-API.               
CICS  *-----------------------------------------------------------------        
001900 EJECT                                                            DPKCS036
002000 ENVIRONMENT DIVISION.                                            DPKCS036
002100                                                                  DPKCS036
002200 DATA DIVISION.                                                   DPKCS036
002300                                                                  DPKCS036
002400 WORKING-STORAGE SECTION.                                         DPKCS036
002500                                                                  DPKCS036
002600 01  DK-DB2-KEYS.                                                 DPKCS036
002700     15  DK-CONTNR-NO                   PIC  X(12)  VALUE SPACE.  DPKCS036
002800     15  DK-CONTNR-SEQ-NO               PIC S9(04)  COMP.         DPKCS036
002900     15  DK-PO-NO                       PIC S9(09)  COMP.         DPKCS036
003000     15  DK-VS-NO                       PIC  X(20)  VALUE SPACE.  DPKCS036
003100     15  DK-UPC-NO                      PIC S9(15)V COMP-3.       DPKCS036
003170     15  DK-PACK-CTNS                   PIC  9(05).                       
003180     15  DK-PACK-UNITS                  PIC  9(09).                       
003190     15  DK-PACK-UPC-NBR                PIC S9(15)V COMP-3.               
003192     15  DK-PACK-SKU                    PIC S9(08).                       
003193     15  DK-PKGING-TYP                  PIC  X(01).                       
003194     15  DK-PO-PREPK-ID                 PIC S9(04)  COMP.                 
003196     15  DK-PK-SKU-NBR                  PIC S9(08)V COMP-3.               
003197     15  DK-PREPK-DESC                  PIC  X(40).                       
003198     15  DK-ASN-PKGING-CDE              PIC  X(02).                       
003200                                                                  DPKCS036
003300 01  PC-PROGRAM-CONSTANTS.                                        DPKCS036
003400     05  PC-CURRENT-MAP-NAME            PIC  X(08)  VALUE         DPKCS036
003500                                                    'TR183A  '.   DPKCS036
003600     05  PC-CURRENT-MAPSET-NAME         PIC  X(08)  VALUE         DPKCS036
003700                                                    'TRKM183 '.   DPKCS036
003800     05  PC-CURRENT-PROGRAM-NAME        PIC  X(08)  VALUE         DPKCS036
003900                                                    'TRKCS183'.   DPKCS036
004000     05  PC-LIST-QUEUE-SEQ              PIC  9(01)  VALUE 1.      DPKCS036
004100     05  PC-SEL-QUEUE-SEQ               PIC  9(01)  VALUE 2.      DPKCS036
004200     05  PC-CONT-LIST-FORMAT            PIC  X(01)  VALUE '2'.    DPKCS036
004300     05  PC-VSL-DTL-FORMAT              PIC  X(01)  VALUE '3'.    DPKCS036
004420     05  PC-ITEMS-PER-PANEL             PIC S9(04)  VALUE +5      DPKCS036
004500                                                    COMP SYNC.    DPKCS036
004600     05  PC-MAX-BLOCKS-IN-ARRAY         PIC S9(04)  VALUE +2      DPKCS036
004700                                                    COMP SYNC.    DPKCS036
004800     05  PC-MAX-ITEMS                   PIC S9(09)  VALUE         DPKCS036
004900                                                    +1000000      DPKCS036
005000                                                    COMP-3.       DPKCS036
005100     05  PC-MSG-NUMBER-LENGTH           PIC S9(04)  VALUE +5      DPKCS036
005200                                                    COMP SYNC.    DPKCS036
005300     05  PC-MAX-RETRIES                 PIC S9(03)  VALUE 3       DPKCS036
005400                                                    COMP-3.       DPKCS036
005500     05  PC-INIT-DATE                   PIC  X(10)  VALUE         DPKCS036
005600                                                    '0001-01-01'. DPKCS036
005700     05  PC-INQ                         PIC  X(03)  VALUE 'INQ'.  DPKCS036
005710     05  PC-A                           PIC  X(01)  VALUE 'A'.            
005711     05  PC-I                           PIC  X(01)  VALUE 'I'.            
005720     05  PC-M                           PIC  X(01)  VALUE 'M'.            
005721     05  PC-O                           PIC  X(01)  VALUE 'O'.            
005730     05  PC-POL                         PIC  X(03)  VALUE 'POL'.          
005740     05  PC-POR                         PIC  X(03)  VALUE 'POR'.          
005800                                                                  DPKCS036
005900     05  PC-TSYMSG-NUMBERS.                                       DPKCS036
006000         10  PC-TSYMSG-00005            PIC  9(05)  VALUE 00005.  DPKCS036
006100         10  PC-TSYMSG-00008            PIC  9(05)  VALUE 00008.  DPKCS036
006200         10  PC-TSYMSG-00047            PIC  9(05)  VALUE 00047.  DPKCS036
006300         10  PC-TSYMSG-00050            PIC  9(05)  VALUE 00050.  DPKCS036
006400         10  PC-TSYMSG-00051            PIC  9(05)  VALUE 00051.  DPKCS036
006500         10  PC-TSYMSG-00052            PIC  9(05)  VALUE 00052.  DPKCS036
006600         10  PC-TSYMSG-00053            PIC  9(05)  VALUE 00053.  DPKCS036
006700         10  PC-TSYMSG-00054            PIC  9(05)  VALUE 00054.  DPKCS036
006800         10  PC-TSYMSG-00055            PIC  9(05)  VALUE 00055.  DPKCS036
006900         10  PC-TSYMSG-00057            PIC  9(05)  VALUE 00057.  DPKCS036
007000         10  PC-TSYMSG-00069            PIC  9(05)  VALUE 00069.  DPKCS036
007100         10  PC-TSYMSG-00070            PIC  9(05)  VALUE 00070.  DPKCS036
007200         10  PC-TSYMSG-00101            PIC  9(05)  VALUE 00101.  DPKCS036
007300         10  PC-TSYMSG-00279            PIC  9(05)  VALUE 00279.  DPKCS036
007320         10  PC-TSYMSG-03093            PIC  9(05)  VALUE 03093.  DPKCS036
007400                                                                  DPKCS036
007500 01  PS-PROGRAM-SWITCHES.                                         DPKCS036
007600     05  PS-ERROR-SW                    PIC  X(01)  VALUE 'Y'.    DPKCS036
007700         88  PS-NO-ERROR                            VALUE 'Y'.    DPKCS036
007800         88  PS-ERROR                               VALUE 'N'.    DPKCS036
007900     05  PS-COMMAREA-SW                 PIC  X(01)  VALUE 'N'.    DPKCS036
008000         88  PS-COMMAREA-VALID                      VALUE 'Y'.    DPKCS036
008100         88  PS-COMMAREA-NOT-VALID                  VALUE 'N'.    DPKCS036
008200                                                                  DPKCS036
008300 01  PV-PROGRAM-VARIABLES.                                        DPKCS036
008400     05  PV-SUB                         PIC S9(04)  VALUE +0      DPKCS036
008500                                                    COMP SYNC.    DPKCS036
008600     05  PV-REMAINDER                   PIC S9(04)  VALUE +0      DPKCS036
008700                                                    COMP SYNC.    DPKCS036
008800     05  PV-READ-COUNT                  PIC S9(09)  VALUE +0      DPKCS036
008900                                                    COMP-3.       DPKCS036
009400     05  PV-ITEMS-PROCESSED             PIC S9(09)  VALUE +0      DPKCS036
009500                                                    COMP-3.       DPKCS036
009600     05  PV-HOLD-SELECTED-ITEMS         PIC S9(09)  VALUE +0      DPKCS036
009700                                                    COMP-3.       DPKCS036
009800     05  PV-ITEM-IN-USE                 PIC S9(09)  VALUE +0      DPKCS036
009900                                                    COMP-3.       DPKCS036
010000     05  PV-TOP-ITEM                    PIC S9(09)  VALUE +0      DPKCS036
010100                                                    COMP-3.       DPKCS036
010200     05  PV-BOTTOM-ITEM                 PIC S9(09)  VALUE +0      DPKCS036
010300                                                    COMP-3.       DPKCS036
010400     05  PV-BLOCK-NUMBER                PIC S9(04)  VALUE +0      DPKCS036
010500                                                    COMP SYNC.    DPKCS036
010600     05  PV-CICS-RESP                   PIC S9(04)  VALUE +0      DPKCS036
010700                                                    COMP SYNC.    DPKCS036
010800     05  PV-ITEM                        PIC S9(04)  VALUE +0      DPKCS036
010900                                                    COMP SYNC.    DPKCS036
011000     05  PV-SEL-QUEUE-ITEM              PIC S9(04)  VALUE +0      DPKCS036
011100                                                    COMP SYNC.    DPKCS036
011200     05  PV-SAVE-ITEM                   PIC S9(04)  VALUE +0      DPKCS036
011300                                                    COMP SYNC.    DPKCS036
011400     05  PV-HIGHEST-BLOCK-WRITTEN       PIC S9(04)  VALUE +0      DPKCS036
011500                                                    COMP SYNC.    DPKCS036
011600     05  PV-LIST-ITEM-NUMBER            PIC S9(04)  VALUE +0      DPKCS036
011700                                                    COMP SYNC.    DPKCS036
011800     05  PV-FIRST-BLOCK-IN-ARRAY        PIC S9(04)  VALUE +0      DPKCS036
011900                                                    COMP SYNC.    DPKCS036
012000     05  PV-NEXT-BLOCK-IN-ARRAY         PIC S9(04)  VALUE +0      DPKCS036
012100                                                    COMP SYNC.    DPKCS036
012200     05  PV-PREV-BLOCK-IN-ARRAY         PIC S9(04)  VALUE +0      DPKCS036
012300                                                    COMP SYNC.    DPKCS036
012400     05  PV-FIRST-BLOCK-IN-RANGE        PIC S9(04)  VALUE +0      DPKCS036
012500                                                    COMP SYNC.    DPKCS036
012600     05  PV-LAST-BLOCK-IN-RANGE         PIC S9(04)  VALUE +0      DPKCS036
012700                                                    COMP SYNC.    DPKCS036
012800     05  PV-START-OF-SELECTED-RANGE     PIC S9(04)  VALUE +0      DPKCS036
012900                                                    COMP SYNC.    DPKCS036
013000     05  PV-END-OF-SELECTED-RANGE       PIC S9(04)  VALUE +0      DPKCS036
013100                                                    COMP SYNC.    DPKCS036
013200     05  PV-SQL-SUB                     PIC S9(04)  VALUE +0      DPKCS036
013300                                                    COMP SYNC.    DPKCS036
013400     05  PV-RETRY-COUNTER               PIC S9(04)  VALUE +0      DPKCS036
013500                                                    COMP SYNC.    DPKCS036
013510     05  PV-HOLD-ORGN-CDE               PIC X(05)   VALUE SPACES.         
013520     05  PV-HOLD-ORGN-TYP-CDE           PIC X(03)   VALUE SPACES.         
013521     05  PV-HOLD-TRIP-TYP-CDE           PIC X(01)   VALUE SPACES.         
013522                                                                          
013540     05  PV-DISPLAY-MOM-ORGN-CDES.                                DPKCS036
013550         10 PV-DISPLAY-MOM-POR-CDE      PIC  X(03).               DPKCS036
013560         10 FILLER                      PIC  X(01) VALUE '/'.     DPKCS036
013570         10 PV-DISPLAY-MOM-POL-CDE      PIC  X(03).               DPKCS036
013580                                                                          
013590     05  PV-DISPLAY-FDR-ORGN-CDES.                                DPKCS036
013591         10 PV-DISPLAY-FDR-POR-CDE      PIC  X(03).               DPKCS036
013592         10 FILLER                      PIC  X(01) VALUE '/'.     DPKCS036
013593         10 PV-DISPLAY-FDR-POL-CDE      PIC  X(03).               DPKCS036
013594                                                                          
013600     05  PV-SHPMT-TYPE.                                           DPKCS036
013700         10 PV-SHPMT-FROM-CDE           PIC  X(03).               DPKCS036
013800         10 FILLER                      PIC  X(01) VALUE '-'.     DPKCS036
013900         10 PV-SHPMT-TO-CDE             PIC  X(03).               DPKCS036
014000                                                                  DPKCS036
014100     05  PV-DATE-BREAK.                                           DPKCS036
014200         10 FILLER                      PIC  X(02).               DPKCS036
014300         10 PV-DB-YY                    PIC  X(02).               DPKCS036
014400         10 FILLER                      PIC  X(01).               DPKCS036
014500         10 PV-DB-MM                    PIC  X(02).               DPKCS036
014600         10 FILLER                      PIC  X(01).               DPKCS036
014700         10 PV-DB-DD                    PIC  X(02).               DPKCS036
014800                                                                  DPKCS036
014900     05 PV-DATE-DISPLAY.                                          DPKCS036
015000         10 PV-DD-MM                    PIC  X(02).               DPKCS036
015100         10 FILLER                      PIC  X(01)  VALUE '/'.    DPKCS036
015200         10 PV-DD-DD                    PIC  X(02).               DPKCS036
015300         10 FILLER                      PIC  X(01)  VALUE '/'.    DPKCS036
015400         10 PV-DD-YY                    PIC  X(02).               DPKCS036
015500                                                                  DPKCS036
015600*----------------------------------------------------------------*DPKCS036
015700*   THIS IS THE LAYOUT FOR THE LIST ITEMS TEMP STORAGE QUEUE.    *DPKCS036
015800*   THIS MUST BE THE EXACT SAME FORMAT A BLOCK IN THE            *DPKCS036
015900*   APPLICATION-SPECIFIC COMMAREA.                               *DPKCS036
016000*----------------------------------------------------------------*DPKCS036
016100 01  LQW-LIST-QUEUE-WORK-AREA.                                    DPKCS036
016200     05  LQW-BLOCK-MODIFIED             PIC  X(01)  VALUE SPACE.  DPKCS036
016300     05  LQW-ITEM-ENTRIES               OCCURS 05 TIMES           DPKCS036
016400                                        INDEXED BY LQW-IDX.       DPKCS036
016500         10  LQW-LIST-ITEM-NUMBER       PIC S9(09)  COMP-3.       DPKCS036
016600         10  LQW-TEMP-SELECTED-SW       PIC  X(01).               DPKCS036
016700         10  LQW-SELECTED-SW            PIC  X(01).               DPKCS036
016800             88  LQW-SELECT                         VALUE 'S'.    DPKCS036
016900             88  LQW-DESELECT                       VALUE ' '.    DPKCS036
017000         10  LQW-ACTION                 PIC  X(03).               DPKCS036
017100*PS 10/30/2014 CHANGE STARTS                                              
017100         10  LQW-PO-NBR                 PIC S9(08).                       
017100*PS 10/30/2014 CHANGE ENDS                                                
017200         10  LQW-VNDR-STYL              PIC  X(20).                       
017300         10  LQW-COLOR                  PIC  X(10).                       
017400         10  LQW-SIZE                   PIC  X(10).                       
017410         10  LQW-SKU                    PIC S9(08).                       
017420         10  LQW-UPC-NBR                PIC S9(15)V COMP-3.               
017500         10  LQW-RATIO                  PIC  9(05).                       
017700                                                                          
017800 EJECT                                                                    
017900*---------------------------------------------------------------* DPKCS036
018000*  RECORD LAYOUT FOR THE PO SELECTION TEMP STORAGE QUEUE.       * DPKCS036
018100*---------------------------------------------------------------* DPKCS036
018200                                                                  DPKCS036
018300     COPY TRWS101.                                                DPKCS036
018400                                                                  DPKCS036
018500 EJECT                                                            DPKCS036
018600*---------------------------------------------------------------* DPKCS036
018700*    MAP LAYOUT                                                 * DPKCS036
018800*---------------------------------------------------------------* DPKCS036
018900                                                                  DPKCS036
019000     COPY TRKM183.                                                DPKCS036
019100                                                                  DPKCS036
019200 01  MR-OCCURS-LAYOUT                   REDEFINES  TR183AO.       DPKCS036
019350*PS 10/30/2014 CHANGE STARTS                                      DPKCS036
019350     05  FILLER                         PIC X(508).               DPKCS036
019350*PS 10/30/2014 CHANGE ENDS                                        DPKCS036
019400     05  MR-SCROLL-AREA                 OCCURS 05 TIMES.          DPKCS036
019500         10  MR-SELECTL                 PIC S9(04) COMP.          DPKCS036
019600         10  MR-SELECTA                 PIC  X(01).               DPKCS036
019700         10  MR-SELECTC                 PIC  X(01).               DPKCS036
019800         10  MR-SELECTH                 PIC  X(01).               DPKCS036
019900         10  MR-SELECTI                 PIC  X(01).               DPKCS036
020000                                                                  DPKCS036
020100         10  MR-ACTIONL                 PIC S9(04) COMP.          DPKCS036
020200         10  MR-ACTIONA                 PIC  X(01).               DPKCS036
020300         10  MR-ACTIONC                 PIC  X(01).               DPKCS036
020400         10  MR-ACTIONH                 PIC  X(01).               DPKCS036
020500         10  MR-ACTION                  PIC  X(03).               DPKCS036
020600                                                                  DPKCS036
020700         10  MR-VNDR-STYLL              PIC S9(04) COMP.          DPKCS036
020800         10  MR-VNDR-STYLA              PIC  X(01).               DPKCS036
020900         10  MR-VNDR-STYLC              PIC  X(01).               DPKCS036
021000         10  MR-VNDR-STYLH              PIC  X(01).               DPKCS036
021100         10  MR-VNDR-STYL               PIC  X(18).               DPKCS036
021200                                                                  DPKCS036
021300         10  MR-COLORL                  PIC S9(04) COMP.          DPKCS036
021400         10  MR-COLORA                  PIC  X(01).               DPKCS036
021500         10  MR-COLORC                  PIC  X(01).               DPKCS036
021600         10  MR-COLORH                  PIC  X(01).               DPKCS036
021700         10  MR-COLOR                   PIC  X(10).               DPKCS036
021800                                                                  DPKCS036
021900         10  MR-SIZEL                   PIC S9(04) COMP.          DPKCS036
022000         10  MR-SIZEA                   PIC  X(01).               DPKCS036
022100         10  MR-SIZEC                   PIC  X(01).               DPKCS036
022200         10  MR-SIZEH                   PIC  X(01).               DPKCS036
022300         10  MR-SIZE                    PIC  X(10).               DPKCS036
022400                                                                  DPKCS036
022500         10  MR-SKUL                    PIC S9(04) COMP.          DPKCS036
022600         10  MR-SKUA                    PIC  X(01).               DPKCS036
022700         10  MR-SKUC                    PIC  X(01).               DPKCS036
022800         10  MR-SKUH                    PIC  X(01).               DPKCS036
022900         10  MR-SKU                     PIC  ZZZZZZZZ.            DPKCS036
023000                                                                  DPKCS036
023100         10  MR-UPCL                    PIC S9(04) COMP.          DPKCS036
023200         10  MR-UPCA                    PIC  X(01).               DPKCS036
023300         10  MR-UPCC                    PIC  X(01).               DPKCS036
023400         10  MR-UPCH                    PIC  X(01).               DPKCS036
023500         10  MR-UPC                     PIC  ZZZZZZZZZZZZZZZ.     DPKCS036
023600                                                                  DPKCS036
023700         10  MR-RATIOL                  PIC S9(04) COMP.          DPKCS036
023800         10  MR-RATIOA                  PIC  X(01).               DPKCS036
023900         10  MR-RATIOC                  PIC  X(01).               DPKCS036
024000         10  MR-RATIOH                  PIC  X(01).               DPKCS036
024100         10  MR-RATIO                   PIC  ZZZZZ.               DPKCS036
024400                                                                  DPKCS036
024520 EJECT                                                            DPKCS036
024600*---------------------------------------------------------------* DPKCS036
024700*    ATTRIBUTE SETTINGS COPYBOOK.                               * DPKCS036
024800*---------------------------------------------------------------* DPKCS036
024900                                                                  DPKCS036
025000     COPY DPWS015.                                                DPKCS036
025100                                                                  DPKCS036
025200 EJECT                                                            DPKCS036
025300*---------------------------------------------------------------* DPKCS036
025400*    FUNCTION KEYS COPYBOOK.                                    * DPKCS036
025500*---------------------------------------------------------------* DPKCS036
025600                                                                  DPKCS036
025700     COPY DPWS016.                                                DPKCS036
025800                                                                  DPKCS036
025900 EJECT                                                            DPKCS036
026000*---------------------------------------------------------------* DPKCS036
026100*    NUMERIC EDIT LAYOUT.                                       * DPKCS036
026200*---------------------------------------------------------------* DPKCS036
026300                                                                  DPKCS036
026400     COPY DPWS010I.                                               DPKCS036
026500                                                                  DPKCS036
026600 EJECT                                                            DPKCS036
026700*---------------------------------------------------------------* DPKCS036
CICS  *    PARAMETERS FOR CALLING THE CICS ARCHITECTURE API.          * DPKCS036
026900*---------------------------------------------------------------* DPKCS036
027000                                                                  DPKCS036
027100     COPY DPWS030.                                                DPKCS036
CICS       COPY DPWS930.                                                DPKCS036
027300 EJECT                                                            DPKCS036
027400*---------------------------------------------------------------* DPKCS036
027500*    STANDARD COMMAREA.                                         * DPKCS036
027600*---------------------------------------------------------------* DPKCS036
027700                                                                  DPKCS036
027800     COPY DPWS020.                                                DPKCS036
027900     05  FILLER REDEFINES DP020-VARIABLE-COMMAREA.                DPKCS036
028000*---------------------------------------------------------------* DPKCS036
028100* INTER-APPLICATION COMMAREA.                                   * DPKCS036
028200*   TRWS102 -IS THE INPUT LAYOUT WHEN COMING FROM THE CONTAINER * DPKCS036
028300*             SUMMARY OR VESSEL DETAIL SCREENS.                 * DPKCS036
028400*   TRWS102 -IS THE OUTPUT LAYOUT WHEN GOING TO THE VESSEL      * DPKCS036
028500*             DETAIL OR SUMMARY SCREENS.                        * DPKCS036
028510*   TRWS116 -IS THE OUTPUT LAYOUT WHEN GOING TO THE CONTAINER   *         
028520*             UPC HISTORY SCREEN.                               *         
028530*   TRWS183 -IS THE INPUT LAYOUT WHEN COMING FROM THE CONTAINER * DPKCS036
028540*             MANIFEST SCREEN.                                  * DPKCS036
028600*---------------------------------------------------------------* DPKCS036
028700         10  INTER-APPL-COMM-AREA       PIC X(200).               DPKCS036
028800     COPY TRWS102.                                                DPKCS036
028910     COPY TRWS116.                                                DPKCS036
028920     COPY TRWS183.                                                DPKCS036
029000                                                                  DPKCS036
029100 EJECT                                                            DPKCS036
029200*---------------------------------------------------------------* DPKCS036
029300*  THIS IS THE APPLICATION-SPECIFIC COMMAREA.                   * DPKCS036
029400*---------------------------------------------------------------* DPKCS036
029500         10  ASC-SPECIFIC-COMMAREA.                               DPKCS036
029600             15  ASC-LIST-KEYS.                                   DPKCS036
029700                 20  ASC-KEY-CONTNR-NO               PIC  X(12).  DPKCS036
029800                 20  ASC-KEY-CONTNR-SEQ-NO           PIC S9(04)   DPKCS036
029900                                                          COMP.   DPKCS036
030000                 20  ASC-KEY-PO-NO                   PIC S9(09)   DPKCS036
030100                                                          COMP.   DPKCS036
030200                 20  ASC-KEY-VS-NO                   PIC  X(20).  DPKCS036
030300                 20  ASC-KEY-UPC-NO                  PIC S9(15)V  DPKCS036
030400                                                          COMP-3. DPKCS036
030500                 20  ASC-KEY-VSL-NAME                PIC  X(25).  DPKCS036
030600                 20  ASC-KEY-VOY-NBR                 PIC  X(10).  DPKCS036
030610                 20  ASC-KEY-PACK-CTNS               PIC  9(05).          
030620                 20  ASC-KEY-PACK-UNITS              PIC  9(09).          
030630                 20  ASC-KEY-PACK-UPC-NBR            PIC S9(15)V          
030640                                                          COMP-3.         
030650                 20  ASC-KEY-PACK-SKU                PIC S9(08).          
030660                 20  ASC-KEY-PKGING-TYP              PIC X(01).           
030661                 20  ASC-KEY-PO-PREPK-ID             PIC S9(04)           
030662                                                          COMP.           
030663                 20  ASC-KEY-PK-SKU-NBR              PIC S9(08)V          
030664                                                          COMP-3.         
030665                 20  ASC-KEY-PREPK-DESC              PIC X(40).           
030666                 20  ASC-KEY-ASN-PKGING-CDE          PIC X(02).           
030700             15  ASC-BLOCK-ENTRIES OCCURS 2 TIMES.                DPKCS036
030800                 20  ASC-BLOCK-MODIFIED-SW           PIC  X(01).  DPKCS036
030900                     88  ASC-BLOCK-NOT-MODIFIED      VALUE 'N'.   DPKCS036
031000                     88  ASC-BLOCK-MODIFIED          VALUE 'Y'.   DPKCS036
031100                                                                  DPKCS036
031200                 20  ASC-ITEM-ARRAY.                              DPKCS036
031300                     25  ASC-ITEM-ENTRIES OCCURS 05 TIMES.        DPKCS036
031400                         30  ASC-LIST-ITEM-NUMBER                 DPKCS036
031500                                                     PIC S9(09)   DPKCS036
031600                                                     COMP-3.      DPKCS036
031700                         30  ASC-TEMP-SELECTED-SW    PIC  X(01).  DPKCS036
031800                             88  ASC-VALID-SELECT    VALUE ' '    DPKCS036
031900                                                           'S'    DPKCS036
032000                                                           'B'    DPKCS036
032100                                                           'E'.   DPKCS036
032200                             88  ASC-TEMP-NO-SELECT  VALUE ' '.   DPKCS036
032300                             88  ASC-TEMP-SELECT     VALUE 'S'.   DPKCS036
032400                             88  ASC-TEMP-BEGIN      VALUE 'B'.   DPKCS036
032500                             88  ASC-TEMP-END        VALUE 'E'.   DPKCS036
032600                         30  ASC-SELECTED-SW         PIC  X(01).  DPKCS036
032700                             88  ASC-NO-SELECT       VALUE ' '.   DPKCS036
032800                             88  ASC-SELECT          VALUE 'S'.   DPKCS036
032900                             88  ASC-BEGIN           VALUE 'B'.   DPKCS036
033000                             88  ASC-END             VALUE 'E'.   DPKCS036
033100                         30  ASC-ACTION            PIC  X(03).    DPKCS036
033200*PS 10/30/2014 CHANGE STARTS                                      DPKCS036
033200                         30  ASC-PO-NBR            PIC S9(08).    DPKCS036
033200*PS 10/30/2014 CHANGE STARTS                                      DPKCS036
033300                         30  ASC-VNDR-STYL         PIC  X(20).    DPKCS036
033400                         30  ASC-COLOR             PIC  X(10).    DPKCS036
033500                         30  ASC-SIZE              PIC  X(10).    DPKCS036
033510                         30  ASC-SKU               PIC S9(08).            
033720                         30  ASC-UPC-NBR           PIC S9(15)V            
033721                                                        COMP-3.           
033722                         30  ASC-RATIO             PIC S9(05).            
033800                                                                  DPKCS036
033900             15  ASC-BLK-SUB                         PIC S9(04)   DPKCS036
034000                                                          COMP    DPKCS036
034100                                                          SYNC.   DPKCS036
034200             15  ASC-ITEM-SUB                        PIC S9(04)   DPKCS036
034300                                                          COMP    DPKCS036
034400                                                          SYNC.   DPKCS036
034500             15  ASC-NUMBER-OF-ITEMS-READ            PIC S9(09)   DPKCS036
034600                                                          COMP-3. DPKCS036
034700             15  ASC-NUMBER-OF-SELECTED-ITEMS        PIC S9(09)   DPKCS036
034800                                                          COMP-3. DPKCS036
034900             15  ASC-ITEMS-DISPLAYED                 PIC S9(03)   DPKCS036
035000                                                          COMP-3. DPKCS036
035100             15  ASC-ITEM-AT-TOP-OF-PANEL            PIC S9(09)   DPKCS036
035200                                                          COMP-3. DPKCS036
035300             15  ASC-ITEM-AT-BOT-OF-PANEL            PIC S9(09)   DPKCS036
035400                                                          COMP-3. DPKCS036
035500             15  ASC-HIGHEST-BLOCK-WRITTEN           PIC S9(04)   DPKCS036
035600                                                          COMP    DPKCS036
035700                                                          SYNC.   DPKCS036
035800             15  ASC-START-OF-SELECTED-RANGE         PIC S9(09)   DPKCS036
035900                                                          COMP-3. DPKCS036
036000             15  ASC-END-OF-SELECTED-RANGE           PIC S9(09)   DPKCS036
036100                                                          COMP-3. DPKCS036
036200             15  ASC-ITEMS-LEFT-INDICATOR            PIC  X(01).  DPKCS036
036300                 88  ASC-ITEMS-LEFT-ON-DB            VALUE 'Y'.   DPKCS036
036400                 88  ASC-NO-ITEMS-LEFT-ON-DB         VALUE 'N'.   DPKCS036
037100            15  ASC-TEMP-QUEUE-UPDATE-SW            PIC  X(01).   DPKCS036
037200                88  ASC-UPDATE-TSQ                  VALUE 'Y'.    DPKCS036
037300                88  ASC-NO-TSQ-UPDATE               VALUE ' '.    DPKCS036
037400             15  ASC-LIST-QUEUE-NAME.                             DPKCS036
037500                 20  ASC-LIST-TERM-ID                PIC  X(04).  DPKCS036
037600                 20  ASC-LIST-TASK-NUMBER            PIC S9(05)   DPKCS036
037700                                                          COMP-3. DPKCS036
037800                 20  ASC-LIST-SEQ                    PIC  9(01).  DPKCS036
037900             15  ASC-SEL-QUEUE-NAME.                              DPKCS036
038000                 20  ASC-SEL-TERM-ID                 PIC  X(04).  DPKCS036
038100                 20  ASC-SEL-TASK-NUMBER             PIC S9(05)   DPKCS036
038200                                                          COMP-3. DPKCS036
038300                 20  ASC-SEL-SEQ                     PIC  9(01).  DPKCS036
038400                                                                  DPKCS036
039300             15  ASC-START-ITEM-REQUEST.                          DPKCS036
039400                 20  ASC-START-ITEM-REQUEST-N        PIC  9(05).  DPKCS036
039500                                                                  DPKCS036
039600             15  ASC-MANIFEST-GOTO-SW                PIC  X(01).  DPKCS036
039700                 88  ASC-GOTO-SUMMARY                VALUE 'S'.   DPKCS036
039800                 88  ASC-GOTO-DETAIL                 VALUE 'D'.   DPKCS036
039810                 88  ASC-GOTO-HISTORY                VALUE 'H'.   DPKCS036
040000                                                                          
040100 EJECT                                                            DPKCS036
040200*---------------------------------------------------------------* DPKCS036
040300*    ABEND PROCESSING COPYBOOK.                                 * DPKCS036
040400*---------------------------------------------------------------* DPKCS036
040500                                                                  DPKCS036
040600     COPY DPWS013.                                                DPKCS036
040700                                                                  DPKCS036
040800 EJECT                                                            DPKCS036
040900*---------------------------------------------------------------* DPKCS036
041000*    DB2 AREA FOR TIMCNTK                                       * DPKCS036
041100*---------------------------------------------------------------* DPKCS036
041200     EXEC SQL                                                     DPKCS036
041300          INCLUDE TIMCNTK                                         DPKCS036
041400     END-EXEC.                                                    DPKCS036
041500*---------------------------------------------------------------* DPKCS036
041600*    DB2 AREA FOR TIMCNPO                                       * DPKCS036
041700*---------------------------------------------------------------* DPKCS036
041800     EXEC SQL                                                     DPKCS036
041900          INCLUDE TIMCNPO                                         DPKCS036
042000     END-EXEC.                                                    DPKCS036
042700*---------------------------------------------------------------* DPKCS036
042800*    DB2 AREA FOR TPURITM                                       * DPKCS036
042900*---------------------------------------------------------------* DPKCS036
043000     EXEC SQL                                                     DPKCS036
043100          INCLUDE TPURITM                                         DPKCS036
043200     END-EXEC.                                                    DPKCS036
043210*---------------------------------------------------------------* DPKCS036
043220*    DB2 AREA FOR TPOPRPK                                       * DPKCS036
043230*---------------------------------------------------------------* DPKCS036
043240     EXEC SQL                                                     DPKCS036
043250          INCLUDE TPOPRPK                                         DPKCS036
043260     END-EXEC.                                                    DPKCS036
043300*---------------------------------------------------------------* DPKCS036
043400*    DB2 AREA FOR TUPCSKU                                       * DPKCS036
043500*---------------------------------------------------------------* DPKCS036
043600     EXEC SQL                                                     DPKCS036
043700          INCLUDE TUPCSKU                                         DPKCS036
043800     END-EXEC.                                                    DPKCS036
043810*---------------------------------------------------------------* DPKCS036
043820*    DB2 AREA FOR TUPC                                          * DPKCS036
043830*---------------------------------------------------------------* DPKCS036
043840     EXEC SQL                                                     DPKCS036
043850          INCLUDE TUPC                                            DPKCS036
043860     END-EXEC.                                                    DPKCS036
043900*---------------------------------------------------------------* DPKCS036
044000*    DB2 AREA FOR TIMCNUP                                       * DPKCS036
044100*---------------------------------------------------------------* DPKCS036
044200     EXEC SQL                                                     DPKCS036
044300          INCLUDE TIMCNUP                                         DPKCS036
044400     END-EXEC.                                                    DPKCS036
044500*---------------------------------------------------------------* DPKCS036
044600*    DB2 AREA FOR TIMFOB                                        * DPKCS036
044700*---------------------------------------------------------------* DPKCS036
044800     EXEC SQL                                                     DPKCS036
044900          INCLUDE TIMFOB                                          DPKCS036
045000     END-EXEC.                                                    DPKCS036
045100*---------------------------------------------------------------* DPKCS036
045200*    DB2 AREA FOR TIMPOE                                        * DPKCS036
045300*---------------------------------------------------------------* DPKCS036
045400     EXEC SQL                                                     DPKCS036
045500          INCLUDE TIMPOE                                          DPKCS036
045600     END-EXEC.                                                    DPKCS036
045610*---------------------------------------------------------------*         
045620*    DB2 AREA FOR XLT_SKU                                       *         
045630*---------------------------------------------------------------*         
045640     EXEC SQL                                                             
045650          INCLUDE XLT00003                                                
045660     END-EXEC.                                                            
045670*---------------------------------------------------------------*         
045680*    DB2 AREA FOR XLT_VND_STYL                                  *         
045690*---------------------------------------------------------------*         
045691     EXEC SQL                                                             
045692          INCLUDE XLT00004                                                
045693     END-EXEC.                                                            
045694*---------------------------------------------------------------*         
045695*    DB2 AREA FOR XLT_UPC                                       *         
045696*---------------------------------------------------------------*         
045697     EXEC SQL                                                             
045698          INCLUDE XLT00006                                                
045699     END-EXEC.                                                            
045700*---------------------------------------------------------------*         
045701*    DB2 AREA FOR TSKXREF                                       *         
045702*---------------------------------------------------------------*         
045703     EXEC SQL                                                             
045704          INCLUDE TSKXREF                                                 
045705     END-EXEC.                                                            
045706*---------------------------------------------------------------*         
045707*    DB2 AREA FOR TRT_IMPRT_ORGN                                *         
045708*---------------------------------------------------------------*         
045709     EXEC SQL                                                             
045710          INCLUDE TRT00010                                                
045711     END-EXEC.                                                            
045720*---------------------------------------------------------------* DPKCS036
045800*    DB2 AREA FOR COMMUNICATIONS                                * DPKCS036
045900*---------------------------------------------------------------* DPKCS036
046000     EXEC SQL                                                     DPKCS036
046100          INCLUDE SQLCA                                           DPKCS036
046200     END-EXEC.                                                    DPKCS036
048100*---------------------------------------------------------------* DPKCS036
048200*    CURSOR FOR VENDOR STYLES FOR LISTED PO'S IN THE CONTAINER  * DPKCS036
048300*---------------------------------------------------------------* DPKCS036
048400                                                                  DPKCS036
048421     EXEC SQL                                                     DPKCS036
048422          DECLARE VS-CSR CURSOR                                   DPKCS036
048430          FOR     SELECT DISTINCT                                 DPKCS036
048440                  A.PREPK_RATO_QTY                                        
048450              ,   C.CSTM_CLOR_DESC                                DPKCS036
048460              ,   C.SIZE_DESC                                     DPKCS036
048461              ,   C.SKU_NBR                                               
048462              ,   D.VS_NBR                                                
048463              ,   E.UPC_NBR                                               
048470          FROM    TPURITM A                                       DPKCS036
048490              ,   XLT_SKU C                                               
048491              ,   XLT_VND_STYL D                                          
048492              ,   XLT_UPC E                                               
048493          WHERE   A.PO_NBR         = :DK-PO-NO                            
048497            AND   A.PO_PREPK_ID    = :DK-PO-PREPK-ID                      
048498            AND   A.VER_STATUS_CDE = 'A'                          DPKCS036
048499            AND   A.ITM_NBR        = C.ITM_NBR                            
048500            AND   C.STYL_ID        = D.STYL_ID                            
048501            AND   E.UPC_NBR   >= 000400000000000                          
048502            AND   E.UPC_NBR   <= 000499999999999                          
048503            AND   C.INTR_UPC_ID = E.INTR_UPC_ID                           
048504            AND   E.UPC_TYP_CDE = 'I'                                     
048505          ORDER BY                                                DPKCS036
048506                D.VS_NBR                                          DPKCS036
048507              , E.UPC_NBR                                                 
048508     END-EXEC.                                                    DPKCS036
048520                                                                          
049900 EJECT                                                            DPKCS036
054102*---------------------------------------------------------------*         
054103*    CURSOR DECLARATION FOR SELECTING POE CODE.                 *         
054104*---------------------------------------------------------------*         
054105                                                                          
054106     EXEC SQL                                                             
054107          DECLARE  POE-CSR CURSOR                                         
054108              FOR  SELECT DISTINCT                                        
054109                   POE_CDE                                                
054110             FROM  TIMPOE                                                 
054111            WHERE  POE_STD_EDI_CDE = :IMCNTK-MOM-DEST-POE-CDE             
054112              AND  STAT_CDE        = 'A'                                  
054113         ORDER BY  POE_CDE                                                
054114     END-EXEC.                                                            
054115                                                                          
054120 EJECT                                                                    
054200*                                                                 DPKCS036
054300 LINKAGE SECTION.                                                 DPKCS036
054400                                                                  DPKCS036
054500 01  DFHCOMMAREA.                                                 DPKCS036
054600     05  FILLER                         OCCURS  1 TO 4072 TIMES   DPKCS036
054700                                        DEPENDING ON EIBCALEN.    DPKCS036
054800         10  FILLER                     PIC X.                    DPKCS036
054900                                                                  DPKCS036
055000 EJECT                                                            DPKCS036
055100*----------------------------------------------------------------*DPKCS036
055200 PROCEDURE DIVISION.                                              DPKCS036
055300*----------------------------------------------------------------*DPKCS036
055400*   THIS MODULE IS THE HIGHEST PROCESSING LEVEL IN THE PROGRAM.  *DPKCS036
055500*   FIRST, CALL THE CICS ARCHITECTURE API, PERFORM THE PROGRAM   *DPKCS036
055600*   PROCESSING AND THEN CALL THE CICS ARCHITECTURE API TO EXIT.  *DPKCS036
055700*----------------------------------------------------------------*DPKCS036
055800 0000-MAIN-MODULE.                                                DPKCS036
055900                                                                  DPKCS036
056000     INITIALIZE DP030-CICS-API-FIELDS.                            DPKCS036
056100     MOVE +1                       TO DP030-NUMBER-OF-MAPS.       DPKCS036
056200     MOVE PC-CURRENT-MAPSET-NAME   TO DP030-MAPSET-NAME.          DPKCS036
056300     MOVE PC-CURRENT-MAP-NAME      TO DP030-MAP-NAME (1).         DPKCS036
056400     SET DP030-RECEIVE-APPL-MAP    TO TRUE.                       DPKCS036
056500     MOVE LENGTH OF TR183AI        TO DP030-MAP-LENGTH (1).       DPKCS036
056600     MOVE 'PROGRAM ENTRY CALL'     TO DP013-MESSAGE-TEXT (1).     DPKCS036
056700     PERFORM 0001-CALL-CICS-ARCH-API.                             DPKCS036
056800*                                                                 DPKCS036
056900     PERFORM 1000-CONTROL-PROCESSING                              DPKCS036
057000*                                                                 DPKCS036
057100     MOVE 'PROGRAM EXIT CALL'      TO DP013-MESSAGE-TEXT (1).     DPKCS036
057200     PERFORM 0001-CALL-CICS-ARCH-API.                             DPKCS036
057300                                                                  DPKCS036
057400*----------------------------------------------------------------*DPKCS036
057500*   THIS PARAGRAPH CALLS THE CICS ARCHITECTURE API SUBROUTINE    *DPKCS036
057600*   AND WILL ABEND IF ANY ERRORS OCCURRED IN THAT CALL.          *DPKCS036
057700*----------------------------------------------------------------*DPKCS036
057800 0001-CALL-CICS-ARCH-API.                                         DPKCS036
057900                                                                  DPKCS036
CICS       CALL DP930-CICS-ARCH-API USING DFHEIBLK                      DPKCS036
058100                                    DFHCOMMAREA                           
058200                                    DP030-CICS-API-FIELDS                 
058300                                    DP020-STANDARD-COMMAREA               
058400                                    TR183AI.                              
058500*                                                                 DPKCS036
058600     IF  DP030-RC-CALL-SUCCESSFUL                                 DPKCS036
058700         CONTINUE                                                 DPKCS036
058800     ELSE                                                         DPKCS036
058900         SET DP013-NO-ROLLBACK                                    DPKCS036
059000             DP013-XCTL-DISPLAY-RESTART                           DPKCS036
059100             DP013-CICS-ABEND      TO TRUE                        DPKCS036
059200         MOVE '0001-CALL-CICS-ARCH-API'                           DPKCS036
059300                                   TO DP013-PARAGRAPH             DPKCS036
CICS           MOVE 'CALL TO CICS ARCH API NOT SUCCESSFUL, RETURN-CODE ODPKCS036
CICS  -             'N NEXT LINE'        TO DP013-MESSAGE-TEXT (2)      DPKCS036
059600         MOVE DP030-RETURN-CODE    TO DP013-MESSAGE-TEXT (3)      DPKCS036
059700         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
059800     END-IF.                                                      DPKCS036
059900                                                                  DPKCS036
060000 EJECT                                                            DPKCS036
060100*----------------------------------------------------------------*DPKCS036
060200* PROCESS THE APPROPRIATE PARAGRAPHS BASED ON WHAT THE NEXT      *DPKCS036
060300* COURSE OF ACTION IS FOR THIS TRANSACTION.                      *DPKCS036
060400*                                                                *DPKCS036
060500* NOTE:  PV-TOP-ITEM IS THE ITEM THAT IS REQUESTED TO BE AT THE  *DPKCS036
060600*  TOP OF THE PANEL.  MOVING ASC-ITEM-AT-TOP-OF-PANEL TO THIS    *DPKCS036
060700*  MEANS THAT POSITION WITHIN THE LIST WILL NOT CHANGE -- THIS   *DPKCS036
060800*  IS THE DEFAULT WHICH WILL BE OVERRIDDEN BY SCROLLING ACTIONS. *DPKCS036
060900*----------------------------------------------------------------*DPKCS036
061000 1000-CONTROL-PROCESSING.                                         DPKCS036
061100                                                                  DPKCS036
061200     EVALUATE TRUE                                                DPKCS036
061300         WHEN DP020-NEXT-ACT-INITIAL                              DPKCS036
061400             INITIALIZE ASC-SPECIFIC-COMMAREA                     DPKCS036
061500             MOVE EIBTRMID         TO ASC-LIST-TERM-ID            DPKCS036
061600                                      ASC-SEL-TERM-ID             DPKCS036
061700             MOVE DP020-SRC-TASK-NUMBER                           DPKCS036
061800                                   TO ASC-LIST-TASK-NUMBER        DPKCS036
061900                                      ASC-SEL-TASK-NUMBER         DPKCS036
062000             MOVE PC-LIST-QUEUE-SEQ                               DPKCS036
062100                                   TO ASC-LIST-SEQ                DPKCS036
062200             MOVE PC-SEL-QUEUE-SEQ TO ASC-SEL-SEQ                 DPKCS036
062300             PERFORM 1100-PROCESS-INTER-APPL-COMM                 DPKCS036
062400***-----$TEMPLATE NOTE$-------------------------------------------DPKCS036
062500*** IF THE DATA EXPECTED IS NOT RECEIVED FROM CALLING APPLICATION,DPKCS036
062600*** SETUP APPROPRIATE MESSAGE AND SEVERITY AND SET APPL-ERROR TO  DPKCS036
062700*** TRUE, THIS WILL RETURN TO CALLING APPLICATION WHEN API CALLED.DPKCS036
062800***---------------------------------------------------------------DPKCS036
062900             IF  PS-COMMAREA-NOT-VALID                            DPKCS036
063000                 SET DP020-NEXT-ACT-APPL-ERROR                    DPKCS036
063100                                   TO TRUE                        DPKCS036
063200             ELSE                                                 DPKCS036
063300                 PERFORM 4000-BUILD-INITIAL-PANEL                 DPKCS036
063400             END-IF                                               DPKCS036
063500                                                                  DPKCS036
063600         WHEN DP020-NEXT-ACT-READ-MAP                             DPKCS036
063700             MOVE ASC-ITEM-AT-TOP-OF-PANEL                        DPKCS036
063800                                   TO PV-TOP-ITEM                 DPKCS036
063900             PERFORM 2000-PROCESS-PANEL                           DPKCS036
064000                                                                  DPKCS036
064100         WHEN DP020-NEXT-ACT-RETURN                               DPKCS036
064200             MOVE ASC-ITEM-AT-TOP-OF-PANEL                        DPKCS036
064300                                   TO PV-TOP-ITEM                 DPKCS036
064400             MOVE ZERO             TO ASC-ITEM-AT-TOP-OF-PANEL    DPKCS036
064500             PERFORM 6000-REFRESH-PANEL-FROM-TEMP                 DPKCS036
064600             MOVE ASC-KEY-CONTNR-NO                               DPKCS036
064700                                   TO DK-CONTNR-NO                DPKCS036
064800             MOVE ASC-KEY-CONTNR-SEQ-NO                           DPKCS036
064900                                   TO DK-CONTNR-SEQ-NO            DPKCS036
065000             MOVE ASC-KEY-PO-NO                                   DPKCS036
065100                                   TO DK-PO-NO                    DPKCS036
065110             MOVE ASC-KEY-PACK-CTNS     TO DK-PACK-CTNS                   
065120             MOVE ASC-KEY-PACK-UNITS    TO DK-PACK-UNITS                  
065130             MOVE ASC-KEY-PACK-UPC-NBR  TO DK-PACK-UPC-NBR                
065150             MOVE ASC-KEY-PACK-SKU      TO DK-PACK-SKU                    
065160             MOVE ASC-KEY-PKGING-TYP    TO DK-PKGING-TYP                  
065161             MOVE ASC-KEY-PO-PREPK-ID   TO DK-PO-PREPK-ID                 
065162             MOVE ASC-KEY-PREPK-DESC    TO DK-PREPK-DESC                  
065163             MOVE ASC-KEY-ASN-PKGING-CDE TO DK-ASN-PKGING-CDE             
065170                                                                          
065200             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 DPKCS036
065300             PERFORM 3000-EDIT-DATA-IN-COMMAREA                      CL**2
065400                                                                  DPKCS036
065500         WHEN OTHER                                               DPKCS036
065600             SET DP013-LOGIC-ABEND TO TRUE                        DPKCS036
065700             SET DP013-NO-ROLLBACK TO TRUE                        DPKCS036
065800             MOVE '1000-CONTROL-PROCESSING'                       DPKCS036
065900                                   TO DP013-PARAGRAPH             DPKCS036
066000             MOVE 'INVALID NEXT APPLICATION ACTIVITY RECEIVED'    DPKCS036
066100                                   TO DP013-MESSAGE-TEXT(1)       DPKCS036
066200             PERFORM DP013-0000-PROCESS-ABEND                     DPKCS036
066300     END-EVALUATE.                                                DPKCS036
066400                                                                  DPKCS036
066500 EJECT                                                            DPKCS036
066600*----------------------------------------------------------------*DPKCS036
066700* DETERMINE IF DATA WAS PASSED THROUGH INTER-APPL COMMAREA OR    *DPKCS036
066800* IF THERE IS DATA TO BE USED IN THE NAV-KEY FIELD.              *DPKCS036
066900*----------------------------------------------------------------*DPKCS036
067000 1100-PROCESS-INTER-APPL-COMM.                                    DPKCS036
067100                                                                  DPKCS036
067200     SET PS-COMMAREA-VALID         TO TRUE.                       DPKCS036
067300     MOVE SPACE                    TO ASC-START-ITEM-REQUEST.     DPKCS036
067310                                                                          
067312     IF TR183-PKGING-TYP = PC-I OR PC-M                                   
068300         MOVE TR183-CONTNR-NO      TO ASC-KEY-CONTNR-NO                   
068400                                      DK-CONTNR-NO                        
068500         MOVE TR183-CONTNR-SEQ-NO  TO ASC-KEY-CONTNR-SEQ-NO               
068600                                      DK-CONTNR-SEQ-NO                    
068610         MOVE TR183-PO-NBR         TO ASC-KEY-PO-NO                       
068620                                      DK-PO-NO                            
068630         MOVE TR183-PKGING-TYP     TO ASC-KEY-PKGING-TYP                  
068640                                      DK-PKGING-TYP                       
068650         MOVE TR183-PACK-CTNS      TO ASC-KEY-PACK-CTNS                   
068660                                      DK-PACK-CTNS                        
068670         MOVE TR183-PACK-UNITS     TO ASC-KEY-PACK-UNITS                  
068680                                      DK-PACK-UNITS                       
068690         MOVE TR183-PACK-SKU       TO ASC-KEY-PACK-SKU                    
068691                                      DK-PACK-SKU                         
068692         MOVE TR183-PACK-UPC       TO ASC-KEY-PACK-UPC-NBR                
068693                                      DK-PACK-UPC-NBR                     
068694         MOVE TR183-PO-PREPK-ID    TO ASC-KEY-PO-PREPK-ID                 
068695                                      DK-PO-PREPK-ID                      
068696         MOVE TR183-PK-SKU-NBR     TO ASC-KEY-PK-SKU-NBR                  
068697                                      DK-PK-SKU-NBR                       
068698         MOVE TR183-PREPK-DESC     TO ASC-KEY-PREPK-DESC                  
068699                                      DK-PREPK-DESC                       
068700         MOVE TR183-ASN-PKGNG-CDE  TO ASC-KEY-ASN-PKGING-CDE              
068710                                      DK-ASN-PKGING-CDE                   
068720     ELSE                                                                 
068721         MOVE PC-TSYMSG-03093 TO DP020-MSG-NUMBER                         
068723         SET PS-ERROR                                                     
068724             PS-COMMAREA-NOT-VALID                                        
068725             DP020-MSG-FATAL                                              
068726                             TO TRUE                                      
068730     END-IF.                                                              
068800                                                                          
068891 EJECT                                                            DPKCS036
068900*----------------------------------------------------------------*DPKCS036
069000* DO ANY PROCESSING FOR KEYS FOR WHICH NO EDITTING OF THE DATA   *DPKCS036
069100* ON THE SCREEN NEEDS TO BE DONE.  IF ONE OF THOSE KEYS IS NOT   *DPKCS036
069200* USED, EDIT THE DATA ON THE SCREEN AND GO ON TO CHECK THE REST  *DPKCS036
069300* OF THE FUNCTION KEYS.  NOTE THAT WITH THE API, NO INVALID      *DPKCS036
069400* FUNCTION KEYS CAN GET THIS FAR.                                *DPKCS036
069500*----------------------------------------------------------------*DPKCS036
069600 2000-PROCESS-PANEL.                                              DPKCS036
069700                                                                  DPKCS036
069800     EVALUATE TRUE                                                DPKCS036
069900         WHEN DP020-SRC-AID = DP016-CLEAR                         DPKCS036
070000             MOVE ZERO             TO ASC-ITEM-AT-TOP-OF-PANEL    DPKCS036
070100             PERFORM 3000-EDIT-DATA-IN-COMMAREA                   DPKCS036
070200             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 DPKCS036
070300                                                                  DPKCS036
070400         WHEN DP020-FK-REFRESH (DP020-SRC-AID)                    DPKCS036
070500             MOVE ASC-KEY-CONTNR-NO                               DPKCS036
070600                                   TO DK-CONTNR-NO                DPKCS036
070700             MOVE ASC-KEY-CONTNR-SEQ-NO                           DPKCS036
070800                                   TO DK-CONTNR-SEQ-NO            DPKCS036
070900             MOVE ASC-KEY-PO-NO    TO DK-PO-NO                    DPKCS036
071030             MOVE ASC-KEY-PACK-CTNS     TO DK-PACK-CTNS                   
071040             MOVE ASC-KEY-PACK-UNITS    TO DK-PACK-UNITS                  
071050             MOVE ASC-KEY-PACK-UPC-NBR  TO DK-PACK-UPC-NBR                
071060             MOVE ASC-KEY-PACK-SKU      TO DK-PACK-SKU                    
071070             MOVE ASC-KEY-PKGING-TYP    TO DK-PKGING-TYP                  
071080             MOVE ASC-KEY-PO-PREPK-ID   TO DK-PO-PREPK-ID                 
071090             MOVE ASC-KEY-PREPK-DESC    TO DK-PREPK-DESC                  
071091             MOVE ASC-KEY-ASN-PKGING-CDE TO DK-ASN-PKGING-CDE             
071092                                                                          
071100             PERFORM 2050-DELETE-LIST-QUEUE                       DPKCS036
071200             PERFORM 4000-BUILD-INITIAL-PANEL                     DPKCS036
071300                                                                  DPKCS036
071400         WHEN OTHER                                               DPKCS036
071500             PERFORM 2200-MOVE-SCREEN-TO-COMMAREA                 DPKCS036
071600             PERFORM 3000-EDIT-DATA-IN-COMMAREA                   DPKCS036
071700             IF  PS-NO-ERROR                                      DPKCS036
071800                 SET DP030-CONTINUE-GO                            DPKCS036
071900                                 TO TRUE                          DPKCS036
072000                 PERFORM 2100-CHECK-FUNCTION-KEY                  DPKCS036
072100             ELSE                                                 DPKCS036
072200                 SET DP030-OVERRIDE-GO                            DPKCS036
072300                                 TO TRUE                          DPKCS036
072400             END-IF                                               DPKCS036
072500     END-EVALUATE.                                                DPKCS036
072600                                                                  DPKCS036
072700 EJECT                                                            DPKCS036
072800*----------------------------------------------------------------*DPKCS036
072900*  DELETE THE LIST ITEMS TEMP STORAGE QUEUE.                     *DPKCS036
073000*----------------------------------------------------------------*DPKCS036
073100 2050-DELETE-LIST-QUEUE.                                          DPKCS036
073200                                                                  DPKCS036
073300     EXEC CICS                                                    DPKCS036
073400         DELETEQ TS                                               DPKCS036
073500             QUEUE (ASC-LIST-QUEUE-NAME)                          DPKCS036
073600             RESP  (PV-CICS-RESP)                                 DPKCS036
073700     END-EXEC.                                                    DPKCS036
073800                                                                  DPKCS036
073900     IF (PV-CICS-RESP = DFHRESP(NORMAL)) OR                       DPKCS036
074000        (PV-CICS-RESP = DFHRESP(QIDERR))                          DPKCS036
074100         CONTINUE                                                 DPKCS036
074200     ELSE                                                         DPKCS036
074300         SET DP013-CICS-ABEND      TO TRUE                        DPKCS036
074400         SET DP013-NO-ROLLBACK     TO TRUE                        DPKCS036
074500                                                                  DPKCS036
074600         MOVE '2050-DELETE-LIST-QUEUE'                            DPKCS036
074700                                   TO DP013-PARAGRAPH             DPKCS036
074800         MOVE 'ERROR TRYING TO DELETE LIST TEMP STORAGE QUEUE'    DPKCS036
074900                                   TO DP013-MESSAGE-TEXT (1)      DPKCS036
075000         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
075100     END-IF.                                                      DPKCS036
075200                                                                  DPKCS036
075300     MOVE +0                       TO ASC-HIGHEST-BLOCK-WRITTEN.  DPKCS036
075400                                                                  DPKCS036
075500 EJECT                                                            DPKCS036
075600*----------------------------------------------------------------*DPKCS036
075700* ACT ON ANY FUNCTION KEYS THAT REQUIRE EDITS TO BE PASSED FIRST.*DPKCS036
075800* NOTE THAT INVALID FUNCTION KEYS WILL NOT BE RETURNED FROM THE  *DPKCS036
075900* CICS ARCHITECTURE API.                                         *DPKCS036
076000*----------------------------------------------------------------*DPKCS036
076100 2100-CHECK-FUNCTION-KEY.                                         DPKCS036
076200                                                                  DPKCS036
076300     EVALUATE TRUE                                                DPKCS036
081440         WHEN DP020-FK-FIRST-PAGE(DP020-SRC-AID)                  DPKCS036
081500             MOVE +1               TO PV-TOP-ITEM                 DPKCS036
081600             MOVE ASC-KEY-CONTNR-NO                               DPKCS036
081700                                   TO DK-CONTNR-NO                DPKCS036
081800             MOVE ASC-KEY-CONTNR-SEQ-NO                           DPKCS036
081900                                   TO DK-CONTNR-SEQ-NO            DPKCS036
082000             MOVE ASC-KEY-PO-NO    TO DK-PO-NO                    DPKCS036
082100             MOVE ASC-KEY-VS-NO    TO DK-VS-NO                    DPKCS036
082200             MOVE ASC-KEY-UPC-NO   TO DK-UPC-NO                   DPKCS036
082230             MOVE ASC-KEY-PACK-CTNS     TO DK-PACK-CTNS                   
082240             MOVE ASC-KEY-PACK-UNITS    TO DK-PACK-UNITS                  
082250             MOVE ASC-KEY-PACK-UPC-NBR  TO DK-PACK-UPC-NBR                
082260             MOVE ASC-KEY-PACK-SKU      TO DK-PACK-SKU                    
082270             MOVE ASC-KEY-PKGING-TYP    TO DK-PKGING-TYP                  
082280             MOVE ASC-KEY-PO-PREPK-ID   TO DK-PO-PREPK-ID                 
082290             MOVE ASC-KEY-PREPK-DESC    TO DK-PREPK-DESC                  
082291             MOVE ASC-KEY-ASN-PKGING-CDE TO DK-ASN-PKGING-CDE             
082292                                                                          
082300             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 DPKCS036
082400             PERFORM 3200-RESET-ATTRIBUTES                        DPKCS036
082500                                                                  DPKCS036
082600         WHEN DP020-FK-PREV-PAGE(DP020-SRC-AID)                   DPKCS036
082700             PERFORM 2110-BROWSE-BACKWARD                         DPKCS036
082800             MOVE ASC-KEY-CONTNR-NO                               DPKCS036
082900                                   TO DK-CONTNR-NO                DPKCS036
083000             MOVE ASC-KEY-CONTNR-SEQ-NO                           DPKCS036
083100                                   TO DK-CONTNR-SEQ-NO            DPKCS036
083200             MOVE ASC-KEY-PO-NO    TO DK-PO-NO                    DPKCS036
083300             MOVE ASC-KEY-VS-NO    TO DK-VS-NO                    DPKCS036
083400             MOVE ASC-KEY-UPC-NO   TO DK-UPC-NO                   DPKCS036
083410             MOVE ASC-KEY-PACK-CTNS     TO DK-PACK-CTNS                   
083420             MOVE ASC-KEY-PACK-UNITS    TO DK-PACK-UNITS                  
083430             MOVE ASC-KEY-PACK-UPC-NBR  TO DK-PACK-UPC-NBR                
083440             MOVE ASC-KEY-PACK-SKU      TO DK-PACK-SKU                    
083450             MOVE ASC-KEY-PKGING-TYP    TO DK-PKGING-TYP                  
083460             MOVE ASC-KEY-PO-PREPK-ID   TO DK-PO-PREPK-ID                 
083470             MOVE ASC-KEY-PREPK-DESC    TO DK-PREPK-DESC                  
083480             MOVE ASC-KEY-ASN-PKGING-CDE TO DK-ASN-PKGING-CDE             
083500             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 DPKCS036
083600             PERFORM 3200-RESET-ATTRIBUTES                        DPKCS036
083700                                                                  DPKCS036
083800         WHEN DP020-FK-NEXT-PAGE(DP020-SRC-AID)                   DPKCS036
083900             PERFORM 2120-BROWSE-FORWARD                          DPKCS036
084000             MOVE ASC-KEY-CONTNR-NO                               DPKCS036
084100                                   TO DK-CONTNR-NO                DPKCS036
084200             MOVE ASC-KEY-CONTNR-SEQ-NO                           DPKCS036
084300                                   TO DK-CONTNR-SEQ-NO            DPKCS036
084400             MOVE ASC-KEY-PO-NO    TO DK-PO-NO                    DPKCS036
084500             MOVE ASC-KEY-VS-NO    TO DK-VS-NO                    DPKCS036
084600             MOVE ASC-KEY-UPC-NO   TO DK-UPC-NO                   DPKCS036
084610             MOVE ASC-KEY-PACK-CTNS     TO DK-PACK-CTNS                   
084620             MOVE ASC-KEY-PACK-UNITS    TO DK-PACK-UNITS                  
084630             MOVE ASC-KEY-PACK-UPC-NBR  TO DK-PACK-UPC-NBR                
084640             MOVE ASC-KEY-PACK-SKU      TO DK-PACK-SKU                    
084650             MOVE ASC-KEY-PKGING-TYP    TO DK-PKGING-TYP                  
084660             MOVE ASC-KEY-PO-PREPK-ID   TO DK-PO-PREPK-ID                 
084670             MOVE ASC-KEY-PREPK-DESC    TO DK-PREPK-DESC                  
084680             MOVE ASC-KEY-ASN-PKGING-CDE TO DK-ASN-PKGING-CDE             
084700             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 DPKCS036
084800                                                                  DPKCS036
084900         WHEN DP020-SRC-AID = DP016-ENTER                         DPKCS036
085000             PERFORM 2130-CHECK-FOR-JUMP-BROWSE                   DPKCS036
085100             IF  PS-ERROR                                         DPKCS036
085200                 CONTINUE                                         DPKCS036
085300             ELSE                                                 DPKCS036
085400                 MOVE ASC-KEY-CONTNR-NO                           DPKCS036
085500                                     TO DK-CONTNR-NO              DPKCS036
085600                 MOVE ASC-KEY-CONTNR-SEQ-NO                       DPKCS036
085700                                     TO DK-CONTNR-SEQ-NO          DPKCS036
085800                 MOVE ASC-KEY-PO-NO  TO DK-PO-NO                  DPKCS036
085900                 MOVE ASC-KEY-VS-NO  TO DK-VS-NO                  DPKCS036
086000                 MOVE ASC-KEY-UPC-NO TO DK-UPC-NO                 DPKCS036
086010                 MOVE ASC-KEY-PACK-CTNS     TO DK-PACK-CTNS               
086020                 MOVE ASC-KEY-PACK-UNITS    TO DK-PACK-UNITS              
086030                 MOVE ASC-KEY-PACK-UPC-NBR  TO DK-PACK-UPC-NBR            
086040                 MOVE ASC-KEY-PACK-SKU      TO DK-PACK-SKU                
086050                 MOVE ASC-KEY-PKGING-TYP    TO DK-PKGING-TYP              
086060                 MOVE ASC-KEY-PO-PREPK-ID   TO DK-PO-PREPK-ID             
086070                 MOVE ASC-KEY-PREPK-DESC    TO DK-PREPK-DESC              
086080                 MOVE ASC-KEY-ASN-PKGING-CDE TO DK-ASN-PKGING-CDE         
086100                 PERFORM 4400-MOVE-COMMAREA-TO-SCREEN             DPKCS036
086200             END-IF                                               DPKCS036
086300                                                                  DPKCS036
086400         WHEN OTHER                                               DPKCS036
086500             SET DP013-NO-ROLLBACK                                DPKCS036
086600                 DP013-XCTL-DISPLAY-RESTART                       DPKCS036
086700                 DP013-CICS-ABEND  TO TRUE                        DPKCS036
086800             MOVE '2100-CHECK-FUNCTION-KEY'                       DPKCS036
086900                                   TO DP013-PARAGRAPH             DPKCS036
087000             MOVE 'INVALID FUNCTION KEY NOT CAPTURED BY API'      DPKCS036
087100                                   TO DP013-MESSAGE-TEXT (1)      DPKCS036
087200             PERFORM DP013-0000-PROCESS-ABEND                     DPKCS036
087300     END-EVALUATE.                                                DPKCS036
087400                                                                  DPKCS036
087500 EJECT                                                            DPKCS036
087600*----------------------------------------------------------------*DPKCS036
087700*    IF THE USER HITS THE PAGE BACKWARD KEY, COMPUTE THE TOP     *DPKCS036
087800*    ITEM NUMBER FOR THE NEW PAGE.  IF IT IS ABOVE THE TOP,      *DPKCS036
087900*    SET THE TOP ITEM NUMBER TO +1 AND DISPLAY THE TOP OF LIST   *DPKCS036
088000*    MESSAGE.                                                    *DPKCS036
088100*----------------------------------------------------------------*DPKCS036
088200 2110-BROWSE-BACKWARD.                                            DPKCS036
088300                                                                  DPKCS036
088400     SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-AT-TOP-OF-PANEL    DPKCS036
088500         GIVING PV-TOP-ITEM.                                      DPKCS036
088600*                                                                 DPKCS036
088700     IF  ((PV-TOP-ITEM < +1)                                      DPKCS036
088800       OR (PV-TOP-ITEM = +1))                                     DPKCS036
088900         MOVE +1                   TO PV-TOP-ITEM                 DPKCS036
089000*------------ TOP OF LIST --                                      DPKCS036
089100         MOVE PC-TSYMSG-00069      TO DP020-MSG-NUMBER            DPKCS036
089200         SET DP020-MSG-INFORMATIONAL TO TRUE                      DPKCS036
089300     END-IF.                                                      DPKCS036
089400                                                                  DPKCS036
089500 EJECT                                                            DPKCS036
089600*----------------------------------------------------------------*DPKCS036
089700*    IF THE USER HITS THE PAGE FORWARD KEY, COMPUTE THE TOP      *DPKCS036
089800*    ITEM NUMBER FOR THE NEW PAGE.  IF THE USER ATTEMPTS TO GO   *DPKCS036
089900*    PAST THE END, ISSUE THE BOTTOM OF LIST MESSAGE.             *DPKCS036
090000*----------------------------------------------------------------*DPKCS036
090100 2120-BROWSE-FORWARD.                                             DPKCS036
090200                                                                  DPKCS036
090300     ADD PC-ITEMS-PER-PANEL ASC-ITEM-AT-TOP-OF-PANEL              DPKCS036
090400         GIVING PV-TOP-ITEM.                                      DPKCS036
090500     IF  PV-TOP-ITEM > ASC-NUMBER-OF-ITEMS-READ                   DPKCS036
090600         MOVE ASC-ITEM-AT-TOP-OF-PANEL                            DPKCS036
090700                                   TO PV-TOP-ITEM                 DPKCS036
090800*------------ BOTTOM OF LIST --------                             DPKCS036
090900         MOVE PC-TSYMSG-00070      TO DP020-MSG-NUMBER            DPKCS036
091000         SET DP020-MSG-INFORMATIONAL                              DPKCS036
091100                                   TO TRUE                        DPKCS036
091200     ELSE                                                         DPKCS036
091300         COMPUTE PV-BOTTOM-ITEM =                                 DPKCS036
091400             PV-TOP-ITEM + PC-ITEMS-PER-PANEL - 1                 DPKCS036
091500         IF  PV-BOTTOM-ITEM > ASC-NUMBER-OF-ITEMS-READ            DPKCS036
091600*---------------- BOTTOM OF LIST ----                             DPKCS036
091700             MOVE PC-TSYMSG-00070  TO DP020-MSG-NUMBER            DPKCS036
091800             SET DP020-MSG-INFORMATIONAL                          DPKCS036
091900                                   TO TRUE                        DPKCS036
092000         END-IF                                                   DPKCS036
092100     END-IF.                                                      DPKCS036
092200                                                                  DPKCS036
092300 EJECT                                                            DPKCS036
092400*----------------------------------------------------------------*DPKCS036
092500*    THE USER CAN CHANGE THE CURRENT BEGINNING LIST NUMBER SO    *DPKCS036
092600*    THAT THE TRANSACTION WILL JUMP TO THAT POINT IN THE LIST.   *DPKCS036
092700*    THIS IS A FASTER WAY TO GET TO A CERTAIN POINT IN THE LIST  *DPKCS036
092800*    RATHER THAN HITTING NEXT-PAGE TO GET TO THAT POINT.         *DPKCS036
092900*    THE NEW LIST NUMBER ENTERED IS EDITED TO MAKE SURE THAT     *DPKCS036
093000*    IT IS NUMERIC AND FALLS BETWEEN A SPECIFIED RANGE.          *DPKCS036
093100*----------------------------------------------------------------*DPKCS036
093200 2130-CHECK-FOR-JUMP-BROWSE.                                      DPKCS036
093300                                                                  DPKCS036
093400     SET PS-NO-ERROR               TO TRUE.                       DPKCS036
093500     IF (ASC-START-ITEM-REQUEST = SPACE)                          DPKCS036
093600         MOVE ASC-ITEM-AT-TOP-OF-PANEL                            DPKCS036
093700                                   TO PV-TOP-ITEM                 DPKCS036
093800     ELSE                                                         DPKCS036
093900         MOVE ASC-START-ITEM-REQUEST                              DPKCS036
094000                                   TO DP010I-UNEDITED-FIELD       DPKCS036
094100         MOVE PC-MSG-NUMBER-LENGTH TO DP010I-MAXIMUM-DIGITS       DPKCS036
094200         MOVE +0                   TO DP010I-MAXIMUM-DECIMALS     DPKCS036
094300         SET DP010I-NEGATIVE-NOT-ALLOWED                          DPKCS036
094400                                   TO TRUE                        DPKCS036
263697         CALL DP010I-NUMERIC-EDIT-ROUTINE                                 
263697              USING DP010I-NUMERIC-EDIT-AREA                              
094600                                                                  DPKCS036
094700         IF  NOT DP010I-ERROR-DETECTED                            DPKCS036
094800             MOVE DP010I-NUMERIC-FIELD                            DPKCS036
094900                                   TO  ASC-START-ITEM-REQUEST-N   DPKCS036
095000             IF  ASC-START-ITEM-REQUEST-N > ZERO                  DPKCS036
095100                 IF  ASC-START-ITEM-REQUEST-N >                   DPKCS036
095200                                          ASC-NUMBER-OF-ITEMS-READDPKCS036
095300                     MOVE SPACE TO ASC-START-ITEM-REQUEST         DPKCS036
095400                     COMPUTE PV-TOP-ITEM =                        DPKCS036
095500                             ASC-NUMBER-OF-ITEMS-READ             DPKCS036
095600                             - PC-ITEMS-PER-PANEL + 1             DPKCS036
095700                     IF  PV-TOP-ITEM < +1                         DPKCS036
095800                         MOVE +1   TO PV-TOP-ITEM                 DPKCS036
095900                         MOVE PC-TSYMSG-00070                     DPKCS036
096000                                   TO DP020-MSG-NUMBER            DPKCS036
096100                         SET DP020-MSG-INFORMATIONAL              DPKCS036
096200                                   TO TRUE                        DPKCS036
096300                     END-IF                                       DPKCS036
096400                 ELSE                                             DPKCS036
096500                     MOVE ASC-START-ITEM-REQUEST-N                DPKCS036
096600                                   TO PV-TOP-ITEM                 DPKCS036
096700                     MOVE SPACE    TO ASC-START-ITEM-REQUEST      DPKCS036
096800                     COMPUTE PV-BOTTOM-ITEM =                     DPKCS036
096900                         PV-TOP-ITEM + PC-ITEMS-PER-PANEL - 1     DPKCS036
097000                     IF  PV-BOTTOM-ITEM > ASC-NUMBER-OF-ITEMS-READDPKCS036
097100*---------------------------- BOTTOM OF LIST ---------            DPKCS036
097200                         MOVE PC-TSYMSG-00070                     DPKCS036
097300                                   TO DP020-MSG-NUMBER            DPKCS036
097400                         SET DP020-MSG-INFORMATIONAL              DPKCS036
097500                                   TO TRUE                        DPKCS036
097600                     END-IF                                       DPKCS036
097700                 END-IF                                           DPKCS036
097800             ELSE                                                 DPKCS036
097900*-------------------- VALUE OUT OF RANGE -------------            DPKCS036
098000                 MOVE PC-TSYMSG-00101                             DPKCS036
098100                                   TO DP020-MSG-NUMBER            DPKCS036
098200                 MOVE -1           TO ASTRTITL                    DPKCS036
098300                 SET DP030-SET-CURSOR-APPL-1                      DPKCS036
098400                                   TO TRUE                        DPKCS036
098500                 MOVE DP015-REVERSE                               DPKCS036
098600                                   TO ASTRTITH                    DPKCS036
098700                 MOVE DP015-RED    TO ASTRTITC                    DPKCS036
098800                 MOVE DP015-UNP-NUM-BRT-MDT                       DPKCS036
098900                                   TO ASTRTITA                    DPKCS036
099000                 SET DP020-MSG-FATAL                              DPKCS036
099100                                   TO TRUE                        DPKCS036
099200                 SET PS-ERROR      TO TRUE                        DPKCS036
099300             END-IF                                               DPKCS036
099400                                                                  DPKCS036
099500         ELSE                                                     DPKCS036
099600             MOVE PC-TSYMSG-00008  TO DP020-MSG-NUMBER            DPKCS036
099700             MOVE -1               TO ASTRTITL                    DPKCS036
099800             SET DP030-SET-CURSOR-APPL-1 TO TRUE                  DPKCS036
099900             MOVE DP015-REVERSE    TO ASTRTITH                    DPKCS036
100000             MOVE DP015-RED        TO ASTRTITC                    DPKCS036
100100             MOVE DP015-UNP-NUM-BRT-MDT                           DPKCS036
100200                                   TO ASTRTITA                    DPKCS036
100300             SET DP020-MSG-FATAL   TO TRUE                        DPKCS036
100400             SET PS-ERROR          TO TRUE                        DPKCS036
100500         END-IF                                                   DPKCS036
100600     END-IF.                                                      DPKCS036
100700                                                                  DPKCS036
100800 EJECT                                                            DPKCS036
100900*----------------------------------------------------------------*DPKCS036
101000*    IF THE USER HITS THE DESELECT KEY, CLEAR THE SELECTION      *DPKCS036
101100*    SWITCH FOR ALL ITEMS THAT WERE PREVIOUSLY SELECTED.         *DPKCS036
101200*----------------------------------------------------------------*DPKCS036
101300 2140-DESELECT-ALL-ITEMS.                                         DPKCS036
101400                                                                  DPKCS036
101500     MOVE +1                       TO ASC-BLK-SUB.                DPKCS036
101600                                                                  DPKCS036
101700     PERFORM 2141-CLEAR-SELECTED-INDS                             DPKCS036
101800         VARYING ASC-ITEM-SUB                                     DPKCS036
101900         FROM 1 BY 1                                              DPKCS036
102000         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 DPKCS036
102100                                                                  DPKCS036
102200     ADD +1                        TO ASC-BLK-SUB.                DPKCS036
102300                                                                  DPKCS036
102400     PERFORM 2141-CLEAR-SELECTED-INDS                             DPKCS036
102500         VARYING ASC-ITEM-SUB                                     DPKCS036
102600         FROM 1 BY 1                                              DPKCS036
102700         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 DPKCS036
102800                                                                  DPKCS036
102900     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               DPKCS036
103000                                   TO PV-LIST-ITEM-NUMBER.        DPKCS036
103100                                                                  DPKCS036
103200     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            DPKCS036
103300         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    DPKCS036
103400                                                                  DPKCS036
103500     IF (PV-FIRST-BLOCK-IN-ARRAY NOT = +1) OR                     DPKCS036
103600        (ASC-HIGHEST-BLOCK-WRITTEN > PC-MAX-BLOCKS-IN-ARRAY)      DPKCS036
103700         MOVE +1                   TO ASC-BLK-SUB                 DPKCS036
103800                                                                  DPKCS036
103900         PERFORM 5100-WRITE-TEMP-STORAGE                          DPKCS036
104000                                                                  DPKCS036
104100         MOVE +1                   TO PV-BLOCK-NUMBER             DPKCS036
104200                                                                  DPKCS036
104300         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         DPKCS036
104400             PV-FIRST-BLOCK-IN-ARRAY - 1                          DPKCS036
104500                                                                  DPKCS036
104600         PERFORM                                                  DPKCS036
104700             UNTIL PV-BLOCK-NUMBER > PV-PREV-BLOCK-IN-ARRAY       DPKCS036
104800                                                                  DPKCS036
104900             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
105000                                                                  DPKCS036
105100             PERFORM 2141-CLEAR-SELECTED-INDS                     DPKCS036
105200                 VARYING ASC-ITEM-SUB FROM 1 BY 1                 DPKCS036
105300                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          DPKCS036
105400                                                                  DPKCS036
105500             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
105600                                                                  DPKCS036
105700             ADD +1                TO PV-BLOCK-NUMBER             DPKCS036
105800                                                                  DPKCS036
105900         END-PERFORM                                              DPKCS036
106000                                                                  DPKCS036
106100         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         DPKCS036
106200             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     DPKCS036
106300                                                                  DPKCS036
106400         PERFORM                                                  DPKCS036
106500             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       DPKCS036
106600                   ASC-HIGHEST-BLOCK-WRITTEN                      DPKCS036
106700                                                                  DPKCS036
106800             MOVE PV-NEXT-BLOCK-IN-ARRAY                          DPKCS036
106900                                   TO PV-BLOCK-NUMBER             DPKCS036
107000                                                                  DPKCS036
107100             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
107200                                                                  DPKCS036
107300             PERFORM 2141-CLEAR-SELECTED-INDS                     DPKCS036
107400                 VARYING ASC-ITEM-SUB                             DPKCS036
107500                 FROM 1 BY 1                                      DPKCS036
107600                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          DPKCS036
107700                                                                  DPKCS036
107800             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
107900                                                                  DPKCS036
108000             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      DPKCS036
108100                                                                  DPKCS036
108200         END-PERFORM                                              DPKCS036
108300                                                                  DPKCS036
108400         MOVE PV-FIRST-BLOCK-IN-ARRAY                             DPKCS036
108500                                   TO PV-BLOCK-NUMBER             DPKCS036
108600                                                                  DPKCS036
108700         PERFORM 4410-READ-TEMP-STORAGE                           DPKCS036
108800     END-IF.                                                      DPKCS036
108900                                                                  DPKCS036
109000                                                                  DPKCS036
109100     MOVE +0                    TO ASC-NUMBER-OF-SELECTED-ITEMS.  DPKCS036
109200     MOVE +0                    TO ASC-START-OF-SELECTED-RANGE.   DPKCS036
109300     MOVE +0                    TO ASC-END-OF-SELECTED-RANGE.     DPKCS036
109400                                                                  DPKCS036
109500     PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                        DPKCS036
109600                                                                  DPKCS036
109700 EJECT                                                            DPKCS036
109800*----------------------------------------------------------------*DPKCS036
109900*    MARK EACH ITEM AS BEING NOT SELECTED.                       *DPKCS036
110000*----------------------------------------------------------------*DPKCS036
110100 2141-CLEAR-SELECTED-INDS.                                        DPKCS036
110200                                                                  DPKCS036
110300     IF  ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB ASC-ITEM-SUB)           DPKCS036
110400             NOT EQUAL ZERO                                       DPKCS036
110500         IF  NOT ASC-NO-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          DPKCS036
110600             SET ASC-NO-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          DPKCS036
110700                 ASC-TEMP-NO-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)    DPKCS036
110800                 ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                  DPKCS036
110900                                   TO TRUE                        DPKCS036
111000         END-IF                                                   DPKCS036
111100     END-IF.                                                      DPKCS036
111200                                                                  DPKCS036
111300 EJECT                                                            DPKCS036
111400*----------------------------------------------------------------*DPKCS036
111500*  IF THE USER HITS THE SELECT-ALL KEY, SET THE SELECTIO SWITCH  *DPKCS036
111600*  FOR ALL ITEMS.                                                *DPKCS036
111700*----------------------------------------------------------------*DPKCS036
111800 2150-SELECT-ALL-ITEMS.                                           DPKCS036
111900                                                                  DPKCS036
112000     MOVE +1                       TO ASC-BLK-SUB.                DPKCS036
112100                                                                  DPKCS036
112200     PERFORM 2151-SET-SELECTED-INDS                               DPKCS036
112300         VARYING ASC-ITEM-SUB                                     DPKCS036
112400         FROM 1 BY 1                                              DPKCS036
112500         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 DPKCS036
112600                                                                  DPKCS036
112700     ADD +1                        TO ASC-BLK-SUB.                DPKCS036
112800                                                                  DPKCS036
112900     PERFORM 2151-SET-SELECTED-INDS                               DPKCS036
113000         VARYING ASC-ITEM-SUB                                     DPKCS036
113100         FROM 1 BY 1                                              DPKCS036
113200         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 DPKCS036
113300                                                                  DPKCS036
113400     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               DPKCS036
113500                                   TO PV-LIST-ITEM-NUMBER.        DPKCS036
113600                                                                  DPKCS036
113700     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            DPKCS036
113800         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    DPKCS036
113900                                                                  DPKCS036
114000     IF (PV-FIRST-BLOCK-IN-ARRAY NOT = +1) OR                     DPKCS036
114100        (ASC-HIGHEST-BLOCK-WRITTEN >   PC-MAX-BLOCKS-IN-ARRAY)    DPKCS036
114200         MOVE +1                   TO ASC-BLK-SUB                 DPKCS036
114300                                                                  DPKCS036
114400         PERFORM 5100-WRITE-TEMP-STORAGE                          DPKCS036
114500                                                                  DPKCS036
114600         MOVE +1                   TO PV-BLOCK-NUMBER             DPKCS036
114700                                                                  DPKCS036
114800         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         DPKCS036
114900             PV-FIRST-BLOCK-IN-ARRAY - 1                          DPKCS036
115000                                                                  DPKCS036
115100         PERFORM                                                  DPKCS036
115200             UNTIL PV-BLOCK-NUMBER > PV-PREV-BLOCK-IN-ARRAY       DPKCS036
115300                                                                  DPKCS036
115400             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
115500                                                                  DPKCS036
115600             PERFORM 2151-SET-SELECTED-INDS                       DPKCS036
115700                 VARYING ASC-ITEM-SUB                             DPKCS036
115800                 FROM 1 BY 1                                      DPKCS036
115900                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          DPKCS036
116000                                                                  DPKCS036
116100             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
116200                                                                  DPKCS036
116300             ADD +1                TO PV-BLOCK-NUMBER             DPKCS036
116400                                                                  DPKCS036
116500         END-PERFORM                                              DPKCS036
116600                                                                  DPKCS036
116700         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         DPKCS036
116800             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     DPKCS036
116900                                                                  DPKCS036
117000         PERFORM                                                  DPKCS036
117100             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       DPKCS036
117200                   ASC-HIGHEST-BLOCK-WRITTEN                      DPKCS036
117300                                                                  DPKCS036
117400             MOVE PV-NEXT-BLOCK-IN-ARRAY                          DPKCS036
117500                                   TO PV-BLOCK-NUMBER             DPKCS036
117600                                                                  DPKCS036
117700             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
117800                                                                  DPKCS036
117900             PERFORM 2151-SET-SELECTED-INDS                       DPKCS036
118000                 VARYING ASC-ITEM-SUB                             DPKCS036
118100                 FROM 1 BY 1                                      DPKCS036
118200                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          DPKCS036
118300                                                                  DPKCS036
118400             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
118500                                                                  DPKCS036
118600             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      DPKCS036
118700                                                                  DPKCS036
118800         END-PERFORM                                              DPKCS036
118900                                                                  DPKCS036
119000         MOVE PV-FIRST-BLOCK-IN-ARRAY                             DPKCS036
119100                                   TO PV-BLOCK-NUMBER             DPKCS036
119200                                                                  DPKCS036
119300         PERFORM 4410-READ-TEMP-STORAGE                           DPKCS036
119400     END-IF.                                                      DPKCS036
119500                                                                  DPKCS036
119600                                                                  DPKCS036
119700     MOVE ASC-NUMBER-OF-ITEMS-READ TO                             DPKCS036
119800                       ASC-NUMBER-OF-SELECTED-ITEMS.              DPKCS036
119900                                                                  DPKCS036
120000     PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                        DPKCS036
120100                                                                  DPKCS036
120200 EJECT                                                            DPKCS036
120300*----------------------------------------------------------------*DPKCS036
120400*    MARK EACH ITEM AS BEING SELECTED.                           *DPKCS036
120500*----------------------------------------------------------------*DPKCS036
120600 2151-SET-SELECTED-INDS.                                          DPKCS036
120700                                                                  DPKCS036
120800     IF  ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB ASC-ITEM-SUB)           DPKCS036
120900             NOT EQUAL ZERO                                       DPKCS036
121000         IF  NOT ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)             DPKCS036
121100             SET ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)             DPKCS036
121200                 ASC-TEMP-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)        DPKCS036
121300                 ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                  DPKCS036
121400                               TO  TRUE                           DPKCS036
121500         END-IF                                                   DPKCS036
121600     END-IF.                                                      DPKCS036
121700                                                                  DPKCS036
121800 EJECT                                                            DPKCS036
121900*----------------------------------------------------------------*DPKCS036
122000*  MOVE ALL OF THE FIELDS THAT WERE ENTERED / CHANGED ON THE     *DPKCS036
122100*  SCREEN INTO THE COMMAREA.  ALL EDITTING IS DONE IN THE COMM.  *DPKCS036
122200*----------------------------------------------------------------*DPKCS036
122300 2200-MOVE-SCREEN-TO-COMMAREA.                                    DPKCS036
122400                                                                  DPKCS036
122500     MOVE PV-TOP-ITEM              TO PV-ITEM-IN-USE.             DPKCS036
122600     MOVE +1                       TO PV-SUB.                     DPKCS036
122700*                                                                 DPKCS036
122800     PERFORM 3100-SET-SUBSCRIPTS.                                 DPKCS036
122900     IF  ASTRTITL > ZERO                                          DPKCS036
123000         MOVE ASTRTITI         TO ASC-START-ITEM-REQUEST          DPKCS036
123100     ELSE                                                         DPKCS036
123200         IF  ASTRTITF = DP015-ERASE-EOF                           DPKCS036
123300             INITIALIZE ASC-START-ITEM-REQUEST                    DPKCS036
123400         END-IF                                                   DPKCS036
123500     END-IF.                                                      DPKCS036
123600     PERFORM 2210-MOVE-LINES-TO-COMMAREA                          DPKCS036
123700         VARYING PV-SUB                                           DPKCS036
123800         FROM 1 BY 1                                              DPKCS036
123900         UNTIL PV-SUB > ASC-ITEMS-DISPLAYED.                      DPKCS036
124000                                                                  DPKCS036
124100 EJECT                                                            DPKCS036
124200*----------------------------------------------------------------*DPKCS036
124300*  MOVE THE ENTERABLE FIELDS ON EACH LIST LINE INTO THE COMMAREA *DPKCS036
124400*----------------------------------------------------------------*DPKCS036
124500 2210-MOVE-LINES-TO-COMMAREA.                                     DPKCS036
124600                                                                  DPKCS036
124700     IF  MR-SELECTL (PV-SUB) > ZERO                               DPKCS036
124800         SET ASC-BLOCK-MODIFIED (ASC-BLK-SUB) TO TRUE             DPKCS036
124900         MOVE MR-SELECTI (PV-SUB)                                 DPKCS036
125000                                   TO ASC-TEMP-SELECTED-SW        DPKCS036
125100                                 (ASC-BLK-SUB, ASC-ITEM-SUB)      DPKCS036
125200     ELSE                                                         DPKCS036
125300         IF  MR-SELECTA (PV-SUB) = DP015-ERASE-EOF                DPKCS036
125400                 SET ASC-BLOCK-MODIFIED (ASC-BLK-SUB) TO TRUE     DPKCS036
125500                 MOVE SPACE        TO ASC-TEMP-SELECTED-SW        DPKCS036
125600                                 (ASC-BLK-SUB, ASC-ITEM-SUB)      DPKCS036
125700         END-IF                                                   DPKCS036
125800     END-IF.                                                      DPKCS036
125900     ADD +1                        TO ASC-ITEM-SUB.               DPKCS036
126000     IF  ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                        DPKCS036
126100         ADD +1                    TO ASC-BLK-SUB                 DPKCS036
126200         MOVE +1                   TO ASC-ITEM-SUB                DPKCS036
126300     END-IF.                                                      DPKCS036
126400                                                                  DPKCS036
126500 EJECT                                                            DPKCS036
126600*----------------------------------------------------------------*DPKCS036
126700*  EDIT ALL OF THE DATA ON THE SCREEN AS IT RESIDES IN THE       *DPKCS036
126800*  COMMAREA (EDITTING IS NOT DONE AGAINST THE SCREEN DIRECTLY).  *DPKCS036
126900*----------------------------------------------------------------*DPKCS036
127000 3000-EDIT-DATA-IN-COMMAREA.                                      DPKCS036
127100                                                                  DPKCS036
127200     SET PS-NO-ERROR               TO TRUE.                       DPKCS036
127300     PERFORM 3200-RESET-ATTRIBUTES.                               DPKCS036
127400     MOVE ASC-ITEMS-DISPLAYED      TO PV-SUB.                     DPKCS036
127500**                                                                DPKCS036
127600* CALCULATE THE POSITION OF THE LAST ITEM DISPLAYED.              DPKCS036
127700* EDITTING IS DONE FROM THE BOTTOM UP.                            DPKCS036
127800**                                                                DPKCS036
127900     COMPUTE PV-ITEM-IN-USE = PV-TOP-ITEM +                       DPKCS036
128000         ASC-ITEMS-DISPLAYED - 1.                                 DPKCS036
128100     PERFORM 3100-SET-SUBSCRIPTS.                                 DPKCS036
128200     PERFORM 3300-EDIT-SELECTIONS                                 DPKCS036
128300         VARYING PV-SUB                                           DPKCS036
128400         FROM PV-SUB BY -1                                        DPKCS036
128500         UNTIL PV-SUB < +1                                        DPKCS036
128600*                                                                 DPKCS036
128700     IF  PS-NO-ERROR                                              DPKCS036
128800         PERFORM 3400-CHECK-RANGE-SEQUENCE                        DPKCS036
128900     END-IF.                                                      DPKCS036
129000*                                                                 DPKCS036
129100     IF  ((PS-NO-ERROR)                                           DPKCS036
129200       AND (ASC-START-OF-SELECTED-RANGE > ZERO)                   DPKCS036
129300       AND (ASC-END-OF-SELECTED-RANGE > ZERO))                    DPKCS036
129400             PERFORM 3500-MARK-RANGE-AS-SELECTED                  DPKCS036
129500     END-IF.                                                      DPKCS036
129600                                                                  DPKCS036
129700 EJECT                                                            DPKCS036
129800*----------------------------------------------------------------*DPKCS036
129900*    DETERMINE THE VALUE OF THE ITEM SUBSCRIPT BASED ON THE ITEM *DPKCS036
130000*    CURRENTLY IN USE AND THE FIRST ITEM IN THE ARRAY.  THIS WILL*DPKCS036
130100*    POSITION US IN THE 1ST BLOCK OF THE ARRAY.                  *DPKCS036
130200*                                                                *DPKCS036
130300*    IF THE ITEM SUBSCRIPT EXCEEDS THE MAXIMUM NUMBER OF ITEMS   *DPKCS036
130400*    IN A BLOCK, RECALCULATE THE SUBSCRIPT BY SUBTRACTING OUT    *DPKCS036
130500*    THE MAXIMUM NUMBER OF ITEMS.  THIS WILL CORRECTLY POSITION  *DPKCS036
130600*    US IN THE 2ND BLOCK OF THE ARRAY.                           *DPKCS036
130700*----------------------------------------------------------------*DPKCS036
130800 3100-SET-SUBSCRIPTS.                                             DPKCS036
130900                                                                  DPKCS036
131000     COMPUTE ASC-ITEM-SUB =                                       DPKCS036
131100         (PV-ITEM-IN-USE - ASC-LIST-ITEM-NUMBER(1 1)) + 1.        DPKCS036
131200                                                                  DPKCS036
131300     IF ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                         DPKCS036
131400         SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-SUB            DPKCS036
131500                                                                  DPKCS036
131600         MOVE PC-MAX-BLOCKS-IN-ARRAY TO ASC-BLK-SUB               DPKCS036
131700     ELSE                                                         DPKCS036
131800         MOVE +1                     TO ASC-BLK-SUB               DPKCS036
131900     END-IF.                                                      DPKCS036
132000                                                                  DPKCS036
132100 EJECT                                                            DPKCS036
132200*----------------------------------------------------------------*DPKCS036
132300*  RESET THE ATTRIBUTES OF ALL ENTERABLE FIELDS ON THE MAP.      *DPKCS036
132400*----------------------------------------------------------------*DPKCS036
132500 3200-RESET-ATTRIBUTES.                                           DPKCS036
132600                                                                  DPKCS036
132700     MOVE DP015-UNP-ALP-NOR-OFF    TO ASTRTITA.                   DPKCS036
132800     MOVE DP015-GREEN              TO ASTRTITC.                   DPKCS036
132900     MOVE DP015-UNDERLINE          TO ASTRTITH.                   DPKCS036
133000*                                                                 DPKCS036
133100     PERFORM                                                      DPKCS036
133200         VARYING PV-SUB                                           DPKCS036
133300         FROM 1 BY 1                                              DPKCS036
133400         UNTIL PV-SUB > (PC-ITEMS-PER-PANEL OR                    DPKCS036
133500                         ASC-ITEMS-DISPLAYED)                     DPKCS036
133600         MOVE DP015-UNP-ALP-NOR-OFF                               DPKCS036
133700                                   TO MR-SELECTA (PV-SUB)         DPKCS036
133800         MOVE DP015-GREEN          TO MR-SELECTC (PV-SUB)         DPKCS036
133900         MOVE DP015-UNDERLINE      TO MR-SELECTH (PV-SUB)         DPKCS036
134000     END-PERFORM.                                                 DPKCS036
134100                                                                  DPKCS036
134200 EJECT                                                            DPKCS036
134300*----------------------------------------------------------------*DPKCS036
134400*  EDIT THE SELECTIONS MADE.  NOTE THAT THE 'SELECTED-SW' IS     *DPKCS036
134500*  WHAT WAS PREVIOUSLY CHECKED AND CORRECT 'TEMP-SELECTED-SW'    *DPKCS036
134600*  IS WHAT HAS JUST BEEN ENTERED AND HAS NOT BEEN EDITTED OR     *DPKCS036
134700*  WAS ENTERED EARLIER, BUT DID NOT PASS THE EDITS.              *DPKCS036
134800*----------------------------------------------------------------*DPKCS036
134900 3300-EDIT-SELECTIONS.                                            DPKCS036
135000                                                                  DPKCS036
135100     EVALUATE TRUE                                                DPKCS036
135200         WHEN ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)     DPKCS036
135300             = ASC-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
135400                 CONTINUE                                         DPKCS036
135500         WHEN ASC-TEMP-SELECT  (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
135600             IF  NOT ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)        DPKCS036
135700                 ADD +1         TO ASC-NUMBER-OF-SELECTED-ITEMS   DPKCS036
135800                 MOVE ASC-TEMP-SELECTED-SW                        DPKCS036
135900                                      (ASC-BLK-SUB ASC-ITEM-SUB)  DPKCS036
136000                                TO ASC-SELECTED-SW                DPKCS036
136100                                      (ASC-BLK-SUB ASC-ITEM-SUB)  DPKCS036
136200             END-IF                                               DPKCS036
136300         WHEN ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)     DPKCS036
136400                 = SPACE                                          DPKCS036
136500             EVALUATE TRUE                                        DPKCS036
136600                 WHEN ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)       DPKCS036
136700                     SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMSDPKCS036
136800                     MOVE SPACE TO ASC-SELECTED-SW                DPKCS036
136900                                      (ASC-BLK-SUB ASC-ITEM-SUB)  DPKCS036
137000                 WHEN ASC-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)        DPKCS036
137100                     MOVE ZERO  TO ASC-START-OF-SELECTED-RANGE    DPKCS036
137200                     MOVE SPACE TO ASC-SELECTED-SW                DPKCS036
137300                                      (ASC-BLK-SUB ASC-ITEM-SUB)  DPKCS036
137400                 WHEN ASC-END (ASC-BLK-SUB ASC-ITEM-SUB)          DPKCS036
137500                     MOVE ZERO  TO ASC-END-OF-SELECTED-RANGE      DPKCS036
137600                     MOVE SPACE TO ASC-SELECTED-SW                DPKCS036
137700                                      (ASC-BLK-SUB ASC-ITEM-SUB)  DPKCS036
137800             END-EVALUATE                                         DPKCS036
137900         WHEN ASC-TEMP-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)           DPKCS036
138000             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            DPKCS036
138100                 SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMS    DPKCS036
138200             END-IF                                               DPKCS036
138300             PERFORM 3310-EDIT-RANGE                              DPKCS036
138400         WHEN ASC-TEMP-END (ASC-BLK-SUB ASC-ITEM-SUB)             DPKCS036
138500             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            DPKCS036
138600                 SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMS    DPKCS036
138700             END-IF                                               DPKCS036
138800             PERFORM 3310-EDIT-RANGE                              DPKCS036
138900         WHEN OTHER                                               DPKCS036
139000             MOVE PC-TSYMSG-00005   TO DP020-MSG-NUMBER           DPKCS036
139100             SET DP020-MSG-FATAL    TO TRUE                       DPKCS036
139200             MOVE -1                TO MR-SELECTL (PV-SUB)        DPKCS036
139300             SET DP030-SET-CURSOR-APPL-1                          DPKCS036
139400                                    TO TRUE                       DPKCS036
139500             MOVE DP015-RED         TO MR-SELECTC (PV-SUB)        DPKCS036
139600             MOVE DP015-REVERSE     TO MR-SELECTH (PV-SUB)        DPKCS036
139700             SET PS-ERROR TO TRUE                                 DPKCS036
139800             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            DPKCS036
139900                 SUBTRACT 1 FROM ASC-NUMBER-OF-SELECTED-ITEMS     DPKCS036
140000                 MOVE SPACE         TO ASC-SELECTED-SW            DPKCS036
140100                                        (ASC-BLK-SUB ASC-ITEM-SUB)DPKCS036
140200             END-IF                                               DPKCS036
140300     END-EVALUATE.                                                DPKCS036
140400                                                                  DPKCS036
140500     SUBTRACT +1             FROM PV-ITEM-IN-USE.                 DPKCS036
140600     SUBTRACT +1 FROM ASC-ITEM-SUB.                               DPKCS036
140700     IF  ASC-ITEM-SUB < 1                                         DPKCS036
140800         SUBTRACT +1 FROM ASC-BLK-SUB                             DPKCS036
140900         MOVE PC-ITEMS-PER-PANEL   TO ASC-ITEM-SUB                DPKCS036
141000     END-IF.                                                      DPKCS036
141100                                                                  DPKCS036
141200 EJECT                                                            DPKCS036
141300*----------------------------------------------------------------*DPKCS036
141400*  IF A BEGINNING AND END OF RANGE WAS ENTERED TO SELECT A       *DPKCS036
141500*  RANGE OF LINES, MAKE SURE THERE IS ONLY 1 BEGINNING AND 1     *DPKCS036
141600*  ENDING AND MAKE SURE THAT THE BEGINNING IS BEFORE (LESS THAN) *DPKCS036
141700*  THE ENDING.                                                   *DPKCS036
141800*----------------------------------------------------------------*DPKCS036
141900 3310-EDIT-RANGE.                                                 DPKCS036
142000                                                                  DPKCS036
142100     IF  ASC-TEMP-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)                DPKCS036
142200         IF  ASC-START-OF-SELECTED-RANGE = ZERO                   DPKCS036
142300             MOVE ASC-TEMP-SELECTED-SW  (ASC-BLK-SUB ASC-ITEM-SUB)DPKCS036
142400                                   TO ASC-SELECTED-SW             DPKCS036
142500                                        (ASC-BLK-SUB ASC-ITEM-SUB)DPKCS036
142600             MOVE PV-ITEM-IN-USE   TO ASC-START-OF-SELECTED-RANGE DPKCS036
142700         ELSE                                                     DPKCS036
142800             IF  ASC-START-OF-SELECTED-RANGE = PV-ITEM-IN-USE     DPKCS036
142900                 CONTINUE                                         DPKCS036
143000             ELSE                                                 DPKCS036
143100*----------------ONLY ONE BEGINNING-OF-RANGE-ALLOWED ---          DPKCS036
143200                 MOVE PC-TSYMSG-00054                             DPKCS036
143300                                   TO DP020-MSG-NUMBER            DPKCS036
143400                 SET DP020-MSG-FATAL                              DPKCS036
143500                                   TO TRUE                        DPKCS036
143600                 MOVE -1           TO MR-SELECTL (PV-SUB)         DPKCS036
143700                 SET DP030-SET-CURSOR-APPL-1                      DPKCS036
143800                                   TO TRUE                        DPKCS036
143900                 MOVE DP015-RED    TO MR-SELECTC (PV-SUB)         DPKCS036
144000                 MOVE DP015-UNDERLINE                             DPKCS036
144100                                   TO MR-SELECTH (PV-SUB)         DPKCS036
144200                 SET PS-ERROR      TO TRUE                        DPKCS036
144300             END-IF                                               DPKCS036
144400         END-IF                                                   DPKCS036
144500     ELSE                                                         DPKCS036
144600         IF  ASC-END-OF-SELECTED-RANGE = ZERO                     DPKCS036
144700             MOVE ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
144800                                   TO ASC-SELECTED-SW             DPKCS036
144900                                     (ASC-BLK-SUB ASC-ITEM-SUB)   DPKCS036
145000             MOVE PV-ITEM-IN-USE   TO ASC-END-OF-SELECTED-RANGE   DPKCS036
145100         ELSE                                                     DPKCS036
145200             IF  ASC-END-OF-SELECTED-RANGE = PV-ITEM-IN-USE       DPKCS036
145300                 CONTINUE                                         DPKCS036
145400             ELSE                                                 DPKCS036
145500*----------------ONLY ONE END-OF-RANGE ALLOWED -------            DPKCS036
145600                 MOVE PC-TSYMSG-00055                             DPKCS036
145700                                   TO DP020-MSG-NUMBER            DPKCS036
145800                 SET DP020-MSG-FATAL                              DPKCS036
145900                                   TO TRUE                        DPKCS036
146000                 MOVE -1           TO MR-SELECTL (PV-SUB)         DPKCS036
146100                 SET DP030-SET-CURSOR-APPL-1                      DPKCS036
146200                                   TO TRUE                        DPKCS036
146300                 SET PS-ERROR      TO TRUE                        DPKCS036
146400             END-IF                                               DPKCS036
146500         END-IF                                                   DPKCS036
146600     END-IF.                                                      DPKCS036
146700                                                                  DPKCS036
146800 EJECT                                                            DPKCS036
146900*----------------------------------------------------------------*DPKCS036
147000*  IF BOTH A BEGINNING AND END OF RANGE HAVE BEEN SPECIFIED,     *DPKCS036
147100*  MAKE SURE THAT THE BEGINNING IS BEFORE (LESS THAN) THE END.   *DPKCS036
147200*----------------------------------------------------------------*DPKCS036
147300 3400-CHECK-RANGE-SEQUENCE.                                       DPKCS036
147400                                                                  DPKCS036
147500     IF  ASC-START-OF-SELECTED-RANGE > ZERO                       DPKCS036
147600       AND  ASC-END-OF-SELECTED-RANGE > ZERO                      DPKCS036
147700       AND  ASC-START-OF-SELECTED-RANGE >                         DPKCS036
147800                                         ASC-END-OF-SELECTED-RANGEDPKCS036
147900*---------- END-OF-RANGE BEFORE BEGINNING-OF-RANGE                DPKCS036
148000         MOVE PC-TSYMSG-00052 TO DP020-MSG-NUMBER                 DPKCS036
148100         SET DP020-MSG-FATAL TO TRUE                              DPKCS036
148200         SET PS-ERROR TO TRUE                                     DPKCS036
148300         PERFORM 3410-POSITION-AT-ERROR                           DPKCS036
148400     END-IF.                                                      DPKCS036
148500                                                                  DPKCS036
148600 EJECT                                                            DPKCS036
148700*----------------------------------------------------------------*DPKCS036
148800*  BECAUSE RANGES CAN SPAN ACROSS MULTIPLE PAGES, A SEPARATE     *DPKCS036
148900*  PARAGRAPH (THIS ONE) IS NEEDED TO DETERMINE WHERE THE CURSOR  *DPKCS036
149000*  SHOULD BE POSITIONED ON A RANGE ERROR.                        *DPKCS036
149100*----------------------------------------------------------------*DPKCS036
149200 3410-POSITION-AT-ERROR.                                          DPKCS036
149300                                                                  DPKCS036
149400     SET DP030-SET-CURSOR-APPL-1                                  DPKCS036
149500                                   TO TRUE.                       DPKCS036
149600     COMPUTE PV-SUB = ASC-START-OF-SELECTED-RANGE                 DPKCS036
149700                    - PV-TOP-ITEM + 1.                            DPKCS036
149800     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      DPKCS036
149900         CONTINUE                                                 DPKCS036
150000     ELSE                                                         DPKCS036
150100         MOVE -1                   TO MR-SELECTL (PV-SUB)         DPKCS036
150200         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         DPKCS036
150300         MOVE DP015-RED            TO MR-SELECTC (PV-SUB)         DPKCS036
150400     END-IF.                                                      DPKCS036
150500*                                                                 DPKCS036
150600     COMPUTE PV-SUB = ASC-END-OF-SELECTED-RANGE                   DPKCS036
150700                    - PV-TOP-ITEM + 1.                            DPKCS036
150800     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      DPKCS036
150900         CONTINUE                                                 DPKCS036
151000     ELSE                                                         DPKCS036
151100         MOVE -1                   TO MR-SELECTL (PV-SUB)         DPKCS036
151200         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         DPKCS036
151300         MOVE DP015-RED            TO MR-SELECTC (PV-SUB)         DPKCS036
151400     END-IF.                                                      DPKCS036
151500                                                                  DPKCS036
151600 EJECT                                                            DPKCS036
151700*----------------------------------------------------------------*DPKCS036
151800*    WHENEVER THE USER SELECTS AN ITEM AS THE BEGINNING RANGE    *DPKCS036
151900*    AND ONE AS THE ENDING RANGE, MARK THESE ITEMS AS WELL AS    *DPKCS036
152000*    THOSE THAT FALL IN THE RANGE AS BEING SELECTED.             *DPKCS036
152100*----------------------------------------------------------------*DPKCS036
152200 3500-MARK-RANGE-AS-SELECTED.                                     DPKCS036
152300                                                                  DPKCS036
152400     MOVE +1                       TO  ASC-BLK-SUB.               DPKCS036
152500     PERFORM 3510-MARK-SELECTED-INDS                              DPKCS036
152600         VARYING ASC-ITEM-SUB                                     DPKCS036
152700         FROM 1 BY 1                                              DPKCS036
152800         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 DPKCS036
152900                                                                  DPKCS036
153000     ADD +1                        TO ASC-BLK-SUB.                DPKCS036
153100     PERFORM 3510-MARK-SELECTED-INDS                              DPKCS036
153200         VARYING ASC-ITEM-SUB                                     DPKCS036
153300         FROM 1 BY 1                                              DPKCS036
153400         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 DPKCS036
153500                                                                  DPKCS036
153600     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               DPKCS036
153700                                   TO  PV-LIST-ITEM-NUMBER.       DPKCS036
153800     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            DPKCS036
153900         1 + ((PV-LIST-ITEM-NUMBER - 1) /                         DPKCS036
154000               PC-ITEMS-PER-PANEL).                               DPKCS036
154100                                                                  DPKCS036
154200     MOVE ASC-START-OF-SELECTED-RANGE                             DPKCS036
154300                                   TO PV-START-OF-SELECTED-RANGE. DPKCS036
154400     COMPUTE PV-FIRST-BLOCK-IN-RANGE =                            DPKCS036
154500         1 + ((PV-START-OF-SELECTED-RANGE - 1) /                  DPKCS036
154600               PC-ITEMS-PER-PANEL).                               DPKCS036
154700                                                                  DPKCS036
154800     MOVE ASC-END-OF-SELECTED-RANGE                               DPKCS036
154900                                   TO  PV-END-OF-SELECTED-RANGE.  DPKCS036
155000     COMPUTE PV-LAST-BLOCK-IN-RANGE =                             DPKCS036
155100         1 + ((PV-END-OF-SELECTED-RANGE - 1) /                    DPKCS036
155200               PC-ITEMS-PER-PANEL).                               DPKCS036
155300     COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                             DPKCS036
155400         PV-FIRST-BLOCK-IN-ARRAY + 1.                             DPKCS036
155500                                                                  DPKCS036
155600     IF (PV-FIRST-BLOCK-IN-RANGE < PV-FIRST-BLOCK-IN-ARRAY) OR    DPKCS036
155700        (PV-LAST-BLOCK-IN-RANGE  > PV-NEXT-BLOCK-IN-ARRAY)        DPKCS036
155800         MOVE +1                   TO ASC-BLK-SUB                 DPKCS036
155900         PERFORM 5100-WRITE-TEMP-STORAGE                          DPKCS036
156000         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         DPKCS036
156100             PV-FIRST-BLOCK-IN-ARRAY - 1                          DPKCS036
156200                                                                  DPKCS036
156300         PERFORM                                                  DPKCS036
156400             UNTIL PV-FIRST-BLOCK-IN-RANGE >                      DPKCS036
156500                   PV-PREV-BLOCK-IN-ARRAY                         DPKCS036
156600             MOVE PV-FIRST-BLOCK-IN-RANGE                         DPKCS036
156700                                   TO PV-BLOCK-NUMBER             DPKCS036
156800             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
156900             PERFORM 3510-MARK-SELECTED-INDS                      DPKCS036
157000                 VARYING ASC-ITEM-SUB                             DPKCS036
157100                 FROM 1 BY 1                                      DPKCS036
157200                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          DPKCS036
157300             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
157400             ADD +1                TO PV-FIRST-BLOCK-IN-RANGE     DPKCS036
157500         END-PERFORM                                              DPKCS036
157600                                                                  DPKCS036
157700         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         DPKCS036
157800             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     DPKCS036
157900         PERFORM                                                  DPKCS036
158000             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       DPKCS036
158100                   PV-LAST-BLOCK-IN-RANGE                         DPKCS036
158200             MOVE PV-NEXT-BLOCK-IN-ARRAY                          DPKCS036
158300                                   TO PV-BLOCK-NUMBER             DPKCS036
158400             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
158500             PERFORM 3510-MARK-SELECTED-INDS                      DPKCS036
158600                 VARYING ASC-ITEM-SUB                             DPKCS036
158700                 FROM 1 BY 1                                      DPKCS036
158800                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          DPKCS036
158900             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
159000             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      DPKCS036
159100         END-PERFORM                                              DPKCS036
159200                                                                  DPKCS036
159300         MOVE PV-FIRST-BLOCK-IN-ARRAY                             DPKCS036
159400                                   TO PV-BLOCK-NUMBER             DPKCS036
159500         PERFORM 4410-READ-TEMP-STORAGE                           DPKCS036
159600     END-IF.                                                      DPKCS036
159700                                                                  DPKCS036
159800     MOVE +0                       TO ASC-START-OF-SELECTED-RANGE DPKCS036
159900                                      ASC-END-OF-SELECTED-RANGE.  DPKCS036
160000                                                                  DPKCS036
160100 EJECT                                                            DPKCS036
160200*----------------------------------------------------------------*DPKCS036
160300* SET THE SELECTION INDICATOR TO 'S' WITHIN THE RANGE.           *DPKCS036
160400*----------------------------------------------------------------*DPKCS036
160500 3510-MARK-SELECTED-INDS.                                         DPKCS036
160600                                                                  DPKCS036
160700     IF (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                         DPKCS036
160800                                ASC-ITEM-SUB) >                   DPKCS036
160900         ASC-START-OF-SELECTED-RANGE)                             DPKCS036
161000     OR (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                         DPKCS036
161100                                ASC-ITEM-SUB) =                   DPKCS036
161200         ASC-START-OF-SELECTED-RANGE)                             DPKCS036
161300                                                                  DPKCS036
161400         IF (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                     DPKCS036
161500                                    ASC-ITEM-SUB) <               DPKCS036
161600             ASC-END-OF-SELECTED-RANGE)                           DPKCS036
161700         OR (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                     DPKCS036
161800                                    ASC-ITEM-SUB) =               DPKCS036
161900             ASC-END-OF-SELECTED-RANGE)                           DPKCS036
162000                                                                  DPKCS036
162100             IF NOT ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          DPKCS036
162200                 SET ASC-SELECT     (ASC-BLK-SUB  ASC-ITEM-SUB)   DPKCS036
162300                     ASC-TEMP-SELECT(ASC-BLK-SUB  ASC-ITEM-SUB)   DPKCS036
162400                               TO TRUE                            DPKCS036
162500                 SET ASC-BLOCK-MODIFIED(ASC-BLK-SUB)              DPKCS036
162600                               TO TRUE                            DPKCS036
162700                 ADD +1        TO ASC-NUMBER-OF-SELECTED-ITEMS    DPKCS036
162800             END-IF                                               DPKCS036
162900         END-IF                                                   DPKCS036
163000     END-IF.                                                      DPKCS036
163100                                                                  DPKCS036
163200 EJECT                                                            DPKCS036
163300*----------------------------------------------------------------*DPKCS036
163400*    INITIALIZE BOTH BLOCKS IN THE ARRAY.                        *DPKCS036
163500*    INITIALIZE ALL COUNTERS AND FLAGS.                          *DPKCS036
163600*    READ THE DATA BASE FOR THE 1ST TIME AND FILL UP THE ARRAY.  *DPKCS036
163700*    DISPLAY THE PANEL TO USER.                                  *DPKCS036
163800*----------------------------------------------------------------*DPKCS036
163900 4000-BUILD-INITIAL-PANEL.                                        DPKCS036
164000                                                                  DPKCS036
164100     INITIALIZE                 ASC-BLOCK-ENTRIES (1)             DPKCS036
164200                                ASC-BLOCK-ENTRIES (2)             DPKCS036
164300     MOVE +1                 TO ASC-BLK-SUB.                      DPKCS036
164400     SET ASC-ITEMS-LEFT-ON-DB                                     DPKCS036
164500                             TO TRUE.                             DPKCS036
164600                                                                  DPKCS036
164700     MOVE +0                 TO ASC-ITEM-SUB                      DPKCS036
164800                                ASC-NUMBER-OF-ITEMS-READ          DPKCS036
164900                                ASC-NUMBER-OF-SELECTED-ITEMS      DPKCS036
165000                                ASC-HIGHEST-BLOCK-WRITTEN         DPKCS036
165100                                ASC-START-OF-SELECTED-RANGE       DPKCS036
165200                                ASC-END-OF-SELECTED-RANGE         DPKCS036
165300                                ASC-ITEM-AT-TOP-OF-PANEL.         DPKCS036
165400                                                                  DPKCS036
166200     PERFORM 4300-READ-ITEMS-FROM-DB.                                     
166210                                                                  DPKCS036
166500     MOVE +1                   TO  PV-TOP-ITEM.                   DPKCS036
166600     IF  ASC-NUMBER-OF-ITEMS-READ = ZERO                          DPKCS036
166700         SET DP020-NEXT-ACT-APPL-ERROR TO TRUE                    DPKCS036
166800         SET DP020-MSG-FATAL   TO  TRUE                           DPKCS036
166900         MOVE PC-TSYMSG-00050  TO  DP020-MSG-NUMBER               DPKCS036
167000     ELSE                                                         DPKCS036
167100         MOVE -1               TO MR-SELECTL (1)                  DPKCS036
167200         SET DP030-SET-CURSOR-APPL-1                              DPKCS036
167300                               TO TRUE                            DPKCS036
167400         PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                     DPKCS036
167500     END-IF.                                                      DPKCS036
167600                                                                  DPKCS036
167700 EJECT                                                            DPKCS036
175500*----------------------------------------------------------------*DPKCS036
175600*   OPEN THE VENDOR STYLE CURSOR.                                *DPKCS036
175700*----------------------------------------------------------------*DPKCS036
175800 4030-OPEN-VS-CURSOR.                                             DPKCS036
175900                                                                  DPKCS036
176000     PERFORM                                                      DPKCS036
176100         WITH TEST AFTER                                          DPKCS036
176200         VARYING PV-RETRY-COUNTER                                 DPKCS036
176300         FROM 1 BY 1                                              DPKCS036
176400         UNTIL ((PV-RETRY-COUNTER > PC-MAX-RETRIES)               DPKCS036
176500                   OR (SQLCODE = ZERO))                           DPKCS036
176600         MOVE 'CURSOR:  VS-CSR'    TO DP013-MESSAGE-TEXT (2)      DPKCS036
176700                                                                  DPKCS036
176800         EXEC SQL                                                 DPKCS036
176900              OPEN VS-CSR                                         DPKCS036
177000         END-EXEC                                                 DPKCS036
177100                                                                  DPKCS036
177200         EVALUATE TRUE                                            DPKCS036
177300             WHEN SQLCODE = ZERO                                  DPKCS036
177400             WHEN SQLCODE = -904                                  DPKCS036
177500             WHEN SQLCODE = -913                                  DPKCS036
177600                 CONTINUE                                         DPKCS036
177700             WHEN SQLWARN0 NOT = SPACES                           DPKCS036
177800             WHEN SQLCODE < ZERO                                  DPKCS036
177900             WHEN SQLCODE > ZERO                                  DPKCS036
178000                 MOVE '4030-OPEN-VS-CURSOR'                       DPKCS036
178100                                   TO DP013-PARAGRAPH             DPKCS036
178200                 MOVE 'OPEN VENDOR STYLE CURSOR - '               DPKCS036
178300                                   TO DP013-MESSAGE-TEXT (1)      DPKCS036
178400                 MOVE SQLCA        TO DP013-SQLCA                 DPKCS036
178500                 MOVE 'TSYMSG  '   TO DP013-DB2-TABLE-NAME (1)    DPKCS036
178600                 SET DP013-DB2-ABEND                              DPKCS036
178700                     DP013-XCTL-DISPLAY-RESTART TO TRUE           DPKCS036
178800                 PERFORM DP013-0000-PROCESS-ABEND                 DPKCS036
178900         END-EVALUATE                                             DPKCS036
179000     END-PERFORM.                                                 DPKCS036
179100*                                                                 DPKCS036
179200     IF  PV-RETRY-COUNTER > PC-MAX-RETRIES                        DPKCS036
179300         MOVE '4030-OPEN-VS-CURSOR'   TO DP013-PARAGRAPH          DPKCS036
179400         MOVE 'MAXIMUM RETRIES EXCEEDED ATTEMPTING TO OPEN CSR'   DPKCS036
179500                                   TO DP013-MESSAGE-TEXT (1)      DPKCS036
179600         MOVE SQLCA                TO DP013-SQLCA                 DPKCS036
179700         MOVE 'TSYMSG  '           TO DP013-DB2-TABLE-NAME (1)    DPKCS036
179800         SET DP013-DB2-ABEND                                      DPKCS036
179900             DP013-XCTL-DISPLAY-RESTART                           DPKCS036
180000                                   TO TRUE                        DPKCS036
180100         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
180200     END-IF.                                                      DPKCS036
180300                                                                  DPKCS036
180400 EJECT                                                            DPKCS036
180500*----------------------------------------------------------------*DPKCS036
180600*   CLOSE THE VENDOR STYLE CURSOR.                               *DPKCS036
180700*----------------------------------------------------------------*DPKCS036
180800 4040-CLOSE-VS-CURSOR.                                            DPKCS036
180900                                                                  DPKCS036
181000     EXEC SQL                                                     DPKCS036
181100          CLOSE VS-CSR                                            DPKCS036
181200     END-EXEC.                                                    DPKCS036
181300*                                                                 DPKCS036
181400     EVALUATE TRUE                                                DPKCS036
181500         WHEN SQLCODE = ZERO                                      DPKCS036
181600             CONTINUE                                             DPKCS036
181700         WHEN SQLWARN0 NOT = SPACES                               DPKCS036
181800         WHEN SQLCODE < ZERO                                      DPKCS036
181900         WHEN SQLCODE > ZERO                                      DPKCS036
182000             MOVE '4040-CLOSE-VS-CURSOR'                          DPKCS036
182100                               TO DP013-PARAGRAPH                 DPKCS036
182200             MOVE 'CLOSE VS CURSOR '                              DPKCS036
182300                               TO DP013-MESSAGE-TEXT (1)          DPKCS036
182400             MOVE SQLCA        TO DP013-SQLCA                     DPKCS036
182500             MOVE 'TSYMSG  '   TO DP013-DB2-TABLE-NAME (1)        DPKCS036
182600             SET DP013-DB2-ABEND                                  DPKCS036
182700                 DP013-XCTL-DISPLAY-RESTART TO TRUE               DPKCS036
182800             PERFORM DP013-0000-PROCESS-ABEND                     DPKCS036
182900     END-EVALUATE.                                                DPKCS036
183000                                                                  DPKCS036
183100 EJECT                                                            DPKCS036
198600*----------------------------------------------------------------*DPKCS036
198700*    READ THE ITEMS FROM THE DATA BASE AND MOVE THEM INTO THE    *DPKCS036
198800*    BLOCKS IN THE ARRAY.  WHENEVER BOTH BLOCKS BECOME FULL,     *DPKCS036
198900*    WRITE OUT THE 1ST BLOCK TO TEMPORARY STORAGE, MOVE THE 2ND  *DPKCS036
199000*    BLOCK IN THE ARRAY TO THE 1ST BLOCK, AND INITIALIZE THE     *DPKCS036
199100*    2ND BLOCK MAKING IT AVAILABLE TO BE USED.                   *DPKCS036
199200*                                                                *DPKCS036
199300*    DUE TO THE SIZE OF THE TABLE, AND THE ORDER IN WHICH THE    *DPKCS036
199400*    ROWS ARE SORTED, THE ENTIRE TABLE IS READ INTO THE PROGRAM  *DPKCS036
199500*    UPON INITIALIZATION.                                        *DPKCS036
199600*----------------------------------------------------------------*DPKCS036
199700 4300-READ-ITEMS-FROM-DB.                                         DPKCS036
199800                                                                  DPKCS036
203600     IF ASC-ITEMS-LEFT-ON-DB                                      DPKCS036
203800        PERFORM 4030-OPEN-VS-CURSOR                               DPKCS036
203900                                                                  DPKCS036
204000        PERFORM                                                   DPKCS036
204100           VARYING PV-READ-COUNT                                  DPKCS036
204200           FROM 1 BY 1                                            DPKCS036
204300           UNTIL ((PV-READ-COUNT > PC-MAX-ITEMS)                  DPKCS036
204400             OR (ASC-NO-ITEMS-LEFT-ON-DB))                        DPKCS036
204600                                                                  DPKCS036
204700           PERFORM 4330-FETCH-VS                                  DPKCS036
204800                                                                  DPKCS036
204900           IF  PV-READ-COUNT = 1 AND                              DPKCS036
205000               ASC-NO-ITEMS-LEFT-ON-DB                            DPKCS036
205100                                                                  DPKCS036
205200               PERFORM 4500-INCR-ASC-COMM-AREA                    DPKCS036
205300                                                                  DPKCS036
205400               MOVE ASC-KEY-PO-NO   TO  ASC-PO-NBR                DPKCS036
205500                                       (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
205600           END-IF                                                 DPKCS036
205700*                                                                 DPKCS036
205800           IF  ASC-ITEMS-LEFT-ON-DB                               DPKCS036
205810               MOVE XLT00004-VS-NBR TO DK-VS-NO                           
206200           END-IF                                                 DPKCS036
206300                                                                  DPKCS036
208510             IF ASC-ITEMS-LEFT-ON-DB                              DPKCS036
208600                                                                  DPKCS036
208700                PERFORM 4500-INCR-ASC-COMM-AREA                   DPKCS036
208800                                                                  DPKCS036
208900                MOVE ASC-KEY-PO-NO TO  ASC-PO-NBR                 DPKCS036
209000                                       (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
209100*                                                                 DPKCS036
209200                MOVE ASC-KEY-VS-NO TO  ASC-VNDR-STYL              DPKCS036
209300                                       (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
209310                MOVE XLT00006-UPC-NBR TO ASC-UPC-NBR                      
209320                                       (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
209330                MOVE XLT00003-SKU-NBR TO ASC-SKU                  DPKCS036
209340                                       (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
209341                MOVE XLT00003-CSTM-CLOR-DESC TO ASC-COLOR         DPKCS036
209342                                       (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
209343                MOVE XLT00003-SIZE-DESC TO ASC-SIZE               DPKCS036
209344                                       (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
209350                MOVE PURITM-PREPK-RATO-QTY TO ASC-RATIO                   
209360                                       (ASC-BLK-SUB ASC-ITEM-SUB)         
211900             END-IF                                                       
212500        END-PERFORM                                               DPKCS036
212600        IF  ASC-ITEMS-LEFT-ON-DB                                  DPKCS036
212700            PERFORM 4040-CLOSE-VS-CURSOR                          DPKCS036
212800        END-IF                                                    DPKCS036
212900     END-IF.                                                      DPKCS036
213000                                                                  DPKCS036
213010     IF  ASC-NUMBER-OF-ITEMS-READ > ZERO                          DPKCS036
213020         MOVE +1                   TO  ASC-BLK-SUB                DPKCS036
213030         PERFORM 5100-WRITE-TEMP-STORAGE                          DPKCS036
213040         ADD +1                    TO  ASC-BLK-SUB                DPKCS036
213050         PERFORM 5100-WRITE-TEMP-STORAGE                          DPKCS036
213060                                                                  DPKCS036
213070         MOVE 1                    TO  ASC-BLK-SUB                DPKCS036
213080                                       PV-BLOCK-NUMBER            DPKCS036
213090         PERFORM 4410-READ-TEMP-STORAGE                           DPKCS036
213091         IF  ASC-HIGHEST-BLOCK-WRITTEN GREATER THAN 1             DPKCS036
213092             MOVE 2                TO  ASC-BLK-SUB                DPKCS036
213093                                       PV-BLOCK-NUMBER            DPKCS036
213094             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
213095         END-IF                                                   DPKCS036
213096     END-IF.                                                      DPKCS036
213097                                                                  DPKCS036
213100 EJECT                                                            DPKCS036
218300*----------------------------------------------------------------*DPKCS036
218400*    FETCH THE VS CURSOR.                                        *DPKCS036
218500*----------------------------------------------------------------*DPKCS036
218600 4330-FETCH-VS.                                                   DPKCS036
218700                                                                  DPKCS036
218800     EXEC SQL                                                     DPKCS036
218900          FETCH VS-CSR                                            DPKCS036
219000          INTO  :PURITM-PREPK-RATO-QTY                            DPKCS036
219010              , :XLT00003-CSTM-CLOR-DESC                                  
219011              , :XLT00003-SIZE-DESC                                       
219040              , :XLT00003-SKU-NBR                                         
219050              , :XLT00004-VS-NBR                                          
219060              , :XLT00006-UPC-NBR                                         
219100     END-EXEC.                                                    DPKCS036
219200                                                                  DPKCS036
219300     EVALUATE TRUE                                                DPKCS036
219400         WHEN SQLCODE = ZERO                                      DPKCS036
219500         WHEN SQLCODE = +100                                      DPKCS036
219600              CONTINUE                                            DPKCS036
219700         WHEN SQLWARN0 NOT = SPACE                                DPKCS036
219800         WHEN SQLCODE NOT = ZERO                                  DPKCS036
219900              MOVE '4330-FETCH-VS'                                DPKCS036
220000                               TO DP013-PARAGRAPH                 DPKCS036
220100              MOVE 'FETCH VS CURSOR'                              DPKCS036
220200                               TO DP013-MESSAGE-TEXT (1)          DPKCS036
220300              MOVE SQLCA       TO DP013-SQLCA                     DPKCS036
220400              SET DP013-DB2-ABEND                                 DPKCS036
220500                               TO TRUE                            DPKCS036
220600              PERFORM DP013-0000-PROCESS-ABEND                    DPKCS036
220700     END-EVALUATE.                                                DPKCS036
220800                                                                  DPKCS036
220900     IF  SQLCODE EQUAL +100                                       DPKCS036
221000         SET ASC-NO-ITEMS-LEFT-ON-DB TO TRUE                      DPKCS036
221200     ELSE                                                         DPKCS036
221300         IF  SQLCODE EQUAL +0                                     DPKCS036
221310             MOVE XLT00004-VS-NBR  TO ASC-KEY-VS-NO                       
221500                                      DK-VS-NO                    DPKCS036
221600         END-IF                                                   DPKCS036
221700     END-IF.                                                      DPKCS036
221800                                                                  DPKCS036
221900 EJECT                                                            DPKCS036
229300*----------------------------------------------------------------*DPKCS036
229400*      FORMAT THE DB2 DATE TO MM/DD/YY.                          *DPKCS036
229500*----------------------------------------------------------------*DPKCS036
229600 4390-FORMAT-DATE.                                                DPKCS036
229700                                                                  DPKCS036
229800     MOVE PV-DB-MM          TO  PV-DD-MM.                         DPKCS036
229900     MOVE PV-DB-DD          TO  PV-DD-DD.                         DPKCS036
230000     MOVE PV-DB-YY          TO  PV-DD-YY.                         DPKCS036
230100                                                                  DPKCS036
230200 EJECT                                                            DPKCS036
230300*----------------------------------------------------------------*DPKCS036
230400* MOVE THE DISPLAYED FIELDS FROM THE COMMAREA TO THE SCREEN.     *DPKCS036
230500*----------------------------------------------------------------*DPKCS036
230600 4400-MOVE-COMMAREA-TO-SCREEN.                                    DPKCS036
230700                                                                  DPKCS036
230800     IF  (((PV-TOP-ITEM > ASC-LIST-ITEM-NUMBER (1 1))             DPKCS036
230900         AND (PV-TOP-ITEM > ASC-LIST-ITEM-NUMBER (2 1)))          DPKCS036
231000         OR  (PV-TOP-ITEM < ASC-LIST-ITEM-NUMBER (1 1)))          DPKCS036
231100             MOVE +1    TO ASC-BLK-SUB                            DPKCS036
231200             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
231300             ADD +1     TO ASC-BLK-SUB                            DPKCS036
231400             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
231500             DIVIDE PV-TOP-ITEM BY PC-ITEMS-PER-PANEL             DPKCS036
231600                 GIVING PV-BLOCK-NUMBER                           DPKCS036
231700                 REMAINDER PV-REMAINDER                           DPKCS036
231800             IF  PV-REMAINDER > ZERO                              DPKCS036
231900                 ADD +1 TO PV-BLOCK-NUMBER                        DPKCS036
232000             END-IF                                               DPKCS036
232100             MOVE +1    TO ASC-BLK-SUB                            DPKCS036
232200             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
232300             ADD +1     TO ASC-BLK-SUB                            DPKCS036
232400                           PV-BLOCK-NUMBER                        DPKCS036
232500             PERFORM 4410-READ-TEMP-STORAGE                       DPKCS036
232600     END-IF.                                                      DPKCS036
232700     MOVE +1            TO ASC-BLK-SUB.                           DPKCS036
232800     COMPUTE ASC-ITEM-SUB =                                       DPKCS036
232900         ((PV-TOP-ITEM - ASC-LIST-ITEM-NUMBER (1 1))              DPKCS036
233000         + PC-ITEMS-PER-PANEL).                                   DPKCS036
233100*                                                                 DPKCS036
233200     IF  ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                        DPKCS036
233300         ADD +1         TO ASC-BLK-SUB                            DPKCS036
233400         SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-SUB            DPKCS036
233500     END-IF.                                                      DPKCS036
233600*                                                                 DPKCS036
233700     COMPUTE ASC-ITEM-AT-BOT-OF-PANEL =                           DPKCS036
233800         ((PV-TOP-ITEM + PC-ITEMS-PER-PANEL) - 1).                DPKCS036
233900     PERFORM 4430-CHECK-FOR-BEGIN-AND-END.                        DPKCS036
234000     PERFORM 4420-FORMAT-LIST-LINES                               DPKCS036
234100         VARYING PV-SUB                                           DPKCS036
234200         FROM PC-ITEMS-PER-PANEL BY -1                            DPKCS036
234300         UNTIL PV-SUB < +1.                                       DPKCS036
234400*                                                                 DPKCS036
234500     COMPUTE ASC-ITEMS-DISPLAYED =                                DPKCS036
234600         ((ASC-ITEM-AT-BOT-OF-PANEL - PV-TOP-ITEM) + 1).          DPKCS036
234700     PERFORM 4401-SELECT-CONTAINER-DETAILS.                       DPKCS036
234800     PERFORM 4402-MOVE-CONTNR-DTLS-TO-SCR.                        DPKCS036
234830     PERFORM 4460-MOVE-PO-DETAILS-TO-SCR.                                 
234840                                                                          
234900*                                                                 DPKCS036
235000     MOVE PV-TOP-ITEM              TO ASC-ITEM-AT-TOP-OF-PANEL    DPKCS036
235100                                      ASTRTITO.                   DPKCS036
235200     MOVE ASC-ITEM-AT-BOT-OF-PANEL TO AENDITO.                    DPKCS036
235300     MOVE ASC-NUMBER-OF-ITEMS-READ TO ATOTITO.                    DPKCS036
235400     MOVE ASC-NUMBER-OF-SELECTED-ITEMS                            DPKCS036
235500                                   TO ASELITO.                    DPKCS036
235600                                                                          
235800     IF  DP020-MSG-NUMBER-X = SPACE                               DPKCS036
235900         IF  ASC-ITEM-AT-BOT-OF-PANEL < ASC-NUMBER-OF-ITEMS-READ  DPKCS036
236000*---------------- MORE ITEMS TO DISPLAY ----                      DPKCS036
236100             MOVE PC-TSYMSG-00279  TO DP020-MSG-NUMBER            DPKCS036
236200             SET DP020-MSG-INFORMATIONAL TO TRUE                  DPKCS036
236300         END-IF                                                   DPKCS036
236400     END-IF.                                                      DPKCS036
236500                                                                  DPKCS036
236600 EJECT                                                            DPKCS036
236700*----------------------------------------------------------------*DPKCS036
236800*    SELECT CONTAINER DETAILS FROM TIMCNTK                       *DPKCS036
236900*----------------------------------------------------------------*DPKCS036
237000 4401-SELECT-CONTAINER-DETAILS.                                   DPKCS036
237100                                                                  DPKCS036
237200     EXEC SQL                                                     DPKCS036
237300        SELECT  A.CONTNR_ID                                       DPKCS036
237500              , A.MOM_IMPRT_TRIP_ID                               DPKCS036
237600              , A.MOM_DPRTR_TMST                                  DPKCS036
237700              , A.MOM_POE_DELY_TMST                               DPKCS036
237800              , A.MOM_CARR_SCAC_ID                                DPKCS036
237900              , A.CONSLR_SCAC_ID                                  DPKCS036
238000              , A.MOM_FOB_CDE                                     DPKCS036
238100              , A.MOM_IMPRT_VEH_NM                                DPKCS036
238200              , A.MOM_TRIP_TYP_CDE                                DPKCS036
238300              , A.MOM_DEST_POE_CDE                                DPKCS036
238400              , A.FDR_IMPRT_TRIP_ID                               DPKCS036
238500              , A.FDR_DPRTR_TMST                                  DPKCS036
238600              , A.FDR_FOB_CDE                                     DPKCS036
238700              , A.FDR_IMPRT_VEH_NM                                DPKCS036
238800              , A.FDR_TRIP_TYP_CDE                                DPKCS036
238900              , A.SIZE_CDE                                        DPKCS036
239000              , A.CART_CNT                                        DPKCS036
239100              , A.CBMT_QTY                                        DPKCS036
239200              , A.WT_KGRM_QTY                                     DPKCS036
239300              , A.UNT_QTY                                         DPKCS036
239600              , A.ORGN_SHPD_FR_CDE                                DPKCS036
239700              , A.ORGN_SHPD_TO_CDE                                DPKCS036
239800              , A.EST_LBD_NM                                      DPKCS036
239900              , A.EST_LBD_TMST                                    DPKCS036
239910              , A.MOM_POL_CDE                                             
239920              , A.FDR_POL_CDE                                             
239930              , A.MOM_POR_CDE                                             
239940              , A.FDR_POR_CDE                                             
240000        INTO  :IMCNTK-CONTNR-ID                                   DPKCS036
240200            , :IMCNTK-MOM-IMPRT-TRIP-ID                           DPKCS036
240300            , :IMCNTK-MOM-DPRTR-TMST                              DPKCS036
240400            , :IMCNTK-MOM-POE-DELY-TMST                           DPKCS036
240500            , :IMCNTK-MOM-CARR-SCAC-ID                            DPKCS036
240600            , :IMCNTK-CONSLR-SCAC-ID                              DPKCS036
240700            , :IMCNTK-MOM-FOB-CDE                                 DPKCS036
240800            , :IMCNTK-MOM-IMPRT-VEH-NM                            DPKCS036
240900            , :IMCNTK-MOM-TRIP-TYP-CDE                            DPKCS036
241000            , :IMCNTK-MOM-DEST-POE-CDE                            DPKCS036
241100            , :IMCNTK-FDR-IMPRT-TRIP-ID                           DPKCS036
241200            , :IMCNTK-FDR-DPRTR-TMST                              DPKCS036
241300            , :IMCNTK-FDR-FOB-CDE                                 DPKCS036
241400            , :IMCNTK-FDR-IMPRT-VEH-NM                            DPKCS036
241500            , :IMCNTK-FDR-TRIP-TYP-CDE                            DPKCS036
241600            , :IMCNTK-SIZE-CDE                                    DPKCS036
241700            , :IMCNTK-CART-CNT                                    DPKCS036
241800            , :IMCNTK-CBMT-QTY                                    DPKCS036
241900            , :IMCNTK-WT-KGRM-QTY                                 DPKCS036
242000            , :IMCNTK-UNT-QTY                                     DPKCS036
242300            , :IMCNTK-ORGN-SHPD-FR-CDE                            DPKCS036
242400            , :IMCNTK-ORGN-SHPD-TO-CDE                            DPKCS036
242500            , :IMCNTK-EST-LBD-NM                                  DPKCS036
242600            , :IMCNTK-EST-LBD-TMST                                DPKCS036
242610            , :IMCNTK-MOM-POL-CDE                                         
242611            , :IMCNTK-FDR-POL-CDE                                         
242612            , :IMCNTK-MOM-POR-CDE                                         
242613            , :IMCNTK-FDR-POR-CDE                                         
242700         FROM  TIMCNTK A                                          DPKCS036
242800         WHERE CONTNR_ID      = :DK-CONTNR-NO                     DPKCS036
242900           AND CONTNR_SEQ_NBR = :DK-CONTNR-SEQ-NO                 DPKCS036
243000     END-EXEC.                                                    DPKCS036
243100                                                                  DPKCS036
243200     EVALUATE TRUE                                                DPKCS036
243300         WHEN SQLCODE = ZERO                                      DPKCS036
243400         WHEN SQLCODE = +100                                      DPKCS036
243500              CONTINUE                                            DPKCS036
243600         WHEN SQLWARN0 NOT = SPACE                                DPKCS036
243700         WHEN SQLCODE NOT = ZERO                                  DPKCS036
243800              MOVE '4401-SELECT-CONTAINER-DETAILS'                DPKCS036
243900                               TO DP013-PARAGRAPH                 DPKCS036
244000              MOVE 'SQL ERROR SELECTING CONTAINER DETAILS'        DPKCS036
244100                               TO DP013-MESSAGE-TEXT (1)          DPKCS036
244200              MOVE SQLCA       TO DP013-SQLCA                     DPKCS036
244300              SET DP013-DB2-ABEND                                 DPKCS036
244400                               TO TRUE                            DPKCS036
244500              PERFORM DP013-0000-PROCESS-ABEND                    DPKCS036
244600     END-EVALUATE.                                                DPKCS036
244700                                                                  DPKCS036
244800 EJECT                                                            DPKCS036
244900*----------------------------------------------------------------*DPKCS036
245000*    MOVE CONTAINER DETAILS TO SCREEN.                           *DPKCS036
245100*----------------------------------------------------------------*DPKCS036
245200 4402-MOVE-CONTNR-DTLS-TO-SCR.                                    DPKCS036
245300                                                                  DPKCS036
245400     MOVE IMCNTK-CONTNR-ID         TO ACNTRNOO.                   DPKCS036
245600     MOVE IMCNTK-MOM-IMPRT-VEH-NM  TO AMOMVSLO                    DPKCS036
245700                                      ASC-KEY-VSL-NAME.           DPKCS036
245800     MOVE IMCNTK-MOM-IMPRT-TRIP-ID TO AMOMVOYO                    DPKCS036
245900                                      ASC-KEY-VOY-NBR.            DPKCS036
246000     MOVE IMCNTK-FDR-IMPRT-VEH-NM  TO AFDRVSLO.                   DPKCS036
246100     MOVE IMCNTK-FDR-IMPRT-TRIP-ID TO AFDRVOYO.                   DPKCS036
246200     MOVE IMCNTK-CBMT-QTY          TO ACBMO.                      DPKCS036
246300     MOVE IMCNTK-CART-CNT          TO ACTNO.                      DPKCS036
246400     MOVE IMCNTK-MOM-CARR-SCAC-ID  TO ACRSCACO.                   DPKCS036
246500     MOVE IMCNTK-CONSLR-SCAC-ID    TO ACNSCACO.                   DPKCS036
246700     MOVE IMCNTK-WT-KGRM-QTY       TO AKGSO.                      DPKCS036
246800     MOVE IMCNTK-SIZE-CDE          TO ASIZEO.                     DPKCS036
247000     MOVE IMCNTK-UNT-QTY           TO AUNITSO.                    DPKCS036
247100     MOVE IMCNTK-ORGN-SHPD-FR-CDE  TO PV-SHPMT-FROM-CDE.          DPKCS036
247200     MOVE IMCNTK-ORGN-SHPD-TO-CDE  TO PV-SHPMT-TO-CDE.            DPKCS036
247300     MOVE PV-SHPMT-TYPE            TO ATYPEO.                     DPKCS036
247400     MOVE IMCNTK-EST-LBD-NM (1:18) TO ALBDO.                      DPKCS036
247500     PERFORM 4403-MOM-FOB-POE-CDE-CHECK.                          DPKCS036
247600     PERFORM 4404-FDR-FOB-CDE-CHECK.                              DPKCS036
247601                                                                          
247604     MOVE IMCNTK-MOM-TRIP-TYP-CDE TO PV-HOLD-TRIP-TYP-CDE.                
247605     MOVE IMCNTK-MOM-POR-CDE TO PV-HOLD-ORGN-CDE.                         
247606     MOVE PC-POR TO PV-HOLD-ORGN-TYP-CDE.                                 
247607     PERFORM 4405-EDIT-ORGN-CDE.                                          
247609     MOVE TRT00010-IMPRT-ORGN-CDE TO PV-DISPLAY-MOM-POR-CDE.              
247610                                                                          
247611     MOVE IMCNTK-MOM-POL-CDE TO PV-HOLD-ORGN-CDE.                         
247612     MOVE PC-POL TO PV-HOLD-ORGN-TYP-CDE.                                 
247613     PERFORM 4405-EDIT-ORGN-CDE.                                          
247614     MOVE TRT00010-IMPRT-ORGN-CDE TO PV-DISPLAY-MOM-POL-CDE.              
247615     IF PV-DISPLAY-MOM-POR-CDE EQUAL SPACES  AND                          
247616        PV-DISPLAY-MOM-POL-CDE EQUAL SPACES                               
247618         MOVE SPACES TO PV-DISPLAY-MOM-ORGN-CDES                          
247619     END-IF                                                               
247620     MOVE PV-DISPLAY-MOM-ORGN-CDES TO AMOMORGO.                           
247621                                                                          
247622     MOVE IMCNTK-FDR-TRIP-TYP-CDE TO PV-HOLD-TRIP-TYP-CDE.                
247623     MOVE IMCNTK-FDR-POR-CDE TO PV-HOLD-ORGN-CDE.                         
247624     MOVE PC-POR TO PV-HOLD-ORGN-TYP-CDE.                                 
247625     PERFORM 4405-EDIT-ORGN-CDE.                                          
247626     MOVE TRT00010-IMPRT-ORGN-CDE TO PV-DISPLAY-FDR-POR-CDE.              
247627                                                                          
247628     MOVE IMCNTK-FDR-POL-CDE TO PV-HOLD-ORGN-CDE.                         
247629     MOVE PC-POL TO PV-HOLD-ORGN-TYP-CDE.                                 
247630     PERFORM 4405-EDIT-ORGN-CDE.                                          
247631     MOVE TRT00010-IMPRT-ORGN-CDE TO PV-DISPLAY-FDR-POL-CDE.              
247632     IF PV-DISPLAY-FDR-POR-CDE EQUAL SPACES  AND                          
247633        PV-DISPLAY-FDR-POL-CDE EQUAL SPACES                               
247635         MOVE SPACES TO PV-DISPLAY-FDR-ORGN-CDES                          
247636     END-IF                                                               
247640     MOVE PV-DISPLAY-FDR-ORGN-CDES TO AFDRORGO.                           
247700*                                                                         
247800     IF IMCNTK-MOM-DPRTR-TMST (1:10)                                      
247900                                   = SPACES OR PC-INIT-DATE       DPKCS036
248000        MOVE SPACES                TO AMOMATDO                    DPKCS036
248100     ELSE                                                         DPKCS036
248200        MOVE IMCNTK-MOM-DPRTR-TMST (1:10)                         DPKCS036
248300                                   TO PV-DATE-BREAK               DPKCS036
248400        PERFORM 4390-FORMAT-DATE                                  DPKCS036
248500        MOVE PV-DATE-DISPLAY       TO AMOMATDO                    DPKCS036
248600     END-IF.                                                      DPKCS036
248700*                                                                 DPKCS036
248800     IF IMCNTK-FDR-DPRTR-TMST (1:10)                              DPKCS036
248900                                   = SPACES OR PC-INIT-DATE       DPKCS036
249000        MOVE SPACES                TO AFDRATDO                    DPKCS036
249100     ELSE                                                         DPKCS036
249200        MOVE IMCNTK-FDR-DPRTR-TMST (1:10)                         DPKCS036
249300                                   TO PV-DATE-BREAK               DPKCS036
249400        PERFORM 4390-FORMAT-DATE                                  DPKCS036
249500        MOVE PV-DATE-DISPLAY       TO AFDRATDO                    DPKCS036
249600     END-IF.                                                      DPKCS036
249700*                                                                 DPKCS036
249800     IF IMCNTK-MOM-POE-DELY-TMST (1:10)                           DPKCS036
249900                                   = SPACES OR PC-INIT-DATE       DPKCS036
250000        MOVE SPACES                TO AETAO                       DPKCS036
250100     ELSE                                                         DPKCS036
250200        MOVE IMCNTK-MOM-POE-DELY-TMST (1:10)                      DPKCS036
250300                                   TO PV-DATE-BREAK               DPKCS036
250400        PERFORM 4390-FORMAT-DATE                                  DPKCS036
250500        MOVE PV-DATE-DISPLAY       TO AETAO                       DPKCS036
250600     END-IF.                                                      DPKCS036
250700*                                                                 DPKCS036
250800     IF IMCNTK-EST-LBD-TMST (1:10)                                DPKCS036
250900                                   = SPACES OR PC-INIT-DATE       DPKCS036
251000        MOVE SPACES                TO AELDO                       DPKCS036
251100     ELSE                                                         DPKCS036
251200        MOVE IMCNTK-EST-LBD-TMST (1:10)                           DPKCS036
251300                                   TO PV-DATE-BREAK               DPKCS036
251400        PERFORM 4390-FORMAT-DATE                                  DPKCS036
251500        MOVE PV-DATE-DISPLAY       TO AELDO                       DPKCS036
251600     END-IF.                                                      DPKCS036
251720                                                                  DPKCS036
251800 EJECT                                                            DPKCS036
251900*----------------------------------------------------------------*DPKCS036
252000*    CHECK TRIP-TYPE-CODE AND MOVE MOM-FOB AND POE CODES.        *DPKCS036
252100*----------------------------------------------------------------*DPKCS036
252200 4403-MOM-FOB-POE-CDE-CHECK.                                      DPKCS036
252300                                                                  DPKCS036
252400     EVALUATE TRUE                                                DPKCS036
252500*        WHEN IMCNTK-MOM-TRIP-TYP-CDE = 'A'                       DPKCS036
252600*             MOVE IMCNTK-MOM-FOB-CDE    TO AMOMFOBO              DPKCS036
252700*             MOVE IMCNTK-MOM-DEST-POE-CDE                        DPKCS036
252900*                                                                 DPKCS036
253000         WHEN IMCNTK-MOM-TRIP-TYP-CDE = 'O' OR 'M' OR 'A'         DPKCS036
253100              PERFORM 4407-SELECT-MOM-FOB-CDE                     DPKCS036
253200              MOVE IMFOB-FOB-CDE         TO AMOMFOBO              DPKCS036
253301              PERFORM 4440-OPEN-POE-CURSOR                                
253302              PERFORM 4444-FETCH-POE-CURSOR                               
253310              PERFORM 4442-CLOSE-POE-CURSOR                               
253400              MOVE IMPOE-POE-CDE         TO APOEO                 DPKCS036
253500                                                                  DPKCS036
253600         WHEN OTHER                                               DPKCS036
253700              MOVE SPACES                TO AMOMFOBO              DPKCS036
253800              MOVE SPACES                TO APOEO                 DPKCS036
253900     END-EVALUATE.                                                DPKCS036
254000                                                                  DPKCS036
254100 EJECT                                                            DPKCS036
254200*----------------------------------------------------------------*DPKCS036
254300*    CHECK TRIP-TYPE-CODE AND MOVE FDR-FOB CODE.                 *DPKCS036
254400*----------------------------------------------------------------*DPKCS036
254500 4404-FDR-FOB-CDE-CHECK.                                          DPKCS036
254600                                                                  DPKCS036
254700     EVALUATE TRUE                                                DPKCS036
254800         WHEN IMCNTK-FDR-TRIP-TYP-CDE = 'A'                       DPKCS036
254900              MOVE IMCNTK-FDR-FOB-CDE TO AFDRFOBO                 DPKCS036
255000                                                                  DPKCS036
255100         WHEN IMCNTK-FDR-TRIP-TYP-CDE = 'O' OR 'M'                DPKCS036
255200              PERFORM 4408-SELECT-FDR-FOB-CDE                     DPKCS036
255300              MOVE IMFOB-FOB-CDE      TO AFDRFOBO                 DPKCS036
255400                                                                  DPKCS036
255500         WHEN OTHER                                               DPKCS036
255600              MOVE SPACES                TO AFDRFOBO              DPKCS036
255700     END-EVALUATE.                                                DPKCS036
255800                                                                  DPKCS036
255900 EJECT                                                            DPKCS036
255910******************************************************************        
255920* EDIT THE POL AND POR ORIGIN CODES.                             *        
255930******************************************************************        
255940 4405-EDIT-ORGN-CDE.                                                      
255950                                                                          
255960     IF PV-HOLD-ORGN-CDE = SPACES                                         
255970         CONTINUE                                                         
255980     ELSE                                                                 
255990         EVALUATE TRUE                                                    
255991             WHEN PV-HOLD-TRIP-TYP-CDE = PC-A                             
255992                 PERFORM 4406-SELECT-ORGN-AIR                             
255994                                                                          
255995             WHEN PV-HOLD-TRIP-TYP-CDE = PC-O                             
255996                 PERFORM 4409-SELECT-ORGN-OCEAN                           
255997                                                                          
255998             WHEN OTHER                                                   
255999                 MOVE SPACES TO TRT00010-IMPRT-ORGN-CDE                   
256002         END-EVALUATE                                                     
256003     END-IF.                                                              
256010                                                                          
256045******************************************************************        
256046* SELECT POL AND POR CODES FOR AIR.                              *        
256047******************************************************************        
256048 4406-SELECT-ORGN-AIR.                                                    
256049                                                                          
256058     EXEC SQL                                                             
256059         SELECT A.IMPRT_ORGN_CDE                                          
256060           INTO  :TRT00010-IMPRT-ORGN-CDE                                 
256061           FROM TRT_IMPRT_ORGN  A                                         
256062          WHERE A.IMPRT_ORGN_CDE = :PV-HOLD-ORGN-CDE                      
256063            AND A.STAT_CDE    =   'A'                                     
256064            AND A.IMPRT_ORGN_TYP_CDE = :PV-HOLD-ORGN-TYP-CDE              
256065     END-EXEC.                                                            
256066                                                                          
256067     EVALUATE TRUE                                                DPKCS036
256068         WHEN SQLCODE = ZERO                                      DPKCS036
256069              CONTINUE                                            DPKCS036
256071         WHEN SQLCODE = +100                                      DPKCS036
256072         WHEN SQLCODE = -811                                      DPKCS036
256073              MOVE  SPACES TO TRT00010-IMPRT-ORGN-CDE                     
256074         WHEN SQLWARN0 NOT = SPACE                                DPKCS036
256075         WHEN SQLCODE NOT = ZERO                                  DPKCS036
256076              MOVE '4406-SELECT-ORGN-AIR'                         DPKCS036
256077                               TO DP013-PARAGRAPH                 DPKCS036
256078              MOVE 'SQL ERROR SELECTING ORIGIN CODE'              DPKCS036
256079                               TO DP013-MESSAGE-TEXT (1)          DPKCS036
256080              MOVE SQLCA       TO DP013-SQLCA                     DPKCS036
256081              SET DP013-DB2-ABEND                                 DPKCS036
256082                               TO TRUE                            DPKCS036
256083              PERFORM DP013-0000-PROCESS-ABEND                    DPKCS036
256084     END-EVALUATE.                                                DPKCS036
256085                                                                  DPKCS036
256130 EJECT                                                                    
256167*----------------------------------------------------------------*DPKCS036
256170*    SELECT MOM FOB CODE FROM TIMFOB.                            *DPKCS036
256200*----------------------------------------------------------------*DPKCS036
256300 4407-SELECT-MOM-FOB-CDE.                                         DPKCS036
256400                                                                  DPKCS036
256500     EXEC SQL                                                     DPKCS036
256600         SELECT DISTINCT                                          DPKCS036
256700                A.FOB_CDE                                         DPKCS036
256800         INTO   :IMFOB-FOB-CDE                                    DPKCS036
256900         FROM   TIMFOB A                                          DPKCS036
257000         WHERE  A.FOB_STD_EDI_CDE = :IMCNTK-MOM-FOB-CDE           DPKCS036
257100           AND  A.STAT_CDE = 'A'                                  DPKCS036
257200     END-EXEC.                                                    DPKCS036
257300                                                                  DPKCS036
257400     EVALUATE TRUE                                                DPKCS036
257500         WHEN SQLCODE = ZERO                                      DPKCS036
257600              CONTINUE                                            DPKCS036
257700         WHEN SQLCODE = +100                                      DPKCS036
257800         WHEN SQLCODE = -811                                      DPKCS036
257900              MOVE  SPACES         TO IMFOB-FOB-CDE               DPKCS036
258000         WHEN SQLWARN0 NOT = SPACE                                DPKCS036
258100         WHEN SQLCODE NOT = ZERO                                  DPKCS036
258200              MOVE '4407-SELECT-MOM-FOB-CDE'                      DPKCS036
258300                               TO DP013-PARAGRAPH                 DPKCS036
258400              MOVE 'SQL ERROR SELECTING MOM FOB CODE'             DPKCS036
258500                               TO DP013-MESSAGE-TEXT (1)          DPKCS036
258600              MOVE SQLCA       TO DP013-SQLCA                     DPKCS036
258700              SET DP013-DB2-ABEND                                 DPKCS036
258800                               TO TRUE                            DPKCS036
258900              PERFORM DP013-0000-PROCESS-ABEND                    DPKCS036
259000     END-EVALUATE.                                                DPKCS036
259100                                                                  DPKCS036
259200 EJECT                                                            DPKCS036
259300*----------------------------------------------------------------*DPKCS036
259400*    SELECT FDR FOB CODE FROM TIMFOB.                            *DPKCS036
259500*----------------------------------------------------------------*DPKCS036
259600 4408-SELECT-FDR-FOB-CDE.                                         DPKCS036
259700                                                                  DPKCS036
259800     EXEC SQL                                                     DPKCS036
259900         SELECT DISTINCT                                          DPKCS036
260000                A.FOB_CDE                                         DPKCS036
260100         INTO   :IMFOB-FOB-CDE                                    DPKCS036
260200         FROM   TIMFOB A                                          DPKCS036
260300         WHERE  A.FOB_STD_EDI_CDE = :IMCNTK-FDR-FOB-CDE           DPKCS036
260400           AND  A.STAT_CDE = 'A'                                  DPKCS036
260500     END-EXEC.                                                    DPKCS036
260600                                                                  DPKCS036
260700     EVALUATE TRUE                                                DPKCS036
260800         WHEN SQLCODE = ZERO                                      DPKCS036
260900              CONTINUE                                            DPKCS036
261000         WHEN SQLCODE = +100                                      DPKCS036
261100         WHEN SQLCODE = -811                                      DPKCS036
261200              MOVE  SPACES         TO IMFOB-FOB-CDE               DPKCS036
261300         WHEN SQLWARN0 NOT = SPACE                                DPKCS036
261400         WHEN SQLCODE NOT = ZERO                                  DPKCS036
261500              MOVE '4408-SELECT-MOM-FOB-CDE'                      DPKCS036
261600                               TO DP013-PARAGRAPH                 DPKCS036
261700              MOVE 'SQL ERROR SELECTING MOM FOB CODE'             DPKCS036
261800                               TO DP013-MESSAGE-TEXT (1)          DPKCS036
261900              MOVE SQLCA       TO DP013-SQLCA                     DPKCS036
262000              SET DP013-DB2-ABEND                                 DPKCS036
262100                               TO TRUE                            DPKCS036
262200              PERFORM DP013-0000-PROCESS-ABEND                    DPKCS036
262300     END-EVALUATE.                                                DPKCS036
262400                                                                  DPKCS036
262500 EJECT                                                            DPKCS036
262600******************************************************************        
262700* SELECT POL AND POR CODES FOR OCEAN.                            *        
262800******************************************************************        
262900 4409-SELECT-ORGN-OCEAN.                                                  
263000                                                                          
263900     EXEC SQL                                                             
264000         SELECT A.IMPRT_ORGN_CDE                                          
264100          INTO :TRT00010-IMPRT-ORGN-CDE                                   
264200           FROM TRT_IMPRT_ORGN  A                                         
264300          WHERE A.STD_EDI_CDE  = :PV-HOLD-ORGN-CDE                        
264400            AND A.STAT_CDE     = 'A'                                      
264500            AND A.IMPRT_ORGN_TYP_CDE = :PV-HOLD-ORGN-TYP-CDE              
264600     END-EXEC.                                                            
264700                                                                          
264710     EVALUATE TRUE                                                DPKCS036
264720         WHEN SQLCODE = ZERO                                      DPKCS036
264730              CONTINUE                                            DPKCS036
264740         WHEN SQLCODE = +100                                      DPKCS036
264750         WHEN SQLCODE = -811                                      DPKCS036
264760              MOVE  SPACES TO TRT00010-IMPRT-ORGN-CDE                     
264770         WHEN SQLWARN0 NOT = SPACE                                DPKCS036
264780         WHEN SQLCODE NOT = ZERO                                  DPKCS036
264790              MOVE '4409-SELECT-ORGN-OCEAN'                       DPKCS036
264791                               TO DP013-PARAGRAPH                 DPKCS036
264792              MOVE 'SQL ERROR SELECTING ORIGIN CODE'              DPKCS036
264793                               TO DP013-MESSAGE-TEXT (1)          DPKCS036
264794              MOVE SQLCA       TO DP013-SQLCA                     DPKCS036
264795              SET DP013-DB2-ABEND                                 DPKCS036
264796                               TO TRUE                            DPKCS036
264797              PERFORM DP013-0000-PROCESS-ABEND                    DPKCS036
264798     END-EVALUATE.                                                DPKCS036
264799                                                                  DPKCS036
264800 EJECT                                                                    
265720*----------------------------------------------------------------*DPKCS036
265800*    READ A BLOCK FROM TEMPORARY STORAGE INTO THE ARRAY.         *DPKCS036
265900*----------------------------------------------------------------*DPKCS036
266000 4410-READ-TEMP-STORAGE.                                          DPKCS036
266100                                                                  DPKCS036
266200     EXEC CICS                                                    DPKCS036
266300         READQ TS                                                 DPKCS036
266400             QUEUE (ASC-LIST-QUEUE-NAME)                          DPKCS036
266500             INTO  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               DPKCS036
266600             ITEM  (PV-BLOCK-NUMBER)                              DPKCS036
266700             RESP  (PV-CICS-RESP)                                 DPKCS036
266800     END-EXEC.                                                    DPKCS036
266900                                                                  DPKCS036
267000     IF  ((PV-CICS-RESP = DFHRESP (NORMAL))                       DPKCS036
267100       OR (PV-CICS-RESP = DFHRESP (ITEMERR)))                     DPKCS036
267200         CONTINUE                                                 DPKCS036
267300     ELSE                                                         DPKCS036
267400         SET DP013-CICS-ABEND     TO TRUE                         DPKCS036
267500         SET DP013-NO-ROLLBACK    TO TRUE                         DPKCS036
267600         MOVE '4410-READ-TEMP-STORAGE'                            DPKCS036
267700                                  TO DP013-PARAGRAPH              DPKCS036
267800         MOVE 'ERROR TRYING TO READ FROM TEMP STORAGE QUEUE'      DPKCS036
267900                                  TO DP013-MESSAGE-TEXT(1)        DPKCS036
268000         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
268100     END-IF.                                                      DPKCS036
268200                                                                  DPKCS036
268300     SET ASC-BLOCK-NOT-MODIFIED(ASC-BLK-SUB) TO TRUE.             DPKCS036
268400*                                                                 DPKCS036
268500     IF  PV-CICS-RESP = DFHRESP (ITEMERR)                         DPKCS036
268600         INITIALIZE ASC-BLOCK-ENTRIES (ASC-BLK-SUB)               DPKCS036
268700     END-IF.                                                      DPKCS036
268800                                                                  DPKCS036
268900 EJECT                                                            DPKCS036
269000*----------------------------------------------------------------*DPKCS036
269100*    PROCESS THE ITEMS IN THE ARRAY AND MOVE THEM TO THE MAP.    *DPKCS036
269200*----------------------------------------------------------------*DPKCS036
269300 4420-FORMAT-LIST-LINES.                                          DPKCS036
269400                                                                  DPKCS036
269500     IF  ASC-ITEM-AT-BOT-OF-PANEL > ASC-NUMBER-OF-ITEMS-READ      DPKCS036
269600         SUBTRACT +1 FROM ASC-ITEM-AT-BOT-OF-PANEL                DPKCS036
269700         MOVE DP015-ASK-DRK-OFF  TO MR-SELECTA  (PV-SUB)          DPKCS036
269800         MOVE DP015-HL-OFF       TO MR-SELECTH  (PV-SUB)          DPKCS036
269900         MOVE SPACES             TO MR-SELECTI  (PV-SUB)          DPKCS036
270000                                    MR-ACTION   (PV-SUB)          DPKCS036
270100                                    MR-VNDR-STYL (PV-SUB)         DPKCS036
270200                                    MR-COLOR    (PV-SUB)                  
270300                                    MR-SIZE     (PV-SUB)                  
270600                                                                  DPKCS036
270700         MOVE ZEROS              TO MR-SKU      (PV-SUB)          DPKCS036
270710                                    MR-UPC      (PV-SUB)                  
270720                                    MR-RATIO    (PV-SUB)                  
270800     ELSE                                                         DPKCS036
270900         IF  ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)      DPKCS036
271000                                                   > SPACE        DPKCS036
271100             MOVE ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB) DPKCS036
271200                                 TO MR-SELECTI (PV-SUB)           DPKCS036
271300         ELSE                                                     DPKCS036
271400             MOVE ASC-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)      DPKCS036
271500                                 TO MR-SELECTI (PV-SUB)           DPKCS036
271600         END-IF                                                   DPKCS036
271700*                                                                 DPKCS036
271800         IF  DP030-SET-CURSOR-TRAILER                             DPKCS036
271900             IF  ((ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)DPKCS036
272000                 > SPACE)                                         DPKCS036
272100               OR (PV-SUB = 1))                                   DPKCS036
272200                SET DP030-SET-CURSOR-APPL-1 TO TRUE               DPKCS036
272300                MOVE -1          TO MR-SELECTL (PV-SUB)           DPKCS036
272400             END-IF                                               DPKCS036
272500         END-IF                                                   DPKCS036
272600*                                                                 DPKCS036
272700         IF  PV-TOP-ITEM NOT = ASC-ITEM-AT-TOP-OF-PANEL           DPKCS036
272800             MOVE ASC-ACTION   (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
272900                               TO MR-ACTION (PV-SUB)              DPKCS036
273106             MOVE ASC-VNDR-STYL (ASC-BLK-SUB ASC-ITEM-SUB)        DPKCS036
273107                               TO MR-VNDR-STYL (PV-SUB)           DPKCS036
273108             MOVE ASC-COLOR    (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
273109                               TO MR-COLOR (PV-SUB)               DPKCS036
273110             MOVE ASC-SIZE     (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
273111                               TO MR-SIZE (PV-SUB)                DPKCS036
273112             MOVE ASC-SKU      (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
273113                               TO MR-SKU   (PV-SUB)               DPKCS036
273114             MOVE ASC-UPC-NBR  (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
273115                               TO MR-UPC   (PV-SUB)               DPKCS036
273116             MOVE ASC-RATIO    (ASC-BLK-SUB ASC-ITEM-SUB)         DPKCS036
273117                               TO MR-RATIO (PV-SUB)               DPKCS036
273118         END-IF                                                   DPKCS036
274200     END-IF.                                                              
274201*                                                                         
274400     SUBTRACT +1 FROM ASC-ITEM-SUB                                DPKCS036
274500     IF  ASC-ITEM-SUB < + 1                                       DPKCS036
274600         MOVE PC-ITEMS-PER-PANEL TO ASC-ITEM-SUB                  DPKCS036
274700         MOVE +1                 TO ASC-BLK-SUB                   DPKCS036
274800     END-IF.                                                      DPKCS036
274900                                                                  DPKCS036
275000 EJECT                                                            DPKCS036
275100*----------------------------------------------------------------*DPKCS036
275200*  IF A BEGINNING OF RANGE WAS SPECIFIED, MAKE SURE AN END OF    *DPKCS036
275300*  RANGE WAS SPECIFIED AND VICE-VERSA.  IF ONE IS MISSING,       *DPKCS036
275400*  ISSUE A WARNING.                                              *DPKCS036
275500*----------------------------------------------------------------*DPKCS036
275600 4430-CHECK-FOR-BEGIN-AND-END.                                    DPKCS036
275700                                                                  DPKCS036
275800     IF  ASC-START-OF-SELECTED-RANGE > ZERO                       DPKCS036
275900         IF  ASC-END-OF-SELECTED-RANGE = ZERO                     DPKCS036
276000*---------------- NO END-OF-RANGE SPECFIED ---                    DPKCS036
276100             MOVE PC-TSYMSG-00051  TO DP020-MSG-NUMBER            DPKCS036
276200             SET DP020-MSG-WARNING TO TRUE                        DPKCS036
276300             PERFORM 4431-POSITION-AT-WARNING                     DPKCS036
276400         END-IF                                                   DPKCS036
276500     ELSE                                                         DPKCS036
276600         IF  ASC-END-OF-SELECTED-RANGE > ZERO                     DPKCS036
276700*---------------- NO BEGINNING-OF-RANGE SPECFIED ---              DPKCS036
276800             MOVE PC-TSYMSG-00053  TO DP020-MSG-NUMBER            DPKCS036
276900             SET DP020-MSG-WARNING TO TRUE                        DPKCS036
277000             PERFORM 4431-POSITION-AT-WARNING                     DPKCS036
277100         END-IF                                                   DPKCS036
277200     END-IF.                                                      DPKCS036
277300                                                                  DPKCS036
277400 EJECT                                                            DPKCS036
277500*----------------------------------------------------------------*DPKCS036
277600*  ONCE IT HAS BEEN DETERMINED THAT A WARNING IS TO BE ISSUED,   *DPKCS036
277700*  DETERMINE IF EITHER THE BEGINNING OF RANGE OR END OF RANGE    *DPKCS036
277800*  IS ON THE CURRENT SCREEN.  IF IT IS, HIGHLIGHT IT AND         *DPKCS036
277900*  POSITION THE CURSOR THERE.                                    *DPKCS036
278000*----------------------------------------------------------------*DPKCS036
278100 4431-POSITION-AT-WARNING.                                        DPKCS036
278200                                                                  DPKCS036
278300     COMPUTE PV-SUB = ASC-START-OF-SELECTED-RANGE                 DPKCS036
278400                    - PV-TOP-ITEM + 1.                            DPKCS036
278500     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      DPKCS036
278600         CONTINUE                                                 DPKCS036
278700     ELSE                                                         DPKCS036
278800         SET DP030-SET-CURSOR-APPL-1                              DPKCS036
278900                                   TO TRUE                        DPKCS036
279000         MOVE -1                   TO MR-SELECTL (PV-SUB)         DPKCS036
279100         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         DPKCS036
279200         MOVE DP015-YELLOW         TO MR-SELECTC (PV-SUB)         DPKCS036
279300     END-IF.                                                      DPKCS036
279400*                                                                 DPKCS036
279500     COMPUTE PV-SUB = ASC-END-OF-SELECTED-RANGE                   DPKCS036
279600                    - PV-TOP-ITEM + 1.                            DPKCS036
279700     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      DPKCS036
279800         CONTINUE                                                 DPKCS036
279900     ELSE                                                         DPKCS036
280000         SET DP030-SET-CURSOR-APPL-1                              DPKCS036
280100                                   TO TRUE                        DPKCS036
280200         MOVE -1                   TO MR-SELECTL (PV-SUB)         DPKCS036
280300         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         DPKCS036
280400         MOVE DP015-YELLOW         TO MR-SELECTC (PV-SUB)         DPKCS036
280500     END-IF.                                                      DPKCS036
280600                                                                  DPKCS036
280700 EJECT                                                            DPKCS036
280701*----------------------------------------------------------------*        
280702*   OPEN THE POE CODE CURSOR                                     *        
280703*----------------------------------------------------------------*        
280704 4440-OPEN-POE-CURSOR.                                                    
280705                                                                          
280706     PERFORM                                                              
280707         WITH TEST AFTER                                                  
280708         VARYING PV-RETRY-COUNTER                                         
280709         FROM 1 BY 1                                                      
280710         UNTIL ((PV-RETRY-COUNTER > PC-MAX-RETRIES)                       
280711                   OR (SQLCODE = ZERO))                                   
280712                                                                          
280713         MOVE 'CURSOR:  POE-CSR'     TO DP013-MESSAGE-TEXT (2)            
280714                                                                          
280715         EXEC SQL                                                         
280716              OPEN POE-CSR                                                
280717         END-EXEC                                                         
280718                                                                          
280719         EVALUATE TRUE                                                    
280720             WHEN SQLCODE = ZERO                                          
280721             WHEN SQLCODE = -904                                          
280722             WHEN SQLCODE = -913                                          
280723                 CONTINUE                                                 
280724             WHEN SQLWARN0 NOT = SPACES                                   
280725             WHEN SQLCODE < ZERO                                          
280726             WHEN SQLCODE > ZERO                                          
280727                 MOVE '4440-OPEN-POE-CURSOR'                              
280728                                   TO DP013-PARAGRAPH                     
280729                 MOVE 'OPEN POE CURSOR - '                                
280730                                   TO DP013-MESSAGE-TEXT (1)              
280731                 MOVE SQLCA        TO DP013-SQLCA                         
280732                 MOVE 'TIMPOE  '   TO DP013-DB2-TABLE-NAME (1)            
280733                 SET DP013-DB2-ABEND                                      
280734                     DP013-XCTL-DISPLAY-RESTART TO TRUE                   
280735                 PERFORM DP013-0000-PROCESS-ABEND                         
280736         END-EVALUATE                                                     
280737     END-PERFORM.                                                         
280738*                                                                         
280739     IF  PV-RETRY-COUNTER > PC-MAX-RETRIES                                
280740         MOVE '4382-OPEN-POE-CURSOR' TO DP013-PARAGRAPH                   
280741         MOVE 'MAXIMUM RETRIES EXCEEDED ATTEMPTING TO OPEN CSR'           
280742                                   TO DP013-MESSAGE-TEXT (1)              
280743         MOVE SQLCA                TO DP013-SQLCA                         
280744         MOVE 'TIMPOE  '           TO DP013-DB2-TABLE-NAME (1)            
280745         SET DP013-DB2-ABEND                                              
280746             DP013-XCTL-DISPLAY-RESTART                                   
280747                                   TO TRUE                                
280748         PERFORM DP013-0000-PROCESS-ABEND                                 
280749     END-IF.                                                              
280750                                                                          
280751 EJECT                                                                    
280752*----------------------------------------------------------------*        
280753*   CLOSE THE POE CODE CURSOR                                    *        
280754*----------------------------------------------------------------*        
280755 4442-CLOSE-POE-CURSOR.                                                   
280756                                                                          
280757     EXEC SQL                                                             
280758          CLOSE POE-CSR                                                   
280759     END-EXEC.                                                            
280760                                                                          
280761     EVALUATE TRUE                                                        
280762         WHEN SQLCODE = ZERO                                              
280763             CONTINUE                                                     
280764         WHEN SQLWARN0 NOT = SPACES                                       
280765         WHEN SQLCODE < ZERO                                              
280766         WHEN SQLCODE > ZERO                                              
280767             MOVE '4442-CLOSE-POE-CURSOR'                                 
280768                               TO DP013-PARAGRAPH                         
280769             MOVE 'CLOSE POE CURSOR '                                     
280770                               TO DP013-MESSAGE-TEXT (1)                  
280771             MOVE SQLCA        TO DP013-SQLCA                             
280772             MOVE 'TIMPOE  '   TO DP013-DB2-TABLE-NAME (1)                
280773             SET DP013-DB2-ABEND                                          
280774                 DP013-XCTL-DISPLAY-RESTART TO TRUE                       
280775             PERFORM DP013-0000-PROCESS-ABEND                             
280776     END-EVALUATE.                                                        
280777                                                                          
280778 EJECT                                                                    
280779*----------------------------------------------------------------*        
280780*    FETCH THE POE CODE CURSOR                                   *        
280781*----------------------------------------------------------------*        
280782 4444-FETCH-POE-CURSOR.                                                   
280783                                                                          
280784     EXEC SQL                                                             
280785          FETCH POE-CSR                                                   
280786          INTO  :IMPOE-POE-CDE                                            
280787     END-EXEC.                                                            
280788                                                                          
280789     EVALUATE TRUE                                                        
280790         WHEN SQLCODE = ZERO                                              
280791         WHEN SQLCODE = -811                                              
280792              CONTINUE                                                    
280793         WHEN SQLCODE = +100                                              
280794              MOVE SPACES TO IMPOE-POE-CDE                                
280795         WHEN SQLWARN0 NOT = SPACE                                        
280796         WHEN SQLCODE NOT = ZERO                                          
280797              MOVE '4444-FETCH-POE-CURSOR'                                
280798                               TO DP013-PARAGRAPH                         
280799              MOVE 'FETCH POE CURSOR'                                     
280800                               TO DP013-MESSAGE-TEXT (1)                  
280801              MOVE SQLCA       TO DP013-SQLCA                             
280802              SET DP013-DB2-ABEND                                         
280803                               TO TRUE                                    
280804              PERFORM DP013-0000-PROCESS-ABEND                            
280805     END-EVALUATE.                                                        
280806                                                                          
280807 EJECT                                                                    
280888*----------------------------------------------------------------*DPKCS036
280889*    MOVE PO PACK DETAILS TO SCREEN.                             *DPKCS036
280890*----------------------------------------------------------------*DPKCS036
280891 4460-MOVE-PO-DETAILS-TO-SCR.                                     DPKCS036
280892                                                                          
280893     MOVE ASC-KEY-PO-NO            TO APONBRO.                            
280894     MOVE ASC-KEY-PACK-CTNS        TO APCKCTNO.                           
280895     MOVE ASC-KEY-PACK-UNITS       TO APCKUNTO.                           
280896     MOVE ASC-KEY-PACK-UPC-NBR     TO APCKUPCO.                           
280897     MOVE ASC-KEY-PACK-SKU         TO APCKSKUO.                           
280898     MOVE ASC-KEY-PKGING-TYP       TO APKGINDO.                           
280899     MOVE ASC-KEY-PO-PREPK-ID      TO APCKIDO.                            
280900     MOVE ASC-KEY-PREPK-DESC       TO APKDESCO.                           
280901     MOVE ASC-KEY-ASN-PKGING-CDE   TO AASNPKGO.                           
280902                                                                  DPKCS036
280903 EJECT                                                            DPKCS036
280904*----------------------------------------------------------------*DPKCS036
280910*  INCREMENT ASC-COMMAREA                                        *DPKCS036
281000*----------------------------------------------------------------*DPKCS036
281100 4500-INCR-ASC-COMM-AREA.                                         DPKCS036
281200                                                                  DPKCS036
281300     IF  ASC-ITEM-SUB < PC-ITEMS-PER-PANEL                        DPKCS036
281400         ADD +1            TO ASC-ITEM-SUB                        DPKCS036
281500     ELSE                                                         DPKCS036
281600         ADD +1            TO ASC-BLK-SUB                         DPKCS036
281700         MOVE +1           TO ASC-ITEM-SUB                        DPKCS036
281800                                                                  DPKCS036
281900         IF  ASC-BLK-SUB > PC-MAX-BLOCKS-IN-ARRAY                 DPKCS036
282000             MOVE +1       TO ASC-BLK-SUB                         DPKCS036
282100             SET ASC-BLOCK-MODIFIED (1)                           DPKCS036
282200                           TO TRUE                                DPKCS036
282300             PERFORM 5100-WRITE-TEMP-STORAGE                      DPKCS036
282400             MOVE ASC-BLOCK-ENTRIES                               DPKCS036
282500                            (PC-MAX-BLOCKS-IN-ARRAY)              DPKCS036
282600                           TO ASC-BLOCK-ENTRIES(ASC-BLK-SUB)      DPKCS036
282700             ADD +1        TO ASC-BLK-SUB                         DPKCS036
282800             INITIALIZE ASC-BLOCK-ENTRIES (ASC-BLK-SUB)           DPKCS036
282900             SET ASC-BLOCK-NOT-MODIFIED(ASC-BLK-SUB)              DPKCS036
283000                           TO  TRUE                               DPKCS036
283100          END-IF                                                  DPKCS036
283200     END-IF.                                                      DPKCS036
283300     ADD +1                TO  ASC-NUMBER-OF-ITEMS-READ.          DPKCS036
283400     MOVE ASC-NUMBER-OF-ITEMS-READ                                DPKCS036
283500                           TO  ASC-LIST-ITEM-NUMBER               DPKCS036
283600                               (ASC-BLK-SUB ASC-ITEM-SUB).        DPKCS036
283700                                                                  DPKCS036
283800 EJECT                                                            DPKCS036
283900*----------------------------------------------------------------*DPKCS036
284000* PREPARE THE SELECTED ITEMS TEMP STORAGE QUEUE.  MOVE ALL SEL-  *DPKCS036
284100* ECTED ITEMS FROM THE LIST TEMP STORAGE QUEUE TO THE LAYOUT     *DPKCS036
284200* FOR THE SELECTED ITEMS QUEUE.                                  *DPKCS036
284300*                                                                *DPKCS036
284400* FIRST, DELETE THE SELECTION QUEUE, NEXT LOAD THE SELECTION     *DPKCS036
284500* QUEUE RECORD.  FINALLY, WRITE THE SELECTION QUEUE ITEM WHEN    *DPKCS036
284600* THE ARRAY IS FULL.                                             *DPKCS036
284700*----------------------------------------------------------------*DPKCS036
284800*5000-PREPARE-SEL-QUEUE.                                          DPKCS036
284900*                                                                 DPKCS036
285000*    MOVE +1                   TO  ASC-BLK-SUB.                   DPKCS036
285100*    PERFORM 5100-WRITE-TEMP-STORAGE.                             DPKCS036
285200*    ADD +1                    TO  ASC-BLK-SUB.                   DPKCS036
285300*    PERFORM 5100-WRITE-TEMP-STORAGE.                             DPKCS036
285400*    IF ASC-GOTO-SUMMARY                                          DPKCS036
285500*       MOVE ASC-SEL-QUEUE-NAME     TO  TR102-SEL-QUEUE-NAME      DPKCS036
285600*    ELSE                                                         DPKCS036
285820*        IF ASC-GOTO-HISTORY                                              
285830*            MOVE ASC-SEL-QUEUE-NAME TO TR116-SEL-QUEUE-NAME              
285840*        END-IF                                                           
286000*    END-IF.                                                      DPKCS036
286100*    PERFORM 6010-DELETE-SEL-QUEUE.                               DPKCS036
286200*                                                                 DPKCS036
286300*    SET ASC-UPDATE-TSQ        TO  TRUE.                          DPKCS036
286400*                                                                 DPKCS036
286500*    SET TR101-IDX             TO  1.                             DPKCS036
286600*    IF ASC-GOTO-SUMMARY                                          DPKCS036
286700*       MOVE ZERO              TO TR102-NUMBER-OF-TS-ITEMS        DPKCS036
286800*    ELSE                                                         DPKCS036
287020*        IF ASC-GOTO-HISTORY                                              
287030*            MOVE ZERO      TO TR116-NUMBER-OF-TS-ITEMS                   
287040*        END-IF                                                           
287200*    END-IF.                                                      DPKCS036
287300*    INITIALIZE TR101-SELECTED-ITEM-ARRAY.                        DPKCS036
287400*                                                                 DPKCS036
287500*    PERFORM 5200-FILL-SEL-QUEUE-RECORD                           DPKCS036
287600*            VARYING PV-ITEM                                      DPKCS036
287700*            FROM 1 BY 1                                          DPKCS036
287800*            UNTIL PV-ITEM GREATER ASC-HIGHEST-BLOCK-WRITTEN.     DPKCS036
287900*                                                                 DPKCS036
288000*    IF  TR101-IDX > 1                                            DPKCS036
288100*        PERFORM 5205-WRITE-SEL-QUEUE                             DPKCS036
288200*        IF ASC-GOTO-SUMMARY                                      DPKCS036
288300*           ADD +1                 TO TR102-NUMBER-OF-TS-ITEMS    DPKCS036
288400*        ELSE                                                     DPKCS036
288620*            IF ASC-GOTO-HISTORY                                          
288630*                ADD +1         TO TR116-NUMBER-OF-TS-ITEMS               
288640*            END-IF                                                       
288800*        END-IF                                                   DPKCS036
288900*    END-IF.                                                      DPKCS036
289000*                                                                 DPKCS036
289100*EJECT                                                            DPKCS036
289200*----------------------------------------------------------------*DPKCS036
289300*    WRITE A NEW BLOCK FROM THE ARRAY TO TEMPORARY STORAGE.      *DPKCS036
289400*    REWRITE AN EXISITING BLOCK ONLY IF IT HAS BEEN MODIFIED.    *DPKCS036
289500*----------------------------------------------------------------*DPKCS036
289600 5100-WRITE-TEMP-STORAGE.                                         DPKCS036
289700                                                                  DPKCS036
289800     MOVE ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB 1)                     DPKCS036
289900                                   TO PV-LIST-ITEM-NUMBER.        DPKCS036
290000     COMPUTE PV-BLOCK-NUMBER =                                    DPKCS036
290100         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    DPKCS036
290200                                                                  DPKCS036
290300     IF (PV-BLOCK-NUMBER < ASC-HIGHEST-BLOCK-WRITTEN)             DPKCS036
290400     OR (PV-BLOCK-NUMBER = ASC-HIGHEST-BLOCK-WRITTEN)             DPKCS036
290500         IF  ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                      DPKCS036
290600             PERFORM 5105-REWRITE-ASC-LISTQ                       DPKCS036
290700         END-IF                                                   DPKCS036
290800     ELSE                                                         DPKCS036
290900         COMPUTE PV-HIGHEST-BLOCK-WRITTEN =                       DPKCS036
291000         ASC-HIGHEST-BLOCK-WRITTEN + 1                            DPKCS036
291100         PERFORM 5110-WRITE-ASC-LISTQ                             DPKCS036
291200         ADD +1                    TO ASC-HIGHEST-BLOCK-WRITTEN   DPKCS036
291300     END-IF.                                                      DPKCS036
291400                                                                  DPKCS036
291500     SET ASC-BLOCK-NOT-MODIFIED(ASC-BLK-SUB) TO TRUE.             DPKCS036
291600                                                                  DPKCS036
291700 EJECT                                                            DPKCS036
291800*----------------------------------------------------------------*DPKCS036
291900*  REWRITE THE LIST TEMP STORAGE QUEUE FROM THE APPLICATION-     *DPKCS036
292000*  SPECIFIC COMMAREA.                                            *DPKCS036
292100*----------------------------------------------------------------*DPKCS036
292200 5105-REWRITE-ASC-LISTQ.                                          DPKCS036
292300                                                                  DPKCS036
292400     EXEC CICS                                                    DPKCS036
292500         WRITEQ TS                                                DPKCS036
292600             QUEUE (ASC-LIST-QUEUE-NAME)                          DPKCS036
292700             FROM  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               DPKCS036
292800             ITEM  (PV-BLOCK-NUMBER)                              DPKCS036
292900             REWRITE                                              DPKCS036
293000             RESP  (PV-CICS-RESP)                                 DPKCS036
293100     END-EXEC.                                                    DPKCS036
293200                                                                  DPKCS036
293300     IF  PV-CICS-RESP = DFHRESP(NORMAL)                           DPKCS036
293400         CONTINUE                                                 DPKCS036
293500     ELSE                                                         DPKCS036
293600         SET DP013-CICS-ABEND            TO TRUE                  DPKCS036
293700         SET DP013-NO-ROLLBACK           TO TRUE                  DPKCS036
293800         MOVE '5105-REWRITE-ASC-LISTQ'   TO DP013-PARAGRAPH       DPKCS036
293900         MOVE 'ATTEMPTING TO REWRITE LIST TEMP STORAGE QUEUE'     DPKCS036
294000                                         TO DP013-MESSAGE-TEXT(1) DPKCS036
294100         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
294200     END-IF.                                                      DPKCS036
294300                                                                  DPKCS036
294400 EJECT                                                            DPKCS036
294500*----------------------------------------------------------------*DPKCS036
294600*  WRITE THE LIST TEMP STORAGE QUEUE FROM THE APPLICATION-       *DPKCS036
294700*  SPECIFIC COMMAREA.                                            *DPKCS036
294800*----------------------------------------------------------------*DPKCS036
294900 5110-WRITE-ASC-LISTQ.                                            DPKCS036
295000                                                                  DPKCS036
295100     EXEC CICS                                                    DPKCS036
295200         WRITEQ TS                                                DPKCS036
295300             QUEUE (ASC-LIST-QUEUE-NAME)                          DPKCS036
295400             FROM  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               DPKCS036
295500             ITEM  (PV-BLOCK-NUMBER)                              DPKCS036
295600             RESP  (PV-CICS-RESP)                                 DPKCS036
295700     END-EXEC.                                                    DPKCS036
295800     IF  PV-CICS-RESP NOT = DFHRESP (NORMAL)                      DPKCS036
295900         SET DP013-CICS-ABEND      TO TRUE                        DPKCS036
296000         SET DP013-NO-ROLLBACK     TO TRUE                        DPKCS036
296100         MOVE '5110-WRITE-ASC-LISTQ'                              DPKCS036
296200                                   TO DP013-PARAGRAPH             DPKCS036
296300         MOVE 'ATTEMPTING TO DELETE TEMP STORAGE QUEUE'           DPKCS036
296400                                   TO DP013-MESSAGE-TEXT(1)       DPKCS036
296500         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
296600     END-IF.                                                      DPKCS036
296700                                                                  DPKCS036
296800 EJECT                                                            DPKCS036
296900*----------------------------------------------------------------*DPKCS036
297000* READ A LIST QUEUE RECORD AND MOVE THE KEYS OF SELECTED OBJECTS *DPKCS036
297100* TO THE SELECTED ITEMS TEMP STORAGE QUEUE RECORD.               *DPKCS036
297200*----------------------------------------------------------------*DPKCS036
297300 5200-FILL-SEL-QUEUE-RECORD.                                      DPKCS036
297400                                                                  DPKCS036
297500     PERFORM 6112-READ-LIST-QUEUE.                                DPKCS036
297600                                                                  DPKCS036
297700     IF  PV-CICS-RESP EQUAL DFHRESP(NORMAL)                       DPKCS036
297800         PERFORM                                                  DPKCS036
297900         VARYING LQW-IDX                                          DPKCS036
298000         FROM 1 BY 1                                              DPKCS036
298100         UNTIL LQW-IDX GREATER THAN PC-ITEMS-PER-PANEL            DPKCS036
298200           OR  LQW-LIST-ITEM-NUMBER (LQW-IDX) EQUAL ZERO          DPKCS036
298300                                                                  DPKCS036
298400             IF  LQW-SELECT (LQW-IDX)                             DPKCS036
298500                 MOVE LQW-LIST-ITEM-NUMBER (LQW-IDX)              DPKCS036
298600                                   TO TR101-ITEM (TR101-IDX)      DPKCS036
298700                 MOVE ASC-KEY-CONTNR-NO                           DPKCS036
298800                                   TO TR101-CONTNR-NO             DPKCS036
298900                                        (TR101-IDX)               DPKCS036
299000                 MOVE ASC-KEY-CONTNR-SEQ-NO                       DPKCS036
299100                                   TO TR101-CONTNR-SEQ-NO         DPKCS036
299200                                        (TR101-IDX)               DPKCS036
299300                 MOVE 'I'          TO TR101-ACTION-SW (TR101-IDX) DPKCS036
299301                                                                          
299310                 EVALUATE TRUE                                            
299320                     WHEN ASC-GOTO-HISTORY                                
299321                         MOVE LQW-PO-NBR  (LQW-IDX)                       
299322                                   TO TR116-PO-NBR                        
299323                         MOVE LQW-VNDR-STYL (LQW-IDX)                     
299324                                   TO TR116-VS-NBR                        
299325                         MOVE LQW-UPC-NBR (LQW-IDX)                       
299326                                   TO TR116-UPC-NBR                       
299327                         MOVE LQW-COLOR (LQW-IDX)                         
299328                                   TO TR116-COLOR                         
299329                         MOVE LQW-SIZE (LQW-IDX)                          
299330                                   TO TR116-SIZE                          
299331                 END-EVALUATE                                             
299340                                                                          
299400                 SET TR101-IDX UP BY 1                            DPKCS036
299500                 IF  TR101-IDX > TR101-MAX-ITEMS                  DPKCS036
299600                     PERFORM 5205-WRITE-SEL-QUEUE                 DPKCS036
299700                     IF ASC-GOTO-SUMMARY                          DPKCS036
299800                        ADD +1     TO TR102-NUMBER-OF-TS-ITEMS    DPKCS036
299900                     ELSE                                         DPKCS036
300120                         IF ASC-GOTO-HISTORY                              
300130                             ADD +1 TO TR116-NUMBER-OF-TS-ITEMS           
300140                         END-IF                                           
300300                     END-IF                                       DPKCS036
300400                     INITIALIZE TR101-SELECTED-ITEM-ARRAY         DPKCS036
300500                     SET TR101-IDX TO  1                          DPKCS036
300600                 END-IF                                           DPKCS036
300700             END-IF                                               DPKCS036
300800         END-PERFORM                                              DPKCS036
300900     END-IF.                                                      DPKCS036
301000                                                                  DPKCS036
301100 EJECT                                                            DPKCS036
301200*----------------------------------------------------------------*DPKCS036
301300*    WRITE THE SELECTED ITEMS TEMP STORAGE QUEUE.                *DPKCS036
301400*----------------------------------------------------------------*DPKCS036
301500 5205-WRITE-SEL-QUEUE.                                            DPKCS036
301600                                                                  DPKCS036
301700     MOVE ASC-NUMBER-OF-SELECTED-ITEMS                            DPKCS036
301800                                   TO TR101-SELECTED-ITEMS.       DPKCS036
301900                                                                  DPKCS036
302000     EXEC CICS                                                    DPKCS036
302100          WRITEQ TS                                               DPKCS036
302200              QUEUE (ASC-SEL-QUEUE-NAME)                          DPKCS036
302300              FROM  (TR101-VOYAGE-SEL-REC)                        DPKCS036
302400              ITEM  (PV-SEL-QUEUE-ITEM)                           DPKCS036
302500              RESP  (PV-CICS-RESP)                                DPKCS036
302600     END-EXEC.                                                    DPKCS036
302700                                                                  DPKCS036
302800     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          DPKCS036
302900         CONTINUE                                                 DPKCS036
303000     ELSE                                                         DPKCS036
303100         SET DP013-CICS-ABEND      TO TRUE                        DPKCS036
303200         SET DP013-NO-ROLLBACK     TO TRUE                        DPKCS036
303300         MOVE '5205-WRITE-SEL-QUEUE'                              DPKCS036
303400                                   TO DP013-PARAGRAPH             DPKCS036
303500         MOVE 'ATTEMPTING TO WRITE SELECTED ITEMS QUEUE'          DPKCS036
303600                                   TO DP013-MESSAGE-TEXT(1)       DPKCS036
303700         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
303800     END-IF.                                                      DPKCS036
303900                                                                  DPKCS036
304000 EJECT                                                            DPKCS036
304100*----------------------------------------------------------------*DPKCS036
304200*  WHEN RETURNING TO THIS TRANSACTION FROM ANOTHER TRANSACTION,  *DPKCS036
304300*  SETUP THE ARRAY AS IT WAS WHEN WE HAD LEFT PREVIOUSLY.  EDIT  *DPKCS036
304400*  THE SELECTIONS MADE AT THAT TIME AND DISPLAY THE PANEL TO     *DPKCS036
304500*  THE USER.                                                     *DPKCS036
304600*----------------------------------------------------------------*DPKCS036
304700 6000-REFRESH-PANEL-FROM-TEMP.                                    DPKCS036
304800                                                                  DPKCS036
304900     IF  ASC-UPDATE-TSQ                                           DPKCS036
305000         SET ASC-NO-TSQ-UPDATE TO TRUE                            DPKCS036
305100         MOVE ZERO                 TO PV-SAVE-ITEM                DPKCS036
305200                                      PV-SEL-QUEUE-ITEM           DPKCS036
305300         MOVE ASC-NUMBER-OF-SELECTED-ITEMS                        DPKCS036
305400                                   TO PV-HOLD-SELECTED-ITEMS      DPKCS036
305500         MOVE +1                   TO PV-ITEMS-PROCESSED          DPKCS036
305600         PERFORM 6100-UPDATE-TSQ                                  DPKCS036
305700             UNTIL PV-ITEMS-PROCESSED >                           DPKCS036
305800                                     PV-HOLD-SELECTED-ITEMS       DPKCS036
305900         PERFORM 6010-DELETE-SEL-QUEUE                            DPKCS036
306000         INITIALIZE ASC-BLOCK-ENTRIES (1)                         DPKCS036
306100                    ASC-BLOCK-ENTRIES (2)                         DPKCS036
306200     END-IF.                                                      DPKCS036
306300                                                                  DPKCS036
306400 EJECT                                                            DPKCS036
306500*----------------------------------------------------------------*DPKCS036
306600*    DELETE THE SELECTED ITEMS TEMP STORAGE QUEUE.               *DPKCS036
306700*----------------------------------------------------------------*DPKCS036
306800 6010-DELETE-SEL-QUEUE.                                           DPKCS036
306900                                                                  DPKCS036
307000     EXEC CICS                                                    DPKCS036
307100         DELETEQ TS                                               DPKCS036
307200             QUEUE (ASC-SEL-QUEUE-NAME)                           DPKCS036
307300             RESP  (PV-CICS-RESP)                                 DPKCS036
307400     END-EXEC.                                                    DPKCS036
307500*                                                                 DPKCS036
307600     IF ((PV-CICS-RESP = DFHRESP(NORMAL)) OR                      DPKCS036
307700        (PV-CICS-RESP = DFHRESP(QIDERR)))                         DPKCS036
307800         CONTINUE                                                 DPKCS036
307900     ELSE                                                         DPKCS036
308000         SET DP013-CICS-ABEND TO TRUE                             DPKCS036
308100         SET DP013-NO-ROLLBACK TO TRUE                            DPKCS036
308200         MOVE '6010-DELETE-SEL-QUEUE'                             DPKCS036
308300                        TO DP013-PARAGRAPH                        DPKCS036
308400         MOVE 'ERROR TRYING TO DELETE SELECTION TS QUEUE'         DPKCS036
308500                        TO DP013-MESSAGE-TEXT (1)                 DPKCS036
308600         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
308700     END-IF.                                                      DPKCS036
308800                                                                  DPKCS036
308900 EJECT                                                            DPKCS036
309000*----------------------------------------------------------------*DPKCS036
309100*    INCREMENT THE TSQ ITEM NUMBER AND READ THE LIST QUEUE.      *DPKCS036
309200*    LOOP THROUGH THE LIST QUEUE TO OBTAIN THE LINE ITEM NUMBER  *DPKCS036
309300*    TO BE USED TO UPDATE (DESELECT) THE CORRECT LINE ITEM IN    *DPKCS036
309400*    THE TEMP QUEUE.                                             *DPKCS036
309500*----------------------------------------------------------------*DPKCS036
309600 6100-UPDATE-TSQ.                                                 DPKCS036
309700                                                                  DPKCS036
309800     ADD 1                     TO  PV-SEL-QUEUE-ITEM.             DPKCS036
309900     PERFORM 6105-READ-SEL-QUEUE.                                 DPKCS036
310000     PERFORM                                                      DPKCS036
310100         VARYING TR101-IDX                                        DPKCS036
310200         FROM 1 BY 1                                              DPKCS036
310300         UNTIL ((PV-ITEMS-PROCESSED >                             DPKCS036
310400                              PV-HOLD-SELECTED-ITEMS)             DPKCS036
310500         OR (TR101-IDX GREATER THAN TR101-MAX-ITEMS))             DPKCS036
310600         IF  TR101-ACTION-SW (TR101-IDX) > SPACE                  DPKCS036
310700             PERFORM 6110-PROCESS-ITEMS                           DPKCS036
310800         END-IF                                                   DPKCS036
310900         ADD +1                TO PV-ITEMS-PROCESSED              DPKCS036
311000     END-PERFORM.                                                 DPKCS036
311100     PERFORM 6111-WRITE-LIST-QUEUE.                               DPKCS036
311200                                                                  DPKCS036
311300 EJECT                                                            DPKCS036
311400*----------------------------------------------------------------*DPKCS036
311500*    READ THE LIST QUEUE RECORD.                                 *DPKCS036
311600*----------------------------------------------------------------*DPKCS036
311700 6105-READ-SEL-QUEUE.                                             DPKCS036
311800                                                                  DPKCS036
311900     EXEC CICS                                                    DPKCS036
312000          READQ TS                                                DPKCS036
312100             QUEUE (ASC-SEL-QUEUE-NAME)                           DPKCS036
312200             INTO  (TR101-VOYAGE-SEL-REC)                         DPKCS036
312300             ITEM  (PV-SEL-QUEUE-ITEM)                            DPKCS036
312400             RESP  (PV-CICS-RESP)                                 DPKCS036
312500     END-EXEC.                                                    DPKCS036
312600*                                                                 DPKCS036
312700     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          DPKCS036
312800         CONTINUE                                                 DPKCS036
312900     ELSE                                                         DPKCS036
313000         SET DP013-CICS-ABEND      TO  TRUE                       DPKCS036
313100         SET DP013-NO-ROLLBACK     TO  TRUE                       DPKCS036
313200         MOVE '6105-READ-SEL-QUEUE'                               DPKCS036
313300                                   TO  DP013-PARAGRAPH            DPKCS036
313400         MOVE 'ATTEMPTING TO READ SELECTED ITEMS QUEUE'           DPKCS036
313500                                   TO  DP013-MESSAGE-TEXT(1)      DPKCS036
313600         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
313700     END-IF.                                                      DPKCS036
313800                                                                  DPKCS036
313900 EJECT                                                            DPKCS036
314000*----------------------------------------------------------------*DPKCS036
314100*    CALCULATE THE TEMP QUEUE ITEM THAT MUST BE READ AND READ IT.*DPKCS036
314200*    REWRITE THE CURRENT TEMP QUEUE ITEM IF NECESSARY.  CALCULATE*DPKCS036
314300*    THE LINE ITEM OCCURENCE AND UPDATE (DESELECT) IT.           *DPKCS036
314400*----------------------------------------------------------------*DPKCS036
314500 6110-PROCESS-ITEMS.                                              DPKCS036
314600                                                                  DPKCS036
314700     COMPUTE PV-ITEM = 1 + ((TR101-ITEM (TR101-IDX) - 1)          DPKCS036
314800                     / PC-ITEMS-PER-PANEL).                       DPKCS036
314900                                                                  DPKCS036
315000     IF  PV-ITEM NOT EQUAL PV-SAVE-ITEM                           DPKCS036
315100         IF  PV-SAVE-ITEM NOT EQUAL ZERO                          DPKCS036
315200             PERFORM 6111-WRITE-LIST-QUEUE                        DPKCS036
315300         END-IF                                                   DPKCS036
315400         MOVE PV-ITEM          TO PV-SAVE-ITEM                    DPKCS036
315500                                                                  DPKCS036
315600         PERFORM 6112-READ-LIST-QUEUE                             DPKCS036
315700         IF  PV-CICS-RESP NOT EQUAL DFHRESP(NORMAL)               DPKCS036
315800             CONTINUE                                             DPKCS036
315900         END-IF                                                   DPKCS036
316000     END-IF.                                                      DPKCS036
316100                                                                  DPKCS036
316200     COMPUTE PV-SUB = (TR101-ITEM (TR101-IDX)                     DPKCS036
316300                    - LQW-LIST-ITEM-NUMBER (1)) + 1.              DPKCS036
316400     SET LQW-DESELECT (PV-SUB) TO    TRUE.                        DPKCS036
316500     MOVE LQW-SELECTED-SW (PV-SUB)                                DPKCS036
316600                               TO LQW-TEMP-SELECTED-SW (PV-SUB).  DPKCS036
316700                                                                  DPKCS036
316800     IF TR101-INQ (TR101-IDX)                                     DPKCS036
316900        MOVE PC-INQ            TO LQW-ACTION (PV-SUB)             DPKCS036
317000     END-IF.                                                      DPKCS036
317100                                                                  DPKCS036
317200     SUBTRACT 1 FROM ASC-NUMBER-OF-SELECTED-ITEMS.                DPKCS036
317300                                                                  DPKCS036
317400 EJECT                                                            DPKCS036
317500*----------------------------------------------------------------*DPKCS036
317600*    WRITE THE TS QUEUE RECORD JUST UPDATED IN C600.             *DPKCS036
317700*----------------------------------------------------------------*DPKCS036
317800 6111-WRITE-LIST-QUEUE.                                           DPKCS036
317900                                                                  DPKCS036
318000     EXEC CICS                                                    DPKCS036
318100         WRITEQ TS                                                DPKCS036
318200             QUEUE (ASC-LIST-QUEUE-NAME)                          DPKCS036
318300             FROM  (LQW-LIST-QUEUE-WORK-AREA)                     DPKCS036
318400             ITEM  (PV-SAVE-ITEM)                                 DPKCS036
318500             REWRITE                                              DPKCS036
318600             RESP  (PV-CICS-RESP)                                 DPKCS036
318700     END-EXEC.                                                    DPKCS036
318800*                                                                 DPKCS036
318900     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          DPKCS036
319000         CONTINUE                                                 DPKCS036
319100     ELSE                                                         DPKCS036
319200         SET DP013-CICS-ABEND  TO  TRUE                           DPKCS036
319300         SET DP013-NO-ROLLBACK TO  TRUE                           DPKCS036
319400         MOVE '6111-WRITE-LIST-QUEUE'                             DPKCS036
319500                               TO  DP013-PARAGRAPH                DPKCS036
319600         MOVE 'ATTEMPTING TO REWRITE LIST QUEUE'                  DPKCS036
319700                               TO  DP013-MESSAGE-TEXT(1)          DPKCS036
319800         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
319900     END-IF.                                                      DPKCS036
320000                                                                  DPKCS036
320100 EJECT                                                            DPKCS036
320200*----------------------------------------------------------------*DPKCS036
320300*    READ THE TEMPORARY STORAGE QUEUE INTO A TEMPORARY WORK AREA.*DPKCS036
320400*----------------------------------------------------------------*DPKCS036
320500 6112-READ-LIST-QUEUE.                                            DPKCS036
320600                                                                  DPKCS036
320700     EXEC CICS                                                    DPKCS036
320800         READQ TS                                                 DPKCS036
320900             QUEUE (ASC-LIST-QUEUE-NAME)                          DPKCS036
321000             INTO  (LQW-LIST-QUEUE-WORK-AREA)                     DPKCS036
321100             ITEM  (PV-ITEM)                                      DPKCS036
321200             RESP  (PV-CICS-RESP)                                 DPKCS036
321300     END-EXEC.                                                    DPKCS036
321400*                                                                 DPKCS036
321500     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          DPKCS036
321600         CONTINUE                                                 DPKCS036
321700     ELSE                                                         DPKCS036
321800         SET DP013-CICS-ABEND        TO TRUE                      DPKCS036
321900         SET DP013-NO-ROLLBACK       TO TRUE                      DPKCS036
322000         MOVE '6112-READ-LIST-QUEUE' TO DP013-PARAGRAPH           DPKCS036
322100         MOVE 'ATTEMPTING TO READQ LIST QUEUE'                    DPKCS036
322200                                     TO DP013-MESSAGE-TEXT(1)     DPKCS036
322300         PERFORM DP013-0000-PROCESS-ABEND                         DPKCS036
322400     END-IF.                                                      DPKCS036
322500                                                                  DPKCS036
322600 EJECT                                                            DPKCS036
322700*----------------------------------------------------------------*DPKCS036
322800*    ABEND PROCESSOR MODULE                                      *DPKCS036
322900*----------------------------------------------------------------*DPKCS036
323000                                                                  DPKCS036
323100     COPY DPPD013.                                                DPKCS036
