*          DATA SET TRKM322                                                     
  PRINT  NOGEN                                                          00001   
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM322                                            *   00004   
*        MAP     TR322A                                             *   00005   
*        PROGRAM TRKCS322 - DECNSLR CONTROL PANEL DETAIL LIST       *   00006   
*        TRANSID Y322                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM322 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR322A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE CODE:',                                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=09,                                              X00042   
               POS=(03,05)                                              00043   
APOECDE DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(03,15)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FROM DATE:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(03,26)                                              00043   
AFRMDTE DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,37)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TO DATE:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(03,54)                                              00043   
ATODTE  DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,63)                                              00047   
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VIEW:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,05)                                              00043   
AVIEW   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,11)                                              00047   
*                                                                               
        DFHMDF POS=(05,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(05,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(05,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(05,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(05,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(05,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00043   
        DFHMDF POS=(06,76),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='DCON'                                           00061   
*                                                                       00043   
        DFHMDF POS=(07,01),LENGTH=01,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S'                                              00061   
        DFHMDF POS=(07,03),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ACT'                                            00064   
        DFHMDF POS=(07,08),LENGTH=06,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='VESSEL'                                         00061   
        DFHMDF POS=(07,20),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='ETA'                                            00061   
        DFHMDF POS=(07,25),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='FOB'                                            00061   
        DFHMDF POS=(07,29),LENGTH=09,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CONTAINER'                                      00061   
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='PO NO'                                          00064   
        DFHMDF POS=(07,51),LENGTH=02,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='TP'                                             00064   
        DFHMDF POS=(07,54),LENGTH=05,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='CARTS'                                          00067   
        DFHMDF POS=(07,63),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CBM'                                            00061   
        DFHMDF POS=(07,67),LENGTH=02,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SP'                                             00067   
        DFHMDF POS=(07,71),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SET'                                            00067   
        DFHMDF POS=(07,76),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SCAC'                                           00067   
*                                                                               
ASEL01  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT01  DFHMDF POS=(08,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL01 DFHMDF POS=(08,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR01 DFHMDF POS=(08,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO01 DFHMDF POS=(08,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP01  DFHMDF POS=(08,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART01 DFHMDF POS=(08,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM01  DFHMDF POS=(08,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT01 DFHMDF POS=(08,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET01  DFHMDF POS=(08,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC01 DFHMDF POS=(08,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL02  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT02  DFHMDF POS=(09,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL02 DFHMDF POS=(09,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR02 DFHMDF POS=(09,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO02 DFHMDF POS=(09,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP02  DFHMDF POS=(09,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART02 DFHMDF POS=(09,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM02  DFHMDF POS=(09,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT02 DFHMDF POS=(09,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET02  DFHMDF POS=(09,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC02 DFHMDF POS=(09,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL03  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT03  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL03 DFHMDF POS=(10,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR03 DFHMDF POS=(10,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO03 DFHMDF POS=(10,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP03  DFHMDF POS=(10,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART03 DFHMDF POS=(10,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM03  DFHMDF POS=(10,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT03 DFHMDF POS=(10,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET03  DFHMDF POS=(10,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC03 DFHMDF POS=(10,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL04  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT04  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL04 DFHMDF POS=(11,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR04 DFHMDF POS=(11,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO04 DFHMDF POS=(11,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP04  DFHMDF POS=(11,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART04 DFHMDF POS=(11,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM04  DFHMDF POS=(11,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT04 DFHMDF POS=(11,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET04  DFHMDF POS=(11,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC04 DFHMDF POS=(11,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL05  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT05  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL05 DFHMDF POS=(12,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR05 DFHMDF POS=(12,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO05 DFHMDF POS=(12,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP05  DFHMDF POS=(12,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART05 DFHMDF POS=(12,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM05  DFHMDF POS=(12,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT05 DFHMDF POS=(12,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET05  DFHMDF POS=(12,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC05 DFHMDF POS=(12,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL06  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT06  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL06 DFHMDF POS=(13,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR06 DFHMDF POS=(13,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO06 DFHMDF POS=(13,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP06  DFHMDF POS=(13,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART06 DFHMDF POS=(13,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM06  DFHMDF POS=(13,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT06 DFHMDF POS=(13,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET06  DFHMDF POS=(13,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC06 DFHMDF POS=(13,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL07  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT07  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL07 DFHMDF POS=(14,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR07 DFHMDF POS=(14,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO07 DFHMDF POS=(14,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP07  DFHMDF POS=(14,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART07 DFHMDF POS=(14,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM07  DFHMDF POS=(14,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT07 DFHMDF POS=(14,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET07  DFHMDF POS=(14,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC07 DFHMDF POS=(14,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL08  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT08  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL08 DFHMDF POS=(15,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR08 DFHMDF POS=(15,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO08 DFHMDF POS=(15,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP08  DFHMDF POS=(15,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART08 DFHMDF POS=(15,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM08  DFHMDF POS=(15,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT08 DFHMDF POS=(15,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET08  DFHMDF POS=(15,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC08 DFHMDF POS=(15,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL09  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT09  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL09 DFHMDF POS=(16,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR09 DFHMDF POS=(16,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO09 DFHMDF POS=(16,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP09  DFHMDF POS=(16,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART09 DFHMDF POS=(16,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM09  DFHMDF POS=(16,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT09 DFHMDF POS=(16,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET09  DFHMDF POS=(16,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC09 DFHMDF POS=(16,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL10  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT10  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL10 DFHMDF POS=(17,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR10 DFHMDF POS=(17,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO10 DFHMDF POS=(17,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP10  DFHMDF POS=(17,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART10 DFHMDF POS=(17,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM10  DFHMDF POS=(17,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT10 DFHMDF POS=(17,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET10  DFHMDF POS=(17,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC10 DFHMDF POS=(17,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL11  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT11  DFHMDF POS=(18,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVESL11 DFHMDF POS=(18,08),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR11 DFHMDF POS=(18,29),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO11 DFHMDF POS=(18,42),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
ATYP11  DFHMDF POS=(18,51),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ACART11 DFHMDF POS=(18,54),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00092   
ACBM11  DFHMDF POS=(18,60),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
ASPLT11 DFHMDF POS=(18,68),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASET11  DFHMDF POS=(18,70),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC11 DFHMDF POS=(18,76),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
