*          DATA SET TRKM158    AT LEVEL 005 AS OF 02/05/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM158                                            *   00004   
*        MAP     TR158A                                             *   00005   
*        PROGRAM TRKCS158                                           *   00006   
*        TRANSID Y158 - FOB CODE ADD/UPDATE/DELETE                  *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM158 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR158A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
         DFHMDF POS=(05,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=033,                                             X00027   
               INITIAL='ENTER EDI STANDARD FOB DATA ONLY.'              00028   
*                                                                       00020   
         DFHMDF POS=(07,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=044,                                             X00027   
               INITIAL='CONTACT INFORMATION SERVICES FOR ASSISTANCE.'   00028   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ORIGIN CODE.....:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(09,10)                                              00026**2
AORGCOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(09,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(09,32)                                              00087**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ORIGIN TYPE.....:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(10,10)                                              00026**2
AORGTYP DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(10,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(10,32)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='EDI SCHED K CODE:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(12,10)                                              00026**2
AEDICOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=5,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(12,34)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='CITY NAME.......:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(13,10)                                              00026**2
AORGCTY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(13,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(13,59)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='COUNTRY CODE....:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(14,10)                                              00026**2
ACNTCOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(14,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(14,32)                                              00087**3
ACNTDES DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00086   
               POS=(14,35)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(14,66)                                              00087**3
*                                                                       00020   
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
