*          DATA SET TRKM151    AT LEVEL 005 AS OF 02/05/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM151                                            *   00004   
*        MAP     TR151A                                             *   00005   
*        PROGRAM TRKCS151                                           *   00006   
*        TRANSID Y151 - FOB CODE ADD/UPDATE/DELETE                  *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM151 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR151A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
         DFHMDF POS=(05,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=033,                                             X00027   
               INITIAL='ENTER EDI STANDARD FOB DATA ONLY.'              00028   
*                                                                       00020   
         DFHMDF POS=(07,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=044,                                             X00027   
               INITIAL='CONTACT INFORMATION SERVICES FOR ASSISTANCE.'   00028   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='FOB CODE........:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(09,10)                                              00026**2
AFOBCOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(09,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(09,32)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='EDI SCHED K CODE:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(10,10)                                              00026**2
AEDICOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=5,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(10,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(10,34)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='CITY NAME.......:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(11,10)                                              00026**2
AFOBCTY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(11,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(11,59)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='COUNTRY CODE....:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(12,10)                                              00026**2
ACNTCOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(12,32)                                              00087**3
ACNTDES DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00086   
               POS=(12,35)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(12,66)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='POE CODE........:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(13,10)                                              00026**2
APOECOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(13,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(13,32)                                              00087**3
APOEDES DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00086   
               POS=(13,35)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(13,66)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='CONSOLIDATOR....:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(15,10)                                              00026**2
ACONSLC DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(15,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(15,33)                                              00087**3
ACONSLN DFHMDF ATTRB=(PROT,NORM),                                      X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00035**3
               POS=(15,35)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(15,66)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='CUSTOMS BROKER..:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(16,10)                                              00026**2
ACSBRCO DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(16,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(16,33)                                              00087**3
ACSBRNO DFHMDF ATTRB=(PROT,NORM),                                      X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00035**3
               POS=(16,35)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(16,66)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='DECONSOLIDATOR..:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(17,10)                                              00026**2
ADECONC DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(17,33)                                              00087**3
ADECONN DFHMDF ATTRB=(PROT,NORM),                                      X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00035**3
               POS=(17,35)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(17,66)                                              00087**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X        
               INITIAL='INCOTERM CODE...:',                            X        
               LENGTH=17,                                              X        
               COLOR=NEUTRAL,                                          X        
               POS=(18,10)                                                      
AINCOTC DFHMDF ATTRB=(UNPROT,NORM),                                    X        
               LENGTH=03,                                              X        
               COLOR=GREEN,                                            X        
               HILIGHT=UNDERLINE,                                      X        
               POS=(18,28)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(18,32)                                                      
AINCOTN DFHMDF ATTRB=(PROT,NORM),                                      X        
               LENGTH=30,                                              X        
               COLOR=BLUE,                                             X        
               POS=(18,35)                                                      
        DFHMDF ATTRB=(ASKIP),                                          X        
               LENGTH=1,                                               X        
               COLOR=NEUTRAL,                                          X        
               POS=(18,66)                                                      
*                                                                       00020   
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
