*        DATA SET TRKM162                                                       
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM162                                            *   00004   
*        MAP     TR162A                                             *   00005   
*        PROGRAM TRKCS162                                           *   00006   
*        TRANSID Y162                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM162 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR162A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PO NO:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(02,02)                                              00043   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               PICOUT='ZZZZZZZZ',                                      X00046   
               POS=(02,09)                                              00047   
AVNDNME DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=29,                                              X00046   
               POS=(02,18)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VEND STYLE:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(02,48)                                              00043   
AVNDSTY DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=20,                                              X00046   
               POS=(02,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DEPT.:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(03,02)                                              00043   
ADEPT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               PICOUT='ZZZ9',                                          X        
               POS=(03,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='START X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(03,19)                                              00043   
ASTXFDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(03,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='OTB.......:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(03,48)                                              00043   
AOTB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=06,                                              X00046   
               POS=(03,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CNTRY:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(04,02)                                              00043   
ACNTRY  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(04,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LAST  X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(04,19)                                              00043   
ALTXFDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ORD UNTS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(04,48)                                              00043   
AUNTS   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(04,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(05,02)                                              00043   
AFOBP   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(05,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DONT SHIP BEFORE.:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(05,19)                                              00043   
ADSHBEF DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='EST CTNS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(05,48)                                              00043   
ACTNS   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               PICOUT='ZZZZZ',                                         X        
               POS=(05,64)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(06,02)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(06,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CANCEL:',                                      X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=07,                                              X00042   
               POS=(06,19)                                              00043   
ACANDT  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,29)                                              00047   
AXCANDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='AD DTE....:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(06,48)                                              00043   
AADDT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,60)                                              00047   
*                                                                       00044   
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(07,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(07,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(07,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(07,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(07,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00044   
        DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT),                   X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S'                                              00061   
        DFHMDF POS=(08,03),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='ACT'                                            00061   
        DFHMDF POS=(08,07),LENGTH=09,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CONTAINER'                                      00061   
        DFHMDF POS=(08,22),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='CTN'                                            00064   
        DFHMDF POS=(08,29),LENGTH=05,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='UNITS'                                          00067   
        DFHMDF POS=(08,39),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CBM'                                            00061   
        DFHMDF POS=(08,43),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='FOB'                                            00067   
        DFHMDF POS=(08,47),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='POE'                                            00067   
        DFHMDF POS=(08,51),LENGTH=06,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='VESSEL'                                         00067   
        DFHMDF POS=(08,61),LENGTH=06,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='VOYAGE'                                         00067   
        DFHMDF POS=(08,69),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='TYPE'                                           00067   
        DFHMDF POS=(08,75),LENGTH=05,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='PO CT'                                          00067   
*                                                                               
ASEL01  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT01  DFHMDF POS=(09,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON01  DFHMDF POS=(09,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN01  DFHMDF POS=(09,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT01  DFHMDF POS=(09,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM01  DFHMDF POS=(09,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB01  DFHMDF POS=(09,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE01  DFHMDF POS=(09,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL01  DFHMDF POS=(09,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY01  DFHMDF POS=(09,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP01  DFHMDF POS=(09,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT01  DFHMDF POS=(09,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL02  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT02  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON02  DFHMDF POS=(10,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN02  DFHMDF POS=(10,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT02  DFHMDF POS=(10,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM02  DFHMDF POS=(10,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB02  DFHMDF POS=(10,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE02  DFHMDF POS=(10,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL02  DFHMDF POS=(10,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY02  DFHMDF POS=(10,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP02  DFHMDF POS=(10,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT02  DFHMDF POS=(10,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL03  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT03  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON03  DFHMDF POS=(11,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN03  DFHMDF POS=(11,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT03  DFHMDF POS=(11,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM03  DFHMDF POS=(11,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB03  DFHMDF POS=(11,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE03  DFHMDF POS=(11,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL03  DFHMDF POS=(11,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY03  DFHMDF POS=(11,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP03  DFHMDF POS=(11,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT03  DFHMDF POS=(11,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL04  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT04  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON04  DFHMDF POS=(12,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN04  DFHMDF POS=(12,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT04  DFHMDF POS=(12,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM04  DFHMDF POS=(12,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB04  DFHMDF POS=(12,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE04  DFHMDF POS=(12,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL04  DFHMDF POS=(12,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY04  DFHMDF POS=(12,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP04  DFHMDF POS=(12,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT04  DFHMDF POS=(12,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL05  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT05  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON05  DFHMDF POS=(13,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN05  DFHMDF POS=(13,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT05  DFHMDF POS=(13,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM05  DFHMDF POS=(13,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB05  DFHMDF POS=(13,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE05  DFHMDF POS=(13,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL05  DFHMDF POS=(13,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY05  DFHMDF POS=(13,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP05  DFHMDF POS=(13,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT05  DFHMDF POS=(13,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL06  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT06  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON06  DFHMDF POS=(14,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN06  DFHMDF POS=(14,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT06  DFHMDF POS=(14,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM06  DFHMDF POS=(14,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB06  DFHMDF POS=(14,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE06  DFHMDF POS=(14,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL06  DFHMDF POS=(14,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY06  DFHMDF POS=(14,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP06  DFHMDF POS=(14,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT06  DFHMDF POS=(14,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL07  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT07  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON07  DFHMDF POS=(15,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN07  DFHMDF POS=(15,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT07  DFHMDF POS=(15,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM07  DFHMDF POS=(15,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB07  DFHMDF POS=(15,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE07  DFHMDF POS=(15,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL07  DFHMDF POS=(15,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY07  DFHMDF POS=(15,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP07  DFHMDF POS=(15,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT07  DFHMDF POS=(15,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL08  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT08  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON08  DFHMDF POS=(16,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN08  DFHMDF POS=(16,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT08  DFHMDF POS=(16,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM08  DFHMDF POS=(16,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB08  DFHMDF POS=(16,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE08  DFHMDF POS=(16,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL08  DFHMDF POS=(16,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY08  DFHMDF POS=(16,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP08  DFHMDF POS=(16,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT08  DFHMDF POS=(16,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
ASEL09  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT09  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACON09  DFHMDF POS=(17,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACTN09  DFHMDF POS=(17,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZ9'                                00090   
AUNT09  DFHMDF POS=(17,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ9'                             00090   
ACBM09  DFHMDF POS=(17,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZ9.99'                              00092   
AFOB09  DFHMDF POS=(17,43),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOE09  DFHMDF POS=(17,47),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVSL09  DFHMDF POS=(17,51),LENGTH=09,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AVOY09  DFHMDF POS=(17,61),LENGTH=06,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ATYP09  DFHMDF POS=(17,68),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNT09  DFHMDF POS=(17,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZ9'                                  00094   
*                                                                               
        DFHMDF POS=(18,13),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,INITIAL='TOTAL:'                            00094   
ATOTCNT DFHMDF POS=(18,20),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZ9'                              00094   
ATOTUNT DFHMDF POS=(18,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZZZZ9'                           00094   
ATOTCBM DFHMDF POS=(18,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZ9.99'                            00094   
*                                                                               
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00094   
        END                                                             00094   
