*          DATA SET TRKM144    AT LEVEL 012 AS OF 10/09/95              00010000
*          DATA SET TRKM144    AT LEVEL 001 AS OF 05/17/95              00020000
*          DATA SET TRKM144    AT LEVEL 001 AS OF 05/11/95              00030000
*          DATA SET TRKM144    AT LEVEL 011 AS OF 06/06/94              00040000
*          DATA SET TRKM144    AT LEVEL 006 AS OF 03/02/94              00050000
  PRINT  NOGEN                                                          00060000
*-------------------------------------------------------------------*   00070000
*                                                                   *   00080000
*        MAPSET  TRKM144                                            *   00090000
*        MAP     TR144A                                             *   00100000
*        PROGRAM TRKCS144                                           *   00110000
*        TRANSID Y144                                               *   00120000
*        SYSTEM  CICS ARCH - TRAFFIC FREIGHT MAINTENANCE            *   00130000
*                                                                   *   00140000
* 07/30/2010  EKTA AGRAWAL             TKID: TKMAV49                *   00150000
*             MODIFIED TO ADD TWO NEW FIELDS TRIP ID AND WHSE CTN   *   00160000
*-------------------------------------------------------------------*   00170000
TRKM144 DFHMSD TYPE=DSECT,                                             X00180000
               LANG=COBOL,                                             X00190000
               MODE=INOUT,                                             X00200000
               STORAGE=AUTO,                                           X00210000
               TIOAPFX=YES,                                            X00220000
               TERM=3270-2                                              00230000
TR144A  DFHMDI LINE=2,COLUMN=1,                                        X00240000
               SIZE=(19,80),                                           X00250000
               CTRL=(FREEKB),                                          X00260000
               MAPATTS=(COLOR,HILIGHT),                                X00270000
               DSATTS=(COLOR,HILIGHT)                                   00280000
*                                                                       00290000
        DFHMDF POS=(02,44),                                            X00300000
               LENGTH=05,                                              X00310000
               ATTRB=(ASKIP,NORM),                                     X00320000
               COLOR=NEUTRAL,                                          X00330000
               INITIAL='ITEMS'                                          00340000
ASTRTIT DFHMDF POS=(02,50),                                            X00350000
               LENGTH=07,                                              X00360000
               ATTRB=(UNPROT,NORM),                                    X00370000
               COLOR=GREEN,                                            X00380000
               HILIGHT=UNDERLINE,                                      X00390000
               PICOUT='ZZZ,ZZ9'                                         00400000
        DFHMDF POS=(02,58),                                            X00410000
               LENGTH=02,                                              X00420000
               ATTRB=(ASKIP,NORM),                                     X00430000
               COLOR=NEUTRAL,                                          X00440000
               INITIAL='TO'                                             00450000
AENDIT  DFHMDF POS=(02,61),                                            X00460000
               LENGTH=07,                                              X00470000
               ATTRB=(ASKIP,NORM),                                     X00480000
               COLOR=BLUE,                                             X00490000
               PICOUT='ZZZ,ZZ9'                                         00500000
        DFHMDF POS=(02,69),                                            X00510000
               LENGTH=02,                                              X00520000
               ATTRB=(ASKIP,NORM),                                     X00530000
               COLOR=NEUTRAL,                                          X00540000
               INITIAL='OF'                                             00550000
ATOTIT  DFHMDF POS=(02,72),                                            X00560000
               LENGTH=07,                                              X00570000
               ATTRB=(ASKIP,NORM),                                     X00580000
               COLOR=BLUE,                                             X00590000
               PICOUT='ZZZ,ZZ9'                                         00600000
*                                                                       00610000
        DFHMDF POS=(03,55),                                            X00620000
               LENGTH=11,                                              X00630000
               ATTRB=(ASKIP,NORM),                                     X00640000
               COLOR=NEUTRAL,                                          X00650000
               INITIAL='PRINTER ID:'                                    00660000
APRINTR DFHMDF POS=(03,68),                                            X00670000
               LENGTH=08,                                              X00680000
               ATTRB=(UNPROT,NORM),                                    X00690000
               COLOR=GREEN,                                            X00700000
               HILIGHT=UNDERLINE                                        00710000
        DFHMDF POS=(03,78),                                            X00720000
               LENGTH=01,                                              X00730000
               ATTRB=ASKIP                                              00740000
*                                                                       00750000
        DFHMDF POS=(04,04),                                            X00760000
               LENGTH=12,                                              X00770000
               ATTRB=(ASKIP,NORM),                                     X00780000
               COLOR=NEUTRAL,                                          X00790000
               INITIAL='INVOICE NBR:'                                   00800000
AINV    DFHMDF POS=(04,17),                                            X00810000
               LENGTH=15,                                              X00820000
               ATTRB=(UNPROT,NORM),                                    X00830000
               COLOR=GREEN,                                            X00840000
               HILIGHT=UNDERLINE                                        00850000
        DFHMDF POS=(04,33),                                            X00860000
               LENGTH=15,                                              X00870000
               ATTRB=(ASKIP,NORM),                                     X00880000
               COLOR=NEUTRAL,                                          X00890000
               INITIAL='DATE PROCESSED:'                                00900000
AMMDTE  DFHMDF POS=(04,49),                                            X00910000
               LENGTH=02,                                              X00920000
               ATTRB=(UNPROT,NORM),                                    X00930000
               COLOR=GREEN,                                            X00940000
               HILIGHT=UNDERLINE                                        00950000
ADDDTE  DFHMDF POS=(04,52),                                            X00960000
               LENGTH=02,                                              X00970000
               ATTRB=(UNPROT,NORM),                                    X00980000
               COLOR=GREEN,                                            X00990000
               HILIGHT=UNDERLINE                                        01000000
AYYDTE  DFHMDF POS=(04,55),                                            X01010000
               LENGTH=04,                                              X01020000
               ATTRB=(UNPROT,NORM),                                    X01030000
               COLOR=GREEN,                                            X01040000
               HILIGHT=UNDERLINE                                        01050000
        DFHMDF POS=(04,60),                                            X01060000
               LENGTH=01,                                              X01070000
               ATTRB=ASKIP                                              01080000
        DFHMDF POS=(04,62),                                            X01090000
               LENGTH=13,                                              X01100000
               ATTRB=(ASKIP,NORM),                                     X01110000
               COLOR=NEUTRAL,                                          X01120000
               INITIAL='ORIG CARRIER:'                                  01130000
AOSCAC  DFHMDF POS=(04,76),                                            X01140000
               LENGTH=04,                                              X01150000
               ATTRB=(ASKIP,NORM),                                     X01160000
               COLOR=BLUE                                               01170000
*                                                                       01180000
        DFHMDF POS=(05,04),                                            X01190000
               LENGTH=13,                                              X01200000
               ATTRB=(ASKIP,NORM),                                     X01210000
               COLOR=NEUTRAL,                                          X01220000
               INITIAL='FREIGHT BILL:'                                  01230000
APRO    DFHMDF POS=(05,18),                                            X01240000
               LENGTH=22,                                              X01250000
               ATTRB=(ASKIP,NORM),                                     X01260000
               COLOR=BLUE                                               01270000
        DFHMDF POS=(05,41),                                            X01280000
               LENGTH=10,                                              X01290000
               ATTRB=(ASKIP,NORM),                                     X01300000
               COLOR=NEUTRAL,                                          X01310000
               INITIAL='DLVY CARR:'                                     01320000
ASCAC   DFHMDF POS=(05,53),                                            X01330000
               LENGTH=04,                                              X01340000
               ATTRB=(ASKIP,NORM),                                     X01350000
               COLOR=BLUE                                               01360000
        DFHMDF POS=(05,58),                                            X01370000
               LENGTH=08,                                              X01380000
               ATTRB=(ASKIP,NORM),                                     X01390000
               COLOR=NEUTRAL,                                          X01400000
               INITIAL='TRAILER:'                                       01410000
ATRLR   DFHMDF POS=(05,67),                                            X01420000
               LENGTH=10,                                              X01430000
               ATTRB=(ASKIP,NORM),                                     X01440000
               COLOR=BLUE                                               01450000
*                                                                       01460000
        DFHMDF POS=(06,04),                                            X01470000
               LENGTH=16,                                              X01480000
               ATTRB=(ASKIP,NORM),                                     X01490000
               COLOR=NEUTRAL,                                          X01500000
               INITIAL='FREIGHT CHARGES:'                               01510000
AFCHG   DFHMDF POS=(06,21),                                            X01520000
               LENGTH=09,                                              X01530000
               ATTRB=(UNPROT,NORM),                                    X01540000
               COLOR=GREEN,                                            X01550000
               HILIGHT=UNDERLINE,                                      X01560000
               PICOUT='ZZZZZ9.99'                                       01570000
        DFHMDF POS=(06,31),                                            X01580000
               LENGTH=01,                                              X01590000
               ATTRB=ASKIP                                              01600000
*                                                                       01610000
        DFHMDF POS=(06,41),                                            X01620000
               LENGTH=08,                                              X01630000
               ATTRB=(ASKIP,NORM),                                     X01640000
               COLOR=NEUTRAL,                                          X01650000
               INITIAL='TERMS..:'                                       01660000
ATERM   DFHMDF POS=(06,50),                                            X01670000
               LENGTH=01,                                              X01680000
               ATTRB=(UNPROT,NORM),                                    X01690000
               COLOR=GREEN,                                            X01700000
               HILIGHT=UNDERLINE                                        01710000
        DFHMDF POS=(06,52),                                            X01720000
               LENGTH=01,                                              X01730000
               ATTRB=ASKIP                                              01740000
*                                                                       01750000
        DFHMDF POS=(06,57),                                            X01760000
               LENGTH=08,                                              X01770000
               ATTRB=(ASKIP,NORM),                                     X01780000
               COLOR=NEUTRAL,                                          X01790000
               INITIAL='WEIGHT.:'                                       01800000
AWGHT   DFHMDF POS=(06,66),                                            X01810000
               LENGTH=06,                                              X01820000
               ATTRB=(UNPROT,NORM),                                    X01830000
               COLOR=GREEN,                                            X01840000
               HILIGHT=UNDERLINE,                                      X01850000
               PICOUT='ZZZZZ9'                                          01860000
        DFHMDF POS=(06,73),                                            X01870000
               LENGTH=01,                                              X01880000
               ATTRB=ASKIP                                              01890000
*                                                                       01900000
        DFHMDF POS=(07,04),                                            X01910000
               LENGTH=08,                                              X01920000
               ATTRB=(ASKIP,NORM),                                     X01930000
               COLOR=NEUTRAL,                                          X01940000
               INITIAL='TRIP ID:'                                       01950000
ATRIP   DFHMDF POS=(07,13),                                            X01960000
               LENGTH=09,                                              X01970000
               ATTRB=(ASKIP,NORM),                                     X01980000
               COLOR=BLUE                                               01990000
*                                                                       02000000
        DFHMDF POS=(07,33),                                            X02010000
               LENGTH=11,                                              X02020000
               ATTRB=(ASKIP,NORM),                                     X02030000
               COLOR=NEUTRAL,                                          X02040000
               INITIAL='WR CARTONS:'                                    02050000
AWCTN   DFHMDF POS=(07,45),                                            X02060000
               LENGTH=07,                                              X02070000
               ATTRB=(ASKIP,NORM),                                     X02080000
               COLOR=BLUE                                               02090000
*                                                                       02100000
        DFHMDF POS=(08,04),                                            X02110000
               LENGTH=41,                                              X02120000
               ATTRB=(ASKIP,BRT),                                      X02130000
               INITIAL='PO NBR    DC   RCV SEQ  DEPT  CL  CARTONS'      02140000
        DFHMDF POS=(08,47),                                            X02150000
               LENGTH=31,                                              X02160000
               ATTRB=(ASKIP,BRT),                                      X02170000
               INITIAL='  ADJUSTED  DAMAGED     CHARGES'                02180000
*                                                                       02190000
APO1    DFHMDF POS=(09,03),                                            X02200002
               LENGTH=08,                                              X02210001
               ATTRB=(ASKIP,NORM),                                     X02220000
               COLOR=BLUE                                               02230000
ADC1    DFHMDF POS=(09,13),                                            X02240000
               LENGTH=04,                                              X02250000
               ATTRB=(ASKIP,NORM),                                     X02260000
               COLOR=BLUE                                               02270000
ARCVR1  DFHMDF POS=(09,20),                                            X02280000
               LENGTH=04,                                              X02290000
               ATTRB=(ASKIP,NORM),                                     X02300000
               COLOR=BLUE                                               02310000
ADEPT1  DFHMDF POS=(09,28),                                            X02320000
               LENGTH=04,                                              X02330000
               ATTRB=(ASKIP,NORM),                                     X02340000
               COLOR=BLUE                                               02350000
ACLAS1  DFHMDF POS=(09,33),                                            X02360000
               LENGTH=04,                                              X02370000
               ATTRB=(ASKIP,NORM),                                     X02380000
               COLOR=BLUE                                               02390000
ACTNS1  DFHMDF POS=(09,40),                                            X02400000
               LENGTH=04,                                              X02410000
               ATTRB=(ASKIP,NORM),                                     X02420000
               COLOR=BLUE,                                             X02430000
               PICOUT='ZZZ9'                                            02440000
AADJ1   DFHMDF POS=(09,49),                                            X02450000
               LENGTH=04,                                              X02460000
               ATTRB=(ASKIP,NORM),                                     X02470000
               COLOR=BLUE,                                             X02480000
               PICOUT='ZZZ9'                                            02490000
ADMG1   DFHMDF POS=(09,59),                                            X02500000
               LENGTH=04,                                              X02510000
               ATTRB=(ASKIP,NORM),                                     X02520000
               COLOR=BLUE,                                             X02530000
               PICOUT='ZZZ9'                                            02540000
ACHG1   DFHMDF POS=(09,68),                                            X02550000
               LENGTH=08,                                              X02560000
               ATTRB=(ASKIP,NORM),                                     X02570000
               COLOR=BLUE,                                             X02580000
               PICOUT='ZZZZ9.99'                                        02590000
*                                                                       02600000
APO2    DFHMDF POS=(10,03),                                            X02610002
               LENGTH=08,                                              X02620001
               ATTRB=(ASKIP,NORM),                                     X02630000
               COLOR=BLUE                                               02640000
ADC2    DFHMDF POS=(10,13),                                            X02650000
               LENGTH=04,                                              X02660000
               ATTRB=(ASKIP,NORM),                                     X02670000
               COLOR=BLUE                                               02680000
ARCVR2  DFHMDF POS=(10,20),                                            X02690000
               LENGTH=04,                                              X02700000
               ATTRB=(ASKIP,NORM),                                     X02710000
               COLOR=BLUE                                               02720000
ADEPT2  DFHMDF POS=(10,28),                                            X02730000
               LENGTH=04,                                              X02740000
               ATTRB=(ASKIP,NORM),                                     X02750000
               COLOR=BLUE                                               02760000
ACLAS2  DFHMDF POS=(10,33),                                            X02770000
               LENGTH=04,                                              X02780000
               ATTRB=(ASKIP,NORM),                                     X02790000
               COLOR=BLUE                                               02800000
ACTNS2  DFHMDF POS=(10,40),                                            X02810000
               LENGTH=04,                                              X02820000
               ATTRB=(ASKIP,NORM),                                     X02830000
               COLOR=BLUE,                                             X02840000
               PICOUT='ZZZ9'                                            02850000
AADJ2   DFHMDF POS=(10,49),                                            X02860000
               LENGTH=04,                                              X02870000
               ATTRB=(ASKIP,NORM),                                     X02880000
               COLOR=BLUE,                                             X02890000
               PICOUT='ZZZ9'                                            02900000
ADMG2   DFHMDF POS=(10,59),                                            X02910000
               LENGTH=04,                                              X02920000
               ATTRB=(ASKIP,NORM),                                     X02930000
               COLOR=BLUE,                                             X02940000
               PICOUT='ZZZ9'                                            02950000
ACHG2   DFHMDF POS=(10,68),                                            X02960000
               LENGTH=08,                                              X02970000
               ATTRB=(ASKIP,NORM),                                     X02980000
               COLOR=BLUE,                                             X02990000
               PICOUT='ZZZZ9.99'                                        03000000
*                                                                       03010000
APO3    DFHMDF POS=(11,03),                                            X03020002
               LENGTH=08,                                              X03030001
               ATTRB=(ASKIP,NORM),                                     X03040000
               COLOR=BLUE                                               03050000
ADC3    DFHMDF POS=(11,13),                                            X03060000
               LENGTH=04,                                              X03070000
               ATTRB=(ASKIP,NORM),                                     X03080000
               COLOR=BLUE                                               03090000
ARCVR3  DFHMDF POS=(11,20),                                            X03100000
               LENGTH=04,                                              X03110000
               ATTRB=(ASKIP,NORM),                                     X03120000
               COLOR=BLUE                                               03130000
ADEPT3  DFHMDF POS=(11,28),                                            X03140000
               LENGTH=04,                                              X03150000
               ATTRB=(ASKIP,NORM),                                     X03160000
               COLOR=BLUE                                               03170000
ACLAS3  DFHMDF POS=(11,33),                                            X03180000
               LENGTH=04,                                              X03190000
               ATTRB=(ASKIP,NORM),                                     X03200000
               COLOR=BLUE                                               03210000
ACTNS3  DFHMDF POS=(11,40),                                            X03220000
               LENGTH=04,                                              X03230000
               ATTRB=(ASKIP,NORM),                                     X03240000
               COLOR=BLUE,                                             X03250000
               PICOUT='ZZZ9'                                            03260000
AADJ3   DFHMDF POS=(11,49),                                            X03270000
               LENGTH=04,                                              X03280000
               ATTRB=(ASKIP,NORM),                                     X03290000
               COLOR=BLUE,                                             X03300000
               PICOUT='ZZZ9'                                            03310000
ADMG3   DFHMDF POS=(11,59),                                            X03320000
               LENGTH=04,                                              X03330000
               ATTRB=(ASKIP,NORM),                                     X03340000
               COLOR=BLUE,                                             X03350000
               PICOUT='ZZZ9'                                            03360000
ACHG3   DFHMDF POS=(11,68),                                            X03370000
               LENGTH=08,                                              X03380000
               ATTRB=(ASKIP,NORM),                                     X03390000
               COLOR=BLUE,                                             X03400000
               PICOUT='ZZZZ9.99'                                        03410000
*                                                                       03420000
APO4    DFHMDF POS=(12,03),                                            X03430002
               LENGTH=08,                                              X03440001
               ATTRB=(ASKIP,NORM),                                     X03450000
               COLOR=BLUE                                               03460000
ADC4    DFHMDF POS=(12,13),                                            X03470000
               LENGTH=04,                                              X03480000
               ATTRB=(ASKIP,NORM),                                     X03490000
               COLOR=BLUE                                               03500000
ARCVR4  DFHMDF POS=(12,20),                                            X03510000
               LENGTH=04,                                              X03520000
               ATTRB=(ASKIP,NORM),                                     X03530000
               COLOR=BLUE                                               03540000
ADEPT4  DFHMDF POS=(12,28),                                            X03550000
               LENGTH=04,                                              X03560000
               ATTRB=(ASKIP,NORM),                                     X03570000
               COLOR=BLUE                                               03580000
ACLAS4  DFHMDF POS=(12,33),                                            X03590000
               LENGTH=04,                                              X03600000
               ATTRB=(ASKIP,NORM),                                     X03610000
               COLOR=BLUE                                               03620000
ACTNS4  DFHMDF POS=(12,40),                                            X03630000
               LENGTH=04,                                              X03640000
               ATTRB=(ASKIP,NORM),                                     X03650000
               COLOR=BLUE,                                             X03660000
               PICOUT='ZZZ9'                                            03670000
AADJ4   DFHMDF POS=(12,49),                                            X03680000
               LENGTH=04,                                              X03690000
               ATTRB=(ASKIP,NORM),                                     X03700000
               COLOR=BLUE,                                             X03710000
               PICOUT='ZZZ9'                                            03720000
ADMG4   DFHMDF POS=(12,59),                                            X03730000
               LENGTH=04,                                              X03740000
               ATTRB=(ASKIP,NORM),                                     X03750000
               COLOR=BLUE,                                             X03760000
               PICOUT='ZZZ9'                                            03770000
ACHG4   DFHMDF POS=(12,68),                                            X03780000
               LENGTH=08,                                              X03790000
               ATTRB=(ASKIP,NORM),                                     X03800000
               COLOR=BLUE,                                             X03810000
               PICOUT='ZZZZ9.99'                                        03820000
*                                                                       03830000
APO5    DFHMDF POS=(13,03),                                            X03840002
               LENGTH=08,                                              X03850001
               ATTRB=(ASKIP,NORM),                                     X03860000
               COLOR=BLUE                                               03870000
ADC5    DFHMDF POS=(13,13),                                            X03880000
               LENGTH=04,                                              X03890000
               ATTRB=(ASKIP,NORM),                                     X03900000
               COLOR=BLUE                                               03910000
ARCVR5  DFHMDF POS=(13,20),                                            X03920000
               LENGTH=04,                                              X03930000
               ATTRB=(ASKIP,NORM),                                     X03940000
               COLOR=BLUE                                               03950000
ADEPT5  DFHMDF POS=(13,28),                                            X03960000
               LENGTH=04,                                              X03970000
               ATTRB=(ASKIP,NORM),                                     X03980000
               COLOR=BLUE                                               03990000
ACLAS5  DFHMDF POS=(13,33),                                            X04000000
               LENGTH=04,                                              X04010000
               ATTRB=(ASKIP,NORM),                                     X04020000
               COLOR=BLUE                                               04030000
ACTNS5  DFHMDF POS=(13,40),                                            X04040000
               LENGTH=04,                                              X04050000
               ATTRB=(ASKIP,NORM),                                     X04060000
               COLOR=BLUE,                                             X04070000
               PICOUT='ZZZ9'                                            04080000
AADJ5   DFHMDF POS=(13,49),                                            X04090000
               LENGTH=04,                                              X04100000
               ATTRB=(ASKIP,NORM),                                     X04110000
               COLOR=BLUE,                                             X04120000
               PICOUT='ZZZ9'                                            04130000
ADMG5   DFHMDF POS=(13,59),                                            X04140000
               LENGTH=04,                                              X04150000
               ATTRB=(ASKIP,NORM),                                     X04160000
               COLOR=BLUE,                                             X04170000
               PICOUT='ZZZ9'                                            04180000
ACHG5   DFHMDF POS=(13,68),                                            X04190000
               LENGTH=08,                                              X04200000
               ATTRB=(ASKIP,NORM),                                     X04210000
               COLOR=BLUE,                                             X04220000
               PICOUT='ZZZZ9.99'                                        04230000
*                                                                       04240000
APO6    DFHMDF POS=(14,03),                                            X04250002
               LENGTH=08,                                              X04260001
               ATTRB=(ASKIP,NORM),                                     X04270000
               COLOR=BLUE                                               04280000
ADC6    DFHMDF POS=(14,13),                                            X04290000
               LENGTH=04,                                              X04300000
               ATTRB=(ASKIP,NORM),                                     X04310000
               COLOR=BLUE                                               04320000
ARCVR6  DFHMDF POS=(14,20),                                            X04330000
               LENGTH=04,                                              X04340000
               ATTRB=(ASKIP,NORM),                                     X04350000
               COLOR=BLUE                                               04360000
ADEPT6  DFHMDF POS=(14,28),                                            X04370000
               LENGTH=04,                                              X04380000
               ATTRB=(ASKIP,NORM),                                     X04390000
               COLOR=BLUE                                               04400000
ACLAS6  DFHMDF POS=(14,33),                                            X04410000
               LENGTH=04,                                              X04420000
               ATTRB=(ASKIP,NORM),                                     X04430000
               COLOR=BLUE                                               04440000
ACTNS6  DFHMDF POS=(14,40),                                            X04450000
               LENGTH=04,                                              X04460000
               ATTRB=(ASKIP,NORM),                                     X04470000
               COLOR=BLUE,                                             X04480000
               PICOUT='ZZZ9'                                            04490000
AADJ6   DFHMDF POS=(14,49),                                            X04500000
               LENGTH=04,                                              X04510000
               ATTRB=(ASKIP,NORM),                                     X04520000
               COLOR=BLUE,                                             X04530000
               PICOUT='ZZZ9'                                            04540000
ADMG6   DFHMDF POS=(14,59),                                            X04550000
               LENGTH=04,                                              X04560000
               ATTRB=(ASKIP,NORM),                                     X04570000
               COLOR=BLUE,                                             X04580000
               PICOUT='ZZZ9'                                            04590000
ACHG6   DFHMDF POS=(14,68),                                            X04600000
               LENGTH=08,                                              X04610000
               ATTRB=(ASKIP,NORM),                                     X04620000
               COLOR=BLUE,                                             X04630000
               PICOUT='ZZZZ9.99'                                        04640000
*                                                                       04650000
APO7    DFHMDF POS=(15,03),                                            X04660002
               LENGTH=08,                                              X04670001
               ATTRB=(ASKIP,NORM),                                     X04680000
               COLOR=BLUE                                               04690000
ADC7    DFHMDF POS=(15,13),                                            X04700000
               LENGTH=04,                                              X04710000
               ATTRB=(ASKIP,NORM),                                     X04720000
               COLOR=BLUE                                               04730000
ARCVR7  DFHMDF POS=(15,20),                                            X04740000
               LENGTH=04,                                              X04750000
               ATTRB=(ASKIP,NORM),                                     X04760000
               COLOR=BLUE                                               04770000
ADEPT7  DFHMDF POS=(15,28),                                            X04780000
               LENGTH=04,                                              X04790000
               ATTRB=(ASKIP,NORM),                                     X04800000
               COLOR=BLUE                                               04810000
ACLAS7  DFHMDF POS=(15,33),                                            X04820000
               LENGTH=04,                                              X04830000
               ATTRB=(ASKIP,NORM),                                     X04840000
               COLOR=BLUE                                               04850000
ACTNS7  DFHMDF POS=(15,40),                                            X04860000
               LENGTH=04,                                              X04870000
               ATTRB=(ASKIP,NORM),                                     X04880000
               COLOR=BLUE,                                             X04890000
               PICOUT='ZZZ9'                                            04900000
AADJ7   DFHMDF POS=(15,49),                                            X04910000
               LENGTH=04,                                              X04920000
               ATTRB=(ASKIP,NORM),                                     X04930000
               COLOR=BLUE,                                             X04940000
               PICOUT='ZZZ9'                                            04950000
ADMG7   DFHMDF POS=(15,59),                                            X04960000
               LENGTH=04,                                              X04970000
               ATTRB=(ASKIP,NORM),                                     X04980000
               COLOR=BLUE,                                             X04990000
               PICOUT='ZZZ9'                                            05000000
ACHG7   DFHMDF POS=(15,68),                                            X05010000
               LENGTH=08,                                              X05020000
               ATTRB=(ASKIP,NORM),                                     X05030000
               COLOR=BLUE,                                             X05040000
               PICOUT='ZZZZ9.99'                                        05050000
*                                                                       05060000
APO8    DFHMDF POS=(16,03),                                            X05070002
               LENGTH=08,                                              X05080001
               ATTRB=(ASKIP,NORM),                                     X05090000
               COLOR=BLUE                                               05100000
ADC8    DFHMDF POS=(16,13),                                            X05110000
               LENGTH=04,                                              X05120000
               ATTRB=(ASKIP,NORM),                                     X05130000
               COLOR=BLUE                                               05140000
ARCVR8  DFHMDF POS=(16,20),                                            X05150000
               LENGTH=04,                                              X05160000
               ATTRB=(ASKIP,NORM),                                     X05170000
               COLOR=BLUE                                               05180000
ADEPT8  DFHMDF POS=(16,28),                                            X05190000
               LENGTH=04,                                              X05200000
               ATTRB=(ASKIP,NORM),                                     X05210000
               COLOR=BLUE                                               05220000
ACLAS8  DFHMDF POS=(16,33),                                            X05230000
               LENGTH=04,                                              X05240000
               ATTRB=(ASKIP,NORM),                                     X05250000
               COLOR=BLUE                                               05260000
ACTNS8  DFHMDF POS=(16,40),                                            X05270000
               LENGTH=04,                                              X05280000
               ATTRB=(ASKIP,NORM),                                     X05290000
               COLOR=BLUE,                                             X05300000
               PICOUT='ZZZ9'                                            05310000
AADJ8   DFHMDF POS=(16,49),                                            X05320000
               LENGTH=04,                                              X05330000
               ATTRB=(ASKIP,NORM),                                     X05340000
               COLOR=BLUE,                                             X05350000
               PICOUT='ZZZ9'                                            05360000
ADMG8   DFHMDF POS=(16,59),                                            X05370000
               LENGTH=04,                                              X05380000
               ATTRB=(ASKIP,NORM),                                     X05390000
               COLOR=BLUE,                                             X05400000
               PICOUT='ZZZ9'                                            05410000
ACHG8   DFHMDF POS=(16,68),                                            X05420000
               LENGTH=08,                                              X05430000
               ATTRB=(ASKIP,NORM),                                     X05440000
               COLOR=BLUE,                                             X05450000
               PICOUT='ZZZZ9.99'                                        05460000
*                                                                       05470000
APO9    DFHMDF POS=(17,03),                                            X05480002
               LENGTH=08,                                              X05490001
               ATTRB=(ASKIP,NORM),                                     X05500000
               COLOR=BLUE                                               05510000
ADC9    DFHMDF POS=(17,13),                                            X05520000
               LENGTH=04,                                              X05530000
               ATTRB=(ASKIP,NORM),                                     X05540000
               COLOR=BLUE                                               05550000
ARCVR9  DFHMDF POS=(17,20),                                            X05560000
               LENGTH=04,                                              X05570000
               ATTRB=(ASKIP,NORM),                                     X05580000
               COLOR=BLUE                                               05590000
ADEPT9  DFHMDF POS=(17,28),                                            X05600000
               LENGTH=04,                                              X05610000
               ATTRB=(ASKIP,NORM),                                     X05620000
               COLOR=BLUE                                               05630000
ACLAS9  DFHMDF POS=(17,33),                                            X05640000
               LENGTH=04,                                              X05650000
               ATTRB=(ASKIP,NORM),                                     X05660000
               COLOR=BLUE                                               05670000
ACTNS9  DFHMDF POS=(17,40),                                            X05680000
               LENGTH=04,                                              X05690000
               ATTRB=(ASKIP,NORM),                                     X05700000
               COLOR=BLUE,                                             X05710000
               PICOUT='ZZZ9'                                            05720000
AADJ9   DFHMDF POS=(17,49),                                            X05730000
               LENGTH=04,                                              X05740000
               ATTRB=(ASKIP,NORM),                                     X05750000
               COLOR=BLUE,                                             X05760000
               PICOUT='ZZZ9'                                            05770000
ADMG9   DFHMDF POS=(17,59),                                            X05780000
               LENGTH=04,                                              X05790000
               ATTRB=(ASKIP,NORM),                                     X05800000
               COLOR=BLUE,                                             X05810000
               PICOUT='ZZZ9'                                            05820000
ACHG9   DFHMDF POS=(17,68),                                            X05830000
               LENGTH=08,                                              X05840000
               ATTRB=(ASKIP,NORM),                                     X05850000
               COLOR=BLUE,                                             X05860000
               PICOUT='ZZZZ9.99'                                        05870000
*                                                                       05880000
APO10   DFHMDF POS=(18,03),                                            X05890002
               LENGTH=08,                                              X05900001
               ATTRB=(ASKIP,NORM),                                     X05910000
               COLOR=BLUE                                               05920000
ADC10   DFHMDF POS=(18,13),                                            X05930000
               LENGTH=04,                                              X05940000
               ATTRB=(ASKIP,NORM),                                     X05950000
               COLOR=BLUE                                               05960000
ARCVR10 DFHMDF POS=(18,20),                                            X05970000
               LENGTH=04,                                              X05980000
               ATTRB=(ASKIP,NORM),                                     X05990000
               COLOR=BLUE                                               06000000
ADEPT10 DFHMDF POS=(18,28),                                            X06010000
               LENGTH=04,                                              X06020000
               ATTRB=(ASKIP,NORM),                                     X06030000
               COLOR=BLUE                                               06040000
ACLAS10 DFHMDF POS=(18,33),                                            X06050000
               LENGTH=04,                                              X06060000
               ATTRB=(ASKIP,NORM),                                     X06070000
               COLOR=BLUE                                               06080000
ACTNS10 DFHMDF POS=(18,40),                                            X06090000
               LENGTH=04,                                              X06100000
               ATTRB=(ASKIP,NORM),                                     X06110000
               COLOR=BLUE,                                             X06120000
               PICOUT='ZZZ9'                                            06130000
AADJ10  DFHMDF POS=(18,49),                                            X06140000
               LENGTH=04,                                              X06150000
               ATTRB=(ASKIP,NORM),                                     X06160000
               COLOR=BLUE,                                             X06170000
               PICOUT='ZZZ9'                                            06180000
ADMG10  DFHMDF POS=(18,59),                                            X06190000
               LENGTH=04,                                              X06200000
               ATTRB=(ASKIP,NORM),                                     X06210000
               COLOR=BLUE,                                             X06220000
               PICOUT='ZZZ9'                                            06230000
ACHG10  DFHMDF POS=(18,68),                                            X06240000
               LENGTH=08,                                              X06250000
               ATTRB=(ASKIP,NORM),                                     X06260000
               COLOR=BLUE,                                             X06270000
               PICOUT='ZZZZ9.99'                                        06280000
*                                                                       06290000
        DFHMDF POS=(19,29),                                            X06300000
               LENGTH=06,                                              X06310000
               ATTRB=(ASKIP,NORM),                                     X06320000
               COLOR=NEUTRAL,                                          X06330000
               INITIAL='TOTAL:'                                         06340000
ATCTNS  DFHMDF POS=(19,39),                                            X06350000
               LENGTH=05,                                              X06360000
               ATTRB=(ASKIP,NORM),                                     X06370000
               COLOR=BLUE,                                             X06380000
               PICOUT='ZZZZ9'                                           06390000
ATADJ   DFHMDF POS=(19,48),                                            X06400000
               LENGTH=05,                                              X06410000
               ATTRB=(ASKIP,NORM),                                     X06420000
               COLOR=BLUE,                                             X06430000
               PICOUT='ZZZZ9'                                           06440000
ATDMG   DFHMDF POS=(19,58),                                            X06450000
               LENGTH=05,                                              X06460000
               ATTRB=(ASKIP,NORM),                                     X06470000
               COLOR=BLUE,                                             X06480000
               PICOUT='ZZZZ9'                                           06490000
ATCHG   DFHMDF POS=(19,67),                                            X06500000
               LENGTH=09,                                              X06510000
               ATTRB=(ASKIP,NORM),                                     X06520000
               COLOR=BLUE,                                             X06530000
               PICOUT='ZZZZZ9.99'                                       06540000
*                                                                       06550000
         DFHMSD TYPE=FINAL                                              06560000
         END                                                            06570000
