*          DATA SET TRKM168                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM168                                            *   00004   
*        MAP     TR168A                                             *   00005   
*        PROGRAM TRKCS168                                           *   00006   
*        TRANSID Y168                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM168 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR168A  DFHMDI LINE=2,                                                 X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*********************                                                           
********TOP OF SCREEN                                                           
*********************                                                           
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PO NO:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(02,01)                                              00043   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               PICOUT='ZZZZZZZ9',                                      X        
               POS=(02,08)                                              00047   
AVNDNME DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=30,                                              X00046   
               POS=(02,17)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VEND STYLE:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(02,48)                                              00043   
AVNDSTY DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=20,                                              X00046   
               POS=(02,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DEPT.:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(03,01)                                              00043   
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               PICOUT='ZZZ9',                                          X        
               POS=(03,08)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='START X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(03,18)                                              00043   
ASTXFDT DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(03,37)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='OTB.......:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(03,48)                                              00043   
AOTB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=06,                                              X00046   
               POS=(03,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CNTRY:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(04,01)                                              00043   
ACNTRY  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(04,08)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LAST  X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(04,18)                                              00043   
ALTXFDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,37)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ORD UNTS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(04,48)                                              00043   
AUNTS   DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=07,                                              X00046   
               PICOUT='ZZZZZZZ',                                       X        
               POS=(04,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(05,01)                                              00043   
AFOB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               POS=(05,08)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DONT SHIP BEFORE.:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(05,18)                                              00043   
ADSHBEF DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,37)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='EST CTNS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(05,48)                                              00043   
ACTNS   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               PICOUT='ZZZZZ',                                         X00046   
               POS=(05,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(06,01)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,08)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CANCEL:',                                      X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=07,                                              X00042   
               POS=(06,18)                                              00043   
ACANDT  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,26)                                              00047   
AXCANDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,37)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='AD DTE....:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(06,48)                                              00043   
AADDT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,60)                                              00047   
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(07,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(07,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(07,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(07,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(07,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=1,                                               X00042   
               POS=(07,74)                                              00043   
*********************                                                           
********HEADINGS                                                                
*********************                                                           
        DFHMDF POS=(08,33),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CONTR'                                          00061   
        DFHMDF POS=(08,39),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='TRLR'                                           00061   
        DFHMDF POS=(08,45),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='TRLR'                                           00061   
        DFHMDF POS=(08,51),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='MLT'                                            00061   
        DFHMDF POS=(08,56),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='RCVR'                                           00061   
        DFHMDF POS=(09,01),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S ACT'                                          00061   
        DFHMDF POS=(09,07),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='SCAC'                                           00061   
        DFHMDF POS=(09,13),LENGTH=07,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='TRAILER'                                        00061   
        DFHMDF POS=(09,24),LENGTH=07,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CARTONS'                                        00061   
        DFHMDF POS=(09,33),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='DEVAN'                                          00061   
        DFHMDF POS=(09,39),LENGTH=5,ATTRB=(PROT,NORM),                 X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='AVAIL'                                          00064   
        DFHMDF POS=(09,45),LENGTH=05,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='PCKUP'                                          00067   
        DFHMDF POS=(09,51),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SHP'                                            00067   
        DFHMDF POS=(09,56),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SEQ'                                            00067   
        DFHMDF POS=(09,62),LENGTH=02,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='DC'                                             00067   
        DFHMDF POS=(09,68),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ETA'                                            00067   
        DFHMDF POS=(09,75),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ATA'                                            00067   
*********************                                                           
********LIST ITEM AREA                                                          
*********************                                                           
*                                                                               
ASEL01  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT01  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC01 DFHMDF POS=(10,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL01  DFHMDF POS=(10,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART01 DFHMDF POS=(10,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV01 DFHMDF POS=(10,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV01 DFHMDF POS=(10,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV01 DFHMDF POS=(10,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP01 DFHMDF POS=(10,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC01   DFHMDF POS=(10,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC01   DFHMDF POS=(10,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA01  DFHMDF POS=(10,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA01  DFHMDF POS=(10,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
*                                                                               
ASEL02  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT02  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC02 DFHMDF POS=(11,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL02  DFHMDF POS=(11,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART02 DFHMDF POS=(11,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV02 DFHMDF POS=(11,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV02 DFHMDF POS=(11,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV02 DFHMDF POS=(11,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP02 DFHMDF POS=(11,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC02   DFHMDF POS=(11,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC02   DFHMDF POS=(11,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA02  DFHMDF POS=(11,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA02  DFHMDF POS=(11,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
*                                                                               
ASEL03  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT03  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC03 DFHMDF POS=(12,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL03  DFHMDF POS=(12,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART03 DFHMDF POS=(12,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV03 DFHMDF POS=(12,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV03 DFHMDF POS=(12,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV03 DFHMDF POS=(12,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP03 DFHMDF POS=(12,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC03   DFHMDF POS=(12,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC03   DFHMDF POS=(12,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA03  DFHMDF POS=(12,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA03  DFHMDF POS=(12,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
*                                                                               
ASEL04  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT04  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC04 DFHMDF POS=(13,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL04  DFHMDF POS=(13,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART04 DFHMDF POS=(13,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV04 DFHMDF POS=(13,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV04 DFHMDF POS=(13,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV04 DFHMDF POS=(13,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP04 DFHMDF POS=(13,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC04   DFHMDF POS=(13,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC04   DFHMDF POS=(13,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA04  DFHMDF POS=(13,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA04  DFHMDF POS=(13,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
*                                                                               
ASEL05  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT05  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC05 DFHMDF POS=(14,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL05  DFHMDF POS=(14,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART05 DFHMDF POS=(14,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV05 DFHMDF POS=(14,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV05 DFHMDF POS=(14,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV05 DFHMDF POS=(14,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP05 DFHMDF POS=(14,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC05   DFHMDF POS=(14,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC05   DFHMDF POS=(14,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA05  DFHMDF POS=(14,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA05  DFHMDF POS=(14,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
*                                                                               
ASEL06  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT06  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC06 DFHMDF POS=(15,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL06  DFHMDF POS=(15,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART06 DFHMDF POS=(15,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV06 DFHMDF POS=(15,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV06 DFHMDF POS=(15,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV06 DFHMDF POS=(15,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP06 DFHMDF POS=(15,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC06   DFHMDF POS=(15,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC06   DFHMDF POS=(15,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA06  DFHMDF POS=(15,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA06  DFHMDF POS=(15,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
*                                                                               
ASEL07  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT07  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC07 DFHMDF POS=(16,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL07  DFHMDF POS=(16,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART07 DFHMDF POS=(16,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV07 DFHMDF POS=(16,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV07 DFHMDF POS=(16,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV07 DFHMDF POS=(16,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP07 DFHMDF POS=(16,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC07   DFHMDF POS=(16,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC07   DFHMDF POS=(16,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA07  DFHMDF POS=(16,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA07  DFHMDF POS=(16,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
*                                                                               
ASEL08  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT08  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASCAC08 DFHMDF POS=(17,07),LENGTH=04,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRL08  DFHMDF POS=(17,12),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART08 DFHMDF POS=(17,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
ACTDV08 DFHMDF POS=(17,33),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ATRAV08 DFHMDF POS=(17,39),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ATRDV08 DFHMDF POS=(17,45),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASHIP08 DFHMDF POS=(17,52),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARC08   DFHMDF POS=(17,56),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ADC08   DFHMDF POS=(17,61),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA08  DFHMDF POS=(17,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA08  DFHMDF POS=(17,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
        DFHMDF POS=(18,17),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,INITIAL='TOTAL:'                            00094   
ATOTCNT DFHMDF POS=(18,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZZZ9'                            00094   
*                                                                               
        DFHMDF POS=(19,45),                                            X        
               LENGTH=25,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT  DFHMDF POS=(19,72),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
*                                                                               
*                                                                               
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
