*          DATA SET TRKM143    AT LEVEL 006 AS OF 02/28/94                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM143                                            *   00004**5
*        MAP     TR143A                                             *   00005**5
*        PROGRAM TRKCS143                                           *   00006**5
*        TRANSID Y143                                               *   00007**5
*        SYSTEM  CICS ARCH - TRAFFIC FREIGHT BILL LIST              *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM143 DFHMSD TYPE=DSECT,                                             X00011**5
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR143A  DFHMDI LINE=2,COLUMN=1,                                        X00017**5
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF POS=(03,44),                                            X00023   
               LENGTH=05,                                              X00024   
               ATTRB=(ASKIP,NORM),                                     X00025   
               COLOR=NEUTRAL,                                          X00026   
               INITIAL='ITEMS'                                          00027   
ASTRTIT DFHMDF POS=(03,50),                                            X00028   
               LENGTH=07,                                              X00029   
               ATTRB=(NUM,UNPROT,NORM),                                X00030   
               COLOR=GREEN,                                            X00031   
               HILIGHT=UNDERLINE,                                      X00032   
               PICOUT='ZZZ,ZZ9'                                         00033   
        DFHMDF POS=(03,58),                                            X00034   
               LENGTH=02,                                              X00035   
               ATTRB=(ASKIP,NORM),                                     X00036   
               COLOR=NEUTRAL,                                          X00037   
               INITIAL='TO'                                             00038   
AENDIT  DFHMDF POS=(03,61),                                            X00039   
               LENGTH=07,                                              X00040   
               ATTRB=(ASKIP,NORM,FSET),                                X00041   
               COLOR=BLUE,                                             X00042   
               PICOUT='ZZZ,ZZ9'                                         00043   
        DFHMDF POS=(03,69),                                            X00044   
               LENGTH=02,                                              X00045   
               ATTRB=(ASKIP,NORM),                                     X00046   
               COLOR=NEUTRAL,                                          X00047   
               INITIAL='OF'                                             00048   
ATOTIT  DFHMDF POS=(03,72),                                            X00049   
               LENGTH=07,                                              X00050   
               ATTRB=(ASKIP,NORM),                                     X00051   
               COLOR=BLUE,                                             X00052   
               PICOUT='ZZZ,ZZ9'                                         00053   
*                                                                       00054   
        DFHMDF POS=(04,55),                                            X00055   
               LENGTH=11,                                              X00056   
               ATTRB=(ASKIP,BRT),                                      X00057   
               INITIAL='PRINTER ID:'                                    00058   
APRINTR DFHMDF ATTRB=(UNPROT,NORM),                                    X00059   
               LENGTH=08,                                              X00060   
               COLOR=GREEN,                                            X00061   
               HILIGHT=UNDERLINE,                                      X00062   
               POS=(04,68),                                            X00063   
               PICOUT='ZZZZZZZZ'                                        00064   
        DFHMDF ATTRB=(ASKIP),                                          X00065   
               LENGTH=01,                                              X00066   
               POS=(04,79)                                              00067   
*                                                                       00068   
        DFHMDF POS=(05,02),                                            X00069   
               LENGTH=12,                                              X00070   
               ATTRB=(ASKIP,BRT),                                      X00071   
               INITIAL='PO NUMBER..:'                                   00072   
APONBR  DFHMDF POS=(05,15),                                            X00073   
               LENGTH=08,                                              X00074   
               ATTRB=(ASKIP,NORM),                                     X00075   
               COLOR=BLUE                                               00076   
        DFHMDF POS=(05,25),                                            X00077   
               LENGTH=13,                                              X00078   
               ATTRB=(ASKIP,BRT),                                      X00079   
               INITIAL='ARRIVAL DATE:'                                  00080**6
ARCPTB  DFHMDF POS=(05,39),                                            X00081   
               LENGTH=08,                                              X00082   
               ATTRB=(ASKIP,NORM),                                     X00083   
               COLOR=BLUE                                               00084   
        DFHMDF POS=(05,48),                                            X00085   
               LENGTH=08,                                              X00086   
               ATTRB=(ASKIP,BRT),                                      X00087   
               INITIAL='THROUGH:'                                       00088   
ARCPTE  DFHMDF POS=(05,57),                                            X00089   
               LENGTH=08,                                              X00090   
               ATTRB=(ASKIP,NORM),                                     X00091   
               COLOR=BLUE                                               00092   
*                                                                       00093   
        DFHMDF POS=(06,02),                                            X00094   
               LENGTH=12,                                              X00095   
               ATTRB=(ASKIP,BRT),                                      X00096   
               INITIAL='VENDOR NAME:'                                   00097   
AVNAME  DFHMDF POS=(06,15),                                            X00098   
               LENGTH=25,                                              X00099   
               ATTRB=(ASKIP,NORM),                                     X00100   
               COLOR=BLUE                                               00101   
*                                                                       00102   
        DFHMDF POS=(07,53),                                            X00103   
               LENGTH=26,                                              X00104   
               ATTRB=(ASKIP,BRT),                                      X00105   
               INITIAL='CARRIER   VENDOR   ARRIVAL'                     00106**6
*                                                                       00107   
        DFHMDF POS=(08,02),                                            X00108   
               LENGTH=34,                                              X00109   
               ATTRB=(ASKIP,BRT),                                      X00110   
               INITIAL='SEL ACT REC SEQ   FREIGHT BILL NBR'             00111   
        DFHMDF POS=(08,37),                                            X00112   
               LENGTH=24,                                              X00113   
               ATTRB=(ASKIP,BRT),                                      X00114   
               INITIAL='CARR TRAILER    SHIP DTE'                       00115   
        DFHMDF POS=(08,62),                                            X00116   
               LENGTH=15,                                              X00117   
               ATTRB=(ASKIP,BRT),                                      X00118   
               INITIAL='SHIP DTE   DATE'                                00119   
*                                                                       00120   
ASEL1   DFHMDF POS=(09,03),                                            X00121   
               LENGTH=01,                                              X00122   
               ATTRB=(UNPROT,NORM),                                    X00123   
               COLOR=GREEN,                                            X00124   
               HILIGHT=UNDERLINE                                        00125   
        DFHMDF POS=(09,05),                                            X00126   
               LENGTH=00,                                              X00127   
               ATTRB=(ASKIP)                                            00128   
AACT1   DFHMDF POS=(09,06),                                            X00129   
               LENGTH=03,                                              X00130   
               ATTRB=(ASKIP,NORM),                                     X00131   
               COLOR=BLUE                                               00132   
ARCVR1  DFHMDF POS=(09,10),                                            X00133   
               LENGTH=04,                                              X00134   
               ATTRB=(ASKIP,NORM),                                     X00135   
               COLOR=BLUE                                               00136   
APRO1   DFHMDF POS=(09,20),                                            X00137   
               LENGTH=16,                                              X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               COLOR=BLUE                                               00140   
ASCAC1  DFHMDF POS=(09,37),                                            X00141   
               LENGTH=04,                                              X00142   
               ATTRB=(ASKIP,NORM),                                     X00143   
               COLOR=BLUE                                               00144   
ATRLR1  DFHMDF POS=(09,42),                                            X00145   
               LENGTH=10,                                              X00146   
               ATTRB=(ASKIP,NORM),                                     X00147   
               COLOR=BLUE                                               00148   
ASDT1   DFHMDF POS=(09,53),                                            X00149   
               LENGTH=08,                                              X00150   
               ATTRB=(ASKIP,NORM),                                     X00151   
               COLOR=BLUE                                               00152   
AVDT1   DFHMDF POS=(09,62),                                            X00153   
               LENGTH=08,                                              X00154   
               ATTRB=(ASKIP,NORM),                                     X00155   
               COLOR=BLUE                                               00156   
ARDT1   DFHMDF POS=(09,71),                                            X00157   
               LENGTH=08,                                              X00158   
               ATTRB=(ASKIP,NORM),                                     X00159   
               COLOR=BLUE                                               00160   
*                                                                       00161   
ASEL2   DFHMDF POS=(10,03),                                            X00162   
               LENGTH=01,                                              X00163   
               ATTRB=(UNPROT,NORM),                                    X00164   
               COLOR=GREEN,                                            X00165   
               HILIGHT=UNDERLINE                                        00166   
        DFHMDF POS=(10,05),                                            X00167   
               LENGTH=00,                                              X00168   
               ATTRB=(ASKIP)                                            00169   
AACT2   DFHMDF POS=(10,06),                                            X00170   
               LENGTH=03,                                              X00171   
               ATTRB=(ASKIP,NORM),                                     X00172   
               COLOR=BLUE                                               00173   
ARCVR2  DFHMDF POS=(10,10),                                            X00174   
               LENGTH=04,                                              X00175   
               ATTRB=(ASKIP,NORM),                                     X00176   
               COLOR=BLUE                                               00177   
APRO2   DFHMDF POS=(10,20),                                            X00178   
               LENGTH=16,                                              X00179   
               ATTRB=(ASKIP,NORM),                                     X00180   
               COLOR=BLUE                                               00181   
ASCAC2  DFHMDF POS=(10,37),                                            X00182   
               LENGTH=04,                                              X00183   
               ATTRB=(ASKIP,NORM),                                     X00184   
               COLOR=BLUE                                               00185   
ATRLR2  DFHMDF POS=(10,42),                                            X00186   
               LENGTH=10,                                              X00187   
               ATTRB=(ASKIP,NORM),                                     X00188   
               COLOR=BLUE                                               00189   
ASDT2   DFHMDF POS=(10,53),                                            X00190   
               LENGTH=08,                                              X00191   
               ATTRB=(ASKIP,NORM),                                     X00192   
               COLOR=BLUE                                               00193   
AVDT2   DFHMDF POS=(10,62),                                            X00194   
               LENGTH=08,                                              X00195   
               ATTRB=(ASKIP,NORM),                                     X00196   
               COLOR=BLUE                                               00197   
ARDT2   DFHMDF POS=(10,71),                                            X00198   
               LENGTH=08,                                              X00199   
               ATTRB=(ASKIP,NORM),                                     X00200   
               COLOR=BLUE                                               00201   
*                                                                       00202   
ASEL3   DFHMDF POS=(11,03),                                            X00203   
               LENGTH=01,                                              X00204   
               ATTRB=(UNPROT,NORM),                                    X00205   
               COLOR=GREEN,                                            X00206   
               HILIGHT=UNDERLINE                                        00207   
        DFHMDF POS=(11,05),                                            X00208   
               LENGTH=00,                                              X00209   
               ATTRB=(ASKIP)                                            00210   
AACT3   DFHMDF POS=(11,06),                                            X00211   
               LENGTH=03,                                              X00212   
               ATTRB=(ASKIP,NORM),                                     X00213   
               COLOR=BLUE                                               00214   
ARCVR3  DFHMDF POS=(11,10),                                            X00215   
               LENGTH=04,                                              X00216   
               ATTRB=(ASKIP,NORM),                                     X00217   
               COLOR=BLUE                                               00218   
APRO3   DFHMDF POS=(11,20),                                            X00219   
               LENGTH=16,                                              X00220   
               ATTRB=(ASKIP,NORM),                                     X00221   
               COLOR=BLUE                                               00222   
ASCAC3  DFHMDF POS=(11,37),                                            X00223   
               LENGTH=04,                                              X00224   
               ATTRB=(ASKIP,NORM),                                     X00225   
               COLOR=BLUE                                               00226   
ATRLR3  DFHMDF POS=(11,42),                                            X00227   
               LENGTH=10,                                              X00228   
               ATTRB=(ASKIP,NORM),                                     X00229   
               COLOR=BLUE                                               00230   
ASDT3   DFHMDF POS=(11,53),                                            X00231   
               LENGTH=08,                                              X00232   
               ATTRB=(ASKIP,NORM),                                     X00233   
               COLOR=BLUE                                               00234   
AVDT3   DFHMDF POS=(11,62),                                            X00235   
               LENGTH=08,                                              X00236   
               ATTRB=(ASKIP,NORM),                                     X00237   
               COLOR=BLUE                                               00238   
ARDT3   DFHMDF POS=(11,71),                                            X00239   
               LENGTH=08,                                              X00240   
               ATTRB=(ASKIP,NORM),                                     X00241   
               COLOR=BLUE                                               00242   
*                                                                       00243   
ASEL4   DFHMDF POS=(12,03),                                            X00244   
               LENGTH=01,                                              X00245   
               ATTRB=(UNPROT,NORM),                                    X00246   
               COLOR=GREEN,                                            X00247   
               HILIGHT=UNDERLINE                                        00248   
        DFHMDF POS=(12,05),                                            X00249   
               LENGTH=00,                                              X00250   
               ATTRB=(ASKIP)                                            00251   
AACT4   DFHMDF POS=(12,06),                                            X00252   
               LENGTH=03,                                              X00253   
               ATTRB=(ASKIP,NORM),                                     X00254   
               COLOR=BLUE                                               00255   
ARCVR4  DFHMDF POS=(12,10),                                            X00256   
               LENGTH=04,                                              X00257   
               ATTRB=(ASKIP,NORM),                                     X00258   
               COLOR=BLUE                                               00259   
APRO4   DFHMDF POS=(12,20),                                            X00260   
               LENGTH=16,                                              X00261   
               ATTRB=(ASKIP,NORM),                                     X00262   
               COLOR=BLUE                                               00263   
ASCAC4  DFHMDF POS=(12,37),                                            X00264   
               LENGTH=04,                                              X00265   
               ATTRB=(ASKIP,NORM),                                     X00266   
               COLOR=BLUE                                               00267   
ATRLR4  DFHMDF POS=(12,42),                                            X00268   
               LENGTH=10,                                              X00269   
               ATTRB=(ASKIP,NORM),                                     X00270   
               COLOR=BLUE                                               00271   
ASDT4   DFHMDF POS=(12,53),                                            X00272   
               LENGTH=08,                                              X00273   
               ATTRB=(ASKIP,NORM),                                     X00274   
               COLOR=BLUE                                               00275   
AVDT4   DFHMDF POS=(12,62),                                            X00276   
               LENGTH=08,                                              X00277   
               ATTRB=(ASKIP,NORM),                                     X00278   
               COLOR=BLUE                                               00279   
ARDT4   DFHMDF POS=(12,71),                                            X00280   
               LENGTH=08,                                              X00281   
               ATTRB=(ASKIP,NORM),                                     X00282   
               COLOR=BLUE                                               00283   
*                                                                       00284   
ASEL5   DFHMDF POS=(13,03),                                            X00285   
               LENGTH=01,                                              X00286   
               ATTRB=(UNPROT,NORM),                                    X00287   
               COLOR=GREEN,                                            X00288   
               HILIGHT=UNDERLINE                                        00289   
        DFHMDF POS=(13,05),                                            X00290   
               LENGTH=00,                                              X00291   
               ATTRB=(ASKIP)                                            00292   
AACT5   DFHMDF POS=(13,06),                                            X00293   
               LENGTH=03,                                              X00294   
               ATTRB=(ASKIP,NORM),                                     X00295   
               COLOR=BLUE                                               00296   
ARCVR5  DFHMDF POS=(13,10),                                            X00297   
               LENGTH=04,                                              X00298   
               ATTRB=(ASKIP,NORM),                                     X00299   
               COLOR=BLUE                                               00300   
APRO5   DFHMDF POS=(13,20),                                            X00301   
               LENGTH=16,                                              X00302   
               ATTRB=(ASKIP,NORM),                                     X00303   
               COLOR=BLUE                                               00304   
ASCAC5  DFHMDF POS=(13,37),                                            X00305   
               LENGTH=04,                                              X00306   
               ATTRB=(ASKIP,NORM),                                     X00307   
               COLOR=BLUE                                               00308   
ATRLR5  DFHMDF POS=(13,42),                                            X00309   
               LENGTH=10,                                              X00310   
               ATTRB=(ASKIP,NORM),                                     X00311   
               COLOR=BLUE                                               00312   
ASDT5   DFHMDF POS=(13,53),                                            X00313   
               LENGTH=08,                                              X00314   
               ATTRB=(ASKIP,NORM),                                     X00315   
               COLOR=BLUE                                               00316   
AVDT5   DFHMDF POS=(13,62),                                            X00317   
               LENGTH=08,                                              X00318   
               ATTRB=(ASKIP,NORM),                                     X00319   
               COLOR=BLUE                                               00320   
ARDT5   DFHMDF POS=(13,71),                                            X00321   
               LENGTH=08,                                              X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               COLOR=BLUE                                               00324   
*                                                                       00325   
ASEL6   DFHMDF POS=(14,03),                                            X00326   
               LENGTH=01,                                              X00327   
               ATTRB=(UNPROT,NORM),                                    X00328   
               COLOR=GREEN,                                            X00329   
               HILIGHT=UNDERLINE                                        00330   
        DFHMDF POS=(14,05),                                            X00331   
               LENGTH=00,                                              X00332   
               ATTRB=(ASKIP)                                            00333   
AACT6   DFHMDF POS=(14,06),                                            X00334   
               LENGTH=03,                                              X00335   
               ATTRB=(ASKIP,NORM),                                     X00336   
               COLOR=BLUE                                               00337   
ARCVR6  DFHMDF POS=(14,10),                                            X00338   
               LENGTH=04,                                              X00339   
               ATTRB=(ASKIP,NORM),                                     X00340   
               COLOR=BLUE                                               00341   
APRO6   DFHMDF POS=(14,20),                                            X00342   
               LENGTH=16,                                              X00343   
               ATTRB=(ASKIP,NORM),                                     X00344   
               COLOR=BLUE                                               00345   
ASCAC6  DFHMDF POS=(14,37),                                            X00346   
               LENGTH=04,                                              X00347   
               ATTRB=(ASKIP,NORM),                                     X00348   
               COLOR=BLUE                                               00349   
ATRLR6  DFHMDF POS=(14,42),                                            X00350   
               LENGTH=10,                                              X00351   
               ATTRB=(ASKIP,NORM),                                     X00352   
               COLOR=BLUE                                               00353   
ASDT6   DFHMDF POS=(14,53),                                            X00354   
               LENGTH=08,                                              X00355   
               ATTRB=(ASKIP,NORM),                                     X00356   
               COLOR=BLUE                                               00357   
AVDT6   DFHMDF POS=(14,62),                                            X00358   
               LENGTH=08,                                              X00359   
               ATTRB=(ASKIP,NORM),                                     X00360   
               COLOR=BLUE                                               00361   
ARDT6   DFHMDF POS=(14,71),                                            X00362   
               LENGTH=08,                                              X00363   
               ATTRB=(ASKIP,NORM),                                     X00364   
               COLOR=BLUE                                               00365   
*                                                                       00366   
ASEL7   DFHMDF POS=(15,03),                                            X00367   
               LENGTH=01,                                              X00368   
               ATTRB=(UNPROT,NORM),                                    X00369   
               COLOR=GREEN,                                            X00370   
               HILIGHT=UNDERLINE                                        00371   
        DFHMDF POS=(15,05),                                            X00372   
               LENGTH=00,                                              X00373   
               ATTRB=(ASKIP)                                            00374   
AACT7   DFHMDF POS=(15,06),                                            X00375   
               LENGTH=03,                                              X00376   
               ATTRB=(ASKIP,NORM),                                     X00377   
               COLOR=BLUE                                               00378   
ARCVR7  DFHMDF POS=(15,10),                                            X00379   
               LENGTH=04,                                              X00380   
               ATTRB=(ASKIP,NORM),                                     X00381   
               COLOR=BLUE                                               00382   
APRO7   DFHMDF POS=(15,20),                                            X00383   
               LENGTH=16,                                              X00384   
               ATTRB=(ASKIP,NORM),                                     X00385   
               COLOR=BLUE                                               00386   
ASCAC7  DFHMDF POS=(15,37),                                            X00387   
               LENGTH=04,                                              X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               COLOR=BLUE                                               00390   
ATRLR7  DFHMDF POS=(15,42),                                            X00391   
               LENGTH=10,                                              X00392   
               ATTRB=(ASKIP,NORM),                                     X00393   
               COLOR=BLUE                                               00394   
ASDT7   DFHMDF POS=(15,53),                                            X00395   
               LENGTH=08,                                              X00396   
               ATTRB=(ASKIP,NORM),                                     X00397   
               COLOR=BLUE                                               00398   
AVDT7   DFHMDF POS=(15,62),                                            X00399   
               LENGTH=08,                                              X00400   
               ATTRB=(ASKIP,NORM),                                     X00401   
               COLOR=BLUE                                               00402   
ARDT7   DFHMDF POS=(15,71),                                            X00403   
               LENGTH=08,                                              X00404   
               ATTRB=(ASKIP,NORM),                                     X00405   
               COLOR=BLUE                                               00406   
*                                                                       00407   
ASEL8   DFHMDF POS=(16,03),                                            X00408   
               LENGTH=01,                                              X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               COLOR=GREEN,                                            X00411   
               HILIGHT=UNDERLINE                                        00412   
        DFHMDF POS=(16,05),                                            X00413   
               LENGTH=00,                                              X00414   
               ATTRB=(ASKIP)                                            00415   
AACT8   DFHMDF POS=(16,06),                                            X00416   
               LENGTH=03,                                              X00417   
               ATTRB=(ASKIP,NORM),                                     X00418   
               COLOR=BLUE                                               00419   
ARCVR8  DFHMDF POS=(16,10),                                            X00420   
               LENGTH=04,                                              X00421   
               ATTRB=(ASKIP,NORM),                                     X00422   
               COLOR=BLUE                                               00423   
APRO8   DFHMDF POS=(16,20),                                            X00424   
               LENGTH=16,                                              X00425   
               ATTRB=(ASKIP,NORM),                                     X00426   
               COLOR=BLUE                                               00427   
ASCAC8  DFHMDF POS=(16,37),                                            X00428   
               LENGTH=04,                                              X00429   
               ATTRB=(ASKIP,NORM),                                     X00430   
               COLOR=BLUE                                               00431   
ATRLR8  DFHMDF POS=(16,42),                                            X00432   
               LENGTH=10,                                              X00433   
               ATTRB=(ASKIP,NORM),                                     X00434   
               COLOR=BLUE                                               00435   
ASDT8   DFHMDF POS=(16,53),                                            X00436   
               LENGTH=08,                                              X00437   
               ATTRB=(ASKIP,NORM),                                     X00438   
               COLOR=BLUE                                               00439   
AVDT8   DFHMDF POS=(16,62),                                            X00440   
               LENGTH=08,                                              X00441   
               ATTRB=(ASKIP,NORM),                                     X00442   
               COLOR=BLUE                                               00443   
ARDT8   DFHMDF POS=(16,71),                                            X00444   
               LENGTH=08,                                              X00445   
               ATTRB=(ASKIP,NORM),                                     X00446   
               COLOR=BLUE                                               00447   
*                                                                       00448   
ASEL9   DFHMDF POS=(17,03),                                            X00449   
               LENGTH=01,                                              X00450   
               ATTRB=(UNPROT,NORM),                                    X00451   
               COLOR=GREEN,                                            X00452   
               HILIGHT=UNDERLINE                                        00453   
        DFHMDF POS=(17,05),                                            X00454   
               LENGTH=00,                                              X00455   
               ATTRB=(ASKIP)                                            00456   
AACT9   DFHMDF POS=(17,06),                                            X00457   
               LENGTH=03,                                              X00458   
               ATTRB=(ASKIP,NORM),                                     X00459   
               COLOR=BLUE                                               00460   
ARCVR9  DFHMDF POS=(17,10),                                            X00461   
               LENGTH=04,                                              X00462   
               ATTRB=(ASKIP,NORM),                                     X00463   
               COLOR=BLUE                                               00464   
APRO9   DFHMDF POS=(17,20),                                            X00465   
               LENGTH=16,                                              X00466   
               ATTRB=(ASKIP,NORM),                                     X00467   
               COLOR=BLUE                                               00468   
ASCAC9  DFHMDF POS=(17,37),                                            X00469   
               LENGTH=04,                                              X00470   
               ATTRB=(ASKIP,NORM),                                     X00471   
               COLOR=BLUE                                               00472   
ATRLR9  DFHMDF POS=(17,42),                                            X00473   
               LENGTH=10,                                              X00474   
               ATTRB=(ASKIP,NORM),                                     X00475   
               COLOR=BLUE                                               00476   
ASDT9   DFHMDF POS=(17,53),                                            X00477   
               LENGTH=08,                                              X00478   
               ATTRB=(ASKIP,NORM),                                     X00479   
               COLOR=BLUE                                               00480   
AVDT9   DFHMDF POS=(17,62),                                            X00481   
               LENGTH=08,                                              X00482   
               ATTRB=(ASKIP,NORM),                                     X00483   
               COLOR=BLUE                                               00484   
ARDT9   DFHMDF POS=(17,71),                                            X00485   
               LENGTH=08,                                              X00486   
               ATTRB=(ASKIP,NORM),                                     X00487   
               COLOR=BLUE                                               00488   
*                                                                       00489   
ASEL10  DFHMDF POS=(18,03),                                            X00490   
               LENGTH=01,                                              X00491   
               ATTRB=(UNPROT,NORM),                                    X00492   
               COLOR=GREEN,                                            X00493   
               HILIGHT=UNDERLINE                                        00494   
        DFHMDF POS=(18,05),                                            X00495   
               LENGTH=00,                                              X00496   
               ATTRB=(ASKIP)                                            00497   
AACT10  DFHMDF POS=(18,06),                                            X00498   
               LENGTH=03,                                              X00499   
               ATTRB=(ASKIP,NORM),                                     X00500   
               COLOR=BLUE                                               00501   
ARCVR10 DFHMDF POS=(18,10),                                            X00502   
               LENGTH=04,                                              X00503   
               ATTRB=(ASKIP,NORM),                                     X00504   
               COLOR=BLUE                                               00505   
APRO10  DFHMDF POS=(18,20),                                            X00506   
               LENGTH=16,                                              X00507   
               ATTRB=(ASKIP,NORM),                                     X00508   
               COLOR=BLUE                                               00509   
ASCAC10 DFHMDF POS=(18,37),                                            X00510   
               LENGTH=04,                                              X00511   
               ATTRB=(ASKIP,NORM),                                     X00512   
               COLOR=BLUE                                               00513   
ATRLR10 DFHMDF POS=(18,42),                                            X00514   
               LENGTH=10,                                              X00515   
               ATTRB=(ASKIP,NORM),                                     X00516   
               COLOR=BLUE                                               00517   
ASDT10  DFHMDF POS=(18,53),                                            X00518   
               LENGTH=08,                                              X00519   
               ATTRB=(ASKIP,NORM),                                     X00520   
               COLOR=BLUE                                               00521   
AVDT10  DFHMDF POS=(18,62),                                            X00522   
               LENGTH=08,                                              X00523   
               ATTRB=(ASKIP,NORM),                                     X00524   
               COLOR=BLUE                                               00525   
ARDT10  DFHMDF POS=(18,71),                                            X00526   
               LENGTH=08,                                              X00527   
               ATTRB=(ASKIP,NORM),                                     X00528   
               COLOR=BLUE                                               00529   
*                                                                       00530   
        DFHMDF POS=(19,40),                                            X00531   
               LENGTH=25,                                              X00532   
               ATTRB=(ASKIP,NORM),                                     X00533   
               COLOR=NEUTRAL,                                          X00534   
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00535   
ASELIT  DFHMDF POS=(19,67),                                            X00536   
               LENGTH=07,                                              X00537   
               ATTRB=(ASKIP,NORM),                                     X00538   
               COLOR=BLUE,                                             X00539   
               PICOUT='ZZZ,ZZ9'                                         00540   
*                                                                       00541   
         DFHMSD TYPE=FINAL                                              00542   
         END                                                            00543   
