*          DATA SET TRKM140    AT LEVEL 001 AS OF 05/17/95              00010002
*          DATA SET TRKM140    AT LEVEL 001 AS OF 05/11/95              00020002
*          DATA SET TRKM140    AT LEVEL 005 AS OF 02/28/94              00030002
  PRINT  NOGEN                                                          00040002
*-------------------------------------------------------------------*   00050002
*                                                                   *   00060002
*        MAPSET  TRKM140                                            *   00070002
*        MAP     TR140A                                             *   00080002
*        PROGRAM TRKCS140                                           *   00090002
*        TRANSID Y140                                               *   00100002
*        SYSTEM  CICS ARCH - TRAFFIC FREIGHT BILL CRITERIA          *   00110002
*                            SPECIFICATION                          *   00120002
*                                                                   *   00130002
*-------------------------------------------------------------------*   00140002
TRKM140 DFHMSD TYPE=DSECT,                                             X00150002
               LANG=COBOL,                                             X00160002
               MODE=INOUT,                                             X00170002
               STORAGE=AUTO,                                           X00180002
               TIOAPFX=YES,                                            X00190002
               TERM=3270-2                                              00200002
TR140A  DFHMDI LINE=2,COLUMN=1,                                        X00210002
               SIZE=(19,80),                                           X00220002
               CTRL=(FREEKB),                                          X00230002
               MAPATTS=(COLOR,HILIGHT),                                X00240002
               DSATTS=(COLOR,HILIGHT)                                   00250002
*                                                                       00260002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00270002
               INITIAL='ENTER THE FOLLOWING TO CREATE A LIST OF RECEIVEX00280002
               RS OR ENTER FREIGHT INFO:',                             X00290002
               LENGTH=72,                                              X00300002
               COLOR=NEUTRAL,                                          X00310002
               POS=(04,02)                                              00320003
*                                                                       00330002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00340002
               INITIAL='CARRIER:',                                     X00350002
               LENGTH=08,                                              X00360002
               COLOR=NEUTRAL,                                          X00370002
               POS=(06,17)                                              00380003
*                                                                       00390002
ASCAC   DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00400004
               LENGTH=04,                                              X00410002
               COLOR=GREEN,                                            X00420002
               HILIGHT=UNDERLINE,                                      X00430002
               POS=(06,26)                                              00440003
        DFHMDF ATTRB=(ASKIP),                                          X00450002
               LENGTH=01,                                              X00460002
               POS=(06,31)                                              00470003
*                                                                       00480002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00490002
               INITIAL='FREIGHT BILL:',                                X00500002
               LENGTH=13,                                              X00510002
               COLOR=NEUTRAL,                                          X00520002
               POS=(08,12)                                              00530003
*                                                                       00540002
APRO    DFHMDF ATTRB=(UNPROT,NORM),                                    X00550002
               LENGTH=22,                                              X00560002
               COLOR=GREEN,                                            X00570002
               HILIGHT=UNDERLINE,                                      X00580002
               POS=(08,26)                                              00590003
        DFHMDF ATTRB=(ASKIP),                                          X00600002
               LENGTH=01,                                              X00610002
               POS=(08,49)                                              00620003
*                                                                       00630002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00640002
               INITIAL='PRINTER ID:',                                  X00650002
               LENGTH=11,                                              X00660002
               COLOR=NEUTRAL,                                          X00670002
               POS=(10,56)                                              00680003
*                                                                       00690002
APRINTR DFHMDF ATTRB=(UNPROT,NORM),                                    X00700002
               LENGTH=08,                                              X00710002
               COLOR=GREEN,                                            X00720002
               HILIGHT=UNDERLINE,                                      X00730002
               POS=(10,68),                                            X00740003
               PICOUT='ZZZZZZZZ'                                        00750002
        DFHMDF ATTRB=(ASKIP),                                          X00760002
               LENGTH=01,                                              X00770002
               POS=(10,77)                                              00780003
*                                                                       00790002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00800002
               INITIAL='ENTER THE FOLLOWING TO CREATE A LIST OF FREIGHTX00810002
                BILLS:',                                               X00820002
               LENGTH=54,                                              X00830002
               COLOR=NEUTRAL,                                          X00840002
               POS=(12,02)                                              00850003
*                                                                       00860002
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00870002
               INITIAL='PO NUMBER:',                                   X00880002
               LENGTH=10,                                              X00890002
               COLOR=NEUTRAL,                                          X00900002
               POS=(14,15)                                              00910003
*                                                                       00920002
APONBR  DFHMDF ATTRB=(UNPROT,NORM),                                    X00930004
               LENGTH=08,                                              X00940005
               COLOR=GREEN,                                            X00950002
               HILIGHT=UNDERLINE,                                      X00960002
               POS=(14,26)                                              00970003
        DFHMDF ATTRB=(ASKIP),                                          X00980002
               LENGTH=01,                                              X00990002
               POS=(14,35)                                              01000005
*                                                                       01010002
        DFHMSD TYPE=FINAL                                               01020002
        END                                                             01030002
