  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*        MAPSET  TRKM324                                            *   00004   
*        MAP     TR324A                                             *   00005   
*        PROGRAM TRKCS324                                           *   00006   
*        TRANSID Y324                                               *   00007   
*-------------------------------------------------------------------*   00010   
TRKM324 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR324A  DFHMDI LINE=2,COLUMN=1,                                        X00016   
               SIZE=(19,80),                                           X00017   
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT)                                   00018   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE CODE:',                                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=09,                                              X00042   
               POS=(03,05)                                              00043   
APOECDE DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(03,15)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FROM DATE:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(03,26)                                              00043   
AFRMDTE DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,37)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TO DATE:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(03,54)                                              00043   
ATODTE  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,63)                                              00047   
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DCNSLR',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(05,03)                                              00043   
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='SCAC',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(06,04)                                              00043   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VIEW',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(06,13)                                              00043   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CONTAINERS',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(06,21)                                              00043   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POS',                                          X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=03,                                              X00042   
               POS=(06,39)                                              00043   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CARTONS',                                      X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=07,                                              X00042   
               POS=(06,48)                                              00043   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CBM',                                          X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=03,                                              X00042   
               POS=(06,63)                                              00043   
*                                                                               
        DFHMDF POS=(07,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC01 DFHMDF POS=(07,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW01 DFHMDF POS=(07,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR01 DFHMDF POS=(07,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS01  DFHMDF POS=(07,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART01 DFHMDF POS=(07,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM01  DFHMDF POS=(07,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(07,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(08,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC02 DFHMDF POS=(08,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW02 DFHMDF POS=(08,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR02 DFHMDF POS=(08,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS02  DFHMDF POS=(08,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART02 DFHMDF POS=(08,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM02  DFHMDF POS=(08,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(08,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(09,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC03 DFHMDF POS=(09,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW03 DFHMDF POS=(09,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR03 DFHMDF POS=(09,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS03  DFHMDF POS=(09,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART03 DFHMDF POS=(09,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM03  DFHMDF POS=(09,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(09,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(10,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC04 DFHMDF POS=(10,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW04 DFHMDF POS=(10,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR04 DFHMDF POS=(10,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS04  DFHMDF POS=(10,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART04 DFHMDF POS=(10,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM04  DFHMDF POS=(10,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(10,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(11,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC05 DFHMDF POS=(11,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW05 DFHMDF POS=(11,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR05 DFHMDF POS=(11,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS05  DFHMDF POS=(11,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART05 DFHMDF POS=(11,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM05  DFHMDF POS=(11,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(11,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(12,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC06 DFHMDF POS=(12,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW06 DFHMDF POS=(12,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR06 DFHMDF POS=(12,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS06  DFHMDF POS=(12,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART06 DFHMDF POS=(12,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM06  DFHMDF POS=(12,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(12,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(13,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC07 DFHMDF POS=(13,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW07 DFHMDF POS=(13,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR07 DFHMDF POS=(13,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS07  DFHMDF POS=(13,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART07 DFHMDF POS=(13,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM07  DFHMDF POS=(13,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(13,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(14,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC08 DFHMDF POS=(14,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW08 DFHMDF POS=(14,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR08 DFHMDF POS=(14,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS08  DFHMDF POS=(14,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART08 DFHMDF POS=(14,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM08  DFHMDF POS=(14,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(14,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(15,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC09 DFHMDF POS=(15,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW09 DFHMDF POS=(15,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR09 DFHMDF POS=(15,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS09  DFHMDF POS=(15,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART09 DFHMDF POS=(15,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM09  DFHMDF POS=(15,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(15,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(16,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC10 DFHMDF POS=(16,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW10 DFHMDF POS=(16,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR10 DFHMDF POS=(16,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS10  DFHMDF POS=(16,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART10 DFHMDF POS=(16,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM10  DFHMDF POS=(16,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(16,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                               
        DFHMDF POS=(17,01),LENGTH=01,ATTRB=(ASKIP)                              
ASCAC11 DFHMDF POS=(17,03),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVIEW11 DFHMDF POS=(17,12),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR11 DFHMDF POS=(17,24),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
APOS11  DFHMDF POS=(17,35),LENGTH=07,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ACART11 DFHMDF POS=(17,48),LENGTH=07,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ACBM11  DFHMDF POS=(17,59),LENGTH=07,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
        DFHMDF POS=(17,79),LENGTH=01,ATTRB=(ASKIP)                              
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VIEW TOTALS:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(19,03)                                              00043   
*                                                                               
ATOTCNT DFHMDF POS=(19,24),LENGTH=07,ATTRB=(ASKIP),                    X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ATOTPO  DFHMDF POS=(19,35),LENGTH=07,ATTRB=(ASKIP),                    X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00090   
ATOTCRT DFHMDF POS=(19,48),LENGTH=07,ATTRB=(ASKIP),                    X00091   
               COLOR=BLUE,PICOUT='ZZZZZZZ',JUSTIFY=(RIGHT,BLANK)        00092   
ATOTCBM DFHMDF POS=(19,59),LENGTH=07,ATTRB=(ASKIP),                    X00093   
               COLOR=BLUE,PICOUT='ZZZZ.ZZ'                              00094   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
