*          DATA SET TRKM171                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM171                                            *   00004   
*        MAP     TR171A                                             *   00005   
*        PROGRAM TRKCS171                                           *   00006   
*        TRANSID Y171                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM171 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR171A  DFHMDI LINE=2,                                                 X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*********************                                                           
********TOP OF SCREEN                                                           
*********************                                                           
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PO NO:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(02,01)                                              00043   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               PICOUT='ZZZZZZZ9',                                      X        
               POS=(02,08)                                              00047   
AVNDNME DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=30,                                              X00046   
               POS=(02,17)                                              00047   
*********************                                                           
********MESSAGE                                                                 
*********************                                                           
AMSG    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=RED,                                              X00045   
               LENGTH=40,                                              X00046   
               POS=(04,01)                                              00047   
*********************                                                           
********TO/FROM                                                                 
*********************                                                           
        DFHMDF POS=(04,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(04,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(04,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(04,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(04,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(04,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=1,                                               X00042   
               POS=(04,74)                                              00043   
*********************                                                           
********HEADINGS                                                                
*********************                                                           
        DFHMDF POS=(05,43),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='PRE'                                            00061   
        DFHMDF POS=(05,49),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='ACT'                                            00061   
        DFHMDF POS=(05,62),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='LIQ'                                            00061   
        DFHMDF POS=(05,67),LENGTH=02,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='PO'                                             00061   
        DFHMDF POS=(05,70),LENGTH=02,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CN'                                             00061   
        DFHMDF POS=(05,73),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='LAST'                                           00061   
*********************                                                           
        DFHMDF POS=(06,02),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S ACT'                                          00061   
        DFHMDF POS=(06,10),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='ENTRY'                                          00061   
        DFHMDF POS=(06,21),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='POE'                                            00061   
        DFHMDF POS=(06,25),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='FILD'                                           00061   
        DFHMDF POS=(06,31),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='EXMD'                                           00061   
        DFHMDF POS=(06,37),LENGTH=04,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='REJD'                                           00064   
        DFHMDF POS=(06,43),LENGTH=04,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='CLRD'                                           00064   
        DFHMDF POS=(06,49),LENGTH=04,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='CLRD'                                           00064   
        DFHMDF POS=(06,55),LENGTH=04,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='LIQD'                                           00064   
        DFHMDF POS=(06,61),LENGTH=05,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SUSPD'                                          00067   
        DFHMDF POS=(06,67),LENGTH=02,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='CT'                                             00067   
        DFHMDF POS=(06,70),LENGTH=02,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='CT'                                             00067   
        DFHMDF POS=(06,73),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='TRN'                                            00067   
        DFHMDF POS=(06,79),LENGTH=01,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='H'                                              00061   
*********************                                                           
********LIST ITEM AREA                                                          
*********************                                                           
*                                                                               
ASEL01  DFHMDF POS=(07,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT01  DFHMDF POS=(07,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR01 DFHMDF POS=(07,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE01  DFHMDF POS=(07,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD01 DFHMDF POS=(07,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM01 DFHMDF POS=(07,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD01 DFHMDF POS=(07,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR01 DFHMDF POS=(07,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR01 DFHMDF POS=(07,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN01 DFHMDF POS=(07,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ01 DFHMDF POS=(07,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT01 DFHMDF POS=(07,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT01 DFHMDF POS=(07,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN01 DFHMDF POS=(07,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY01 DFHMDF POS=(07,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL02  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT02  DFHMDF POS=(08,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR02 DFHMDF POS=(08,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE02  DFHMDF POS=(08,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD02 DFHMDF POS=(08,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM02 DFHMDF POS=(08,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD02 DFHMDF POS=(08,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR02 DFHMDF POS=(08,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR02 DFHMDF POS=(08,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN02 DFHMDF POS=(08,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ02 DFHMDF POS=(08,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT02 DFHMDF POS=(08,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT02 DFHMDF POS=(08,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN02 DFHMDF POS=(08,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY02 DFHMDF POS=(08,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL03  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT03  DFHMDF POS=(09,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR03 DFHMDF POS=(09,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE03  DFHMDF POS=(09,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD03 DFHMDF POS=(09,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM03 DFHMDF POS=(09,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD03 DFHMDF POS=(09,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR03 DFHMDF POS=(09,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR03 DFHMDF POS=(09,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN03 DFHMDF POS=(09,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ03 DFHMDF POS=(09,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT03 DFHMDF POS=(09,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT03 DFHMDF POS=(09,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN03 DFHMDF POS=(09,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY03 DFHMDF POS=(09,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL04  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT04  DFHMDF POS=(10,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR04 DFHMDF POS=(10,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE04  DFHMDF POS=(10,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD04 DFHMDF POS=(10,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM04 DFHMDF POS=(10,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD04 DFHMDF POS=(10,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR04 DFHMDF POS=(10,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR04 DFHMDF POS=(10,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN04 DFHMDF POS=(10,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ04 DFHMDF POS=(10,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT04 DFHMDF POS=(10,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT04 DFHMDF POS=(10,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN04 DFHMDF POS=(10,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY04 DFHMDF POS=(10,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL05  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT05  DFHMDF POS=(11,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR05 DFHMDF POS=(11,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE05  DFHMDF POS=(11,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD05 DFHMDF POS=(11,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM05 DFHMDF POS=(11,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD05 DFHMDF POS=(11,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR05 DFHMDF POS=(11,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR05 DFHMDF POS=(11,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN05 DFHMDF POS=(11,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ05 DFHMDF POS=(11,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT05 DFHMDF POS=(11,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT05 DFHMDF POS=(11,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN05 DFHMDF POS=(11,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY05 DFHMDF POS=(11,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL06  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT06  DFHMDF POS=(12,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR06 DFHMDF POS=(12,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE06  DFHMDF POS=(12,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD06 DFHMDF POS=(12,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM06 DFHMDF POS=(12,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD06 DFHMDF POS=(12,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR06 DFHMDF POS=(12,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR06 DFHMDF POS=(12,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN06 DFHMDF POS=(12,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ06 DFHMDF POS=(12,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT06 DFHMDF POS=(12,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT06 DFHMDF POS=(12,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN06 DFHMDF POS=(12,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY06 DFHMDF POS=(12,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL07  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT07  DFHMDF POS=(13,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR07 DFHMDF POS=(13,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE07  DFHMDF POS=(13,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD07 DFHMDF POS=(13,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM07 DFHMDF POS=(13,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD07 DFHMDF POS=(13,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR07 DFHMDF POS=(13,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR07 DFHMDF POS=(13,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN07 DFHMDF POS=(13,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ07 DFHMDF POS=(13,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT07 DFHMDF POS=(13,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT07 DFHMDF POS=(13,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN07 DFHMDF POS=(13,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY07 DFHMDF POS=(13,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL08  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT08  DFHMDF POS=(14,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR08 DFHMDF POS=(14,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE08  DFHMDF POS=(14,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD08 DFHMDF POS=(14,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM08 DFHMDF POS=(14,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD08 DFHMDF POS=(14,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR08 DFHMDF POS=(14,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR08 DFHMDF POS=(14,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN08 DFHMDF POS=(14,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ08 DFHMDF POS=(14,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT08 DFHMDF POS=(14,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT08 DFHMDF POS=(14,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN08 DFHMDF POS=(14,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY08 DFHMDF POS=(14,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL09  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT09  DFHMDF POS=(15,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR09 DFHMDF POS=(15,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE09  DFHMDF POS=(15,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD09 DFHMDF POS=(15,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM09 DFHMDF POS=(15,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD09 DFHMDF POS=(15,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR09 DFHMDF POS=(15,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR09 DFHMDF POS=(15,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN09 DFHMDF POS=(15,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ09 DFHMDF POS=(15,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT09 DFHMDF POS=(15,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT09 DFHMDF POS=(15,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN09 DFHMDF POS=(15,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY09 DFHMDF POS=(15,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL10  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT10  DFHMDF POS=(16,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR10 DFHMDF POS=(16,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE10  DFHMDF POS=(16,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD10 DFHMDF POS=(16,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM10 DFHMDF POS=(16,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD10 DFHMDF POS=(16,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR10 DFHMDF POS=(16,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR10 DFHMDF POS=(16,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN10 DFHMDF POS=(16,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ10 DFHMDF POS=(16,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT10 DFHMDF POS=(16,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT10 DFHMDF POS=(16,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN10 DFHMDF POS=(16,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY10 DFHMDF POS=(16,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL11  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT11  DFHMDF POS=(17,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AENTR11 DFHMDF POS=(17,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE11  DFHMDF POS=(17,21),LENGTH=03,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFILD11 DFHMDF POS=(17,25),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AEXAM11 DFHMDF POS=(17,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00100   
AREJD11 DFHMDF POS=(17,37),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AECLR11 DFHMDF POS=(17,43),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
AACLR11 DFHMDF POS=(17,49),LENGTH=05,ATTRB=(ASKIP,NORM),               X00101   
               COLOR=BLUE                                               00102   
ALIQN11 DFHMDF POS=(17,55),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASLIQ11 DFHMDF POS=(17,61),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APOCT11 DFHMDF POS=(17,67),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACNCT11 DFHMDF POS=(17,70),LENGTH=02,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ALTRN11 DFHMDF POS=(17,73),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AHSTY11 DFHMDF POS=(17,79),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
        DFHMDF POS=(19,45),                                            X        
               LENGTH=25,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT  DFHMDF POS=(19,72),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
*                                                                               
*                                                                               
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
