*          DATA SET TRKM325                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM325                                            *   00004   
*        MAP     TR325A                                             *   00005   
*        PROGRAM TRKCS325 - DECONSOLIDATOR CNTL PANEL ERROR LIST    *   00006   
*        TRANSID Y325                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM325 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR325A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE CODE:',                                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=09,                                              X00042   
               POS=(03,05)                                              00043   
APOECDE DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(03,15)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FROM DATE:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(03,26)                                              00043   
AFRMDTE DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,37)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TO DATE:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(03,54)                                              00043   
ATODTE  DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,63)                                              00047   
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VIEW:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,05)                                              00043   
AVIEW   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,11)                                              00047   
*                                                                       00043   
        DFHMDF POS=(06,35),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ETA'                                            00067   
*                                                                       00043   
        DFHMDF POS=(07,02),LENGTH=06,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='VESSEL'                                         00061   
        DFHMDF POS=(07,13),LENGTH=09,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CONTAINER'                                      00061   
        DFHMDF POS=(07,27),LENGTH=05,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='PO NO'                                          00064   
        DFHMDF POS=(07,35),LENGTH=05,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='MM/DD'                                          00064   
        DFHMDF POS=(07,41),LENGTH=04,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='SCAC'                                           00064   
        DFHMDF POS=(07,46),LENGTH=07,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='MESSAGE'                                        00067   
*                                                                               
AVESL01 DFHMDF POS=(08,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR01 DFHMDF POS=(08,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO01 DFHMDF POS=(08,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA01  DFHMDF POS=(08,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC01 DFHMDF POS=(08,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG01  DFHMDF POS=(08,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL02 DFHMDF POS=(09,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR02 DFHMDF POS=(09,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO02 DFHMDF POS=(09,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA02  DFHMDF POS=(09,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC02 DFHMDF POS=(09,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG02  DFHMDF POS=(09,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL03 DFHMDF POS=(10,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR03 DFHMDF POS=(10,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO03 DFHMDF POS=(10,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA03  DFHMDF POS=(10,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC03 DFHMDF POS=(10,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG03  DFHMDF POS=(10,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL04 DFHMDF POS=(11,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR04 DFHMDF POS=(11,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO04 DFHMDF POS=(11,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA04  DFHMDF POS=(11,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC04 DFHMDF POS=(11,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG04  DFHMDF POS=(11,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL05 DFHMDF POS=(12,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR05 DFHMDF POS=(12,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO05 DFHMDF POS=(12,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA05  DFHMDF POS=(12,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC05 DFHMDF POS=(12,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG05  DFHMDF POS=(12,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL06 DFHMDF POS=(13,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR06 DFHMDF POS=(13,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO06 DFHMDF POS=(13,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA06  DFHMDF POS=(13,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC06 DFHMDF POS=(13,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG06  DFHMDF POS=(13,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL07 DFHMDF POS=(14,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR07 DFHMDF POS=(14,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO07 DFHMDF POS=(14,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA07  DFHMDF POS=(14,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC07 DFHMDF POS=(14,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG07  DFHMDF POS=(14,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL08 DFHMDF POS=(15,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR08 DFHMDF POS=(15,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO08 DFHMDF POS=(15,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA08  DFHMDF POS=(15,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC08 DFHMDF POS=(15,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG08  DFHMDF POS=(15,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL09 DFHMDF POS=(16,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR09 DFHMDF POS=(16,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO09 DFHMDF POS=(16,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA09  DFHMDF POS=(16,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC09 DFHMDF POS=(16,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG09  DFHMDF POS=(16,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL10 DFHMDF POS=(17,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR10 DFHMDF POS=(17,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO10 DFHMDF POS=(17,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA10  DFHMDF POS=(17,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC10 DFHMDF POS=(17,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG10  DFHMDF POS=(17,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL11 DFHMDF POS=(18,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR11 DFHMDF POS=(18,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO11 DFHMDF POS=(18,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA11  DFHMDF POS=(18,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC11 DFHMDF POS=(18,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG11  DFHMDF POS=(18,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
AVESL12 DFHMDF POS=(19,02),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACNTR12 DFHMDF POS=(19,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APONO12 DFHMDF POS=(19,26),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00090   
AETA12  DFHMDF POS=(19,35),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC12 DFHMDF POS=(19,41),LENGTH=04,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AMSG12  DFHMDF POS=(19,46),LENGTH=32,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
