*          DATA SET TRKM159    AT LEVEL 001 AS OF 06/20/97              00010000
  PRINT  NOGEN                                                          00020000
*-------------------------------------------------------------------*   00030000
*                                                                   *   00040000
*        MAPSET  TRKM159                                            *   00050000
*        MAP     TR159A                                             *   00060000
*        PROGRAM TRKCS159                                           *   00070000
*        TRANSID Y159 - EDI FREE ON BOARD LIST                      *   00080000
*        SYSTEM  CICS ARCHITECTURE                                  *   00090000
*                                                                   *   00100000
*-------------------------------------------------------------------*   00110000
TRKM159 DFHMSD TYPE=MAP,                                               X00120000
               MODE=INOUT,                                             X00130000
               LANG=COBOL,                                             X00140000
               TIOAPFX=YES,                                            X00150000
               CTRL=(FREEKB)                                            00160000
TR159A  DFHMDI LINE=2,COLUMN=1,                                        X00170000
               SIZE=(19,80),                                           X00180000
               MAPATTS=(COLOR,HILIGHT),                                X00190000
               DSATTS=(COLOR,HILIGHT)                                   00200000
*                                                                       00210000
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00220000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00230000
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00240000
               COLOR=GREEN,                                            C00250000
               HILIGHT=UNDERLINE,                                      C00260000
               PICOUT='ZZZZ9'                                           00270000
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00280000
               COLOR=NEUTRAL,                                          C00290000
               INITIAL='TO'                                             00300000
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00310000
               COLOR=BLUE,                                             C00320000
               PICOUT='ZZZZ9'                                           00330000
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00340000
               COLOR=NEUTRAL,                                          C00350000
               INITIAL='OF'                                             00360000
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00370000
               COLOR=BLUE,                                             C00380000
               PICOUT='ZZZZ9'                                           00390000
*                                                                       00400000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00401000
               INITIAL='CNTRY',                                        X00402000
               LENGTH=05,                                              X00403000
               COLOR=NEUTRAL,                                          X00404000
               POS=(03,12)                                              00405000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00410000
               INITIAL='COUNTRY',                                      X00420000
               LENGTH=07,                                              X00430000
               COLOR=NEUTRAL,                                          X00440000
               POS=(03,18)                                              00450000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00460000
               INITIAL='ORGN',                                         X00470000
               LENGTH=04,                                              X00480000
               COLOR=NEUTRAL,                                          X00490000
               POS=(03,32)                                              00500000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00500101
               INITIAL='ORGN',                                         X00500201
               LENGTH=04,                                              X00500301
               COLOR=NEUTRAL,                                          X00500401
               POS=(03,39)                                              00500501
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00560000
               INITIAL='EDI',                                          X00570000
               LENGTH=03,                                              X00580000
               COLOR=NEUTRAL,                                          X00590000
               POS=(03,73)                                              00600001
*                                                                       00610000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00620000
               INITIAL='SEL',                                          X00630000
               LENGTH=03,                                              X00640000
               COLOR=NEUTRAL,                                          X00650000
               POS=(04,02)                                              00660000
        DFHMDF POS=(04,07),LENGTH=03,ATTRB=(PROT,NORM),                C00670000
               COLOR=NEUTRAL,                                          C00680000
               INITIAL='ACT'                                            00690000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00691000
               INITIAL='CODE',                                         X00692000
               LENGTH=04,                                              X00693000
               COLOR=NEUTRAL,                                          X00694000
               POS=(04,12)                                              00695000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00700000
               INITIAL='NAME',                                         X00710000
               LENGTH=04,                                              X00720000
               COLOR=NEUTRAL,                                          X00730000
               POS=(04,18)                                              00740000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00750000
               INITIAL='CODE',                                         X00760000
               LENGTH=04,                                              X00770000
               COLOR=NEUTRAL,                                          X00780000
               POS=(04,32)                                              00790000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00791001
               INITIAL='TYPE',                                         X00792001
               LENGTH=04,                                              X00793001
               COLOR=NEUTRAL,                                          X00794001
               POS=(04,39)                                              00795001
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00800000
               INITIAL='CITY NAME',                                    X00810000
               LENGTH=9,                                               X00820000
               COLOR=NEUTRAL,                                          X00830000
               POS=(04,46)                                              00840001
        DFHMDF ATTRB=(ASKIP,BRT),                                      X01000000
               INITIAL='CODE',                                         X01010000
               LENGTH=4,                                               X01020000
               COLOR=NEUTRAL,                                          X01030000
               POS=(04,73)                                              01040001
*                                                                       01050000
ASEL01  DFHMDF POS=(05,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01060000
               HILIGHT=UNDERLINE,                                      C01070000
               COLOR=GREEN                                              01080000
        DFHMDF POS=(05,05),LENGTH=01,ATTRB=(ASKIP)                      01090000
AACT01  DFHMDF POS=(05,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01100000
               COLOR=BLUE                                               01110000
ACRCD01 DFHMDF ATTRB=ASKIP,                                            X01111000
               LENGTH=03,                                              X01112000
               COLOR=BLUE,                                             X01113000
               POS=(05,12)                                              01114000
ACNTR01 DFHMDF ATTRB=ASKIP,                                            X01120000
               LENGTH=12,                                              X01130000
               COLOR=BLUE,                                             X01140000
               POS=(05,18)                                              01150000
AOGCO01 DFHMDF ATTRB=ASKIP,                                            X01160000
               LENGTH=03,                                              X01170000
               COLOR=BLUE,                                             X01180000
               POS=(05,32)                                              01190000
AOGTP01 DFHMDF ATTRB=ASKIP,                                            X01191001
               LENGTH=03,                                              X01192001
               COLOR=BLUE,                                             X01193001
               POS=(05,39)                                              01194001
ACTY01  DFHMDF ATTRB=ASKIP,                                            X01200000
               LENGTH=25,                                              X01210003
               COLOR=BLUE,                                             X01220000
               POS=(05,46)                                              01230001
AEDI01  DFHMDF ATTRB=ASKIP,                                            X01360000
               LENGTH=05,                                              X01370000
               COLOR=BLUE,                                             X01380000
               POS=(05,73)                                              01390001
*                                                                       01400000
ASEL02  DFHMDF POS=(06,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01410000
               HILIGHT=UNDERLINE,                                      C01420000
               COLOR=GREEN                                              01430000
        DFHMDF POS=(06,05),LENGTH=01,ATTRB=(ASKIP)                      01440000
AACT02  DFHMDF POS=(06,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01450000
               COLOR=BLUE                                               01460000
ACRCD02 DFHMDF ATTRB=ASKIP,                                            X01461002
               LENGTH=03,                                              X01462000
               COLOR=BLUE,                                             X01463000
               POS=(06,12)                                              01464000
ACNTR02 DFHMDF ATTRB=ASKIP,                                            X01470000
               LENGTH=12,                                              X01480000
               COLOR=BLUE,                                             X01490000
               POS=(06,18)                                              01500000
AOGCO02 DFHMDF ATTRB=ASKIP,                                            X01510000
               LENGTH=03,                                              X01520000
               COLOR=BLUE,                                             X01530000
               POS=(06,32)                                              01540000
AOGTP02 DFHMDF ATTRB=ASKIP,                                            X01541001
               LENGTH=03,                                              X01542001
               COLOR=BLUE,                                             X01543001
               POS=(06,39)                                              01544001
ACTY02  DFHMDF ATTRB=ASKIP,                                            X01550000
               LENGTH=25,                                              X01560003
               COLOR=BLUE,                                             X01570000
               POS=(06,46)                                              01580001
AEDI02  DFHMDF ATTRB=ASKIP,                                            X01710000
               LENGTH=05,                                              X01720000
               COLOR=BLUE,                                             X01730000
               POS=(06,73)                                              01740001
*                                                                       01750000
ASEL03  DFHMDF POS=(07,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01760000
               HILIGHT=UNDERLINE,                                      C01770000
               COLOR=GREEN                                              01780000
        DFHMDF POS=(07,05),LENGTH=01,ATTRB=(ASKIP)                      01790000
AACT03  DFHMDF POS=(07,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01800000
               COLOR=BLUE                                               01810000
ACRCD03 DFHMDF ATTRB=ASKIP,                                            X01811002
               LENGTH=03,                                              X01812000
               COLOR=BLUE,                                             X01813000
               POS=(07,12)                                              01814000
ACNTR03 DFHMDF ATTRB=ASKIP,                                            X01820000
               LENGTH=12,                                              X01830000
               COLOR=BLUE,                                             X01840000
               POS=(07,18)                                              01850000
AOGCO03 DFHMDF ATTRB=ASKIP,                                            X01860000
               LENGTH=03,                                              X01870000
               COLOR=BLUE,                                             X01880000
               POS=(07,32)                                              01890000
AOGTP03 DFHMDF ATTRB=ASKIP,                                            X01891001
               LENGTH=03,                                              X01892001
               COLOR=BLUE,                                             X01893001
               POS=(07,39)                                              01894001
ACTY03  DFHMDF ATTRB=ASKIP,                                            X01900000
               LENGTH=25,                                              X01910003
               COLOR=BLUE,                                             X01920000
               POS=(07,46)                                              01930001
AEDI03  DFHMDF ATTRB=ASKIP,                                            X02060000
               LENGTH=05,                                              X02070000
               COLOR=BLUE,                                             X02080000
               POS=(07,73)                                              02090001
*                                                                       02100000
ASEL04  DFHMDF POS=(08,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C02110000
               HILIGHT=UNDERLINE,                                      C02120000
               COLOR=GREEN                                              02130000
        DFHMDF POS=(08,05),LENGTH=01,ATTRB=(ASKIP)                      02140000
AACT04  DFHMDF POS=(08,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C02150000
               COLOR=BLUE                                               02160000
ACRCD04 DFHMDF ATTRB=ASKIP,                                            X02161002
               LENGTH=03,                                              X02162000
               COLOR=BLUE,                                             X02163000
               POS=(08,12)                                              02164000
ACNTR04 DFHMDF ATTRB=ASKIP,                                            X02170000
               LENGTH=12,                                              X02180000
               COLOR=BLUE,                                             X02190000
               POS=(08,18)                                              02200000
AOGCO04 DFHMDF ATTRB=ASKIP,                                            X02210000
               LENGTH=03,                                              X02220000
               COLOR=BLUE,                                             X02230000
               POS=(08,32)                                              02240000
AOGTP04 DFHMDF ATTRB=ASKIP,                                            X02241001
               LENGTH=03,                                              X02242001
               COLOR=BLUE,                                             X02243001
               POS=(08,39)                                              02244001
ACTY04  DFHMDF ATTRB=ASKIP,                                            X02250000
               LENGTH=25,                                              X02260003
               COLOR=BLUE,                                             X02270000
               POS=(08,46)                                              02280001
AEDI04  DFHMDF ATTRB=ASKIP,                                            X02410000
               LENGTH=05,                                              X02420000
               COLOR=BLUE,                                             X02430000
               POS=(08,73)                                              02440001
*                                                                       02450000
ASEL05  DFHMDF POS=(09,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C02460000
               HILIGHT=UNDERLINE,                                      C02470000
               COLOR=GREEN                                              02480000
        DFHMDF POS=(09,05),LENGTH=01,ATTRB=(ASKIP)                      02490000
AACT05  DFHMDF POS=(09,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C02500000
               COLOR=BLUE                                               02510000
ACRCD05 DFHMDF ATTRB=ASKIP,                                            X02511002
               LENGTH=03,                                              X02512000
               COLOR=BLUE,                                             X02513000
               POS=(09,12)                                              02514000
ACNTR05 DFHMDF ATTRB=ASKIP,                                            X02520000
               LENGTH=12,                                              X02530000
               COLOR=BLUE,                                             X02540000
               POS=(09,18)                                              02550000
AOGCO05 DFHMDF ATTRB=ASKIP,                                            X02560000
               LENGTH=03,                                              X02570000
               COLOR=BLUE,                                             X02580000
               POS=(09,32)                                              02590000
AOGTP05 DFHMDF ATTRB=ASKIP,                                            X02591001
               LENGTH=03,                                              X02592001
               COLOR=BLUE,                                             X02593001
               POS=(09,39)                                              02594001
ACTY05  DFHMDF ATTRB=ASKIP,                                            X02600000
               LENGTH=25,                                              X02610003
               COLOR=BLUE,                                             X02620000
               POS=(09,46)                                              02630001
AEDI05  DFHMDF ATTRB=ASKIP,                                            X02760000
               LENGTH=05,                                              X02770000
               COLOR=BLUE,                                             X02780000
               POS=(09,73)                                              02790001
*                                                                       02800000
ASEL06  DFHMDF POS=(10,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C02810000
               HILIGHT=UNDERLINE,                                      C02820000
               COLOR=GREEN                                              02830000
        DFHMDF POS=(10,05),LENGTH=01,ATTRB=(ASKIP)                      02840000
AACT06  DFHMDF POS=(10,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C02850000
               COLOR=BLUE                                               02860000
ACRCD06 DFHMDF ATTRB=ASKIP,                                            X02861002
               LENGTH=03,                                              X02862000
               COLOR=BLUE,                                             X02863000
               POS=(10,12)                                              02864000
ACNTR06 DFHMDF ATTRB=ASKIP,                                            X02870000
               LENGTH=12,                                              X02880000
               COLOR=BLUE,                                             X02890000
               POS=(10,18)                                              02900000
AOGCO06 DFHMDF ATTRB=ASKIP,                                            X02910000
               LENGTH=03,                                              X02920000
               COLOR=BLUE,                                             X02930000
               POS=(10,32)                                              02940000
AOGTP06 DFHMDF ATTRB=ASKIP,                                            X02941001
               LENGTH=03,                                              X02942001
               COLOR=BLUE,                                             X02943001
               POS=(10,39)                                              02944001
ACTY06  DFHMDF ATTRB=ASKIP,                                            X02950000
               LENGTH=25,                                              X02960003
               COLOR=BLUE,                                             X02970000
               POS=(10,46)                                              02980001
AEDI06  DFHMDF ATTRB=ASKIP,                                            X03110000
               LENGTH=05,                                              X03120000
               COLOR=BLUE,                                             X03130000
               POS=(10,73)                                              03140001
*                                                                       03150000
ASEL07  DFHMDF POS=(11,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C03160000
               HILIGHT=UNDERLINE,                                      C03170000
               COLOR=GREEN                                              03180000
        DFHMDF POS=(11,05),LENGTH=01,ATTRB=(ASKIP)                      03190000
AACT07  DFHMDF POS=(11,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C03200000
               COLOR=BLUE                                               03210000
ACRCD07 DFHMDF ATTRB=ASKIP,                                            X03211002
               LENGTH=03,                                              X03212000
               COLOR=BLUE,                                             X03213000
               POS=(11,12)                                              03214000
ACNTR07 DFHMDF ATTRB=ASKIP,                                            X03220000
               LENGTH=12,                                              X03230000
               COLOR=BLUE,                                             X03240000
               POS=(11,18)                                              03250000
AOGCO07 DFHMDF ATTRB=ASKIP,                                            X03260000
               LENGTH=03,                                              X03270000
               COLOR=BLUE,                                             X03280000
               POS=(11,32)                                              03290000
AOGTP07 DFHMDF ATTRB=ASKIP,                                            X03291001
               LENGTH=03,                                              X03292001
               COLOR=BLUE,                                             X03293001
               POS=(11,39)                                              03294001
ACTY07  DFHMDF ATTRB=ASKIP,                                            X03300000
               LENGTH=25,                                              X03310003
               COLOR=BLUE,                                             X03320000
               POS=(11,46)                                              03330001
AEDI07  DFHMDF ATTRB=ASKIP,                                            X03460000
               LENGTH=05,                                              X03470000
               COLOR=BLUE,                                             X03480000
               POS=(11,73)                                              03490001
*                                                                       03500000
ASEL08  DFHMDF POS=(12,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C03510000
               HILIGHT=UNDERLINE,                                      C03520000
               COLOR=GREEN                                              03530000
        DFHMDF POS=(12,05),LENGTH=01,ATTRB=(ASKIP)                      03540000
AACT08  DFHMDF POS=(12,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C03550000
               COLOR=BLUE                                               03560000
ACRCD08 DFHMDF ATTRB=ASKIP,                                            X03561002
               LENGTH=03,                                              X03562000
               COLOR=BLUE,                                             X03563000
               POS=(12,12)                                              03564000
ACNTR08 DFHMDF ATTRB=ASKIP,                                            X03570000
               LENGTH=12,                                              X03580000
               COLOR=BLUE,                                             X03590000
               POS=(12,18)                                              03600000
AOGCO08 DFHMDF ATTRB=ASKIP,                                            X03610000
               LENGTH=03,                                              X03620000
               COLOR=BLUE,                                             X03630000
               POS=(12,32)                                              03640000
AOGTP08 DFHMDF ATTRB=ASKIP,                                            X03641001
               LENGTH=03,                                              X03642001
               COLOR=BLUE,                                             X03643001
               POS=(12,39)                                              03644001
ACTY08  DFHMDF ATTRB=ASKIP,                                            X03650000
               LENGTH=25,                                              X03660003
               COLOR=BLUE,                                             X03670000
               POS=(12,46)                                              03680001
AEDI08  DFHMDF ATTRB=ASKIP,                                            X03810000
               LENGTH=05,                                              X03820000
               COLOR=BLUE,                                             X03830000
               POS=(12,73)                                              03840001
*                                                                       03850000
ASEL09  DFHMDF POS=(13,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C03860000
               HILIGHT=UNDERLINE,                                      C03870000
               COLOR=GREEN                                              03880000
        DFHMDF POS=(13,05),LENGTH=01,ATTRB=(ASKIP)                      03890000
AACT09  DFHMDF POS=(13,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C03900000
               COLOR=BLUE                                               03910000
ACRCD09 DFHMDF ATTRB=ASKIP,                                            X03911002
               LENGTH=03,                                              X03912000
               COLOR=BLUE,                                             X03913000
               POS=(13,12)                                              03914000
ACNTR09 DFHMDF ATTRB=ASKIP,                                            X03920000
               LENGTH=12,                                              X03930000
               COLOR=BLUE,                                             X03940000
               POS=(13,18)                                              03950000
AOGCO09 DFHMDF ATTRB=ASKIP,                                            X03960000
               LENGTH=03,                                              X03970000
               COLOR=BLUE,                                             X03980000
               POS=(13,32)                                              03990000
AOGTP09 DFHMDF ATTRB=ASKIP,                                            X03991001
               LENGTH=03,                                              X03992001
               COLOR=BLUE,                                             X03993001
               POS=(13,39)                                              03994001
ACTY09  DFHMDF ATTRB=ASKIP,                                            X04000000
               LENGTH=25,                                              X04010003
               COLOR=BLUE,                                             X04020000
               POS=(13,46)                                              04030001
AEDI09  DFHMDF ATTRB=ASKIP,                                            X04160000
               LENGTH=05,                                              X04170000
               COLOR=BLUE,                                             X04180000
               POS=(13,73)                                              04190001
*                                                                       04200000
ASEL10  DFHMDF POS=(14,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C04210000
               HILIGHT=UNDERLINE,                                      C04220000
               COLOR=GREEN                                              04230000
        DFHMDF POS=(14,05),LENGTH=01,ATTRB=(ASKIP)                      04240000
AACT10  DFHMDF POS=(14,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C04250000
               COLOR=BLUE                                               04260000
ACRCD10 DFHMDF ATTRB=ASKIP,                                            X04261002
               LENGTH=03,                                              X04262000
               COLOR=BLUE,                                             X04263000
               POS=(14,12)                                              04264000
ACNTR10 DFHMDF ATTRB=ASKIP,                                            X04270000
               LENGTH=12,                                              X04280000
               COLOR=BLUE,                                             X04290000
               POS=(14,18)                                              04300000
AOGCO10 DFHMDF ATTRB=ASKIP,                                            X04310000
               LENGTH=03,                                              X04320000
               COLOR=BLUE,                                             X04330000
               POS=(14,32)                                              04340000
AOGTP10 DFHMDF ATTRB=ASKIP,                                            X04341001
               LENGTH=03,                                              X04342001
               COLOR=BLUE,                                             X04343001
               POS=(14,39)                                              04344001
ACTY10  DFHMDF ATTRB=ASKIP,                                            X04350000
               LENGTH=25,                                              X04360003
               COLOR=BLUE,                                             X04370000
               POS=(14,46)                                              04380001
AEDI10  DFHMDF ATTRB=ASKIP,                                            X04510000
               LENGTH=05,                                              X04520000
               COLOR=BLUE,                                             X04530000
               POS=(14,73)                                              04540001
*                                                                       04550000
ASEL11  DFHMDF POS=(15,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C04560000
               HILIGHT=UNDERLINE,                                      C04570000
               COLOR=GREEN                                              04580000
        DFHMDF POS=(15,05),LENGTH=01,ATTRB=(ASKIP)                      04590000
AACT11  DFHMDF POS=(15,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C04600000
               COLOR=BLUE                                               04610000
ACRCD11 DFHMDF ATTRB=ASKIP,                                            X04611002
               LENGTH=03,                                              X04612000
               COLOR=BLUE,                                             X04613000
               POS=(15,12)                                              04614000
ACNTR11 DFHMDF ATTRB=ASKIP,                                            X04620000
               LENGTH=12,                                              X04630000
               COLOR=BLUE,                                             X04640000
               POS=(15,18)                                              04650000
AOGCO11 DFHMDF ATTRB=ASKIP,                                            X04660000
               LENGTH=03,                                              X04670000
               COLOR=BLUE,                                             X04680000
               POS=(15,32)                                              04690000
AOGTP11 DFHMDF ATTRB=ASKIP,                                            X04691001
               LENGTH=03,                                              X04692001
               COLOR=BLUE,                                             X04693001
               POS=(15,39)                                              04694001
ACTY11  DFHMDF ATTRB=ASKIP,                                            X04700000
               LENGTH=25,                                              X04710003
               COLOR=BLUE,                                             X04720000
               POS=(15,46)                                              04730001
AEDI11  DFHMDF ATTRB=ASKIP,                                            X04860000
               LENGTH=05,                                              X04870000
               COLOR=BLUE,                                             X04880000
               POS=(15,73)                                              04890001
*                                                                       04900000
ASEL12  DFHMDF POS=(16,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C04910000
               HILIGHT=UNDERLINE,                                      C04920000
               COLOR=GREEN                                              04930000
        DFHMDF POS=(16,05),LENGTH=01,ATTRB=(ASKIP)                      04940000
AACT12  DFHMDF POS=(16,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C04950000
               COLOR=BLUE                                               04960000
ACRCD12 DFHMDF ATTRB=ASKIP,                                            X04961002
               LENGTH=03,                                              X04962000
               COLOR=BLUE,                                             X04963000
               POS=(16,12)                                              04964000
ACNTR12 DFHMDF ATTRB=ASKIP,                                            X04970000
               LENGTH=12,                                              X04980000
               COLOR=BLUE,                                             X04990000
               POS=(16,18)                                              05000000
AOGCO12 DFHMDF ATTRB=ASKIP,                                            X05010000
               LENGTH=03,                                              X05020000
               COLOR=BLUE,                                             X05030000
               POS=(16,32)                                              05040000
AOGTP12 DFHMDF ATTRB=ASKIP,                                            X05041001
               LENGTH=03,                                              X05042001
               COLOR=BLUE,                                             X05043001
               POS=(16,39)                                              05044001
ACTY12  DFHMDF ATTRB=ASKIP,                                            X05050000
               LENGTH=25,                                              X05060003
               COLOR=BLUE,                                             X05070000
               POS=(16,46)                                              05080001
AEDI12  DFHMDF ATTRB=ASKIP,                                            X05210000
               LENGTH=05,                                              X05220000
               COLOR=BLUE,                                             X05230000
               POS=(16,73)                                              05240001
*                                                                       05250000
ASEL13  DFHMDF POS=(17,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C05260000
               HILIGHT=UNDERLINE,                                      C05270000
               COLOR=GREEN                                              05280000
        DFHMDF POS=(17,05),LENGTH=01,ATTRB=(ASKIP)                      05290000
AACT13  DFHMDF POS=(17,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C05300000
               COLOR=BLUE                                               05310000
ACRCD13 DFHMDF ATTRB=ASKIP,                                            X05311002
               LENGTH=03,                                              X05312000
               COLOR=BLUE,                                             X05313000
               POS=(17,12)                                              05314000
ACNTR13 DFHMDF ATTRB=ASKIP,                                            X05320000
               LENGTH=12,                                              X05330000
               COLOR=BLUE,                                             X05340000
               POS=(17,18)                                              05350000
AOGCO13 DFHMDF ATTRB=ASKIP,                                            X05360000
               LENGTH=03,                                              X05370000
               COLOR=BLUE,                                             X05380000
               POS=(17,32)                                              05390000
AOGTP13 DFHMDF ATTRB=ASKIP,                                            X05391001
               LENGTH=03,                                              X05392001
               COLOR=BLUE,                                             X05393001
               POS=(17,39)                                              05394001
ACTY13  DFHMDF ATTRB=ASKIP,                                            X05400000
               LENGTH=25,                                              X05410003
               COLOR=BLUE,                                             X05420000
               POS=(17,46)                                              05430001
AEDI13  DFHMDF ATTRB=ASKIP,                                            X05560000
               LENGTH=05,                                              X05570000
               COLOR=BLUE,                                             X05580000
               POS=(17,73)                                              05590001
*                                                                       05600000
ASEL14  DFHMDF POS=(18,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C05610000
               HILIGHT=UNDERLINE,                                      C05620000
               COLOR=GREEN                                              05630000
        DFHMDF POS=(18,05),LENGTH=01,ATTRB=(ASKIP)                      05640000
AACT14  DFHMDF POS=(18,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C05650000
               COLOR=BLUE                                               05660000
ACRCD14 DFHMDF ATTRB=ASKIP,                                            X05661002
               LENGTH=03,                                              X05662000
               COLOR=BLUE,                                             X05663000
               POS=(18,12)                                              05664000
ACNTR14 DFHMDF ATTRB=ASKIP,                                            X05670000
               LENGTH=12,                                              X05680000
               COLOR=BLUE,                                             X05690000
               POS=(18,18)                                              05700000
AOGCO14 DFHMDF ATTRB=ASKIP,                                            X05710000
               LENGTH=03,                                              X05720000
               COLOR=BLUE,                                             X05730000
               POS=(18,32)                                              05740000
AOGTP14 DFHMDF ATTRB=ASKIP,                                            X05741001
               LENGTH=03,                                              X05742001
               COLOR=BLUE,                                             X05743001
               POS=(18,39)                                              05744001
ACTY14  DFHMDF ATTRB=ASKIP,                                            X05750000
               LENGTH=25,                                              X05760003
               COLOR=BLUE,                                             X05770000
               POS=(18,46)                                              05780001
AEDI14  DFHMDF ATTRB=ASKIP,                                            X05910000
               LENGTH=05,                                              X05920000
               COLOR=BLUE,                                             X05930000
               POS=(18,73)                                              05940001
*                                                                       05950000
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C05960000
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        05970000
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C05980000
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              05990000
*                                                                       06000000
         DFHMSD TYPE=FINAL                                              06010000
*                                                                       06020000
         END                                                            06030000
