  PRINT  NOGEN                                                          00009*10
*********************************************************************** 00010*10
*                                                                       00011*10
*        MAPSET  : TRKM197                                              00012*10
*        MAP     : TR197A                                               00013*10
*        PROGRAM : TRKCS197                                             00014*10
*        TRANSID : Y197 - SHIPMENT RECAP MESSAGE                        00015*10
*        SYSTEM  : CICS ARCHITECTURE                                    00016*10
*                                                                       00017*10
*********************************************************************** 00018*10
TRKM197  DFHMSD TYPE=MAP,                                              X00019*10
               MODE=INOUT,                                             X00020*10
               LANG=COBOL,                                             X00021*10
               TIOAPFX=YES,                                            X00022*10
               CTRL=(FREEKB)                                            00023*10
TR197A   DFHMDI LINE=02,                                               X00024*10
               COLUMN=01,                                              X00025*10
               SIZE=(19,80),                                           X00026*10
               MAPATTS=(COLOR,HILIGHT),                                X00027*10
               DSATTS=(COLOR,HILIGHT)                                   00028*10
AMSGTXT  DFHMDF ATTRB=(PROT),                                          X00029*10
               COLOR=NEUTRAL,                                          X00031*10
               LENGTH=75,                                              X00032*10
               POS=(06,06)                                              00033*10
         DFHMSD TYPE=FINAL                                              00097*10
         END                                                            00098*10
