*        DATA SET TRKM191                                                       
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM191                                            *   00004   
*        MAP     TR191A                                             *   00005   
*        PROGRAM TRKCS191                                           *   00006   
*        TRANSID Y191                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM191 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR191A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PO NO:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(02,02)                                              00043   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               PICOUT='ZZZZZZZZ',                                      X00046   
               POS=(02,09)                                              00047   
AVNDNME DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=30,                                              X00046   
               POS=(02,18)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VEND STYLE:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(02,49)                                              00043   
AVNDSTY DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=20,                                              X00046   
               POS=(02,61)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DEPT.:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(03,02)                                              00043   
ADEPT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               PICOUT='ZZZ9',                                          X        
               POS=(03,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='START X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(03,19)                                              00043   
ASTXFDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(03,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='OTB.......:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(03,48)                                              00043   
AOTB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=06,                                              X00046   
               POS=(03,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CNTRY:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(04,02)                                              00043   
ACNTRY  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(04,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LAST  X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(04,19)                                              00043   
ALTXFDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ORD UNTS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(04,48)                                              00043   
AUNTS   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(04,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(05,02)                                              00043   
AFOB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(05,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DONT SHIP BEFORE.:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(05,19)                                              00043   
ADSHBEF DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='EST CTNS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(05,48)                                              00043   
ACTNS   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               PICOUT='ZZZZZ',                                         X        
               POS=(05,64)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(06,02)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(06,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CANCEL:',                                      X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=07,                                              X00042   
               POS=(06,19)                                              00043   
ACANDT  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,29)                                              00047   
AXCANDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='AD DTE....:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(06,48)                                              00043   
AADDT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,60)                                              00047   
*                                                                       00044   
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(07,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(07,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(07,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(07,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(07,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00044   
        DFHMDF POS=(09,07),LENGTH=09,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CONTAINER'                                      00061   
        DFHMDF POS=(09,23),LENGTH=09,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='SAIL DATE'                                      00064   
        DFHMDF POS=(09,35),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='TYPE'                                           00067   
        DFHMDF POS=(09,42),LENGTH=16,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='REFERENCE NUMBER'                               00061   
*                                                                               
ACON01  DFHMDF POS=(10,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT01 DFHMDF POS=(10,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP01  DFHMDF POS=(10,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF01  DFHMDF POS=(10,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON02  DFHMDF POS=(11,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT02 DFHMDF POS=(11,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP02  DFHMDF POS=(11,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF02  DFHMDF POS=(11,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON03  DFHMDF POS=(12,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT03 DFHMDF POS=(12,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP03  DFHMDF POS=(12,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF03  DFHMDF POS=(12,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON04  DFHMDF POS=(13,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT04 DFHMDF POS=(13,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP04  DFHMDF POS=(13,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF04  DFHMDF POS=(13,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON05  DFHMDF POS=(14,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT05 DFHMDF POS=(14,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP05  DFHMDF POS=(14,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF05  DFHMDF POS=(14,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON06  DFHMDF POS=(15,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT06 DFHMDF POS=(15,20),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP06  DFHMDF POS=(15,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF06  DFHMDF POS=(15,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON07  DFHMDF POS=(16,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT07 DFHMDF POS=(16,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP07  DFHMDF POS=(16,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF07  DFHMDF POS=(16,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON08  DFHMDF POS=(17,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT08 DFHMDF POS=(17,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP08  DFHMDF POS=(17,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF08  DFHMDF POS=(17,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
ACON09  DFHMDF POS=(18,07),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASLDT09 DFHMDF POS=(18,23),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ATYP09  DFHMDF POS=(18,35),LENGTH=03,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AREF09  DFHMDF POS=(18,42),LENGTH=15,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                               
        DFHMSD TYPE=FINAL                                               00094   
        END                                                             00094   
