*          DATA SET TRKM165                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM165                                            *   00004   
*        MAP     TR165A                                             *   00005   
*        PROGRAM TRKCS165                                           *   00006   
*        TRANSID Y165                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM165 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR165A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PO NO:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(02,02)                                              00043   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               PICOUT='ZZZZZZZZ',                                      X00046   
               POS=(02,09)                                              00047   
AVNDNME DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=29,                                              X00046   
               POS=(02,18)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VEND STYLE:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(02,48)                                              00043   
AVNDSTY DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=20,                                              X00046   
               POS=(02,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DEPT.:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(03,02)                                              00043   
ADEPT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               PICOUT='ZZZ9',                                          X        
               POS=(03,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='START X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(03,19)                                              00043   
ASTXFDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(03,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='OTB.......:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(03,48)                                              00043   
AOTB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=06,                                              X00046   
               POS=(03,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CNTRY:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(04,02)                                              00043   
ACNTRY  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(04,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LAST  X-FACTORY..:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(04,19)                                              00043   
ALTXFDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ORD UNTS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(04,48)                                              00043   
AUNTS   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(04,60)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(05,02)                                              00043   
AFOBP   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(05,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DONT SHIP BEFORE.:',                           X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=18,                                              X00042   
               POS=(05,19)                                              00043   
ADSHBEF DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='EST CTNS..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(05,48)                                              00043   
ACTNS   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               PICOUT='ZZZZZ',                                         X        
               POS=(05,64)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE..:',                                       X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(06,02)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(06,09)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CANCEL:',                                      X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=07,                                              X00042   
               POS=(06,19)                                              00043   
ACANDT  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,29)                                              00047   
AXCANDT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,38)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='AD DTE....:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(06,48)                                              00043   
AADDT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,60)                                              00047   
*                                                                       00044   
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(07,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(07,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(07,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(07,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(07,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00044   
        DFHMDF POS=(08,26),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='TRIP'                                           00067   
        DFHMDF POS=(08,33),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='FOB'                                            00067   
        DFHMDF POS=(08,39),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='FOB'                                            00061   
        DFHMDF POS=(08,45),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='POE'                                            00067   
        DFHMDF POS=(08,51),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='POE'                                            00067   
*                                                                       00043   
        DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT),                   X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S'                                              00061   
        DFHMDF POS=(09,03),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='ACT'                                            00061   
        DFHMDF POS=(09,07),LENGTH=11,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='VESSEL NAME'                                    00061   
        DFHMDF POS=(09,26),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='MODE'                                           00067   
        DFHMDF POS=(09,33),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='DLY'                                            00067   
        DFHMDF POS=(09,39),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='ATD'                                            00061   
        DFHMDF POS=(09,45),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ETA'                                            00067   
        DFHMDF POS=(09,51),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ATA'                                            00067   
        DFHMDF POS=(09,56),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='FOB'                                            00067   
        DFHMDF POS=(09,60),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='POE'                                            00067   
        DFHMDF POS=(09,67),LENGTH=05,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='UNITS'                                          00067   
        DFHMDF POS=(09,75),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='CTNS'                                           00067   
*                                                                               
ASEL01  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT01  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL01  DFHMDF POS=(10,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP01  DFHMDF POS=(10,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT01  DFHMDF POS=(10,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD01  DFHMDF POS=(10,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AETA01  DFHMDF POS=(10,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA01  DFHMDF POS=(10,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB01  DFHMDF POS=(10,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE01  DFHMDF POS=(10,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT01  DFHMDF POS=(10,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN01  DFHMDF POS=(10,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL02  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT02  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL02  DFHMDF POS=(11,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP02  DFHMDF POS=(11,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT02  DFHMDF POS=(11,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD02  DFHMDF POS=(11,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AETA02  DFHMDF POS=(11,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA02  DFHMDF POS=(11,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB02  DFHMDF POS=(11,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE02  DFHMDF POS=(11,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT02  DFHMDF POS=(11,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN02  DFHMDF POS=(11,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL03  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT03  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL03  DFHMDF POS=(12,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP03  DFHMDF POS=(12,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT03  DFHMDF POS=(12,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD03  DFHMDF POS=(12,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AETA03  DFHMDF POS=(12,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA03  DFHMDF POS=(12,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB03  DFHMDF POS=(12,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE03  DFHMDF POS=(12,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT03  DFHMDF POS=(12,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN03  DFHMDF POS=(12,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL04  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT04  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL04  DFHMDF POS=(13,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP04  DFHMDF POS=(13,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT04  DFHMDF POS=(13,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD04  DFHMDF POS=(13,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AETA04  DFHMDF POS=(13,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA04  DFHMDF POS=(13,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB04  DFHMDF POS=(13,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE04  DFHMDF POS=(13,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT04  DFHMDF POS=(13,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN04  DFHMDF POS=(13,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL05  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT05  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL05  DFHMDF POS=(14,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP05  DFHMDF POS=(14,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT05  DFHMDF POS=(14,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD05  DFHMDF POS=(14,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AETA05  DFHMDF POS=(14,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA05  DFHMDF POS=(14,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB05  DFHMDF POS=(14,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE05  DFHMDF POS=(14,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT05  DFHMDF POS=(14,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN05  DFHMDF POS=(14,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL06  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT06  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL06  DFHMDF POS=(15,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP06  DFHMDF POS=(15,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT06  DFHMDF POS=(15,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD06  DFHMDF POS=(15,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AETA06  DFHMDF POS=(15,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA06  DFHMDF POS=(15,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB06  DFHMDF POS=(15,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE06  DFHMDF POS=(15,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT06  DFHMDF POS=(15,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN06  DFHMDF POS=(15,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL07  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT07  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL07  DFHMDF POS=(16,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP07  DFHMDF POS=(16,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT07  DFHMDF POS=(16,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD07  DFHMDF POS=(16,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00192   
AETA07  DFHMDF POS=(16,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA07  DFHMDF POS=(16,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB07  DFHMDF POS=(16,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE07  DFHMDF POS=(16,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT07  DFHMDF POS=(16,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN07  DFHMDF POS=(16,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL08  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT08  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSL08  DFHMDF POS=(17,07),LENGTH=20,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRP08  DFHMDF POS=(17,28),LENGTH=01,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFDT08  DFHMDF POS=(17,32),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AATD08  DFHMDF POS=(17,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AETA08  DFHMDF POS=(17,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA08  DFHMDF POS=(17,50),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AFOB08  DFHMDF POS=(17,56),LENGTH=03,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOE08  DFHMDF POS=(17,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AUNT08  DFHMDF POS=(17,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ACTN08  DFHMDF POS=(17,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
        DFHMDF POS=(18,57),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,INITIAL='TOTAL:'                            00094   
ATOTUNT DFHMDF POS=(18,64),LENGTH=09,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZZZZZ9'                          00094   
ATOTCNT DFHMDF POS=(18,74),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZZ9'                             00094   
*                                                                               
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00044   
        END                                                             00044   
