*          DATA SET TRKM183                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM183                                            *   00004   
*        MAP     TR183A                                             *   00005   
*        PROGRAM TRKCS183                                           *   00006   
*        TRANSID Y183                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM183 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR183A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
***MAIN HEADINGS                                                        00022   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CONT NO:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(02,01)                                              00043   
ACNTRNO DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               POS=(02,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='SIZE:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,40)                                              00043   
ASIZE   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               POS=(02,46)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='MTR VSL:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(03,01)                                              00043   
AMOMVSL DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=25,                                              X00046   
               POS=(03,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VOY.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,40)                                              00043   
AMOMVOY DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,46)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ATD:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(03,57)                                              00043   
AMOMATD DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(03,62)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(03,71)                                              00043   
AMOMFOB DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(03,76)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FDR VSL:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(04,01)                                              00043   
AFDRVSL DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=25,                                              X00046   
               POS=(04,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VOY.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(04,40)                                              00043   
AFDRVOY DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(04,46)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ATD:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(04,57)                                              00043   
AFDRATD DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,62)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(04,71)                                              00043   
AFDRFOB DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(04,76)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='MTR POR/POL:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(05,01)                                              00043   
AMOMORG DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=07,                                              X00046   
               POS=(05,14)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CTN:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(05,24)                                              00043   
ACTN    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(05,29)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TYPE:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,40)                                              00043   
ATYPE   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=07,                                              X00046   
               POS=(05,46)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ETA:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(05,57)                                              00043   
AETA    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,62)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(05,71)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(05,76)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FDR POR/POL:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(06,01)                                              00043   
AFDRORG DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=07,                                              X00046   
               POS=(06,14)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='UNT:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(06,24)                                              00043   
AUNITS  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(06,29)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CARR SCAC:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(06,40)                                              00043   
ACRSCAC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               POS=(06,51)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ELD:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(06,57)                                              00043   
AELD    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(06,62)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CBM....:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(07,01)                                              00043   
ACBM    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               PICOUT='ZZZZZZZZZ.ZZ',                                  X        
               POS=(07,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='KGS:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(07,24)                                              00043   
AKGS    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(07,29)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CNSL SCAC:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(07,40)                                              00043   
ACNSCAC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               POS=(07,51)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LBD:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(07,57)                                              00043   
ALBD    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=18,                                              X00046   
               POS=(07,62)                                              00047   
*                                                                               
***SUB HEADINGS                                                                 
*                                                                               
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PO NBR.:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(09,01)                                              00043   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZZZZZ9',                                      X00045   
               LENGTH=08,                                              X00046   
               POS=(09,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PACK SKU.:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(09,19)                                              00043   
APCKSKU DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZZZZZ9',                                      X00045   
               LENGTH=08,                                              X00046   
               POS=(09,30)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PACK UPC..:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(09,39)                                              00043   
APCKUPC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZZZZZZZZZZZZ9',                               X00045   
               LENGTH=15,                                              X00046   
               POS=(09,51)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PACK ID:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(09,67)                                              00043   
APCKID  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZ9',                                          X00045   
               LENGTH=04,                                              X00046   
               POS=(09,76)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PKG IND:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(10,01)                                              00043   
APKGIND DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=01,                                              X00046   
               POS=(10,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PACK CTNS:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(10,18)                                              00043   
APCKCTN DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZZ9',                                         X00045   
               LENGTH=05,                                              X00046   
               POS=(10,29)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PACK UNITS:',                                  X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=11,                                              X00042   
               POS=(10,38)                                              00043   
APCKUNT DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZZZZZZ9',                                     X00045   
               LENGTH=09,                                              X00046   
               POS=(10,50)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PK CODE:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(11,01)                                              00043   
AASNPKG DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=02,                                              X00046   
               POS=(11,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PACK DESC:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(11,18)                                              00043   
APKDESC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=40,                                              X00046   
               POS=(11,29)                                              00047   
*                                                                               
        DFHMDF POS=(12,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(12,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(12,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(12,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(12,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(12,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
********************                                                            
* COLUMN HEADINGS                                                               
********************                                                            
        DFHMDF POS=(13,01),LENGTH=01,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S'                                              00061   
        DFHMDF POS=(13,03),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ACT'                                            00064   
        DFHMDF POS=(13,07),LENGTH=12,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='VENDOR STYLE'                                   00061   
        DFHMDF POS=(13,27),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='COLOR'                                          00061   
        DFHMDF POS=(13,38),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='SIZE'                                           00061   
        DFHMDF POS=(13,49),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='SKU'                                            00061   
        DFHMDF POS=(13,62),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='UPC'                                            00061   
        DFHMDF POS=(13,74),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='RATIO'                                          00061   
*                                                                               
ASEL01  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT01  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVNDST1 DFHMDF POS=(14,07),LENGTH=18,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACOLOR1 DFHMDF POS=(14,27),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASIZE1  DFHMDF POS=(14,38),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASKU1   DFHMDF POS=(14,49),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AUPC1   DFHMDF POS=(14,58),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ARATIO1 DFHMDF POS=(14,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL02  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT02  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVNDST2 DFHMDF POS=(15,07),LENGTH=18,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACOLOR2 DFHMDF POS=(15,27),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASIZE2  DFHMDF POS=(15,38),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASKU2   DFHMDF POS=(15,49),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AUPC2   DFHMDF POS=(15,58),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ARATIO2 DFHMDF POS=(15,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL03  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT03  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVNDST3 DFHMDF POS=(16,07),LENGTH=18,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACOLOR3 DFHMDF POS=(16,27),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASIZE3  DFHMDF POS=(16,38),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASKU3   DFHMDF POS=(16,49),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AUPC3   DFHMDF POS=(16,58),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ARATIO3 DFHMDF POS=(16,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL04  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT04  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVNDST4 DFHMDF POS=(17,07),LENGTH=18,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACOLOR4 DFHMDF POS=(17,27),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASIZE4  DFHMDF POS=(17,38),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASKU4   DFHMDF POS=(17,49),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AUPC4   DFHMDF POS=(17,58),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ARATIO4 DFHMDF POS=(17,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL05  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT05  DFHMDF POS=(18,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVNDST5 DFHMDF POS=(18,07),LENGTH=18,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACOLOR5 DFHMDF POS=(18,27),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASIZE5  DFHMDF POS=(18,38),LENGTH=10,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ASKU5   DFHMDF POS=(18,49),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AUPC5   DFHMDF POS=(18,58),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ARATIO5 DFHMDF POS=(18,74),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
