*          DATA SET TRKM186                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM186                                            *   00004   
*        MAP     TR186A                                             *   00005   
*        PROGRAM TRKCS186                                           *   00006   
*        TRANSID Y186                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM186  DFHMSD TYPE=DSECT,                                            X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR186A   DFHMDI LINE=02,                                               X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
         DFHMDF ATTRB=(ASKIP),                                         X00039   
               INITIAL='ENTER A CONTAINER NUMBER.',                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=25,                                              X00042   
               POS=(03,2)                                               00043   
         DFHMDF ATTRB=(ASKIP),                                         X00039   
               INITIAL='CONTAINER NO:',                                X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=13,                                              X00042   
               POS=(08,13)                                              00043   
ACNTRNO  DFHMDF ATTRB=(UNPROT),                                        X00044   
               COLOR=GREEN,                                            X00045   
               LENGTH=12,                                              X00046   
               HILIGHT=UNDERLINE,                                      X        
               POS=(08,27)                                              00047   
         DFHMDF ATTRB=(ASKIP),                                         X        
               LENGTH=01,                                              X        
               POS=(08,40)                                                      
*                                                                               
         DFHMSD TYPE=FINAL                                              00139   
         END                                                            00140   
