*          DATA SET TRKM102    AT LEVEL 001 AS OF 08/24/95                      
*          DATA SET TRKM102    AT LEVEL 003 AS OF 01/19/94              00001   
*          DATA SET TRKM102    AT LEVEL 002 AS OF 10/18/93              00002   
*          DATA SET TRKM102    AT LEVEL 014 AS OF 04/13/93              00003   
*****************************************************************       00004   
*       MAPSET  TRKM102                                                 00005   
*       MAP     TR102A                                                  00006   
*       PROGRAM TRKCS102                                                00007   
*       TRANSID Y102                                                    00008   
*       SYSTEM  CICS ARCHTECTURE - SHIPMENT FORECASTING                 00009   
*****************************************************************       00010   
        PRINT  NOGEN                                                    00011   
TRKM102 DFHMSD TYPE=DSECT,                                             C00012   
               LANG=COBOL,                                             C00013   
               MODE=INOUT,                                             C00014   
               STORAGE=AUTO,                                           C00015   
               TERM=3270-2,                                            C00016   
               TIOAPFX=YES                                              00017   
**************                                                          00018   
TR102A  DFHMDI SIZE=(24,80),                                           C00019   
               CTRL=(FREEKB),                                          C00020   
               MAPATTS=(COLOR,HILIGHT),                                C00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
**************                                                          00023   
ADATE   DFHMDF POS=(01,02),                                            C00024   
               LENGTH=10,                                              C00025   
               ATTRB=(ASKIP,NORM),                                     C00026   
               COLOR=NEUTRAL                                            00027   
ATIME   DFHMDF POS=(01,14),                                            C00028   
               LENGTH=08,                                              C00029   
               ATTRB=(ASKIP,NORM),                                     C00030   
               COLOR=NEUTRAL                                            00031   
ATITLE  DFHMDF POS=(01,25),                                            C00032   
               LENGTH=30,                                              C00033   
               ATTRB=(ASKIP,BRT),                                      C00034   
               COLOR=NEUTRAL                                            00035   
ANETNAM DFHMDF POS=(01,61),                                            C00036   
               LENGTH=08,                                              C00037   
               ATTRB=(ASKIP,NORM),                                     C00038   
               COLOR=NEUTRAL                                            00039   
AMNEMIC DFHMDF POS=(01,71),                                            C00040   
               LENGTH=08,                                              C00041   
               ATTRB=(ASKIP,NORM),                                     C00042   
               COLOR=NEUTRAL                                            00043   
*                                                                       00044   
        DFHMDF POS=(03,44),                                            C00045   
               LENGTH=05,                                              C00046   
               ATTRB=(ASKIP,NORM),                                     C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='ITEMS'                                          00049   
ASTRTIT DFHMDF POS=(03,50),                                            C00050   
               LENGTH=07,                                              C00051   
               ATTRB=(NUM,UNPROT,NORM,IC),                             C00052   
               COLOR=GREEN,                                            C00053   
               HILIGHT=UNDERLINE,                                      C00054   
               PICOUT='ZZZ,ZZ9'                                         00055   
        DFHMDF POS=(03,58),                                            C00056   
               LENGTH=02,                                              C00057   
               ATTRB=(ASKIP,NORM),                                     C00058   
               COLOR=NEUTRAL,                                          C00059   
               INITIAL='TO'                                             00060   
AENDIT  DFHMDF POS=(03,61),                                            C00061   
               LENGTH=07,                                              C00062   
               ATTRB=(ASKIP,NORM,FSET),                                C00063   
               COLOR=BLUE,                                             C00064   
               PICOUT='ZZZ,ZZ9'                                         00065   
        DFHMDF POS=(03,69),                                            C00066   
               LENGTH=02,                                              C00067   
               ATTRB=(ASKIP,NORM),                                     C00068   
               COLOR=NEUTRAL,                                          C00069   
               INITIAL='OF'                                             00070   
ATOTIT  DFHMDF POS=(03,72),                                            C00071   
               LENGTH=07,                                              C00072   
               ATTRB=(ASKIP,NORM),                                     C00073   
               COLOR=BLUE,                                             C00074   
               PICOUT='ZZZ,ZZ9'                                         00075   
*                                                                       00076   
        DFHMDF POS=(05,01),                                            C00077   
               LENGTH=04,                                              C00078   
               ATTRB=(PROT,NORM),                                      C00079   
               COLOR=NEUTRAL,                                          C00080   
               INITIAL='DEPT'                                           00081   
        DFHMDF POS=(05,06),                                            C00082   
               LENGTH=02,                                              C00083   
               ATTRB=(PROT,NORM),                                      C00084   
               COLOR=NEUTRAL,                                          C00085   
               INITIAL='PO'                                             00086   
        DFHMDF POS=(05,15),                                            C00087   
               LENGTH=06,                                              C00088   
               ATTRB=(PROT,NORM),                                      C00089   
               COLOR=NEUTRAL,                                          C00090   
               INITIAL='VENDOR'                                         00091   
        DFHMDF POS=(05,22),                                            C00092   
               LENGTH=06,                                              C00093   
               ATTRB=(PROT,NORM),                                      C00094   
               COLOR=NEUTRAL,                                          C00095   
               INITIAL='P SCAC'                                         00096   
        DFHMDF POS=(05,29),                                            C00097   
               LENGTH=12,                                              C00098   
               ATTRB=(PROT,NORM),                                      C00099   
               COLOR=NEUTRAL,                                          C00100   
               INITIAL='FREIGHT BILL'                                   00101   
        DFHMDF POS=(05,49),                                            C00102   
               LENGTH=04,                                              C00103   
               ATTRB=(PROT,NORM),                                      C00104   
               COLOR=NEUTRAL,                                          C00105   
               INITIAL='LINE'                                           00106   
        DFHMDF POS=(05,55),                                            C00107   
               LENGTH=03,                                              C00108   
               ATTRB=(PROT,NORM),                                      C00109   
               COLOR=NEUTRAL,                                          C00110   
               INITIAL='ETA'                                            00111   
        DFHMDF POS=(05,61),                                            C00112   
               LENGTH=07,                                              C00113   
               ATTRB=(PROT,NORM),                                      C00114   
               COLOR=NEUTRAL,                                          C00115   
               INITIAL='VEHICLE'                                        00116   
        DFHMDF POS=(05,71),                                            C00117   
               LENGTH=09,                                              C00118   
               ATTRB=(PROT,NORM),                                      C00119   
               COLOR=NEUTRAL,                                          C00120   
               INITIAL='OPER FLTY'                                      00121   
*                                                                       00122   
ADEPT01 DFHMDF POS=(06,01),                                            C00123   
               LENGTH=04,                                              C00124   
               PICOUT='ZZZZ',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00125   
               COLOR=BLUE                                               00126   
APO01   DFHMDF POS=(06,06),                                            C00127   
               LENGTH=08,                                              C00128   
               ATTRB=(ASKIP,NORM),                                     C00129   
               COLOR=BLUE                                               00130   
AVEND01 DFHMDF POS=(06,15),                                            C00131   
               LENGTH=06,                                              C00132   
               ATTRB=(ASKIP,NORM),                                     C00133   
               COLOR=BLUE                                               00134   
AP01    DFHMDF POS=(06,22),                                            C00135   
               LENGTH=01,                                              C00136   
               ATTRB=(ASKIP,NORM),                                     C00137   
               COLOR=BLUE                                               00138   
ASCAC01 DFHMDF POS=(06,24),                                            C00139   
               LENGTH=04,                                              C00140   
               ATTRB=(ASKIP,NORM),                                     C00141   
               COLOR=BLUE                                               00142   
APRO01  DFHMDF POS=(06,29),                                            C00143   
               LENGTH=19,                                              C00144   
               ATTRB=(ASKIP,NORM),                                     C00145   
               COLOR=BLUE                                               00146   
ALINE01 DFHMDF POS=(06,49),                                            C00147   
               LENGTH=04,                                              C00148   
               ATTRB=(ASKIP,NORM),                                     C00149   
               COLOR=BLUE                                               00150   
AETA01  DFHMDF POS=(06,54),                                            C00151   
               LENGTH=05,                                              C00152   
               ATTRB=(ASKIP,NORM),                                     C00153   
               COLOR=BLUE                                               00154   
AVHCL01 DFHMDF POS=(06,60),                                            C00155   
               LENGTH=10,                                              C00156   
               ATTRB=(ASKIP,NORM),                                     C00157   
               COLOR=BLUE                                               00158   
ADEST01 DFHMDF POS=(06,71),                                            C00159   
               LENGTH=09,                                              C00160   
               ATTRB=(ASKIP,NORM),                                     C00161   
               COLOR=BLUE                                               00162   
*                                                                       00163   
ADEPT02 DFHMDF POS=(07,01),                                            C00164   
               LENGTH=04,                                              C00165   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00166   
               COLOR=BLUE                                               00167   
APO02   DFHMDF POS=(07,06),                                            C00168   
               LENGTH=08,                                              C00169   
               ATTRB=(ASKIP,NORM),                                     C00170   
               COLOR=BLUE                                               00171   
AVEND02 DFHMDF POS=(07,15),                                            C00172   
               LENGTH=06,                                              C00173   
               ATTRB=(ASKIP,NORM),                                     C00174   
               COLOR=BLUE                                               00175   
AP02    DFHMDF POS=(07,22),                                            C00176   
               LENGTH=01,                                              C00177   
               ATTRB=(ASKIP,NORM),                                     C00178   
               COLOR=BLUE                                               00179   
ASCAC02 DFHMDF POS=(07,24),                                            C00180   
               LENGTH=04,                                              C00181   
               ATTRB=(ASKIP,NORM),                                     C00182   
               COLOR=BLUE                                               00183   
APRO02  DFHMDF POS=(07,29),                                            C00184   
               LENGTH=19,                                              C00185   
               ATTRB=(ASKIP,NORM),                                     C00186   
               COLOR=BLUE                                               00187   
ALINE02 DFHMDF POS=(07,49),                                            C00188   
               LENGTH=04,                                              C00189   
               ATTRB=(ASKIP,NORM),                                     C00190   
               COLOR=BLUE                                               00191   
AETA02  DFHMDF POS=(07,54),                                            C00192   
               LENGTH=05,                                              C00193   
               ATTRB=(ASKIP,NORM),                                     C00194   
               COLOR=BLUE                                               00195   
AVHCL02 DFHMDF POS=(07,60),                                            C00196   
               LENGTH=10,                                              C00197   
               ATTRB=(ASKIP,NORM),                                     C00198   
               COLOR=BLUE                                               00199   
ADEST02 DFHMDF POS=(07,71),                                            C00200   
               LENGTH=09,                                              C00201   
               ATTRB=(ASKIP,NORM),                                     C00202   
               COLOR=BLUE                                               00203   
*                                                                       00204   
ADEPT03 DFHMDF POS=(08,01),                                            C00205   
               LENGTH=04,                                              C00206   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00207   
               COLOR=BLUE                                               00208   
APO03   DFHMDF POS=(08,06),                                            C00209   
               LENGTH=08,                                              C00210   
               ATTRB=(ASKIP,NORM),                                     C00211   
               COLOR=BLUE                                               00212   
AVEND03 DFHMDF POS=(08,15),                                            C00213   
               LENGTH=06,                                              C00214   
               ATTRB=(ASKIP,NORM),                                     C00215   
               COLOR=BLUE                                               00216   
AP03    DFHMDF POS=(08,22),                                            C00217   
               LENGTH=01,                                              C00218   
               ATTRB=(ASKIP,NORM),                                     C00219   
               COLOR=BLUE                                               00220   
ASCAC03 DFHMDF POS=(08,24),                                            C00221   
               LENGTH=04,                                              C00222   
               ATTRB=(ASKIP,NORM),                                     C00223   
               COLOR=BLUE                                               00224   
APRO03  DFHMDF POS=(08,29),                                            C00225   
               LENGTH=19,                                              C00226   
               ATTRB=(ASKIP,NORM),                                     C00227   
               COLOR=BLUE                                               00228   
ALINE03 DFHMDF POS=(08,49),                                            C00229   
               LENGTH=04,                                              C00230   
               ATTRB=(ASKIP,NORM),                                     C00231   
               COLOR=BLUE                                               00232   
AETA03  DFHMDF POS=(08,54),                                            C00233   
               LENGTH=05,                                              C00234   
               ATTRB=(ASKIP,NORM),                                     C00235   
               COLOR=BLUE                                               00236   
AVHCL03 DFHMDF POS=(08,60),                                            C00237   
               LENGTH=10,                                              C00238   
               ATTRB=(ASKIP,NORM),                                     C00239   
               COLOR=BLUE                                               00240   
ADEST03 DFHMDF POS=(08,71),                                            C00241   
               LENGTH=09,                                              C00242   
               ATTRB=(ASKIP,NORM),                                     C00243   
               COLOR=BLUE                                               00244   
*                                                                       00245   
ADEPT04 DFHMDF POS=(09,01),                                            C00246   
               LENGTH=04,                                              C00247   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00248   
               COLOR=BLUE                                               00249   
APO04   DFHMDF POS=(09,06),                                            C00250   
               LENGTH=08,                                              C00251   
               ATTRB=(ASKIP,NORM),                                     C00252   
               COLOR=BLUE                                               00253   
AVEND04 DFHMDF POS=(09,15),                                            C00254   
               LENGTH=06,                                              C00255   
               ATTRB=(ASKIP,NORM),                                     C00256   
               COLOR=BLUE                                               00257   
AP04    DFHMDF POS=(09,22),                                            C00258   
               LENGTH=01,                                              C00259   
               ATTRB=(ASKIP,NORM),                                     C00260   
               COLOR=BLUE                                               00261   
ASCAC04 DFHMDF POS=(09,24),                                            C00262   
               LENGTH=04,                                              C00263   
               ATTRB=(ASKIP,NORM),                                     C00264   
               COLOR=BLUE                                               00265   
APRO04  DFHMDF POS=(09,29),                                            C00266   
               LENGTH=19,                                              C00267   
               ATTRB=(ASKIP,NORM),                                     C00268   
               COLOR=BLUE                                               00269   
ALINE04 DFHMDF POS=(09,49),                                            C00270   
               LENGTH=04,                                              C00271   
               ATTRB=(ASKIP,NORM),                                     C00272   
               COLOR=BLUE                                               00273   
AETA04  DFHMDF POS=(09,54),                                            C00274   
               LENGTH=05,                                              C00275   
               ATTRB=(ASKIP,NORM),                                     C00276   
               COLOR=BLUE                                               00277   
AVHCL04 DFHMDF POS=(09,60),                                            C00278   
               LENGTH=10,                                              C00279   
               ATTRB=(ASKIP,NORM),                                     C00280   
               COLOR=BLUE                                               00281   
ADEST04 DFHMDF POS=(09,71),                                            C00282   
               LENGTH=09,                                              C00283   
               ATTRB=(ASKIP,NORM),                                     C00284   
               COLOR=BLUE                                               00285   
*                                                                       00286   
ADEPT05 DFHMDF POS=(10,01),                                            C00287   
               LENGTH=04,                                              C00288   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00289   
               COLOR=BLUE                                               00290   
APO05   DFHMDF POS=(10,06),                                            C00291   
               LENGTH=08,                                              C00292   
               ATTRB=(ASKIP,NORM),                                     C00293   
               COLOR=BLUE                                               00294   
AVEND05 DFHMDF POS=(10,15),                                            C00295   
               LENGTH=06,                                              C00296   
               ATTRB=(ASKIP,NORM),                                     C00297   
               COLOR=BLUE                                               00298   
AP05    DFHMDF POS=(10,22),                                            C00299   
               LENGTH=01,                                              C00300   
               ATTRB=(ASKIP,NORM),                                     C00301   
               COLOR=BLUE                                               00302   
ASCAC05 DFHMDF POS=(10,24),                                            C00303   
               LENGTH=04,                                              C00304   
               ATTRB=(ASKIP,NORM),                                     C00305   
               COLOR=BLUE                                               00306   
APRO05  DFHMDF POS=(10,29),                                            C00307   
               LENGTH=19,                                              C00308   
               ATTRB=(ASKIP,NORM),                                     C00309   
               COLOR=BLUE                                               00310   
ALINE05 DFHMDF POS=(10,49),                                            C00311   
               LENGTH=04,                                              C00312   
               ATTRB=(ASKIP,NORM),                                     C00313   
               COLOR=BLUE                                               00314   
AETA05  DFHMDF POS=(10,54),                                            C00315   
               LENGTH=05,                                              C00316   
               ATTRB=(ASKIP,NORM),                                     C00317   
               COLOR=BLUE                                               00318   
AVHCL05 DFHMDF POS=(10,60),                                            C00319   
               LENGTH=10,                                              C00320   
               ATTRB=(ASKIP,NORM),                                     C00321   
               COLOR=BLUE                                               00322   
ADEST05 DFHMDF POS=(10,71),                                            C00323   
               LENGTH=09,                                              C00324   
               ATTRB=(ASKIP,NORM),                                     C00325   
               COLOR=BLUE                                               00326   
*                                                                       00327   
ADEPT06 DFHMDF POS=(11,01),                                            C00328   
               LENGTH=04,                                              C00329   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00330   
               COLOR=BLUE                                               00331   
APO06   DFHMDF POS=(11,06),                                            C00332   
               LENGTH=08,                                              C00333   
               ATTRB=(ASKIP,NORM),                                     C00334   
               COLOR=BLUE                                               00335   
AVEND06 DFHMDF POS=(11,15),                                            C00336   
               LENGTH=06,                                              C00337   
               ATTRB=(ASKIP,NORM),                                     C00338   
               COLOR=BLUE                                               00339   
AP06    DFHMDF POS=(11,22),                                            C00340   
               LENGTH=01,                                              C00341   
               ATTRB=(ASKIP,NORM),                                     C00342   
               COLOR=BLUE                                               00343   
ASCAC06 DFHMDF POS=(11,24),                                            C00344   
               LENGTH=04,                                              C00345   
               ATTRB=(ASKIP,NORM),                                     C00346   
               COLOR=BLUE                                               00347   
APRO06  DFHMDF POS=(11,29),                                            C00348   
               LENGTH=19,                                              C00349   
               ATTRB=(ASKIP,NORM),                                     C00350   
               COLOR=BLUE                                               00351   
ALINE06 DFHMDF POS=(11,49),                                            C00352   
               LENGTH=04,                                              C00353   
               ATTRB=(ASKIP,NORM),                                     C00354   
               COLOR=BLUE                                               00355   
AETA06  DFHMDF POS=(11,54),                                            C00356   
               LENGTH=05,                                              C00357   
               ATTRB=(ASKIP,NORM),                                     C00358   
               COLOR=BLUE                                               00359   
AVHCL06 DFHMDF POS=(11,60),                                            C00360   
               LENGTH=10,                                              C00361   
               ATTRB=(ASKIP,NORM),                                     C00362   
               COLOR=BLUE                                               00363   
ADEST06 DFHMDF POS=(11,71),                                            C00364   
               LENGTH=09,                                              C00365   
               ATTRB=(ASKIP,NORM),                                     C00366   
               COLOR=BLUE                                               00367   
*                                                                       00368   
ADEPT07 DFHMDF POS=(12,01),                                            C00369   
               LENGTH=04,                                              C00370   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00371   
               COLOR=BLUE                                               00372   
APO07   DFHMDF POS=(12,06),                                            C00373   
               LENGTH=08,                                              C00374   
               ATTRB=(ASKIP,NORM),                                     C00375   
               COLOR=BLUE                                               00376   
AVEND07 DFHMDF POS=(12,15),                                            C00377   
               LENGTH=06,                                              C00378   
               ATTRB=(ASKIP,NORM),                                     C00379   
               COLOR=BLUE                                               00380   
AP07    DFHMDF POS=(12,22),                                            C00381   
               LENGTH=01,                                              C00382   
               ATTRB=(ASKIP,NORM),                                     C00383   
               COLOR=BLUE                                               00384   
ASCAC07 DFHMDF POS=(12,24),                                            C00385   
               LENGTH=04,                                              C00386   
               ATTRB=(ASKIP,NORM),                                     C00387   
               COLOR=BLUE                                               00388   
APRO07  DFHMDF POS=(12,29),                                            C00389   
               LENGTH=19,                                              C00390   
               ATTRB=(ASKIP,NORM),                                     C00391   
               COLOR=BLUE                                               00392   
ALINE07 DFHMDF POS=(12,49),                                            C00393   
               LENGTH=04,                                              C00394   
               ATTRB=(ASKIP,NORM),                                     C00395   
               COLOR=BLUE                                               00396   
AETA07  DFHMDF POS=(12,54),                                            C00397   
               LENGTH=05,                                              C00398   
               ATTRB=(ASKIP,NORM),                                     C00399   
               COLOR=BLUE                                               00400   
AVHCL07 DFHMDF POS=(12,60),                                            C00401   
               LENGTH=10,                                              C00402   
               ATTRB=(ASKIP,NORM),                                     C00403   
               COLOR=BLUE                                               00404   
ADEST07 DFHMDF POS=(12,71),                                            C00405   
               LENGTH=09,                                              C00406   
               ATTRB=(ASKIP,NORM),                                     C00407   
               COLOR=BLUE                                               00408   
*                                                                       00409   
ADEPT08 DFHMDF POS=(13,01),                                            C00410   
               LENGTH=04,                                              C00411   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00412   
               COLOR=BLUE                                               00413   
APO08   DFHMDF POS=(13,06),                                            C00414   
               LENGTH=08,                                              C00415   
               ATTRB=(ASKIP,NORM),                                     C00416   
               COLOR=BLUE                                               00417   
AVEND08 DFHMDF POS=(13,15),                                            C00418   
               LENGTH=06,                                              C00419   
               ATTRB=(ASKIP,NORM),                                     C00420   
               COLOR=BLUE                                               00421   
AP08    DFHMDF POS=(13,22),                                            C00422   
               LENGTH=01,                                              C00423   
               ATTRB=(ASKIP,NORM),                                     C00424   
               COLOR=BLUE                                               00425   
ASCAC08 DFHMDF POS=(13,24),                                            C00426   
               LENGTH=04,                                              C00427   
               ATTRB=(ASKIP,NORM),                                     C00428   
               COLOR=BLUE                                               00429   
APRO08  DFHMDF POS=(13,29),                                            C00430   
               LENGTH=19,                                              C00431   
               ATTRB=(ASKIP,NORM),                                     C00432   
               COLOR=BLUE                                               00433   
ALINE08 DFHMDF POS=(13,49),                                            C00434   
               LENGTH=04,                                              C00435   
               ATTRB=(ASKIP,NORM),                                     C00436   
               COLOR=BLUE                                               00437   
AETA08  DFHMDF POS=(13,54),                                            C00438   
               LENGTH=05,                                              C00439   
               ATTRB=(ASKIP,NORM),                                     C00440   
               COLOR=BLUE                                               00441   
AVHCL08 DFHMDF POS=(13,60),                                            C00442   
               LENGTH=10,                                              C00443   
               ATTRB=(ASKIP,NORM),                                     C00444   
               COLOR=BLUE                                               00445   
ADEST08 DFHMDF POS=(13,71),                                            C00446   
               LENGTH=09,                                              C00447   
               ATTRB=(ASKIP,NORM),                                     C00448   
               COLOR=BLUE                                               00449   
*                                                                       00450   
ADEPT09 DFHMDF POS=(14,01),                                            C00451   
               LENGTH=04,                                              C00452   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00453   
               COLOR=BLUE                                               00454   
APO09   DFHMDF POS=(14,06),                                            C00455   
               LENGTH=08,                                              C00456   
               ATTRB=(ASKIP,NORM),                                     C00457   
               COLOR=BLUE                                               00458   
AVEND09 DFHMDF POS=(14,15),                                            C00459   
               LENGTH=06,                                              C00460   
               ATTRB=(ASKIP,NORM),                                     C00461   
               COLOR=BLUE                                               00462   
AP09    DFHMDF POS=(14,22),                                            C00463   
               LENGTH=01,                                              C00464   
               ATTRB=(ASKIP,NORM),                                     C00465   
               COLOR=BLUE                                               00466   
ASCAC09 DFHMDF POS=(14,24),                                            C00467   
               LENGTH=04,                                              C00468   
               ATTRB=(ASKIP,NORM),                                     C00469   
               COLOR=BLUE                                               00470   
APRO09  DFHMDF POS=(14,29),                                            C00471   
               LENGTH=19,                                              C00472   
               ATTRB=(ASKIP,NORM),                                     C00473   
               COLOR=BLUE                                               00474   
ALINE09 DFHMDF POS=(14,49),                                            C00475   
               LENGTH=04,                                              C00476   
               ATTRB=(ASKIP,NORM),                                     C00477   
               COLOR=BLUE                                               00478   
AETA09  DFHMDF POS=(14,54),                                            C00479   
               LENGTH=05,                                              C00480   
               ATTRB=(ASKIP,NORM),                                     C00481   
               COLOR=BLUE                                               00482   
AVHCL09 DFHMDF POS=(14,60),                                            C00483   
               LENGTH=10,                                              C00484   
               ATTRB=(ASKIP,NORM),                                     C00485   
               COLOR=BLUE                                               00486   
ADEST09 DFHMDF POS=(14,71),                                            C00487   
               LENGTH=09,                                              C00488   
               ATTRB=(ASKIP,NORM),                                     C00489   
               COLOR=BLUE                                               00490   
*                                                                       00491   
ADEPT10 DFHMDF POS=(15,01),                                            C00492   
               LENGTH=04,                                              C00493   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00494   
               COLOR=BLUE                                               00495   
APO10   DFHMDF POS=(15,06),                                            C00496   
               LENGTH=08,                                              C00497   
               ATTRB=(ASKIP,NORM),                                     C00498   
               COLOR=BLUE                                               00499   
AVEND10 DFHMDF POS=(15,15),                                            C00500   
               LENGTH=06,                                              C00501   
               ATTRB=(ASKIP,NORM),                                     C00502   
               COLOR=BLUE                                               00503   
AP10    DFHMDF POS=(15,22),                                            C00504   
               LENGTH=01,                                              C00505   
               ATTRB=(ASKIP,NORM),                                     C00506   
               COLOR=BLUE                                               00507   
ASCAC10 DFHMDF POS=(15,24),                                            C00508   
               LENGTH=04,                                              C00509   
               ATTRB=(ASKIP,NORM),                                     C00510   
               COLOR=BLUE                                               00511   
APRO10  DFHMDF POS=(15,29),                                            C00512   
               LENGTH=19,                                              C00513   
               ATTRB=(ASKIP,NORM),                                     C00514   
               COLOR=BLUE                                               00515   
ALINE10 DFHMDF POS=(15,49),                                            C00516   
               LENGTH=04,                                              C00517   
               ATTRB=(ASKIP,NORM),                                     C00518   
               COLOR=BLUE                                               00519   
AETA10  DFHMDF POS=(15,54),                                            C00520   
               LENGTH=05,                                              C00521   
               ATTRB=(ASKIP,NORM),                                     C00522   
               COLOR=BLUE                                               00523   
AVHCL10 DFHMDF POS=(15,60),                                            C00524   
               LENGTH=10,                                              C00525   
               ATTRB=(ASKIP,NORM),                                     C00526   
               COLOR=BLUE                                               00527   
ADEST10 DFHMDF POS=(15,71),                                            C00528   
               LENGTH=09,                                              C00529   
               ATTRB=(ASKIP,NORM),                                     C00530   
               COLOR=BLUE                                               00531   
*                                                                       00532   
ADEPT11 DFHMDF POS=(16,01),                                            C00533   
               LENGTH=04,                                              C00534   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00535   
               COLOR=BLUE                                               00536   
APO11   DFHMDF POS=(16,06),                                            C00537   
               LENGTH=08,                                              C00538   
               ATTRB=(ASKIP,NORM),                                     C00539   
               COLOR=BLUE                                               00540   
AVEND11 DFHMDF POS=(16,15),                                            C00541   
               LENGTH=06,                                              C00542   
               ATTRB=(ASKIP,NORM),                                     C00543   
               COLOR=BLUE                                               00544   
AP11    DFHMDF POS=(16,22),                                            C00545   
               LENGTH=01,                                              C00546   
               ATTRB=(ASKIP,NORM),                                     C00547   
               COLOR=BLUE                                               00548   
ASCAC11 DFHMDF POS=(16,24),                                            C00549   
               LENGTH=04,                                              C00550   
               ATTRB=(ASKIP,NORM),                                     C00551   
               COLOR=BLUE                                               00552   
APRO11  DFHMDF POS=(16,29),                                            C00553   
               LENGTH=19,                                              C00554   
               ATTRB=(ASKIP,NORM),                                     C00555   
               COLOR=BLUE                                               00556   
ALINE11 DFHMDF POS=(16,49),                                            C00557   
               LENGTH=04,                                              C00558   
               ATTRB=(ASKIP,NORM),                                     C00559   
               COLOR=BLUE                                               00560   
AETA11  DFHMDF POS=(16,54),                                            C00561   
               LENGTH=05,                                              C00562   
               ATTRB=(ASKIP,NORM),                                     C00563   
               COLOR=BLUE                                               00564   
AVHCL11 DFHMDF POS=(16,60),                                            C00565   
               LENGTH=10,                                              C00566   
               ATTRB=(ASKIP,NORM),                                     C00567   
               COLOR=BLUE                                               00568   
ADEST11 DFHMDF POS=(16,71),                                            C00569   
               LENGTH=09,                                              C00570   
               ATTRB=(ASKIP,NORM),                                     C00571   
               COLOR=BLUE                                               00572   
*                                                                       00573   
ADEPT12 DFHMDF POS=(17,01),                                            C00574   
               LENGTH=04,                                              C00575   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00576   
               COLOR=BLUE                                               00577   
APO12   DFHMDF POS=(17,06),                                            C00578   
               LENGTH=08,                                              C00579   
               ATTRB=(ASKIP,NORM),                                     C00580   
               COLOR=BLUE                                               00581   
AVEND12 DFHMDF POS=(17,15),                                            C00582   
               LENGTH=06,                                              C00583   
               ATTRB=(ASKIP,NORM),                                     C00584   
               COLOR=BLUE                                               00585   
AP12    DFHMDF POS=(17,22),                                            C00586   
               LENGTH=01,                                              C00587   
               ATTRB=(ASKIP,NORM),                                     C00588   
               COLOR=BLUE                                               00589   
ASCAC12 DFHMDF POS=(17,24),                                            C00590   
               LENGTH=04,                                              C00591   
               ATTRB=(ASKIP,NORM),                                     C00592   
               COLOR=BLUE                                               00593   
APRO12  DFHMDF POS=(17,29),                                            C00594   
               LENGTH=19,                                              C00595   
               ATTRB=(ASKIP,NORM),                                     C00596   
               COLOR=BLUE                                               00597   
ALINE12 DFHMDF POS=(17,49),                                            C00598   
               LENGTH=04,                                              C00599   
               ATTRB=(ASKIP,NORM),                                     C00600   
               COLOR=BLUE                                               00601   
AETA12  DFHMDF POS=(17,54),                                            C00602   
               LENGTH=05,                                              C00603   
               ATTRB=(ASKIP,NORM),                                     C00604   
               COLOR=BLUE                                               00605   
AVHCL12 DFHMDF POS=(17,60),                                            C00606   
               LENGTH=10,                                              C00607   
               ATTRB=(ASKIP,NORM),                                     C00608   
               COLOR=BLUE                                               00609   
ADEST12 DFHMDF POS=(17,71),                                            C00610   
               LENGTH=09,                                              C00611   
               ATTRB=(ASKIP,NORM),                                     C00612   
               COLOR=BLUE                                               00613   
*                                                                       00614   
ADEPT13 DFHMDF POS=(18,01),                                            C00615   
               LENGTH=04,                                              C00616   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00617   
               COLOR=BLUE                                               00618   
APO13   DFHMDF POS=(18,06),                                            C00619   
               LENGTH=08,                                              C00620   
               ATTRB=(ASKIP,NORM),                                     C00621   
               COLOR=BLUE                                               00622   
AVEND13 DFHMDF POS=(18,15),                                            C00623   
               LENGTH=06,                                              C00624   
               ATTRB=(ASKIP,NORM),                                     C00625   
               COLOR=BLUE                                               00626   
AP13    DFHMDF POS=(18,22),                                            C00627   
               LENGTH=01,                                              C00628   
               ATTRB=(ASKIP,NORM),                                     C00629   
               COLOR=BLUE                                               00630   
ASCAC13 DFHMDF POS=(18,24),                                            C00631   
               LENGTH=04,                                              C00632   
               ATTRB=(ASKIP,NORM),                                     C00633   
               COLOR=BLUE                                               00634   
APRO13  DFHMDF POS=(18,29),                                            C00635   
               LENGTH=19,                                              C00636   
               ATTRB=(ASKIP,NORM),                                     C00637   
               COLOR=BLUE                                               00638   
ALINE13 DFHMDF POS=(18,49),                                            C00639   
               LENGTH=04,                                              C00640   
               ATTRB=(ASKIP,NORM),                                     C00641   
               COLOR=BLUE                                               00642   
AETA13  DFHMDF POS=(18,54),                                            C00643   
               LENGTH=05,                                              C00644   
               ATTRB=(ASKIP,NORM),                                     C00645   
               COLOR=BLUE                                               00646   
AVHCL13 DFHMDF POS=(18,60),                                            C00647   
               LENGTH=10,                                              C00648   
               ATTRB=(ASKIP,NORM),                                     C00649   
               COLOR=BLUE                                               00650   
ADEST13 DFHMDF POS=(18,71),                                            C00651   
               LENGTH=09,                                              C00652   
               ATTRB=(ASKIP,NORM),                                     C00653   
               COLOR=BLUE                                               00654   
*                                                                       00655   
ADEPT14 DFHMDF POS=(19,01),                                            C00656   
               LENGTH=04,                                              C00657   
               PICOUT='ZZZ9',                                          C00050   
               ATTRB=(ASKIP,NORM),                                     C00658   
               COLOR=BLUE                                               00659   
APO14   DFHMDF POS=(19,06),                                            C00660   
               LENGTH=08,                                              C00661   
               ATTRB=(ASKIP,NORM),                                     C00662   
               COLOR=BLUE                                               00663   
AVEND14 DFHMDF POS=(19,15),                                            C00664   
               LENGTH=06,                                              C00665   
               ATTRB=(ASKIP,NORM),                                     C00666   
               COLOR=BLUE                                               00667   
AP14    DFHMDF POS=(19,22),                                            C00668   
               LENGTH=01,                                              C00669   
               ATTRB=(ASKIP,NORM),                                     C00670   
               COLOR=BLUE                                               00671   
ASCAC14 DFHMDF POS=(19,24),                                            C00672   
               LENGTH=04,                                              C00673   
               ATTRB=(ASKIP,NORM),                                     C00674   
               COLOR=BLUE                                               00675   
APRO14  DFHMDF POS=(19,29),                                            C00676   
               LENGTH=19,                                              C00677   
               ATTRB=(ASKIP,NORM),                                     C00678   
               COLOR=BLUE                                               00679   
ALINE14 DFHMDF POS=(19,49),                                            C00680   
               LENGTH=04,                                              C00681   
               ATTRB=(ASKIP,NORM),                                     C00682   
               COLOR=BLUE                                               00683   
AETA14  DFHMDF POS=(19,54),                                            C00684   
               LENGTH=05,                                              C00685   
               ATTRB=(ASKIP,NORM),                                     C00686   
               COLOR=BLUE                                               00687   
AVHCL14 DFHMDF POS=(19,60),                                            C00688   
               LENGTH=10,                                              C00689   
               ATTRB=(ASKIP,NORM),                                     C00690   
               COLOR=BLUE                                               00691   
ADEST14 DFHMDF POS=(19,71),                                            C00692   
               LENGTH=09,                                              C00693   
               ATTRB=(ASKIP,NORM),                                     C00694   
               COLOR=BLUE                                               00695   
*                                                                       00696   
AMSG    DFHMDF POS=(21,01),                                            C00697   
               LENGTH=78,                                              C00698   
               ATTRB=(ASKIP,BRT),                                      C00699   
               COLOR=NEUTRAL                                            00700   
        DFHMDF POS=(22,01),                                            C00701   
               LENGTH=11,                                              C00702   
               ATTRB=(PROT,BRT),                                       C00703   
               COLOR=NEUTRAL,                                          C00704   
               INITIAL='COMMAND===>'                                    00705   
ANAVCMD DFHMDF POS=(22,14),                                            C00706   
               LENGTH=08,                                              C00707   
               ATTRB=(UNPROT,NORM),                                    C00708   
               COLOR=GREEN,                                            C00709   
               HILIGHT=UNDERLINE                                        00710   
        DFHMDF POS=(22,23),                                            C00711   
               LENGTH=01,                                              C00712   
               ATTRB=(ASKIP)                                            00713   
        DFHMDF POS=(22,25),                                            C00714   
               LENGTH=07,                                              C00715   
               ATTRB=(PROT,BRT),                                       C00716   
               COLOR=NEUTRAL,                                          C00717   
               INITIAL='KEY===>'                                        00718   
ANAVKEY DFHMDF POS=(22,33),                                            C00719   
               LENGTH=25,                                              C00720   
               ATTRB=(UNPROT,NORM,FSET),                               C00721   
               COLOR=GREEN,                                            C00722   
               HILIGHT=UNDERLINE                                        00723   
        DFHMDF POS=(22,59),                                            C00724   
               LENGTH=01,                                              C00725   
               ATTRB=(ASKIP)                                            00726   
        DFHMDF POS=(22,63),                                            C00727   
               LENGTH=16,                                              C00728   
               ATTRB=(PROT,NORM),                                      C00729   
               INITIAL='PA2=OTHER F KEYS',                             C00730   
               COLOR=NEUTRAL                                            00731   
AFKLIN1 DFHMDF POS=(23,01),                                            C00732   
               LENGTH=78,                                              C00733   
               ATTRB=(ASKIP,NORM),                                     C00734   
               COLOR=NEUTRAL                                            00735   
AFKLIN2 DFHMDF POS=(24,01),                                            C00736   
               LENGTH=78,                                              C00737   
               ATTRB=(ASKIP,NORM),                                     C00738   
               COLOR=NEUTRAL                                            00739   
**************                                                          00740   
        DFHMSD TYPE=FINAL                                               00741   
**************                                                          00742   
        END                                                             00743   
