*          DATA SET TRKM182                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM182                                            *   00004   
*        MAP     TR182A                                             *   00005   
*        PROGRAM TRKCS182                                           *   00006   
*        TRANSID Y182                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM182 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR182A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VESSEL NAME:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(02,01)                                              00043   
AVSNM   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=25,                                              X00046   
               POS=(02,14)                                              00047   
        DFHMDF POS=(02,40),LENGTH=01,ATTRB=(PROT)                       00082   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VOYAGE NO..:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(03,01)                                              00043   
AVYNO   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(03,14)                                              00047   
        DFHMDF POS=(03,25),LENGTH=01,ATTRB=(PROT)                       00082   
*                                                                       00043   
        DFHMDF POS=(05,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(05,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(05,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(05,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(05,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(05,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00043   
        DFHMDF POS=(07,01),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='SEL'                                            00061   
        DFHMDF POS=(07,06),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ACT'                                            00064   
        DFHMDF POS=(07,13),LENGTH=09,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CONTAINER'                                      00061   
        DFHMDF POS=(07,29),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='FOB'                                            00064   
        DFHMDF POS=(07,38),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ATD'                                            00067   
        DFHMDF POS=(07,50),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ATA'                                            00067   
        DFHMDF POS=(07,59),LENGTH=06,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='PO CNT'                                         00061   
        DFHMDF POS=(07,69),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='SCAC'                                           00061   
*                                                                               
ASEL01  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT01  DFHMDF POS=(08,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO01  DFHMDF POS=(08,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AFOB01  DFHMDF POS=(08,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD01  DFHMDF POS=(08,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA01  DFHMDF POS=(08,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT01 DFHMDF POS=(08,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC01 DFHMDF POS=(08,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL02  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT02  DFHMDF POS=(09,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO02  DFHMDF POS=(09,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB02  DFHMDF POS=(09,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD02  DFHMDF POS=(09,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA02  DFHMDF POS=(09,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT02 DFHMDF POS=(09,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC02 DFHMDF POS=(09,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL03  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT03  DFHMDF POS=(10,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO03  DFHMDF POS=(10,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB03  DFHMDF POS=(10,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD03  DFHMDF POS=(10,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA03  DFHMDF POS=(10,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT03 DFHMDF POS=(10,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC03 DFHMDF POS=(10,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL04  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT04  DFHMDF POS=(11,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO04  DFHMDF POS=(11,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB04  DFHMDF POS=(11,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD04  DFHMDF POS=(11,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA04  DFHMDF POS=(11,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT04 DFHMDF POS=(11,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC04 DFHMDF POS=(11,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL05  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT05  DFHMDF POS=(12,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO05  DFHMDF POS=(12,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB05  DFHMDF POS=(12,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD05  DFHMDF POS=(12,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA05  DFHMDF POS=(12,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT05 DFHMDF POS=(12,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC05 DFHMDF POS=(12,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL06  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT06  DFHMDF POS=(13,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO06  DFHMDF POS=(13,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB06  DFHMDF POS=(13,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD06  DFHMDF POS=(13,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA06  DFHMDF POS=(13,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT06 DFHMDF POS=(13,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC06 DFHMDF POS=(13,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL07  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT07  DFHMDF POS=(14,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO07  DFHMDF POS=(14,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB07  DFHMDF POS=(14,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD07  DFHMDF POS=(14,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA07  DFHMDF POS=(14,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT07 DFHMDF POS=(14,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC07 DFHMDF POS=(14,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL08  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT08  DFHMDF POS=(15,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO08  DFHMDF POS=(15,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB08  DFHMDF POS=(15,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD08  DFHMDF POS=(15,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA08  DFHMDF POS=(15,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT08 DFHMDF POS=(15,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC08 DFHMDF POS=(15,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL09  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT09  DFHMDF POS=(16,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO09  DFHMDF POS=(16,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB09  DFHMDF POS=(16,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD09  DFHMDF POS=(16,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA09  DFHMDF POS=(16,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT09 DFHMDF POS=(16,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC09 DFHMDF POS=(16,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL10  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT10  DFHMDF POS=(17,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO10  DFHMDF POS=(17,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB10  DFHMDF POS=(17,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD10  DFHMDF POS=(17,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA10  DFHMDF POS=(17,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT10 DFHMDF POS=(17,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC10 DFHMDF POS=(17,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
ASEL11  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT11  DFHMDF POS=(18,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNO11  DFHMDF POS=(18,13),LENGTH=12,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AFOB11  DFHMDF POS=(18,29),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATD11  DFHMDF POS=(18,36),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA11  DFHMDF POS=(18,48),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCNT11 DFHMDF POS=(18,60),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZ'                                  00094   
ASCAC11 DFHMDF POS=(18,69),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
*                                                                       00095   
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
