  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM320                                            *   00004   
*        MAP     TR320A                                             *   00005   
*        PROGRAM TRKCS320                                           *   00006   
*        TRANSID Y320 - DECONSOLIDATION CONTROL PANEL CRIT SPEC     *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM320 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR320A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='POE CODE...:',                                 X00022   
               LENGTH=12,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(07,10)                                              00026**2
APOECOD DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(07,24)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(07,28)                                              00087**3
*                                                                               
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='FOR WEEK OF:',                                 X00022   
               LENGTH=12,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(09,10)                                              00026**2
AWEEKOF DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00033**3
               LENGTH=8,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(09,24)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(09,33)                                              00087**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='(MMDDYYYY)',                                   X00022   
               LENGTH=10,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(09,35)                                              00026**2
*                                                                               
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
