*          DATA SET TRKM153    AT LEVEL 005 AS OF 02/05/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM153                                            *   00004   
*        MAP     TR153A                                             *   00005   
*        PROGRAM TRKCS153                                           *   00006   
*        TRANSID Y153 - PORT OF ENTRY CRITERIA SPEC                 *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM153 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR153A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
         DFHMDF POS=(06,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=045,                                             X00027   
               INITIAL='ENTER CODE TO LIST SPECIFIC POE.             '  00028   
*                                                                       00020   
         DFHMDF POS=(08,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=070,                                             X00027   
               INITIAL='LEAVE BLANK OR ENTER CODE PLUS * TO LIST ACTIVEX00028   
               S.                     '                                 00029   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='PORT OF ENTRY CODE:',                          X00022   
               LENGTH=19,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(11,10)                                              00026**2
APOECOD DFHMDF ATTRB=(UNPROT,NORM,IC),                                 X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(11,30)                                              00037**5
APOECTY DFHMDF ATTRB=(ASKIP,NORM),                                     X00049   
               LENGTH=30,                                              X00050   
               COLOR=BLUE,                                             X00051   
               POS=(11,34)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(11,65)                                              00087**3
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
