*          DATA SET TRKM126    AT LEVEL 004 AS OF 05/24/95                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM126                                            *   00004**2
*        MAP     TR126A                                             *   00005**2
*        PROGRAM TRKCS126                                           *   00006**2
*        TRANSID Y126                                               *   00007**2
*        SYSTEM  CICS ARCHITECTURE - FORCAST SHIPMENT DELETE        *   00008**2
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM126 DFHMSD TYPE=DSECT,                                             X00011**2
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR126A  DFHMDI LINE=2,COLUMN=1,                                        X00017**2
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*********************************************************************   00022   
*  OPER ID AND FACILITY NAME                                        *   00023   
*********************************************************************   00024   
        DFHMDF POS=(04,04),                                            X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='OP ID:',                                       X00027   
               LENGTH=06                                                00028   
AOPER   DFHMDF ATTRB=(ASKIP),                                          X00029   
               LENGTH=04,                                              X00030   
               COLOR=BLUE,                                             X00031   
               PICOUT='ZZZZ',                                          X00032   
               POS=(04,11)                                              00033   
AFCLTY  DFHMDF ATTRB=(ASKIP),                                          X00034   
               LENGTH=04,                                              X00035   
               COLOR=BLUE,                                             X00036   
               PICOUT='ZZZZ',                                          X00037   
               POS=(04,16)                                              00038   
AFDESC  DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=BLUE,                                             X00040   
               LENGTH=25,                                              X00041   
               POS=(04,21)                                              00042   
********************************************************************    00043   
*  F/B NUMBER                                                      *    00044   
********************************************************************    00045   
        DFHMDF POS=(06,04),                                            X00046   
               ATTRB=(ASKIP,BRT),                                      X00047   
               INITIAL='F/B NO .......:',                              X00048   
               LENGTH=015                                               00049   
AFBNBR  DFHMDF ATTRB=(ASKIP),                                          X00050**2
               COLOR=BLUE,                                             X00051**2
               LENGTH=22,                                              X00052   
               POS=(06,20)                                              00053   
********************************************************************    00054   
*  ASN CARTON COUNT                                                *    00055   
********************************************************************    00056   
        DFHMDF POS=(06,51),                                            X00057   
               ATTRB=(ASKIP,BRT),                                      X00058   
               INITIAL='ASN CARTON COUNT.....:',                       X00059   
               LENGTH=022                                               00060   
AASNCRT DFHMDF ATTRB=(ASKIP),                                          X00061   
               COLOR=BLUE,                                             X00062   
               LENGTH=04,                                              X00063   
               PICOUT='9999',                                          X00064   
               POS=(06,74)                                              00065   
********************************************************************    00066   
*  BOL NUMBER                                                      *    00067   
********************************************************************    00068   
        DFHMDF POS=(07,04),                                            X00069   
               ATTRB=(ASKIP,BRT),                                      X00070   
               INITIAL='BOL NO .......:',                              X00071   
               LENGTH=015                                               00072   
ABOLNBR DFHMDF ATTRB=(ASKIP),                                          X00073**2
               COLOR=BLUE,                                             X00074**2
               LENGTH=30,                                              X00075   
               POS=(07,20)                                              00076   
********************************************************************    00077   
*  FORCAST CARTON COUNT                                            *    00078   
********************************************************************    00079   
        DFHMDF POS=(07,51),                                            X00080   
               ATTRB=(ASKIP,BRT),                                      X00081   
               INITIAL='FORECAST CARTON COUNT:',                       X00082   
               LENGTH=022                                               00083   
AFORCRT DFHMDF ATTRB=(ASKIP),                                          X00084   
               COLOR=BLUE,                                             X00085   
               LENGTH=04,                                              X00086   
               PICOUT='9999',                                          X00087   
               POS=(07,74)                                              00088   
********************************************************************    00089   
*  F/B CARTON COUNT                                                *    00090   
********************************************************************    00091   
        DFHMDF POS=(08,04),                                            X00092   
               ATTRB=(ASKIP,BRT),                                      X00093   
               INITIAL='F/B CARTON CNT:',                              X00094   
               LENGTH=015                                               00095   
AFBCRT  DFHMDF ATTRB=(ASKIP),                                          X00096**2
               COLOR=BLUE,                                             X00097**2
               PICOUT='9999',                                          X00098   
               POS=(08,20)                                              00099   
********************************************************************    00100   
*  VENDOR SHIP DATE                                                     00101   
********************************************************************    00102   
        DFHMDF POS=(09,04),                                            X00103   
               ATTRB=(ASKIP,BRT),                                      X00104   
               INITIAL='VEND SHIP DATE:',                              X00105   
               LENGTH=015                                               00106   
AVNSDTE DFHMDF ATTRB=(ASKIP),                                          X00107**2
               COLOR=BLUE,                                             X00108**2
               LENGTH=10,                                              X00109   
               POS=(09,20)                                              00110   
********************************************************************    00111   
*  ORIGINAL SCAC                                                        00112   
********************************************************************    00113   
        DFHMDF POS=(11,04),                                            X00114   
               ATTRB=(ASKIP,BRT),                                      X00115   
               INITIAL='ORIGIN SCAC ..:',                              X00116   
               LENGTH=015                                               00117   
AOSCAC  DFHMDF ATTRB=(ASKIP),                                          X00118**2
               COLOR=BLUE,                                             X00119**2
               LENGTH=04,                                              X00120   
               POS=(11,20)                                              00121   
AOSCACD DFHMDF ATTRB=(ASKIP),                                          X00122   
               COLOR=BLUE,                                             X00123   
               LENGTH=30,                                              X00124   
               POS=(11,28)                                              00125   
********************************************************************    00126   
*  DELIVERY SCAC                                                        00127   
********************************************************************    00128   
        DFHMDF POS=(12,04),                                            X00129   
               ATTRB=(ASKIP,BRT),                                      X00130   
               INITIAL='DELIVERY SCAC.:',                              X00131   
               LENGTH=015                                               00132   
ADSCAC  DFHMDF ATTRB=(ASKIP),                                          X00133**2
               COLOR=BLUE,                                             X00134**2
               LENGTH=04,                                              X00135   
               POS=(12,20)                                              00136   
ADSCACD DFHMDF ATTRB=(ASKIP),                                          X00137   
               COLOR=BLUE,                                             X00138   
               LENGTH=30,                                              X00139   
               POS=(12,28)                                              00140   
********************************************************************    00141   
*  TRAILER NUMBER                                                       00142   
********************************************************************    00143   
        DFHMDF POS=(13,04),                                            X00144   
               ATTRB=(ASKIP,BRT),                                      X00145   
               INITIAL='TRAILER NO ...:',                              X00146   
               LENGTH=015                                               00147   
ATRAILR DFHMDF ATTRB=(ASKIP),                                          X00148**2
               COLOR=BLUE,                                             X00149**2
               LENGTH=10,                                              X00150   
               POS=(13,20)                                              00151   
********************************************************************    00152   
*  ESTIMATED DATE OF ARRIVAL                                            00153   
********************************************************************    00154   
        DFHMDF POS=(14,04),                                            X00155   
               ATTRB=(ASKIP,BRT),                                      X00156   
               INITIAL='ETA DATE .....:',                              X00157   
               LENGTH=015                                               00158   
AETADTE DFHMDF ATTRB=(ASKIP),                                          X00159**2
               COLOR=BLUE,                                             X00160**2
               LENGTH=10,                                              X00161**3
               POS=(14,20)                                              00162   
********************************************************************    00163   
*  ESTIMATED TIME OF ARRIVAL                                            00164   
********************************************************************    00165   
        DFHMDF POS=(15,04),                                            X00166   
               ATTRB=(ASKIP,BRT),                                      X00167   
               INITIAL='ETA TIME .....:',                              X00168   
               LENGTH=015                                               00169   
AETAHH  DFHMDF ATTRB=(ASKIP),                                          X00170**4
               COLOR=BLUE,                                             X00171**2
               LENGTH=02,                                              X00172**4
               POS=(15,20)                                              00173   
AETAMM  DFHMDF ATTRB=(ASKIP),                                          X00174**4
               COLOR=BLUE,                                             X00175**4
               LENGTH=02,                                              X00176**4
               POS=(15,23)                                              00177**4
********************************************************************    00178   
*  AUTHORIZATION NUMBER                                                 00179   
********************************************************************    00180   
        DFHMDF POS=(16,04),                                            X00181   
               ATTRB=(ASKIP,BRT),                                      X00182   
               INITIAL='AUTH NUMBER ..:',                              X00183   
               LENGTH=015                                               00184   
AAUTHNB DFHMDF ATTRB=(ASKIP),                                          X00185**2
               COLOR=BLUE,                                             X00186**2
               LENGTH=16,                                              X00187   
               POS=(16,20)                                              00188   
********************************************************************    00189   
*  AUTHORIZATION DATE ....                                              00190   
********************************************************************    00191   
        DFHMDF POS=(17,04),                                            X00192   
               ATTRB=(ASKIP,BRT),                                      X00193   
               INITIAL='AUTH DATE ....:',                              X00194   
               LENGTH=015                                               00195   
AAUTHDT DFHMDF ATTRB=(ASKIP),                                          X00196**2
               COLOR=BLUE,                                             X00197**2
               LENGTH=10,                                              X00198   
               POS=(17,20)                                              00199   
********************************************************************    00200   
         DFHMSD TYPE=FINAL                                              00201   
         END                                                            00202   
