*          DATA SET TRKM155    AT LEVEL 001 AS OF 12/29/97              00010001
  PRINT  NOGEN                                                          00020000
*-------------------------------------------------------------------*   00030000
*                                                                   *   00040000
*        MAPSET  TRKM155                                            *   00050001
*        MAP     TR155A                                             *   00060001
*        PROGRAM TRKCS155                                           *   00070001
*        TRANSID Y155 - EDI PORT OF ENTRY LIST                      *   00080001
*        SYSTEM  CICS ARCHITECTURE                                  *   00090000
*                                                                   *   00100000
*-------------------------------------------------------------------*   00110000
TRKM155 DFHMSD TYPE=MAP,                                               X00120001
               MODE=INOUT,                                             X00130000
               LANG=COBOL,                                             X00140000
               TIOAPFX=YES,                                            X00150000
               CTRL=(FREEKB)                                            00160000
TR155A  DFHMDI LINE=2,COLUMN=1,                                        X00170001
               SIZE=(19,80),                                           X00180000
               MAPATTS=(COLOR,HILIGHT),                                X00190000
               DSATTS=(COLOR,HILIGHT)                                   00200000
*                                                                       00210000
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00220000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00230000
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00240000
               COLOR=GREEN,                                            C00250000
               HILIGHT=UNDERLINE,                                      C00260000
               PICOUT='ZZZZ9'                                           00270000
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00280000
               COLOR=NEUTRAL,                                          C00290000
               INITIAL='TO'                                             00300000
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00310000
               COLOR=BLUE,                                             C00320000
               PICOUT='ZZZZ9'                                           00330000
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00340000
               COLOR=NEUTRAL,                                          C00350000
               INITIAL='OF'                                             00360000
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00370000
               COLOR=BLUE,                                             C00380000
               PICOUT='ZZZZ9'                                           00390000
*                                                                       00400000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00410000
               INITIAL='POE',                                          X00420001
               LENGTH=03,                                              X00430001
               COLOR=NEUTRAL,                                          X00440000
               POS=(03,11)                                              00450024
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00450137
               INITIAL='DCNSL',                                        X00450237
               LENGTH=05,                                              X00450337
               COLOR=NEUTRAL,                                          X00450437
               POS=(03,15)                                              00450537
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00450637
               INITIAL='EDI',                                          X00450737
               LENGTH=03,                                              X00450837
               COLOR=NEUTRAL,                                          X00450937
               POS=(03,21)                                              00451037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00451224
               INITIAL='ON',                                           X00451324
               LENGTH=02,                                              X00451424
               COLOR=NEUTRAL,                                          X00451524
               POS=(03,26)                                              00451637
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00451731
               INITIAL='TRIP',                                         X00451831
               LENGTH=04,                                              X00451931
               COLOR=NEUTRAL,                                          X00452031
               POS=(03,48)                                              00453037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00510034
               INITIAL='IATA',                                         X00520034
               LENGTH=04,                                              X00530034
               COLOR=NEUTRAL,                                          X00540034
               POS=(03,75)                                              00550034
*                                                                       00610000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00620000
               INITIAL='SEL',                                          X00630000
               LENGTH=03,                                              X00640000
               COLOR=NEUTRAL,                                          X00650000
               POS=(04,02)                                              00660006
        DFHMDF POS=(04,07),LENGTH=03,ATTRB=(PROT,NORM),                C00670023
               COLOR=NEUTRAL,                                          C00680000
               INITIAL='ACT'                                            00690000
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00700000
               INITIAL='CDE',                                          X00710017
               LENGTH=03,                                              X00720017
               COLOR=NEUTRAL,                                          X00730000
               POS=(04,11)                                              00740023
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00742037
               INITIAL='SCAC',                                         X00743037
               LENGTH=04,                                              X00744037
               COLOR=NEUTRAL,                                          X00745037
               POS=(04,15)                                              00746037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00746137
               INITIAL='CODE',                                         X00746237
               LENGTH=4,                                               X00746337
               COLOR=NEUTRAL,                                          X00746437
               POS=(04,21)                                              00746537
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00750024
               INITIAL='PO',                                           X00760024
               LENGTH=02,                                              X00770024
               COLOR=NEUTRAL,                                          X00780024
               POS=(04,26)                                              00790037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00800000
               INITIAL='CITY',                                         X00810016
               LENGTH=4,                                               X00820016
               COLOR=NEUTRAL,                                          X00830000
               POS=(04,32)                                              00840037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00850000
               INITIAL='ST',                                           X00860001
               LENGTH=02,                                              X00870001
               COLOR=NEUTRAL,                                          X00880000
               POS=(04,45)                                              00890037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00891031
               INITIAL='TYPE',                                         X00892031
               LENGTH=04,                                              X00893031
               COLOR=NEUTRAL,                                          X00894031
               POS=(04,48)                                              00895037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00900000
               INITIAL='OCEAN PORT/AIRPORT',                           X00910030
               LENGTH=18,                                              X00920030
               COLOR=NEUTRAL,                                          X00930000
               POS=(04,53)                                              00940037
        DFHMDF ATTRB=(ASKIP,BRT),                                      X01041034
               INITIAL='CODE',                                         X01042034
               LENGTH=4,                                               X01043034
               COLOR=NEUTRAL,                                          X01044034
               POS=(04,75)                                              01045034
*                                                                       01050000
ASEL01  DFHMDF POS=(05,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01060006
               HILIGHT=UNDERLINE,                                      C01070000
               COLOR=GREEN                                              01080000
        DFHMDF POS=(05,05),LENGTH=01,ATTRB=(ASKIP)                      01090021
AACT01  DFHMDF POS=(05,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01100021
               COLOR=BLUE                                               01110000
APOE01  DFHMDF ATTRB=ASKIP,                                            X01160001
               LENGTH=03,                                              X01170000
               COLOR=BLUE,                                             X01180000
               POS=(05,11)                                              01190022
ADCNS01 DFHMDF ATTRB=ASKIP,                                            X01190137
               LENGTH=04,                                              X01190237
               COLOR=BLUE,                                             X01190337
               POS=(05,15)                                              01190437
AEDI01  DFHMDF ATTRB=ASKIP,                                            X01190537
               LENGTH=04,                                              X01190637
               COLOR=BLUE,                                             X01190737
               POS=(05,21)                                              01190837
AONPO01 DFHMDF ATTRB=ASKIP,                                            X01191028
               LENGTH=01,                                              X01192028
               COLOR=BLUE,                                             X01193028
               POS=(05,26)                                              01194037
ACTY01  DFHMDF ATTRB=ASKIP,                                            X01200000
               LENGTH=15,                                              X01210029
               COLOR=BLUE,                                             X01220000
               POS=(05,29)                                              01230037
ASTAT01 DFHMDF ATTRB=ASKIP,                                            X01240001
               LENGTH=02,                                              X01250001
               COLOR=BLUE,                                             X01260000
               POS=(05,45)                                              01270037
ATRIP01 DFHMDF ATTRB=ASKIP,                                            X01271031
               LENGTH=01,                                              X01272031
               COLOR=BLUE,                                             X01273031
               POS=(05,49)                                              01274037
APORT01 DFHMDF ATTRB=ASKIP,                                            X01280001
               LENGTH=20,                                              X01290001
               COLOR=BLUE,                                             X01300000
               POS=(05,53)                                              01310037
AIATA01 DFHMDF ATTRB=ASKIP,                                            X01391034
               LENGTH=03,                                              X01392034
               COLOR=BLUE,                                             X01393034
               POS=(05,75)                                              01394034
*                                                                       01400000
ASEL02  DFHMDF POS=(06,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01404207
               HILIGHT=UNDERLINE,                                      C01404301
               COLOR=GREEN                                              01404401
        DFHMDF POS=(06,05),LENGTH=01,ATTRB=(ASKIP)                      01404523
AACT02  DFHMDF POS=(06,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01406023
               COLOR=BLUE                                               01407001
APOE02  DFHMDF ATTRB=ASKIP,                                            X01408001
               LENGTH=03,                                              X01409001
               COLOR=BLUE,                                             X01409101
               POS=(06,11)                                              01409223
ADCNS02 DFHMDF ATTRB=ASKIP,                                            X01409337
               LENGTH=04,                                              X01409437
               COLOR=BLUE,                                             X01409537
               POS=(06,15)                                              01409637
AEDI02  DFHMDF ATTRB=ASKIP,                                            X01409737
               LENGTH=04,                                              X01409837
               COLOR=BLUE,                                             X01409937
               POS=(06,21)                                              01410037
AONPO02 DFHMDF ATTRB=ASKIP,                                            X01410137
               LENGTH=01,                                              X01410237
               COLOR=BLUE,                                             X01410337
               POS=(06,26)                                              01410437
ACTY02  DFHMDF ATTRB=ASKIP,                                            X01410537
               LENGTH=15,                                              X01410637
               COLOR=BLUE,                                             X01410737
               POS=(06,29)                                              01410837
ASTAT02 DFHMDF ATTRB=ASKIP,                                            X01410937
               LENGTH=02,                                              X01411037
               COLOR=BLUE,                                             X01411137
               POS=(06,45)                                              01411237
ATRIP02 DFHMDF ATTRB=ASKIP,                                            X01411337
               LENGTH=01,                                              X01411437
               COLOR=BLUE,                                             X01411537
               POS=(06,49)                                              01411637
APORT02 DFHMDF ATTRB=ASKIP,                                            X01411737
               LENGTH=20,                                              X01411837
               COLOR=BLUE,                                             X01411937
               POS=(06,53)                                              01412037
AIATA02 DFHMDF ATTRB=ASKIP,                                            X01412137
               LENGTH=03,                                              X01412237
               COLOR=BLUE,                                             X01412337
               POS=(06,75)                                              01412437
*                                                                       01415701
ASEL03  DFHMDF POS=(07,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01415807
               HILIGHT=UNDERLINE,                                      C01415901
               COLOR=GREEN                                              01416001
        DFHMDF POS=(07,05),LENGTH=01,ATTRB=(ASKIP)                      01416123
AACT03  DFHMDF POS=(07,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01416223
               COLOR=BLUE                                               01416301
APOE03  DFHMDF ATTRB=ASKIP,                                            X01416401
               LENGTH=03,                                              X01416501
               COLOR=BLUE,                                             X01416601
               POS=(07,11)                                              01416723
ADCNS03 DFHMDF ATTRB=ASKIP,                                            X01416837
               LENGTH=04,                                              X01416937
               COLOR=BLUE,                                             X01417037
               POS=(07,15)                                              01417137
AEDI03  DFHMDF ATTRB=ASKIP,                                            X01417237
               LENGTH=04,                                              X01417337
               COLOR=BLUE,                                             X01417437
               POS=(07,21)                                              01417537
AONPO03 DFHMDF ATTRB=ASKIP,                                            X01417637
               LENGTH=01,                                              X01417737
               COLOR=BLUE,                                             X01417837
               POS=(07,26)                                              01417937
ACTY03  DFHMDF ATTRB=ASKIP,                                            X01418037
               LENGTH=15,                                              X01418137
               COLOR=BLUE,                                             X01418237
               POS=(07,29)                                              01418337
ASTAT03 DFHMDF ATTRB=ASKIP,                                            X01418437
               LENGTH=02,                                              X01418537
               COLOR=BLUE,                                             X01418637
               POS=(07,45)                                              01418737
ATRIP03 DFHMDF ATTRB=ASKIP,                                            X01418837
               LENGTH=01,                                              X01418937
               COLOR=BLUE,                                             X01419037
               POS=(07,49)                                              01419137
APORT03 DFHMDF ATTRB=ASKIP,                                            X01419237
               LENGTH=20,                                              X01419337
               COLOR=BLUE,                                             X01419437
               POS=(07,53)                                              01419537
AIATA03 DFHMDF ATTRB=ASKIP,                                            X01419637
               LENGTH=03,                                              X01419737
               COLOR=BLUE,                                             X01419837
               POS=(07,75)                                              01419937
*                                                                       01423201
ASEL04  DFHMDF POS=(08,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01423307
               HILIGHT=UNDERLINE,                                      C01423401
               COLOR=GREEN                                              01423501
        DFHMDF POS=(08,05),LENGTH=01,ATTRB=(ASKIP)                      01423623
AACT04  DFHMDF POS=(08,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01423723
               COLOR=BLUE                                               01423801
APOE04  DFHMDF ATTRB=ASKIP,                                            X01423901
               LENGTH=03,                                              X01424001
               COLOR=BLUE,                                             X01424101
               POS=(08,11)                                              01424223
ADCNS04 DFHMDF ATTRB=ASKIP,                                            X01424337
               LENGTH=04,                                              X01424437
               COLOR=BLUE,                                             X01424537
               POS=(08,15)                                              01424637
AEDI04  DFHMDF ATTRB=ASKIP,                                            X01424737
               LENGTH=04,                                              X01424837
               COLOR=BLUE,                                             X01424937
               POS=(08,21)                                              01425037
AONPO04 DFHMDF ATTRB=ASKIP,                                            X01425137
               LENGTH=01,                                              X01425237
               COLOR=BLUE,                                             X01425337
               POS=(08,26)                                              01425437
ACTY04  DFHMDF ATTRB=ASKIP,                                            X01425537
               LENGTH=15,                                              X01425637
               COLOR=BLUE,                                             X01425737
               POS=(08,29)                                              01425837
ASTAT04 DFHMDF ATTRB=ASKIP,                                            X01425937
               LENGTH=02,                                              X01426037
               COLOR=BLUE,                                             X01426137
               POS=(08,45)                                              01426237
ATRIP04 DFHMDF ATTRB=ASKIP,                                            X01426337
               LENGTH=01,                                              X01426437
               COLOR=BLUE,                                             X01426537
               POS=(08,49)                                              01426637
APORT04 DFHMDF ATTRB=ASKIP,                                            X01426737
               LENGTH=20,                                              X01426837
               COLOR=BLUE,                                             X01426937
               POS=(08,53)                                              01427037
AIATA04 DFHMDF ATTRB=ASKIP,                                            X01427137
               LENGTH=03,                                              X01427237
               COLOR=BLUE,                                             X01427337
               POS=(08,75)                                              01427437
*                                                                       01430701
ASEL05  DFHMDF POS=(09,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01430807
               HILIGHT=UNDERLINE,                                      C01430901
               COLOR=GREEN                                              01431001
        DFHMDF POS=(09,05),LENGTH=01,ATTRB=(ASKIP)                      01431123
AACT05  DFHMDF POS=(09,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01431223
               COLOR=BLUE                                               01431301
APOE05  DFHMDF ATTRB=ASKIP,                                            X01431401
               LENGTH=03,                                              X01431501
               COLOR=BLUE,                                             X01431601
               POS=(09,11)                                              01431723
ADCNS05 DFHMDF ATTRB=ASKIP,                                            X01431837
               LENGTH=04,                                              X01431937
               COLOR=BLUE,                                             X01432037
               POS=(09,15)                                              01432137
AEDI05  DFHMDF ATTRB=ASKIP,                                            X01432237
               LENGTH=04,                                              X01432337
               COLOR=BLUE,                                             X01432437
               POS=(09,21)                                              01432537
AONPO05 DFHMDF ATTRB=ASKIP,                                            X01432637
               LENGTH=01,                                              X01432737
               COLOR=BLUE,                                             X01432837
               POS=(09,26)                                              01432937
ACTY05  DFHMDF ATTRB=ASKIP,                                            X01433037
               LENGTH=15,                                              X01433137
               COLOR=BLUE,                                             X01433237
               POS=(09,29)                                              01433337
ASTAT05 DFHMDF ATTRB=ASKIP,                                            X01433437
               LENGTH=02,                                              X01433537
               COLOR=BLUE,                                             X01433637
               POS=(09,45)                                              01433737
ATRIP05 DFHMDF ATTRB=ASKIP,                                            X01433837
               LENGTH=01,                                              X01433937
               COLOR=BLUE,                                             X01434037
               POS=(09,49)                                              01434137
APORT05 DFHMDF ATTRB=ASKIP,                                            X01434237
               LENGTH=20,                                              X01434337
               COLOR=BLUE,                                             X01434437
               POS=(09,53)                                              01434537
AIATA05 DFHMDF ATTRB=ASKIP,                                            X01434637
               LENGTH=03,                                              X01434737
               COLOR=BLUE,                                             X01434837
               POS=(09,75)                                              01434937
*                                                                       01438201
ASEL06  DFHMDF POS=(10,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01438307
               HILIGHT=UNDERLINE,                                      C01438401
               COLOR=GREEN                                              01438501
        DFHMDF POS=(10,05),LENGTH=01,ATTRB=(ASKIP)                      01438623
AACT06  DFHMDF POS=(10,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01438723
               COLOR=BLUE                                               01438801
APOE06  DFHMDF ATTRB=ASKIP,                                            X01438901
               LENGTH=03,                                              X01439001
               COLOR=BLUE,                                             X01439101
               POS=(10,11)                                              01439223
ADCNS06 DFHMDF ATTRB=ASKIP,                                            X01439337
               LENGTH=04,                                              X01439437
               COLOR=BLUE,                                             X01439537
               POS=(10,15)                                              01439637
AEDI06  DFHMDF ATTRB=ASKIP,                                            X01439737
               LENGTH=04,                                              X01439837
               COLOR=BLUE,                                             X01439937
               POS=(10,21)                                              01440037
AONPO06 DFHMDF ATTRB=ASKIP,                                            X01440137
               LENGTH=01,                                              X01440237
               COLOR=BLUE,                                             X01440337
               POS=(10,26)                                              01440437
ACTY06  DFHMDF ATTRB=ASKIP,                                            X01440537
               LENGTH=15,                                              X01440637
               COLOR=BLUE,                                             X01440737
               POS=(10,29)                                              01440837
ASTAT06 DFHMDF ATTRB=ASKIP,                                            X01440937
               LENGTH=02,                                              X01441037
               COLOR=BLUE,                                             X01441137
               POS=(10,45)                                              01441237
ATRIP06 DFHMDF ATTRB=ASKIP,                                            X01441337
               LENGTH=01,                                              X01441437
               COLOR=BLUE,                                             X01441537
               POS=(10,49)                                              01441637
APORT06 DFHMDF ATTRB=ASKIP,                                            X01441737
               LENGTH=20,                                              X01441837
               COLOR=BLUE,                                             X01441937
               POS=(10,53)                                              01442037
AIATA06 DFHMDF ATTRB=ASKIP,                                            X01442137
               LENGTH=03,                                              X01442237
               COLOR=BLUE,                                             X01442337
               POS=(10,75)                                              01442437
*                                                                       01445701
ASEL07  DFHMDF POS=(11,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01445807
               HILIGHT=UNDERLINE,                                      C01445901
               COLOR=GREEN                                              01446001
        DFHMDF POS=(11,05),LENGTH=01,ATTRB=(ASKIP)                      01446123
AACT07  DFHMDF POS=(11,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01446223
               COLOR=BLUE                                               01446301
APOE07  DFHMDF ATTRB=ASKIP,                                            X01446401
               LENGTH=03,                                              X01446501
               COLOR=BLUE,                                             X01446601
               POS=(11,11)                                              01446723
ADCNS07 DFHMDF ATTRB=ASKIP,                                            X01446837
               LENGTH=04,                                              X01446937
               COLOR=BLUE,                                             X01447037
               POS=(11,15)                                              01447137
AEDI07  DFHMDF ATTRB=ASKIP,                                            X01447237
               LENGTH=04,                                              X01447337
               COLOR=BLUE,                                             X01447437
               POS=(11,21)                                              01447537
AONPO07 DFHMDF ATTRB=ASKIP,                                            X01447637
               LENGTH=01,                                              X01447737
               COLOR=BLUE,                                             X01447837
               POS=(11,26)                                              01447937
ACTY07  DFHMDF ATTRB=ASKIP,                                            X01448037
               LENGTH=15,                                              X01448137
               COLOR=BLUE,                                             X01448237
               POS=(11,29)                                              01448337
ASTAT07 DFHMDF ATTRB=ASKIP,                                            X01448437
               LENGTH=02,                                              X01448537
               COLOR=BLUE,                                             X01448637
               POS=(11,45)                                              01448737
ATRIP07 DFHMDF ATTRB=ASKIP,                                            X01448837
               LENGTH=01,                                              X01448937
               COLOR=BLUE,                                             X01449037
               POS=(11,49)                                              01449137
APORT07 DFHMDF ATTRB=ASKIP,                                            X01449237
               LENGTH=20,                                              X01449337
               COLOR=BLUE,                                             X01449437
               POS=(11,53)                                              01449537
AIATA07 DFHMDF ATTRB=ASKIP,                                            X01449637
               LENGTH=03,                                              X01449737
               COLOR=BLUE,                                             X01449837
               POS=(11,75)                                              01449937
*                                                                       01453201
ASEL08  DFHMDF POS=(12,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01453307
               HILIGHT=UNDERLINE,                                      C01453401
               COLOR=GREEN                                              01453501
        DFHMDF POS=(12,05),LENGTH=01,ATTRB=(ASKIP)                      01453623
AACT08  DFHMDF POS=(12,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01453723
               COLOR=BLUE                                               01453801
APOE08  DFHMDF ATTRB=ASKIP,                                            X01453901
               LENGTH=03,                                              X01454001
               COLOR=BLUE,                                             X01454101
               POS=(12,11)                                              01454223
ADCNS08 DFHMDF ATTRB=ASKIP,                                            X01454337
               LENGTH=04,                                              X01454437
               COLOR=BLUE,                                             X01454537
               POS=(12,15)                                              01454637
AEDI08  DFHMDF ATTRB=ASKIP,                                            X01454737
               LENGTH=04,                                              X01454837
               COLOR=BLUE,                                             X01454937
               POS=(12,21)                                              01455037
AONPO08 DFHMDF ATTRB=ASKIP,                                            X01455137
               LENGTH=01,                                              X01455237
               COLOR=BLUE,                                             X01455337
               POS=(12,26)                                              01455437
ACTY08  DFHMDF ATTRB=ASKIP,                                            X01455537
               LENGTH=15,                                              X01455637
               COLOR=BLUE,                                             X01455737
               POS=(12,29)                                              01455837
ASTAT08 DFHMDF ATTRB=ASKIP,                                            X01455937
               LENGTH=02,                                              X01456037
               COLOR=BLUE,                                             X01456137
               POS=(12,45)                                              01456237
ATRIP08 DFHMDF ATTRB=ASKIP,                                            X01456337
               LENGTH=01,                                              X01456437
               COLOR=BLUE,                                             X01456537
               POS=(12,49)                                              01456637
APORT08 DFHMDF ATTRB=ASKIP,                                            X01456737
               LENGTH=20,                                              X01456837
               COLOR=BLUE,                                             X01456937
               POS=(12,53)                                              01457037
AIATA08 DFHMDF ATTRB=ASKIP,                                            X01457137
               LENGTH=03,                                              X01457237
               COLOR=BLUE,                                             X01457337
               POS=(12,75)                                              01457437
*                                                                       01460701
ASEL09  DFHMDF POS=(13,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01460807
               HILIGHT=UNDERLINE,                                      C01460901
               COLOR=GREEN                                              01461001
        DFHMDF POS=(13,05),LENGTH=01,ATTRB=(ASKIP)                      01461123
AACT09  DFHMDF POS=(13,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01461223
               COLOR=BLUE                                               01461301
APOE09  DFHMDF ATTRB=ASKIP,                                            X01461401
               LENGTH=03,                                              X01461501
               COLOR=BLUE,                                             X01461601
               POS=(13,11)                                              01461723
ADCNS09 DFHMDF ATTRB=ASKIP,                                            X01461837
               LENGTH=04,                                              X01461937
               COLOR=BLUE,                                             X01462037
               POS=(13,15)                                              01462137
AEDI09  DFHMDF ATTRB=ASKIP,                                            X01462237
               LENGTH=04,                                              X01462337
               COLOR=BLUE,                                             X01462437
               POS=(13,21)                                              01462537
AONPO09 DFHMDF ATTRB=ASKIP,                                            X01462637
               LENGTH=01,                                              X01462737
               COLOR=BLUE,                                             X01462837
               POS=(13,26)                                              01462937
ACTY09  DFHMDF ATTRB=ASKIP,                                            X01463037
               LENGTH=15,                                              X01463137
               COLOR=BLUE,                                             X01463237
               POS=(13,29)                                              01463337
ASTAT09 DFHMDF ATTRB=ASKIP,                                            X01463437
               LENGTH=02,                                              X01463537
               COLOR=BLUE,                                             X01463637
               POS=(13,45)                                              01463737
ATRIP09 DFHMDF ATTRB=ASKIP,                                            X01463837
               LENGTH=01,                                              X01463937
               COLOR=BLUE,                                             X01464037
               POS=(13,49)                                              01464137
APORT09 DFHMDF ATTRB=ASKIP,                                            X01464237
               LENGTH=20,                                              X01464337
               COLOR=BLUE,                                             X01464437
               POS=(13,53)                                              01464537
AIATA09 DFHMDF ATTRB=ASKIP,                                            X01464637
               LENGTH=03,                                              X01464737
               COLOR=BLUE,                                             X01464837
               POS=(13,75)                                              01464937
*                                                                       01590001
ASEL10  DFHMDF POS=(14,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01600007
               HILIGHT=UNDERLINE,                                      C01610001
               COLOR=GREEN                                              01620001
        DFHMDF POS=(14,05),LENGTH=01,ATTRB=(ASKIP)                      01630023
AACT10  DFHMDF POS=(14,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01640023
               COLOR=BLUE                                               01650001
APOE10  DFHMDF ATTRB=ASKIP,                                            X01660001
               LENGTH=03,                                              X01670001
               COLOR=BLUE,                                             X01680001
               POS=(14,11)                                              01690023
ADCNS10 DFHMDF ATTRB=ASKIP,                                            X01690137
               LENGTH=04,                                              X01690237
               COLOR=BLUE,                                             X01690337
               POS=(14,15)                                              01690437
AEDI10  DFHMDF ATTRB=ASKIP,                                            X01690537
               LENGTH=04,                                              X01690637
               COLOR=BLUE,                                             X01690737
               POS=(14,21)                                              01690837
AONPO10 DFHMDF ATTRB=ASKIP,                                            X01690937
               LENGTH=01,                                              X01691037
               COLOR=BLUE,                                             X01691137
               POS=(14,26)                                              01691237
ACTY10  DFHMDF ATTRB=ASKIP,                                            X01691337
               LENGTH=15,                                              X01691437
               COLOR=BLUE,                                             X01691537
               POS=(14,29)                                              01691637
ASTAT10 DFHMDF ATTRB=ASKIP,                                            X01691737
               LENGTH=02,                                              X01691837
               COLOR=BLUE,                                             X01691937
               POS=(14,45)                                              01692037
ATRIP10 DFHMDF ATTRB=ASKIP,                                            X01692137
               LENGTH=01,                                              X01692237
               COLOR=BLUE,                                             X01692337
               POS=(14,49)                                              01692437
APORT10 DFHMDF ATTRB=ASKIP,                                            X01692537
               LENGTH=20,                                              X01692637
               COLOR=BLUE,                                             X01692737
               POS=(14,53)                                              01692837
AIATA10 DFHMDF ATTRB=ASKIP,                                            X01692937
               LENGTH=03,                                              X01693037
               COLOR=BLUE,                                             X01693137
               POS=(14,75)                                              01693237
*                                                                       01900001
ASEL11  DFHMDF POS=(15,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01902007
               HILIGHT=UNDERLINE,                                      C01903001
               COLOR=GREEN                                              01904001
        DFHMDF POS=(15,05),LENGTH=01,ATTRB=(ASKIP)                      01905023
AACT11  DFHMDF POS=(15,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01906023
               COLOR=BLUE                                               01907001
APOE11  DFHMDF ATTRB=ASKIP,                                            X01908001
               LENGTH=03,                                              X01909001
               COLOR=BLUE,                                             X01909101
               POS=(15,11)                                              01909223
ADCNS11 DFHMDF ATTRB=ASKIP,                                            X01909337
               LENGTH=04,                                              X01909437
               COLOR=BLUE,                                             X01909537
               POS=(15,15)                                              01909637
AEDI11  DFHMDF ATTRB=ASKIP,                                            X01909737
               LENGTH=04,                                              X01909837
               COLOR=BLUE,                                             X01909937
               POS=(15,21)                                              01910037
AONPO11 DFHMDF ATTRB=ASKIP,                                            X01910137
               LENGTH=01,                                              X01910237
               COLOR=BLUE,                                             X01910337
               POS=(15,26)                                              01910437
ACTY11  DFHMDF ATTRB=ASKIP,                                            X01910537
               LENGTH=15,                                              X01910637
               COLOR=BLUE,                                             X01910737
               POS=(15,29)                                              01910837
ASTAT11 DFHMDF ATTRB=ASKIP,                                            X01910937
               LENGTH=02,                                              X01911037
               COLOR=BLUE,                                             X01911137
               POS=(15,45)                                              01911237
ATRIP11 DFHMDF ATTRB=ASKIP,                                            X01911337
               LENGTH=01,                                              X01911437
               COLOR=BLUE,                                             X01911537
               POS=(15,49)                                              01911637
APORT11 DFHMDF ATTRB=ASKIP,                                            X01911737
               LENGTH=20,                                              X01911837
               COLOR=BLUE,                                             X01911937
               POS=(15,53)                                              01912037
AIATA11 DFHMDF ATTRB=ASKIP,                                            X01912137
               LENGTH=03,                                              X01912237
               COLOR=BLUE,                                             X01912337
               POS=(15,75)                                              01912437
*                                                                       01915701
ASEL12  DFHMDF POS=(16,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01915807
               HILIGHT=UNDERLINE,                                      C01915901
               COLOR=GREEN                                              01916001
        DFHMDF POS=(16,05),LENGTH=01,ATTRB=(ASKIP)                      01916123
AACT12  DFHMDF POS=(16,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01916223
               COLOR=BLUE                                               01916301
APOE12  DFHMDF ATTRB=ASKIP,                                            X01916401
               LENGTH=03,                                              X01916501
               COLOR=BLUE,                                             X01916601
               POS=(16,11)                                              01916723
ADCNS12 DFHMDF ATTRB=ASKIP,                                            X01916837
               LENGTH=04,                                              X01916937
               COLOR=BLUE,                                             X01917037
               POS=(16,15)                                              01917137
AEDI12  DFHMDF ATTRB=ASKIP,                                            X01917237
               LENGTH=04,                                              X01917337
               COLOR=BLUE,                                             X01917437
               POS=(16,21)                                              01917537
AONPO12 DFHMDF ATTRB=ASKIP,                                            X01917637
               LENGTH=01,                                              X01917737
               COLOR=BLUE,                                             X01917837
               POS=(16,26)                                              01917937
ACTY12  DFHMDF ATTRB=ASKIP,                                            X01918037
               LENGTH=15,                                              X01918137
               COLOR=BLUE,                                             X01918237
               POS=(16,29)                                              01918337
ASTAT12 DFHMDF ATTRB=ASKIP,                                            X01918437
               LENGTH=02,                                              X01918537
               COLOR=BLUE,                                             X01918637
               POS=(16,45)                                              01918737
ATRIP12 DFHMDF ATTRB=ASKIP,                                            X01918837
               LENGTH=01,                                              X01918937
               COLOR=BLUE,                                             X01919037
               POS=(16,49)                                              01919137
APORT12 DFHMDF ATTRB=ASKIP,                                            X01919237
               LENGTH=20,                                              X01919337
               COLOR=BLUE,                                             X01919437
               POS=(16,53)                                              01919537
AIATA12 DFHMDF ATTRB=ASKIP,                                            X01919637
               LENGTH=03,                                              X01919737
               COLOR=BLUE,                                             X01919837
               POS=(16,75)                                              01919937
*                                                                       01923201
ASEL13  DFHMDF POS=(17,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C01923307
               HILIGHT=UNDERLINE,                                      C01923403
               COLOR=GREEN                                              01924003
        DFHMDF POS=(17,05),LENGTH=01,ATTRB=(ASKIP)                      01925023
AACT13  DFHMDF POS=(17,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C01926023
               COLOR=BLUE                                               01927003
APOE13  DFHMDF ATTRB=ASKIP,                                            X01928003
               LENGTH=03,                                              X01929003
               COLOR=BLUE,                                             X01930003
               POS=(17,11)                                              01940023
ADCNS13 DFHMDF ATTRB=ASKIP,                                            X01940137
               LENGTH=04,                                              X01940237
               COLOR=BLUE,                                             X01940337
               POS=(17,15)                                              01940437
AEDI13  DFHMDF ATTRB=ASKIP,                                            X01940537
               LENGTH=04,                                              X01940637
               COLOR=BLUE,                                             X01940737
               POS=(17,21)                                              01940837
AONPO13 DFHMDF ATTRB=ASKIP,                                            X01940937
               LENGTH=01,                                              X01941037
               COLOR=BLUE,                                             X01941137
               POS=(17,26)                                              01941237
ACTY13  DFHMDF ATTRB=ASKIP,                                            X01941337
               LENGTH=15,                                              X01941437
               COLOR=BLUE,                                             X01941537
               POS=(17,29)                                              01941637
ASTAT13 DFHMDF ATTRB=ASKIP,                                            X01941737
               LENGTH=02,                                              X01941837
               COLOR=BLUE,                                             X01941937
               POS=(17,45)                                              01942037
ATRIP13 DFHMDF ATTRB=ASKIP,                                            X01942137
               LENGTH=01,                                              X01942237
               COLOR=BLUE,                                             X01942337
               POS=(17,49)                                              01942437
APORT13 DFHMDF ATTRB=ASKIP,                                            X01942537
               LENGTH=20,                                              X01942637
               COLOR=BLUE,                                             X01942737
               POS=(17,53)                                              01942837
AIATA13 DFHMDF ATTRB=ASKIP,                                            X01942937
               LENGTH=03,                                              X01943037
               COLOR=BLUE,                                             X01943137
               POS=(17,75)                                              01943237
*                                                                       02150003
ASEL14  DFHMDF POS=(18,03),LENGTH=01,ATTRB=(UNPROT,NORM),              C02170007
               HILIGHT=UNDERLINE,                                      C02180003
               COLOR=GREEN                                              02190003
        DFHMDF POS=(18,05),LENGTH=01,ATTRB=(ASKIP)                      02200023
AACT14  DFHMDF POS=(18,07),LENGTH=03,ATTRB=(ASKIP,NORM),               C02210023
               COLOR=BLUE                                               02220003
APOE14  DFHMDF ATTRB=ASKIP,                                            X02230003
               LENGTH=03,                                              X02240003
               COLOR=BLUE,                                             X02250003
               POS=(18,11)                                              02260023
ADCNS14 DFHMDF ATTRB=ASKIP,                                            X02260137
               LENGTH=04,                                              X02260237
               COLOR=BLUE,                                             X02260337
               POS=(18,15)                                              02260437
AEDI14  DFHMDF ATTRB=ASKIP,                                            X02260537
               LENGTH=04,                                              X02260637
               COLOR=BLUE,                                             X02260737
               POS=(18,21)                                              02260837
AONPO14 DFHMDF ATTRB=ASKIP,                                            X02260937
               LENGTH=01,                                              X02261037
               COLOR=BLUE,                                             X02261137
               POS=(18,26)                                              02261237
ACTY14  DFHMDF ATTRB=ASKIP,                                            X02261337
               LENGTH=15,                                              X02261437
               COLOR=BLUE,                                             X02261537
               POS=(18,29)                                              02261637
ASTAT14 DFHMDF ATTRB=ASKIP,                                            X02261737
               LENGTH=02,                                              X02261837
               COLOR=BLUE,                                             X02261937
               POS=(18,45)                                              02262037
ATRIP14 DFHMDF ATTRB=ASKIP,                                            X02262137
               LENGTH=01,                                              X02262237
               COLOR=BLUE,                                             X02262337
               POS=(18,49)                                              02262437
APORT14 DFHMDF ATTRB=ASKIP,                                            X02262537
               LENGTH=20,                                              X02262637
               COLOR=BLUE,                                             X02262737
               POS=(18,53)                                              02262837
AIATA14 DFHMDF ATTRB=ASKIP,                                            X02262937
               LENGTH=03,                                              X02263037
               COLOR=BLUE,                                             X02263137
               POS=(18,75)                                              02263237
*                                                                       02470003
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C05960000
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        05970000
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C05980000
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              05990000
*                                                                       06000000
         DFHMSD TYPE=FINAL                                              06010000
*                                                                       06020000
         END                                                            06030000
