*          DATA SET TRKM125    AT LEVEL 041 AS OF 06/02/95                      
*          DATA SET TRKM125    AT LEVEL 014 AS OF 03/17/94              00001   
*          DATA SET TRKM125    AT LEVEL 001 AS OF 01/14/94              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  TRKM125                                            *   00006   
*        MAP     TR125A                                             *   00007   
*        PROGRAM TRKCS125                                           *   00008   
*        TRANSID Y125                                               *   00009   
*        SYSTEM  CICS ARCHITECTURE - MAINTAIN TRAILER               *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
TRKM125 DFHMSD TYPE=DSECT,                                             X00013   
               LANG=COBOL,                                             X00014   
               MODE=INOUT,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
TR125A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               CTRL=(FREEKB),                                          X00021   
               MAPATTS=(COLOR,HILIGHT),                                X00022   
               DSATTS=(COLOR,HILIGHT)                                   00023   
*                                                                       00024   
*  OPER ID AND FACILITY NAME                                            00025**6
*                                                                       00026**6
        DFHMDF POS=(03,03),                                            X00027**4
               ATTRB=(ASKIP,BRT),                                      X00028**2
               INITIAL='OP ID:',                                       X00029*15
               LENGTH=06                                                00030*15
AOPER   DFHMDF ATTRB=(UNPROT,NORM),                                    X00031*40
               LENGTH=04,                                              X00032*12
               COLOR=GREEN,                                            X00033*40
               PICOUT='ZZZZ',                                          X00034   
               POS=(03,10)                                              00035*11
AFCLTY  DFHMDF ATTRB=(UNPROT,NORM),                                    X00036*40
               LENGTH=04,                                              X00037*12
               COLOR=GREEN,                                            X00038*40
               PICOUT='ZZZZ',                                          X00039   
               POS=(03,15)                                              00040*11
AFDESC  DFHMDF ATTRB=(ASKIP),                                          X00041   
               COLOR=BLUE,                                             X00042   
               LENGTH=25,                                              X00043   
               POS=(03,25)                                              00044*34
        DFHMDF POS=(03,051),                                           X00045*34
               ATTRB=(ASKIP),                                          X00046**2
               LENGTH=01,                                              X00047*12
               INITIAL=' '                                              00048*11
*                                                                       00066**6
*  'NO DISTRO' MESSAGE'                                                 00067**5
*                                                                       00068**6
ADISTO  DFHMDF POS=(04,043),                                           X00069*34
               ATTRB=(ASKIP),                                          X00070**6
               COLOR=YELLOW,                                           X00071*30
               INITIAL='         ',                                    X00072**6
               LENGTH=009                                               00073*13
        DFHMDF POS=(04,053),                                           X00074*34
               ATTRB=(ASKIP),                                          X00075**5
               LENGTH=001,                                             X00076**5
               INITIAL=' '                                              00077*11
*                                                                       00049**6
*  THE PO NUMBER                                                        00050**5
*                                                                       00051**6
        DFHMDF POS=(05,003),                                           X00052**4
               ATTRB=(ASKIP,BRT),                                      X00053**2
               INITIAL='PO NUMBER.....:',                              X00054*13
               LENGTH=015                                               00055**7
APONBR  DFHMDF ATTRB=(UNPROT,IC),                                      X00056*32
               COLOR=GREEN,                                            X00057**2
               HILIGHT=UNDERLINE,                                      X00058**7
               PICOUT='ZZZZZZZZ',                                      X00059*34
               LENGTH=08,                                              X00060**2
               POS=(05,19)                                              00061**4
        DFHMDF POS=(05,028),                                           X00062**4
               ATTRB=(ASKIP),                                          X00063**2
               LENGTH=001,                                             X00064**2
               INITIAL=' '                                              00065*11
*                                                                       00095**6
*  PO STATUS                                                            00096**6
*                                                                       00097**6
        DFHMDF POS=(05,043),                                           X00098*19
               ATTRB=(ASKIP,BRT),                                      X00099**6
               INITIAL='PO STATUS...........:',                        X00100**6
               LENGTH=021                                               00101*13
APOSTAT DFHMDF ATTRB=(ASKIP),                                          X00102*19
               COLOR=BLUE,                                             X00103*19
               LENGTH=13,                                              X00104*29
               POS=(05,65)                                              00105*19
        DFHMDF POS=(05,079),                                           X00106*29
               ATTRB=(ASKIP),                                          X00107**6
               LENGTH=001,                                             X00108**6
               INITIAL=' '                                              00109*11
*                                                                       00078**6
*   PO CARTON COUNT                                                     00079**6
*                                                                       00080**6
        DFHMDF POS=(06,003),                                           X00081**4
               ATTRB=(ASKIP,BRT),                                      X00082**2
               INITIAL='PO CARTON CNT.:',                              X00083*13
               LENGTH=015                                               00084*13
APOCNT  DFHMDF ATTRB=(UNPROT,NORM),                                    X00085**2
               COLOR=GREEN,                                            X00086**2
               HILIGHT=UNDERLINE,                                      X00087**7
               LENGTH=04,                                              X00088*41
               PICOUT='ZZZZ',                                          X00089*41
               POS=(06,19)                                              00090**4
        DFHMDF POS=(06,24),                                            X00091*41
               ATTRB=(ASKIP),                                          X00092   
               LENGTH=001,                                             X00093   
               INITIAL=' '                                              00094*11
*                                                                       00110*19
*  DO NOT SHIP BEFORE DATE                                              00111*19
*                                                                       00112*19
        DFHMDF POS=(06,043),                                           X00113*19
               ATTRB=(ASKIP,BRT),                                      X00114*19
               INITIAL='DO NOT SHIP BEFORE..:',                        X00115*19
               LENGTH=021                                               00116*19
ABEFDTE DFHMDF ATTRB=(ASKIP),                                          X00117*21
               COLOR=BLUE,                                             X00118*19
               LENGTH=10,                                              X00119*36
               POS=(06,65)                                              00120*19
        DFHMDF POS=(06,076),                                           X00121*36
               ATTRB=(ASKIP),                                          X00122*19
               LENGTH=001,                                             X00123*19
               INITIAL=' '                                              00124*19
*                                                                       00137**8
*  CANCEL DATE                                                          00138*19
*                                                                       00139**8
        DFHMDF POS=(07,043),                                           X00140*19
               ATTRB=(ASKIP,BRT),                                      X00141**8
               INITIAL='CANCEL DATE ........:',                        X00142*19
               LENGTH=021                                               00143*14
ACANDTE DFHMDF ATTRB=(UNPROT,NORM),                                    X00144*21
               COLOR=GREEN,                                            X00145*19
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=10,                                              X00146*36
               POS=(07,65)                                              00147*19
        DFHMDF POS=(07,076),                                           X00148*36
               ATTRB=(ASKIP),                                          X00149**8
               LENGTH=001,                                             X00150**8
               INITIAL=' '                                              00151*11
*                                                                       00125**3
*  F/B NUMBER                                                           00126**7
*                                                                       00127**6
        DFHMDF POS=(08,003),                                           X00128**4
               ATTRB=(ASKIP,BRT),                                      X00129**3
               INITIAL='F/B NO .......:',                              X00130*13
               LENGTH=015                                               00131*13
AFBNBR  DFHMDF ATTRB=(UNPROT,NORM),                                    X00132**3
               COLOR=GREEN,                                            X00133**3
               HILIGHT=UNDERLINE,                                      X00134**7
               LENGTH=22,                                              X00135*23
               POS=(08,19)                                              00136*17
*                                                                       00164*19
*  EXTENDED CANCEL DATE                                                 00165*19
*                                                                       00166*19
        DFHMDF POS=(08,043),                                           X00167*19
               ATTRB=(ASKIP,BRT),                                      X00168*19
               INITIAL='EXTENDED CANCEL DATE:',                        X00169*19
               LENGTH=021                                               00170*19
AEXCDTE DFHMDF ATTRB=(ASKIP),                                          X00171*21
               COLOR=BLUE,                                             X00172*19
               LENGTH=10,                                              X00173*36
               POS=(08,65)                                              00174*19
        DFHMDF POS=(08,076),                                           X00175*36
               ATTRB=(ASKIP),                                          X00176*19
               LENGTH=001,                                             X00177*19
               INITIAL=' '                                              00178*19
*                                                                       00152*10
*  BOL NUMBER                                                           00153*10
*                                                                       00154*10
        DFHMDF POS=(09,003),                                           X00155*10
               ATTRB=(ASKIP,BRT),                                      X00156*10
               INITIAL='BOL NO .......:',                              X00157*15
               LENGTH=015                                               00158*15
ABOLNBR DFHMDF ATTRB=(UNPROT,NORM),                                    X00159*11
               COLOR=GREEN,                                            X00160*10
               HILIGHT=UNDERLINE,                                      X00161*10
               LENGTH=30,                                              X00162*23
               POS=(09,19)                                              00163*17
        DFHMDF POS=(09,50),                                            X00260*39
               ATTRB=(ASKIP),                                          X00261*26
               LENGTH=001,                                             X00262*26
               INITIAL=' '                                              00263*26
*                                                                       00179*20
*  F/B CARTON COUNT                                                     00180*20
*                                                                       00181*20
        DFHMDF POS=(10,003),                                           X00182*20
               ATTRB=(ASKIP,BRT),                                      X00183*20
               INITIAL='F/B CARTON CNT:',                              X00184*20
               LENGTH=015                                               00185*20
AFBCNT  DFHMDF ATTRB=(UNPROT,NORM),                                    X00186*20
               COLOR=GREEN,                                            X00187*20
               HILIGHT=UNDERLINE,                                      X00188*20
               LENGTH=05,                                              X00189*20
               PICOUT='ZZZZZ',                                         X00190*20
               POS=(10,19)                                              00191*20
        DFHMDF POS=(10,25),                                            X00192*20
               ATTRB=(ASKIP),                                          X00193*20
               LENGTH=001,                                             X00194*20
               INITIAL=' '                                              00195*20
*                                                                       00196*21
*  DEPT NO AND DEPT DESCRIPTION                                         00197*21
*                                                                       00198*21
        DFHMDF POS=(10,043),                                           X00199*21
               ATTRB=(ASKIP,BRT),                                      X00200*21
               INITIAL='DEPT NO.:',                                    X00201*22
               LENGTH=009                                               00202*22
ADPTNBR DFHMDF ATTRB=(ASKIP),                                          X00203*21
               COLOR=BLUE,                                             X00204*21
               LENGTH=04,                                              X00205*21
               PICOUT='ZZZ9',                                          X00034   
               POS=(10,53)                                              00206*22
ADPTDSC DFHMDF ATTRB=(ASKIP),                                          X00207*21
               COLOR=BLUE,                                             X00208*21
               LENGTH=21,                                              X00209*24
               POS=(10,58)                                              00210*22
*                                                                       00211*24
*  VENDOR SHIP DATE                                                     00212*24
*                                                                       00213*24
        DFHMDF POS=(11,003),                                           X00214*25
               ATTRB=(ASKIP,BRT),                                      X00215*24
               INITIAL='VEND SHIP DATE:',                              X00216*24
               LENGTH=015                                               00217*24
AVNDMM  DFHMDF ATTRB=(UNPROT,NORM),                                    X00218*24
               COLOR=GREEN,                                            X00219*24
               HILIGHT=UNDERLINE,                                      X00220*24
               LENGTH=02,                                              X00221*24
               POS=(11,19)                                              00222*25
AVNDDD  DFHMDF ATTRB=(UNPROT,NORM),                                    X00223*24
               COLOR=GREEN,                                            X00224*24
               HILIGHT=UNDERLINE,                                      X00225*24
               LENGTH=02,                                              X00226*24
               POS=(11,22)                                              00227*25
AVNDYY  DFHMDF ATTRB=(UNPROT,NORM),                                    X00228*24
               COLOR=GREEN,                                            X00229*24
               HILIGHT=UNDERLINE,                                      X00230*24
               LENGTH=02,                                              X00231*37
               POS=(11,25)                                              00232*25
        DFHMDF POS=(11,28),                                            X00233*38
               ATTRB=(ASKIP),                                          X00234*24
               LENGTH=001,                                             X00235*24
               INITIAL=' '                                              00236*24
*                                                                       00237*24
*  BUYER NAME                                                           00238*24
*                                                                       00239*24
        DFHMDF POS=(11,043),                                           X00240*25
               ATTRB=(ASKIP,BRT),                                      X00241*24
               INITIAL='BUYER NAME:',                                  X00242*24
               LENGTH=011                                               00243*24
ABUYNME DFHMDF ATTRB=(ASKIP),                                          X00244*24
               COLOR=BLUE,                                             X00245*24
               LENGTH=25,                                              X00246*24
               POS=(11,55)                                              00247*25
*                                                                       00248*26
*  AUTH NUMBER                                                          00249*26
*                                                                       00250*26
        DFHMDF POS=(12,003),                                           X00251*26
               ATTRB=(ASKIP,BRT),                                      X00252*26
               INITIAL='AUTH NUMBER...:',                              X00253*26
               LENGTH=015                                               00254*26
AATHNBR DFHMDF ATTRB=(UNPROT,NORM),                                    X00255*26
               COLOR=GREEN,                                            X00256*26
               HILIGHT=UNDERLINE,                                      X00257*26
               LENGTH=07,                                              X00258*26
               POS=(12,19)                                              00259*26
        DFHMDF POS=(12,27),                                            X00260*39
               ATTRB=(ASKIP),                                          X00261*26
               LENGTH=001,                                             X00262*26
               INITIAL=' '                                              00263*26
*                                                                       00264*26
*  AUTH DATE                                                            00265*26
*                                                                       00266*26
        DFHMDF POS=(13,003),                                           X00267*26
               ATTRB=(ASKIP,BRT),                                      X00268*26
               INITIAL='AUTH DATE.....:',                              X00269*26
               LENGTH=015                                               00270*26
AATHMM  DFHMDF ATTRB=(UNPROT,NORM),                                    X00271*26
               COLOR=GREEN,                                            X00272*26
               HILIGHT=UNDERLINE,                                      X00273*26
               LENGTH=02,                                              X00274*26
               POS=(13,19)                                              00275*26
AATHDD  DFHMDF ATTRB=(UNPROT,NORM),                                    X00276*26
               COLOR=GREEN,                                            X00277*26
               HILIGHT=UNDERLINE,                                      X00278*26
               LENGTH=02,                                              X00279*26
               POS=(13,22)                                              00280*26
AATHYY  DFHMDF ATTRB=(UNPROT,NORM),                                    X00281*26
               COLOR=GREEN,                                            X00282*26
               HILIGHT=UNDERLINE,                                      X00283*26
               LENGTH=02,                                              X00284*37
               POS=(13,25)                                              00285*26
        DFHMDF POS=(13,28),                                            X00286*38
               ATTRB=(ASKIP),                                          X00287*26
               LENGTH=001,                                             X00288*26
               INITIAL=' '                                              00289*26
*                                                                       00290*26
*  ORIGIN SCAC AND LONG DESCRIPTION                                     00291*26
*                                                                       00292*26
        DFHMDF POS=(14,003),                                           X00293*26
               ATTRB=(ASKIP,BRT),                                      X00294*26
               INITIAL='ORIGIN SCAC...:',                              X00295*26
               LENGTH=015                                               00296*26
AOSCAC  DFHMDF ATTRB=(UNPROT,NORM),                                    X00297*26
               COLOR=GREEN,                                            X00298*26
               HILIGHT=UNDERLINE,                                      X00299*26
               LENGTH=04,                                              X00300*26
               POS=(14,19)                                              00301*26
AOSCDSC DFHMDF ATTRB=(ASKIP),                                          X00302*28
               COLOR=BLUE,                                             X00303*28
               LENGTH=30,                                              X00304*26
               POS=(14,24)                                              00305*26
        DFHMDF POS=(14,55),                                            X00306*26
               ATTRB=(ASKIP),                                          X00307*26
               LENGTH=001,                                             X00308*26
               INITIAL=' '                                              00309*26
*                                                                       00310*26
*  DELIVERY SCAC AND LONG DESCRIPTION                                   00311*26
*                                                                       00312*26
        DFHMDF POS=(15,003),                                           X00313*27
               ATTRB=(ASKIP,BRT),                                      X00314*26
               INITIAL='DELIVERY SCAC.:',                              X00315*26
               LENGTH=015                                               00316*26
ADSCAC  DFHMDF ATTRB=(UNPROT,NORM),                                    X00317*26
               COLOR=GREEN,                                            X00318*26
               HILIGHT=UNDERLINE,                                      X00319*26
               LENGTH=04,                                              X00320*26
               POS=(15,19)                                              00321*27
ADSCDSC DFHMDF ATTRB=(ASKIP),                                          X00322*28
               COLOR=BLUE,                                             X00323*28
               LENGTH=30,                                              X00324*26
               POS=(15,24)                                              00325*27
        DFHMDF POS=(17,55),                                            X00326*27
               ATTRB=(ASKIP),                                          X00327*26
               LENGTH=001,                                             X00328*26
               INITIAL=' '                                              00329*26
*                                                                       00330*27
*  TRAILER NUMBER                                                       00331*27
*                                                                       00332*27
        DFHMDF POS=(16,003),                                           X00333*27
               ATTRB=(ASKIP,BRT),                                      X00334*27
               INITIAL='TRAILER NO....:',                              X00335*27
               LENGTH=015                                               00336*27
ATRLRNO DFHMDF ATTRB=(UNPROT,NORM),                                    X00337*27
               COLOR=GREEN,                                            X00338*27
               HILIGHT=UNDERLINE,                                      X00339*27
               LENGTH=10,                                              X00340*27
               POS=(16,19)                                              00341*27
        DFHMDF POS=(16,30),                                            X00342*27
               ATTRB=(ASKIP),                                          X00343*27
               LENGTH=001,                                             X00344*27
               INITIAL=' '                                              00345*27
*                                                                       00330*27
*  CARR AUTH ID (CAN)                                                   00331*27
*                                                                       00332*27
        DFHMDF POS=(17,003),                                           X00333*27
               ATTRB=(ASKIP,BRT),                                      X00334*27
               INITIAL='CAN...........:',                              X00335*27
               LENGTH=015                                               00336*27
ACAN    DFHMDF ATTRB=(UNPROT,NORM),                                    X00337*27
               COLOR=GREEN,                                            X00338*27
               HILIGHT=UNDERLINE,                                      X00339*27
               LENGTH=30,                                              X00340*27
               POS=(17,19)                                              00341*27
        DFHMDF POS=(17,50),                                            X00342*27
               ATTRB=(ASKIP),                                          X00343*27
               LENGTH=001,                                             X00344*27
               INITIAL=' '                                              00345*27
*                                                                       00346*27
*  ETA DATE                                                             00347*27
*                                                                       00348*27
        DFHMDF POS=(18,003),                                           X00349*27
               ATTRB=(ASKIP,BRT),                                      X00350*27
               INITIAL='ETA DATE......:',                              X00351*27
               LENGTH=015                                               00352*27
AETAMM  DFHMDF ATTRB=(UNPROT,NORM),                                    X00353*27
               COLOR=GREEN,                                            X00354*27
               HILIGHT=UNDERLINE,                                      X00355*27
               LENGTH=02,                                              X00356*27
               POS=(18,19)                                              00357*27
AETADD  DFHMDF ATTRB=(UNPROT,NORM),                                    X00358*27
               COLOR=GREEN,                                            X00359*27
               HILIGHT=UNDERLINE,                                      X00360*27
               LENGTH=02,                                              X00361*27
               POS=(18,22)                                              00362*27
AETAYY  DFHMDF ATTRB=(UNPROT,NORM),                                    X00363*36
               COLOR=GREEN,                                            X00364*27
               HILIGHT=UNDERLINE,                                      X00365*27
               LENGTH=02,                                              X00366*37
               POS=(18,25)                                              00367*27
        DFHMDF POS=(18,28),                                            X00368*38
               ATTRB=(ASKIP),                                          X00369*27
               LENGTH=001,                                             X00370*27
               INITIAL=' '                                              00371*27
*                                                                       00372*27
*  ETA TIME                                                             00373*27
*                                                                       00374*27
        DFHMDF POS=(19,003),                                           X00375*27
               ATTRB=(ASKIP,BRT),                                      X00376*27
               INITIAL='ETA TIME......:',                              X00377*35
               LENGTH=015                                               00378*27
AETAHH  DFHMDF ATTRB=(UNPROT,NORM),                                    X00379*27
               COLOR=GREEN,                                            X00380*27
               HILIGHT=UNDERLINE,                                      X00381*27
               LENGTH=02,                                              X00382*27
               POS=(19,19)                                              00383*27
AETAMN  DFHMDF ATTRB=(UNPROT,NORM),                                    X00384*27
               COLOR=GREEN,                                            X00385*27
               HILIGHT=UNDERLINE,                                      X00386*27
               LENGTH=02,                                              X00387*27
               POS=(19,22)                                              00388*27
        DFHMDF POS=(19,25),                                            X00389*27
               ATTRB=(ASKIP),                                          X00390*27
               LENGTH=001,                                             X00391*27
               INITIAL=' '                                              00392*27
         DFHMSD TYPE=FINAL                                              00393   
         END                                                            00394   
