*          DATA SET TRKM187                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM187                                            *   00004   
*        MAP     TR187A                                             *   00005   
*        PROGRAM TRKCS187                                           *   00006   
*        TRANSID Y187                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM187 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR187A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CONTAINER NO:',                                X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=13,                                              X00042   
               POS=(02,01)                                              00043   
ACNTRNO DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               POS=(02,15)                                              00047   
        DFHMDF POS=(02,28),LENGTH=01,ATTRB=(PROT)                       00082   
*                                                                       00043   
        DFHMDF POS=(04,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(04,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(04,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(04,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(04,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(04,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00043   
        DFHMDF POS=(05,01),LENGTH=01,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S'                                              00061   
        DFHMDF POS=(05,03),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ACT'                                            00064   
        DFHMDF POS=(05,07),LENGTH=11,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='VESSEL NAME',                                   00061   
        DFHMDF POS=(05,33),LENGTH=02,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='TR'                                             00061   
        DFHMDF POS=(05,36),LENGTH=09,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='VOYAGE NO'                                      00064   
        DFHMDF POS=(05,47),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SCAC'                                           00067   
        DFHMDF POS=(05,54),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='ATD',                                           00061   
        DFHMDF POS=(05,63),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ETA'                                            00064   
        DFHMDF POS=(05,72),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ATA'                                            00067   
*                                                                               
ASEL01  DFHMDF POS=(06,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT01  DFHMDF POS=(06,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM01 DFHMDF POS=(06,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP01 DFHMDF POS=(06,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO01 DFHMDF POS=(06,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC01 DFHMDF POS=(06,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD01  DFHMDF POS=(06,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA01  DFHMDF POS=(06,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA01  DFHMDF POS=(06,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL02  DFHMDF POS=(07,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT02  DFHMDF POS=(07,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM02 DFHMDF POS=(07,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP02 DFHMDF POS=(07,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO02 DFHMDF POS=(07,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC02 DFHMDF POS=(07,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD02  DFHMDF POS=(07,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA02  DFHMDF POS=(07,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA02  DFHMDF POS=(07,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL03  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT03  DFHMDF POS=(08,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM03 DFHMDF POS=(08,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP03 DFHMDF POS=(08,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO03 DFHMDF POS=(08,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC03 DFHMDF POS=(08,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD03  DFHMDF POS=(08,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA03  DFHMDF POS=(08,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA03  DFHMDF POS=(08,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL04  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT04  DFHMDF POS=(09,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM04 DFHMDF POS=(09,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP04 DFHMDF POS=(09,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO04 DFHMDF POS=(09,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC04 DFHMDF POS=(09,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD04  DFHMDF POS=(09,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA04  DFHMDF POS=(09,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA04  DFHMDF POS=(09,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL05  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT05  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM05 DFHMDF POS=(10,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP05 DFHMDF POS=(10,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO05 DFHMDF POS=(10,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC05 DFHMDF POS=(10,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD05  DFHMDF POS=(10,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA05  DFHMDF POS=(10,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA05  DFHMDF POS=(10,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL06  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT06  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM06 DFHMDF POS=(11,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP06 DFHMDF POS=(11,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO06 DFHMDF POS=(11,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC06 DFHMDF POS=(11,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD06  DFHMDF POS=(11,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA06  DFHMDF POS=(11,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA06  DFHMDF POS=(11,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL07  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT07  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM07 DFHMDF POS=(12,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP07 DFHMDF POS=(12,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO07 DFHMDF POS=(12,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC07 DFHMDF POS=(12,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD07  DFHMDF POS=(12,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA07  DFHMDF POS=(12,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA07  DFHMDF POS=(12,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL08  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT08  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM08 DFHMDF POS=(13,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP08 DFHMDF POS=(13,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO08 DFHMDF POS=(13,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC08 DFHMDF POS=(13,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD08  DFHMDF POS=(13,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA08  DFHMDF POS=(13,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA08  DFHMDF POS=(13,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL09  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT09  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM09 DFHMDF POS=(14,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP09 DFHMDF POS=(14,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO09 DFHMDF POS=(14,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC09 DFHMDF POS=(14,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD09  DFHMDF POS=(14,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA09  DFHMDF POS=(14,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA09  DFHMDF POS=(14,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL10  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT10  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM10 DFHMDF POS=(15,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP10 DFHMDF POS=(15,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO10 DFHMDF POS=(15,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC10 DFHMDF POS=(15,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD10  DFHMDF POS=(15,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA10  DFHMDF POS=(15,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA10  DFHMDF POS=(15,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL11  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT11  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM11 DFHMDF POS=(16,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP11 DFHMDF POS=(16,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO11 DFHMDF POS=(16,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC11 DFHMDF POS=(16,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD11  DFHMDF POS=(16,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA11  DFHMDF POS=(16,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA11  DFHMDF POS=(16,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
ASEL12  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT12  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVSNM12 DFHMDF POS=(17,07),LENGTH=25,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ATRIP12 DFHMDF POS=(17,33),LENGTH=01,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AVYNO12 DFHMDF POS=(17,36),LENGTH=10,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
ASCAC12 DFHMDF POS=(17,47),LENGTH=04,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
AATD12  DFHMDF POS=(17,52),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AETA12  DFHMDF POS=(17,61),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
AATA12  DFHMDF POS=(17,70),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00095   
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
