*          DATA SET TRKM149    AT LEVEL 001 AS OF 06/12/97              00003   
        PRINT  NOGEN                                                    00004   
TRKM149 DFHMSD TYPE=DSECT,                                             C00005   
               LANG=COBOL,                                             C00006   
               MODE=INOUT,                                             C00007   
               STORAGE=AUTO,                                           C00008   
               TERM=3270-2,                                            C00009   
               TIOAPFX=YES                                              00010   
**************                                                          00011   
TR149A  DFHMDI LINE=2,COLUMN=1,                                        C00012   
               SIZE=(19,80),                                           C00013   
               CTRL=(FREEKB),                                          C00014   
               MAPATTS=(COLOR,HILIGHT),                                C00015   
               DSATTS=(COLOR,HILIGHT)                                   00016   
**************                                                          00017   
        DFHMDF POS=(02,13),LENGTH=07,ATTRB=(PROT,NORM),                C00018   
               COLOR=NEUTRAL,                                          C00019   
               INITIAL='COUNTRY'                                        00020   
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00028   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00029   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00030   
               COLOR=GREEN,                                            C00031   
               HILIGHT=UNDERLINE,                                      C00032   
               PICOUT='ZZZZ9'                                           00033   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00034   
               COLOR=NEUTRAL,                                          C00035   
               INITIAL='TO'                                             00036   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00037   
               COLOR=BLUE,                                             C00038   
               PICOUT='ZZZZ9'                                           00039   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00040   
               COLOR=NEUTRAL,                                          C00041   
               INITIAL='OF'                                             00042   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00043   
               COLOR=BLUE,                                             C00044   
               PICOUT='ZZZZ9'                                           00045   
*                                                                       00046   
        DFHMDF POS=(03,03),LENGTH=03,ATTRB=(PROT,NORM),                C00070   
               COLOR=NEUTRAL,                                          C00071   
               INITIAL='SEL'                                            00072   
        DFHMDF POS=(03,08),LENGTH=03,ATTRB=(PROT,NORM),                C00073   
               COLOR=NEUTRAL,                                          C00074   
               INITIAL='ACT'                                            00075   
        DFHMDF POS=(03,14),LENGTH=04,ATTRB=(PROT,NORM),                C00076   
               COLOR=NEUTRAL,                                          C00077   
               INITIAL='CODE'                                           00078   
        DFHMDF POS=(03,36),LENGTH=12,ATTRB=(PROT,NORM),                C00079   
               COLOR=NEUTRAL,                                          C00080   
               INITIAL='COUNTRY NAME'                                   00081   
*                                                                       00094   
ASEL01  DFHMDF POS=(04,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(04,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT01  DFHMDF POS=(04,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD01 DFHMDF POS=(04,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM01 DFHMDF POS=(04,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL02  DFHMDF POS=(05,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(05,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT02  DFHMDF POS=(05,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD02 DFHMDF POS=(05,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM02 DFHMDF POS=(05,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL03  DFHMDF POS=(06,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(06,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT03  DFHMDF POS=(06,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD03 DFHMDF POS=(06,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM03 DFHMDF POS=(06,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL04  DFHMDF POS=(07,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(07,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT04  DFHMDF POS=(07,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD04 DFHMDF POS=(07,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM04 DFHMDF POS=(07,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL05  DFHMDF POS=(08,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(08,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT05  DFHMDF POS=(08,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD05 DFHMDF POS=(08,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM05 DFHMDF POS=(08,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL06  DFHMDF POS=(09,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(09,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT06  DFHMDF POS=(09,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD06 DFHMDF POS=(09,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM06 DFHMDF POS=(09,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL07  DFHMDF POS=(10,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(10,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT07  DFHMDF POS=(10,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD07 DFHMDF POS=(10,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM07 DFHMDF POS=(10,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL08  DFHMDF POS=(11,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(11,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT08  DFHMDF POS=(11,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD08 DFHMDF POS=(11,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM08 DFHMDF POS=(11,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL09  DFHMDF POS=(12,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(12,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT09  DFHMDF POS=(12,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD09 DFHMDF POS=(12,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM09 DFHMDF POS=(12,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL10  DFHMDF POS=(13,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(13,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT10  DFHMDF POS=(13,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD10 DFHMDF POS=(13,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM10 DFHMDF POS=(13,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL11  DFHMDF POS=(14,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(14,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT11  DFHMDF POS=(14,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD11 DFHMDF POS=(14,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM11 DFHMDF POS=(14,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL12  DFHMDF POS=(15,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(15,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT12  DFHMDF POS=(15,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD12 DFHMDF POS=(15,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM12 DFHMDF POS=(15,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL13  DFHMDF POS=(16,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(16,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT13  DFHMDF POS=(16,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD13 DFHMDF POS=(16,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM13 DFHMDF POS=(16,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00113   
ASEL14  DFHMDF POS=(17,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(17,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT14  DFHMDF POS=(17,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD14 DFHMDF POS=(17,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM14 DFHMDF POS=(17,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00341   
ASEL15  DFHMDF POS=(18,04),LENGTH=01,ATTRB=(UNPROT,NORM),              C00095   
               HILIGHT=UNDERLINE,                                      C00096   
               COLOR=GREEN                                              00097   
        DFHMDF POS=(18,06),LENGTH=01,ATTRB=(ASKIP)                      00098   
AACT15  DFHMDF POS=(18,08),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNCD15 DFHMDF POS=(18,15),LENGTH=03,ATTRB=(ASKIP,NORM),               C00099   
               COLOR=BLUE                                               00100   
ACNNM15 DFHMDF POS=(18,23),LENGTH=40,ATTRB=(ASKIP,NORM),               C00101   
               COLOR=BLUE                                               00102   
*                                                                       00341   
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00342   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00343   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00344   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00345   
**************                                                          00346   
        DFHMSD TYPE=FINAL                                               00347   
**************                                                          00348   
        END                                                             00349   
