*          DATA SET TRKM188                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM188                                            *   00004   
*        MAP     TR188A                                             *   00005   
*        PROGRAM TRKCS188                                           *   00006   
*        TRANSID Y188                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM188 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR188A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CONT:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,01)                                              00043   
ACNTRNO DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               POS=(02,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VOY:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(02,22)                                              00043   
AVYNO   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(02,27)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='KGS.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,45)                                              00043   
AKGS    DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(02,51)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CTN.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,61)                                              00043   
ACTN    DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(02,70)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VSL.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,01)                                              00043   
AVSNM   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=25,                                              X00046   
               POS=(03,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='SIZE:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,33)                                              00043   
ASIZE   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               POS=(03,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TYPE:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,45)                                              00043   
ASHPTYP DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(03,51)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='UNT.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,61)                                              00043   
AUNITS  DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(03,70)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ATD.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(04,01)                                              00043   
AATD    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ATA:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(04,17)                                              00043   
AATA    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,22)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(04,33)                                              00043   
AFOB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(04,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CARR SCAC:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(04,45)                                              00043   
ACRSCAC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               POS=(04,56)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CBM.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(04,61)                                              00043   
ACBM    DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               PICOUT='ZZZZZZZZZ.ZZ',                                  X        
               POS=(04,67)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ETA.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,01)                                              00043   
AETA    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ELD:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(05,17)                                              00043   
AELD    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,22)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,33)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(05,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CNSL SCAC:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(05,45)                                              00043   
ACNSCAC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               POS=(05,56)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POL.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,61)                                              00043   
AMPOL   DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=3,                                               X00046   
               POS=(05,76)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LBD.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(06,01)                                              00043   
ALBDNM  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=18,                                              X00046   
               POS=(06,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TRN CNT.:',                                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=09,                                              X00042   
               POS=(06,29)                                              00043   
ATRNCNT DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               PICOUT='ZZZZ',                                          X        
               POS=(06,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LAST TRN:',                                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=09,                                              X00042   
               POS=(06,45)                                              00043   
ALSTTRN DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               POS=(06,55)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POR.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(06,61)                                              00043   
AMPOR   DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=3,                                               X00046   
               POS=(06,76)                                              00047   
*                                                                               
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(07,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(07,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(07,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(07,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(07,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00043   
        DFHMDF POS=(08,01),LENGTH=01,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S'                                              00061   
        DFHMDF POS=(08,03),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ACT'                                            00064   
        DFHMDF POS=(08,09),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='PO NO'                                          00061   
        DFHMDF POS=(08,18),LENGTH=07,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='DELY DT'                                        00061   
        DFHMDF POS=(08,31),LENGTH=05,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='UNITS'                                          00064   
        DFHMDF POS=(08,40),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='CTN'                                            00064   
        DFHMDF POS=(08,50),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='CBM'                                            00067   
        DFHMDF POS=(08,60),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='KGS'                                            00061   
        DFHMDF POS=(08,66),LENGTH=08,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='DOC DATE'                                       00067   
        DFHMDF POS=(08,76),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='CTRY'                                            00067  
*                                                                               
ASEL01  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT01  DFHMDF POS=(09,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO01 DFHMDF POS=(09,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT01 DFHMDF POS=(09,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT01 DFHMDF POS=(09,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN01 DFHMDF POS=(09,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM01 DFHMDF POS=(09,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS01 DFHMDF POS=(09,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT01 DFHMDF POS=(09,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY01 DFHMDF POS=(09,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL02  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT02  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO02 DFHMDF POS=(10,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT02 DFHMDF POS=(10,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT02 DFHMDF POS=(10,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN02 DFHMDF POS=(10,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM02 DFHMDF POS=(10,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS02 DFHMDF POS=(10,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT02 DFHMDF POS=(10,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY02 DFHMDF POS=(10,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00113   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL03  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT03  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO03 DFHMDF POS=(11,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT03 DFHMDF POS=(11,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT03 DFHMDF POS=(11,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN03 DFHMDF POS=(11,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM03 DFHMDF POS=(11,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS03 DFHMDF POS=(11,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT03 DFHMDF POS=(11,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY03 DFHMDF POS=(11,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL04  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT04  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO04 DFHMDF POS=(12,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT04 DFHMDF POS=(12,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT04 DFHMDF POS=(12,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN04 DFHMDF POS=(12,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM04 DFHMDF POS=(12,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS04 DFHMDF POS=(12,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT04 DFHMDF POS=(12,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY04 DFHMDF POS=(12,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL05  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT05  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO05 DFHMDF POS=(13,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT05 DFHMDF POS=(13,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT05 DFHMDF POS=(13,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN05 DFHMDF POS=(13,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM05 DFHMDF POS=(13,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS05 DFHMDF POS=(13,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT05 DFHMDF POS=(13,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY05 DFHMDF POS=(13,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL06  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT06  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO06 DFHMDF POS=(14,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT06 DFHMDF POS=(14,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT06 DFHMDF POS=(14,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN06 DFHMDF POS=(14,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM06 DFHMDF POS=(14,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS06 DFHMDF POS=(14,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT06 DFHMDF POS=(14,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY06 DFHMDF POS=(14,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL07  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT07  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO07 DFHMDF POS=(15,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT07 DFHMDF POS=(15,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT07 DFHMDF POS=(15,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN07 DFHMDF POS=(15,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM07 DFHMDF POS=(15,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS07 DFHMDF POS=(15,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT07 DFHMDF POS=(15,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY07 DFHMDF POS=(15,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL08  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT08  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO08 DFHMDF POS=(16,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT08 DFHMDF POS=(16,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT08 DFHMDF POS=(16,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN08 DFHMDF POS=(16,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM08 DFHMDF POS=(16,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS08 DFHMDF POS=(16,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT08 DFHMDF POS=(16,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY08 DFHMDF POS=(16,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL09  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
AACT09  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO09 DFHMDF POS=(17,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
APODT09 DFHMDF POS=(17,19),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APUNT09 DFHMDF POS=(17,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00090   
APCTN09 DFHMDF POS=(17,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE,PICOUT='ZZZZZ'                                00090   
APCBM09 DFHMDF POS=(17,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE,PICOUT='ZZZZZ.ZZ'                             00092   
APKGS09 DFHMDF POS=(17,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE,PICOUT='ZZZZZZZZ'                             00094   
ADCDT09 DFHMDF POS=(17,67),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
APCTY09 DFHMDF POS=(17,76),LENGTH=03,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
        DFHMDF POS=(18,21),LENGTH=06,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,INITIAL='TOTAL:'                            00094   
ATOTUNT DFHMDF POS=(18,28),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZZZZ9'                           00094   
ATOTCNT DFHMDF POS=(18,38),LENGTH=05,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZ9'                              00094   
ATOTCBM DFHMDF POS=(18,45),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZ9.99'                           00094   
ATOTKGS DFHMDF POS=(18,55),LENGTH=08,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=YELLOW,PICOUT='ZZZZZZZZ'                           00094   
*                                                                               
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
