*          DATA SET TRKM148    AT LEVEL 005 AS OF 02/05/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM148                                            *   00004   
*        MAP     TR148A                                             *   00005   
*        PROGRAM TRKCS148                                           *   00006   
*        TRANSID Y148 - COUNTRY CODE ADD/UPDATE/DELETE              *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM148 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR148A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
         DFHMDF POS=(05,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=040,                                             X00027   
               INITIAL='ENTER AN EDI STANDARD COUNTRY CODE ONLY.'       00028   
*                                                                       00020   
         DFHMDF POS=(07,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=044,                                             X00027   
               INITIAL='CONTACT INFORMATION SERVICES FOR ASSISTANCE.'   00028   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='COUNTRY CODE:',                                X00022   
               LENGTH=13,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(10,10)                                              00026**2
ACNTCOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(10,24)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(10,28)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='COUNTRY NAME:',                                X00022   
               LENGTH=13,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(12,10)                                              00026**2
ACNTDES DFHMDF ATTRB=(UNPROT,NORM),                                    X00049   
               LENGTH=40,                                              X00050   
               COLOR=GREEN,                                            X00051   
               HILIGHT=UNDERLINE,                                      X00052   
               POS=(12,24)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(12,65)                                              00087**3
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
