  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM175                                            *   00004   
*        MAP     TR175A                                             *   00005   
*        PROGRAM TRKCS175                                           *   00006   
*        TRANSID Y175                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM175 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR175A  DFHMDI LINE=2,                                                 X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
********************************************************************            
*       HEADINGS                                                                
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='ENTRY NUMBER.:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(02,01)                                              00043   
AENTRY  DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               POS=(02,16)                                              00047   
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='TRIP MODE....:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(03,01)                                              00043   
AMOMTRP DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=1,                                               X00046   
               POS=(03,16)                                              00047   
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='ENTRY TYPE...:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(03,32)                                              00043   
AENTYPE DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=30,                                              X00046   
               POS=(03,47)                                              00047   
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='FILED........:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(04,01)                                              00043   
AFILDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(04,16)                                              00047   
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='POE..........:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(04,32)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=3,                                               X00046   
               POS=(04,47)                                              00047   
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='PRE CLEARED..:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(05,01)                                              00043   
AESTCLR DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(05,16)                                              00047   
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='REJECTED.....:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(05,32)                                              00043   
AREJDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(05,47)                                              00047   
AREJDSC DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=22,                                              X00046   
               POS=(05,58)                                              00047   
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='ACT CLEARED..:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(06,01)                                              00043   
AACTCLR DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(06,16)                                              00047   
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='EXAM DECLARED:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(06,32)                                              00043   
AEXMDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(06,47)                                              00047   
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='LIQUIDATED...:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(07,01)                                              00043   
ALIQDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(07,16)                                              00047   
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='LIQ SUSPENDED:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(07,32)                                              00043   
ASUSDTE DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(07,47)                                              00047   
ASUSDSC DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=22,                                              X00046   
               POS=(07,58)                                              00047   
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='BROKER REF NO:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(08,01)                                              00043   
ABKRNUM DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=15,                                              X00046   
               POS=(08,16)                                              00047   
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='BROKER NAME..:',                               X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=14,                                              X00042   
               POS=(08,32)                                              00043   
ABKRNME DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=30,                                              X00046   
               POS=(08,47)                                              00047   
********************************************************************            
********TO/FROM                                                                 
********************************************************************            
        DFHMDF POS=(09,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(09,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(09,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(09,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(09,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(09,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=1,                                               X00042   
               POS=(09,74)                                              00043   
********************************************************************            
********LIST ITEM AREA                                                          
********************************************************************            
        DFHMDF POS=(10,02),LENGTH=05,ATTRB=(ASKIP,DRK),                X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='S ACT'                                          00039   
        DFHMDF POS=(10,13),LENGTH=05,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='PO NO'                                          00039   
        DFHMDF POS=(10,22),LENGTH=16,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='REFERENCE NUMBER'                               00039   
        DFHMDF POS=(10,41),LENGTH=08,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='LAST TRN'                                       00039   
********************************************************************            
ASEL01  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT01  DFHMDF POS=(11,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR01 DFHMDF POS=(11,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF01  DFHMDF POS=(11,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN01 DFHMDF POS=(11,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ASEL02  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT02  DFHMDF POS=(12,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR02 DFHMDF POS=(12,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF02  DFHMDF POS=(12,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN02 DFHMDF POS=(12,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ASEL03  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT03  DFHMDF POS=(13,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR03 DFHMDF POS=(13,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF03  DFHMDF POS=(13,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN03 DFHMDF POS=(13,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ASEL04  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT04  DFHMDF POS=(14,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR04 DFHMDF POS=(14,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF04  DFHMDF POS=(14,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN04 DFHMDF POS=(14,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ASEL05  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT05  DFHMDF POS=(15,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR05 DFHMDF POS=(15,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF05  DFHMDF POS=(15,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN05 DFHMDF POS=(15,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ASEL06  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT06  DFHMDF POS=(16,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR06 DFHMDF POS=(16,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF06  DFHMDF POS=(16,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN06 DFHMDF POS=(16,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ASEL07  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT07  DFHMDF POS=(17,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR07 DFHMDF POS=(17,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF07  DFHMDF POS=(17,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN07 DFHMDF POS=(17,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ASEL08  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00085   
               HILIGHT=UNDERLINE                                        00085   
AACT08  DFHMDF POS=(18,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONR08 DFHMDF POS=(18,10),LENGTH=09,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE,                                             X00085   
               PICOUT='ZZZZZZZZ9'                                               
AREF08  DFHMDF POS=(18,22),LENGTH=15,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ALTRN08 DFHMDF POS=(18,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
********************************************************************            
        DFHMDF POS=(19,45),                                            X        
               LENGTH=25,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=NEUTRAL,                                          X        
               INITIAL='NUMBER OF SELECTED ITEMS:'                              
ASELIT  DFHMDF POS=(19,72),                                            X        
               LENGTH=07,                                              X        
               ATTRB=(ASKIP,NORM),                                     X        
               COLOR=BLUE,                                             X        
               PICOUT='ZZZ,ZZ9'                                                 
*                                                                               
*                                                                               
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
