*          DATA SET TRKM198                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM198                                            *   00004   
*        MAP     TR198A                                             *   00005   
*        PROGRAM TRKCS198                                           *   00006   
*        TRANSID Y198                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM198 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR198A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CONT NO:',                                     X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=8,                                               X00042   
               POS=(02,01)                                              00043   
ACONT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               POS=(02,10)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VESSEL:',                                      X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=7,                                               X00042   
               POS=(02,24)                                              00043   
AVSL    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=25,                                              X00046   
               POS=(02,32)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VOYAGE NO:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(02,58)                                              00043   
AVOY    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=9,                                               X00046   
               POS=(02,69)                                              00047   
        DFHMDF POS=(02,79),LENGTH=01,ATTRB=(PROT)                       00082   
*                                                                       00043   
        DFHMDF POS=(05,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(05,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(05,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(05,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(05,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(05,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00043   
        DFHMDF POS=(07,01),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='SEL'                                            00061   
        DFHMDF POS=(07,06),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ACT'                                            00064   
        DFHMDF POS=(07,16),LENGTH=08,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='SEAL NBR'                                       00061   
*                                                                               
ASEL01  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT01  DFHMDF POS=(08,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL01 DFHMDF POS=(08,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL02  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT02  DFHMDF POS=(09,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL02 DFHMDF POS=(09,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL03  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT03  DFHMDF POS=(10,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL03 DFHMDF POS=(10,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL04  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT04  DFHMDF POS=(11,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL04 DFHMDF POS=(11,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL05  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT05  DFHMDF POS=(12,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL05 DFHMDF POS=(12,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL06  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT06  DFHMDF POS=(13,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL06 DFHMDF POS=(13,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL07  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT07  DFHMDF POS=(14,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL07 DFHMDF POS=(14,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL08  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT08  DFHMDF POS=(15,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASAEL08 DFHMDF POS=(15,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL09  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT09  DFHMDF POS=(16,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL09 DFHMDF POS=(16,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL10  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT10  DFHMDF POS=(17,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL10 DFHMDF POS=(17,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                               
ASEL11  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X00079   
               HILIGHT=UNDERLINE,                                      X00080   
               COLOR=GREEN                                              00081   
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00082   
AACT11  DFHMDF POS=(18,06),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ASEAL11 DFHMDF POS=(18,11),LENGTH=15,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
*                                                                       00095   
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
