  PRINT  NOGEN                                                          00010000
*-------------------------------------------------------------------*   00020000
*                                                                   *   00030000
*        MAPSET  TRKM167                                            *   00040000
*        MAP     TR167A                                             *   00050000
*        PROGRAM TRKCS167                                           *   00060000
*        TRANSID Y167                                               *   00070000
*                                                                   *   00080000
*-------------------------------------------------------------------*   00090000
TRKM167 DFHMSD TYPE=DSECT,                                             X00100000
               LANG=COBOL,                                             X00110000
               MODE=INOUT,                                             X00120000
               STORAGE=AUTO,                                           X00130000
               TIOAPFX=YES,                                            X00140000
               TERM=3270-2                                              00150000
TR167A  DFHMDI LINE=2,                                                 X00160000
               COLUMN=01,                                              X00170000
               SIZE=(19,80),                                           X00180000
               CTRL=(FREEKB),                                          X00190000
               MAPATTS=(COLOR,HILIGHT),                                X00200000
               DSATTS=(COLOR,HILIGHT)                                   00210000
*********************                                                   00220000
********TOP OF SCREEN                                                   00230000
*********************                                                   00240000
        DFHMDF ATTRB=(ASKIP),                                          X00250000
               INITIAL='PO NO:',                                       X00260000
               COLOR=NEUTRAL,                                          X00270000
               LENGTH=06,                                              X00280000
               POS=(02,01)                                              00290000
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00300000
               COLOR=BLUE,                                             X00310000
               LENGTH=08,                                              X00320006
               PICOUT='ZZZZZZZ9',                                      X00330006
               POS=(02,08)                                              00340000
AVNDNME DFHMDF ATTRB=(ASKIP),                                          X00350000
               COLOR=BLUE,                                             X00360000
               LENGTH=29,                                              X00370006
               POS=(02,17)                                              00380006
        DFHMDF ATTRB=(ASKIP),                                          X00390000
               INITIAL='VEND STYLE:',                                  X00400000
               COLOR=NEUTRAL,                                          X00410000
               LENGTH=11,                                              X00420000
               POS=(02,48)                                              00430000
AVNDSTY DFHMDF ATTRB=(ASKIP),                                          X00440000
               COLOR=BLUE,                                             X00450000
               LENGTH=20,                                              X00460000
               POS=(02,60)                                              00470000
        DFHMDF ATTRB=(ASKIP),                                          X00480000
               INITIAL='DEPT.:',                                       X00490000
               COLOR=NEUTRAL,                                          X00500000
               LENGTH=06,                                              X00510000
               POS=(03,01)                                              00520000
ADEPT   DFHMDF ATTRB=(ASKIP,NORM),                                     X00530000
               COLOR=BLUE,                                             X00540000
               LENGTH=04,                                              X00550005
               PICOUT='ZZZ9',                                          X00560005
               POS=(03,08)                                              00570000
        DFHMDF ATTRB=(ASKIP),                                          X00580000
               INITIAL='START X-FACTORY..:',                           X00590000
               COLOR=NEUTRAL,                                          X00600000
               LENGTH=18,                                              X00610000
               POS=(03,18)                                              00620000
ASTXFDT DFHMDF ATTRB=(ASKIP,NORM),                                     X00630000
               COLOR=BLUE,                                             X00640000
               LENGTH=08,                                              X00650000
               POS=(03,37)                                              00660000
        DFHMDF ATTRB=(ASKIP),                                          X00670000
               INITIAL='OTB.......:',                                  X00680000
               COLOR=NEUTRAL,                                          X00690000
               LENGTH=11,                                              X00700000
               POS=(03,48)                                              00710000
AOTB    DFHMDF ATTRB=(ASKIP),                                          X00720000
               COLOR=BLUE,                                             X00730000
               LENGTH=06,                                              X00740000
               POS=(03,61)                                              00750000
        DFHMDF ATTRB=(ASKIP),                                          X00760000
               INITIAL='CNTRY:',                                       X00770000
               COLOR=NEUTRAL,                                          X00780000
               LENGTH=06,                                              X00790000
               POS=(04,01)                                              00800000
ACNTRY  DFHMDF ATTRB=(ASKIP),                                          X00810000
               COLOR=BLUE,                                             X00820000
               LENGTH=03,                                              X00830000
               POS=(04,08)                                              00840000
        DFHMDF ATTRB=(ASKIP),                                          X00850000
               INITIAL='LAST  X-FACTORY..:',                           X00860000
               COLOR=NEUTRAL,                                          X00870000
               LENGTH=18,                                              X00880000
               POS=(04,18)                                              00890000
ALTXFDT DFHMDF ATTRB=(ASKIP),                                          X00900000
               COLOR=BLUE,                                             X00910000
               LENGTH=08,                                              X00920000
               POS=(04,37)                                              00930000
        DFHMDF ATTRB=(ASKIP),                                          X00940000
               INITIAL='ORD UNTS..:',                                  X00950000
               COLOR=NEUTRAL,                                          X00960000
               LENGTH=11,                                              X00970000
               POS=(04,48)                                              00980000
AUNTS   DFHMDF ATTRB=(ASKIP,NORM),                                     X00990000
               COLOR=BLUE,                                             X01000000
               LENGTH=07,                                              X01010000
               PICOUT='ZZZZZZZ',                                       X01020000
               POS=(04,60)                                              01030000
        DFHMDF ATTRB=(ASKIP),                                          X01040000
               INITIAL='FOB..:',                                       X01050000
               COLOR=NEUTRAL,                                          X01060000
               LENGTH=06,                                              X01070000
               POS=(05,01)                                              01080000
AFOB    DFHMDF ATTRB=(ASKIP),                                          X01090000
               COLOR=BLUE,                                             X01100000
               LENGTH=04,                                              X01110000
               POS=(05,08)                                              01120000
        DFHMDF ATTRB=(ASKIP),                                          X01130000
               INITIAL='DONT SHIP BEFORE.:',                           X01140000
               COLOR=NEUTRAL,                                          X01150000
               LENGTH=18,                                              X01160000
               POS=(05,18)                                              01170000
ADSHBEF DFHMDF ATTRB=(ASKIP),                                          X01180000
               COLOR=BLUE,                                             X01190000
               LENGTH=08,                                              X01200000
               POS=(05,37)                                              01210000
        DFHMDF ATTRB=(ASKIP),                                          X01220000
               INITIAL='EST CTNS..:',                                  X01230000
               COLOR=NEUTRAL,                                          X01240000
               LENGTH=11,                                              X01250000
               POS=(05,48)                                              01260000
ACTNS   DFHMDF ATTRB=(ASKIP),                                          X01270000
               COLOR=BLUE,                                             X01280000
               LENGTH=05,                                              X01290000
               PICOUT='ZZZZZ',                                         X01300000
               POS=(05,62)                                              01310000
        DFHMDF ATTRB=(ASKIP),                                          X01320000
               INITIAL='POE..:',                                       X01330000
               COLOR=NEUTRAL,                                          X01340000
               LENGTH=06,                                              X01350000
               POS=(06,01)                                              01360000
APOE    DFHMDF ATTRB=(ASKIP),                                          X01370000
               COLOR=BLUE,                                             X01380000
               LENGTH=08,                                              X01390000
               POS=(06,08)                                              01400000
        DFHMDF ATTRB=(ASKIP),                                          X01410000
               INITIAL='CANCEL:',                                      X01420000
               COLOR=NEUTRAL,                                          X01430000
               LENGTH=07,                                              X01440000
               POS=(06,18)                                              01450000
ACANDT  DFHMDF ATTRB=(ASKIP),                                          X01460000
               COLOR=BLUE,                                             X01470000
               LENGTH=08,                                              X01480000
               POS=(06,26)                                              01490000
AXCANDT DFHMDF ATTRB=(ASKIP),                                          X01500000
               COLOR=BLUE,                                             X01510000
               LENGTH=08,                                              X01520000
               POS=(06,37)                                              01530000
        DFHMDF ATTRB=(ASKIP),                                          X01540000
               INITIAL='AD DTE....:',                                  X01550000
               COLOR=NEUTRAL,                                          X01560000
               LENGTH=11,                                              X01570000
               POS=(06,48)                                              01580000
AADDT   DFHMDF ATTRB=(ASKIP),                                          X01590000
               COLOR=BLUE,                                             X01600000
               LENGTH=08,                                              X01610000
               POS=(06,60)                                              01620000
        DFHMDF ATTRB=(ASKIP),                                          X01630000
               INITIAL='SPLIT TRANSMITTED:',                           X01640000
               COLOR=NEUTRAL,                                          X01650000
               LENGTH=18,                                              X01660000
               POS=(07,18)                                              01670000
ASPLIT  DFHMDF ATTRB=(ASKIP),                                          X01680000
               COLOR=BLUE,                                             X01690000
               LENGTH=08,                                              X01700000
               POS=(07,37)                                              01710000
*********************                                                   01720000
********TO/FROM                                                         01730000
*********************                                                   01740000
        DFHMDF POS=(08,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X01750000
               COLOR=NEUTRAL,INITIAL='ITEMS'                            01760000
ASTRTIT DFHMDF POS=(08,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X01770000
               COLOR=GREEN,                                            X01780000
               HILIGHT=UNDERLINE,                                      X01790000
               PICIN='99999',                                          X01800000
               PICOUT='ZZZZ9'                                           01810000
        DFHMDF POS=(08,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X01820000
               COLOR=NEUTRAL,                                          X01830000
               INITIAL='TO'                                             01840000
AENDIT  DFHMDF POS=(08,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X01850000
               COLOR=BLUE,                                             X01860000
               PICOUT='ZZZZ9'                                           01870000
        DFHMDF POS=(08,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X01880000
               COLOR=NEUTRAL,                                          X01890000
               INITIAL='OF'                                             01900000
ATOTIT  DFHMDF POS=(08,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X01910000
               COLOR=BLUE,                                             X01920000
               PICOUT='ZZZZ9'                                           01930000
        DFHMDF ATTRB=(ASKIP),                                          X01940000
               COLOR=NEUTRAL,                                          X01950000
               LENGTH=1,                                               X01960000
               POS=(08,74)                                              01970000
*********************                                                   01980000
********HEADINGS                                                        01990000
*********************                                                   02000000
        DFHMDF POS=(09,22),LENGTH=03,ATTRB=(PROT,NORM),                X02010000
               COLOR=NEUTRAL,                                          X02020000
               INITIAL='POE'                                            02030000
AHEAD   DFHMDF ATTRB=(ASKIP),                                          X02040001
               COLOR=NEUTRAL,                                          X02050001
               LENGTH=53,                                              X02060003
               POS=(09,26)                                              02070001
*                                                                       02080001
        DFHMDF POS=(10,02),LENGTH=01,ATTRB=(PROT,NORM),                X02090000
               COLOR=NEUTRAL,                                          X02100000
               INITIAL='S'                                              02110000
        DFHMDF POS=(10,04),LENGTH=03,ATTRB=(PROT,NORM),                X02120000
               COLOR=NEUTRAL,                                          X02130000
               INITIAL='ACT'                                            02140000
        DFHMDF POS=(10,08),LENGTH=09,ATTRB=(PROT,NORM),                X02150000
               COLOR=NEUTRAL,                                          X02160000
               INITIAL='CONTAINER'                                      02170000
        DFHMDF POS=(10,22),LENGTH=03,ATTRB=(PROT,NORM),                X02180000
               COLOR=NEUTRAL,                                          X02190000
               INITIAL='ETA'                                            02200000
AHEAD2  DFHMDF ATTRB=(ASKIP),                                          X02210001
               COLOR=NEUTRAL,                                          X02220001
               LENGTH=53,                                              X02230003
               POS=(10,26)                                              02240001
*                                                                       02250001
*********************                                                   02260000
********LIST ITEM AREA                                                  02270000
*********************                                                   02280000
*                                                                       02290000
ASEL01  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X02300000
               COLOR=GREEN,                                            X02310000
               HILIGHT=UNDERLINE                                        02320000
AACT01  DFHMDF POS=(11,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X02330000
               COLOR=BLUE                                               02340000
ACONT01 DFHMDF POS=(11,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X02350000
               COLOR=BLUE                                               02360000
AATA01  DFHMDF POS=(11,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X02370000
               COLOR=BLUE                                               02380000
ALINE1  DFHMDF ATTRB=(ASKIP),                                          X02390001
               COLOR=BLUE,                                             X02400001
               LENGTH=53,                                              X02410002
               POS=(11,27)                                              02420001
*                                                                       02430000
ASEL02  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X02440000
               COLOR=GREEN,                                            X02450000
               HILIGHT=UNDERLINE                                        02460000
AACT02  DFHMDF POS=(12,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X02470000
               COLOR=BLUE                                               02480000
ACONT02 DFHMDF POS=(12,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X02490000
               COLOR=BLUE                                               02500000
AATA02  DFHMDF POS=(12,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X02510000
               COLOR=BLUE                                               02520000
ALINE2  DFHMDF ATTRB=(ASKIP),                                          X02530001
               COLOR=BLUE,                                             X02540001
               LENGTH=53,                                              X02550002
               POS=(12,27)                                              02560001
*                                                                       02570000
ASEL03  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X02580000
               COLOR=GREEN,                                            X02590000
               HILIGHT=UNDERLINE                                        02600000
AACT03  DFHMDF POS=(13,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X02610000
               COLOR=BLUE                                               02620000
ACONT03 DFHMDF POS=(13,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X02630000
               COLOR=BLUE                                               02640000
AATA03  DFHMDF POS=(13,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X02650000
               COLOR=BLUE                                               02660000
ALINE3  DFHMDF ATTRB=(ASKIP),                                          X02670001
               COLOR=BLUE,                                             X02680001
               LENGTH=53,                                              X02690002
               POS=(13,27)                                              02700001
*                                                                       02710000
ASEL04  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X02720000
               COLOR=GREEN,                                            X02730000
               HILIGHT=UNDERLINE                                        02740000
AACT04  DFHMDF POS=(14,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X02750000
               COLOR=BLUE                                               02760000
ACONT04 DFHMDF POS=(14,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X02770000
               COLOR=BLUE                                               02780000
AATA04  DFHMDF POS=(14,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X02790000
               COLOR=BLUE                                               02800000
ALINE4  DFHMDF ATTRB=(ASKIP),                                          X02810001
               COLOR=BLUE,                                             X02820001
               LENGTH=53,                                              X02830002
               POS=(14,27)                                              02840001
*                                                                       02850000
ASEL05  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X02860000
               COLOR=GREEN,                                            X02870000
               HILIGHT=UNDERLINE                                        02880000
AACT05  DFHMDF POS=(15,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X02890000
               COLOR=BLUE                                               02900000
ACONT05 DFHMDF POS=(15,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X02910000
               COLOR=BLUE                                               02920000
AATA05  DFHMDF POS=(15,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X02930000
               COLOR=BLUE                                               02940000
ALINE5  DFHMDF ATTRB=(ASKIP),                                          X02950001
               COLOR=BLUE,                                             X02960001
               LENGTH=53,                                              X02970002
               POS=(15,27)                                              02980001
*                                                                       02990000
ASEL06  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X03000000
               COLOR=GREEN,                                            X03010000
               HILIGHT=UNDERLINE                                        03020000
AACT06  DFHMDF POS=(16,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X03030000
               COLOR=BLUE                                               03040000
ACONT06 DFHMDF POS=(16,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X03050000
               COLOR=BLUE                                               03060000
AATA06  DFHMDF POS=(16,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X03070000
               COLOR=BLUE                                               03080000
ALINE6  DFHMDF ATTRB=(ASKIP),                                          X03090001
               COLOR=BLUE,                                             X03100001
               LENGTH=53,                                              X03110002
               POS=(16,27)                                              03120001
*                                                                       03130000
ASEL07  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X03140000
               COLOR=GREEN,                                            X03150000
               HILIGHT=UNDERLINE                                        03160000
AACT07  DFHMDF POS=(17,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X03170000
               COLOR=BLUE                                               03180000
ACONT07 DFHMDF POS=(17,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X03190000
               COLOR=BLUE                                               03200000
AATA07  DFHMDF POS=(17,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X03210000
               COLOR=BLUE                                               03220000
ALINE7  DFHMDF ATTRB=(ASKIP),                                          X03230001
               COLOR=BLUE,                                             X03240001
               LENGTH=53,                                              X03250002
               POS=(17,27)                                              03260001
*                                                                       03270000
ASEL08  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              X03280000
               COLOR=GREEN,                                            X03290000
               HILIGHT=UNDERLINE                                        03300000
AACT08  DFHMDF POS=(18,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X03310000
               COLOR=BLUE                                               03320000
ACONT08 DFHMDF POS=(18,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X03330000
               COLOR=BLUE                                               03340000
AATA08  DFHMDF POS=(18,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X03350000
               COLOR=BLUE                                               03360000
ALINE8  DFHMDF ATTRB=(ASKIP),                                          X03370001
               COLOR=BLUE,                                             X03380001
               LENGTH=53,                                              X03390002
               POS=(18,27)                                              03400001
*                                                                       03410000
*                                                                       03420000
        DFHMDF POS=(19,45),                                            X03430000
               LENGTH=25,                                              X03440000
               ATTRB=(ASKIP,NORM),                                     X03450000
               COLOR=NEUTRAL,                                          X03460000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      03470000
ASELIT  DFHMDF POS=(19,72),                                            X03480000
               LENGTH=07,                                              X03490000
               ATTRB=(ASKIP,NORM),                                     X03500000
               COLOR=BLUE,                                             X03510000
               PICOUT='ZZZ,ZZ9'                                         03520000
*                                                                       03530000
*                                                                       03540000
*                                                                       03550000
        DFHMSD TYPE=FINAL                                               03560000
        END                                                             03570000
