*          DATA SET TRKM157    AT LEVEL 005 AS OF 02/05/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM157                                            *   00004   
*        MAP     TR157A                                             *   00005   
*        PROGRAM TRKCS157                                           *   00006   
*        TRANSID Y157 - ORG CODE CRITERIA SPEC                      *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM157 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR157A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
         DFHMDF POS=(06,001),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=076,                                             X00027   
               INITIAL=' ENTER CODE TO UPDATE OR DELETE                X00027   
                                            '                           00028   
*                                                                       00020   
         DFHMDF POS=(08,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=076,                                             X00027   
               INITIAL='LEAVE BLANK OR ENTER CODE PLUS * AND F17 TO LISX00028   
               T ACTIVES                    '                           00029   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ORIGIN CODE:',                                 X00022   
               LENGTH=12,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(11,10)                                              00026**2
AORGCOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(11,23)                                              00037**5
AORGDES DFHMDF ATTRB=(ASKIP,NORM),                                     X00049   
               LENGTH=30,                                              X00050   
               COLOR=NEUTRAL,                                          X00051   
               POS=(11,27)                                              00053**3
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(11,58)                                              00087**3
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ORIGIN TYPE:',                                 X00022   
               LENGTH=12,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(12,10)                                              00026**2
AORGTYP DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(12,23)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(12,27)                                              00087**3
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
