*          DATA SET TRKM190                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM190                                            *   00004   
*        MAP     TR190A                                             *   00005   
*        PROGRAM TRKCS190                                           *   00006   
*        TRANSID Y190                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM190 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR190A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CONT:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,01)                                              00043   
ACNTRNO DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               POS=(02,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VOY:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(02,22)                                              00043   
AVYNO   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=10,                                              X00046   
               POS=(02,27)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='KGS.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,45)                                              00043   
AKGS    DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(02,51)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CTN.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,61)                                              00043   
ACTN    DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(02,67)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VSL.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,01)                                              00043   
AVSNM   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=25,                                              X00046   
               POS=(03,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='SIZE:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,33)                                              00043   
ASIZE   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               POS=(03,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TYPE:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,45)                                              00043   
ASHPTYP DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=07,                                              X00046   
               POS=(03,51)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='UNT.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(03,61)                                              00043   
AUNITS  DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X        
               POS=(03,67)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ATD.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(04,01)                                              00043   
AATD    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ATA:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(04,17)                                              00043   
AATA    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(04,22)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='FOB.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(04,33)                                              00043   
AFOB    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(04,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CARR SCAC:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(04,45)                                              00043   
ACRSCAC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               POS=(04,56)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CBM.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(04,61)                                              00043   
ACBM    DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               PICOUT='ZZZZZZZZZ.ZZ',                                  X        
               POS=(04,67)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ETA.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,01)                                              00043   
AETA    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='ELD:',                                         X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(05,17)                                              00043   
AELD    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=08,                                              X00046   
               POS=(05,22)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POE.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,33)                                              00043   
APOE    DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=03,                                              X00046   
               POS=(05,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='CNSL SCAC:',                                   X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=10,                                              X00042   
               POS=(05,45)                                              00043   
ACNSCAC DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               POS=(05,56)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POL.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,61)                                              00043   
AMPOL   DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=3,                                               X00046   
               POS=(05,76)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LBD.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(06,01)                                              00043   
ALBDNM  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=18,                                              X00046   
               POS=(06,07)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='TRN CNT.:',                                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=09,                                              X00042   
               POS=(06,29)                                              00043   
ATRNCNT DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               PICOUT='ZZZZ',                                          X        
               POS=(06,39)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='LAST TRN:',                                    X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=09,                                              X00042   
               POS=(06,45)                                              00043   
ALSTTRN DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=05,                                              X00046   
               POS=(06,55)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='POR.:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(06,61)                                              00043   
AMPOR   DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=3,                                               X00046   
               POS=(06,76)                                              00047   
*                                                                               
        DFHMDF POS=(07,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(07,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(07,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(07,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(07,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(07,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                               
        DFHMDF POS=(08,08),LENGTH=05,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='PO NO'                                          00061   
        DFHMDF POS=(08,16),LENGTH=21,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='MASTER BILL OF LADING'                          00061   
        DFHMDF POS=(08,48),LENGTH=20,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='HOUSE BILL OF LADING'                           00064   
*                                                                               
ASEL01  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT01  DFHMDF POS=(09,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO01 DFHMDF POS=(09,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL01 DFHMDF POS=(09,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL01 DFHMDF POS=(09,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL02  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT02  DFHMDF POS=(10,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO02 DFHMDF POS=(10,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL02 DFHMDF POS=(10,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL02 DFHMDF POS=(10,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL03  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT03  DFHMDF POS=(11,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO03 DFHMDF POS=(11,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL03 DFHMDF POS=(11,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL03 DFHMDF POS=(11,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL04  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT04  DFHMDF POS=(12,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO04 DFHMDF POS=(12,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL04 DFHMDF POS=(12,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL04 DFHMDF POS=(12,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL05  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT05  DFHMDF POS=(13,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO05 DFHMDF POS=(13,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL05 DFHMDF POS=(13,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL05 DFHMDF POS=(13,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL06  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT06  DFHMDF POS=(14,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO06 DFHMDF POS=(14,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL06 DFHMDF POS=(14,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL06 DFHMDF POS=(14,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL07  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT07  DFHMDF POS=(15,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO07 DFHMDF POS=(15,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL07 DFHMDF POS=(15,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL07 DFHMDF POS=(15,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL08  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT08  DFHMDF POS=(16,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO08 DFHMDF POS=(16,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL08 DFHMDF POS=(16,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL08 DFHMDF POS=(16,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL09  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT09  DFHMDF POS=(17,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO09 DFHMDF POS=(17,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL09 DFHMDF POS=(17,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL09 DFHMDF POS=(17,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
ASEL10  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(ASKIP,NORM),               X00079   
               COLOR=BLUE                                               00085   
AACT10  DFHMDF POS=(18,03),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
APONO10 DFHMDF POS=(18,07),LENGTH=08,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE,PICOUT='ZZZZZZZZ',JUSTIFY=(LEFT,BLANK)        00088   
AMBOL10 DFHMDF POS=(18,16),LENGTH=30,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
AHBOL10 DFHMDF POS=(18,48),LENGTH=30,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
*                                                                               
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
