*          DATA SET TRKM154    AT LEVEL 005 AS OF 02/05/93                      
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM154                                            *   00004   
*        MAP     TR154A                                             *   00005   
*        PROGRAM TRKCS154                                           *   00006   
*        TRANSID Y154 - POE CODE ADD/UPDATE/DELETE                  *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM154 DFHMSD TYPE=MAP,                                               X00011   
               MODE=INOUT,                                             X00012   
               LANG=COBOL,                                             X00013   
               TIOAPFX=YES,                                            X00014   
               CTRL=(FREEKB)                                            00015   
TR154A  DFHMDI LINE=2,COLUMN=1,                                        X00016**4
               SIZE=(19,80),                                           X00017**2
               MAPATTS=(COLOR,HILIGHT),                                X00018   
               DSATTS=(COLOR,HILIGHT)                                   00019   
*                                                                       00020   
         DFHMDF POS=(04,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=033,                                             X00027   
               INITIAL='ENTER EDI STANDARD POE DATA ONLY.'              00028   
*                                                                       00020   
         DFHMDF POS=(06,002),                                          X00024   
               COLOR=NEUTRAL,                                          X00025   
               ATTRB=(ASKIP,BRT),                                      X00026   
               LENGTH=044,                                             X00027   
               INITIAL='CONTACT INFORMATION SERVICES FOR ASSISTANCE.'   00028   
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='POE CODE........:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(09,10)                                              00026**2
APOECOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=3,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(09,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(09,32)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='EDI SCHED D CODE:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(10,10)                                              00026**2
AEDICOD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=4,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(10,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(10,33)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='DECONSOLIDATOR..:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(11,10)                                              00026**2
ADCNSLC DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=04,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(11,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(11,33)                                              00087**3
ADCNSLN DFHMDF ATTRB=(PROT,NORM),                                      X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00035**3
               POS=(11,35)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(11,66)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='IATA CODE.......:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(13,10)                                              00026**2
AIATACD DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=03,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(13,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(13,32)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='CITY NAME.......:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(14,10)                                              00026**2
APOECTY DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(14,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(14,59)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='STATE CODE......:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(15,10)                                              00026**2
APOESTA DFHMDF ATTRB=(UNPROT,NORM),                                    X00033**3
               LENGTH=2,                                               X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(15,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(15,31)                                              00087**3
ASTADES DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00086   
               POS=(15,34)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(15,65)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='POE PORT/AIRPORT:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(16,10)                                              00026**2
APOEDES DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=30,                                              X00034**3
               COLOR=BLUE,                                             X00086   
               POS=(16,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(16,59)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='TRIP TYPE CODE..:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(17,10)                                              00026**2
ATRPTYP DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=01,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(17,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(17,30)                                              00087**3
*                                                                       00020   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00021   
               INITIAL='ALLOWED ON PO...:',                            X00022   
               LENGTH=17,                                              X00024   
               COLOR=NEUTRAL,                                          X00025   
               POS=(18,10)                                              00026**2
AALWDPO DFHMDF ATTRB=(ASKIP),                                          X00033**3
               LENGTH=01,                                              X00034**3
               COLOR=GREEN,                                            X00035**3
               HILIGHT=UNDERLINE,                                      X00036**3
               POS=(18,28)                                              00037**5
        DFHMDF ATTRB=(ASKIP),                                          X00084   
               LENGTH=1,                                               X00085   
               COLOR=NEUTRAL,                                          X00086   
               POS=(18,30)                                              00087**3
*                                                                       00020   
         DFHMSD TYPE=FINAL                                              00088   
         END                                                            00089   
