*          DATA SET TRKM193                                                     
  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM193                                            *   00004   
*        MAP     TR193A                                             *   00005   
*        PROGRAM TRKCS193                                           *   00006   
*        TRANSID Y193                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM193 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR193A  DFHMDI LINE=02,                                                X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
*                                                                       00022   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='PO NUMBER..:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(02,03)                                              00043   
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=09,                                              X00046   
               PICOUT='ZZZZZZZZZ',                                     X00046   
               POS=(02,16)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='DEPT:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,28)                                              00043   
ADEPT   DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=04,                                              X00046   
               PICOUT='ZZZ9',                                          X        
               POS=(02,34)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='VENDOR NAME:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(03,03)                                              00043   
AVNDNME DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=30,                                              X00046   
               POS=(03,16)                                              00047   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               INITIAL='STATUS.....:',                                 X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(04,03)                                              00043   
ASTATUS DFHMDF ATTRB=(ASKIP),                                          X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=20,                                              X00046   
               POS=(04,16)                                              00047   
*                                                                               
        DFHMDF POS=(05,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(05,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(05,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(05,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(05,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(05,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
*                                                                       00043   
        DFHMDF POS=(06,21),LENGTH=04,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CART'                                           00061   
        DFHMDF POS=(06,27),LENGTH=03,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='POE'                                            00061   
        DFHMDF POS=(06,32),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='POE'                                            00067   
        DFHMDF POS=(06,40),LENGTH=07,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='RELEASE'                                        00067   
        DFHMDF POS=(06,52),LENGTH=06,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='DCNSLR'                                         00067   
        DFHMDF POS=(06,63),LENGTH=09,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='DATE/TIME'                                      00067   
        DFHMDF POS=(06,76),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='PO/'                                            00067   
                                                                        00043   
        DFHMDF POS=(07,02),LENGTH=01,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='S'                                              00061   
        DFHMDF POS=(07,04),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='ACT'                                            00064   
        DFHMDF POS=(07,09),LENGTH=09,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='CONTAINER'                                      00061   
        DFHMDF POS=(07,21),LENGTH=05,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='COUNT'                                          00064   
        DFHMDF POS=(07,27),LENGTH=03,ATTRB=(PROT,NORM),                X00062   
               COLOR=NEUTRAL,                                          X00063   
               INITIAL='CDE'                                            00064   
        DFHMDF POS=(07,32),LENGTH=03,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='ETA'                                            00067   
        DFHMDF POS=(07,40),LENGTH=06,ATTRB=(PROT,NORM),                X00059   
               COLOR=NEUTRAL,                                          X00060   
               INITIAL='STATUS'                                         00061   
        DFHMDF POS=(07,53),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='SCAC'                                           00067   
        DFHMDF POS=(07,63),LENGTH=08,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='RELEASED'                                       00067   
        DFHMDF POS=(07,76),LENGTH=04,ATTRB=(PROT,NORM),                X00065**2
               COLOR=NEUTRAL,                                          X00066   
               INITIAL='CONT'                                           00067   
*                                                                               
ASEL01  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT01  DFHMDF POS=(08,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR01 DFHMDF POS=(08,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART01 DFHMDF POS=(08,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE01  DFHMDF POS=(08,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA01  DFHMDF POS=(08,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT01 DFHMDF POS=(08,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC01 DFHMDF POS=(08,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD01 DFHMDF POS=(08,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST01 DFHMDF POS=(08,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN01 DFHMDF POS=(08,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL02  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT02  DFHMDF POS=(09,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR02 DFHMDF POS=(09,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART02 DFHMDF POS=(09,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE02  DFHMDF POS=(09,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA02  DFHMDF POS=(09,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT02 DFHMDF POS=(09,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC02 DFHMDF POS=(09,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD02 DFHMDF POS=(09,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST02 DFHMDF POS=(09,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN02 DFHMDF POS=(09,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL03  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT03  DFHMDF POS=(10,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR03 DFHMDF POS=(10,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART03 DFHMDF POS=(10,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE03  DFHMDF POS=(10,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA03  DFHMDF POS=(10,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT03 DFHMDF POS=(10,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC03 DFHMDF POS=(10,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD03 DFHMDF POS=(10,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST03 DFHMDF POS=(10,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN03 DFHMDF POS=(10,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL04  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT04  DFHMDF POS=(11,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR04 DFHMDF POS=(11,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART04 DFHMDF POS=(11,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE04  DFHMDF POS=(11,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA04  DFHMDF POS=(11,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT04 DFHMDF POS=(11,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC04 DFHMDF POS=(11,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD04 DFHMDF POS=(11,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST04 DFHMDF POS=(11,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN04 DFHMDF POS=(11,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL05  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT05  DFHMDF POS=(12,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR05 DFHMDF POS=(12,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART05 DFHMDF POS=(12,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE05  DFHMDF POS=(12,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA05  DFHMDF POS=(12,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT05 DFHMDF POS=(12,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC05 DFHMDF POS=(12,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD05 DFHMDF POS=(12,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST05 DFHMDF POS=(12,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN05 DFHMDF POS=(12,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL06  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT06  DFHMDF POS=(13,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR06 DFHMDF POS=(13,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART06 DFHMDF POS=(13,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE06  DFHMDF POS=(13,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA06  DFHMDF POS=(13,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT06 DFHMDF POS=(13,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC06 DFHMDF POS=(13,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD06 DFHMDF POS=(13,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST06 DFHMDF POS=(13,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN06 DFHMDF POS=(13,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL07  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT07  DFHMDF POS=(14,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR07 DFHMDF POS=(14,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART07 DFHMDF POS=(14,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE07  DFHMDF POS=(14,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA07  DFHMDF POS=(14,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT07 DFHMDF POS=(14,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC07 DFHMDF POS=(14,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD07 DFHMDF POS=(14,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST07 DFHMDF POS=(14,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN07 DFHMDF POS=(14,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL08  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT08  DFHMDF POS=(15,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR08 DFHMDF POS=(15,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART08 DFHMDF POS=(15,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE08  DFHMDF POS=(15,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA08  DFHMDF POS=(15,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT08 DFHMDF POS=(15,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC08 DFHMDF POS=(15,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD08 DFHMDF POS=(15,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST08 DFHMDF POS=(15,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN08 DFHMDF POS=(15,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL09  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT09  DFHMDF POS=(16,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR09 DFHMDF POS=(16,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART09 DFHMDF POS=(16,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE09  DFHMDF POS=(16,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA09  DFHMDF POS=(16,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT09 DFHMDF POS=(16,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC09 DFHMDF POS=(16,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD09 DFHMDF POS=(16,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST09 DFHMDF POS=(16,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN09 DFHMDF POS=(16,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL10  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT10  DFHMDF POS=(17,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR10 DFHMDF POS=(17,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART10 DFHMDF POS=(17,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE10  DFHMDF POS=(17,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA10  DFHMDF POS=(17,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT10 DFHMDF POS=(17,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC10 DFHMDF POS=(17,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD10 DFHMDF POS=(17,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST10 DFHMDF POS=(17,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN10 DFHMDF POS=(17,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                               
ASEL11  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM,IC),           X00079   
               COLOR=GREEN,                                            X00081   
               HILIGHT=UNDERLINE                                        00085   
AACT11  DFHMDF POS=(18,04),LENGTH=03,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ACNTR11 DFHMDF POS=(18,08),LENGTH=12,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
ACART11 DFHMDF POS=(18,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00087   
               COLOR=BLUE                                               00088   
APOE11  DFHMDF POS=(18,27),LENGTH=02,ATTRB=(ASKIP,NORM),               X00089   
               COLOR=BLUE                                               00090   
AETA11  DFHMDF POS=(18,31),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ASTAT11 DFHMDF POS=(18,39),LENGTH=12,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ASCAC11 DFHMDF POS=(18,53),LENGTH=04,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
ARLSD11 DFHMDF POS=(18,63),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
ARLST11 DFHMDF POS=(18,69),LENGTH=05,ATTRB=(ASKIP,NORM),               X00091   
               COLOR=BLUE                                               00092   
APOCN11 DFHMDF POS=(18,77),LENGTH=01,ATTRB=(ASKIP,NORM),               X00093   
               COLOR=BLUE                                               00094   
*                                                                       00304   
        DFHMDF POS=(19,45),LENGTH=25,ATTRB=(ASKIP,NORM),               X00300   
               COLOR=NEUTRAL,INITIAL='NUMBER OF ITEMS SELECTED:'        00301   
ASELIT  DFHMDF POS=(19,72),LENGTH=07,ATTRB=(ASKIP,NORM),               X00302   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00303   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
