*          DATA SET TRKM104    AT LEVEL 001 AS OF 08/23/95                      
*          DATA SET TRKM104    AT LEVEL 020 AS OF 05/08/95              00001   
*          DATA SET TRKM104B1  AT LEVEL 001 AS OF 03/08/95              00002   
  PRINT  NOGEN                                                          00003   
*-------------------------------------------------------------------*   00004   
*                                                                   *   00005   
*        MAPSET  TRKM104                                            *   00006   
*        MAP     TR104A                                             *   00007   
*        PROGRAM TRKCS104                                           *   00008   
*        TRANSID Y104                                               *   00009   
*        SYSTEM  CICS ARCHITECTURE                                  *   00010   
*                                                                   *   00011   
*-------------------------------------------------------------------*   00012   
TRKM104 DFHMSD TYPE=DSECT,                                             X00013   
               MODE=INOUT,                                             X00014   
               LANG=COBOL,                                             X00015   
               STORAGE=AUTO,                                           X00016   
               TIOAPFX=YES,                                            X00017   
               TERM=3270-2                                              00018   
TR104A  DFHMDI SIZE=(19,80),                                           X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT),                                 X00021   
               CTRL=(FREEKB),                                          X00022   
               LINE=02,                                                X00023   
               COLUMN=01                                                00024   
*                                                                       00025   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00026   
               INITIAL='DEPARTMENT..:',                                X00027   
               LENGTH=13,                                              X00028   
               POS=(03,19)                                              00029   
*                                                                       00030   
ADEPT   DFHMDF ATTRB=(UNPROT,NORM,NUM,IC),                             X00031   
               LENGTH=4,                                               X00032   
               PICOUT='ZZZZ',                                          X00050   
               COLOR=GREEN,                                            X00033   
               HILIGHT=UNDERLINE,                                      X00034   
               POS=(03,33)                                              00035   
*                                                                       00036   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00037   
               INITIAL=' ',                                            X00038   
               LENGTH=1,                                               X00039   
               POS=(03,38)                                              00040   
*                                                                       00041   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00042   
               INITIAL='PO..........:',                                X00043   
               LENGTH=13,                                              X00044   
               POS=(04,19)                                              00045   
*                                                                       00046   
APO     DFHMDF ATTRB=(UNPROT,NORM),                                    X00047   
               LENGTH=8,                                               X00048   
               COLOR=GREEN,                                            X00049   
               PICOUT='ZZZZZZZZ',                                      X00050   
               HILIGHT=UNDERLINE,                                      X00051   
               POS=(04,33)                                              00052   
*                                                                       00053   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00054   
               INITIAL=' ',                                            X00055   
               LENGTH=1,                                               X00056   
               POS=(04,42)                                              00057   
*                                                                       00058   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00059   
               INITIAL='FREIGHT BILL:',                                X00060   
               LENGTH=13,                                              X00061   
               POS=(05,19)                                              00062   
*                                                                       00063   
APRO    DFHMDF ATTRB=(UNPROT,NORM),                                    X00064   
               LENGTH=22,                                              X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               POS=(05,33)                                              00068   
*                                                                       00069   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00070   
               INITIAL=' ',                                            X00071   
               LENGTH=1,                                               X00072   
               POS=(05,56)                                              00073   
*                                                                       00074   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00075   
               INITIAL='BOL.........:',                                X00076   
               LENGTH=13,                                              X00077   
               POS=(06,19)                                              00078   
*                                                                       00079   
ABOL    DFHMDF ATTRB=(UNPROT,NORM),                                    X00080   
               LENGTH=30,                                              X00081   
               COLOR=GREEN,                                            X00082   
               HILIGHT=UNDERLINE,                                      X00083   
               POS=(06,33)                                              00084   
*                                                                       00085   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00086   
               INITIAL=' ',                                            X00087   
               LENGTH=1,                                               X00088   
               POS=(06,64)                                              00089   
*                                                                       00090   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00091   
               INITIAL='OPER UNIT...:',                                X00092   
               LENGTH=13,                                              X00093   
               POS=(07,19)                                              00094   
*                                                                       00095   
AOPER   DFHMDF ATTRB=(UNPROT,NORM),                                    X00096   
               LENGTH=4,                                               X00097   
               COLOR=GREEN,                                            X00098   
               PICOUT='ZZZZ',                                          X00099   
               HILIGHT=UNDERLINE,                                      X00100   
               POS=(07,33)                                              00101   
*                                                                       00102   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00103   
               INITIAL=' ',                                            X00104   
               LENGTH=1,                                               X00105   
               POS=(07,38)                                              00106   
*                                                                       00107   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00108   
               INITIAL='FCLTY:',                                       X00109   
               LENGTH=06,                                              X00110   
               POS=(07,40)                                              00111   
*                                                                       00112   
AFCLTY  DFHMDF ATTRB=(UNPROT,NORM),                                    X00113   
               LENGTH=4,                                               X00114   
               COLOR=GREEN,                                            X00115   
               PICOUT='ZZZZ',                                          X00116   
               HILIGHT=UNDERLINE,                                      X00117   
               POS=(07,47)                                              00118   
*                                                                       00119   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00120   
               INITIAL=' ',                                            X00121   
               LENGTH=1,                                               X00122   
               POS=(07,52)                                              00123   
*                                                                       00124   
AFDESC  DFHMDF ATTRB=(ASKIP),                                          X00125   
               COLOR=BLUE,                                             X00126   
               LENGTH=25,                                              X00127   
               POS=(07,54)                                              00128   
*                                                                       00129   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00130   
               INITIAL='SCAC........:',                                X00131   
               LENGTH=13,                                              X00132   
               POS=(08,19)                                              00133   
*                                                                       00134   
ASCAC   DFHMDF ATTRB=(UNPROT,NORM),                                    X00135   
               LENGTH=4,                                               X00136   
               COLOR=GREEN,                                            X00137   
               HILIGHT=UNDERLINE,                                      X00138   
               POS=(08,33)                                              00139   
*                                                                       00140   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00141   
               INITIAL=' ',                                            X00142   
               LENGTH=1,                                               X00143   
               POS=(08,38)                                              00144   
*                                                                       00145   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00146   
               INITIAL='ETA FROM....:',                                X00147   
               LENGTH=13,                                              X00148   
               POS=(09,19)                                              00149   
*                                                                       00150   
AETAMM  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00151   
               LENGTH=2,                                               X00152   
               COLOR=GREEN,                                            X00153   
               HILIGHT=UNDERLINE,                                      X00154   
               POS=(09,33)                                              00155   
*                                                                       00156   
AETADD  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00157   
               LENGTH=2,                                               X00158   
               COLOR=GREEN,                                            X00159   
               HILIGHT=UNDERLINE,                                      X00160   
               POS=(09,36)                                              00161   
*                                                                       00162   
AETAYY  DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00163   
               LENGTH=4,                                               X00164   
               COLOR=GREEN,                                            X00165   
               HILIGHT=UNDERLINE,                                      X00166   
               POS=(09,39)                                              00167   
*                                                                       00168   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00169   
               INITIAL=' ',                                            X00170   
               LENGTH=1,                                               X00171   
               POS=(09,44)                                              00172   
*                                                                       00173   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00174   
               INITIAL='ETA TO......:',                                X00175   
               LENGTH=13,                                              X00176   
               POS=(10,19)                                              00177   
*                                                                       00178   
ATOMM   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00179   
               LENGTH=2,                                               X00180   
               COLOR=GREEN,                                            X00181   
               HILIGHT=UNDERLINE,                                      X00182   
               POS=(10,33)                                              00183   
*                                                                       00184   
ATODD   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00185   
               LENGTH=2,                                               X00186   
               COLOR=GREEN,                                            X00187   
               HILIGHT=UNDERLINE,                                      X00188   
               POS=(10,36)                                              00189   
*                                                                       00190   
ATOYY   DFHMDF ATTRB=(UNPROT,NORM,NUM),                                X00191   
               LENGTH=4,                                               X00192   
               COLOR=GREEN,                                            X00193   
               HILIGHT=UNDERLINE,                                      X00194   
               POS=(10,39)                                              00195   
*                                                                       00196   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00197   
               INITIAL=' ',                                            X00198   
               LENGTH=1,                                               X00199   
               POS=(10,44)                                              00200   
*                                                                       00201   
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00202   
               INITIAL='TRAILER NO..:',                                X00203   
               LENGTH=13,                                              X00204   
               POS=(11,19)                                              00205   
*                                                                       00206   
AVEHNO  DFHMDF ATTRB=(UNPROT,NORM),                                    X00207   
               LENGTH=10,                                              X00208   
               COLOR=GREEN,                                            X00209   
               HILIGHT=UNDERLINE,                                      X00210   
               POS=(11,33)                                              00211   
*                                                                       00212   
        DFHMDF ATTRB=(ASKIP,DRK),                                      X00213   
               INITIAL=' ',                                            X00214   
               LENGTH=1,                                               X00215   
               POS=(11,44)                                              00216   
*                                                                       00217   
        DFHMSD TYPE=FINAL                                               00218   
        END                                                             00219   
