  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM301                                            *   00004   
*        MAP     TR301A                                             *   00005   
*        PROGRAM TRKCS301                                           *   00006   
*        TRANSID Y301                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM301 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR301A  DFHMDI LINE=2,                                                 X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
********************************************************************            
*       HEADINGS                                                                
********************************************************************            
        DFHMDF ATTRB=(ASKIP,NORM),                                     X00039   
               INITIAL='CONT:',                                        X00040   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(02,02)                                              00043   
ACNTNR  DFHMDF ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               LENGTH=12,                                              X00046   
               POS=(02,08)                                              00047   
********************************************************************            
********************************************************************            
********TO/FROM                                                                 
********************************************************************            
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM,IC),       X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=1,                                               X00042   
               POS=(02,74)                                              00043   
********************************************************************            
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=07,                                              X00042   
               POS=(05,58),                                            X00043   
               INITIAL='CURRENT'                                        00039   
********************************************************************            
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=12,                                              X00042   
               POS=(06,04),                                            X00043   
               INITIAL='DATA CHANGED'                                   00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=06,                                              X00042   
               POS=(06,25),                                            X00043   
               INITIAL='USERID'                                         00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(06,35),                                            X00043   
               INITIAL='DATE'                                           00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(06,42),                                            X00043   
               INITIAL='TIME'                                           00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=08,                                              X00042   
               POS=(06,58),                                            X00043   
               INITIAL='PREVIOUS'                                       00039   
********************************************************************            
********LIST ITEM AREA                                                          
********************************************************************            
********************************************************************            
ADATA1  DFHMDF POS=(07,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER1  DFHMDF POS=(07,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE1  DFHMDF POS=(07,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME1  DFHMDF POS=(07,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL1   DFHMDF POS=(07,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA2  DFHMDF POS=(08,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER2  DFHMDF POS=(08,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE2  DFHMDF POS=(08,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME2  DFHMDF POS=(08,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL2   DFHMDF POS=(08,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA3  DFHMDF POS=(09,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER3  DFHMDF POS=(09,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE3  DFHMDF POS=(09,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME3  DFHMDF POS=(09,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL3   DFHMDF POS=(09,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA4  DFHMDF POS=(10,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER4  DFHMDF POS=(10,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE4  DFHMDF POS=(10,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME4  DFHMDF POS=(10,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL4   DFHMDF POS=(10,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA5  DFHMDF POS=(11,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER5  DFHMDF POS=(11,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE5  DFHMDF POS=(11,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME5  DFHMDF POS=(11,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL5   DFHMDF POS=(11,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA6  DFHMDF POS=(12,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER6  DFHMDF POS=(12,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE6  DFHMDF POS=(12,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME6  DFHMDF POS=(12,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL6   DFHMDF POS=(12,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA7  DFHMDF POS=(13,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER7  DFHMDF POS=(13,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE7  DFHMDF POS=(13,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME7  DFHMDF POS=(13,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL7   DFHMDF POS=(13,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA8  DFHMDF POS=(14,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER8  DFHMDF POS=(14,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE8  DFHMDF POS=(14,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME8  DFHMDF POS=(14,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL8   DFHMDF POS=(14,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA9  DFHMDF POS=(15,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER9  DFHMDF POS=(15,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE9  DFHMDF POS=(15,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME9  DFHMDF POS=(15,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL9   DFHMDF POS=(15,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA10 DFHMDF POS=(16,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER10 DFHMDF POS=(16,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE10 DFHMDF POS=(16,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME10 DFHMDF POS=(16,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL10  DFHMDF POS=(16,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA11 DFHMDF POS=(17,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER11 DFHMDF POS=(17,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE11 DFHMDF POS=(17,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME11 DFHMDF POS=(17,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL11  DFHMDF POS=(17,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
ADATA12 DFHMDF POS=(18,02),LENGTH=20,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AUSER12 DFHMDF POS=(18,24),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE12 DFHMDF POS=(18,33),LENGTH=08,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME12 DFHMDF POS=(18,42),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
AVAL12  DFHMDF POS=(18,49),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
