  PRINT  NOGEN                                                          00001   
*-------------------------------------------------------------------*   00002   
*                                                                   *   00003   
*        MAPSET  TRKM307                                            *   00004   
*        MAP     TR307A                                             *   00005   
*        PROGRAM TRKCS307                                           *   00006   
*        TRANSID Y307                                               *   00007   
*                                                                   *   00009   
*-------------------------------------------------------------------*   00010   
TRKM307 DFHMSD TYPE=DSECT,                                             X00011   
               LANG=COBOL,                                             X00012   
               MODE=INOUT,                                             X00013   
               STORAGE=AUTO,                                           X00014   
               TIOAPFX=YES,                                            X00015   
               TERM=3270-2                                              00016   
TR307A  DFHMDI LINE=2,                                                 X00017   
               COLUMN=01,                                              X        
               SIZE=(19,80),                                           X00018   
               CTRL=(FREEKB),                                          X00019   
               MAPATTS=(COLOR,HILIGHT),                                X00020   
               DSATTS=(COLOR,HILIGHT)                                   00021   
********************************************************************            
********TO/FROM                                                                 
********************************************************************            
        DFHMDF POS=(02,44),LENGTH=05,ATTRB=(ASKIP,NORM),               X00025   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00026   
ASTRTIT DFHMDF POS=(02,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM,IC),       X00027   
               COLOR=GREEN,                                            X00028   
               HILIGHT=UNDERLINE,                                      X00029   
               PICIN='99999',                                          X        
               PICOUT='ZZZZ9'                                           00030   
        DFHMDF POS=(02,56),LENGTH=02,ATTRB=(ASKIP,NORM),               X00031   
               COLOR=NEUTRAL,                                          X00032   
               INITIAL='TO'                                             00033   
AENDIT  DFHMDF POS=(02,59),LENGTH=05,ATTRB=(ASKIP,NORM),               X00034   
               COLOR=BLUE,                                             X00035   
               PICOUT='ZZZZ9'                                           00036   
        DFHMDF POS=(02,65),LENGTH=02,ATTRB=(ASKIP,NORM),               X00037   
               COLOR=NEUTRAL,                                          X00038   
               INITIAL='OF'                                             00039   
ATOTIT  DFHMDF POS=(02,68),LENGTH=05,ATTRB=(ASKIP,NORM),               X00040   
               COLOR=BLUE,                                             X00041   
               PICOUT='ZZZZ9'                                           00042   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=1,                                               X00042   
               POS=(02,74)                                              00043   
********************************************************************            
*       HEADINGS                                                                
********************************************************************            
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=05,                                              X00042   
               POS=(05,05),                                            X00043   
               INITIAL='ENTRY'                                          00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=03,                                              X00042   
               POS=(05,16),                                            X00043   
               INITIAL='TYP'                                            00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(05,21),                                            X00043   
               INITIAL='DATE'                                           00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=04,                                              X00042   
               POS=(05,28),                                            X00043   
               INITIAL='TIME'                                           00039   
        DFHMDF ATTRB=(ASKIP),                                          X00039   
               COLOR=NEUTRAL,                                          X00041   
               LENGTH=17,                                              X00042   
               POS=(05,41),                                            X00043   
               INITIAL='ENTRY DESCRIPTION'                              00039   
********************************************************************            
********LIST ITEM AREA                                                          
********************************************************************            
********************************************************************            
AENTR1  DFHMDF POS=(06,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE1  DFHMDF POS=(06,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE1  DFHMDF POS=(06,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME1  DFHMDF POS=(06,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC1  DFHMDF POS=(06,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR2  DFHMDF POS=(07,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE2  DFHMDF POS=(07,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE2  DFHMDF POS=(07,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME2  DFHMDF POS=(07,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC2  DFHMDF POS=(07,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR3  DFHMDF POS=(08,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE3  DFHMDF POS=(08,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE3  DFHMDF POS=(08,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME3  DFHMDF POS=(08,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC3  DFHMDF POS=(08,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR4  DFHMDF POS=(09,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE4  DFHMDF POS=(09,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE4  DFHMDF POS=(09,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME4  DFHMDF POS=(09,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC4  DFHMDF POS=(09,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR5  DFHMDF POS=(10,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE5  DFHMDF POS=(10,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE5  DFHMDF POS=(10,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME5  DFHMDF POS=(10,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC5  DFHMDF POS=(10,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR6  DFHMDF POS=(11,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE6  DFHMDF POS=(11,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE6  DFHMDF POS=(11,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME6  DFHMDF POS=(11,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC6  DFHMDF POS=(11,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR7  DFHMDF POS=(12,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE7  DFHMDF POS=(12,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE7  DFHMDF POS=(12,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME7  DFHMDF POS=(12,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC7  DFHMDF POS=(12,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR8  DFHMDF POS=(13,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE8  DFHMDF POS=(13,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE8  DFHMDF POS=(13,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME8  DFHMDF POS=(13,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC8  DFHMDF POS=(13,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR9  DFHMDF POS=(14,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE9  DFHMDF POS=(14,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE9  DFHMDF POS=(14,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME9  DFHMDF POS=(14,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC9  DFHMDF POS=(14,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR10 DFHMDF POS=(15,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE10 DFHMDF POS=(15,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE10 DFHMDF POS=(15,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME10 DFHMDF POS=(15,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC10 DFHMDF POS=(15,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR11 DFHMDF POS=(16,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE11 DFHMDF POS=(16,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE11 DFHMDF POS=(16,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME11 DFHMDF POS=(16,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC11 DFHMDF POS=(16,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
********************************************************************            
AENTR12 DFHMDF POS=(17,02),LENGTH=12,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATYPE12 DFHMDF POS=(17,17),LENGTH=01,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADATE12 DFHMDF POS=(17,21),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ATIME12 DFHMDF POS=(17,28),LENGTH=05,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
ADESC12 DFHMDF POS=(17,35),LENGTH=30,ATTRB=(ASKIP,NORM),               X00083   
               COLOR=BLUE                                               00085   
*                                                                       00304   
        DFHMSD TYPE=FINAL                                               00305   
        END                                                             00307   
