*          DATA SET TRKM142    AT LEVEL 001 AS OF 05/17/95                      
*          DATA SET TRKM142    AT LEVEL 001 AS OF 05/11/95              00001   
*          DATA SET TRKM142    AT LEVEL 011 AS OF 06/02/94              00002   
*          DATA SET TRKM142    AT LEVEL 005 AS OF 02/14/94              00003   
  PRINT  NOGEN                                                          00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  TRKM142                                            *   00007   
*        MAP     TR142A                                             *   00008   
*        PROGRAM TRKCS142                                           *   00009   
*        TRANSID Y142                                               *   00010   
*        SYSTEM  CICS ARCH - TRAFFIC RECEIVER LIST                  *   00011   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
TRKM142 DFHMSD TYPE=DSECT,                                             X00014   
               LANG=COBOL,                                             X00015   
               MODE=INOUT,                                             X00016   
               STORAGE=AUTO,                                           X00017   
               TIOAPFX=YES,                                            X00018   
               TERM=3270-2                                              00019   
TR142A  DFHMDI LINE=2,COLUMN=1,                                        X00020   
               SIZE=(19,80),                                           X00021   
               CTRL=(FREEKB),                                          X00022   
               MAPATTS=(COLOR,HILIGHT),                                X00023   
               DSATTS=(COLOR,HILIGHT)                                   00024   
*                                                                       00025   
        DFHMDF POS=(03,44),                                            X00026   
               LENGTH=05,                                              X00027   
               ATTRB=(ASKIP,NORM),                                     X00028   
               COLOR=NEUTRAL,                                          X00029   
               INITIAL='ITEMS'                                          00030   
ASTRTIT DFHMDF POS=(03,50),                                            X00031   
               LENGTH=07,                                              X00032   
               ATTRB=(UNPROT,NORM),                                    X00033   
               COLOR=GREEN,                                            X00034   
               HILIGHT=UNDERLINE,                                      X00035   
               PICOUT='ZZZ,ZZ9'                                         00036   
        DFHMDF POS=(03,58),                                            X00037   
               LENGTH=02,                                              X00038   
               ATTRB=(ASKIP,NORM),                                     X00039   
               COLOR=NEUTRAL,                                          X00040   
               INITIAL='TO'                                             00041   
AENDIT  DFHMDF POS=(03,61),                                            X00042   
               LENGTH=07,                                              X00043   
               ATTRB=(ASKIP,NORM),                                     X00044   
               COLOR=BLUE,                                             X00045   
               PICOUT='ZZZ,ZZ9'                                         00046   
        DFHMDF POS=(03,69),                                            X00047   
               LENGTH=02,                                              X00048   
               ATTRB=(ASKIP,NORM),                                     X00049   
               COLOR=NEUTRAL,                                          X00050   
               INITIAL='OF'                                             00051   
ATOTIT  DFHMDF POS=(03,72),                                            X00052   
               LENGTH=07,                                              X00053   
               ATTRB=(ASKIP,NORM),                                     X00054   
               COLOR=BLUE,                                             X00055   
               PICOUT='ZZZ,ZZ9'                                         00056   
*                                                                       00057   
        DFHMDF POS=(05,04),                                            X00058   
               LENGTH=13,                                              X00059   
               ATTRB=(ASKIP,NORM),                                     X00060   
               COLOR=NEUTRAL,                                          X00061   
               INITIAL='FREIGHT BILL:'                                  00062   
APRO    DFHMDF POS=(05,18),                                            X00063   
               LENGTH=22,                                              X00064   
               ATTRB=(ASKIP,NORM),                                     X00065   
               COLOR=BLUE                                               00066   
        DFHMDF POS=(05,41),                                            X00067   
               LENGTH=08,                                              X00068   
               ATTRB=(ASKIP,NORM),                                     X00069   
               COLOR=NEUTRAL,                                          X00070   
               INITIAL='CARRIER:'                                       00071   
ASCAC   DFHMDF POS=(05,50),                                            X00072   
               LENGTH=04,                                              X00073   
               ATTRB=(ASKIP,NORM),                                     X00074   
               COLOR=BLUE                                               00075   
        DFHMDF POS=(05,57),                                            X00076   
               LENGTH=08,                                              X00077   
               ATTRB=(ASKIP,NORM),                                     X00078   
               COLOR=NEUTRAL,                                          X00079   
               INITIAL='TRAILER:'                                       00080   
ATRLR   DFHMDF POS=(05,66),                                            X00081   
               LENGTH=10,                                              X00082   
               ATTRB=(ASKIP,NORM),                                     X00083   
               COLOR=BLUE                                               00084   
*                                                                       00085   
        DFHMDF POS=(06,04),                                            X00086   
               LENGTH=16,                                              X00087   
               ATTRB=(ASKIP,NORM),                                     X00088   
               COLOR=NEUTRAL,                                          X00089   
               INITIAL='FREIGHT CHARGES:'                               00090   
AFCHG   DFHMDF POS=(06,21),                                            X00091   
               LENGTH=09,                                              X00092   
               ATTRB=(ASKIP,NORM),                                     X00093   
               COLOR=BLUE,                                             X00094   
               PICOUT='ZZZZZ9.99'                                       00095   
        DFHMDF POS=(06,41),                                            X00096   
               LENGTH=08,                                              X00097   
               ATTRB=(ASKIP,NORM),                                     X00098   
               COLOR=NEUTRAL,                                          X00099   
               INITIAL='TERMS..:'                                       00100   
ATERM   DFHMDF POS=(06,50),                                            X00101   
               LENGTH=04,                                              X00102   
               ATTRB=(ASKIP,NORM),                                     X00103   
               COLOR=BLUE                                               00104   
        DFHMDF POS=(06,57),                                            X00105   
               LENGTH=08,                                              X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               COLOR=NEUTRAL,                                          X00108   
               INITIAL='WEIGHT.:'                                       00109   
AWGHT   DFHMDF POS=(06,66),                                            X00110   
               LENGTH=06,                                              X00111   
               ATTRB=(ASKIP,NORM),                                     X00112   
               COLOR=BLUE,                                             X00113   
               PICOUT='ZZZZZ9'                                          00114   
*                                                                       00115   
        DFHMDF POS=(08,04),                                            X00116   
               LENGTH=30,                                              X00117   
               ATTRB=(ASKIP,BRT),                                      X00118   
               INITIAL='PO         RCV  OLD RCVR  RCVR'                 00119   
        DFHMDF POS=(08,45),                                            X00120   
               LENGTH=23,                                              X00121   
               ATTRB=(ASKIP,BRT),                                      X00122   
               INITIAL='CARTON  ADJSTD  DAMAGED'                        00123   
*                                                                       00124   
        DFHMDF POS=(09,02),                                            X00125   
               LENGTH=41,                                              X00126   
               ATTRB=(ASKIP,BRT),                                      X00127   
               INITIAL='NUMBER   DC  SEQ  NUMBER    STAT DEPT  CL'      00128   
        DFHMDF POS=(09,45),                                            X00129   
               LENGTH=32,                                              X00130   
               ATTRB=(ASKIP,BRT),                                      X00131   
               INITIAL='COUNT   COUNT   CARTONS  CHARGES'               00132   
*                                                                       00133   
*                                                                       00134   
APO1    DFHMDF POS=(10,01),                                            X00135   
               LENGTH=08,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ADC1    DFHMDF POS=(10,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR1  DFHMDF POS=(10,15),                                            X00139   
               LENGTH=04,                                              X00140   
               ATTRB=(ASKIP,NORM),                                     X00141   
               COLOR=BLUE                                               00142   
AORCV1  DFHMDF POS=(10,20),                                            X00143   
               LENGTH=09,                                              X00144   
               ATTRB=(ASKIP,NORM),                                     X00145   
               COLOR=BLUE                                               00146   
ASTAT1  DFHMDF POS=(10,31),                                            X00147   
               LENGTH=02,                                              X00148   
               ATTRB=(ASKIP,NORM),                                     X00149   
               COLOR=BLUE                                               00150   
ADEPT1  DFHMDF POS=(10,35),                                            X00151   
               LENGTH=04,                                              X00152   
               ATTRB=(ASKIP,NORM),                                     X00153   
               COLOR=BLUE                                               00154   
ACLAS1  DFHMDF POS=(10,40),                                            X00151   
               LENGTH=04,                                              X00152   
               ATTRB=(ASKIP,NORM),                                     X00153   
               COLOR=BLUE                                               00154   
ACTNS1  DFHMDF POS=(10,47),                                            X00155   
               LENGTH=04,                                              X00156   
               ATTRB=(ASKIP,NORM),                                     X00157   
               COLOR=BLUE,                                             X00158   
               PICOUT='ZZZ9'                                            00159   
AADJ1   DFHMDF POS=(10,55),                                            X00160   
               LENGTH=04,                                              X00161   
               ATTRB=(ASKIP,NORM),                                     X00162   
               COLOR=BLUE,                                             X00163   
               PICOUT='ZZZ9'                                            00164   
ADMG1   DFHMDF POS=(10,64),                                            X00165   
               LENGTH=04,                                              X00166   
               ATTRB=(ASKIP,NORM),                                     X00167   
               COLOR=BLUE,                                             X00168   
               PICOUT='ZZZ9'                                            00169   
ACHG1   DFHMDF POS=(10,71),                                            X00170   
               LENGTH=08,                                              X00171   
               ATTRB=(ASKIP,NORM),                                     X00172   
               COLOR=BLUE,                                             X00173   
               PICOUT='ZZZZ9.99'                                        00174   
*                                                                       00175   
APO2    DFHMDF POS=(11,01),                                            X00176   
               LENGTH=08,                                              X00177   
               ATTRB=(ASKIP,NORM),                                     X00178   
               COLOR=BLUE                                               00179   
ADC2    DFHMDF POS=(11,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR2  DFHMDF POS=(11,15),                                            X00180   
               LENGTH=04,                                              X00181   
               ATTRB=(ASKIP,NORM),                                     X00182   
               COLOR=BLUE                                               00183   
AORCV2  DFHMDF POS=(11,20),                                            X00184   
               LENGTH=09,                                              X00185   
               ATTRB=(ASKIP,NORM),                                     X00186   
               COLOR=BLUE                                               00187   
ASTAT2  DFHMDF POS=(11,31),                                            X00188   
               LENGTH=02,                                              X00189   
               ATTRB=(ASKIP,NORM),                                     X00190   
               COLOR=BLUE                                               00191   
ADEPT2  DFHMDF POS=(11,35),                                            X00192   
               LENGTH=04,                                              X00193   
               ATTRB=(ASKIP,NORM),                                     X00194   
               COLOR=BLUE                                               00195   
ACLAS2  DFHMDF POS=(11,40),                                            X00192   
               LENGTH=04,                                              X00193   
               ATTRB=(ASKIP,NORM),                                     X00194   
               COLOR=BLUE                                               00195   
ACTNS2  DFHMDF POS=(11,47),                                            X00196   
               LENGTH=04,                                              X00197   
               ATTRB=(ASKIP,NORM),                                     X00198   
               COLOR=BLUE,                                             X00199   
               PICOUT='ZZZ9'                                            00200   
AADJ2   DFHMDF POS=(11,55),                                            X00201   
               LENGTH=04,                                              X00202   
               ATTRB=(ASKIP,NORM),                                     X00203   
               COLOR=BLUE,                                             X00204   
               PICOUT='ZZZ9'                                            00205   
ADMG2   DFHMDF POS=(11,64),                                            X00206   
               LENGTH=04,                                              X00207   
               ATTRB=(ASKIP,NORM),                                     X00208   
               COLOR=BLUE,                                             X00209   
               PICOUT='ZZZ9'                                            00210   
ACHG2   DFHMDF POS=(11,71),                                            X00211   
               LENGTH=08,                                              X00212   
               ATTRB=(ASKIP,NORM),                                     X00213   
               COLOR=BLUE,                                             X00214   
               PICOUT='ZZZZ9.99'                                        00215   
*                                                                       00216   
APO3    DFHMDF POS=(12,01),                                            X00217   
               LENGTH=08,                                              X00218   
               ATTRB=(ASKIP,NORM),                                     X00219   
               COLOR=BLUE                                               00220   
ADC3    DFHMDF POS=(12,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR3  DFHMDF POS=(12,15),                                            X00221   
               LENGTH=04,                                              X00222   
               ATTRB=(ASKIP,NORM),                                     X00223   
               COLOR=BLUE                                               00224   
AORCV3  DFHMDF POS=(12,20),                                            X00225   
               LENGTH=09,                                              X00226   
               ATTRB=(ASKIP,NORM),                                     X00227   
               COLOR=BLUE                                               00228   
ASTAT3  DFHMDF POS=(12,31),                                            X00229   
               LENGTH=02,                                              X00230   
               ATTRB=(ASKIP,NORM),                                     X00231   
               COLOR=BLUE                                               00232   
ADEPT3  DFHMDF POS=(12,35),                                            X00233   
               LENGTH=04,                                              X00234   
               ATTRB=(ASKIP,NORM),                                     X00235   
               COLOR=BLUE                                               00236   
ACLAS3  DFHMDF POS=(12,40),                                            X00233   
               LENGTH=04,                                              X00234   
               ATTRB=(ASKIP,NORM),                                     X00235   
               COLOR=BLUE                                               00236   
ACTNS3  DFHMDF POS=(12,47),                                            X00237   
               LENGTH=04,                                              X00238   
               ATTRB=(ASKIP,NORM),                                     X00239   
               COLOR=BLUE,                                             X00240   
               PICOUT='ZZZ9'                                            00241   
AADJ3   DFHMDF POS=(12,55),                                            X00242   
               LENGTH=04,                                              X00243   
               ATTRB=(ASKIP,NORM),                                     X00244   
               COLOR=BLUE,                                             X00245   
               PICOUT='ZZZ9'                                            00246   
ADMG3   DFHMDF POS=(12,64),                                            X00247   
               LENGTH=04,                                              X00248   
               ATTRB=(ASKIP,NORM),                                     X00249   
               COLOR=BLUE,                                             X00250   
               PICOUT='ZZZ9'                                            00251   
ACHG3   DFHMDF POS=(12,71),                                            X00252   
               LENGTH=08,                                              X00253   
               ATTRB=(ASKIP,NORM),                                     X00254   
               COLOR=BLUE,                                             X00255   
               PICOUT='ZZZZ9.99'                                        00256   
*                                                                       00257   
APO4    DFHMDF POS=(13,01),                                            X00258   
               LENGTH=08,                                              X00259   
               ATTRB=(ASKIP,NORM),                                     X00260   
               COLOR=BLUE                                               00261   
ADC4    DFHMDF POS=(13,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR4  DFHMDF POS=(13,15),                                            X00262   
               LENGTH=04,                                              X00263   
               ATTRB=(ASKIP,NORM),                                     X00264   
               COLOR=BLUE                                               00265   
AORCV4  DFHMDF POS=(13,20),                                            X00266   
               LENGTH=09,                                              X00267   
               ATTRB=(ASKIP,NORM),                                     X00268   
               COLOR=BLUE                                               00269   
ASTAT4  DFHMDF POS=(13,31),                                            X00270   
               LENGTH=02,                                              X00271   
               ATTRB=(ASKIP,NORM),                                     X00272   
               COLOR=BLUE                                               00273   
ADEPT4  DFHMDF POS=(13,35),                                            X00274   
               LENGTH=04,                                              X00275   
               ATTRB=(ASKIP,NORM),                                     X00276   
               COLOR=BLUE                                               00277   
ACLAS4  DFHMDF POS=(13,40),                                            X00274   
               LENGTH=04,                                              X00275   
               ATTRB=(ASKIP,NORM),                                     X00276   
               COLOR=BLUE                                               00277   
ACTNS4  DFHMDF POS=(13,47),                                            X00278   
               LENGTH=04,                                              X00279   
               ATTRB=(ASKIP,NORM),                                     X00280   
               COLOR=BLUE,                                             X00281   
               PICOUT='ZZZ9'                                            00282   
AADJ4   DFHMDF POS=(13,55),                                            X00283   
               LENGTH=04,                                              X00284   
               ATTRB=(ASKIP,NORM),                                     X00285   
               COLOR=BLUE,                                             X00286   
               PICOUT='ZZZ9'                                            00287   
ADMG4   DFHMDF POS=(13,64),                                            X00288   
               LENGTH=04,                                              X00289   
               ATTRB=(ASKIP,NORM),                                     X00290   
               COLOR=BLUE,                                             X00291   
               PICOUT='ZZZ9'                                            00292   
ACHG4   DFHMDF POS=(13,71),                                            X00293   
               LENGTH=08,                                              X00294   
               ATTRB=(ASKIP,NORM),                                     X00295   
               COLOR=BLUE,                                             X00296   
               PICOUT='ZZZZ9.99'                                        00297   
*                                                                       00298   
APO5    DFHMDF POS=(14,01),                                            X00299   
               LENGTH=08,                                              X00300   
               ATTRB=(ASKIP,NORM),                                     X00301   
               COLOR=BLUE                                               00302   
ADC5    DFHMDF POS=(14,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR5  DFHMDF POS=(14,15),                                            X00303   
               LENGTH=04,                                              X00304   
               ATTRB=(ASKIP,NORM),                                     X00305   
               COLOR=BLUE                                               00306   
AORCV5  DFHMDF POS=(14,20),                                            X00307   
               LENGTH=09,                                              X00308   
               ATTRB=(ASKIP,NORM),                                     X00309   
               COLOR=BLUE                                               00310   
ASTAT5  DFHMDF POS=(14,31),                                            X00311   
               LENGTH=02,                                              X00312   
               ATTRB=(ASKIP,NORM),                                     X00313   
               COLOR=BLUE                                               00314   
ADEPT5  DFHMDF POS=(14,35),                                            X00315   
               LENGTH=04,                                              X00316   
               ATTRB=(ASKIP,NORM),                                     X00317   
               COLOR=BLUE                                               00318   
ACLAS5  DFHMDF POS=(14,40),                                            X00315   
               LENGTH=04,                                              X00316   
               ATTRB=(ASKIP,NORM),                                     X00317   
               COLOR=BLUE                                               00318   
ACTNS5  DFHMDF POS=(14,47),                                            X00319   
               LENGTH=04,                                              X00320   
               ATTRB=(ASKIP,NORM),                                     X00321   
               COLOR=BLUE,                                             X00322   
               PICOUT='ZZZ9'                                            00323   
AADJ5   DFHMDF POS=(14,55),                                            X00324   
               LENGTH=04,                                              X00325   
               ATTRB=(ASKIP,NORM),                                     X00326   
               COLOR=BLUE,                                             X00327   
               PICOUT='ZZZ9'                                            00328   
ADMG5   DFHMDF POS=(14,64),                                            X00329   
               LENGTH=04,                                              X00330   
               ATTRB=(ASKIP,NORM),                                     X00331   
               COLOR=BLUE,                                             X00332   
               PICOUT='ZZZ9'                                            00333   
ACHG5   DFHMDF POS=(14,71),                                            X00334   
               LENGTH=08,                                              X00335   
               ATTRB=(ASKIP,NORM),                                     X00336   
               COLOR=BLUE,                                             X00337   
               PICOUT='ZZZZ9.99'                                        00338   
*                                                                       00339   
APO6    DFHMDF POS=(15,01),                                            X00340   
               LENGTH=08,                                              X00341   
               ATTRB=(ASKIP,NORM),                                     X00342   
               COLOR=BLUE                                               00343   
ADC6    DFHMDF POS=(15,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR6  DFHMDF POS=(15,15),                                            X00344   
               LENGTH=04,                                              X00345   
               ATTRB=(ASKIP,NORM),                                     X00346   
               COLOR=BLUE                                               00347   
AORCV6  DFHMDF POS=(15,20),                                            X00348   
               LENGTH=09,                                              X00349   
               ATTRB=(ASKIP,NORM),                                     X00350   
               COLOR=BLUE                                               00351   
ASTAT6  DFHMDF POS=(15,31),                                            X00352   
               LENGTH=02,                                              X00353   
               ATTRB=(ASKIP,NORM),                                     X00354   
               COLOR=BLUE                                               00355   
ADEPT6  DFHMDF POS=(15,35),                                            X00356   
               LENGTH=04,                                              X00357   
               ATTRB=(ASKIP,NORM),                                     X00358   
               COLOR=BLUE                                               00359   
ACLAS6  DFHMDF POS=(15,40),                                            X00356   
               LENGTH=04,                                              X00357   
               ATTRB=(ASKIP,NORM),                                     X00358   
               COLOR=BLUE                                               00359   
ACTNS6  DFHMDF POS=(15,47),                                            X00360   
               LENGTH=04,                                              X00361   
               ATTRB=(ASKIP,NORM),                                     X00362   
               COLOR=BLUE,                                             X00363   
               PICOUT='ZZZ9'                                            00364   
AADJ6   DFHMDF POS=(15,55),                                            X00365   
               LENGTH=04,                                              X00366   
               ATTRB=(ASKIP,NORM),                                     X00367   
               COLOR=BLUE,                                             X00368   
               PICOUT='ZZZ9'                                            00369   
ADMG6   DFHMDF POS=(15,64),                                            X00370   
               LENGTH=04,                                              X00371   
               ATTRB=(ASKIP,NORM),                                     X00372   
               COLOR=BLUE,                                             X00373   
               PICOUT='ZZZ9'                                            00374   
ACHG6   DFHMDF POS=(15,71),                                            X00375   
               LENGTH=08,                                              X00376   
               ATTRB=(ASKIP,NORM),                                     X00377   
               COLOR=BLUE,                                             X00378   
               PICOUT='ZZZZ9.99'                                        00379   
*                                                                       00380   
APO7    DFHMDF POS=(16,01),                                            X00381   
               LENGTH=08,                                              X00382   
               ATTRB=(ASKIP,NORM),                                     X00383   
               COLOR=BLUE                                               00384   
ADC7    DFHMDF POS=(16,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR7  DFHMDF POS=(16,15),                                            X00385   
               LENGTH=04,                                              X00386   
               ATTRB=(ASKIP,NORM),                                     X00387   
               COLOR=BLUE                                               00388   
AORCV7  DFHMDF POS=(16,20),                                            X00389   
               LENGTH=09,                                              X00390   
               ATTRB=(ASKIP,NORM),                                     X00391   
               COLOR=BLUE                                               00392   
ASTAT7  DFHMDF POS=(16,31),                                            X00393   
               LENGTH=02,                                              X00394   
               ATTRB=(ASKIP,NORM),                                     X00395   
               COLOR=BLUE                                               00396   
ADEPT7  DFHMDF POS=(16,35),                                            X00397   
               LENGTH=04,                                              X00398   
               ATTRB=(ASKIP,NORM),                                     X00399   
               COLOR=BLUE                                               00400   
ACLAS7  DFHMDF POS=(16,40),                                            X00397   
               LENGTH=04,                                              X00398   
               ATTRB=(ASKIP,NORM),                                     X00399   
               COLOR=BLUE                                               00400   
ACTNS7  DFHMDF POS=(16,47),                                            X00401   
               LENGTH=04,                                              X00402   
               ATTRB=(ASKIP,NORM),                                     X00403   
               COLOR=BLUE,                                             X00404   
               PICOUT='ZZZ9'                                            00405   
AADJ7   DFHMDF POS=(16,55),                                            X00406   
               LENGTH=04,                                              X00407   
               ATTRB=(ASKIP,NORM),                                     X00408   
               COLOR=BLUE,                                             X00409   
               PICOUT='ZZZ9'                                            00410   
ADMG7   DFHMDF POS=(16,64),                                            X00411   
               LENGTH=04,                                              X00412   
               ATTRB=(ASKIP,NORM),                                     X00413   
               COLOR=BLUE,                                             X00414   
               PICOUT='ZZZ9'                                            00415   
ACHG7   DFHMDF POS=(16,71),                                            X00416   
               LENGTH=08,                                              X00417   
               ATTRB=(ASKIP,NORM),                                     X00418   
               COLOR=BLUE,                                             X00419   
               PICOUT='ZZZZ9.99'                                        00420   
*                                                                       00421   
APO8    DFHMDF POS=(17,01),                                            X00422   
               LENGTH=08,                                              X00423   
               ATTRB=(ASKIP,NORM),                                     X00424   
               COLOR=BLUE                                               00425   
ADC8    DFHMDF POS=(17,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR8  DFHMDF POS=(17,15),                                            X00426   
               LENGTH=04,                                              X00427   
               ATTRB=(ASKIP,NORM),                                     X00428   
               COLOR=BLUE                                               00429   
AORCV8  DFHMDF POS=(17,20),                                            X00430   
               LENGTH=09,                                              X00431   
               ATTRB=(ASKIP,NORM),                                     X00432   
               COLOR=BLUE                                               00433   
ASTAT8  DFHMDF POS=(17,31),                                            X00434   
               LENGTH=02,                                              X00435   
               ATTRB=(ASKIP,NORM),                                     X00436   
               COLOR=BLUE                                               00437   
ADEPT8  DFHMDF POS=(17,35),                                            X00438   
               LENGTH=04,                                              X00439   
               ATTRB=(ASKIP,NORM),                                     X00440   
               COLOR=BLUE                                               00441   
ACLAS8  DFHMDF POS=(17,40),                                            X00438   
               LENGTH=04,                                              X00439   
               ATTRB=(ASKIP,NORM),                                     X00440   
               COLOR=BLUE                                               00441   
ACTNS8  DFHMDF POS=(17,47),                                            X00442   
               LENGTH=04,                                              X00443   
               ATTRB=(ASKIP,NORM),                                     X00444   
               COLOR=BLUE,                                             X00445   
               PICOUT='ZZZ9'                                            00446   
AADJ8   DFHMDF POS=(17,55),                                            X00447   
               LENGTH=04,                                              X00448   
               ATTRB=(ASKIP,NORM),                                     X00449   
               COLOR=BLUE,                                             X00450   
               PICOUT='ZZZ9'                                            00451   
ADMG8   DFHMDF POS=(17,64),                                            X00452   
               LENGTH=04,                                              X00453   
               ATTRB=(ASKIP,NORM),                                     X00454   
               COLOR=BLUE,                                             X00455   
               PICOUT='ZZZ9'                                            00456   
ACHG8   DFHMDF POS=(17,71),                                            X00457   
               LENGTH=08,                                              X00458   
               ATTRB=(ASKIP,NORM),                                     X00459   
               COLOR=BLUE,                                             X00460   
               PICOUT='ZZZZ9.99'                                        00461   
*                                                                       00462   
APO9    DFHMDF POS=(18,01),                                            X00463   
               LENGTH=08,                                              X00464   
               ATTRB=(ASKIP,NORM),                                     X00465   
               COLOR=BLUE                                               00466   
ADC9    DFHMDF POS=(18,10),                                            X00135   
               LENGTH=04,                                              X00136   
               ATTRB=(ASKIP,NORM),                                     X00137   
               COLOR=BLUE                                               00138   
ARCVR9  DFHMDF POS=(18,15),                                            X00467   
               LENGTH=04,                                              X00468   
               ATTRB=(ASKIP,NORM),                                     X00469   
               COLOR=BLUE                                               00470   
AORCV9  DFHMDF POS=(18,20),                                            X00471   
               LENGTH=09,                                              X00472   
               ATTRB=(ASKIP,NORM),                                     X00473   
               COLOR=BLUE                                               00474   
ASTAT9  DFHMDF POS=(18,31),                                            X00475   
               LENGTH=02,                                              X00476   
               ATTRB=(ASKIP,NORM),                                     X00477   
               COLOR=BLUE                                               00478   
ADEPT9  DFHMDF POS=(18,35),                                            X00479   
               LENGTH=04,                                              X00480   
               ATTRB=(ASKIP,NORM),                                     X00481   
               COLOR=BLUE                                               00482   
ACLAS9  DFHMDF POS=(18,40),                                            X00479   
               LENGTH=04,                                              X00480   
               ATTRB=(ASKIP,NORM),                                     X00481   
               COLOR=BLUE                                               00482   
ACTNS9  DFHMDF POS=(18,47),                                            X00483   
               LENGTH=04,                                              X00484   
               ATTRB=(ASKIP,NORM),                                     X00485   
               COLOR=BLUE,                                             X00486   
               PICOUT='ZZZ9'                                            00487   
AADJ9   DFHMDF POS=(18,55),                                            X00488   
               LENGTH=04,                                              X00489   
               ATTRB=(ASKIP,NORM),                                     X00490   
               COLOR=BLUE,                                             X00491   
               PICOUT='ZZZ9'                                            00492   
ADMG9   DFHMDF POS=(18,64),                                            X00493   
               LENGTH=04,                                              X00494   
               ATTRB=(ASKIP,NORM),                                     X00495   
               COLOR=BLUE,                                             X00496   
               PICOUT='ZZZ9'                                            00497   
ACHG9   DFHMDF POS=(18,71),                                            X00498   
               LENGTH=08,                                              X00499   
               ATTRB=(ASKIP,NORM),                                     X00500   
               COLOR=BLUE,                                             X00501   
               PICOUT='ZZZZ9.99'                                        00502   
*                                                                       00503   
        DFHMDF POS=(19,33),                                            X00504   
               LENGTH=06,                                              X00505   
               ATTRB=(ASKIP,NORM),                                     X00506   
               COLOR=NEUTRAL,                                          X00507   
               INITIAL='TOTAL:'                                         00508   
ATCTNS  DFHMDF POS=(19,46),                                            X00509   
               LENGTH=05,                                              X00510   
               ATTRB=(ASKIP,NORM),                                     X00511   
               COLOR=BLUE,                                             X00512   
               PICOUT='ZZZZ9'                                           00513   
ATADJ   DFHMDF POS=(19,54),                                            X00514   
               LENGTH=05,                                              X00515   
               ATTRB=(ASKIP,NORM),                                     X00516   
               COLOR=BLUE,                                             X00517   
               PICOUT='ZZZZ9'                                           00518   
ATDMG   DFHMDF POS=(19,63),                                            X00519   
               LENGTH=05,                                              X00520   
               ATTRB=(ASKIP,NORM),                                     X00521   
               COLOR=BLUE,                                             X00522   
               PICOUT='ZZZZ9'                                           00523   
ATCHG   DFHMDF POS=(19,70),                                            X00524   
               LENGTH=09,                                              X00525   
               ATTRB=(ASKIP,NORM),                                     X00526   
               COLOR=BLUE,                                             X00527   
               PICOUT='ZZZZZ9.99'                                       00528   
*                                                                       00529   
         DFHMSD TYPE=FINAL                                              00530   
         END                                                            00531   
