*          DATA SET TRKM120    AT LEVEL 001 AS OF 01/07/94                      
        PRINT  NOGEN                                                    00001   
TRKM120 DFHMSD TYPE=DSECT,                                             C00002   
               LANG=COBOL,                                             C00003   
               MODE=INOUT,                                             C00004   
               STORAGE=AUTO,                                           C00005   
               TERM=3270-2,                                            C00006   
               TIOAPFX=YES                                              00007   
**************                                                          00008   
TR120A  DFHMDI LINE=2,COLUMN=1,                                        C00009**3
               SIZE=(19,80),                                           C00010   
               CTRL=(FREEKB),                                          C00011   
               MAPATTS=(COLOR,HILIGHT),                                C00012   
               DSATTS=(COLOR,HILIGHT)                                   00013   
**************                                                          00014   
        DFHMDF POS=(02,01),LENGTH=05,ATTRB=(ASKIP,NORM),               C00015   
               COLOR=NEUTRAL,INITIAL='OPER:'                            00016   
AOPRNBR DFHMDF POS=(02,07),LENGTH=04,ATTRB=(ASKIP,NORM),               C00017   
               COLOR=BLUE                                                       
AOPRNME DFHMDF POS=(02,12),LENGTH=19,ATTRB=(ASKIP,NORM),               C00017   
               COLOR=BLUE                                                       
        DFHMDF POS=(02,32),LENGTH=03,ATTRB=(ASKIP,NORM),               C00017   
               COLOR=NEUTRAL,INITIAL='PO:'                                      
APONBR  DFHMDF POS=(02,36),LENGTH=09,ATTRB=(ASKIP,NORM),               C00017   
               COLOR=BLUE                                                       
        DFHMDF POS=(02,46),LENGTH=05,ATTRB=(ASKIP,NORM),               C00015   
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00016   
ASTRTIT DFHMDF POS=(02,52),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00017   
               COLOR=GREEN,                                            C00018   
               HILIGHT=UNDERLINE,                                      C00019   
               PICOUT='ZZZZ9'                                           00020   
        DFHMDF POS=(02,58),LENGTH=02,ATTRB=(ASKIP,NORM),               C00021   
               COLOR=NEUTRAL,                                          C00022   
               INITIAL='TO'                                             00023   
AENDIT  DFHMDF POS=(02,61),LENGTH=05,ATTRB=(ASKIP,NORM),               C00024   
               COLOR=BLUE,                                             C00025   
               PICOUT='ZZZZ9'                                           00026   
        DFHMDF POS=(02,67),LENGTH=02,ATTRB=(ASKIP,NORM),               C00027   
               COLOR=NEUTRAL,                                          C00028   
               INITIAL='OF'                                             00029   
ATOTIT  DFHMDF POS=(02,70),LENGTH=05,ATTRB=(ASKIP,NORM),               C00030   
               COLOR=BLUE,                                             C00031   
               PICOUT='ZZZZ9'                                           00032   
*                                                                       00033   
        DFHMDF POS=(03,05),LENGTH=04,ATTRB=(PROT,NORM),                C00034   
               COLOR=NEUTRAL,                                          C00035   
               INITIAL='DELV'                                           00036   
        DFHMDF POS=(03,22),LENGTH=04,ATTRB=(PROT,NORM),                C00034   
               COLOR=NEUTRAL,                                          C00035   
               INITIAL='    '                                           00036   
        DFHMDF POS=(03,38),LENGTH=03,ATTRB=(PROT,NORM),                C00037   
               COLOR=NEUTRAL,                                          C00038   
               INITIAL='F/B'                                            00039   
        DFHMDF POS=(03,43),LENGTH=33,ATTRB=(PROT,NORM),                C00062   
               COLOR=YELLOW,                                           C00063   
               INITIAL='YELLOW:SOME RCVRS NOT TRANSCRIBED'                      
*                                                                               
        DFHMDF POS=(04,01),LENGTH=01,ATTRB=(PROT,NORM),                C00041   
               COLOR=NEUTRAL,                                          C00042   
               INITIAL='S'                                              00043   
        DFHMDF POS=(04,03),LENGTH=01,ATTRB=(PROT,NORM),                C00044   
               COLOR=NEUTRAL,                                          C00045   
               INITIAL='A'                                              00046   
        DFHMDF POS=(04,05),LENGTH=04,ATTRB=(PROT,NORM),                C00047   
               COLOR=NEUTRAL,                                          C00048   
               INITIAL='SCAC'                                           00049   
        DFHMDF POS=(04,10),LENGTH=08,ATTRB=(PROT,NORM),                C00050   
               COLOR=NEUTRAL,                                          C00051   
               INITIAL='ETA DATE'                                       00052   
        DFHMDF POS=(04,19),LENGTH=02,ATTRB=(PROT,NORM),                C00053   
               COLOR=NEUTRAL,                                          C00054   
               INITIAL='ST'                                                     
        DFHMDF POS=(04,22),LENGTH=04,ATTRB=(PROT,NORM),                C00053   
               COLOR=NEUTRAL,                                          C00054   
               INITIAL='OPER'                                                   
        DFHMDF POS=(04,27),LENGTH=08,ATTRB=(PROT,NORM),                C00056   
               COLOR=NEUTRAL,                                          C00057   
               INITIAL='MANIFEST'                                       00058   
        DFHMDF POS=(04,38),LENGTH=04,ATTRB=(PROT,NORM),                C00059   
               COLOR=NEUTRAL,                                          C00060   
               INITIAL='SCAC'                                           00061   
        DFHMDF POS=(04,43),LENGTH=12,ATTRB=(PROT,NORM),                C00062   
               COLOR=NEUTRAL,                                          C00063   
               INITIAL='FREIGHT BILL'                                   00064   
        DFHMDF POS=(04,58),LENGTH=14,ATTRB=(PROT,NORM),                C00065   
               COLOR=NEUTRAL,                                          C00066   
               INITIAL='BILL OF LADING'                                 00067   
*                                                                       00068   
ASEL01  DFHMDF POS=(05,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00069   
               HILIGHT=UNDERLINE,                                      C00070   
               COLOR=GREEN                                              00071   
AACT01  DFHMDF POS=(05,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00073   
               COLOR=BLUE                                               00074   
ADSCA01 DFHMDF POS=(05,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00075   
               COLOR=BLUE                                               00076   
AEDTE01 DFHMDF POS=(05,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00077   
               COLOR=BLUE                                               00078   
ASTAT01 DFHMDF POS=(05,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AOPER01 DFHMDF POS=(05,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST01 DFHMDF POS=(05,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00081   
               COLOR=BLUE                                               00082   
AFSCA01 DFHMDF POS=(05,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00083   
               COLOR=BLUE                                               00084   
AFBIL01 DFHMDF POS=(05,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00085   
               COLOR=BLUE                                               00086   
ABOL01  DFHMDF POS=(05,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00087   
               COLOR=BLUE                                               00088   
*                                                                       00089   
ASEL02  DFHMDF POS=(06,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00090   
               HILIGHT=UNDERLINE,                                      C00091   
               COLOR=GREEN                                              00092   
AACT02  DFHMDF POS=(06,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00094   
               COLOR=BLUE                                               00095   
ADSCA02 DFHMDF POS=(06,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00096   
               COLOR=BLUE                                               00097   
AEDTE02 DFHMDF POS=(06,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00098   
               COLOR=BLUE                                               00099   
ASTAT02 DFHMDF POS=(06,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00100   
               COLOR=BLUE                                               00101   
AOPER02 DFHMDF POS=(06,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST02 DFHMDF POS=(06,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00102   
               COLOR=BLUE                                               00103   
AFSCA02 DFHMDF POS=(06,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00104   
               COLOR=BLUE                                               00105   
AFBIL02 DFHMDF POS=(06,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00106   
               COLOR=BLUE                                               00107   
ABOL02  DFHMDF POS=(06,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00108   
               COLOR=BLUE                                               00109   
*                                                                       00110   
ASEL03  DFHMDF POS=(07,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00111   
               HILIGHT=UNDERLINE,                                      C00112   
               COLOR=GREEN                                              00113   
AACT03  DFHMDF POS=(07,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00115   
               COLOR=BLUE                                               00116   
ADSCA03 DFHMDF POS=(07,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00117   
               COLOR=BLUE                                               00118   
AEDTE03 DFHMDF POS=(07,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00119   
               COLOR=BLUE                                               00120   
ASTAT03 DFHMDF POS=(07,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00121   
               COLOR=BLUE                                               00122   
AOPER03 DFHMDF POS=(07,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST03 DFHMDF POS=(07,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00123   
               COLOR=BLUE                                               00124   
AFSCA03 DFHMDF POS=(07,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00125   
               COLOR=BLUE                                               00126   
AFBIL03 DFHMDF POS=(07,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00127   
               COLOR=BLUE                                               00128   
ABOL03  DFHMDF POS=(07,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00129   
               COLOR=BLUE                                               00130   
*                                                                       00131   
ASEL04  DFHMDF POS=(08,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00132   
               HILIGHT=UNDERLINE,                                      C00133   
               COLOR=GREEN                                              00134   
AACT04  DFHMDF POS=(08,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00136   
               COLOR=BLUE                                               00137   
ADSCA04 DFHMDF POS=(08,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00138   
               COLOR=BLUE                                               00139   
AEDTE04 DFHMDF POS=(08,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00140   
               COLOR=BLUE                                               00141   
ASTAT04 DFHMDF POS=(08,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00142   
               COLOR=BLUE                                               00143   
AOPER04 DFHMDF POS=(08,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST04 DFHMDF POS=(08,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00144   
               COLOR=BLUE                                               00145   
AFSCA04 DFHMDF POS=(08,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00146   
               COLOR=BLUE                                               00147   
AFBIL04 DFHMDF POS=(08,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00148   
               COLOR=BLUE                                               00149   
ABOL04  DFHMDF POS=(08,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00150   
               COLOR=BLUE                                               00151   
*                                                                       00152   
ASEL05  DFHMDF POS=(09,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00153**2
               HILIGHT=UNDERLINE,                                      C00154**2
               COLOR=GREEN                                              00155**2
AACT05  DFHMDF POS=(09,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00157**2
               COLOR=BLUE                                               00158**2
ADSCA05 DFHMDF POS=(09,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00159**2
               COLOR=BLUE                                               00160**2
AEDTE05 DFHMDF POS=(09,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00161**2
               COLOR=BLUE                                               00162**2
ASTAT05 DFHMDF POS=(09,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00163**2
               COLOR=BLUE                                               00164**2
AOPER05 DFHMDF POS=(09,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST05 DFHMDF POS=(09,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00165**2
               COLOR=BLUE                                               00166**2
AFSCA05 DFHMDF POS=(09,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00167**2
               COLOR=BLUE                                               00168**2
AFBIL05 DFHMDF POS=(09,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00169**2
               COLOR=BLUE                                               00170**2
ABOL05  DFHMDF POS=(09,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00171**2
               COLOR=BLUE                                               00172**2
*                                                                       00173**2
ASEL06  DFHMDF POS=(10,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00174**2
               HILIGHT=UNDERLINE,                                      C00175**2
               COLOR=GREEN                                              00176**2
AACT06  DFHMDF POS=(10,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00178**2
               COLOR=BLUE                                               00179**2
ADSCA06 DFHMDF POS=(10,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00180**2
               COLOR=BLUE                                               00181**2
AEDTE06 DFHMDF POS=(10,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00182**2
               COLOR=BLUE                                               00183**2
ASTAT06 DFHMDF POS=(10,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00184**2
               COLOR=BLUE                                               00185**2
AOPER06 DFHMDF POS=(10,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST06 DFHMDF POS=(10,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00186**2
               COLOR=BLUE                                               00187**2
AFSCA06 DFHMDF POS=(10,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00188**2
               COLOR=BLUE                                               00189**2
AFBIL06 DFHMDF POS=(10,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00190**2
               COLOR=BLUE                                               00191**2
ABOL06  DFHMDF POS=(10,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00192**2
               COLOR=BLUE                                               00193**2
*                                                                       00194**2
ASEL07  DFHMDF POS=(11,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00195**2
               HILIGHT=UNDERLINE,                                      C00196**2
               COLOR=GREEN                                              00197**2
AACT07  DFHMDF POS=(11,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00199**2
               COLOR=BLUE                                               00200**2
ADSCA07 DFHMDF POS=(11,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00201**2
               COLOR=BLUE                                               00202**2
AEDTE07 DFHMDF POS=(11,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00203**2
               COLOR=BLUE                                               00204**2
ASTAT07 DFHMDF POS=(11,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00205**2
               COLOR=BLUE                                               00206**2
AOPER07 DFHMDF POS=(11,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST07 DFHMDF POS=(11,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00207**2
               COLOR=BLUE                                               00208**2
AFSCA07 DFHMDF POS=(11,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00209**2
               COLOR=BLUE                                               00210**2
AFBIL07 DFHMDF POS=(11,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00211**2
               COLOR=BLUE                                               00212**2
ABOL07  DFHMDF POS=(11,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00213**2
               COLOR=BLUE                                               00214**2
*                                                                       00215**2
ASEL08  DFHMDF POS=(12,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00216**2
               HILIGHT=UNDERLINE,                                      C00217**2
               COLOR=GREEN                                              00218**2
AACT08  DFHMDF POS=(12,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00220**2
               COLOR=BLUE                                               00221**2
ADSCA08 DFHMDF POS=(12,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00222**2
               COLOR=BLUE                                               00223**2
AEDTE08 DFHMDF POS=(12,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00224**2
               COLOR=BLUE                                               00225**2
ASTAT08 DFHMDF POS=(12,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00226**2
               COLOR=BLUE                                               00227**2
AOPER08 DFHMDF POS=(12,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST08 DFHMDF POS=(12,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00228**2
               COLOR=BLUE                                               00229**2
AFSCA08 DFHMDF POS=(12,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00230**2
               COLOR=BLUE                                               00231**2
AFBIL08 DFHMDF POS=(12,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00232**2
               COLOR=BLUE                                               00233**2
ABOL08  DFHMDF POS=(12,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00234**2
               COLOR=BLUE                                               00235**2
*                                                                       00236**2
ASEL09  DFHMDF POS=(13,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00237**2
               HILIGHT=UNDERLINE,                                      C00238**2
               COLOR=GREEN                                              00239**2
AACT09  DFHMDF POS=(13,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00241**2
               COLOR=BLUE                                               00242**2
ADSCA09 DFHMDF POS=(13,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00243**2
               COLOR=BLUE                                               00244**2
AEDTE09 DFHMDF POS=(13,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00245**2
               COLOR=BLUE                                               00246**2
ASTAT09 DFHMDF POS=(13,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00247**2
               COLOR=BLUE                                               00248**2
AOPER09 DFHMDF POS=(13,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST09 DFHMDF POS=(13,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00249**2
               COLOR=BLUE                                               00250**2
AFSCA09 DFHMDF POS=(13,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00251**2
               COLOR=BLUE                                               00252**2
AFBIL09 DFHMDF POS=(13,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00253**2
               COLOR=BLUE                                               00254**2
ABOL09  DFHMDF POS=(13,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00255**2
               COLOR=BLUE                                               00256**2
*                                                                       00257**2
ASEL10  DFHMDF POS=(14,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00258**2
               HILIGHT=UNDERLINE,                                      C00259**2
               COLOR=GREEN                                              00260**2
AACT10  DFHMDF POS=(14,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00262**2
               COLOR=BLUE                                               00263**2
ADSCA10 DFHMDF POS=(14,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00264**2
               COLOR=BLUE                                               00265**2
AEDTE10 DFHMDF POS=(14,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00266**2
               COLOR=BLUE                                               00267**2
ASTAT10 DFHMDF POS=(14,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00268**2
               COLOR=BLUE                                               00269**2
AOPER10 DFHMDF POS=(14,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST10 DFHMDF POS=(14,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00270**2
               COLOR=BLUE                                               00271**2
AFSCA10 DFHMDF POS=(14,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00272**2
               COLOR=BLUE                                               00273**2
AFBIL10 DFHMDF POS=(14,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00274**2
               COLOR=BLUE                                               00275**2
ABOL10  DFHMDF POS=(14,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00276**2
               COLOR=BLUE                                               00277**2
*                                                                       00278**2
ASEL11  DFHMDF POS=(15,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00279**2
               HILIGHT=UNDERLINE,                                      C00280**2
               COLOR=GREEN                                              00281**2
AACT11  DFHMDF POS=(15,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00283**2
               COLOR=BLUE                                               00284**2
ADSCA11 DFHMDF POS=(15,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00285**2
               COLOR=BLUE                                               00286**2
AEDTE11 DFHMDF POS=(15,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00287**2
               COLOR=BLUE                                               00288**2
ASTAT11 DFHMDF POS=(15,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00289**2
               COLOR=BLUE                                               00290**2
AOPER11 DFHMDF POS=(15,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST11 DFHMDF POS=(15,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00291**2
               COLOR=BLUE                                               00292**2
AFSCA11 DFHMDF POS=(15,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00293**2
               COLOR=BLUE                                               00294**2
AFBIL11 DFHMDF POS=(15,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00295**2
               COLOR=BLUE                                               00296**2
ABOL11  DFHMDF POS=(15,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00297**2
               COLOR=BLUE                                               00298**2
*                                                                       00299**2
ASEL12  DFHMDF POS=(16,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00300**2
               HILIGHT=UNDERLINE,                                      C00301**2
               COLOR=GREEN                                              00302**2
AACT12  DFHMDF POS=(16,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00304**2
               COLOR=BLUE                                               00305**2
ADSCA12 DFHMDF POS=(16,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00306**2
               COLOR=BLUE                                               00307**2
AEDTE12 DFHMDF POS=(16,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00308**2
               COLOR=BLUE                                               00309**2
ASTAT12 DFHMDF POS=(16,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00310**2
               COLOR=BLUE                                               00311**2
AOPER12 DFHMDF POS=(16,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST12 DFHMDF POS=(16,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00312**2
               COLOR=BLUE                                               00313**2
AFSCA12 DFHMDF POS=(16,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00314**2
               COLOR=BLUE                                               00315**2
AFBIL12 DFHMDF POS=(16,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00316**2
               COLOR=BLUE                                               00317**2
ABOL12  DFHMDF POS=(16,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00318**2
               COLOR=BLUE                                               00319**2
*                                                                       00320**2
ASEL13  DFHMDF POS=(17,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00321**2
               HILIGHT=UNDERLINE,                                      C00322**2
               COLOR=GREEN                                              00323**2
AACT13  DFHMDF POS=(17,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00325**2
               COLOR=BLUE                                               00326**2
ADSCA13 DFHMDF POS=(17,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00327**2
               COLOR=BLUE                                               00328**2
AEDTE13 DFHMDF POS=(17,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00329**2
               COLOR=BLUE                                               00330**2
ASTAT13 DFHMDF POS=(17,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00331**2
               COLOR=BLUE                                               00332**2
AOPER13 DFHMDF POS=(17,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST13 DFHMDF POS=(17,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00333**2
               COLOR=BLUE                                               00334**2
AFSCA13 DFHMDF POS=(17,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00335**2
               COLOR=BLUE                                               00336**2
AFBIL13 DFHMDF POS=(17,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00337**2
               COLOR=BLUE                                               00338**2
ABOL13  DFHMDF POS=(17,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00339**2
               COLOR=BLUE                                               00340**2
*                                                                       00341**2
ASEL14  DFHMDF POS=(18,01),LENGTH=01,ATTRB=(UNPROT,NORM),              C00342**2
               HILIGHT=UNDERLINE,                                      C00343**2
               COLOR=GREEN                                              00344**2
AACT14  DFHMDF POS=(18,03),LENGTH=01,ATTRB=(ASKIP,NORM),               C00346**2
               COLOR=BLUE                                               00347**2
ADSCA14 DFHMDF POS=(18,05),LENGTH=04,ATTRB=(ASKIP,NORM),               C00348**2
               COLOR=BLUE                                               00349**2
AEDTE14 DFHMDF POS=(18,10),LENGTH=08,ATTRB=(ASKIP,NORM),               C00350**2
               COLOR=BLUE                                               00351**2
ASTAT14 DFHMDF POS=(18,19),LENGTH=02,ATTRB=(ASKIP,NORM),               C00352**2
               COLOR=BLUE                                               00353**2
AOPER14 DFHMDF POS=(18,22),LENGTH=04,ATTRB=(ASKIP,NORM),               C00079   
               COLOR=BLUE                                               00080   
AMFST14 DFHMDF POS=(18,27),LENGTH=10,ATTRB=(ASKIP,NORM),               C00354**2
               COLOR=BLUE                                               00355**2
AFSCA14 DFHMDF POS=(18,38),LENGTH=04,ATTRB=(ASKIP,NORM),               C00356**2
               COLOR=BLUE                                               00357**2
AFBIL14 DFHMDF POS=(18,43),LENGTH=14,ATTRB=(ASKIP,NORM),               C00358**2
               COLOR=BLUE                                               00359**2
ABOL14  DFHMDF POS=(18,58),LENGTH=20,ATTRB=(ASKIP,NORM),               C00360**2
               COLOR=BLUE                                               00361**2
*                                                                       00362**2
        DFHMDF POS=(19,40),LENGTH=25,ATTRB=(ASKIP,NORM),               C00363   
               COLOR=NEUTRAL,INITIAL='NUMBER OF SELECTED ITEMS:'        00364   
ASELIT  DFHMDF POS=(19,67),LENGTH=07,ATTRB=(ASKIP,NORM),               C00365   
               COLOR=BLUE,PICOUT='ZZZ,ZZ9'                              00366   
**************                                                          00367   
        DFHMSD TYPE=FINAL                                               00368   
**************                                                          00369   
        END                                                             00370   
