000100******************************************************************00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300******************************************************************00030000
000400                                                                  00040000
000500 PROGRAM-ID.    TRKRP503.                                         00050034
000600 AUTHOR.        BUDDY BARNES.                                     00060000
000700 INSTALLATION.  KOHLS.                                            00070000
000800 DATE-WRITTEN   APR 2011.                                         00080000
000900 DATE-COMPILED.                                                   00090000
001000                                                                  00100000
001100******************************************************************00110000
001200* THIS PROGRAM TAKES IN THE OUTPUT OF TRKUP501 AND CREATES A      00120036
001300* REPORT OF DUPLICATE RATES.                                      00130036
001330******************************************************************00150000
001340******************************************************************00160000
001350 ENVIRONMENT DIVISION.                                            00170000
001360******************************************************************00180000
001370 CONFIGURATION SECTION.                                           00190000
001380 SOURCE-COMPUTER.        IBM-3090.                                00200000
001390 OBJECT-COMPUTER.        IBM-3090.                                00210000
001400                                                                  00220000
001500 INPUT-OUTPUT SECTION.                                            00230000
001600 FILE-CONTROL.                                                    00240000
001700                                                                  00250000
001800     SELECT INPUT-FILE                                            00260000
001900         ASSIGN TO INP01.                                         00270000
002000                                                                  00280000
002100     SELECT REPORT-FILE1                                          00290003
002200         ASSIGN TO RPT01.                                         00300003
002300                                                                  00310000
002700******************************************************************00320000
002800 DATA DIVISION.                                                   00330000
002900******************************************************************00340000
003000                                                                  00350000
003100 FILE SECTION.                                                    00360000
003200                                                                  00370000
003300 FD  INPUT-FILE                                                   00380000
003400     RECORDING MODE IS F                                          00390000
003500     LABEL RECORDS ARE STANDARD                                   00400000
003600     RECORD CONTAINS 184                                          00410000
003700     BLOCK CONTAINS 0 RECORDS                                     00420000
003800     DATA RECORD IS INPUT-RECORD.                                 00430000
003900                                                                  00440000
004000 01  INPUT-RECORD              PIC  X(184).                       00450000
004100                                                                  00460000
004200 FD  REPORT-FILE1                                                 00470003
004300     RECORDING MODE IS F                                          00480000
004400     LABEL RECORDS ARE STANDARD                                   00490000
004500     RECORD CONTAINS 132                                          00500002
004510     BLOCK CONTAINS 0 RECORDS                                     00510000
004520     DATA RECORD IS REPORT-RECORD.                                00520049
004530                                                                  00530000
004531 01  REPORT-RECORD             PIC  X(132).                       00540049
004532                                                                  00550000
004560******************************************************************00560000
004570 WORKING-STORAGE SECTION.                                         00570000
004580******************************************************************00580000
004590 01  PS-PROGRAM-SWITCHES.                                         00590000
004600     05  PS-EOF-INPUT-SW              PIC X(01)  VALUE 'N'.       00600000
004700         88  PS-EOF-INPUT                        VALUE 'Y'.       00610000
004800         88  PS-NOT-EOF-INPUT                    VALUE 'N'.       00620000
004900     05  PS-FIRST-RECORD-SW           PIC X(01)  VALUE 'Y'.       00630000
005000         88  PS-FIRST-RECORD                     VALUE 'Y'.       00640000
005100         88  PS-FIRST-RECORD-NO                  VALUE 'N'.       00650000
004900     05  PS-NEW-DUPLICATE-SW          PIC X(01)  VALUE 'Y'.       00651002
005000         88  PS-NEW-DUPLICATE                    VALUE 'Y'.       00652002
005000         88  PS-SAVED-DUPLICATE                  VALUE 'D'.       00652115
005100         88  PS-NEW-DUPLICATE-NO                 VALUE 'N'.       00653002
005401                                                                  00660000
005402 01  PC-PROGRAM-CONSTANTS.                                        00670000
005403     05  PC-PROGRAM-NAME              PIC X(08) VALUE 'TRKRP503'. 00680035
005404     05  PC-MAX-RETRIES               PIC S9(04) VALUE +3 COMP.   00690073
02900      05  PC-NO-INPUT-LINE.                                        00691073
029100          10  FILLER                  PIC  X(39)  VALUE SPACE.    00692073
029200          10  FILLER                  PIC  X(55) VALUE            00693073
029300         '        ***  THERE IS NO DATA TO REPORT  ***         '. 00694079
029400          10  FILLER                  PIC  X(38)  VALUE SPACE.    00695073
02900      05  PC-END-OF-REPORT-LINE.                                   00696079
029100          10  FILLER                  PIC  X(39)  VALUE SPACE.    00697079
029200          10  FILLER                  PIC  X(55) VALUE            00698079
029300         '               ***  END OF REPORT  ***               '. 00699079
029400          10  FILLER                  PIC  X(38)  VALUE SPACE.    00699179
005419                                                                  00700000
005420 01  PV-PROGRAM-VARIABLES.                                        00710000
005421     05  PV-RECORDS-READ              PIC 9(09)  VALUE ZERO.      00720000
005422     05  PV-DUPLICATES-WRITTEN        PIC 9(09)  VALUE ZERO.      00730000
005422     05  PV-LINE-CNT                  PIC 9(09)  VALUE 80.        00731061
           05  PV-DETAIL-PAGE-COUNT         PIC 9(09)  VALUE ZERO.      00732068
005423     05  PV-RETRY-COUNTER             PIC S9(04) VALUE 0 COMP.    00740000
00117      05  PV-CURR-DATE.                                            00750048
00118          10  PV-CURR-YY               PIC  9(02) VALUE ZERO.      00751048
00119          10  PV-CURR-MM               PIC  9(02) VALUE ZERO.      00752048
00120          10  PV-CURR-DD               PIC  9(02) VALUE ZERO.      00753048
00121                                                                   00754048
00122      05  PV-CURR-TIME.                                            00755048
00123          10  PV-CURR-HH               PIC  9(02) VALUE ZERO.      00756048
00124          10  PV-CURR-MN               PIC  9(02) VALUE ZERO.      00757050
00125          10  PV-CURR-TIME-SSHH        PIC  9(04) VALUE ZERO.      00758048
005804                                                                  00760000
       01  WS-RPT-HEADER1.                                              01191171
           10 FILLER                      PIC X(42) VALUE SPACES.       01191271
           10 FILLER                      PIC X(50) VALUE               01191371
           'DUPLICATE TRANSPORTATON RATES THAT WILL BE DELETED'.        01191471
           10 FILLER                      PIC X(41) VALUE SPACES.       01191671
       01  WS-RPT-HEADER2.                                              01191971
           10 FILLER                      PIC X(09) VALUE SPACES.       01192061
           10 FILLER                      PIC X(01) VALUE SPACES.       01192160
           10 FILLER                      PIC X(10) VALUE SPACES.       01192261
           10 FILLER                      PIC X(01) VALUE SPACES.       01192360
           10 FILLER                      PIC X(04) VALUE 'RATE'.       01192461
           10 FILLER                      PIC X(01) VALUE SPACES.       01192560
           10 FILLER                      PIC X(04) VALUE SPACES.       01192662
           10 FILLER                      PIC X(01) VALUE SPACES.       01192760
           10 FILLER                      PIC X(05) VALUE 'POE  '.      01192861
           10 FILLER                      PIC X(01) VALUE SPACES.       01192960
           10 FILLER                      PIC X(05) VALUE 'FOB  '.      01193061
           10 FILLER                      PIC X(01) VALUE SPACES.       01193160
           10 FILLER                      PIC X(04) VALUE 'CNTR'.       01193262
           10 FILLER                      PIC X(01) VALUE SPACES.       01193361
           10 FILLER                      PIC X(05) VALUE 'CMDTY'.      01193461
           10 FILLER                      PIC X(01) VALUE SPACES.       01193562
           10 FILLER                      PIC X(11) VALUE SPACES.       01193662
           10 FILLER                      PIC X(01) VALUE SPACES.       01193760
           10 FILLER                      PIC X(03) VALUE SPACES.       01193862
           10 FILLER                      PIC X(01) VALUE SPACES.       01193960
           10 FILLER                      PIC X(03) VALUE SPACES.       01194062
           10 FILLER                      PIC X(01) VALUE SPACES.       01194160
           10 FILLER                      PIC X(11) VALUE SPACES.       01194264
           10 FILLER                      PIC X(01) VALUE SPACES.       01194360
           10 FILLER                      PIC X(11) VALUE SPACES.       01194464
           10 FILLER                      PIC X(01) VALUE SPACES.       01194560
           10 FILLER                      PIC X(26) VALUE SPACES.       01194662
       01  WS-RPT-HEADER3.                                              01194771
           10 FILLER                      PIC X(9) VALUE 'RATE ID'.     01194853
           10 FILLER                      PIC X(01) VALUE SPACES.       01194953
           10 FILLER                      PIC X(10) VALUE 'VENDOR    '. 01195060
           10 FILLER                      PIC X(01) VALUE SPACES.       01195153
           10 FILLER                      PIC X(04) VALUE 'TYPE'.       01195253
           10 FILLER                      PIC X(01) VALUE SPACES.       01195353
           10 FILLER                      PIC X(04) VALUE 'SCAC'.       01195459
           10 FILLER                      PIC X(01) VALUE SPACES.       01195553
           10 FILLER                      PIC X(05) VALUE 'CDE  '.      01195661
           10 FILLER                      PIC X(01) VALUE SPACES.       01195753
           10 FILLER                      PIC X(05) VALUE 'CDE  '.      01195861
           10 FILLER                      PIC X(01) VALUE SPACES.       01195953
           10 FILLER                      PIC X(04) VALUE 'SIZE'.       01196059
           10 FILLER                      PIC X(01) VALUE SPACES.       01196153
           10 FILLER                      PIC X(04) VALUE 'GRP '.       01196261
           10 FILLER                      PIC X(02) VALUE SPACES.       01196359
           10 FILLER                      PIC X(11) VALUE 'RATE AMOUNT'.01196453
           10 FILLER                      PIC X(01) VALUE SPACES.       01196553
           10 FILLER                      PIC X(03) VALUE 'WGT'.        01196659
           10 FILLER                      PIC X(01) VALUE SPACES.       01196753
           10 FILLER                      PIC X(03) VALUE 'UOM'.        01196859
           10 FILLER                      PIC X(02) VALUE SPACES.       01196964
           10 FILLER                      PIC X(10) VALUE '   MAX QTY'. 01197063
           10 FILLER                      PIC X(02) VALUE SPACES.       01197164
           10 FILLER                      PIC X(10) VALUE '   MIN QTY'. 01197263
           10 FILLER                      PIC X(01) VALUE SPACES.       01197353
           10 FILLER                      PIC X(26) VALUE               01197453
                                          'LAST UPDATE TIMESTAMP     '. 01197553
                                                                        01197653
       01  WS-RPT-HEADER4.                                              01197771
           10 FILLER                     PIC X(09) VALUE '---------'.   01197859
           10 FILLER                     PIC X(01) VALUE SPACES.        01197953
           10 FILLER                     PIC X(10) VALUE '----------'.  01198053
           10 FILLER                     PIC X(01) VALUE SPACES.        01198153
           10 FILLER                     PIC X(04) VALUE '----'.        01198253
           10 FILLER                     PIC X(01) VALUE SPACES.        01198353
           10 FILLER                     PIC X(04) VALUE '----'.        01198453
           10 FILLER                     PIC X(01) VALUE SPACES.        01198553
           10 FILLER                     PIC X(05) VALUE '-----'.       01198653
           10 FILLER                     PIC X(01) VALUE SPACES.        01198753
           10 FILLER                     PIC X(05) VALUE '-----'.       01198853
           10 FILLER                     PIC X(01) VALUE SPACES.        01198953
           10 FILLER                     PIC X(04) VALUE '----'.        01199053
           10 FILLER                     PIC X(01) VALUE SPACES.        01199153
           10 FILLER                     PIC X(04) VALUE '----'.        01199253
           10 FILLER                     PIC X(01) VALUE SPACES.        01199381
           10 FILLER                     PIC X(12) VALUE '------------'.01199482
           10 FILLER                     PIC X(01) VALUE SPACES.        01199553
           10 FILLER                     PIC X(03) VALUE '---'.         01199653
           10 FILLER                     PIC X(01) VALUE SPACES.        01199753
           10 FILLER                     PIC X(03) VALUE '---'.         01199853
           10 FILLER                     PIC X(01) VALUE SPACES.        01199953
           10 FILLER                     PIC X(11) VALUE '-----------'. 01200065
           10 FILLER                     PIC X(01) VALUE SPACES.        01200153
           10 FILLER                     PIC X(11) VALUE '-----------'. 01200265
           10 FILLER                     PIC X(01) VALUE SPACES.        01200353
           10 FILLER                     PIC X(26) VALUE                01200453
                                          '--------------------------'. 01200553
                                                                        01200653
       01  WS-RPT-RECORD.                                               01200753
           10 WS-RPT-VND-TRANS-RT-ID       PIC ZZZZZZZZ9.               01200881
           10 FILLER                       PIC X(01) VALUE SPACES.      01200959
           10 WS-RPT-VND-NBR               PIC X(10).                   01201059
           10 FILLER                       PIC X(01) VALUE SPACES.      01201159
           10 WS-RPT-TRANS-RT-TYP-CDE      PIC X(4).                    01201259
           10 FILLER                       PIC X(01) VALUE SPACES.      01201359
           10 WS-RPT-DCONSLR-SCAC-ID       PIC X(4).                    01201459
           10 FILLER                       PIC X(01) VALUE SPACES.      01201559
           10 WS-RPT-POE-STD-EDI-CDE       PIC X(5).                    01201659
           10 FILLER                       PIC X(01) VALUE SPACES.      01201759
           10 WS-RPT-FOB-STD-EDI-CDE       PIC X(5).                    01201859
           10 FILLER                       PIC X(01) VALUE SPACES.      01201959
           10 WS-RPT-EDI-CONTNR-SZ-TYP-CDE PIC X(04).                   01202059
           10 FILLER                       PIC X(01) VALUE SPACES.      01202159
           10 WS-RPT-CMDTY-TYP-GRP-CDE     PIC X(4).                    01202259
           10 FILLER                       PIC X(01) VALUE SPACES.      01202359
           10 WS-RPT-TRANS-RT-AMT          PIC Z(7)9.999.               01202459
           10 FILLER                       PIC X(01) VALUE SPACES.      01202559
           10 WS-RPT-RT-WT-TYP-CDE         PIC X(3).                    01202659
           10 FILLER                       PIC X(01) VALUE SPACES.      01202759
           10 WS-RPT-UOM-CDE               PIC X(3).                    01202859
           10 FILLER                       PIC X(01) VALUE SPACES.      01202959
           10 WS-RPT-RT-BSS-MAX-QTY        PIC Z(07)9.99.               01203064
           10 FILLER                       PIC X(01) VALUE SPACES.      01203159
           10 WS-RPT-RT-BSS-MIN-QTY        PIC Z(07)9.99.               01203264
           10 FILLER                       PIC X(01) VALUE SPACES.      01203359
           10 WS-RPT-LAST-UPD-TMST         PIC X(26).                   01203459
                                                                        01204000
       01  WS-BLANK-LINE.                                               01205028
           10 FILLER                       PIC  X(132) VALUE SPACES.    01207028
                                                                        01208028
005805 01  PV-ABEND-FIELDS.                                             01210000
005806     05  PV-ABEND-CODE                PIC  S9(4) VALUE +0         01220000
005807                                                 COMP SYNC.       01230000
005809     05  PV-ABEND-PARAGRAPH           PIC  X(50) VALUE SPACES.    01240000
005810     05  PV-ABEND-OPERATION           PIC  X(50) VALUE SPACES.    01250000
005811     05  PV-ABEND-STRUCTURE-1         PIC  X(08) VALUE SPACES.    01260000
005812     05  PV-ABEND-STRUCTURE-2         PIC  X(08) VALUE SPACES.    01270000
005843                                                                  01280000
005844******************************************************************01280172
005845*  VENDOR TRANSPORTATION RATES RECORD LAYOUT                      01280272
005846******************************************************************01280372
005847     COPY TRRD272.                                                01280472
005843                                                                  01280572
      ***************************************************************** 01281037
      *  STANDARD REPORT HEADER FOR A 132 COLUMN REPORT.              * 01282037
      ***************************************************************** 01283037
      *                                                                 01284037
           COPY DPWS132O.                                               01285037
      *                                                                 01286037
005844******************************************************************01290000
005845*  DB2 FORMATTED MESSAGE AREA                                     01300000
005846******************************************************************01310000
005847     COPY DPWS004.                                                01320000
005848*                                                                 01330000
008520******************************************************************01340000
008530 PROCEDURE DIVISION.                                              01350000
008540******************************************************************01360000
008550 0000-PROGRAM-MAINLINE.                                           01370000
008560                                                                  01380000
008570     OPEN INPUT  INPUT-FILE                                       01390000
008580          OUTPUT REPORT-FILE1.                                    01400008
010300                                                                  01400114
           MOVE PC-PROGRAM-NAME      TO DP132O-PROGRAM-NAME.            01400950
      *                                                                 01401038
           ACCEPT PV-CURR-DATE       FROM DATE.                         01401138
           MOVE PV-CURR-YY           TO DP132O-RUN-YEAR                 01401238
           MOVE PV-CURR-MM           TO DP132O-RUN-MONTH                01401438
           MOVE PV-CURR-DD           TO DP132O-RUN-DAY                  01401738
      *                                                                 01401938
           ACCEPT PV-CURR-TIME       FROM TIME.                         01402038
           MOVE PV-CURR-HH           TO DP132O-RUN-HOUR.                01402138
           MOVE PV-CURR-MN           TO DP132O-RUN-MINUTE.              01402250
           MOVE 1                    TO DP132O-REPORT-NUMBER.           01402439
           MOVE 0                    TO DP132O-PAGE-NUMBER.             01402567
      *                                                                 01402639
008600                                                                  01410000
008900     PERFORM 7000-READ-INPUT-FILE.                                01420041
009000                                                                  01430000
           IF PS-NOT-EOF-INPUT                                          01431077
009100         PERFORM 2000-PROCESS-INPUT-FILE                          01440075
009200             UNTIL PS-EOF-INPUT                                   01450075
               MOVE PC-END-OF-REPORT-LINE TO WS-RPT-RECORD              01450180
009300         PERFORM 8000-WRITE-REPORT-RECORD                         01450280
           ELSE                                                         01451075
               MOVE PC-NO-INPUT-LINE      TO WS-RPT-RECORD              01452080
009300         PERFORM 8000-WRITE-REPORT-RECORD                         01460075
           END-IF.                                                      01461075
                                                                        01462075
009400     PERFORM 9000-EOJ.                                            01470000
009500                                                                  01480000
009600     STOP RUN.                                                    01490000
009700                                                                  01500000
011300                                                                  01660000
011400******************************************************************01670000
011500* PROCESS INPUT RECORDS                                          *01680000
011600******************************************************************01690000
011700 2000-PROCESS-INPUT-FILE.                                         01700000
011800     MOVE '2000-PROCESS-INPUT-FILE.'    TO PV-ABEND-PARAGRAPH.    01710052
           MOVE TR272-VND-TRANS-RT-ID         TO                        01711072
                  WS-RPT-VND-TRANS-RT-ID                                01712047
           MOVE TR272-VND-NBR                 TO                        01713072
                  WS-RPT-VND-NBR                                        01714047
           MOVE TR272-TRANS-RT-TYP-CDE        TO                        01715072
                  WS-RPT-TRANS-RT-TYP-CDE                               01716047
           MOVE TR272-DCONSLR-SCAC-ID         TO                        01717072
                  WS-RPT-DCONSLR-SCAC-ID                                01718047
           MOVE TR272-POE-STD-EDI-CDE         TO                        01719072
                  WS-RPT-POE-STD-EDI-CDE                                01719147
           MOVE TR272-FOB-STD-EDI-CDE         TO                        01719272
                  WS-RPT-FOB-STD-EDI-CDE                                01719347
           MOVE TR272-EDI-CONTNR-SZ-TYP-CDE TO                          01719472
                  WS-RPT-EDI-CONTNR-SZ-TYP-CDE                          01719547
           MOVE TR272-CMDTY-TYP-GRP-CDE       TO                        01719672
                  WS-RPT-CMDTY-TYP-GRP-CDE                              01719747
           MOVE TR272-TRANS-RT-AMT            TO                        01719872
                  WS-RPT-TRANS-RT-AMT                                   01719947
           MOVE TR272-RT-WT-TYP-CDE           TO                        01720072
                  WS-RPT-RT-WT-TYP-CDE                                  01721047
           MOVE TR272-UOM-CDE                 TO                        01722072
                  WS-RPT-UOM-CDE                                        01723047
           MOVE TR272-RT-BSS-MAX-QTY          TO                        01724072
                  WS-RPT-RT-BSS-MAX-QTY                                 01725047
           MOVE TR272-RT-BSS-MIN-QTY          TO                        01726072
                  WS-RPT-RT-BSS-MIN-QTY                                 01727047
           MOVE TR272-LAST-UPD-TMST           TO                        01728072
                  WS-RPT-LAST-UPD-TMST                                  01729047
011900                                                                  01730000
050929     ADD +1                             TO PV-DUPLICATES-WRITTEN. 01740078
011900                                                                  01750078
014000     PERFORM 8000-WRITE-REPORT-RECORD.                            01931070
016500                                                                  01970000
016600     PERFORM 7000-READ-INPUT-FILE.                                01980041
016700                                                                  01990000
009800******************************************************************01991041
009900* READS RECORD FROM THE INPUT FILE                                01992041
010000******************************************************************01993041
010100 7000-READ-INPUT-FILE.                                            01994041
010200     MOVE '7000-READ-INPUT-FILE.'      TO  PV-ABEND-PARAGRAPH.    01995041
010300                                                                  01996041
010400     READ INPUT-FILE                                              01997041
010500          INTO TR272-VENDOR-TRANS-RATE-REC                        01998072
010600            AT END                                                01999041
010700               SET PS-EOF-INPUT     TO TRUE                       01999141
010800                                                                  01999241
010900            NOT AT END                                            01999341
011000               SET PS-NOT-EOF-INPUT TO TRUE                       01999441
011100               ADD +1 TO PV-RECORDS-READ                          01999541
011200     END-READ.                                                    01999641
050903******************************************************************02000000
050904* WRITES THE APPROPRIATE OUTPUT RECORDS                          *02010000
050905******************************************************************02020000
050906 8000-WRITE-REPORT-RECORD.                                        02030041
050908     MOVE '8000-WRITE-REPORT-RECORD.'  TO PV-ABEND-PARAGRAPH.     02040041
050910                                                                  02040103
050912     IF PV-LINE-CNT > 60                                          02041003
               ADD 1                     TO PV-DETAIL-PAGE-COUNT        02041168
               MOVE PV-DETAIL-PAGE-COUNT TO DP132O-PAGE-NUMBER          02041269
               WRITE REPORT-RECORD FROM DP132O-STANDRD-HEADER-132-COLS  02041357
050912            AFTER ADVANCING PAGE                                  02041457
050912         WRITE REPORT-RECORD FROM WS-RPT-HEADER1                  02042049
050912            AFTER ADVANCING 2 LINES                               02042171
050912         WRITE REPORT-RECORD FROM WS-RPT-HEADER2                  02042271
050912            AFTER ADVANCING 2 LINES                               02043057
050912         WRITE REPORT-RECORD FROM WS-RPT-HEADER3                  02044071
050912            AFTER ADVANCING 1 LINE                                02045003
050912         WRITE REPORT-RECORD FROM WS-RPT-HEADER4                  02045171
050912            AFTER ADVANCING 1 LINE                                02045262
050912         MOVE 7 TO PV-LINE-CNT.                                   02046071
050910                                                                  02050000
050912     WRITE REPORT-RECORD FROM WS-RPT-RECORD                       02089274
050912         AFTER ADVANCING 1 LINE.                                  02089358
050919     ADD  1  TO  PV-LINE-CNT.                                     02089456
050920                                                                  02090000
050921 9000-EOJ.                                                        02100000
050923                                                                  02110000
050924     CLOSE INPUT-FILE                                             02120000
050925           REPORT-FILE1.                                          02130008
050927                                                                  02140000
050928     DISPLAY ' RECORDS READ      = ' PV-RECORDS-READ              02150078
050929     DISPLAY ' DUPLICATE RECORDS = ' PV-DUPLICATES-WRITTEN.       02160078
050930                                                                  02170000
050931******************************************************************02180000
050932* ABEND PROCEDURE                                                *02190000
050933******************************************************************02200000
050934*9999-SQL-ABEND.                                                  02210040
050936*    DISPLAY '** PROGRAM ABEND   ** = ' PC-PROGRAM-NAME.          02220040
050937*    DISPLAY '** PARAGRAPH       ** = ' PV-ABEND-PARAGRAPH.       02230040
050944*    CALL 'ILBOABN0'   USING PV-ABEND-CODE.                       02240040
050945                                                                  02250000
