000100*************************                                         00010009
000200 IDENTIFICATION DIVISION.                                         00020009
000300*************************                                         00030009
000400 PROGRAM-ID.      TRKUT090.                                       00040009
000500 AUTHOR.          RENEE JAEGER.                                   00050009
000600 INSTALLATION.    KOHLS DEPARTMENT STORES.                        00060009
000700 DATE-WRITTEN.    12/06/97.                                       00070009
000800 DATE-COMPILED.                                                   00080009
000900****************************************************************  00090009
001000*     IMPORT PROPRIETARY FILE SPLIT PROGRAM.                   *  00100009
001100****************************************************************  00110009
001200*  THIS PROGRAM WAS ORIGINALLY NAMED DSKUT001, BUT IN JANUARY  *  00120009
001300*  OF 2020, IT WAS RENAMED TO TRKUT090 SO THAT THE DS APP ID   *  00130009
001400*  COULD BE RETIRED.  THIS WAS THE ONLY DS PROGRAM AT THE TIME.*  00140009
001500*  THE ONLY CHANGES MADE WERE THE PROGRAM NAME REFERENCES,     *  00150009
001600*  THE RENAMING OF THE COPYBOOK FROM DSRD001 TO TRRD090 AND    *  00160009
001700*  THE RENAMING OF THE COPYBOOK FIELDS FROM DS001- TO TR090-.  *  00170009
001800****************************************************************  00180009
001900*  THIS PROGRAM WILL SPLIT THE PROPRIETARY FILE RECEIVED IN    *  00190009
002000*  THE COMMON ZZ KOHLS MAILBOX INTO SEPARATE FILES FOR         *  00200009
002100*  PROCESSING.   NO EDITING OF THE DATA IS DONE IN THIS PGM.   *  00210009
002200*  IF NEW VENDORS ARE ADDED, PLEASE SEE ALL *RJ COMMENTS FOR   *  00220009
002300*  ADDING THE NECESSARY CODE.                                  *  00230009
002400****************************************************************  00240009
002500* CHANGE DESCRIPTION                                           *  00250009
002600****************************************************************  00260009
002700* 06/30/2010  PRASANTHI BADUKONDA      TKID: TKMAW45           *  00270009
002800*             MODIFIED THE PROGRAM TO                          *  00280009
002900*             1.ACCOMMODATE PROCESSING OF THE NEW 'ARVDCN'     *  00290009
003000*               TYPE OF RECORDS THAT WOULD COME IN THE         *  00300009
003100*               DELIVERY FILE.                                 *  00310009
003200*             2.ACCOMMODATE PROCESSING OF RECORDS FROM THE NEW *  00320009
003300*               INBOUND WAREHOUSE REPLENISHMENT FILE AND       *  00330009
003400*               SPLIT/ROUTE THESE RECORDS INTO TWO NEW OUTPUT  *  00340009
003500*               FILES FOR FURTHER PROCESSING.                  *  00350009
003600*             ADDED NEW PARAGRAPHS:                            *  00360009
003700*               4175-WRITE-REC-TYP-WHSE-REPLEN                 *  00370009
003800*               5013-WRITE-TRI-WHSE-RPLN-P-REC                 *  00380009
003900*               5014-WRITE-TRI-WHSE-RPLN-T-REC                 *  00390009
004000*               5340-WRITE-WHSE-RPLN-T-REC-WS                  *  00400009
004100*               5345-WRITE-WHSE-RPLN-P-REC-WS                  *  00410009
004200*             CHANGES TAGGED AS PB 06/30/2010                  *  00420009
004300****************************************************************  00430009
004400 ENVIRONMENT DIVISION.                                            00440009
004500 CONFIGURATION SECTION.                                           00450009
004600 SOURCE-COMPUTER. IBM-3090.                                       00460009
004700 OBJECT-COMPUTER. IBM-3090.                                       00470009
004800 INPUT-OUTPUT SECTION.                                            00480009
004900                                                                  00490009
005000 FILE-CONTROL.                                                    00500009
005100     SELECT INPUT-FILE                                            00510009
005200         ASSIGN                       TO INP01.                   00520009
005300     SELECT REPORT-FILE                                           00530009
005400         ASSIGN                       TO RPT01.                   00540009
005500     SELECT TRIANGLE-PACKSLIPS-P-FILE                             00550009
005600         ASSIGN                       TO OUT01.                   00560009
005700     SELECT CONSOL-IMPORT-BKG-P-FILE                              00570009
005800         ASSIGN                       TO OUT02.                   00580009
005900     SELECT CONSOL-CONMAN-P-FILE                                  00590009
006000         ASSIGN                       TO OUT03.                   00600009
006100     SELECT CONSOL-ARRIVAL-P-FILE                                 00610009
006200         ASSIGN                       TO OUT04.                   00620009
006300     SELECT CONSOL-CUSTOMS-P-FILE                                 00630009
006400         ASSIGN                       TO OUT05.                   00640009
006500     SELECT CONSOL-EXCP-FILE                                      00650009
006600         ASSIGN                       TO OUT06.                   00660009
006700     SELECT CONSOL-IMPORT-BKG-T-FILE                              00670009
006800         ASSIGN                       TO OUT07.                   00680009
006900     SELECT CONSOL-CONMAN-T-FILE                                  00690009
007000         ASSIGN                       TO OUT08.                   00700009
007100     SELECT CONSOL-ARRIVAL-T-FILE                                 00710009
007200         ASSIGN                       TO OUT09.                   00720009
007300     SELECT CONSOL-CUSTOMS-T-FILE                                 00730009
007400         ASSIGN                       TO OUT10.                   00740009
007500     SELECT TRIANGLE-PACKSLIPS-T-FILE                             00750009
007600         ASSIGN                       TO OUT11.                   00760009
007700     SELECT CONSOL-IMPORT-RCVG-T-FILE                             00770009
007800         ASSIGN                       TO OUT12.                   00780009
007900     SELECT CONSOL-IMPORT-RCVG-P-FILE                             00790009
008000         ASSIGN                       TO OUT13.                   00800009
008100     SELECT DELIVERY-P-FILE                                       00810009
008200         ASSIGN                       TO OUT14.                   00820009
008300     SELECT DELIVERY-T-FILE                                       00830009
008400         ASSIGN                       TO OUT15.                   00840009
008500* PB 06/30/2010 BEG                                               00850009
008600     SELECT WHSE-REPLEN-P-FILE                                    00860009
008700         ASSIGN                       TO OUT16.                   00870009
008800     SELECT WHSE-REPLEN-T-FILE                                    00880009
008900         ASSIGN                       TO OUT17.                   00890009
009000* PB 06/30/2010 END                                               00900009
009100*                                                                 00910009
009200***************                                                   00920009
009300 DATA DIVISION.                                                   00930009
009400***************                                                   00940009
009500*                                                                 00950009
009600 FILE SECTION.                                                    00960009
009700                                                                  00970009
009800 FD  INPUT-FILE                                                   00980009
009900     RECORDING MODE IS F                                          00990009
010000     LABEL RECORDS ARE STANDARD                                   01000009
010100     RECORD CONTAINS 150 CHARACTERS                               01010009
010200     BLOCK CONTAINS 0 RECORDS.                                    01020009
010300 01  INPUT-RECORD                     PIC  X(150).                01030009
010400                                                                  01040009
010500 FD  REPORT-FILE                                                  01050009
010600     RECORDING MODE F                                             01060009
010700     BLOCK CONTAINS 0 RECORDS                                     01070009
010800     RECORD CONTAINS 132 CHARACTERS                               01080009
010900     LABEL RECORDS ARE OMITTED                                    01090009
011000     DATA RECORD IS PRINT-LINE.                                   01100009
011100 01  PRINT-LINE                          PIC X(132).              01110009
011200                                                                  01120009
011300 FD  TRIANGLE-PACKSLIPS-P-FILE                                    01130009
011400     RECORDING MODE F                                             01140009
011500     BLOCK CONTAINS 0 RECORDS                                     01150009
011600     RECORD CONTAINS 150 CHARACTERS                               01160009
011700     LABEL RECORDS ARE STANDARD                                   01170009
011800     DATA RECORD IS TRIANGLE-PACKSLIPS-P-LINE.                    01180009
011900    01 TRIANGLE-PACKSLIPS-P-LINE         PIC X(150).              01190009
012000                                                                  01200009
012100 FD  TRIANGLE-PACKSLIPS-T-FILE                                    01210009
012200     RECORDING MODE F                                             01220009
012300     BLOCK CONTAINS 0 RECORDS                                     01230009
012400     RECORD CONTAINS 150 CHARACTERS                               01240009
012500     LABEL RECORDS ARE STANDARD                                   01250009
012600     DATA RECORD IS TRIANGLE-PACKSLIPS-T-LINE.                    01260009
012700    01 TRIANGLE-PACKSLIPS-T-LINE         PIC X(150).              01270009
012800                                                                  01280009
012900 FD  CONSOL-IMPORT-BKG-T-FILE                                     01290009
013000     RECORDING MODE F                                             01300009
013100     BLOCK CONTAINS 0 RECORDS                                     01310009
013200     RECORD CONTAINS 300 CHARACTERS                               01320009
013300     LABEL RECORDS ARE STANDARD                                   01330009
013400     DATA RECORD IS CONSOL-IMPORT-BKG-T-LINE.                     01340009
013500    01 CONSOL-IMPORT-BKG-T-LINE          PIC X(300).              01350009
013600                                                                  01360009
013700 FD  CONSOL-IMPORT-RCVG-T-FILE                                    01370009
013800     RECORDING MODE F                                             01380009
013900     BLOCK CONTAINS 0 RECORDS                                     01390009
014000     RECORD CONTAINS 300 CHARACTERS                               01400009
014100     LABEL RECORDS ARE STANDARD                                   01410009
014200     DATA RECORD IS CONSOL-IMPORT-RCVG-T-LINE.                    01420009
014300    01 CONSOL-IMPORT-RCVG-T-LINE         PIC X(300).              01430009
014400                                                                  01440009
014500 FD  CONSOL-CONMAN-P-FILE                                         01450009
014600     RECORDING MODE F                                             01460009
014700     BLOCK CONTAINS 0 RECORDS                                     01470009
014800     RECORD CONTAINS 300 CHARACTERS                               01480009
014900     LABEL RECORDS ARE STANDARD                                   01490009
015000     DATA RECORD IS CONSOL-CONMAN-P-LINE.                         01500009
015100    01 CONSOL-CONMAN-P-LINE              PIC X(300).              01510009
015200                                                                  01520009
015300 FD  CONSOL-ARRIVAL-P-FILE                                        01530009
015400     RECORDING MODE F                                             01540009
015500     BLOCK CONTAINS 0 RECORDS                                     01550009
015600     RECORD CONTAINS 300 CHARACTERS                               01560009
015700     LABEL RECORDS ARE STANDARD                                   01570009
015800     DATA RECORD IS CONSOL-ARRIVAL-P-LINE.                        01580009
015900    01 CONSOL-ARRIVAL-P-LINE             PIC X(300).              01590009
016000                                                                  01600009
016100 FD  CONSOL-CUSTOMS-P-FILE                                        01610009
016200     RECORDING MODE F                                             01620009
016300     BLOCK CONTAINS 0 RECORDS                                     01630009
016400     RECORD CONTAINS 300 CHARACTERS                               01640009
016500     LABEL RECORDS ARE STANDARD                                   01650009
016600     DATA RECORD IS CONSOL-CUSTOMS-P-LINE.                        01660009
016700    01 CONSOL-CUSTOMS-P-LINE             PIC X(300).              01670009
016800                                                                  01680009
016900 FD  CONSOL-EXCP-FILE                                             01690009
017000     RECORDING MODE F                                             01700009
017100     BLOCK CONTAINS 0 RECORDS                                     01710009
017200     RECORD CONTAINS 150 CHARACTERS                               01720009
017300     LABEL RECORDS ARE STANDARD                                   01730009
017400     DATA RECORD IS CONSOL-EXCP-LINE.                             01740009
017500    01 CONSOL-EXCP-LINE                  PIC X(150).              01750009
017600                                                                  01760009
017700 FD  CONSOL-IMPORT-BKG-P-FILE                                     01770009
017800     RECORDING MODE F                                             01780009
017900     BLOCK CONTAINS 0 RECORDS                                     01790009
018000     RECORD CONTAINS 300 CHARACTERS                               01800009
018100     LABEL RECORDS ARE STANDARD                                   01810009
018200     DATA RECORD IS CONSOL-IMPORT-BKG-P-LINE.                     01820009
018300    01 CONSOL-IMPORT-BKG-P-LINE          PIC X(300).              01830009
018400                                                                  01840009
018500 FD  CONSOL-IMPORT-RCVG-P-FILE                                    01850009
018600     RECORDING MODE F                                             01860009
018700     BLOCK CONTAINS 0 RECORDS                                     01870009
018800     RECORD CONTAINS 300 CHARACTERS                               01880009
018900     LABEL RECORDS ARE STANDARD                                   01890009
019000     DATA RECORD IS CONSOL-IMPORT-RCVG-P-LINE.                    01900009
019100    01 CONSOL-IMPORT-RCVG-P-LINE         PIC X(300).              01910009
019200                                                                  01920009
019300 FD  CONSOL-CONMAN-T-FILE                                         01930009
019400     RECORDING MODE F                                             01940009
019500     BLOCK CONTAINS 0 RECORDS                                     01950009
019600     RECORD CONTAINS 300 CHARACTERS                               01960009
019700     LABEL RECORDS ARE STANDARD                                   01970009
019800     DATA RECORD IS CONSOL-CONMAN-T-LINE.                         01980009
019900    01 CONSOL-CONMAN-T-LINE              PIC X(300).              01990009
020000                                                                  02000009
020100 FD  CONSOL-ARRIVAL-T-FILE                                        02010009
020200     RECORDING MODE F                                             02020009
020300     BLOCK CONTAINS 0 RECORDS                                     02030009
020400     RECORD CONTAINS 300 CHARACTERS                               02040009
020500     LABEL RECORDS ARE STANDARD                                   02050009
020600     DATA RECORD IS CONSOL-ARRIVAL-T-LINE.                        02060009
020700    01 CONSOL-ARRIVAL-T-LINE             PIC X(300).              02070009
020800                                                                  02080009
020900 FD  CONSOL-CUSTOMS-T-FILE                                        02090009
021000     RECORDING MODE F                                             02100009
021100     BLOCK CONTAINS 0 RECORDS                                     02110009
021200     RECORD CONTAINS 300 CHARACTERS                               02120009
021300     LABEL RECORDS ARE STANDARD                                   02130009
021400     DATA RECORD IS CONSOL-CUSTOMS-T-LINE.                        02140009
021500    01 CONSOL-CUSTOMS-T-LINE             PIC X(300).              02150009
021600                                                                  02160009
021700 FD  DELIVERY-T-FILE                                              02170009
021800     RECORDING MODE F                                             02180009
021900     BLOCK CONTAINS 0 RECORDS                                     02190009
022000     RECORD CONTAINS 300 CHARACTERS                               02200009
022100     LABEL RECORDS ARE STANDARD                                   02210009
022200     DATA RECORD IS DELIVERY-T-LINE.                              02220009
022300    01 DELIVERY-T-LINE                   PIC X(300).              02230009
022400                                                                  02240009
022500 FD  DELIVERY-P-FILE                                              02250009
022600     RECORDING MODE F                                             02260009
022700     BLOCK CONTAINS 0 RECORDS                                     02270009
022800     RECORD CONTAINS 300 CHARACTERS                               02280009
022900     LABEL RECORDS ARE STANDARD                                   02290009
023000     DATA RECORD IS DELIVERY-P-LINE.                              02300009
023100    01 DELIVERY-P-LINE                   PIC X(300).              02310009
023200                                                                  02320009
023300* PB 06/30/2010 BEG                                               02330009
023400 FD  WHSE-REPLEN-P-FILE                                           02340009
023500     RECORDING MODE F                                             02350009
023600     BLOCK CONTAINS 0 RECORDS                                     02360009
023700     RECORD CONTAINS 300 CHARACTERS                               02370009
023800     LABEL RECORDS ARE STANDARD                                   02380009
023900     DATA RECORD IS WHSE-REPLEN-P-LINE.                           02390009
024000    01 WHSE-REPLEN-P-LINE                PIC X(300).              02400009
024100                                                                  02410009
024200 FD  WHSE-REPLEN-T-FILE                                           02420009
024300     RECORDING MODE F                                             02430009
024400     BLOCK CONTAINS 0 RECORDS                                     02440009
024500     RECORD CONTAINS 300 CHARACTERS                               02450009
024600     LABEL RECORDS ARE STANDARD                                   02460009
024700     DATA RECORD IS WHSE-REPLEN-T-LINE.                           02470009
024800    01 WHSE-REPLEN-T-LINE                PIC X(300).              02480009
024900                                                                  02490009
025000* PB 06/30/2010 END                                               02500009
025100*                                                                 02510009
025200 WORKING-STORAGE SECTION.                                         02520009
025300 01  DK-DB2-KEYS.                                                 02530009
025400     15 DK-WHERE-3                      PIC  X(03) VALUE SPACES.  02540009
025500     15 DK-WHERE-4                      PIC  X(04) VALUE SPACES.  02550009
025600     15 DK-WHERE-5                      PIC  X(05) VALUE SPACES.  02560009
025700     15 DK-WHERE-6                      PIC  X(06) VALUE SPACES.  02570009
025800     15 DK-WHERE-7                      PIC  X(07) VALUE SPACES.  02580009
025900     15 DK-WHERE-8                      PIC  X(08) VALUE SPACES.  02590009
026000     15 DK-WHERE-9                      PIC  X(09) VALUE SPACES.  02600009
026100     15 DK-WHERE-10                     PIC  X(10) VALUE SPACES.  02610009
026200     15 DK-WHERE-11                     PIC  X(11) VALUE SPACES.  02620009
026300     15 DK-WHERE-12                     PIC  X(12) VALUE SPACES.  02630009
026400     15 DK-WHERE-13                     PIC  X(13) VALUE SPACES.  02640009
026500     15 DK-WHERE-14                     PIC  X(14) VALUE SPACES.  02650009
026600     15 DK-WHERE-15                     PIC  X(15) VALUE SPACES.  02660009
026700     15 DK-WHERE-16                     PIC  X(16) VALUE SPACES.  02670009
026800     15 DK-WHERE-17                     PIC  X(17) VALUE SPACES.  02680009
026900     15 DK-WHERE-18                     PIC  X(18) VALUE SPACES.  02690009
027000     15 DK-WHERE-19                     PIC  X(19) VALUE SPACES.  02700009
027100     15 DK-WHERE-20                     PIC  X(20) VALUE SPACES.  02710009
027200     15 DK-WHERE-21                     PIC  X(21) VALUE SPACES.  02720009
027300     15 DK-WHERE-22                     PIC  X(22) VALUE SPACES.  02730009
027400     15 DK-WHERE-23                     PIC  X(23) VALUE SPACES.  02740009
027500     15 DK-WHERE-24                     PIC  X(24) VALUE SPACES.  02750009
027600     15 DK-WHERE-25                     PIC  X(25) VALUE SPACES.  02760009
027700     15 DK-WHERE-26                     PIC  X(26) VALUE SPACES.  02770009
027800     15 DK-WHERE-27                     PIC  X(27) VALUE SPACES.  02780009
027900     15 DK-WHERE-28                     PIC  X(28) VALUE SPACES.  02790009
028000     15 DK-WHERE-29                     PIC  X(29) VALUE SPACES.  02800009
028100     15 DK-WHERE-30                     PIC  X(30) VALUE SPACES.  02810009
028200*                                                                 02820009
028300****************************************************************  02830009
028400** STANDARD HEADER LINE - KOHLS 132 COL                        *  02840009
028500****************************************************************  02850009
028600     COPY DPWS132O.                                               02860009
028700                                                                  02870009
028800     EXEC SQL                                                     02880009
028900        INCLUDE TENTNME                                           02890009
029000     END-EXEC.                                                    02900009
029100                                                                  02910009
029200     EXEC SQL                                                     02920009
029300        INCLUDE TTRDPRT                                           02930009
029400     END-EXEC.                                                    02940009
029500                                                                  02950009
029600     EXEC SQL                                                     02960009
029700        INCLUDE TEXTENT                                           02970009
029800     END-EXEC.                                                    02980009
029900                                                                  02990009
030000**************************************************                03000009
030100* INCLUDE SQL COMMUNICATION AREA                                  03010009
030200*************************************************                 03020009
030300                                                                  03030009
030400     EXEC SQL                                                     03040009
030500        INCLUDE SQLCA                                             03050009
030600     END-EXEC.                                                    03060009
030700                                                                  03070009
030800     COPY SQLCA2.                                                 03080009
030900                                                                  03090009
031000*************************************************                 03100009
031100* PROGRAM VARIABLES                                               03110009
031200*************************************************                 03120009
031300 01 PV-PROGRAM-VARIABLES.                                         03130009
031400    05 PV-WHERE-CLAUSE              PIC X(30).                    03140009
031500    05 PV-VENDOR-NAME-S             PIC X(28).                    03150009
031600    05 PV-POINTER                   PIC S9(04) VALUE +0           03160009
031700                                               COMP SYNC.         03170009
031800    05 PV-EDI-TEST-SWITCH           PIC X(01).                    03180009
031900       88  PV-EDI-TEST-SWITCH-PROD             VALUE 'P'.         03190009
032000       88  PV-EDI-TEST-SWITCH-TEST             VALUE 'T'.         03200009
032100    05 PV-IMP-VEND-INCHG-ID         PIC X(15)  VALUE SPACES.      03210009
032200    05 PV-IMP-VEND-INCHG-ID-DESC    PIC X(02)  VALUE SPACES.      03220009
032300    05 PV-PARAGRAPH-NAME            PIC X(30)  VALUE SPACES.      03230009
032400    05 PV-SQL-SUB                   PIC 9(03)  VALUE ZERO.        03240009
032500    05 PV-VENDOR-NAME-LIKE          PIC X(30).                    03250009
032600*RJ IF NEW VENDORS ARE ADDED, ADD AN 88 LEVEL HERE.               03260009
032700    05 PV-WHICH-VENDOR              PIC X(01).                    03270009
032800       88 PV-FOUND-TRIANGLE                    VALUE 'T'.         03280009
032900       88 PV-FOUND-HUDD                        VALUE 'H'.         03290009
033000       88 PV-FOUND-APS                         VALUE 'P'.         03300009
033100       88 PV-FOUND-GLB                         VALUE 'G'.         03310009
033200       88 PV-FOUND-UWD                         VALUE 'X'.         03320009
033300       88 PV-FOUND-HELLMAN                     VALUE 'L'.         03330009
033400       88 PV-FOUND-EXPEDITOR                   VALUE 'E'.         03340009
033500       88 PV-FOUND-NYK                         VALUE 'O'.         03350009
033600       88 PV-FOUND-MAERSK                      VALUE 'M'.         03360009
033700       88 PV-FOUND-NONE                        VALUE 'N'.         03370009
033800       88 PV-FOUND-LIVINGSTON                  VALUE 'V'.         03380009
033900    05 PV-EXCEPTION-SW              PIC X(01)  VALUE 'N'.         03390009
034000       88 PV-EXCEPTION                         VALUE 'Y'.         03400009
034100       88 PV-NO-EXCEPTION                      VALUE 'N'.         03410009
034200    05 PV-VALID-REC-SW              PIC X(01)  VALUE 'Y'.         03420009
034300       88 PV-VALID-REC-TYPE                    VALUE 'Y'.         03430009
034400       88 PV-INVALID-REC-TYPE                  VALUE 'N'.         03440009
034500    05 PV-WHICH-FILE-WROTE          PIC X(01)  VALUE 'N'.         03450009
034600       88 PV-WROTE-REC-TYP-BKG                 VALUE 'B'.         03460009
034700       88 PV-WROTE-REC-TYP-RCVG                VALUE 'R'.         03470009
034800       88 PV-WROTE-REC-TYP-CONT                VALUE 'C'.         03480009
034900       88 PV-WROTE-REC-TYP-ARRIVAL             VALUE 'A'.         03490009
035000       88 PV-WROTE-REC-TYP-CUST                VALUE 'T'.         03500009
035100       88 PV-WROTE-REC-TYP-TRI-PKSLP           VALUE 'P'.         03510009
035200       88 PV-WROTE-REC-TYP-TRI-DELY            VALUE 'D'.         03520009
035300* PB 06/30/2010 BEG                                               03530009
035400       88 PV-WROTE-REC-TYP-TRI-WHSE-RPLN       VALUE 'W'.         03540009
035500* PB 06/30/2010 END                                               03550009
035600                                                                  03560009
035700*DLJ 06/06/2003                                                   03570009
035800*RJ                                                               03580009
035900    05 PV-PROCESS-1ST-DELY-REC-SW   PIC X(01)  VALUE 'N'.         03590009
036000       88 PV-PROCESS-1ST-DELY-REC              VALUE 'Y'.         03600009
036100       88 PV-PROCESS-1ST-DELY-REC-NO           VALUE 'N'.         03610009
036200                                                                  03620009
036300    05 PV-DB2-OPERATION-ATTEMPTED                                 03630009
036400                                    PIC X(30)   VALUE SPACE.      03640009
036500    05 PV-ABEND-CODE                PIC S9(04)  VALUE +0          03650009
036600                                                COMP SYNC.        03660009
036700                                                                  03670009
036800    05 PV-PRT-TTL-READ.                                           03680009
036900      10                            PIC X(54) VALUE               03690009
037000         'TOTAL RECORDS READ:                                   '.03700009
037100      10 PV-EXTRACTS-READ-M           PIC Z,ZZZ,ZZ9.              03710009
037200    05 PV-PRT-TTL-WRITTEN.                                        03720009
037300      10                            PIC X(54) VALUE               03730009
037400         'TOTAL RECORDS WRITTEN:                                '.03740009
037500      10 PV-TOT-RECS-WRITTEN-M        PIC Z,ZZZ,ZZ9.              03750009
037600    05 PV-PRT-LTRI-PROCESSED.                                     03760009
037700      10                            PIC X(54) VALUE               03770009
037800         'TOTAL LOGICAL TRIANGLE FILE PROCESSED:                '.03780009
037900      10 PV-TOT-LTRI-PROCESSED-M      PIC Z,ZZZ,ZZ9.              03790009
038000    05 PV-PRT-LHUD-PROCESSED.                                     03800009
038100      10                            PIC X(54) VALUE               03810009
038200         'TOTAL LOGICAL HUDD FILES PROCESSED:                   '.03820009
038300      10 PV-TOT-LHUD-PROCESSED-M      PIC Z,ZZZ,ZZ9.              03830009
038400    05 PV-PRT-LEXP-PROCESSED.                                     03840009
038500      10                            PIC X(54) VALUE               03850009
038600         'TOTAL LOGICAL EXPEDITOR FILES PROCESSED:              '.03860009
038700      10 PV-TOT-LEXP-PROCESSED-M      PIC Z,ZZZ,ZZ9.              03870009
038800    05 PV-PRT-LMSK-PROCESSED.                                     03880009
038900      10                            PIC X(54) VALUE               03890009
039000         'TOTAL LOGICAL MAERSK FILES PROCESSED:                 '.03900009
039100      10 PV-TOT-LMSK-PROCESSED-M      PIC Z,ZZZ,ZZ9.              03910009
039200    05 PV-PRT-LNYK-PROCESSED.                                     03920009
039300      10                            PIC X(54) VALUE               03930009
039400         'TOTAL LOGICAL NYK FILES PROCESSED:                    '.03940009
039500      10 PV-TOT-LNYK-PROCESSED-M      PIC Z,ZZZ,ZZ9.              03950009
039600    05 PV-PRT-LVNG-PROCESSED.                                     03960009
039700      10                            PIC X(54) VALUE               03970009
039800         'TOTAL LOGICAL LIVINGSTON FILES PROCESSED:             '.03980009
039900      10 PV-TOT-LVNG-PROCESSED-M      PIC Z,ZZZ,ZZ9.              03990009
040000    05 PV-PRT-LAPS-PROCESSED.                                     04000009
040100      10                            PIC X(54) VALUE               04010009
040200         'TOTAL LOGICAL APS FILES PROCESSED:                    '.04020009
040300      10 PV-TOT-LAPS-PROCESSED-M      PIC Z,ZZZ,ZZ9.              04030009
040400    05 PV-PRT-LGLB-PROCESSED.                                     04040009
040500      10                            PIC X(54) VALUE               04050009
040600         'TOTAL LOGICAL GLB FILES PROCESSED:                    '.04060009
040700      10 PV-TOT-LGLB-PROCESSED-M      PIC Z,ZZZ,ZZ9.              04070009
040800    05 PV-PRT-LFLE-PROCESSED.                                     04080009
040900      10                            PIC X(54) VALUE               04090009
041000         'TOTAL LOGICAL FILES PROCESSED:                        '.04100009
041100      10 PV-TOT-LFLE-PROCESSED-M      PIC Z,ZZZ,ZZ9.              04110009
041200    05 PV-PRT-TTL-TRIANGLE-R.                                     04120009
041300      10                            PIC X(54) VALUE               04130009
041400         'TOTAL DECONSOLIDATOR RECORDS READ:                    '.04140009
041500      10 PV-DECONSOL-READ-M           PIC Z,ZZZ,ZZ9.              04150009
041600    05 PV-PRT-TTL-TRIANGLE-W.                                     04160009
041700      10                            PIC X(54) VALUE               04170009
041800         'TOTAL DECONSOLIDATOR RECORDS WRITTEN:                 '.04180009
041900      10 PV-DECONSOL-WRITTEN-M        PIC Z,ZZZ,ZZ9.              04190009
042000    05 PV-PRT-TTL-TRI-PKS-R.                                      04200009
042100      10                            PIC X(54) VALUE               04210009
042200         'TOTAL TRIANGLE PACKSLIP RECORDS READ:                 '.04220009
042300      10 PV-TRIANGLE-PACKSLIP-READ-M  PIC Z,ZZZ,ZZ9.              04230009
042400    05 PV-PRT-TTL-TRI-PKS-TEST-W.                                 04240009
042500      10                            PIC X(54) VALUE               04250009
042600         'TOTAL TRIANGLE TEST PACKSLIP RECORDS WRITTEN:         '.04260009
042700      10 PV-TRI-PACKSLIP-WRITTEN-TEST-M  PIC Z,ZZZ,ZZ9.           04270009
042800    05 PV-PRT-TTL-TRI-PKS-PROD-W.                                 04280009
042900      10                            PIC X(54) VALUE               04290009
043000         'TOTAL TRIANGLE PROD PACKSLIP RECORDS WRITTEN:         '.04300009
043100      10 PV-TRI-PACKSLIP-WRITTEN-PROD-M  PIC Z,ZZZ,ZZ9.           04310009
043200    05 PV-PRT-TTL-TRI-DELIVERY-R.                                 04320009
043300      10                            PIC X(54) VALUE               04330009
043400         'TOTAL TRIANGLE DELIVERY RECORDS READ:                 '.04340009
043500      10 PV-TRIANGLE-DELIVERY-READ-M  PIC Z,ZZZ,ZZ9.              04350009
043600    05 PV-PRT-TTL-TRI-DELIVERY-TEST-W.                            04360009
043700      10                            PIC X(54) VALUE               04370009
043800         'TOTAL TRIANGLE TEST DELIVERY RECORDS WRITTEN:         '.04380009
043900      10 PV-TRI-DELIVERY-WRITTEN-TEST-M  PIC Z,ZZZ,ZZ9.           04390009
044000    05 PV-PRT-TTL-TRI-DELIVERY-PROD-W.                            04400009
044100      10                            PIC X(54) VALUE               04410009
044200         'TOTAL TRIANGLE PROD DELIVERY RECORDS WRITTEN:         '.04420009
044300      10 PV-TRI-DELIVERY-WRITTEN-PROD-M  PIC Z,ZZZ,ZZ9.           04430009
044400    05 PV-PRT-TTL-HUD-DELIVERY-R.                                 04440009
044500      10                            PIC X(54) VALUE               04450009
044600         'TOTAL HUDD DELIVERY RECORDS READ:                     '.04460009
044700      10 PV-HUD-DELIVERY-READ-M  PIC Z,ZZZ,ZZ9.                   04470009
044800    05 PV-PRT-TTL-HUD-DELIVERY-TEST-W.                            04480009
044900      10                            PIC X(54) VALUE               04490009
045000         'TOTAL HUDD TEST DELIVERY RECORDS WRITTEN:             '.04500009
045100      10 PV-HUD-DELIVERY-WRITTEN-TEST-M  PIC Z,ZZZ,ZZ9.           04510009
045200    05 PV-PRT-TTL-HUD-DELIVERY-PROD-W.                            04520009
045300      10                            PIC X(54) VALUE               04530009
045400         'TOTAL HUDD PROD DELIVERY RECORDS WRITTEN:             '.04540009
045500      10 PV-HUD-DELIVERY-WRITTEN-PROD-M  PIC Z,ZZZ,ZZ9.           04550009
045600    05 PV-PRT-TTL-UWD-DELIVERY-R.                                 04560009
045700      10                            PIC X(54) VALUE               04570009
045800         'TOTAL UWDC DELIVERY RECORDS READ:                     '.04580009
045900      10 PV-UWD-DELIVERY-READ-M  PIC Z,ZZZ,ZZ9.                   04590009
046000    05 PV-PRT-TTL-UWD-DELIVERY-TEST-W.                            04600009
046100      10                            PIC X(54) VALUE               04610009
046200         'TOTAL UWDC TEST DELIVERY RECORDS WRITTEN:             '.04620009
046300      10 PV-UWD-DELIVERY-WRITTEN-TEST-M  PIC Z,ZZZ,ZZ9.           04630009
046400    05 PV-PRT-TTL-UWD-DELIVERY-PROD-W.                            04640009
046500      10                            PIC X(54) VALUE               04650009
046600         'TOTAL UWDC PROD DELIVERY RECORDS WRITTEN:             '.04660009
046700      10 PV-UWD-DELIVERY-WRITTEN-PROD-M  PIC Z,ZZZ,ZZ9.           04670009
046800    05 PV-PRT-TTL-APS-DELIVERY-R.                                 04680009
046900      10                            PIC X(54) VALUE               04690009
047000         'TOTAL APS DELIVERY RECORDS READ:                      '.04700009
047100      10 PV-APS-DELIVERY-READ-M  PIC Z,ZZZ,ZZ9.                   04710009
047200    05 PV-PRT-TTL-APS-DELIVERY-TEST-W.                            04720009
047300      10                            PIC X(54) VALUE               04730009
047400         'TOTAL APS TEST DELIVERY RECORDS WRITTEN:              '.04740009
047500      10 PV-APS-DELIVERY-WRITTEN-TEST-M  PIC Z,ZZZ,ZZ9.           04750009
047600    05 PV-PRT-TTL-APS-DELIVERY-PROD-W.                            04760009
047700      10                            PIC X(54) VALUE               04770009
047800         'TOTAL APS PROD DELIVERY RECORDS WRITTEN:              '.04780009
047900      10 PV-APS-DELIVERY-WRITTEN-PROD-M  PIC Z,ZZZ,ZZ9.           04790009
048000    05 PV-PRT-TTL-GLB-DELIVERY-R.                                 04800009
048100      10                            PIC X(54) VALUE               04810009
048200         'TOTAL GLB DELIVERY RECORDS READ:                      '.04820009
048300      10 PV-GLB-DELIVERY-READ-M   PIC Z,ZZZ,ZZ9.                  04830009
048400    05 PV-PRT-TTL-GLB-DELIVERY-TEST-W.                            04840009
048500      10                            PIC X(54) VALUE               04850009
048600         'TOTAL GLB TEST DELIVERY RECORDS WRITTEN:              '.04860009
048700      10 PV-GLB-DELIVERY-WRITTEN-TEST-M   PIC Z,ZZZ,ZZ9.          04870009
048800    05 PV-PRT-TTL-GLB-DELIVERY-PROD-W.                            04880009
048900      10                            PIC X(54) VALUE               04890009
049000         'TOTAL GLB PROD DELIVERY RECORDS WRITTEN:              '.04900009
049100      10 PV-GLB-DELIVERY-WRITTEN-PROD-M   PIC Z,ZZZ,ZZ9.          04910009
049200    05 PV-PRT-TTL-CON-PO-TRK-R.                                   04920009
049300      10                            PIC X(54) VALUE               04930009
049400         'TOTAL CONSOLIDATOR PO TRACKING RECORDS READ:          '.04940009
049500      10 PV-CONSOLIDATOR-READ-M       PIC Z,ZZZ,ZZ9.              04950009
049600    05 PV-PRT-TTL-CON-PO-TRK-W.                                   04960009
049700      10                            PIC X(54) VALUE               04970009
049800         'TOTAL CONSOLIDATOR PO TRACKING RECORDS WRITTEN:       '.04980009
049900      10 PV-CONSOLIDATOR-WRITTEN-M    PIC Z,ZZZ,ZZ9.              04990009
050000    05 PV-EXP-LINE-1.                                             05000009
050100      10                            PIC X(54) VALUE               05010009
050200         'TOTAL EXPEDITOR BOOKING RECORDS READ:                 '.05020009
050300      10 PV-EXP-BKG-READ-M            PIC Z,ZZZ,ZZ9.              05030009
050400    05 PV-EXP-LINE-2.                                             05040009
050500      10                            PIC X(54) VALUE               05050009
050600         'TOTAL EXPEDITOR TEST BOOKING RECORDS WRITTEN:         '.05060009
050700      10 PV-EXP-BKG-WRITTEN-TEST-M    PIC Z,ZZZ,ZZ9.              05070009
050800    05 PV-EXP-LINE-3.                                             05080009
050900      10                            PIC X(54) VALUE               05090009
051000         'TOTAL EXPEDITOR PROD BOOKING RECORDS WRITTEN:         '.05100009
051100      10 PV-EXP-BKG-WRITTEN-PROD-M    PIC Z,ZZZ,ZZ9.              05110009
051200    05 PV-EXP-LINE-4.                                             05120009
051300      10                            PIC X(54) VALUE               05130009
051400         'TOTAL EXPEDITOR RECEIVING RECORDS READ:               '.05140009
051500      10 PV-EXP-RCVG-READ-M           PIC Z,ZZZ,ZZ9.              05150009
051600    05 PV-EXP-LINE-5.                                             05160009
051700      10                            PIC X(54) VALUE               05170009
051800         'TOTAL EXPEDITOR TEST RECEIVING RECORDS WRITTEN:       '.05180009
051900      10 PV-EXP-RCVG-WRITTEN-TEST-M   PIC Z,ZZZ,ZZ9.              05190009
052000    05 PV-EXP-LINE-6.                                             05200009
052100      10                            PIC X(54) VALUE               05210009
052200         'TOTAL EXPEDITOR PROD RECEIVING RECORDS WRITTEN:       '.05220009
052300      10 PV-EXP-RCVG-WRITTEN-PROD-M   PIC Z,ZZZ,ZZ9.              05230009
052400    05 PV-EXP-LINE-7.                                             05240009
052500      10                            PIC X(54) VALUE               05250009
052600         'TOTAL EXPEDITOR CONTNR MANFST RECORDS READ:           '.05260009
052700      10 PV-EXP-CONMAN-READ-M         PIC Z,ZZZ,ZZ9.              05270009
052800    05 PV-EXP-LINE-8.                                             05280009
052900      10                            PIC X(54) VALUE               05290009
053000         'TOTAL EXPEDITOR TEST CONTNR MANFST RECS WRITTEN:      '.05300009
053100      10 PV-EXP-CONMAN-WRITTEN-TEST-M PIC Z,ZZZ,ZZ9.              05310009
053200    05 PV-EXP-LINE-9.                                             05320009
053300      10                            PIC X(54) VALUE               05330009
053400         'TOTAL EXPEDITOR PROD CONTNR MANFST RECS WRITTEN:      '.05340009
053500      10 PV-EXP-CONMAN-WRITTEN-PROD-M PIC Z,ZZZ,ZZ9.              05350009
053600    05 PV-EXP-LINE-10.                                            05360009
053700      10                            PIC X(54) VALUE               05370009
053800         'TOTAL EXPEDITOR ARRIVAL RECORDS READ:                 '.05380009
053900      10 PV-EXP-ARRIVAL-READ-M         PIC Z,ZZZ,ZZ9.             05390009
054000    05 PV-EXP-LINE-11.                                            05400009
054100      10                            PIC X(54) VALUE               05410009
054200         'TOTAL EXPEDITOR TEST ARRIVAL RECORDS WRITTEN:         '.05420009
054300      10 PV-EXP-ARRIVAL-WRITTEN-TEST-M PIC Z,ZZZ,ZZ9.             05430009
054400    05 PV-EXP-LINE-12.                                            05440009
054500      10                            PIC X(54) VALUE               05450009
054600         'TOTAL EXPEDITOR PROD ARRIVAL RECORDS WRITTEN:         '.05460009
054700      10 PV-EXP-ARRIVAL-WRITTEN-PROD-M PIC Z,ZZZ,ZZ9.             05470009
054800*****CUSTOMS                                                      05480009
054900    05 PV-EXP-LINE-13.                                            05490009
055000      10                            PIC X(54) VALUE               05500009
055100         'TOTAL EXPEDITOR CUSTOMS RECORDS READ:                 '.05510009
055200      10 PV-EXP-CUSTOMS-READ-M        PIC Z,ZZZ,ZZ9.              05520009
055300    05 PV-EXP-LINE-14.                                            05530009
055400      10                            PIC X(54) VALUE               05540009
055500         'TOTAL EXPEDITOR TEST CUSTOMS RECORDS WRITTEN:         '.05550009
055600      10 PV-EXP-CUSTOMS-WRITTEN-TEST-M PIC Z,ZZZ,ZZ9.             05560009
055700    05 PV-EXP-LINE-15.                                            05570009
055800      10                            PIC X(54) VALUE               05580009
055900         'TOTAL EXPEDITOR PROD CUSTOMS RECORDS WRITTEN:         '.05590009
056000      10 PV-EXP-CUSTOMS-WRITTEN-PROD-M PIC Z,ZZZ,ZZ9.             05600009
056100    05 PV-LVG-LINE-16.                                            05610009
056200      10                            PIC X(54) VALUE               05620009
056300         'TOTAL LIVINGSTON CUSTOMS RECORDS READ:                '.05630009
056400      10 PV-LVG-CUSTOMS-READ-M        PIC Z,ZZZ,ZZ9.              05640009
056500    05 PV-LVG-LINE-17.                                            05650009
056600      10                            PIC X(54) VALUE               05660009
056700         'TOTAL LIVINGSTON TEST CUSTOMS RECORDS WRITTEN:        '.05670009
056800      10 PV-LVG-CUSTOMS-WRITTEN-TEST-M PIC Z,ZZZ,ZZ9.             05680009
056900    05 PV-LVG-LINE-18.                                            05690009
057000      10                            PIC X(54) VALUE               05700009
057100         'TOTAL LIVINGSTON PROD CUSTOMS RECORDS WRITTEN:        '.05710009
057200      10 PV-LVG-CUSTOMS-WRITTEN-PROD-M PIC Z,ZZZ,ZZ9.             05720009
057300    05 PV-NYK-LINE-1.                                             05730009
057400      10                            PIC X(54) VALUE               05740009
057500         'TOTAL NYK LOGISTICS BOOKING RECORDS READ:             '.05750009
057600      10 PV-NYK-BKG-READ-M            PIC Z,ZZZ,ZZ9.              05760009
057700    05 PV-NYK-LINE-2.                                             05770009
057800      10                            PIC X(54) VALUE               05780009
057900         'TOTAL NYK LOGISTICS TEST BOOKING RECORDS WRITTEN:     '.05790009
058000      10 PV-NYK-BKG-WRITTEN-TEST-M    PIC Z,ZZZ,ZZ9.              05800009
058100    05 PV-NYK-LINE-3.                                             05810009
058200      10                            PIC X(54) VALUE               05820009
058300         'TOTAL NYK LOGISTICS PROD BOOKING RECORDS WRITTEN:     '.05830009
058400      10 PV-NYK-BKG-WRITTEN-PROD-M    PIC Z,ZZZ,ZZ9.              05840009
058500    05 PV-NYK-LINE-4.                                             05850009
058600      10                            PIC X(54) VALUE               05860009
058700         'TOTAL NYK LOGISTICS RECEIVING RECORDS READ:           '.05870009
058800      10 PV-NYK-RCVG-READ-M           PIC Z,ZZZ,ZZ9.              05880009
058900    05 PV-NYK-LINE-5.                                             05890009
059000      10                            PIC X(54) VALUE               05900009
059100         'TOTAL NYK LOGISTICS TEST RECEIVING RECORDS WRITTEN:   '.05910009
059200      10 PV-NYK-RCVG-WRITTEN-TEST-M   PIC Z,ZZZ,ZZ9.              05920009
059300    05 PV-NYK-LINE-6.                                             05930009
059400      10                            PIC X(54) VALUE               05940009
059500         'TOTAL NYK LOGISTICS PROD RECEIVING RECORDS WRITTEN:   '.05950009
059600      10 PV-NYK-RCVG-WRITTEN-PROD-M   PIC Z,ZZZ,ZZ9.              05960009
059700    05 PV-NYK-LINE-7.                                             05970009
059800      10                            PIC X(54) VALUE               05980009
059900         'TOTAL NYK LOGISTICS CONTNR MANFST RECORDS READ:       '.05990009
060000      10 PV-NYK-CONMAN-READ-M         PIC Z,ZZZ,ZZ9.              06000009
060100    05 PV-NYK-LINE-8.                                             06010009
060200      10                            PIC X(54) VALUE               06020009
060300         'TOTAL NYK LOGISTICS TEST CONTNR MANFST RECS WRITTEN:  '.06030009
060400      10 PV-NYK-CONMAN-WRITTEN-TEST-M PIC Z,ZZZ,ZZ9.              06040009
060500    05 PV-NYK-LINE-9.                                             06050009
060600      10                            PIC X(54) VALUE               06060009
060700         'TOTAL NYK LOGISTICS PROD CONTNR MANFST RECS WRITTEN:  '.06070009
060800      10 PV-NYK-CONMAN-WRITTEN-PROD-M PIC Z,ZZZ,ZZ9.              06080009
060900    05 PV-MAERSK-LINE-1.                                          06090009
061000      10                            PIC X(54) VALUE               06100009
061100         'TOTAL MAERSK BOOKING RECORDS READ:                    '.06110009
061200      10 PV-MAERSK-BKG-READ-M         PIC Z,ZZZ,ZZ9.              06120009
061300    05 PV-MAERSK-LINE-2.                                          06130009
061400      10                            PIC X(54) VALUE               06140009
061500         'TOTAL MAERSK TEST BOOKING RECORDS WRITTEN:            '.06150009
061600      10 PV-MAERSK-BKG-WRITTEN-TEST-M PIC Z,ZZZ,ZZ9.              06160009
061700    05 PV-MAERSK-LINE-3.                                          06170009
061800      10                            PIC X(54) VALUE               06180009
061900         'TOTAL MAERSK PROD BOOKING RECORDS WRITTEN:            '.06190009
062000      10 PV-MAERSK-BKG-WRITTEN-PROD-M PIC Z,ZZZ,ZZ9.              06200009
062100    05 PV-MAERSK-LINE-4.                                          06210009
062200      10                            PIC X(54) VALUE               06220009
062300         'TOTAL MAERSK RECEIVING RECORDS READ:                  '.06230009
062400      10 PV-MAERSK-RCVG-READ-M        PIC Z,ZZZ,ZZ9.              06240009
062500    05 PV-MAERSK-LINE-5.                                          06250009
062600      10                            PIC X(54) VALUE               06260009
062700         'TOTAL MAERSK TEST RECEIVING RECORDS WRITTEN:          '.06270009
062800      10 PV-MAERSK-RCVG-WRITTEN-TEST-M PIC Z,ZZZ,ZZ9.             06280009
062900    05 PV-MAERSK-LINE-6.                                          06290009
063000      10                            PIC X(54) VALUE               06300009
063100         'TOTAL MAERSK PROD RECEIVING RECORDS WRITTEN:          '.06310009
063200      10 PV-MAERSK-RCVG-WRITTEN-PROD-M PIC Z,ZZZ,ZZ9.             06320009
063300    05 PV-MAERSK-LINE-7.                                          06330009
063400      10                            PIC X(54) VALUE               06340009
063500         'TOTAL MAERSK CONTNR MANFST RECORDS READ:              '.06350009
063600      10 PV-MAERSK-CONMAN-READ-M      PIC Z,ZZZ,ZZ9.              06360009
063700    05 PV-MAERSK-LINE-8.                                          06370009
063800      10                            PIC X(54) VALUE               06380009
063900         'TOTAL MAERSK TEST CONTNR MANFST RECS WRITTEN:         '.06390009
064000      10 PV-MAERSK-CONMAN-WRITE-TEST-M PIC Z,ZZZ,ZZ9.             06400009
064100    05 PV-MAERSK-LINE-9.                                          06410009
064200      10                            PIC X(54) VALUE               06420009
064300         'TOTAL MAERSK PROD CONTNR MANFST RECS WRITTEN:         '.06430009
064400      10 PV-MAERSK-CONMAN-WRITE-PROD-M PIC Z,ZZZ,ZZ9.             06440009
064500    05 PV-EXCEPT-LINE-W.                                          06450009
064600      10                            PIC X(54) VALUE               06460009
064700         'TOTAL EXCEPTION RECORDS WRITTEN:                      '.06470009
064800      10 PV-EXCEPTION-WRITTEN-M       PIC Z,ZZZ,ZZ9.              06480009
064900    05 PV-TTL-FILES-LINE.                                         06490009
065000      10                            PIC X(54) VALUE               06500009
065100         'TOTAL FILES PROCESSED:                                '.06510009
065200      10 PV-LOGICAL-PROCESSED-M       PIC Z,ZZZ,ZZ9.              06520009
065300    05 PV-TRI-FILES-LINE.                                         06530009
065400      10                            PIC X(54) VALUE               06540009
065500         'TOTAL TRIANGLE FILES PROCESSED:                       '.06550009
065600      10 PV-LOGICAL-PROCESSED-TR-M    PIC Z,ZZZ,ZZ9.              06560009
065700    05 PV-HUD-FILES-LINE.                                         06570009
065800      10                            PIC X(54) VALUE               06580009
065900         'TOTAL HUDD FILES PROCESSED:                           '.06590009
066000      10 PV-LOGICAL-PROCESSED-HU-M    PIC Z,ZZZ,ZZ9.              06600009
066100    05 PV-UWD-FILES-LINE.                                         06610009
066200      10                            PIC X(54) VALUE               06620009
066300         'TOTAL UWDC FILES PROCESSED:                           '.06630009
066400      10 PV-LOGICAL-PROCESSED-UWD-M   PIC Z,ZZZ,ZZ9.              06640009
066500    05 PV-APS-FILES-LINE.                                         06650009
066600      10                            PIC X(54) VALUE               06660009
066700         'TOTAL APS FILES PROCESSED:                            '.06670009
066800      10 PV-LOGICAL-PROCESSED-AP-M    PIC Z,ZZZ,ZZ9.              06680009
066900    05 PV-GLB-FILES-LINE.                                         06690009
067000      10                            PIC X(54) VALUE               06700009
067100         'TOTAL GLB FILES PROCESSED:                            '.06710009
067200      10 PV-LOGICAL-PROCESSED-GB-M    PIC Z,ZZZ,ZZ9.              06720009
067300    05 PV-EXP-FILES-LINE.                                         06730009
067400      10                            PIC X(54) VALUE               06740009
067500         'TOTAL EXPEDITOR FILES PROCESSED:                      '.06750009
067600      10 PV-LOGICAL-PROCESSED-EX-M    PIC Z,ZZZ,ZZ9.              06760009
067700    05 PV-MAERSK-FILES-LINE.                                      06770009
067800      10                            PIC X(54) VALUE               06780009
067900         'TOTAL MAERSK FILES PROCESSED:                         '.06790009
068000      10 PV-LOGICAL-PROCESSED-MK-M    PIC Z,ZZZ,ZZ9.              06800009
068100    05 PV-NYK-FILES-LINE.                                         06810009
068200      10                            PIC X(54) VALUE               06820009
068300         'TOTAL NYK LOGISTICS FILES PROCESSED:                  '.06830009
068400      10 PV-LOGICAL-PROCESSED-OC-M    PIC Z,ZZZ,ZZ9.              06840009
068500    05 PV-LVG-FILES-LINE.                                         06850009
068600      10                            PIC X(54) VALUE               06860009
068700         'TOTAL LIVINGSTON FILES PROCESSED:                     '.06870009
068800      10 PV-LOGICAL-PROCESSED-LV-M    PIC Z,ZZZ,ZZ9.              06880009
068900    05 PV-NOT-PROC-LINE.                                          06890009
069000      10                            PIC X(54) VALUE               06900009
069100         'TOTAL FILES NOT PROCESSED:                            '.06910009
069200      10 PV-TOT-LOGICAL-BAD-M         PIC Z,ZZZ,ZZ9.              06920009
069300    05 PV-TOT-LOGICAL-FILE.                                       06930009
069400      10                            PIC X(54) VALUE               06940009
069500         'TOTAL LOGICAL FILES NOT PROCESSED:                    '.06950009
069600      10 PV-TOT-LOGICAL-FILE-NOT-P    PIC Z,ZZZ,ZZ9.              06960009
069700    05 PV-TOT-RECORDS-FILE.                                       06970009
069800      10                            PIC X(54) VALUE               06980009
069900         'TOTAL LOGICAL RECORDS NOT PROCESSED:                  '.06990009
070000      10 PV-TOT-LOGICAL-RECS-NOT-P    PIC Z,ZZZ,ZZ9.              07000009
070100                                                                  07010009
070200      05 PV-TOT-LOGICAL-REC-BAD-M     PIC Z,ZZZ,ZZ9.              07020009
070300    05 PV-INVALID-ENT-ID-LINE.                                    07030009
070400      10                            PIC X(54) VALUE               07040009
070500         'TOTAL ISA RECS WITH AN INVALID ENTITY ID:            '. 07050009
070600      10 PV-INVALID-ENT-ID-ON-ISA-M   PIC Z,ZZZ,ZZ9.              07060009
070700    05 PV-MISMATCH-LINE.                                          07070009
070800      10                            PIC X(54) VALUE               07080009
070900         'TOTAL LOGICAL FILE/CTT COUNT MISMATCHES:             '. 07090009
071000      10 PV-MIS-MATCHING-CTT-COUNT-M  PIC Z,ZZZ,ZZ9.              07100009
071100    05 PV-MISSING-FILE-LINE.                                      07110009
071200      10                            PIC X(54) VALUE               07120009
071300         'TOTAL LOGICAL FILES WITH MISSING CTT RECS:           '. 07130009
071400      10 PV-MISSING-CTT-RECS-M        PIC Z,ZZZ,ZZ9.              07140009
071500* PB 06/30/2010 BEG                                               07150009
071600    05 PV-PRT-TTL-TRI-WHSE-REPLEN-R.                              07160009
071700      10                            PIC X(54) VALUE               07170009
071800         'TOTAL TRIANGLE WHSE REPLEN RECORDS READ:             '. 07180009
071900      10 PV-TRIANGLE-WHSE-REPLEN-READ-M                           07190009
072000                                      PIC Z,ZZZ,ZZ9.              07200009
072100    05 PV-PRT-TTL-TRI-WHSE-RPLN-TST-W.                            07210009
072200      10                            PIC X(54) VALUE               07220009
072300         'TOTAL TRIANGLE TEST WHSE REPLEN RECORDS WRITTEN:     '. 07230009
072400      10 PV-TRI-WHSE-RPLN-WRITTEN-TST-M                           07240009
072500                                      PIC Z,ZZZ,ZZ9.              07250009
072600    05 PV-PRT-TTL-TRI-WHSE-RPLN-PRD-W.                            07260009
072700      10                            PIC X(54) VALUE               07270009
072800         'TOTAL TRIANGLE PROD WHSE REPLEN RECORDS WRITTEN:     '. 07280009
072900      10 PV-TRI-WHSE-RPLN-WRITTEN-PRD-M                           07290009
073000                                      PIC Z,ZZZ,ZZ9.              07300009
073100    05 PV-PRT-TTL-HUD-WHSE-REPLEN-R.                              07310009
073200      10                            PIC X(54) VALUE               07320009
073300         'TOTAL HUDD WHSE REPLEN RECORDS READ:                 '. 07330009
073400      10 PV-HUD-WHSE-REPLEN-READ-M  PIC Z,ZZZ,ZZ9.                07340009
073500    05 PV-PRT-TTL-HUD-WHSE-RPLN-TST-W.                            07350009
073600      10                            PIC X(54) VALUE               07360009
073700         'TOTAL HUDD TEST WHSE REPLEN RECORDS WRITTEN:         '. 07370009
073800      10 PV-HUD-WHSE-RPLN-WRITTEN-TST-M                           07380009
073900                                      PIC Z,ZZZ,ZZ9.              07390009
074000    05 PV-PRT-TTL-HUD-WHSE-RPLN-PRD-W.                            07400009
074100      10                            PIC X(54) VALUE               07410009
074200         'TOTAL HUDD PROD WHSE REPLEN RECORDS WRITTEN:         '. 07420009
074300      10 PV-HUD-WHSE-RPLN-WRITTEN-PRD-M                           07430009
074400                                      PIC Z,ZZZ,ZZ9.              07440009
074500    05 PV-PRT-TTL-APS-WHSE-REPLEN-R.                              07450009
074600      10                            PIC X(54) VALUE               07460009
074700         'TOTAL APS WHSE REPLEN RECORDS READ:                  '. 07470009
074800      10 PV-APS-WHSE-REPLEN-READ-M  PIC Z,ZZZ,ZZ9.                07480009
074900    05 PV-PRT-TTL-APS-WHSE-RPLN-TST-W.                            07490009
075000      10                            PIC X(54) VALUE               07500009
075100         'TOTAL APS TEST WHSE REPLEN RECORDS WRITTEN:          '. 07510009
075200      10 PV-APS-WHSE-RPLN-WRITTEN-TST-M                           07520009
075300                                      PIC Z,ZZZ,ZZ9.              07530009
075400    05 PV-PRT-TTL-APS-WHSE-RPLN-PRD-W.                            07540009
075500      10                            PIC X(54) VALUE               07550009
075600         'TOTAL APS PROD WHSE REPLEN RECORDS WRITTEN:          '. 07560009
075700      10 PV-APS-WHSE-RPLN-WRITTEN-PRD-M                           07570009
075800                                      PIC Z,ZZZ,ZZ9.              07580009
075900    05 PV-PRT-TTL-GLB-WHSE-REPLEN-R.                              07590009
076000      10                            PIC X(54) VALUE               07600009
076100         'TOTAL GLB WHSE REPLEN RECORDS READ:                  '. 07610009
076200      10 PV-GLB-WHSE-REPLEN-READ-M  PIC Z,ZZZ,ZZ9.                07620009
076300    05 PV-PRT-TTL-GLB-WHSE-RPLN-TST-W.                            07630009
076400      10                            PIC X(54) VALUE               07640009
076500         'TOTAL GLB TEST WHSE REPLEN RECORDS WRITTEN:          '. 07650009
076600      10 PV-GLB-WHSE-RPLN-WRITTEN-TST-M                           07660009
076700                                      PIC Z,ZZZ,ZZ9.              07670009
076800    05 PV-PRT-TTL-GLB-WHSE-RPLN-PRD-W.                            07680009
076900      10                            PIC X(54) VALUE               07690009
077000         'TOTAL GLB PROD WHSE REPLEN RECORDS WRITTEN:          '. 07700009
077100      10 PV-GLB-WHSE-RPLN-WRITTEN-PRD-M                           07710009
077200                                      PIC Z,ZZZ,ZZ9.              07720009
077300    05 PV-PRT-TTL-UWD-WHSE-REPLEN-R.                              07730009
077400      10                            PIC X(54) VALUE               07740009
077500         'TOTAL UWDC WHSE REPLEN RECORDS READ:                 '. 07750009
077600      10 PV-UWD-WHSE-REPLEN-READ-M  PIC Z,ZZZ,ZZ9.                07760009
077700    05 PV-PRT-TTL-UWD-WHSE-RPLN-TST-W.                            07770009
077800      10                            PIC X(54) VALUE               07780009
077900         'TOTAL UWD TEST WHSE REPLEN RECORDS WRITTEN:          '. 07790009
078000      10 PV-UWD-WHSE-RPLN-WRITTEN-TST-M                           07800009
078100                                      PIC Z,ZZZ,ZZ9.              07810009
078200    05 PV-PRT-TTL-UWD-WHSE-RPLN-PRD-W.                            07820009
078300      10                            PIC X(54) VALUE               07830009
078400         'TOTAL UWD PROD WHSE REPLEN RECORDS WRITTEN:          '. 07840009
078500      10 PV-UWD-WHSE-RPLN-WRITTEN-PRD-M                           07850009
078600                                      PIC Z,ZZZ,ZZ9.              07860009
078700* PB 06/30/2010 END                                               07870009
078800                                                                  07880009
078900 01  PV-SUB-SRIPTS     COMP SYNC.                                 07890009
079000    05 PV-NAME-SUB                  PIC S9(04) VALUE +0.          07900009
079100                                                                  07910009
079200 01 PV-HOLD-VARIABLES.                                            07920009
079300    05 PV-HOLD-FILE-ID              PIC X(09) VALUE SPACES.       07930009
079400    05 PV-HOLD-ENT-ID               PIC 9(09) VALUE ZEROES.       07940009
079500                                                                  07950009
079600 01 PV-CTT-RECORD-TYPE.                                           07960009
079700    05 PV-CTT-RECORD-ID          PIC  X(03)  VALUE SPACES.        07970009
079800    05 FILLER                    PIC  X(01)  VALUE SPACES.        07980009
079900    05 PV-CTT-RECORD-COUNT       PIC  9(06)  VALUE ZEROES.        07990009
080000    05 FILLER                    PIC  X(290) VALUE SPACES.        08000009
080100                                                                  08010009
080200 01  PV-COUNTERS COMP-3.                                          08020009
080300     05  PV-EXCP-COUNTER                PIC S9(7) VALUE ZERO.     08030009
080400     05  PV-EXTRACTS-READ               PIC S9(7) VALUE ZERO.     08040009
080500     05  PV-TOT-RECS-WRITTEN            PIC S9(7) VALUE ZERO.     08050009
080600     05  PV-TOT-LOGICAL-BAD             PIC S9(7) VALUE ZERO.     08060009
080700     05  PV-TOT-LOGICAL-REC-BAD         PIC S9(7) VALUE ZERO.     08070009
080800     05  PV-INVALID-ENT-ID-ON-ISA       PIC S9(7) VALUE ZERO.     08080009
080900     05  PV-MIS-MATCHING-CTT-COUNT      PIC S9(7) VALUE ZERO.     08090009
081000     05  PV-MISSING-CTT-RECS            PIC S9(7) VALUE ZERO.     08100009
081100     05  PV-DECONSOL-READ               PIC S9(7) VALUE ZERO.     08110009
081200     05  PV-DECONSOL-WRITTEN            PIC S9(7) VALUE ZERO.     08120009
081300     05  PV-TRI-PKSLP-READ              PIC S9(7) VALUE ZERO.     08130009
081400     05  PV-TRI-PKSLP-WRITTEN-TEST      PIC S9(7) VALUE ZERO.     08140009
081500     05  PV-TRI-PKSLP-WRITTEN-PROD      PIC S9(7) VALUE ZERO.     08150009
081600     05  PV-TRI-DELIVERY-READ           PIC S9(7) VALUE ZERO.     08160009
081700     05  PV-TRI-DELIVERY-WRITTEN-TEST   PIC S9(7) VALUE ZERO.     08170009
081800     05  PV-TRI-DELIVERY-WRITTEN-PROD   PIC S9(7) VALUE ZERO.     08180009
081900     05  PV-HUD-DELIVERY-READ           PIC S9(7) VALUE ZERO.     08190009
082000     05  PV-HUD-DELIVERY-WRITTEN-TEST   PIC S9(7) VALUE ZERO.     08200009
082100     05  PV-HUD-DELIVERY-WRITTEN-PROD   PIC S9(7) VALUE ZERO.     08210009
082200     05  PV-APS-DELIVERY-READ           PIC S9(7) VALUE ZERO.     08220009
082300     05  PV-APS-DELIVERY-WRITTEN-TEST   PIC S9(7) VALUE ZERO.     08230009
082400     05  PV-APS-DELIVERY-WRITTEN-PROD   PIC S9(7) VALUE ZERO.     08240009
082500     05  PV-GLB-DELIVERY-READ           PIC S9(7) VALUE ZERO.     08250009
082600     05  PV-GLB-DELIVERY-WRITTEN-TEST   PIC S9(7) VALUE ZERO.     08260009
082700     05  PV-GLB-DELIVERY-WRITTEN-PROD   PIC S9(7) VALUE ZERO.     08270009
082800     05  PV-UWD-DELIVERY-READ           PIC S9(7) VALUE ZERO.     08280009
082900     05  PV-UWD-DELIVERY-WRITTEN-TEST   PIC S9(7) VALUE ZERO.     08290009
083000     05  PV-UWD-DELIVERY-WRITTEN-PROD   PIC S9(7) VALUE ZERO.     08300009
083100     05  PV-CONSOLIDATOR-READ           PIC S9(7) VALUE ZERO.     08310009
083200     05  PV-CONSOLIDATOR-WRITTEN        PIC S9(7) VALUE ZERO.     08320009
083300     05  PV-NYK-READ                    PIC S9(7) VALUE ZERO.     08330009
083400     05  PV-NYK-WRITTEN                 PIC S9(7) VALUE ZERO.     08340009
083500     05  PV-EXP-BKG-READ                PIC S9(7) VALUE ZERO.     08350009
083600     05  PV-EXP-RCVG-READ               PIC S9(7) VALUE ZERO.     08360009
083700     05  PV-EXP-CONMAN-READ             PIC S9(7) VALUE ZERO.     08370009
083800     05  PV-EXP-ARRIVAL-READ            PIC S9(7) VALUE ZERO.     08380009
083900     05  PV-EXP-CUSTOMS-READ            PIC S9(7) VALUE ZERO.     08390009
084000     05  PV-EXP-BKG-WRITTEN-TEST        PIC S9(7) VALUE ZERO.     08400009
084100     05  PV-EXP-BKG-WRITTEN-PROD        PIC S9(7) VALUE ZERO.     08410009
084200     05  PV-EXP-RCVG-WRITTEN-TEST       PIC S9(7) VALUE ZERO.     08420009
084300     05  PV-EXP-RCVG-WRITTEN-PROD       PIC S9(7) VALUE ZERO.     08430009
084400     05  PV-EXP-CONMAN-WRITTEN-TEST     PIC S9(7) VALUE ZERO.     08440009
084500     05  PV-EXP-CONMAN-WRITTEN-PROD     PIC S9(7) VALUE ZERO.     08450009
084600     05  PV-EXP-ARRIVAL-WRITTEN-TEST    PIC S9(7) VALUE ZERO.     08460009
084700     05  PV-EXP-ARRIVAL-WRITTEN-PROD    PIC S9(7) VALUE ZERO.     08470009
084800     05  PV-EXP-CUSTOMS-WRITTEN-TEST    PIC S9(7) VALUE ZERO.     08480009
084900     05  PV-EXP-CUSTOMS-WRITTEN-PROD    PIC S9(7) VALUE ZERO.     08490009
085000     05  PV-LVG-CUSTOMS-WRITTEN-TEST    PIC S9(7) VALUE ZERO.     08500009
085100     05  PV-LVG-CUSTOMS-WRITTEN-PROD    PIC S9(7) VALUE ZERO.     08510009
085200     05  PV-LVG-CUSTOMS-READ            PIC S9(7) VALUE ZERO.     08520009
085300     05  PV-NYK-BKG-READ                PIC S9(7) VALUE ZERO.     08530009
085400     05  PV-NYK-RCVG-READ               PIC S9(7) VALUE ZERO.     08540009
085500     05  PV-NYK-CONMAN-READ             PIC S9(7) VALUE ZERO.     08550009
085600     05  PV-NYK-CUSTOMS-READ            PIC S9(7) VALUE ZERO.     08560009
085700     05  PV-NYK-BKG-WRITTEN-TEST        PIC S9(7) VALUE ZERO.     08570009
085800     05  PV-NYK-BKG-WRITTEN-PROD        PIC S9(7) VALUE ZERO.     08580009
085900     05  PV-NYK-RCVG-WRITTEN-TEST       PIC S9(7) VALUE ZERO.     08590009
086000     05  PV-NYK-RCVG-WRITTEN-PROD       PIC S9(7) VALUE ZERO.     08600009
086100     05  PV-NYK-CONMAN-WRITTEN-TEST     PIC S9(7) VALUE ZERO.     08610009
086200     05  PV-NYK-CONMAN-WRITTEN-PROD     PIC S9(7) VALUE ZERO.     08620009
086300     05  PV-MAERSK-BKG-READ             PIC S9(7) VALUE ZERO.     08630009
086400     05  PV-MAERSK-RCVG-READ            PIC S9(7) VALUE ZERO.     08640009
086500     05  PV-MAERSK-CONMAN-READ          PIC S9(7) VALUE ZERO.     08650009
086600     05  PV-MAERSK-BKG-WRITTEN-TEST     PIC S9(7) VALUE ZERO.     08660009
086700     05  PV-MAERSK-BKG-WRITTEN-PROD     PIC S9(7) VALUE ZERO.     08670009
086800     05  PV-MAERSK-RCVG-WRITTEN-TEST    PIC S9(7) VALUE ZERO.     08680009
086900     05  PV-MAERSK-RCVG-WRITTEN-PROD    PIC S9(7) VALUE ZERO.     08690009
087000     05  PV-MAERSK-CONMAN-WRITTEN-TEST  PIC S9(7) VALUE ZERO.     08700009
087100     05  PV-MAERSK-CONMAN-WRITTEN-PROD  PIC S9(7) VALUE ZERO.     08710009
087200     05  PV-EXCEPTION-WRITTEN           PIC S9(7) VALUE ZERO.     08720009
087300     05  PV-DATA-RECS-PER-LOGICAL-FILE  PIC  9(5) VALUE ZERO.     08730009
087400     05  PV-LOGICAL-PROCESSED           PIC S9(7) VALUE ZERO.     08740009
087500     05  PV-LOGICAL-PROCESSED-TR        PIC S9(7) VALUE ZERO.     08750009
087600     05  PV-LOGICAL-PROCESSED-HU        PIC S9(7) VALUE ZERO.     08760009
087700     05  PV-LOGICAL-PROCESSED-UWD       PIC S9(7) VALUE ZERO.     08770009
087800     05  PV-LOGICAL-PROCESSED-EX        PIC S9(7) VALUE ZERO.     08780009
087900     05  PV-LOGICAL-PROCESSED-LV        PIC S9(7) VALUE ZERO.     08790009
088000     05  PV-LOGICAL-PROCESSED-MK        PIC S9(7) VALUE ZERO.     08800009
088100     05  PV-LOGICAL-PROCESSED-OC        PIC S9(7) VALUE ZERO.     08810009
088200     05  PV-LOGICAL-PROCESSED-AP        PIC S9(7) VALUE ZERO.     08820009
088300     05  PV-LOGICAL-PROCESSED-GB        PIC S9(7) VALUE ZERO.     08830009
088400     05  PV-LINE-CNT                    PIC S9(5) VALUE ZERO.     08840009
088500     05  PV-PAGE-CNT                    PIC S9(5) VALUE ZERO.     08850009
088600     05  PV-RETRY-COUNTER               PIC S9(4) VALUE ZERO.     08860009
088700* PB 06/30/2010 BEG                                               08870009
088800     05  PV-TRI-WHSE-REPLEN-READ        PIC S9(7) VALUE ZERO.     08880009
088900     05  PV-TRI-WHSE-RPLN-WRITTEN-TST   PIC S9(7) VALUE ZERO.     08890009
089000     05  PV-TRI-WHSE-RPLN-WRITTEN-PRD   PIC S9(7) VALUE ZERO.     08900009
089100     05  PV-HUD-WHSE-REPLEN-READ        PIC S9(7) VALUE ZERO.     08910009
089200     05  PV-HUD-WHSE-RPLN-WRITTEN-TST   PIC S9(7) VALUE ZERO.     08920009
089300     05  PV-HUD-WHSE-RPLN-WRITTEN-PRD   PIC S9(7) VALUE ZERO.     08930009
089400     05  PV-APS-WHSE-REPLEN-READ        PIC S9(7) VALUE ZERO.     08940009
089500     05  PV-APS-WHSE-RPLN-WRITTEN-TST   PIC S9(7) VALUE ZERO.     08950009
089600     05  PV-APS-WHSE-RPLN-WRITTEN-PRD   PIC S9(7) VALUE ZERO.     08960009
089700     05  PV-GLB-WHSE-REPLEN-READ        PIC S9(7) VALUE ZERO.     08970009
089800     05  PV-GLB-WHSE-RPLN-WRITTEN-TST   PIC S9(7) VALUE ZERO.     08980009
089900     05  PV-GLB-WHSE-RPLN-WRITTEN-PRD   PIC S9(7) VALUE ZERO.     08990009
090000     05  PV-UWD-WHSE-REPLEN-READ        PIC S9(7) VALUE ZERO.     09000009
090100     05  PV-UWD-WHSE-RPLN-WRITTEN-TST   PIC S9(7) VALUE ZERO.     09010009
090200     05  PV-UWD-WHSE-RPLN-WRITTEN-PRD   PIC S9(7) VALUE ZERO.     09020009
090300* PB 06/30/2010 END                                               09030009
090400                                                                  09040009
090500                                                                  09050009
090600     COPY TRRD090.                                                09060009
090700                                                                  09070009
090800                                                                  09080009
090900 01 PV-WS-RECORD-TYPE.                                            09090009
091000    05 PV-WS-RCD-TYPE.                                            09100009
091100* TRIANGLE PACKSLIP RECORDS                                       09110009
091200       10 PV-WS-EDI-RCD-TYPE        PIC X(07).                    09120009
091300       10 PV-WS-EDI-RCD-TYPE-RED REDEFINES PV-WS-EDI-RCD-TYPE     09130009
091400                                    PIC X(03).                    09140009
091500          88 PV-WS-EDI-RCD-TYPE-ISA VALUE 'ISA'.                  09150009
091600          88 PV-WS-EDI-RCD-TYPE-CTT VALUE 'CTT'.                  09160009
091700          88 PV-WS-EDI-RCD-TYPE-IEA VALUE 'IEA'.                  09170009
091800       10 PV-WS-PCK-SLP-RCD REDEFINES PV-WS-EDI-RCD-TYPE.         09180009
091900          15 FILLER                 PIC X(01).                    09190009
092000          15 PV-WS-PCK-SLP-RCD-TYP  PIC X(06).                    09200009
092100             88 PV-WS-PCK-SLP-PO   VALUE 'PO'.                    09210009
092200             88 PV-WS-PCK-SLP-POL  VALUE 'POL'.                   09220009
092300* TRIANGLE DELIVERY RECORDS                                       09230009
092400* PB 06/30/2010                                                   09240009
092500* ADDED 'ARVDCN' TYPE                                             09250009
092600       10 PV-WS-TRI-DELIVERY-RCD REDEFINES PV-WS-EDI-RCD-TYPE.    09260009
092700          15 FILLER                         PIC X(01).            09270009
092800          15 PV-WS-TRI-DELIVERY-RCD-TYP     PIC X(06).            09280009
092900             88 PV-WS-TRI-REC-TYP-DELIVERY  VALUE 'DVN '          09290009
093000                                                  'DPU '          09300009
093100                                                  'CRP '          09310009
093200                                                  'RTN '          09320009
093300                                                  'ARVDCN'        09330009
093400                                                  'DLV '.         09340009
093500* PB 06/30/2010 BEG                                               09350009
093600* TRIANGLE WAREHOUSE REPLENISHMENT RECORDS                        09360009
093700       10 PV-WS-TRI-WHSE-REPLEN-RCD REDEFINES PV-WS-EDI-RCD-TYPE. 09370009
093800          15 FILLER                         PIC X(01).            09380009
093900          15 PV-WS-TRI-WHSE-REPLEN-RCD-TYP  PIC X(06).            09390009
094000             88 PV-WS-TRI-REC-TYP-WHSE-REPLEN                     09400009
094100                                            VALUE 'RPLTRP'        09410009
094200                                                  'RPLPO '        09420009
094300                                                  'RPLCRT'.       09430009
094400* PB 06/30/2010 END                                               09440009
094500* CONSOLIDATOR PO IMPORT TRACKING RECORDS                         09450009
094600    05 PV-WS-IMP-RCD REDEFINES PV-WS-RCD-TYPE.                    09460009
094700       10 FILLER                    PIC X(01).                    09470009
094800       10 PV-WS-IMP-RCD-TYPE        PIC X(06).                    09480009
094900          88 PV-WS-REC-TYP-BKG      VALUE 'EDL '                  09490009
095000                                          'EDLVS'                 09500009
095100                                          'EDLUPC'                09510009
095200                                          'EDD'                   09520009
095300                                          'EDDRSN'.               09530009
095400          88 PV-WS-REC-TYP-RCVG     VALUE 'ERD '                  09540009
095500                                          'ERDRSN'                09550009
095600                                          'LOG'                   09560009
095700                                          'LOGVS'                 09570009
095800                                          'LOGUPC'                09580009
095900                                          'WHS'                   09590009
096000                                          'WHSVS'                 09600009
096100                                          'WHSUPC'.               09610009
096200          88 PV-WS-REC-TYP-CONT-MANIFEST                          09620009
096300                                    VALUE 'CVYA'                  09630009
096400                                          'CVYB'                  09640009
096500                                          'CONA'                  09650009
096600                                          'CONB'                  09660009
096700                                          'CONPOA'                09670009
096800                                          'CONPOB'                09680009
096900                                          'CONPOC'                09690009
097000                                          'CONUPA'                09700009
097100                                          'CONUPB'                09710009
097200                                          'CONUPC'                09720009
097300                                          'CNCART'                09730009
097400                                          'CNSEAL'                09740009
097500                                          'DOX '.                 09750009
097600          88 PV-WS-REC-TYP-ARRIVAL  VALUE 'ETA '                  09760009
097700                                          'ADU '.                 09770009
097800          88 PV-WS-REC-TYP-CUSTOMS  VALUE 'ENF '                  09780009
097900                                          'ENFBOL'                09790009
098000                                          'ENFCON'                09800009
098100                                          'ENFPO'                 09810009
098200                                          'EXD '                  09820009
098300                                          'REJ '                  09830009
098400                                          'ECR '                  09840009
098500                                          'RLS '                  09850009
098600                                          'LIQ '                  09860009
098700                                          'LSU '                  09870009
098800                                          'DOP '.                 09880009
098900     05 FILLER                      PIC X(25).                    09890009
099000     05 PV-WS-IMP-VEND-INCHG-ID-DESC PIC X(02).                   09900009
099100     05 FILLER                      PIC X(01).                    09910009
099200     05 PV-WS-IMP-VEND-INCHG-ID     PIC X(15).                    09920009
099300     05 FILLER                      PIC X(52).                    09930009
099400     05 PV-WS-EDI-TEST-IND          PIC X(01).                    09940009
099500     05 FILLER                      PIC X(44).                    09950009
099600     05 PV-WS-CONSOL-END            PIC X(01).                    09960009
099700     05 PV-WS-EDI-SEG-END           PIC X(01).                    09970009
099800     05 PV-WS-EDI                   PIC X(01).                    09980009
099900     05 PV-WS-FILE-ID               PIC X(09).                    09990009
100000     05 PV-WS-ENT-ID                PIC 9(09).                    10000009
100100     05 FILLER                      PIC X(132).                   10010009
100200                                                                  10020009
100300                                                                  10030009
100400 01 HEAD-LINE1.                                                   10040009
100500      10                            PIC X(49) VALUE SPACES.       10050009
100600      10                            PIC X(35) VALUE               10060009
100700         'IMPORT EDI PROPRIETARY SPLIT REPORT'.                   10070009
100800                                                                  10080009
100900 01 HEAD-LINE2.                                                   10090009
101000      10                            PIC X(54) VALUE               10100009
101100         '*** THERE WERE EXCEPTION FILES OR RECORDS FOR THIS RUN'.10110009
101200      10                            PIC X(27) VALUE               10120009
101300         '.  CONTACT PROGRAMMING. ***'.                           10130009
101400                                                                  10140009
101500 01 HEAD-LINE3.                                                   10150009
101600      10                            PIC X(52) VALUE               10160009
101700         'STATISTICS (TOTALS INCLUDE ISA, CTT AND IEA RECORDS)'.  10170009
101800                                                                  10180009
101900 01 HEAD-LINE4.                                                   10190009
102000      10                            PIC X(52) VALUE               10200009
102100         '----------------------------------------------------'.  10210009
102200                                                                  10220009
102300 01 HEAD-LINE5.                                                   10230009
102400      10                            PIC X(55) VALUE               10240009
102500        'THERE WERE NOT EXCEPTION FILES OR RECORDS FOR THIS RUN.'.10250009
102600                                                                  10260009
102700 01 PC-PROGRAM-CONSTANTS.                                         10270009
102800    05 PC-QUOTE                     PIC X(01) VALUE X'7D'.        10280009
102900    05 PC-PERCENT                   PIC X(01) VALUE '%'.          10290009
103000    05 PC-OCSNY                     PIC X(05) VALUE 'OCSNY'.      10300009
103100    05 PC-OCSNY-ENTID               PIC 9(11) VALUE 30692.        10310009
103200    05 PC-UWDC-ENTID                PIC 9(11) VALUE 55883.        10320009
103300    05 PC-ZZ                        PIC X(02) VALUE 'ZZ'.         10330009
103400    05 PC-FINISHED-SW               PIC X(01) VALUE 'N'.          10340009
103500       88 PC-DONE                             VALUE 'Y'.          10350009
103600       88 PC-NOT-DONE                         VALUE 'N'.          10360009
103700    05  PC-MAX-RETRIES              PIC 9(03) VALUE 3.            10370009
103800*RJ IF NEW VENDORS ARE ADDED, BUMP THIS NBR UP                    10380009
103900    05  PC-NBR-OF-VEND              PIC 9(03) VALUE 11.           10390009
104000                                                                  10400009
104100    05  PC-VENDOR-TABLE.                                          10410009
104200* IF NEW VENDORS NEED TO BE ADDED, JUST ADD THEM HERE, UP TO 11.  10420009
104300        10 FILLER                   PIC X(30)                     10430009
104400                                    VALUE 'TRIANGLE'.             10440009
104500        10 FILLER                   PIC X(30)                     10450009
104600                                    VALUE 'HELLMAN'.              10460009
104700        10 FILLER                   PIC X(30)                     10470009
104800                                    VALUE 'EXPEDITOR'.            10480009
104900        10 FILLER                   PIC X(30)                     10490009
105000                                    VALUE 'MAERSK LOGISTICS'.     10500009
105100        10 FILLER                   PIC X(30)                     10510009
105200                                    VALUE 'NYK LOGISTICS (OCS)'.  10520009
105300        10 FILLER                   PIC X(30)                     10530009
105400                                    VALUE 'HUDD'.                 10540009
105500        10 FILLER                   PIC X(30)                     10550009
105600*         * NYK LOGISTICS DOMESTIC IS THE UWDC DECON FOR OCS      10560009
105700                                 VALUE 'NYK LOGISTICS DOMESTIC'.  10570009
105800        10 FILLER                   PIC X(30)                     10580009
105900                                  VALUE 'AMERICAN PORT SERV INC'. 10590009
106000        10 FILLER                   PIC X(30)                     10600009
106100                                  VALUE 'GILBERT COMPANY'.        10610009
106200        10 FILLER                   PIC X(30)                     10620009
106300                                  VALUE 'SCHNEIDER LOGISTICS'.    10630009
106400        10 FILLER                   PIC X(30)                     10640009
106500                                VALUE 'LIVINGSTON INTERNATIONAL'. 10650009
106600    05  FILLER REDEFINES PC-VENDOR-TABLE.                         10660009
106700        10 PC-VENDOR OCCURS 11 TIMES                              10670009
106800                                    PIC X(30).                    10680009
106900                                                                  10690009
107000 01  PS-PROGRAM-SWITCHES.                                         10700009
107100     05  PS-MORE-INPUT-RECS-SW           PIC X(01) VALUE 'Y'.     10710009
107200         88  PS-NO-MORE-INPUT-RECS                 VALUE 'N'.     10720009
107300         88  PS-MORE-INPUT-RECS                    VALUE 'Y'.     10730009
107400     05  PS-VENDOR-FOUND-SW              PIC X(01) VALUE 'N'.     10740009
107500         88  PS-VENDOR-FOUND                       VALUE 'Y'.     10750009
107600         88  PS-VENDOR-FOUND-NO                    VALUE 'N'.     10760009
107700     05  PS-ISA-PRESENT-SW               PIC X(01) VALUE 'N'.     10770009
107800         88  PS-ISA-PRESENT                        VALUE 'Y'.     10780009
107900         88  PS-ISA-PRESENT-NO                     VALUE 'N'.     10790009
108000     05  PS-FILE-HAS-VALID-ENT-ID-SW     PIC X(01) VALUE 'N'.     10800009
108100         88  PS-FILE-HAS-VALID-ENT-ID              VALUE 'Y'.     10810009
108200         88  PS-FILE-HAS-VALID-ENT-ID-NO           VALUE 'N'.     10820009
108300     05  PS-CTT-PRESENT-SW               PIC X(01) VALUE 'N'.     10830009
108400         88  PS-CTT-PRESENT                        VALUE 'Y'.     10840009
108500         88  PS-CTT-PRESENT-NO                     VALUE 'N'.     10850009
108600     05  PS-IEA-PRESENT-SW               PIC X(01) VALUE 'N'.     10860009
108700         88  PS-IEA-PRESENT                        VALUE 'Y'.     10870009
108800         88  PS-IEA-PRESENT-NO                     VALUE 'N'.     10880009
108900     05  PS-ISA-NOT-WRIT-BKG-SW          PIC X(01) VALUE 'N'.     10890009
109000         88  PS-ISA-WRIT-BKG                       VALUE 'Y'.     10900009
109100         88  PS-ISA-NOT-WRIT-BKG                   VALUE 'N'.     10910009
109200     05  PS-ISA-NOT-WRIT-BKG-TST-SW      PIC X(01) VALUE 'N'.     10920009
109300         88  PS-ISA-WRIT-BKG-TST                   VALUE 'Y'.     10930009
109400         88  PS-ISA-NOT-WRIT-BKG-TST               VALUE 'N'.     10940009
109500     05  PS-ISA-NOT-WRIT-RCVG-SW         PIC X(01) VALUE 'N'.     10950009
109600         88  PS-ISA-WRIT-RCVG                      VALUE 'Y'.     10960009
109700         88  PS-ISA-NOT-WRIT-RCVG                  VALUE 'N'.     10970009
109800     05  PS-ISA-NOT-WRIT-RCVG-TST-SW     PIC X(01) VALUE 'N'.     10980009
109900         88  PS-ISA-WRIT-RCVG-TST                  VALUE 'Y'.     10990009
110000         88  PS-ISA-NOT-WRIT-RCVG-TST              VALUE 'N'.     11000009
110100     05  PS-ISA-NOT-WRIT-CNTR-SW         PIC X(01) VALUE 'N'.     11010009
110200         88  PS-ISA-WRIT-CNTR                      VALUE 'Y'.     11020009
110300         88  PS-ISA-NOT-WRIT-CNTR                  VALUE 'N'.     11030009
110400     05  PS-ISA-NOT-WRIT-CNTR-TST-SW     PIC X(01) VALUE 'N'.     11040009
110500         88  PS-ISA-WRIT-CNTR-TST                  VALUE 'Y'.     11050009
110600         88  PS-ISA-NOT-WRIT-CNTR-TST              VALUE 'N'.     11060009
110700     05  PS-ISA-NOT-WRIT-ARVL-SW         PIC X(01) VALUE 'N'.     11070009
110800         88  PS-ISA-WRIT-ARVL                      VALUE 'Y'.     11080009
110900         88  PS-ISA-NOT-WRIT-ARVL                  VALUE 'N'.     11090009
111000     05  PS-ISA-NOT-WRIT-ARVL-TST-SW     PIC X(01) VALUE 'N'.     11100009
111100         88  PS-ISA-WRIT-ARVL-TST                  VALUE 'Y'.     11110009
111200         88  PS-ISA-NOT-WRIT-ARVL-TST              VALUE 'N'.     11120009
111300     05  PS-ISA-NOT-WRIT-ARV-DLY-SW      PIC X(01) VALUE 'N'.     11130009
111400         88  PS-ISA-WRIT-ARV-DLY                   VALUE 'Y'.     11140009
111500         88  PS-ISA-NOT-WRIT-ARV-DLY               VALUE 'N'.     11150009
111600     05  PS-ISA-NOT-WRIT-ARV-DLY-TST-SW  PIC X(01) VALUE 'N'.     11160009
111700         88  PS-ISA-WRIT-ARV-DLY-TST               VALUE 'Y'.     11170009
111800         88  PS-ISA-NOT-WRIT-ARV-DLY-TST           VALUE 'N'.     11180009
111900     05  PS-ISA-NOT-WRIT-CSTM-SW         PIC X(01) VALUE 'N'.     11190009
112000         88  PS-ISA-WRIT-CSTM                      VALUE 'Y'.     11200009
112100         88  PS-ISA-NOT-WRIT-CSTM                  VALUE 'N'.     11210009
112200     05  PS-ISA-NOT-WRIT-CSTM-TST-SW     PIC X(01) VALUE 'N'.     11220009
112300         88  PS-ISA-WRIT-CSTM-TST                  VALUE 'Y'.     11230009
112400         88  PS-ISA-NOT-WRIT-CSTM-TST              VALUE 'N'.     11240009
112500     05  PS-ISA-NOT-WRIT-PKSLP-SW        PIC X(01) VALUE 'N'.     11250009
112600         88  PS-ISA-WRIT-PKSLP                     VALUE 'Y'.     11260009
112700         88  PS-ISA-NOT-WRIT-PKSLP                 VALUE 'N'.     11270009
112800     05  PS-ISA-NOT-WRIT-PKSLP-TST-SW    PIC X(01) VALUE 'N'.     11280009
112900         88  PS-ISA-WRIT-PKSLP-TST                 VALUE 'Y'.     11290009
113000         88  PS-ISA-NOT-WRIT-PKSLP-TST             VALUE 'N'.     11300009
113100     05  PS-ISA-NOT-WRIT-DELY-SW         PIC X(01) VALUE 'N'.     11310009
113200         88  PS-ISA-WRIT-DELY                      VALUE 'Y'.     11320009
113300         88  PS-ISA-NOT-WRIT-DELY                  VALUE 'N'.     11330009
113400     05  PS-ISA-NOT-WRIT-DELY-TST-SW     PIC X(01) VALUE 'N'.     11340009
113500         88  PS-ISA-WRIT-DELY-TST                  VALUE 'Y'.     11350009
113600         88  PS-ISA-NOT-WRIT-DELY-TST              VALUE 'N'.     11360009
113700* PB 06/30/2010 BEG                                               11370009
113800     05  PS-ISA-NOT-WRIT-WHSE-REPLEN-SW  PIC X(01) VALUE 'N'.     11380009
113900         88  PS-ISA-WRIT-WHSE-REPLEN               VALUE 'Y'.     11390009
114000         88  PS-ISA-NOT-WRIT-WHSE-REPLEN           VALUE 'N'.     11400009
114100     05  PS-ISA-NOT-WRIT-WHS-RPL-TST-SW  PIC X(01) VALUE 'N'.     11410009
114200         88  PS-ISA-WRIT-WHSE-REPLEN-TST           VALUE 'Y'.     11420009
114300         88  PS-ISA-NOT-WRIT-WHSE-RPLN-TST         VALUE 'N'.     11430009
114400* PB 06/30/2010 END                                               11440009
114500                                                                  11450009
114600* SYSTEM TIME                                                     11460009
114700 01  SD-SYSTEM-TIME.                                              11470009
114800     05  SD-SYS-HR                  PIC 9(2).                     11480009
114900     05  SD-SYS-MIN                 PIC 9(2).                     11490009
115000                                                                  11500009
115100* SYTEM DATE                                                      11510009
115200 01  SD-SYSTEM-DATE.                                              11520009
115300     05  SD-SYSTEM-YEAR             PIC  9(02).                   11530009
115400     05  SD-SYSTEM-MONTH            PIC  9(02).                   11540009
115500     05  SD-SYSTEM-DAY              PIC  9(02).                   11550009
115600                                                                  11560009
115700                                                                  11570009
115800****************************************************************  11580009
115900 PROCEDURE DIVISION.                                              11590009
116000****************************************************************  11600009
116100 0000-PROGRAM-MAINLINE.                                           11610009
116200                                                                  11620009
116300     PERFORM 1000-INITIALIZATION.                                 11630009
116400     PERFORM 2000-PROCESS-FILE                                    11640009
116500                         UNTIL PS-NO-MORE-INPUT-RECS.             11650009
116600     PERFORM 4180-DISPLAY-COUNTS.                                 11660009
116700     PERFORM 4090-PRINT-REPORT.                                   11670009
116800     PERFORM 8000-CLOSE-FILES.                                    11680009
116900                                                                  11690009
117000     GOBACK.                                                      11700009
117100                                                                  11710009
117200****************************************************************  11720009
117300* 1000-INITIALIZATION OPENS ALL FILES AND INITAILZES ALL OF    *  11730009
117400* THE NECESSARY FIELDS.                                        *  11740009
117500****************************************************************  11750009
117600 1000-INITIALIZATION.                                             11760009
117700                                                                  11770009
117800     OPEN OUTPUT REPORT-FILE                                      11780009
117900                 TRIANGLE-PACKSLIPS-T-FILE                        11790009
118000                 TRIANGLE-PACKSLIPS-P-FILE                        11800009
118100                 DELIVERY-T-FILE                                  11810009
118200                 DELIVERY-P-FILE                                  11820009
118300                 CONSOL-IMPORT-BKG-T-FILE                         11830009
118400                 CONSOL-IMPORT-BKG-P-FILE                         11840009
118500                 CONSOL-IMPORT-RCVG-T-FILE                        11850009
118600                 CONSOL-IMPORT-RCVG-P-FILE                        11860009
118700                 CONSOL-ARRIVAL-P-FILE                            11870009
118800                 CONSOL-ARRIVAL-T-FILE                            11880009
118900                 CONSOL-CONMAN-P-FILE                             11890009
119000                 CONSOL-CONMAN-T-FILE                             11900009
119100                 CONSOL-CUSTOMS-P-FILE                            11910009
119200                 CONSOL-CUSTOMS-T-FILE                            11920009
119300                 CONSOL-EXCP-FILE                                 11930009
119400* PB 06/30/2010 BEG                                               11940009
119500                 WHSE-REPLEN-P-FILE                               11950009
119600                 WHSE-REPLEN-T-FILE                               11960009
119700* PB 06/30/2010 END                                               11970009
119800           INPUT INPUT-FILE.                                      11980009
119900                                                                  11990009
120000     INITIALIZE PRINT-LINE.                                       12000009
120100     ACCEPT SD-SYSTEM-DATE FROM DATE.                             12010009
120200     ACCEPT SD-SYSTEM-TIME FROM TIME.                             12020009
120300     MOVE SD-SYSTEM-MONTH         TO DP132O-RUN-MONTH.            12030009
120400     MOVE SD-SYSTEM-DAY           TO DP132O-RUN-DAY.              12040009
120500     MOVE SD-SYSTEM-YEAR          TO DP132O-RUN-YEAR.             12050009
120600     MOVE SD-SYS-HR               TO DP132O-RUN-HOUR.             12060009
120700     MOVE SD-SYS-MIN              TO DP132O-RUN-MINUTE.           12070009
120800     MOVE 'TRKUT090'              TO DP132O-PROGRAM-NAME.         12080009
120900                                                                  12090009
121000****************************************************************  12100009
121100 2000-PROCESS-FILE.                                               12110009
121200                                                                  12120009
121300     PERFORM 4000-READ-INPUT-FILE.                                12130009
121500     EVALUATE TRUE                                                12150009
121600                                                                  12160009
121700      WHEN PS-NO-MORE-INPUT-RECS                                  12170009
121800       CONTINUE                                                   12180009
121900                                                                  12190009
122000      WHEN TR090-EDI-RCD-TYPE-RED = 'ISA'                         12200009
122100       PERFORM 2040-SET-ISA-SWITCHES                              12210009
122200       PERFORM 2050-PROCESS-ISA-RECORD                            12220009
122300                                                                  12230009
122400      WHEN PS-VENDOR-FOUND-NO                                     12240009
122500      WHEN PS-FILE-HAS-VALID-ENT-ID-NO                            12250009
122600       ADD +1 TO PV-TOT-LOGICAL-REC-BAD                           12260009
122700       ADD +1 TO PV-EXCEPTION-WRITTEN                             12270009
122800       PERFORM 5120-WRITE-EXCEPTION-REC                           12280009
122900                                                                  12290009
123000      WHEN TR090-EDI-RCD-TYPE-RED = 'IEA'                         12300009
123100      WHEN TR090-EDI-RCD-TYPE-RED = 'CTT'                         12310009
123200       PERFORM 2010-PROCESS-NON-ISA-RECORD                        12320009
123300                                                                  12330009
123400      WHEN PS-ISA-PRESENT-NO                                      12340009
123500       ADD +1 TO PV-TOT-LOGICAL-REC-BAD                           12350009
123600       ADD +1 TO PV-EXCEPTION-WRITTEN                             12360009
123700       PERFORM 5120-WRITE-EXCEPTION-REC                           12370009
123800                                                                  12380009
123900      WHEN OTHER                                                  12390009
124000       ADD +1 TO PV-DATA-RECS-PER-LOGICAL-FILE                    12400009
124100       PERFORM 2010-PROCESS-NON-ISA-RECORD                        12410009
124200                                                                  12420009
124300     END-EVALUATE.                                                12430009
124400                                                                  12440009
124500****************************************************************  12450009
124600 2010-PROCESS-NON-ISA-RECORD.                                     12460009
124800     MOVE PV-HOLD-FILE-ID  TO TR090-FILE-ID.                      12480009
124900     MOVE PV-HOLD-ENT-ID   TO TR090-ENT-ID.                       12490009
125000                                                                  12500009
125100*    ***************************************************          12510009
125200*    * REMOVE THIS CODE WHEN WE GO TO NEW ENTID TABLE. *          12520009
125300*    ***************************************************          12530009
125400     IF (PV-IMP-VEND-INCHG-ID = PC-OCSNY   AND                    12540009
125500         PV-IMP-VEND-INCHG-ID-DESC =   'ZZ')                      12550009
125600           IF TR090-TRI-REC-TYP-DELIVERY                          12560009
125700* PB 06/30/2010 BEG                                               12570009
125800                              OR TR090-TRI-REC-TYP-WHSE-REPLEN    12580009
125900* PB 06/30/2010 END                                               12590009
126000             SET PV-FOUND-UWD TO TRUE                             12600009
126100             IF PV-PROCESS-1ST-DELY-REC                           12610009
126200                 SUBTRACT +1 FROM PV-CONSOLIDATOR-READ            12620009
126300                 ADD  +1 TO   PV-DECONSOL-READ                    12630009
126400                 SET PV-PROCESS-1ST-DELY-REC-NO TO TRUE           12640009
126500             END-IF                                               12650009
126600           END-IF                                                 12660009
126700     END-IF.                                                      12670009
126800*    ***************************************************          12680009
127000     EVALUATE TRUE                                                12700009
127100                                                                  12710009
127200      WHEN PV-EXCEPTION                                           12720009
127300       ADD +1 TO PV-EXCEPTION-WRITTEN                             12730009
127400       PERFORM 5120-WRITE-EXCEPTION-REC                           12740009
127500                                                                  12750009
127600      WHEN PV-FOUND-TRIANGLE                                      12760009
127700      WHEN PV-FOUND-HELLMAN                                       12770009
127800      WHEN PV-FOUND-HUDD                                          12780009
127900      WHEN PV-FOUND-UWD                                           12790009
128000      WHEN PV-FOUND-APS                                           12800009
128100      WHEN PV-FOUND-GLB                                           12810009
128200         ADD +1 TO PV-DECONSOL-READ                               12820009
128300         PERFORM 4150-WRITE-DECONSOL-REC                          12830009
128400                                                                  12840009
128500      WHEN PV-FOUND-EXPEDITOR                                     12850009
128600      WHEN PV-FOUND-MAERSK                                        12860009
128700      WHEN PV-FOUND-NYK                                           12870009
128800      WHEN PV-FOUND-LIVINGSTON                                    12880009
128900         ADD +1 TO PV-CONSOLIDATOR-READ                           12890009
129000         PERFORM 4090-WRITE-CNSLDT-REC                            12900009
129100                                                                  12910009
129200     END-EVALUATE.                                                12920009
129300                                                                  12930009
129400     IF TR090-EDI-RCD-TYPE-RED = 'IEA' OR                         12940009
129500        TR090-EDI-RCD-TYPE-RED = 'CTT'                            12950009
129600       IF PV-INVALID-REC-TYPE                                     12960009
129700           ADD +1 TO PV-EXCEPTION-WRITTEN                         12970009
129800           PERFORM 5120-WRITE-EXCEPTION-REC                       12980009
129900           IF TR090-EDI-RCD-TYPE-RED = 'IEA'                      12990009
130000               SET PV-VALID-REC-TYPE TO TRUE                      13000009
130100           END-IF                                                 13010009
130200       END-IF                                                     13020009
130300     END-IF.                                                      13030009
130400                                                                  13040009
130500******************************************************************13050009
130600* SET ISA RECORD WRITTEN SWITCHES FOR RECORD TYPE GROUPS.         13060009
130700******************************************************************13070009
130800 2040-SET-ISA-SWITCHES.                                           13080009
130900                                                                  13090009
131000     SET PV-NO-EXCEPTION               TO TRUE.                   13100009
131100     SET PS-ISA-NOT-WRIT-BKG           TO TRUE.                   13110009
131200     SET PS-ISA-NOT-WRIT-BKG-TST       TO TRUE.                   13120009
131300     SET PS-ISA-NOT-WRIT-RCVG          TO TRUE.                   13130009
131400     SET PS-ISA-NOT-WRIT-RCVG-TST      TO TRUE.                   13140009
131500     SET PS-ISA-NOT-WRIT-CNTR          TO TRUE.                   13150009
131600     SET PS-ISA-NOT-WRIT-CNTR-TST      TO TRUE.                   13160009
131700     SET PS-ISA-NOT-WRIT-ARVL          TO TRUE.                   13170009
131800     SET PS-ISA-NOT-WRIT-ARVL-TST      TO TRUE.                   13180009
131900     SET PS-ISA-NOT-WRIT-ARV-DLY       TO TRUE.                   13190009
132000     SET PS-ISA-NOT-WRIT-ARV-DLY-TST   TO TRUE.                   13200009
132100     SET PS-ISA-NOT-WRIT-CSTM          TO TRUE.                   13210009
132200     SET PS-ISA-NOT-WRIT-CSTM-TST      TO TRUE.                   13220009
132300     SET PS-ISA-NOT-WRIT-PKSLP         TO TRUE.                   13230009
132400     SET PS-ISA-NOT-WRIT-PKSLP-TST     TO TRUE.                   13240009
132500     SET PS-ISA-NOT-WRIT-DELY          TO TRUE.                   13250009
132600     SET PS-ISA-NOT-WRIT-DELY-TST      TO TRUE.                   13260009
132700* PB 06/30/2010 BEG                                               13270009
132800     SET PS-ISA-NOT-WRIT-WHSE-REPLEN   TO TRUE.                   13280009
132900     SET PS-ISA-NOT-WRIT-WHSE-RPLN-TST TO TRUE.                   13290009
133000* PB 06/30/2010 END                                               13300009
133100                                                                  13310009
133200                                                                  13320009
133300******************************************************************13330009
133400 2050-PROCESS-ISA-RECORD.                                         13340009
133500                                                                  13350009
133600     MOVE TR090-EDI-TEST-IND TO PV-EDI-TEST-SWITCH.               13360009
133700                                                                  13370009
133800     INITIALIZE PV-HOLD-FILE-ID                                   13380009
133900                PV-WS-FILE-ID                                     13390009
134000                PV-HOLD-ENT-ID                                    13400009
134100                PV-WS-ENT-ID.                                     13410009
134200                                                                  13420009
134300*    *********************************************                13430009
134400*    * HOLD THIS ISA RECORD IN WS - IT'S ONLY                     13440009
134500*    * USED IF LOGICAL FILE RECORDS ARE WRITTEN                   13450009
134600*    * TO THE EXCEPTION FILE.                                     13460009
134700*    *********************************************                13470009
134800     MOVE TR090-RECORD-TYPE (91:9) TO PV-HOLD-FILE-ID.            13480009
134900     MOVE TR090-RECORD-TYPE        TO PV-WS-RECORD-TYPE.          13490009
135000     INITIALIZE PV-IMP-VEND-INCHG-ID.                             13500009
135100     INITIALIZE PV-IMP-VEND-INCHG-ID-DESC.                        13510009
135200                                                                  13520009
135300     PERFORM 2160-RETRIEVE-TENTNME-ENT-ID.                        13530009
135400     IF PS-FILE-HAS-VALID-ENT-ID                                  13540009
135500        MOVE  TR090-IMP-VEND-INCHG-ID  TO                         13550009
135600           PV-IMP-VEND-INCHG-ID                                   13560009
135700        MOVE  TR090-IMP-VEND-INCHG-ID-DESC TO                     13570009
135800           PV-IMP-VEND-INCHG-ID-DESC                              13580009
135900        SET PV-PROCESS-1ST-DELY-REC TO TRUE                       13590009
136000        SET PC-NOT-DONE TO TRUE                                   13600009
136100        PERFORM 2180-GET-TRADE-PARTNER                            13610009
136200          VARYING PV-NAME-SUB                                     13620009
136300          FROM 1 BY 1                                             13630009
136400          UNTIL PV-NAME-SUB > PC-NBR-OF-VEND OR PC-DONE           13640009
136500     ELSE                                                         13650009
136600        DISPLAY '*****************************************'       13660009
136700        DISPLAY ' ENT ID EITHER INVALID OR NOT FOUND'             13670009
136800        DISPLAY ' FOR ISA WITH FILE ID :' PV-HOLD-FILE-ID         13680009
136900        DISPLAY ' VEND INCHG ID  :' TR090-IMP-VEND-INCHG-ID       13690009
137000        DISPLAY ' ID QUAL :' TR090-IMP-VEND-INCHG-ID-DESC         13700009
137100        DISPLAY '*****************************************'       13710009
137200        DISPLAY '                                         '       13720009
137300        ADD +1 TO PV-TOT-LOGICAL-BAD                              13730009
137400        ADD +1 TO PV-TOT-LOGICAL-REC-BAD                          13740009
137500        ADD +1 TO PV-INVALID-ENT-ID-ON-ISA                        13750009
137600        ADD +1 TO PV-EXCEPTION-WRITTEN                            13760009
137700        SET PV-EXCEPTION       TO TRUE                            13770009
137800        SET PS-ISA-PRESENT-NO  TO TRUE                            13780009
137900        PERFORM 5120-WRITE-EXCEPTION-REC                          13790009
138000     END-IF.                                                      13800009
138100                                                                  13810009
138200******************************************************************13820009
138300* SELECT ENTITY ID AND CHECK VALIDITY.                            13830009
138400* THE SAVED FILE ID AND SELECTED ENT-ID WILL BE MOVED TO THE      13840009
138500* THE TR090-FILE-ID AND TR090-ENT-ID FIELDS OF EACH OUTPUT RECORD.13850009
138600******************************************************************13860009
138700 2160-RETRIEVE-TENTNME-ENT-ID.                                    13870009
138900     INITIALIZE ENTNME-ENT-ID.                                    13890009
139000                                                                  13900009
139100     PERFORM                                                      13910009
139200         WITH TEST AFTER                                          13920009
139300         VARYING PV-RETRY-COUNTER FROM 1 BY 1                     13930009
139400         UNTIL   PV-RETRY-COUNTER > PC-MAX-RETRIES  OR            13940009
139500                 SQLCODE = ZERO                     OR            13950009
139600                 SQLCODE = +100                                   13960009
139700                                                                  13970009
139800         EXEC SQL                                                 13980009
139900             SELECT DISTINCT                                      13990009
140000                    A.ENT_ID                                      14000009
140100                  , B.VEND_INCHG_ID                               14010009
140200                  , B.VEND_INCHG_ID_DESC                          14020009
140300              INTO :ENTNME-ENT-ID                                 14030009
140400                 , :TRDPRT-VEND-INCHG-ID                          14040009
140500                 , :TRDPRT-VEND-INCHG-ID-DESC                     14050009
140600              FROM  TENTNME  A                                    14060009
140700                   ,TTRDPRT  B                                    14070009
140800              WHERE B.VEND_INCHG_ID =                             14080009
140900                                 :TR090-IMP-VEND-INCHG-ID         14090009
141000                AND B.VEND_INCHG_ID_DESC  =                       14100009
141100                                 :TR090-IMP-VEND-INCHG-ID-DESC    14110009
141200                AND A.ENT_ID              = B.ENT_ID              14120009
141300                AND A.TYPE_CDE            = '01'                  14130009
141400                AND B.INACTV_DTE          = '9999-09-09'          14140009
141500         END-EXEC                                                 14150009
141600                                                                  14160009
141700         EVALUATE TRUE                                            14170009
141800             WHEN SQLCODE = ZERO                                  14180009
141900             SET PS-FILE-HAS-VALID-ENT-ID TO TRUE                 14190009
142000             MOVE ENTNME-ENT-ID           TO PV-HOLD-ENT-ID       14200009
142100                                             TR090-ENT-ID         14210009
142200                                             PV-WS-ENT-ID         14220009
142300             MOVE PV-HOLD-FILE-ID         TO TR090-FILE-ID        14230009
142400                                             PV-WS-FILE-ID        14240009
142500                                                                  14250009
142600             WHEN SQLCODE = -811                                  14260009
142700               MOVE PV-HOLD-FILE-ID   TO TR090-FILE-ID            14270009
142800                                         PV-WS-FILE-ID            14280009
142900               SET PS-FILE-HAS-VALID-ENT-ID TO TRUE               14290009
143000               IF TR090-IMP-VEND-INCHG-ID = PC-OCSNY AND          14300009
143100                  TR090-IMP-VEND-INCHG-ID-DESC = PC-ZZ            14310009
143200*                ************************************************ 14320009
143300*                * -811 COULD BE RESULT OF OCSNY AND UWDC HAVING  14330009
143400*                * SAME VEND INTERCHANGE ID. WE WANT TO USE OCSNY 14340009
143500*                * ON ALL BUT DELIVERY.                           14350009
143600*                * (SEE 4170-WRITE-REC-TYP-DELY)                  14360009
143700*                ************************************************ 14370009
143800                 MOVE PC-OCSNY-ENTID TO PV-HOLD-ENT-ID            14380009
143900                                          TR090-ENT-ID            14390009
144000                                          PV-WS-ENT-ID            14400009
144100               ELSE                                               14410009
144200                 MOVE ENTNME-ENT-ID     TO PV-HOLD-ENT-ID         14420009
144300                                           TR090-ENT-ID           14430009
144400                                           PV-WS-ENT-ID           14440009
144500               END-IF                                             14450009
144600                                                                  14460009
144700             WHEN SQLCODE = +100                                  14470009
144800             WHEN SQLCODE = -904                                  14480009
144900             WHEN SQLCODE = -913                                  14490009
145000                 CONTINUE                                         14500009
145100             WHEN SQLWARN0 NOT EQUAL SPACE                        14510009
145200             WHEN SQLCODE NOT EQUAL ZERO                          14520009
145300          DISPLAY '**********************************************'14530009
145400          DISPLAY '** ABEND                                    **'14540009
145500          DISPLAY '** PROGRAM = TRKUT090                       **'14550009
145600          DISPLAY '** PARAGRAPH = 2160-RETRIEVE-TENTNME-ENT-ID   '14560009
145700          DISPLAY '** VALIDATE ENT-ID ON TENTNME AND TTRDPRT     '14570009
145800          DISPLAY '** WITH ENT-ID FROM ISA RECORD                '14580009
145900          DISPLAY '** VEND ID     = ' TR090-IMP-VEND-INCHG-ID     14590009
146000          DISPLAY '** VEND ID QUAL= ' TR090-IMP-VEND-INCHG-ID-DESC14600009
146100          DISPLAY '**********************************************'14610009
146200          PERFORM 9900-SQL-ERROR                                  14620009
146300         END-EVALUATE                                             14630009
146400     END-PERFORM.                                                 14640009
146500                                                                  14650009
146600     IF  PV-RETRY-COUNTER > PC-MAX-RETRIES AND                    14660009
146700         (SQLCODE NOT = ZERO    AND                               14670009
146800             SQLCODE NOT = +100 AND                               14680009
146900             SQLCODE NOT = -811)                                  14690009
147000         DISPLAY '***********************************************'14700009
147100         DISPLAY '** MAX RETRIES EXCEEDED ATTEMPTING TO        **'14710009
147200         DISPLAY '** VALIDATE ENT-ID ON TENTNME AND TTRDPRT    **'14720009
147300         DISPLAY '** WITH ENT-ID FROM ISA RECORD               **'14730009
147400         DISPLAY '** PARAGRAPH =  2160-RETRIEVE-TENTNME-ENT-ID **'14740009
147500         DISPLAY '** VEND ID      = ' TR090-IMP-VEND-INCHG-ID     14750009
147600         DISPLAY '** VEND ID QUAL = ' TR090-IMP-VEND-INCHG-ID-DESC14760009
147700         DISPLAY '***********************************************'14770009
147800         PERFORM 9900-SQL-ERROR                                   14780009
147900     END-IF.                                                      14790009
148000                                                                  14800009
148100/                                                                 14810009
148200******************************************************************14820009
148300* CHECK TO MAKE SURE THAT A MESSAGE IS SENT TO SYSOUT AND REPORT  14830009
148400* IF THE NUMBER OF RECORDS BETWEEN THE ISA AND CTT DOES NOT EQUAL 14840009
148500* THE RECORD COUNT NUMBER SENT ON THE CTT -OR- IF THE CTT RECORD  14850009
148600* IS NOT PRESENT                                                  14860009
148700******************************************************************14870009
148800 2170-CHECK-FOR-MISSING-RECORDS.                                  14880009
148900                                                                  14890009
149000     IF PV-CTT-RECORD-COUNT NUMERIC                               14900009
149100      IF PV-CTT-RECORD-COUNT   = PV-DATA-RECS-PER-LOGICAL-FILE    14910009
149200          CONTINUE                                                14920009
149300      ELSE                                                        14930009
149400         IF (PS-FILE-HAS-VALID-ENT-ID         AND                 14940009
149500             TR090-EDI-RCD-TYPE-RED  = 'CTT' )                    14950009
149600              ADD +1  TO PV-MIS-MATCHING-CTT-COUNT                14960009
149700             DISPLAY '*****************************************'  14970009
149800             DISPLAY 'LOGICAL FILE DATA RECORD COUNT DOES NOT'    14980009
149900             DISPLAY 'EQUAL CTT RECORD COUNT'                     14990009
150000             DISPLAY 'ISA FILE ID       = ' PV-HOLD-FILE-ID       15000009
150100      DISPLAY 'DATA RECORD COUNT = ' PV-DATA-RECS-PER-LOGICAL-FILE15010009
150200             DISPLAY 'CTT RECORD COUNT  = ' PV-CTT-RECORD-COUNT   15020009
150300             DISPLAY '*****************************************'  15030009
150400         END-IF                                                   15040009
150500      END-IF                                                      15050009
150600     ELSE                                                         15060009
150700         DISPLAY '*****************************************'      15070009
150800         DISPLAY 'CTT RECORD COUNT NOT NUMERIC'                   15080009
150900         DISPLAY '*****************************************'      15090009
151000     END-IF.                                                      15100009
151100                                                                  15110009
151200     IF PS-IEA-PRESENT AND PS-CTT-PRESENT-NO                      15120009
151300      ADD +1  TO PV-MISSING-CTT-RECS                              15130009
151400      DISPLAY '*****************************************'         15140009
151500      DISPLAY 'MISSING CTT RECORD FOR LOGICAL FILE      '         15150009
151600      DISPLAY 'ISA FILE ID       = ' PV-HOLD-FILE-ID              15160009
151700      DISPLAY '*****************************************'         15170009
151800     END-IF.                                                      15180009
151900                                                                  15190009
152000/                                                                 15200009
152100******************************************************************15210009
152200* SPIN THROUGH INTERNAL TABLE TO FIND OUT THE TRADING PARTNER NAME15220009
152300******************************************************************15230009
152400 2180-GET-TRADE-PARTNER.                                          15240009
152600     MOVE SPACES TO PV-WHERE-CLAUSE.                              15260009
152700     MOVE PC-VENDOR(PV-NAME-SUB) TO PV-VENDOR-NAME-LIKE.          15270009
152900* GET THE TRUE LENGTH OF THE VENDOR NAME                          15290009
153000     MOVE +1 TO PV-POINTER.                                       15300009
153100     STRING PC-PERCENT DELIMITED BY SIZE,                         15310009
153200            PV-VENDOR-NAME-LIKE DELIMITED BY ' ',                 15320009
153300            PC-PERCENT DELIMITED BY SIZE                          15330009
153400       INTO PV-WHERE-CLAUSE                                       15340009
153500       WITH POINTER PV-POINTER.                                   15350009
153600                                                                  15360009
153700     SUBTRACT +1 FROM PV-POINTER.                                 15370009
153800     PERFORM 2200-MOVE-VENDOR-LIKE.                               15380009
153900                                                                  15390009
154000     PERFORM 7000-GET-VENDOR.                                     15400009
154100     IF PS-VENDOR-FOUND                                           15410009
154200         ADD +1 TO PV-LOGICAL-PROCESSED                           15420009
154300         SET PC-DONE TO TRUE                                      15430009
154400                                                                  15440009
154500*RJ ADD CHECK FOR WHICH VENDOR IF NEW VENDORS ARE ADDED           15450009
154600                                                                  15460009
154700         EVALUATE TRUE                                            15470009
154800           WHEN PV-FOUND-TRIANGLE                                 15480009
154900           WHEN PV-FOUND-HELLMAN                                  15490009
155000                 ADD +1 TO PV-DECONSOL-READ                       15500009
155100                 ADD +1 TO PV-LOGICAL-PROCESSED-TR                15510009
155200           WHEN PV-FOUND-HUDD                                     15520009
155300                 ADD +1 TO PV-DECONSOL-READ                       15530009
155400                 ADD +1 TO PV-LOGICAL-PROCESSED-HU                15540009
155500           WHEN PV-FOUND-UWD                                      15550009
155600                 ADD +1 TO PV-DECONSOL-READ                       15560009
155700                 ADD +1 TO PV-LOGICAL-PROCESSED-UWD               15570009
155800           WHEN PV-FOUND-APS                                      15580009
155900                 ADD +1 TO PV-DECONSOL-READ                       15590009
156000                 ADD +1 TO PV-LOGICAL-PROCESSED-AP                15600009
156100           WHEN PV-FOUND-GLB                                      15610009
156200                 ADD +1 TO PV-DECONSOL-READ                       15620009
156300                 ADD +1 TO PV-LOGICAL-PROCESSED-GB                15630009
156400           WHEN PV-FOUND-EXPEDITOR                                15640009
156500                 ADD +1 TO PV-CONSOLIDATOR-READ                   15650009
156600                 ADD +1 TO PV-LOGICAL-PROCESSED-EX                15660009
156700           WHEN PV-FOUND-LIVINGSTON                               15670009
156900                 ADD +1 TO PV-CONSOLIDATOR-READ                   15690009
157000                 ADD +1 TO PV-LOGICAL-PROCESSED-LV                15700009
157100           WHEN PV-FOUND-MAERSK                                   15710009
157200                 ADD +1 TO PV-CONSOLIDATOR-READ                   15720009
157300                 ADD +1 TO PV-LOGICAL-PROCESSED-MK                15730009
157400           WHEN PV-FOUND-NYK                                      15740009
157500                 ADD +1 TO PV-CONSOLIDATOR-READ                   15750009
157600                 ADD +1 TO PV-LOGICAL-PROCESSED-OC                15760009
157700         END-EVALUATE                                             15770009
157800     ELSE                                                         15780009
157900* VENDOR WAS NOT FOUND, CONTINUE UNTIL FOUND OR HIT END OF TABLE  15790009
158000         SET PC-NOT-DONE TO TRUE                                  15800009
158100         IF PV-NAME-SUB = PC-NBR-OF-VEND                          15810009
158200             ADD +1 TO PV-TOT-LOGICAL-BAD                         15820009
158300             ADD +1 TO PV-TOT-LOGICAL-REC-BAD                     15830009
158400             ADD +1 TO PV-EXCEPTION-WRITTEN                       15840009
158500             SET PV-EXCEPTION TO TRUE                             15850009
158600             PERFORM 5120-WRITE-EXCEPTION-REC                     15860009
158700         ELSE                                                     15870009
158800             SET PV-NO-EXCEPTION TO TRUE                          15880009
158900         END-IF                                                   15890009
159000     END-IF.                                                      15900009
159100******************************************************************15910009
159200* SET UP THE FIELD THAT WILL BE USED TO GET THE TRADING PARTNER  *15920009
159300* NAME FROM THE TABLE.                                           *15930009
159400******************************************************************15940009
159500 2200-MOVE-VENDOR-LIKE.                                           15950009
159600     MOVE SPACES TO DK-WHERE-3 DK-WHERE-4 DK-WHERE-5 DK-WHERE-6   15960009
159700                    DK-WHERE-7 DK-WHERE-8 DK-WHERE-9 DK-WHERE-10  15970009
159800                    DK-WHERE-11 DK-WHERE-12 DK-WHERE-13           15980009
159900                    DK-WHERE-14 DK-WHERE-15 DK-WHERE-16           15990009
160000                    DK-WHERE-17 DK-WHERE-18 DK-WHERE-19           16000009
160100                    DK-WHERE-20 DK-WHERE-21 DK-WHERE-22           16010009
160200                    DK-WHERE-23 DK-WHERE-24 DK-WHERE-25           16020009
160300                    DK-WHERE-26 DK-WHERE-27 DK-WHERE-28           16030009
160400                    DK-WHERE-29 DK-WHERE-30.                      16040009
160500                                                                  16050009
160600     EVALUATE PV-POINTER                                          16060009
160700*RJ IF NEW VENDORS ARE ADDED, ADD WHEN (LENGTH OF VENDOR NAME +   16070009
160800*   4 FOR '%%'), AND MOVE WHERE CLAUSE TO DK-WHERE-(LENGTH CALC)  16080009
160900        WHEN 3                                                    16090009
161000          MOVE PV-WHERE-CLAUSE TO DK-WHERE-3                      16100009
161100        WHEN 4                                                    16110009
161200          MOVE PV-WHERE-CLAUSE TO DK-WHERE-4                      16120009
161300        WHEN 5                                                    16130009
161400          MOVE PV-WHERE-CLAUSE TO DK-WHERE-5                      16140009
161500        WHEN 6                                                    16150009
161600          MOVE PV-WHERE-CLAUSE TO DK-WHERE-6                      16160009
161700        WHEN 7                                                    16170009
161800          MOVE PV-WHERE-CLAUSE TO DK-WHERE-7                      16180009
161900        WHEN 8                                                    16190009
162000          MOVE PV-WHERE-CLAUSE TO DK-WHERE-8                      16200009
162100        WHEN 9                                                    16210009
162200          MOVE PV-WHERE-CLAUSE TO DK-WHERE-9                      16220009
162300        WHEN 10                                                   16230009
162400          MOVE PV-WHERE-CLAUSE TO DK-WHERE-10                     16240009
162500        WHEN 11                                                   16250009
162600          MOVE PV-WHERE-CLAUSE TO DK-WHERE-11                     16260009
162700        WHEN 12                                                   16270009
162800          MOVE PV-WHERE-CLAUSE TO DK-WHERE-12                     16280009
162900        WHEN 13                                                   16290009
163000          MOVE PV-WHERE-CLAUSE TO DK-WHERE-13                     16300009
163100        WHEN 14                                                   16310009
163200          MOVE PV-WHERE-CLAUSE TO DK-WHERE-14                     16320009
163300        WHEN 15                                                   16330009
163400          MOVE PV-WHERE-CLAUSE TO DK-WHERE-15                     16340009
163500        WHEN 16                                                   16350009
163600          MOVE PV-WHERE-CLAUSE TO DK-WHERE-16                     16360009
163700        WHEN 17                                                   16370009
163800          MOVE PV-WHERE-CLAUSE TO DK-WHERE-17                     16380009
163900        WHEN 18                                                   16390009
164000          MOVE PV-WHERE-CLAUSE TO DK-WHERE-18                     16400009
164100        WHEN 19                                                   16410009
164200          MOVE PV-WHERE-CLAUSE TO DK-WHERE-19                     16420009
164300        WHEN 20                                                   16430009
164400          MOVE PV-WHERE-CLAUSE TO DK-WHERE-20                     16440009
164500        WHEN 21                                                   16450009
164600          MOVE PV-WHERE-CLAUSE TO DK-WHERE-21                     16460009
164700        WHEN 22                                                   16470009
164800          MOVE PV-WHERE-CLAUSE TO DK-WHERE-22                     16480009
164900        WHEN 23                                                   16490009
165000          MOVE PV-WHERE-CLAUSE TO DK-WHERE-23                     16500009
165100        WHEN 24                                                   16510009
165200          MOVE PV-WHERE-CLAUSE TO DK-WHERE-24                     16520009
165300        WHEN 25                                                   16530009
165400          MOVE PV-WHERE-CLAUSE TO DK-WHERE-25                     16540009
165500        WHEN 26                                                   16550009
165600          MOVE PV-WHERE-CLAUSE TO DK-WHERE-26                     16560009
165700        WHEN 27                                                   16570009
165800          MOVE PV-WHERE-CLAUSE TO DK-WHERE-27                     16580009
165900        WHEN 28                                                   16590009
166000          MOVE PV-WHERE-CLAUSE TO DK-WHERE-28                     16600009
166100        WHEN 29                                                   16610009
166200          MOVE PV-WHERE-CLAUSE TO DK-WHERE-29                     16620009
166300        WHEN 30                                                   16630009
166400          MOVE PV-WHERE-CLAUSE TO DK-WHERE-30                     16640009
166500     END-EVALUATE.                                                16650009
166600                                                                  16660009
166700******************************************************************16670009
166800*  READ A RECORD FROM THE PROPRIETARY INPUT FILE.                *16680009
166900******************************************************************16690009
167000 4000-READ-INPUT-FILE.                                            16700009
167100                                                                  16710009
167200* PB 06/30/2010                                                   16720009
167300* INITIALIZED TR090-RECORD-TYPE IN THE 'AT END' CONDITION         16730009
167400*                                                                 16740009
167500     READ INPUT-FILE                                              16750009
167600           INTO TR090-RECORD-TYPE                                 16760009
167700            AT END SET PS-NO-MORE-INPUT-RECS TO TRUE              16770009
167800                   INITIALIZE TR090-RECORD-TYPE                   16780009
167900            NOT AT END                                            16790009
168000               ADD +1 TO PV-EXTRACTS-READ.                        16800009
168100                                                                  16810009
168200     EVALUATE TRUE                                                16820009
168300         WHEN TR090-EDI-RCD-TYPE-ISA                              16830009
168400            SET PS-ISA-PRESENT                TO TRUE             16840009
168500            SET PS-CTT-PRESENT-NO             TO TRUE             16850009
168600            SET PS-IEA-PRESENT-NO             TO TRUE             16860009
168700            SET PS-FILE-HAS-VALID-ENT-ID-NO   TO TRUE             16870009
168800            SET PS-VENDOR-FOUND-NO            TO TRUE             16880009
168900            MOVE +0             TO PV-DATA-RECS-PER-LOGICAL-FILE  16890009
169000         WHEN TR090-EDI-RCD-TYPE-CTT                              16900009
169100            SET PS-CTT-PRESENT                TO TRUE             16910009
169200            MOVE TR090-RECORD-TYPE    TO                          16920009
169300                      PV-CTT-RECORD-TYPE                          16930009
169400            PERFORM 2170-CHECK-FOR-MISSING-RECORDS                16940009
169500            SET PS-ISA-PRESENT-NO             TO TRUE             16950009
169600         WHEN TR090-EDI-RCD-TYPE-IEA                              16960009
169700            SET PS-IEA-PRESENT                TO TRUE             16970009
169800            PERFORM 2170-CHECK-FOR-MISSING-RECORDS                16980009
169900            INITIALIZE PV-CTT-RECORD-TYPE                         16990009
170000            SET PS-ISA-PRESENT-NO             TO TRUE             17000009
170100     END-EVALUATE.                                                17010009
170200                                                                  17020009
170300******************************************************************17030009
170400*  PERFORM THE APPROPRIATE PARAGRAPH TO WRITE A CONSOLIDATOR     *17040009
170500*  RECORD TO THE PROPER TEST OR PRODUCTION FILE.                 *17050009
170600******************************************************************17060009
170700 4090-WRITE-CNSLDT-REC.                                           17070009
170900     EVALUATE TRUE                                                17090009
171000         WHEN TR090-REC-TYP-BKG                                   17100009
171100             PERFORM 4100-WRITE-REC-TYP-BKG                       17110009
171200                                                                  17120009
171300         WHEN TR090-REC-TYP-RCVG                                  17130009
171400             PERFORM 4110-WRITE-REC-TYP-RCVG                      17140009
171500                                                                  17150009
171600         WHEN TR090-REC-TYP-CONT-MANIFEST                         17160009
171700             PERFORM 4120-WRITE-REC-TYP-MANIFEST                  17170009
171800                                                                  17180009
171900         WHEN TR090-REC-TYP-ARRIVAL                               17190009
172000             PERFORM 4130-WRITE-REC-TYP-ARRIVAL                   17200009
172100                                                                  17210009
172200         WHEN TR090-REC-TYP-CUSTOMS                               17220009
172300             PERFORM 4140-WRITE-REC-TYP-CUSTOMS                   17230009
172400                                                                  17240009
172500         WHEN TR090-EDI-RCD-TYPE-IEA                              17250009
172600         WHEN TR090-EDI-RCD-TYPE-CTT                              17260009
172700              IF PV-WROTE-REC-TYP-BKG                             17270009
172800                  PERFORM 4100-WRITE-REC-TYP-BKG                  17280009
172900              END-IF                                              17290009
173000                                                                  17300009
173100              IF PV-WROTE-REC-TYP-RCVG                            17310009
173200                  PERFORM 4110-WRITE-REC-TYP-RCVG                 17320009
173300              END-IF                                              17330009
173400                                                                  17340009
173500              IF PV-WROTE-REC-TYP-CONT                            17350009
173600                  PERFORM 4120-WRITE-REC-TYP-MANIFEST             17360009
173700              END-IF                                              17370009
173800                                                                  17380009
173900              IF PV-WROTE-REC-TYP-ARRIVAL                         17390009
174000                  PERFORM 4130-WRITE-REC-TYP-ARRIVAL              17400009
174100              END-IF                                              17410009
174200                                                                  17420009
174300              IF PV-WROTE-REC-TYP-CUST                            17430009
174400                  PERFORM 4140-WRITE-REC-TYP-CUSTOMS              17440009
174500              END-IF                                              17450009
174600                                                                  17460009
174700         WHEN OTHER                                               17470009
174800             IF PV-VALID-REC-TYPE                                 17480009
174900                 SET PV-INVALID-REC-TYPE TO TRUE                  17490009
175000                 WRITE CONSOL-EXCP-LINE                           17500009
175100                    FROM PV-WS-RECORD-TYPE                        17510009
175200                 ADD +1 TO  PV-EXCEPTION-WRITTEN                  17520009
175300                 PERFORM 5120-WRITE-EXCEPTION-REC                 17530009
175400                 ADD +1 TO  PV-EXCEPTION-WRITTEN                  17540009
175500             ELSE                                                 17550009
175600                 ADD +1 TO PV-EXCEPTION-WRITTEN                   17560009
175700                 PERFORM 5120-WRITE-EXCEPTION-REC                 17570009
175800             END-IF                                               17580009
175900     END-EVALUATE.                                                17590009
176000                                                                  17600009
176100******************************************************************17610009
176200* WRITE A RECORD TO EITHER THE PROD OR TEST CONSOLIDATOR IMPORT  *17620009
176300* BKG FILE.                                                      *17630009
176400******************************************************************17640009
176500 4100-WRITE-REC-TYP-BKG.                                          17650009
176600                                                                  17660009
176700     IF PS-ISA-NOT-WRIT-BKG OR PS-ISA-NOT-WRIT-BKG-TST            17670009
176800         EVALUATE TRUE                                            17680009
176900             WHEN PV-EDI-TEST-SWITCH-PROD AND                     17690009
177000                  PS-ISA-NOT-WRIT-BKG                             17700009
177100                 PERFORM 5230-WRITE-IMPORT-BKG-P-WS               17710009
177200                 SET PS-ISA-WRIT-BKG TO TRUE                      17720009
177300                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              17730009
177400             WHEN PV-EDI-TEST-SWITCH-TEST AND                     17740009
177500                  PS-ISA-NOT-WRIT-BKG-TST                         17750009
177600                 PERFORM 5220-WRITE-IMPORT-BKG-T-WS               17760009
177700                 SET PS-ISA-WRIT-BKG-TST TO TRUE                  17770009
177800                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              17780009
177900         END-EVALUATE                                             17790009
178000     END-IF.                                                      17800009
178100                                                                  17810009
178200     EVALUATE TRUE                                                17820009
178300         WHEN PV-EDI-TEST-SWITCH-PROD                             17830009
178400             PERFORM 5030-WRITE-IMPORT-BKG-P-REC                  17840009
178500         WHEN PV-EDI-TEST-SWITCH-TEST                             17850009
178600             PERFORM 5020-WRITE-IMPORT-BKG-T-REC                  17860009
178700     END-EVALUATE.                                                17870009
178800                                                                  17880009
178900     PERFORM 6000-ADD-TO-TOT-RECS-CONSOL.                         17890009
179000                                                                  17900009
179100******************************************************************17910009
179200* WRITE A RECORD TO EITHER THE PROD OR TEST CONSOLIDATOR IMPORT  *17920009
179300* RCVG FILE.                                                     *17930009
179400******************************************************************17940009
179500 4110-WRITE-REC-TYP-RCVG.                                         17950009
179600                                                                  17960009
179700     IF PS-ISA-NOT-WRIT-RCVG OR PS-ISA-NOT-WRIT-RCVG-TST          17970009
179800         EVALUATE TRUE                                            17980009
179900             WHEN PV-EDI-TEST-SWITCH-PROD AND                     17990009
180000                  PS-ISA-NOT-WRIT-RCVG                            18000009
180100                 PERFORM 5235-WRITE-IMPORT-RCVG-P-WS              18010009
180200                 SET PS-ISA-WRIT-RCVG TO TRUE                     18020009
180300                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18030009
180400             WHEN PV-EDI-TEST-SWITCH-TEST AND                     18040009
180500                  PS-ISA-NOT-WRIT-RCVG-TST                        18050009
180600                 PERFORM 5225-WRITE-IMPORT-RCVG-T-WS              18060009
180700                 SET PS-ISA-WRIT-RCVG-TST TO TRUE                 18070009
180800                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18080009
180900         END-EVALUATE                                             18090009
181000     END-IF.                                                      18100009
181100                                                                  18110009
181200     EVALUATE TRUE                                                18120009
181300         WHEN PV-EDI-TEST-SWITCH-PROD                             18130009
181400             PERFORM 5035-WRITE-IMPORT-RCVG-P-REC                 18140009
181500         WHEN PV-EDI-TEST-SWITCH-TEST                             18150009
181600             PERFORM 5025-WRITE-IMPORT-RCVG-T-REC                 18160009
181700     END-EVALUATE.                                                18170009
181800                                                                  18180009
181900     PERFORM 6000-ADD-TO-TOT-RECS-CONSOL.                         18190009
182000                                                                  18200009
182100******************************************************************18210009
182200* WRITE A RECORD TO EITHER THE PROD OR TEST CONSOLIDATOR         *18220009
182300* CONTAINER MANIFEST FILE.                                       *18230009
182400******************************************************************18240009
182500 4120-WRITE-REC-TYP-MANIFEST.                                     18250009
182600                                                                  18260009
182700     IF PS-ISA-NOT-WRIT-CNTR OR PS-ISA-NOT-WRIT-CNTR-TST          18270009
182800         EVALUATE TRUE                                            18280009
182900             WHEN PV-EDI-TEST-SWITCH-PROD AND                     18290009
183000                  PS-ISA-NOT-WRIT-CNTR                            18300009
183100                 PERFORM 5250-WRITE-CONMAN-P-REC-WS               18310009
183200                 SET PS-ISA-WRIT-CNTR TO TRUE                     18320009
183300                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18330009
183400             WHEN PV-EDI-TEST-SWITCH-TEST AND                     18340009
183500                  PS-ISA-NOT-WRIT-CNTR-TST                        18350009
183600                 PERFORM 5240-WRITE-CONMAN-T-REC-WS               18360009
183700                 SET PS-ISA-WRIT-CNTR-TST TO TRUE                 18370009
183800                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18380009
183900         END-EVALUATE                                             18390009
184000     END-IF.                                                      18400009
184100                                                                  18410009
184200     EVALUATE TRUE                                                18420009
184300         WHEN PV-EDI-TEST-SWITCH-PROD                             18430009
184400             PERFORM 5050-WRITE-CONMAN-P-REC                      18440009
184500         WHEN PV-EDI-TEST-SWITCH-TEST                             18450009
184600             PERFORM 5040-WRITE-CONMAN-T-REC                      18460009
184700     END-EVALUATE.                                                18470009
184800                                                                  18480009
184900     PERFORM 6000-ADD-TO-TOT-RECS-CONSOL.                         18490009
185000                                                                  18500009
185100******************************************************************18510009
185200* WRITE A RECORD TO EITHER THE PROD OR TEST EXPEDITOR IMPORT     *18520009
185300* ARRIVAL FILE.                                                  *18530009
185400******************************************************************18540009
185500 4130-WRITE-REC-TYP-ARRIVAL.                                      18550009
185600                                                                  18560009
185700     IF PS-ISA-NOT-WRIT-ARVL OR PS-ISA-NOT-WRIT-ARVL-TST          18570009
185800         EVALUATE TRUE                                            18580009
185900             WHEN PV-EDI-TEST-SWITCH-PROD AND                     18590009
186000                  PS-ISA-NOT-WRIT-ARVL                            18600009
186100                 PERFORM 5270-WRITE-CONOL-ARRIV-P-WS              18610009
186200                 SET PS-ISA-WRIT-ARVL TO TRUE                     18620009
186300                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18630009
186400             WHEN PV-EDI-TEST-SWITCH-TEST AND                     18640009
186500                  PS-ISA-NOT-WRIT-ARVL-TST                        18650009
186600                 PERFORM 5260-WRITE-CONOL-ARRIV-T-WS              18660009
186700                 SET PS-ISA-WRIT-ARVL-TST TO TRUE                 18670009
186800                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18680009
186900         END-EVALUATE                                             18690009
187000     END-IF.                                                      18700009
187100                                                                  18710009
187200     EVALUATE TRUE                                                18720009
187300         WHEN PV-EDI-TEST-SWITCH-PROD                             18730009
187400             PERFORM 5070-WRITE-CONOL-ARRIV-P-REC                 18740009
187500         WHEN PV-EDI-TEST-SWITCH-TEST                             18750009
187600             PERFORM 5060-WRITE-CONOL-ARRIV-T-REC                 18760009
187700     END-EVALUATE.                                                18770009
187800                                                                  18780009
187900     PERFORM 6000-ADD-TO-TOT-RECS-CONSOL.                         18790009
188000                                                                  18800009
188100******************************************************************18810009
188200* WRITE A RECORD TO EITHER THE PROD OR TEST EXPEDITOR CUSTOMS    *18820009
188300* DOCUMENT FILE.                                                 *18830009
188400******************************************************************18840009
188500 4140-WRITE-REC-TYP-CUSTOMS.                                      18850009
188700     IF PS-ISA-NOT-WRIT-CSTM OR PS-ISA-NOT-WRIT-CSTM-TST          18870009
188800         EVALUATE TRUE                                            18880009
188900             WHEN PV-EDI-TEST-SWITCH-PROD AND                     18890009
189000                  PS-ISA-NOT-WRIT-CSTM                            18900009
189100                 PERFORM 5290-WRITE-CNSLDT-CUST-P-WS              18910009
189200                 SET PS-ISA-WRIT-CSTM TO TRUE                     18920009
189300                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18930009
189400             WHEN PV-EDI-TEST-SWITCH-TEST AND                     18940009
189500                  PS-ISA-NOT-WRIT-CSTM-TST                        18950009
189600                 PERFORM 5280-WRITE-CNSLDT-CUST-T-WS              18960009
189700                 SET PS-ISA-WRIT-CSTM-TST TO TRUE                 18970009
189800                 PERFORM 6000-ADD-TO-TOT-RECS-CONSOL              18980009
189900         END-EVALUATE                                             18990009
190000     END-IF.                                                      19000009
190100                                                                  19010009
190200     EVALUATE TRUE                                                19020009
190300         WHEN PV-EDI-TEST-SWITCH-PROD                             19030009
190400             PERFORM 5090-WRITE-CNSLDT-CUST-P-REC                 19040009
190410                                                                  19041017
190500         WHEN PV-EDI-TEST-SWITCH-TEST                             19050009
190600             PERFORM 5080-WRITE-CNSLDT-CUST-T-REC                 19060009
190700     END-EVALUATE.                                                19070009
190800                                                                  19080009
190900     PERFORM 6000-ADD-TO-TOT-RECS-CONSOL.                         19090009
191000                                                                  19100009
191100******************************************************************19110009
191200*  PERFORM THE APPROPRIATE PARAGRAPH TO WRITE A TRIANGLE         *19120009
191300*  RECORD TO THE PROPER TEST OR PRODUCTION FILE.                 *19130009
191400******************************************************************19140009
191500 4150-WRITE-DECONSOL-REC.                                         19150009
191600                                                                  19160009
191700     EVALUATE TRUE                                                19170009
191800         WHEN TR090-PCK-SLP-RCD-TYP (1:3) = 'PO '                 19180009
191900         WHEN TR090-PCK-SLP-RCD-TYP (1:3) = 'POL'                 19190009
192000             PERFORM 4160-WRITE-TRI-REC-TYP-PKSLP                 19200009
192100                                                                  19210009
192200         WHEN TR090-TRI-REC-TYP-DELIVERY                          19220009
192300             PERFORM 4170-WRITE-REC-TYP-DELY                      19230009
192400                                                                  19240009
192500* PB 06/30/2010 BEG                                               19250009
192600         WHEN TR090-TRI-REC-TYP-WHSE-REPLEN                       19260009
192700             PERFORM 4175-WRITE-REC-TYP-WHSE-REPLEN               19270009
192800                                                                  19280009
192900* PB 06/30/2010 END                                               19290009
193000         WHEN TR090-EDI-RCD-TYPE-IEA                              19300009
193100         WHEN TR090-EDI-RCD-TYPE-CTT                              19310009
193200             IF PV-WROTE-REC-TYP-TRI-PKSLP                        19320009
193300                 PERFORM 4160-WRITE-TRI-REC-TYP-PKSLP             19330009
193400             END-IF                                               19340009
193500                                                                  19350009
193600             IF PV-WROTE-REC-TYP-TRI-DELY                         19360009
193700                 PERFORM 4170-WRITE-REC-TYP-DELY                  19370009
193800             END-IF                                               19380009
193900                                                                  19390009
194000* PB 06/30/2010 BEG                                               19400009
194100             IF PV-WROTE-REC-TYP-TRI-WHSE-RPLN                    19410009
194200                 PERFORM 4175-WRITE-REC-TYP-WHSE-REPLEN           19420009
194300             END-IF                                               19430009
194400                                                                  19440009
194500* PB 06/30/2010 END                                               19450009
194600                                                                  19460009
194700         WHEN OTHER                                               19470009
194800             IF PV-VALID-REC-TYPE                                 19480009
194900                 SET PV-INVALID-REC-TYPE TO TRUE                  19490009
195000                 WRITE CONSOL-EXCP-LINE                           19500009
195100                    FROM PV-WS-RECORD-TYPE                        19510009
195200                 ADD +1 TO  PV-EXCEPTION-WRITTEN                  19520009
195300                 PERFORM 5120-WRITE-EXCEPTION-REC                 19530009
195400                 ADD +1 TO  PV-EXCEPTION-WRITTEN                  19540009
195500             ELSE                                                 19550009
195600                 ADD +1 TO PV-EXCEPTION-WRITTEN                   19560009
195700                 PERFORM 5120-WRITE-EXCEPTION-REC                 19570009
195800             END-IF                                               19580009
195900     END-EVALUATE.                                                19590009
196000                                                                  19600009
196100******************************************************************19610009
196200* WRITE A RECORD TO EITHER THE PROD OR TEST TRIANGLE PACKSLIP    *19620009
196300* FILE.                                                          *19630009
196400******************************************************************19640009
196500 4160-WRITE-TRI-REC-TYP-PKSLP.                                    19650009
196600                                                                  19660009
196700     IF PS-ISA-NOT-WRIT-PKSLP OR PS-ISA-NOT-WRIT-PKSLP-TST        19670009
196800         EVALUATE TRUE                                            19680009
196900             WHEN PV-EDI-TEST-SWITCH-PROD AND                     19690009
197000                  PS-ISA-NOT-WRIT-PKSLP                           19700009
197100                 PERFORM 5325-WRITE-TRI-PKSLP-P-REC-WS            19710009
197200                 SET PS-ISA-WRIT-PKSLP TO TRUE                    19720009
197300                 PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE            19730009
197400             WHEN PV-EDI-TEST-SWITCH-TEST AND                     19740009
197500                  PS-ISA-NOT-WRIT-PKSLP-TST                       19750009
197600                 PERFORM 5320-WRITE-TRI-PKSLP-T-REC-WS            19760009
197700                 SET PS-ISA-WRIT-PKSLP-TST TO TRUE                19770009
197800                 PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE            19780009
197900         END-EVALUATE                                             19790009
198000     END-IF.                                                      19800009
198100                                                                  19810009
198200     EVALUATE TRUE                                                19820009
198300         WHEN PV-EDI-TEST-SWITCH-PROD                             19830009
198400             PERFORM 5010-WRITE-TRIANGLE-P-REC                    19840009
198500         WHEN PV-EDI-TEST-SWITCH-TEST                             19850009
198600             PERFORM 5000-WRITE-TRIANGLE-T-REC                    19860009
198700     END-EVALUATE.                                                19870009
198800                                                                  19880009
198900     PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE.                       19890009
199000                                                                  19900009
199100******************************************************************19910009
199200* WRITE A RECORD TO EITHER THE PROD OR TEST TRIANGLE DELIVERY    *19920009
199300* FILE.                                                          *19930009
199400******************************************************************19940009
199500 4170-WRITE-REC-TYP-DELY.                                         19950009
199600                                                                  19960009
199700     IF PS-ISA-NOT-WRIT-DELY OR PS-ISA-NOT-WRIT-DELY-TST          19970009
199800                                                                  19980009
199900*        ******************************************               19990009
200000*        * WHEN OCS DELIVERY, USE UWDC ENTID                      20000009
200100*        ******************************************               20010009
200200         IF PV-HOLD-ENT-ID = PC-OCSNY-ENTID                       20020009
200300           MOVE PC-UWDC-ENTID TO PV-HOLD-ENT-ID                   20030009
200400                                   TR090-ENT-ID                   20040009
200500                                   PV-WS-ENT-ID                   20050009
200600         END-IF                                                   20060009
200700*        ******************************************               20070009
200800                                                                  20080009
200900         EVALUATE TRUE                                            20090009
201000             WHEN PV-EDI-TEST-SWITCH-PROD AND                     20100009
201100                  PS-ISA-NOT-WRIT-DELY                            20110009
201200                 PERFORM 5335-WRITE-DELY-P-REC-WS                 20120009
201300                 SET PS-ISA-WRIT-DELY TO TRUE                     20130009
201400                 PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE            20140009
201500             WHEN PV-EDI-TEST-SWITCH-TEST AND                     20150009
201600                  PS-ISA-NOT-WRIT-DELY-TST                        20160009
201700                 PERFORM 5330-WRITE-DELY-T-REC-WS                 20170009
201800                 SET PS-ISA-WRIT-DELY-TST TO TRUE                 20180009
201900                 PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE            20190009
202000         END-EVALUATE                                             20200009
202100     END-IF.                                                      20210009
202200                                                                  20220009
202300     EVALUATE TRUE                                                20230009
202400         WHEN PV-EDI-TEST-SWITCH-PROD                             20240009
202500             PERFORM 5015-WRITE-TRI-DELIVERY-P-REC                20250009
202600         WHEN PV-EDI-TEST-SWITCH-TEST                             20260009
202700             PERFORM 5012-WRITE-TRI-DELIVERY-T-REC                20270009
202800     END-EVALUATE.                                                20280009
202900                                                                  20290009
203000     PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE.                       20300009
203100                                                                  20310009
203200* PB 06/30/2010 BEG                                               20320009
203300******************************************************************20330009
203400* WRITE A RECORD TO EITHER THE PROD OR TEST WHSE REPLENISHMENT   *20340009
203500* FILE.                                                          *20350009
203600******************************************************************20360009
203700 4175-WRITE-REC-TYP-WHSE-REPLEN.                                  20370009
203800                                                                  20380009
203900     IF PS-ISA-NOT-WRIT-WHSE-REPLEN OR                            20390009
204000                           PS-ISA-NOT-WRIT-WHSE-RPLN-TST          20400009
204100                                                                  20410009
204200*        ******************************************               20420009
204300*        * WHEN OCS DELIVERY, USE UWDC ENTID                      20430009
204400*        ******************************************               20440009
204500         IF PV-HOLD-ENT-ID = PC-OCSNY-ENTID                       20450009
204600           MOVE PC-UWDC-ENTID TO PV-HOLD-ENT-ID                   20460009
204700                                   TR090-ENT-ID                   20470009
204800                                   PV-WS-ENT-ID                   20480009
204900         END-IF                                                   20490009
205000*        ******************************************               20500009
205100                                                                  20510009
205200         EVALUATE TRUE                                            20520009
205300             WHEN PV-EDI-TEST-SWITCH-PROD AND                     20530009
205400                  PS-ISA-NOT-WRIT-WHSE-REPLEN                     20540009
205500                 PERFORM 5345-WRITE-WHSE-RPLN-P-REC-WS            20550009
205600                 SET PS-ISA-WRIT-WHSE-REPLEN TO TRUE              20560009
205700                 PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE            20570009
205800             WHEN PV-EDI-TEST-SWITCH-TEST AND                     20580009
205900                  PS-ISA-NOT-WRIT-WHSE-RPLN-TST                   20590009
206000                 PERFORM 5340-WRITE-WHSE-RPLN-T-REC-WS            20600009
206100                 SET PS-ISA-WRIT-WHSE-REPLEN-TST TO TRUE          20610009
206200                 PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE            20620009
206300         END-EVALUATE                                             20630009
206400     END-IF.                                                      20640009
206500                                                                  20650009
206600     EVALUATE TRUE                                                20660009
206700         WHEN PV-EDI-TEST-SWITCH-PROD                             20670009
206800             PERFORM 5013-WRITE-TRI-WHSE-RPLN-P-REC               20680009
206900         WHEN PV-EDI-TEST-SWITCH-TEST                             20690009
207000             PERFORM 5014-WRITE-TRI-WHSE-RPLN-T-REC               20700009
207100     END-EVALUATE.                                                20710009
207200                                                                  20720009
207300     PERFORM 6010-ADD-TO-TOT-RECS-TRIANGLE.                       20730009
207400                                                                  20740009
207500* PB 06/30/2010 END                                               20750009
207600******************************************************************20760009
207700* DISPLAY PROGRAM COUNTS TO CONSOLE. (SYSOUT)                    *20770009
207800******************************************************************20780009
207900*RJ                                                               20790009
208000 4180-DISPLAY-COUNTS.                                             20800009
208100                                                                  20810009
208200     DISPLAY '(TOTALS INCLUDE ISA, CTT AND IEA RECORDS)        '. 20820009
208300     DISPLAY '                                                 '. 20830009
208400                                                                  20840009
208500     MOVE PV-EXTRACTS-READ TO PV-EXTRACTS-READ-M.                 20850009
208600     DISPLAY '*** TOTAL RECORDS READ:                            '20860009
208700                         PV-EXTRACTS-READ-M.                      20870009
208800     MOVE PV-TOT-RECS-WRITTEN TO PV-TOT-RECS-WRITTEN-M.           20880009
208900     DISPLAY '*** TOTAL RECORDS WRITTEN:                         '20890009
209000                         PV-TOT-RECS-WRITTEN-M.                   20900009
209100     DISPLAY ' '.                                                 20910009
209200     MOVE PV-LOGICAL-PROCESSED-TR TO PV-LOGICAL-PROCESSED-TR-M    20920009
209300                                     PV-TOT-LTRI-PROCESSED-M.     20930009
209400     DISPLAY '*** TOTAL LOGICAL TRIANGLE FILES PROCESSED:        '20940009
209500                          PV-LOGICAL-PROCESSED-TR-M.              20950009
209600     MOVE PV-LOGICAL-PROCESSED-HU TO PV-LOGICAL-PROCESSED-HU-M    20960009
209700                                     PV-TOT-LHUD-PROCESSED-M.     20970009
209800     DISPLAY '*** TOTAL LOGICAL HUDD FILES PROCESSED:            '20980009
209900                          PV-LOGICAL-PROCESSED-HU-M.              20990009
210000     MOVE PV-LOGICAL-PROCESSED-AP TO PV-LOGICAL-PROCESSED-AP-M    21000009
210100                                     PV-TOT-LAPS-PROCESSED-M.     21010009
210200     DISPLAY '*** TOTAL LOGICAL APS FILES PROCESSED:             '21020009
210300                          PV-LOGICAL-PROCESSED-AP-M.              21030009
210400*    MOVE PV-LOGICAL-PROCESSED-UWD TO PV-LOGICAL-PROCESSED-UWD-M. 21040009
210500*    DISPLAY '*** TOTAL LOGICAL UWDC FILES PROCESSED:            '21050009
210600*                         PV-LOGICAL-PROCESSED-UWD-M.             21060009
210700     MOVE PV-LOGICAL-PROCESSED-GB TO PV-LOGICAL-PROCESSED-GB-M    21070009
210800                                     PV-TOT-LGLB-PROCESSED-M.     21080009
210900     DISPLAY '*** TOTAL LOGICAL GLB FILES PROCESSED:             '21090009
211000                          PV-LOGICAL-PROCESSED-GB-M.              21100009
211100     MOVE PV-LOGICAL-PROCESSED-EX TO PV-LOGICAL-PROCESSED-EX-M    21110009
211200                                     PV-TOT-LEXP-PROCESSED-M.     21120009
211300     DISPLAY '*** TOTAL LOGICAL EXPEDITOR FILES PROCESSED:       '21130009
211400                          PV-LOGICAL-PROCESSED-EX-M.              21140009
211500     MOVE PV-LOGICAL-PROCESSED-MK TO PV-LOGICAL-PROCESSED-MK-M    21150009
211600                                     PV-TOT-LMSK-PROCESSED-M.     21160009
211700     DISPLAY '*** TOTAL LOGICAL MAERSK FILES PROCESSED:          '21170009
211800                          PV-LOGICAL-PROCESSED-MK-M.              21180009
211900     MOVE PV-LOGICAL-PROCESSED-OC TO PV-LOGICAL-PROCESSED-OC-M    21190009
212000                                     PV-TOT-LNYK-PROCESSED-M.     21200009
212100     DISPLAY '*** TOTAL LOGICAL NYK FILES PROCESSED:             '21210009
212200                          PV-LOGICAL-PROCESSED-OC-M.              21220009
212300                                                                  21230009
212400     MOVE PV-LOGICAL-PROCESSED-LV TO PV-LOGICAL-PROCESSED-LV-M    21240009
212500                                     PV-TOT-LVNG-PROCESSED-M.     21250009
212600     DISPLAY '*** TOTAL LOGICAL LIVINGSTON FILES PROCESSED:      '21260009
212700                          PV-TOT-LVNG-PROCESSED-M.                21270009
212800                                                                  21280009
212900     MOVE PV-LOGICAL-PROCESSED TO PV-LOGICAL-PROCESSED-M          21290009
213000                                  PV-TOT-LFLE-PROCESSED-M.        21300009
213100     DISPLAY '*** TOTAL LOGICAL FILES PROCESSED:                 '21310009
213200                          PV-LOGICAL-PROCESSED-M.                 21320009
213300     DISPLAY ' '.                                                 21330009
213400     MOVE PV-DECONSOL-READ TO PV-DECONSOL-READ-M.                 21340009
213500     DISPLAY '*** TOTAL DECONSOLIDATOR RECORDS READ:             '21350009
213600                          PV-DECONSOL-READ-M.                     21360009
213700     MOVE PV-DECONSOL-WRITTEN TO PV-DECONSOL-WRITTEN-M.           21370009
213800     DISPLAY '*** TOTAL DECONSOLIDATOR RECORDS WRITTEN:          '21380009
213900                          PV-DECONSOL-WRITTEN-M.                  21390009
214000     DISPLAY ' '.                                                 21400009
214100     MOVE PV-TRI-PKSLP-READ TO PV-TRIANGLE-PACKSLIP-READ-M.       21410009
214200     DISPLAY '*** TOTAL TRIANGLE PKSLP RECORDS READ:             '21420009
214300                          PV-TRIANGLE-PACKSLIP-READ-M.            21430009
214400     MOVE PV-TRI-PKSLP-WRITTEN-TEST TO                            21440009
214500                          PV-TRI-PACKSLIP-WRITTEN-TEST-M.         21450009
214600     DISPLAY '*** TOTAL TRIANGLE TEST PKSLP RECORDS WRITTEN:     '21460009
214700                          PV-TRI-PACKSLIP-WRITTEN-TEST-M.         21470009
214800     MOVE PV-TRI-PKSLP-WRITTEN-PROD TO                            21480009
214900                          PV-TRI-PACKSLIP-WRITTEN-PROD-M.         21490009
215000     DISPLAY '*** TOTAL TRIANGLE PROD PKSLP RECORDS WRITTEN:     '21500009
215100                          PV-TRI-PACKSLIP-WRITTEN-PROD-M.         21510009
215200     DISPLAY ' '.                                                 21520009
215300     MOVE PV-TRI-DELIVERY-READ TO PV-TRIANGLE-DELIVERY-READ-M.    21530009
215400     DISPLAY '*** TOTAL TRIANGLE DELIVERIES READ:                '21540009
215500                          PV-TRIANGLE-DELIVERY-READ-M.            21550009
215600     MOVE PV-TRI-DELIVERY-WRITTEN-TEST TO                         21560009
215700                             PV-TRI-DELIVERY-WRITTEN-TEST-M.      21570009
215800     DISPLAY '*** TOTAL TRIANGLE TEST DELIVERIES WRITTEN:        '21580009
215900                          PV-TRI-DELIVERY-WRITTEN-TEST-M.         21590009
216000     MOVE PV-TRI-DELIVERY-WRITTEN-PROD TO                         21600009
216100                             PV-TRI-DELIVERY-WRITTEN-PROD-M.      21610009
216200     DISPLAY '*** TOTAL TRIANGLE PROD DELIVERIES WRITTEN:        '21620009
216300                          PV-TRI-DELIVERY-WRITTEN-PROD-M.         21630009
216400     DISPLAY ' '.                                                 21640009
216500     MOVE PV-HUD-DELIVERY-READ TO PV-HUD-DELIVERY-READ-M.         21650009
216600     DISPLAY '*** TOTAL HUDD DELIVERIES READ:                    '21660009
216700                          PV-HUD-DELIVERY-READ-M.                 21670009
216800     MOVE PV-HUD-DELIVERY-WRITTEN-TEST TO                         21680009
216900                             PV-HUD-DELIVERY-WRITTEN-TEST-M.      21690009
217000     DISPLAY '*** TOTAL HUDD TEST DELIVERIES WRITTEN:            '21700009
217100                          PV-HUD-DELIVERY-WRITTEN-TEST-M.         21710009
217200     MOVE PV-HUD-DELIVERY-WRITTEN-PROD TO                         21720009
217300                             PV-HUD-DELIVERY-WRITTEN-PROD-M.      21730009
217400     DISPLAY '*** TOTAL HUDD PROD DELIVERIES WRITTEN:            '21740009
217500                          PV-HUD-DELIVERY-WRITTEN-PROD-M.         21750009
217600     DISPLAY ' '.                                                 21760009
217700     MOVE PV-APS-DELIVERY-READ TO PV-APS-DELIVERY-READ-M.         21770009
217800     DISPLAY '*** TOTAL APS DELIVERIES READ:                     '21780009
217900                          PV-APS-DELIVERY-READ-M.                 21790009
218000     MOVE PV-APS-DELIVERY-WRITTEN-TEST TO                         21800009
218100                             PV-APS-DELIVERY-WRITTEN-TEST-M.      21810009
218200     DISPLAY '*** TOTAL APS TEST DELIVERIES WRITTEN:             '21820009
218300                          PV-APS-DELIVERY-WRITTEN-TEST-M.         21830009
218400     MOVE PV-APS-DELIVERY-WRITTEN-PROD TO                         21840009
218500                             PV-APS-DELIVERY-WRITTEN-PROD-M.      21850009
218600     DISPLAY '*** TOTAL APS PROD DELIVERIES WRITTEN:             '21860009
218700                          PV-APS-DELIVERY-WRITTEN-PROD-M.         21870009
218800     DISPLAY ' '.                                                 21880009
218900     MOVE PV-GLB-DELIVERY-READ TO PV-GLB-DELIVERY-READ-M.         21890009
219000     DISPLAY '*** TOTAL GLB DELIVERIES READ:                     '21900009
219100                          PV-GLB-DELIVERY-READ-M.                 21910009
219200     MOVE PV-GLB-DELIVERY-WRITTEN-TEST TO                         21920009
219300                             PV-GLB-DELIVERY-WRITTEN-TEST-M.      21930009
219400     DISPLAY '*** TOTAL GLB TEST DELIVERIES WRITTEN:             '21940009
219500                          PV-GLB-DELIVERY-WRITTEN-TEST-M.         21950009
219600     MOVE PV-GLB-DELIVERY-WRITTEN-PROD TO                         21960009
219700                             PV-GLB-DELIVERY-WRITTEN-PROD-M.      21970009
219800     DISPLAY '*** TOTAL GLB PROD DELIVERIES WRITTEN:             '21980009
219900                          PV-GLB-DELIVERY-WRITTEN-PROD-M.         21990009
220000     DISPLAY ' '.                                                 22000009
220100     MOVE PV-UWD-DELIVERY-READ TO PV-UWD-DELIVERY-READ-M.         22010009
220200     DISPLAY '*** TOTAL UWDC DELIVERIES READ:                    '22020009
220300                          PV-UWD-DELIVERY-READ-M.                 22030009
220400     MOVE PV-UWD-DELIVERY-WRITTEN-TEST TO                         22040009
220500                             PV-UWD-DELIVERY-WRITTEN-TEST-M.      22050009
220600     DISPLAY '*** TOTAL UWDC TEST DELIVERIES WRITTEN:            '22060009
220700                          PV-UWD-DELIVERY-WRITTEN-TEST-M.         22070009
220800     MOVE PV-UWD-DELIVERY-WRITTEN-PROD TO                         22080009
220900                             PV-UWD-DELIVERY-WRITTEN-PROD-M.      22090009
221000     DISPLAY '*** TOTAL UWDC PROD DELIVERIES WRITTEN:            '22100009
221100                          PV-UWD-DELIVERY-WRITTEN-PROD-M.         22110009
221200     DISPLAY ' '.                                                 22120009
221300     MOVE PV-CONSOLIDATOR-READ TO PV-CONSOLIDATOR-READ-M.         22130009
221400     DISPLAY '*** TOTAL CONSOLIDATOR PO TRACKING RECORDS READ:   '22140009
221500                          PV-CONSOLIDATOR-READ-M.                 22150009
221600     MOVE PV-CONSOLIDATOR-WRITTEN TO PV-CONSOLIDATOR-WRITTEN-M.   22160009
221700     DISPLAY '*** TOTAL CONSOLIDATOR PO TRACKING RECORDS WRITTEN:'22170009
221800                          PV-CONSOLIDATOR-WRITTEN-M.              22180009
221900     DISPLAY ' '.                                                 22190009
222000     MOVE PV-EXP-BKG-READ    TO PV-EXP-BKG-READ-M.                22200009
222100     DISPLAY '*** TOTAL EXPEDITOR BOOKINGS READ:                 '22210009
222200                          PV-EXP-BKG-READ-M.                      22220009
222300     MOVE PV-EXP-BKG-WRITTEN-TEST TO PV-EXP-BKG-WRITTEN-TEST-M.   22230009
222400     DISPLAY '*** TOTAL EXPEDITOR TEST BOOKINGS WRITTEN:         '22240009
222500                          PV-EXP-BKG-WRITTEN-TEST-M.              22250009
222600     MOVE PV-EXP-BKG-WRITTEN-PROD TO PV-EXP-BKG-WRITTEN-PROD-M.   22260009
222700     DISPLAY '*** TOTAL EXPEDITOR PROD BOOKINGS WRITTEN:         '22270009
222800                          PV-EXP-BKG-WRITTEN-PROD-M.              22280009
222900     DISPLAY ' '.                                                 22290009
223000     MOVE PV-EXP-RCVG-READ   TO PV-EXP-RCVG-READ-M.               22300009
223100     DISPLAY '*** TOTAL EXPEDITOR RECEIVINGS READ:               '22310009
223200                          PV-EXP-RCVG-READ-M.                     22320009
223300     MOVE PV-EXP-RCVG-WRITTEN-TEST TO PV-EXP-RCVG-WRITTEN-TEST-M. 22330009
223400     DISPLAY '*** TOTAL EXPEDITOR TEST RECEIVINGS WRITTEN:       '22340009
223500                          PV-EXP-RCVG-WRITTEN-TEST-M.             22350009
223600     MOVE PV-EXP-RCVG-WRITTEN-PROD TO PV-EXP-RCVG-WRITTEN-PROD-M. 22360009
223700     DISPLAY '*** TOTAL EXPEDITOR PROD RECEIVINGS WRITTEN:       '22370009
223800                          PV-EXP-RCVG-WRITTEN-PROD-M.             22380009
223900     DISPLAY ' '.                                                 22390009
224000     MOVE PV-EXP-CONMAN-READ  TO PV-EXP-CONMAN-READ-M.            22400009
224100     DISPLAY '*** TOTAL EXPEDITOR CONTNR MANIFESTS READ:         '22410009
224200                          PV-EXP-CONMAN-READ-M.                   22420009
224300     MOVE PV-EXP-CONMAN-WRITTEN-TEST                              22430009
224400                       TO PV-EXP-CONMAN-WRITTEN-TEST-M            22440009
224500     DISPLAY '*** TOTAL EXPEDITOR TEST CONTNR MANIFESTS WRITTEN: '22450009
224600                          PV-EXP-CONMAN-WRITTEN-TEST-M.           22460009
224700     MOVE PV-EXP-CONMAN-WRITTEN-PROD                              22470009
224800                       TO PV-EXP-CONMAN-WRITTEN-PROD-M            22480009
224900     DISPLAY '*** TOTAL EXPEDITOR PROD CONTNR MANIFESTS WRITTEN: '22490009
225000                          PV-EXP-CONMAN-WRITTEN-PROD-M.           22500009
225100     DISPLAY ' '.                                                 22510009
225200     MOVE PV-EXP-ARRIVAL-READ  TO PV-EXP-ARRIVAL-READ-M.          22520009
225300     DISPLAY '*** TOTAL EXPEDITOR ARRIVALS READ:                 '22530009
225400                          PV-EXP-ARRIVAL-READ-M.                  22540009
225500     MOVE PV-EXP-ARRIVAL-WRITTEN-TEST                             22550009
225600                       TO PV-EXP-ARRIVAL-WRITTEN-TEST-M.          22560009
225700     DISPLAY '*** TOTAL EXPEDITOR TEST ARRIVALS WRITTEN:         '22570009
225800                          PV-EXP-ARRIVAL-WRITTEN-TEST-M.          22580009
225900     MOVE PV-EXP-ARRIVAL-WRITTEN-PROD                             22590009
226000                       TO PV-EXP-ARRIVAL-WRITTEN-PROD-M.          22600009
226100     DISPLAY '*** TOTAL EXPEDITOR PROD ARRIVALS WRITTEN:         '22610009
226200                          PV-EXP-ARRIVAL-WRITTEN-PROD-M.          22620009
226300     DISPLAY ' '.                                                 22630009
226400     MOVE PV-EXP-CUSTOMS-READ  TO PV-EXP-CUSTOMS-READ-M.          22640009
226500     DISPLAY '*** TOTAL EXPEDITOR CUSTOMS READ:                  '22650009
226600                          PV-EXP-CUSTOMS-READ-M.                  22660009
226700     MOVE PV-EXP-CUSTOMS-WRITTEN-TEST                             22670009
226800                       TO PV-EXP-CUSTOMS-WRITTEN-TEST-M.          22680009
226900     DISPLAY '*** TOTAL EXPEDITOR TEST CUSTOMS WRITTEN:          '22690009
227000                          PV-EXP-CUSTOMS-WRITTEN-TEST-M.          22700009
227100     MOVE PV-EXP-CUSTOMS-WRITTEN-PROD                             22710009
227200                       TO PV-EXP-CUSTOMS-WRITTEN-PROD-M.          22720009
227300     DISPLAY '*** TOTAL EXPEDITOR PROD CUSTOMS WRITTEN:          '22730009
227400                          PV-EXP-CUSTOMS-WRITTEN-PROD-M.          22740009
227500     DISPLAY ' '.                                                 22750009
227600     MOVE PV-LVG-CUSTOMS-READ  TO PV-LVG-CUSTOMS-READ-M.          22760009
227700     DISPLAY '*** TOTAL LIVINGSTON CUSTOMS READ:                 '22770009
227800                          PV-LVG-CUSTOMS-READ-M.                  22780009
227900     MOVE PV-LVG-CUSTOMS-WRITTEN-TEST                             22790009
228000                       TO PV-LVG-CUSTOMS-WRITTEN-TEST-M.          22800009
228100     DISPLAY '*** TOTAL LIVINGSTON TEST CUSTOMS WRITTEN:         '22810009
228200                          PV-LVG-CUSTOMS-WRITTEN-TEST-M.          22820009
228300     MOVE PV-LVG-CUSTOMS-WRITTEN-PROD                             22830009
228400                       TO PV-LVG-CUSTOMS-WRITTEN-PROD-M.          22840009
228500     DISPLAY '*** TOTAL LIVINGSTON PROD CUSTOMS WRITTEN:         '22850009
228600                          PV-LVG-CUSTOMS-WRITTEN-PROD-M.          22860009
228700     DISPLAY ' '.                                                 22870009
228800     MOVE PV-MAERSK-BKG-READ TO PV-MAERSK-BKG-READ-M.             22880009
228900     DISPLAY '*** TOTAL MAERSK BOOKINGS READ:                    '22890009
229000                          PV-MAERSK-BKG-READ-M.                   22900009
229100     MOVE PV-MAERSK-BKG-WRITTEN-TEST                              22910009
229200                             TO PV-MAERSK-BKG-WRITTEN-TEST-M.     22920009
229300     DISPLAY '*** TOTAL MAERSK TEST BOOKINGS WRITTEN:            '22930009
229400                          PV-MAERSK-BKG-WRITTEN-TEST-M.           22940009
229500     MOVE PV-MAERSK-BKG-WRITTEN-PROD                              22950009
229600                             TO PV-MAERSK-BKG-WRITTEN-PROD-M.     22960009
229700     DISPLAY '*** TOTAL MAERSK PROD BOOKINGS WRITTEN:            '22970009
229800                          PV-MAERSK-BKG-WRITTEN-PROD-M.           22980009
229900     DISPLAY ' '.                                                 22990009
230000     MOVE PV-MAERSK-RCVG-READ TO PV-MAERSK-RCVG-READ-M.           23000009
230100     DISPLAY '*** TOTAL MAERSK RECEIVINGS READ:                  '23010009
230200                          PV-MAERSK-RCVG-READ-M.                  23020009
230300     MOVE PV-MAERSK-RCVG-WRITTEN-TEST                             23030009
230400                             TO PV-MAERSK-RCVG-WRITTEN-TEST-M.    23040009
230500     DISPLAY '*** TOTAL MAERSK TEST RECEIVINGS WRITTEN:          '23050009
230600                          PV-MAERSK-RCVG-WRITTEN-TEST-M.          23060009
230700     MOVE PV-MAERSK-RCVG-WRITTEN-PROD                             23070009
230800                             TO PV-MAERSK-RCVG-WRITTEN-PROD-M.    23080009
230900     DISPLAY '*** TOTAL MAERSK PROD RECEIVINGS WRITTEN:          '23090009
231000                          PV-MAERSK-RCVG-WRITTEN-PROD-M.          23100009
231100     DISPLAY ' '.                                                 23110009
231200     MOVE PV-MAERSK-CONMAN-READ TO PV-MAERSK-CONMAN-READ-M.       23120009
231300     DISPLAY '*** TOTAL MAERSK CONTNR MANIFESTS READ:            '23130009
231400                          PV-MAERSK-CONMAN-READ-M.                23140009
231500     MOVE PV-MAERSK-CONMAN-WRITTEN-TEST                           23150009
231600                       TO PV-MAERSK-CONMAN-WRITE-TEST-M           23160009
231700     DISPLAY '*** TOTAL MAERSK TEST CONTNR MANIFESTS WRITTEN:    '23170009
231800                          PV-MAERSK-CONMAN-WRITE-TEST-M.          23180009
231900     MOVE PV-MAERSK-CONMAN-WRITTEN-PROD                           23190009
232000                       TO PV-MAERSK-CONMAN-WRITE-PROD-M           23200009
232100     DISPLAY '*** TOTAL MAERSK PROD CONTNR MANIFESTS WRITTEN:    '23210009
232200                          PV-MAERSK-CONMAN-WRITE-PROD-M.          23220009
232300     DISPLAY ' '.                                                 23230009
232400     MOVE PV-NYK-BKG-READ    TO PV-NYK-BKG-READ-M.                23240009
232500     DISPLAY '*** TOTAL NYK LOGISTICS BOOKINGS READ:             '23250009
232600                          PV-NYK-BKG-READ-M.                      23260009
232700     MOVE PV-NYK-BKG-WRITTEN-TEST TO PV-NYK-BKG-WRITTEN-TEST-M.   23270009
232800     DISPLAY '*** TOTAL NYK LOGISTICS TEST BOOKINGS WRITTEN:     '23280009
232900                          PV-NYK-BKG-WRITTEN-TEST-M.              23290009
233000     MOVE PV-NYK-BKG-WRITTEN-PROD TO PV-NYK-BKG-WRITTEN-PROD-M.   23300009
233100     DISPLAY '*** TOTAL NYK LOGISTICS PROD BOOKINGS WRITTEN:     '23310009
233200                          PV-NYK-BKG-WRITTEN-PROD-M.              23320009
233300     DISPLAY ' '.                                                 23330009
233400     MOVE PV-NYK-RCVG-READ   TO PV-NYK-RCVG-READ-M.               23340009
233500     DISPLAY '*** TOTAL NYK LOGISTICS RECEIVINGS READ:           '23350009
233600                          PV-NYK-RCVG-READ-M.                     23360009
233700     MOVE PV-NYK-RCVG-WRITTEN-TEST TO PV-NYK-RCVG-WRITTEN-TEST-M. 23370009
233800     DISPLAY '*** TOTAL NYK LOGISTICS TEST RECEIVINGS WRITTEN:   '23380009
233900                          PV-NYK-RCVG-WRITTEN-TEST-M.             23390009
234000     MOVE PV-NYK-RCVG-WRITTEN-PROD TO PV-NYK-RCVG-WRITTEN-PROD-M. 23400009
234100     DISPLAY '*** TOTAL NYK LOGISTICS PROD RECEIVINGS WRITTEN:   '23410009
234200                          PV-NYK-RCVG-WRITTEN-PROD-M.             23420009
234300     DISPLAY ' '.                                                 23430009
234400     MOVE PV-NYK-CONMAN-READ  TO PV-NYK-CONMAN-READ-M.            23440009
234500     DISPLAY '*** TOTAL NYK LOGISTICS CONTNR MANIFESTS READ:     '23450009
234600                          PV-NYK-CONMAN-READ-M.                   23460009
234700     MOVE PV-NYK-CONMAN-WRITTEN-TEST                              23470009
234800                       TO PV-NYK-CONMAN-WRITTEN-TEST-M            23480009
234900     DISPLAY '*** TOTAL NYK LOGISTICS TEST CONTNR WRITTEN:       '23490009
235000                          PV-NYK-CONMAN-WRITTEN-TEST-M.           23500009
235100     MOVE PV-NYK-CONMAN-WRITTEN-PROD                              23510009
235200                       TO PV-NYK-CONMAN-WRITTEN-PROD-M            23520009
235300     DISPLAY '*** TOTAL NYK LOGISTICS PROD CONTNR WRITTEN:       '23530009
235400                          PV-NYK-CONMAN-WRITTEN-PROD-M.           23540009
235500* PB 06/30/2010 BEG                                               23550009
235600     DISPLAY ' '.                                                 23560009
235700     MOVE PV-TRI-WHSE-REPLEN-READ                                 23570009
235800                       TO PV-TRIANGLE-WHSE-REPLEN-READ-M.         23580009
235900     DISPLAY '*** TOTAL TRIANGLE WHSE REPLEN RECORDS READ:       '23590009
236000                          PV-TRIANGLE-WHSE-REPLEN-READ-M.         23600009
236100     MOVE PV-TRI-WHSE-RPLN-WRITTEN-TST                            23610009
236200                       TO PV-TRI-WHSE-RPLN-WRITTEN-TST-M.         23620009
236300     DISPLAY '*** TOTAL TRIANGLE TEST WHSE REPLEN WRITTEN:       '23630009
236400                          PV-TRI-WHSE-RPLN-WRITTEN-TST-M.         23640009
236500     MOVE PV-TRI-WHSE-RPLN-WRITTEN-PRD                            23650009
236600                       TO PV-TRI-WHSE-RPLN-WRITTEN-PRD-M.         23660009
236700     DISPLAY '*** TOTAL TRIANGLE PROD WHSE REPLEN WRITTEN:       '23670009
236800                          PV-TRI-WHSE-RPLN-WRITTEN-PRD-M.         23680009
236900     DISPLAY ' '.                                                 23690009
237000     MOVE PV-HUD-WHSE-REPLEN-READ                                 23700009
237100                       TO PV-HUD-WHSE-REPLEN-READ-M.              23710009
237200     DISPLAY '*** TOTAL HUDD WHSE REPLEN RECORDS READ:           '23720009
237300                          PV-HUD-WHSE-REPLEN-READ-M.              23730009
237400     MOVE PV-HUD-WHSE-RPLN-WRITTEN-TST                            23740009
237500                       TO PV-HUD-WHSE-RPLN-WRITTEN-TST-M.         23750009
237600     DISPLAY '*** TOTAL HUDD TEST WHSE REPLEN RECORDS WRITTEN:   '23760009
237700                          PV-HUD-WHSE-RPLN-WRITTEN-TST-M.         23770009
237800     MOVE PV-HUD-WHSE-RPLN-WRITTEN-PRD                            23780009
237900                       TO PV-HUD-WHSE-RPLN-WRITTEN-PRD-M.         23790009
238000     DISPLAY '*** TOTAL HUDD PROD WHSE REPLEN RECORDS WRITTEN:   '23800009
238100                          PV-HUD-WHSE-RPLN-WRITTEN-PRD-M.         23810009
238200     DISPLAY ' '.                                                 23820009
238300     MOVE PV-APS-WHSE-REPLEN-READ                                 23830009
238400                       TO PV-APS-WHSE-REPLEN-READ-M.              23840009
238500     DISPLAY '*** TOTAL APS WHSE REPLEN RECORDS READ:            '23850009
238600                          PV-APS-WHSE-REPLEN-READ-M.              23860009
238700     MOVE PV-APS-WHSE-RPLN-WRITTEN-TST                            23870009
238800                       TO PV-APS-WHSE-RPLN-WRITTEN-TST-M.         23880009
238900     DISPLAY '*** TOTAL APS TEST WHSE REPLEN RECORDS WRITTEN:    '23890009
239000                          PV-APS-WHSE-RPLN-WRITTEN-TST-M.         23900009
239100     MOVE PV-APS-WHSE-RPLN-WRITTEN-PRD                            23910009
239200                       TO PV-APS-WHSE-RPLN-WRITTEN-PRD-M.         23920009
239300     DISPLAY '*** TOTAL APS PROD WHSE REPLEN RECORDS WRITTEN:    '23930009
239400                          PV-APS-WHSE-RPLN-WRITTEN-PRD-M.         23940009
239500     DISPLAY ' '.                                                 23950009
239600     MOVE PV-GLB-WHSE-REPLEN-READ                                 23960009
239700                       TO PV-GLB-WHSE-REPLEN-READ-M.              23970009
239800     DISPLAY '*** TOTAL GLB WHSE REPLEN RECORDS READ:            '23980009
239900                          PV-GLB-WHSE-REPLEN-READ-M.              23990009
240000     MOVE PV-GLB-WHSE-RPLN-WRITTEN-TST                            24000009
240100                       TO PV-GLB-WHSE-RPLN-WRITTEN-TST-M.         24010009
240200     DISPLAY '*** TOTAL GLB TEST WHSE REPLEN RECORDS WRITTEN:    '24020009
240300                          PV-GLB-WHSE-RPLN-WRITTEN-TST-M.         24030009
240400     MOVE PV-GLB-WHSE-RPLN-WRITTEN-PRD                            24040009
240500                       TO PV-GLB-WHSE-RPLN-WRITTEN-PRD-M.         24050009
240600     DISPLAY '*** TOTAL GLB PROD WHSE REPLEN RECORDS WRITTEN:    '24060009
240700                          PV-GLB-WHSE-RPLN-WRITTEN-PRD-M.         24070009
240800     DISPLAY ' '.                                                 24080009
240900     MOVE PV-UWD-WHSE-REPLEN-READ                                 24090009
241000                       TO PV-UWD-WHSE-REPLEN-READ-M.              24100009
241100     DISPLAY '*** TOTAL UWD WHSE REPLEN RECORDS READ:            '24110009
241200                          PV-UWD-WHSE-REPLEN-READ-M.              24120009
241300     MOVE PV-UWD-WHSE-RPLN-WRITTEN-TST                            24130009
241400                       TO PV-UWD-WHSE-RPLN-WRITTEN-TST-M.         24140009
241500     DISPLAY '*** TOTAL UWD TEST WHSE REPLEN RECORDS WRITTEN:    '24150009
241600                          PV-UWD-WHSE-RPLN-WRITTEN-TST-M.         24160009
241700     MOVE PV-UWD-WHSE-RPLN-WRITTEN-PRD                            24170009
241800                       TO PV-UWD-WHSE-RPLN-WRITTEN-PRD-M.         24180009
241900     DISPLAY '*** TOTAL UWD PROD WHSE REPLEN RECORDS WRITTEN:    '24190009
242000                          PV-UWD-WHSE-RPLN-WRITTEN-PRD-M.         24200009
242100* PB 06/30/2010 END                                               24210009
242200     DISPLAY ' '.                                                 24220009
242300     MOVE PV-EXCEPTION-WRITTEN TO PV-EXCEPTION-WRITTEN-M.         24230009
242400     DISPLAY '*** TOTAL EXCEPTION RECORDS WRITTEN:               '24240009
242500                          PV-EXCEPTION-WRITTEN-M.                 24250009
242600     DISPLAY ' '.                                                 24260009
242700     DISPLAY '*** TOTAL FILES PROCESSED:                         '24270009
242800                          PV-LOGICAL-PROCESSED-M.                 24280009
242900     DISPLAY '*** TOTAL TRIANGLE FILES PROCESSED:                '24290009
243000                          PV-LOGICAL-PROCESSED-TR-M.              24300009
243100     DISPLAY '*** TOTAL HUDD FILES PROCESSED:                    '24310009
243200                          PV-LOGICAL-PROCESSED-HU-M.              24320009
243300     DISPLAY '*** TOTAL APS FILES PROCESSED:                     '24330009
243400                          PV-LOGICAL-PROCESSED-AP-M.              24340009
243500     DISPLAY '*** TOTAL GLB FILES PROCESSED:                     '24350009
243600                          PV-LOGICAL-PROCESSED-GB-M.              24360009
243700     DISPLAY '*** TOTAL EXPEDITOR FILES PROCESSED:               '24370009
243800                          PV-LOGICAL-PROCESSED-EX-M.              24380009
243900     DISPLAY '*** TOTAL MAERSK FILES PROCESSED:ED:               '24390009
244000                          PV-LOGICAL-PROCESSED-MK-M.              24400009
244100     DISPLAY '*** TOTAL NYK LOGISTICS FILES PROCESSED:           '24410009
244200                          PV-LOGICAL-PROCESSED-OC-M.              24420009
244300     MOVE PV-TOT-LOGICAL-BAD TO PV-TOT-LOGICAL-BAD-M.             24430009
244400     DISPLAY '*** TOTAL FILES NOT PROCESSED:                     '24440009
244500                          PV-TOT-LOGICAL-BAD-M.                   24450009
244600     MOVE PV-INVALID-ENT-ID-ON-ISA TO PV-INVALID-ENT-ID-ON-ISA-M. 24460009
244700     DISPLAY '*** TOTAL ISA RECS WITH AN INVALID ENT ID:         '24470009
244800                          PV-INVALID-ENT-ID-ON-ISA-M.             24480009
244900     MOVE PV-TOT-LOGICAL-BAD TO PV-TOT-LOGICAL-BAD-M              24490009
245000                                PV-TOT-LOGICAL-FILE-NOT-P.        24500009
245100     DISPLAY '*** TOTAL LOGICAL FILES NOT PROCESSED:             '24510009
245200                                PV-TOT-LOGICAL-BAD-M.             24520009
245300     MOVE PV-TOT-LOGICAL-REC-BAD TO PV-TOT-LOGICAL-REC-BAD-M      24530009
245400                                    PV-TOT-LOGICAL-RECS-NOT-P.    24540009
245500     DISPLAY '*** TOTAL LOGICAL RECORDS NOT PROCESSED:           '24550009
245600                          PV-TOT-LOGICAL-REC-BAD-M                24560009
245700                                                                  24570009
245800     MOVE PV-MIS-MATCHING-CTT-COUNT TO                            24580009
245900                          PV-MIS-MATCHING-CTT-COUNT-M.            24590009
246000     DISPLAY '*** TOTAL LOGICAL FILE/CTT COUNT MISMATCHES:       '24600009
246100                          PV-MIS-MATCHING-CTT-COUNT-M.            24610009
246200                                                                  24620009
246300     MOVE PV-MISSING-CTT-RECS      TO PV-MISSING-CTT-RECS-M.      24630009
246400     DISPLAY '*** TOTAL LOGICAL FILES WITH MISSING CTT RECS:     '24640009
246500                          PV-MISSING-CTT-RECS-M.                  24650009
246600                                                                  24660009
246700******************************************************************24670009
246800* PRINT A SUMMARY REPORT.                                        *24680009
246900******************************************************************24690009
247000*RJ                                                               24700009
247100 4090-PRINT-REPORT.                                               24710009
247200                                                                  24720009
247300     MOVE 0              TO PV-LINE-CNT.                          24730009
247400     ADD 1               TO PV-PAGE-CNT.                          24740009
247500     MOVE PV-PAGE-CNT    TO DP132O-PAGE-NUMBER.                   24750009
247600     MOVE 1              TO DP132O-REPORT-NUMBER.                 24760009
247700     MOVE 'TRKUT090'     TO DP132O-PROGRAM-NAME.                  24770009
247800                                                                  24780009
247900     MOVE DP132O-STANDRD-HEADER-132-COLS TO PRINT-LINE.           24790009
248000                                                                  24800009
248100     PERFORM 4190-WRITE-TOP1.                                     24810009
248200     MOVE SPACES TO PRINT-LINE.                                   24820009
248300     PERFORM 4200-WRITE-REPORT1.                                  24830009
248400     MOVE HEAD-LINE1 TO PRINT-LINE.                               24840009
248500     PERFORM 4200-WRITE-REPORT1.                                  24850009
248600     MOVE SPACES TO PRINT-LINE.                                   24860009
248700     PERFORM 4200-WRITE-REPORT1.                                  24870009
248800     IF PV-EXCP-COUNTER > 0                                       24880009
248900        MOVE HEAD-LINE2 TO PRINT-LINE                             24890009
249000     ELSE                                                         24900009
249100        MOVE HEAD-LINE5 TO PRINT-LINE                             24910009
249200     END-IF.                                                      24920009
249300     PERFORM 4200-WRITE-REPORT1.                                  24930009
249400     MOVE SPACES TO PRINT-LINE.                                   24940009
249500     PERFORM 4200-WRITE-REPORT1.                                  24950009
249600     MOVE HEAD-LINE3 TO PRINT-LINE.                               24960009
249700     PERFORM 4200-WRITE-REPORT1.                                  24970009
249800     MOVE HEAD-LINE4 TO PRINT-LINE.                               24980009
249900     PERFORM 4200-WRITE-REPORT1.                                  24990009
250000     MOVE SPACES TO PRINT-LINE.                                   25000009
250100     PERFORM 4200-WRITE-REPORT1.                                  25010009
250200     MOVE SPACES TO PRINT-LINE.                                   25020009
250300     PERFORM 4200-WRITE-REPORT1.                                  25030009
250400     MOVE PV-PRT-TTL-READ TO PRINT-LINE.                          25040009
250500     PERFORM 4200-WRITE-REPORT1.                                  25050009
250600     MOVE PV-PRT-TTL-WRITTEN TO PRINT-LINE.                       25060009
250700     PERFORM 4200-WRITE-REPORT1.                                  25070009
250800     MOVE SPACES TO PRINT-LINE.                                   25080009
250900     PERFORM 4200-WRITE-REPORT1.                                  25090009
251000                                                                  25100009
251100     MOVE PV-PRT-LTRI-PROCESSED TO PRINT-LINE.                    25110009
251200     PERFORM 4200-WRITE-REPORT1.                                  25120009
251300                                                                  25130009
251400     MOVE PV-PRT-LHUD-PROCESSED TO PRINT-LINE.                    25140009
251500     PERFORM 4200-WRITE-REPORT1.                                  25150009
251600                                                                  25160009
251700     MOVE PV-PRT-LAPS-PROCESSED TO PRINT-LINE.                    25170009
251800     PERFORM 4200-WRITE-REPORT1.                                  25180009
251900                                                                  25190009
252000     MOVE PV-PRT-LGLB-PROCESSED TO PRINT-LINE.                    25200009
252100     PERFORM 4200-WRITE-REPORT1.                                  25210009
252200                                                                  25220009
252300     MOVE PV-PRT-LEXP-PROCESSED TO PRINT-LINE.                    25230009
252400     PERFORM 4200-WRITE-REPORT1.                                  25240009
252500                                                                  25250009
252600     MOVE PV-PRT-LMSK-PROCESSED TO PRINT-LINE.                    25260009
252700     PERFORM 4200-WRITE-REPORT1.                                  25270009
252800                                                                  25280009
252900     MOVE PV-PRT-LNYK-PROCESSED TO PRINT-LINE.                    25290009
253000     PERFORM 4200-WRITE-REPORT1.                                  25300009
253100                                                                  25310009
253200     MOVE PV-PRT-LFLE-PROCESSED TO PRINT-LINE.                    25320009
253300     PERFORM 4200-WRITE-REPORT1.                                  25330009
253400     MOVE SPACES TO PRINT-LINE.                                   25340009
253500     PERFORM 4200-WRITE-REPORT1.                                  25350009
253600                                                                  25360009
253700     MOVE PV-PRT-TTL-TRIANGLE-R TO PRINT-LINE.                    25370009
253800     PERFORM 4200-WRITE-REPORT1.                                  25380009
253900     MOVE PV-PRT-TTL-TRIANGLE-W TO PRINT-LINE.                    25390009
254000     PERFORM 4200-WRITE-REPORT1.                                  25400009
254100     MOVE SPACES TO PRINT-LINE.                                   25410009
254200     PERFORM 4200-WRITE-REPORT1.                                  25420009
254300     MOVE PV-PRT-TTL-TRI-PKS-R TO PRINT-LINE.                     25430009
254400     PERFORM 4200-WRITE-REPORT1.                                  25440009
254500     MOVE PV-PRT-TTL-TRI-PKS-TEST-W TO PRINT-LINE.                25450009
254600     PERFORM 4200-WRITE-REPORT1.                                  25460009
254700     MOVE PV-PRT-TTL-TRI-PKS-PROD-W TO PRINT-LINE.                25470009
254800     PERFORM 4200-WRITE-REPORT1.                                  25480009
254900     MOVE SPACES TO PRINT-LINE.                                   25490009
255000     PERFORM 4200-WRITE-REPORT1.                                  25500009
255100     MOVE PV-PRT-TTL-TRI-DELIVERY-R TO PRINT-LINE.                25510009
255200     PERFORM 4200-WRITE-REPORT1.                                  25520009
255300     MOVE PV-PRT-TTL-TRI-DELIVERY-TEST-W TO PRINT-LINE.           25530009
255400     PERFORM 4200-WRITE-REPORT1.                                  25540009
255500     MOVE PV-PRT-TTL-TRI-DELIVERY-PROD-W TO PRINT-LINE.           25550009
255600     PERFORM 4200-WRITE-REPORT1.                                  25560009
255700     MOVE SPACES TO PRINT-LINE.                                   25570009
255800     PERFORM 4200-WRITE-REPORT1.                                  25580009
255900     MOVE PV-PRT-TTL-HUD-DELIVERY-R TO PRINT-LINE.                25590009
256000     PERFORM 4200-WRITE-REPORT1.                                  25600009
256100     MOVE PV-PRT-TTL-HUD-DELIVERY-TEST-W TO PRINT-LINE.           25610009
256200     PERFORM 4200-WRITE-REPORT1.                                  25620009
256300     MOVE PV-PRT-TTL-HUD-DELIVERY-PROD-W TO PRINT-LINE.           25630009
256400     PERFORM 4200-WRITE-REPORT1.                                  25640009
256500     MOVE SPACES TO PRINT-LINE.                                   25650009
256600     PERFORM 4200-WRITE-REPORT1.                                  25660009
256700     MOVE PV-PRT-TTL-APS-DELIVERY-R TO PRINT-LINE.                25670009
256800     PERFORM 4200-WRITE-REPORT1.                                  25680009
256900     MOVE PV-PRT-TTL-APS-DELIVERY-TEST-W TO PRINT-LINE.           25690009
257000     PERFORM 4200-WRITE-REPORT1.                                  25700009
257100     MOVE PV-PRT-TTL-APS-DELIVERY-PROD-W TO PRINT-LINE.           25710009
257200     PERFORM 4200-WRITE-REPORT1.                                  25720009
257300     MOVE SPACES TO PRINT-LINE.                                   25730009
257400     PERFORM 4200-WRITE-REPORT1.                                  25740009
257500     MOVE PV-PRT-TTL-GLB-DELIVERY-R TO PRINT-LINE.                25750009
257600     PERFORM 4200-WRITE-REPORT1.                                  25760009
257700     MOVE PV-PRT-TTL-GLB-DELIVERY-TEST-W TO PRINT-LINE.           25770009
257800     PERFORM 4200-WRITE-REPORT1.                                  25780009
257900     MOVE PV-PRT-TTL-GLB-DELIVERY-PROD-W TO PRINT-LINE.           25790009
258000     PERFORM 4200-WRITE-REPORT1.                                  25800009
258100     MOVE SPACES TO PRINT-LINE.                                   25810009
258200     PERFORM 4200-WRITE-REPORT1.                                  25820009
258300     MOVE PV-PRT-TTL-UWD-DELIVERY-R      TO PRINT-LINE.           25830009
258400     PERFORM 4200-WRITE-REPORT1.                                  25840009
258500     MOVE PV-PRT-TTL-UWD-DELIVERY-TEST-W TO PRINT-LINE.           25850009
258600     PERFORM 4200-WRITE-REPORT1.                                  25860009
258700     MOVE PV-PRT-TTL-UWD-DELIVERY-PROD-W TO PRINT-LINE.           25870009
258800     PERFORM 4200-WRITE-REPORT1.                                  25880009
258900     MOVE SPACES TO PRINT-LINE.                                   25890009
259000     PERFORM 4200-WRITE-REPORT1.                                  25900009
259100     MOVE PV-PRT-TTL-CON-PO-TRK-R TO PRINT-LINE.                  25910009
259200     PERFORM 4200-WRITE-REPORT1.                                  25920009
259300     MOVE PV-PRT-TTL-CON-PO-TRK-W TO PRINT-LINE.                  25930009
259400     PERFORM 4200-WRITE-REPORT1.                                  25940009
259500     MOVE SPACES TO PRINT-LINE.                                   25950009
259600     PERFORM 4200-WRITE-REPORT1.                                  25960009
259700     MOVE PV-EXP-LINE-1 TO PRINT-LINE.                            25970009
259800     PERFORM 4200-WRITE-REPORT1.                                  25980009
259900     MOVE PV-EXP-LINE-2 TO PRINT-LINE.                            25990009
260000     PERFORM 4200-WRITE-REPORT1.                                  26000009
260100     MOVE PV-EXP-LINE-3 TO PRINT-LINE.                            26010009
260200     PERFORM 4200-WRITE-REPORT1.                                  26020009
260300     MOVE SPACES TO PRINT-LINE.                                   26030009
260400     PERFORM 4200-WRITE-REPORT1.                                  26040009
260500     MOVE PV-EXP-LINE-4 TO PRINT-LINE.                            26050009
260600     PERFORM 4200-WRITE-REPORT1.                                  26060009
260700     MOVE PV-EXP-LINE-5 TO PRINT-LINE.                            26070009
260800     PERFORM 4200-WRITE-REPORT1.                                  26080009
260900     MOVE PV-EXP-LINE-6 TO PRINT-LINE.                            26090009
261000     PERFORM 4200-WRITE-REPORT1.                                  26100009
261100     MOVE SPACES TO PRINT-LINE.                                   26110009
261200     PERFORM 4200-WRITE-REPORT1.                                  26120009
261300     MOVE PV-EXP-LINE-7 TO PRINT-LINE.                            26130009
261400     PERFORM 4200-WRITE-REPORT1.                                  26140009
261500     MOVE PV-EXP-LINE-8 TO PRINT-LINE.                            26150009
261600     PERFORM 4200-WRITE-REPORT1.                                  26160009
261700     MOVE PV-EXP-LINE-9 TO PRINT-LINE.                            26170009
261800     PERFORM 4200-WRITE-REPORT1.                                  26180009
261900     MOVE SPACES TO PRINT-LINE.                                   26190009
262000     PERFORM 4200-WRITE-REPORT1.                                  26200009
262100     MOVE PV-EXP-LINE-10 TO PRINT-LINE.                           26210009
262200     PERFORM 4200-WRITE-REPORT1.                                  26220009
262300     MOVE PV-EXP-LINE-11 TO PRINT-LINE.                           26230009
262400     PERFORM 4200-WRITE-REPORT1.                                  26240009
262500     MOVE PV-EXP-LINE-12 TO PRINT-LINE.                           26250009
262600     PERFORM 4200-WRITE-REPORT1.                                  26260009
262700     MOVE SPACES TO PRINT-LINE.                                   26270009
262800     PERFORM 4200-WRITE-REPORT1.                                  26280009
262900     MOVE PV-EXP-LINE-13 TO PRINT-LINE.                           26290009
263000     PERFORM 4200-WRITE-REPORT1.                                  26300009
263100     MOVE PV-EXP-LINE-14 TO PRINT-LINE.                           26310009
263200     PERFORM 4200-WRITE-REPORT1.                                  26320009
263300     MOVE PV-EXP-LINE-15 TO PRINT-LINE.                           26330009
263400     PERFORM 4200-WRITE-REPORT1.                                  26340009
263500     MOVE SPACES TO PRINT-LINE.                                   26350009
263600     MOVE PV-LVG-LINE-16 TO PRINT-LINE.                           26360009
263700     PERFORM 4200-WRITE-REPORT1.                                  26370009
263800     MOVE SPACES TO PRINT-LINE.                                   26380009
263900     PERFORM 4200-WRITE-REPORT1.                                  26390009
264000     MOVE PV-LVG-LINE-17 TO PRINT-LINE.                           26400009
264100     PERFORM 4200-WRITE-REPORT1.                                  26410009
264200     MOVE PV-LVG-LINE-18 TO PRINT-LINE.                           26420009
264300     PERFORM 4200-WRITE-REPORT1.                                  26430009
264400     MOVE SPACES TO PRINT-LINE.                                   26440009
264500     PERFORM 4200-WRITE-REPORT1.                                  26450009
264600     MOVE SPACES TO PRINT-LINE.                                   26460009
264700     PERFORM 4200-WRITE-REPORT1.                                  26470009
264800***************** MAERSK BOOKING LINES                            26480009
264900     MOVE PV-MAERSK-LINE-1 TO PRINT-LINE.                         26490009
265000     PERFORM 4200-WRITE-REPORT1.                                  26500009
265100     MOVE PV-MAERSK-LINE-2 TO PRINT-LINE.                         26510009
265200     PERFORM 4200-WRITE-REPORT1.                                  26520009
265300     MOVE PV-MAERSK-LINE-3 TO PRINT-LINE.                         26530009
265400     PERFORM 4200-WRITE-REPORT1.                                  26540009
265500     MOVE SPACES TO PRINT-LINE.                                   26550009
265600     PERFORM 4200-WRITE-REPORT1.                                  26560009
265700***************** MAERSK RECEIVING LINES                          26570009
265800     MOVE PV-MAERSK-LINE-4 TO PRINT-LINE.                         26580009
265900     PERFORM 4200-WRITE-REPORT1.                                  26590009
266000     MOVE PV-MAERSK-LINE-5 TO PRINT-LINE.                         26600009
266100     PERFORM 4200-WRITE-REPORT1.                                  26610009
266200     MOVE PV-MAERSK-LINE-6 TO PRINT-LINE.                         26620009
266300     PERFORM 4200-WRITE-REPORT1.                                  26630009
266400     MOVE SPACES TO PRINT-LINE.                                   26640009
266500     PERFORM 4200-WRITE-REPORT1.                                  26650009
266600***************** MAERSK CONTAINER MANIFEST LINES                 26660009
266700     MOVE PV-MAERSK-LINE-7 TO PRINT-LINE.                         26670009
266800     PERFORM 4200-WRITE-REPORT1.                                  26680009
266900     MOVE PV-MAERSK-LINE-8 TO PRINT-LINE.                         26690009
267000     PERFORM 4200-WRITE-REPORT1.                                  26700009
267100     MOVE PV-MAERSK-LINE-9 TO PRINT-LINE.                         26710009
267200     PERFORM 4200-WRITE-REPORT1.                                  26720009
267300     MOVE SPACES TO PRINT-LINE.                                   26730009
267400     PERFORM 4200-WRITE-REPORT1.                                  26740009
267500***************** MAERSK LINES END                                26750009
267600******************* NYK BOOKING LINES                             26760009
267700     MOVE PV-NYK-LINE-1 TO PRINT-LINE.                            26770009
267800     PERFORM 4200-WRITE-REPORT1.                                  26780009
267900     MOVE PV-NYK-LINE-2 TO PRINT-LINE.                            26790009
268000     PERFORM 4200-WRITE-REPORT1.                                  26800009
268100     MOVE PV-NYK-LINE-3 TO PRINT-LINE.                            26810009
268200     PERFORM 4200-WRITE-REPORT1.                                  26820009
268300     MOVE SPACES TO PRINT-LINE.                                   26830009
268400     PERFORM 4200-WRITE-REPORT1.                                  26840009
268500***************** NYK RECEIVING LINES                             26850009
268600     MOVE PV-NYK-LINE-4 TO PRINT-LINE.                            26860009
268700     PERFORM 4200-WRITE-REPORT1.                                  26870009
268800     MOVE PV-NYK-LINE-5 TO PRINT-LINE.                            26880009
268900     PERFORM 4200-WRITE-REPORT1.                                  26890009
269000     MOVE PV-NYK-LINE-6 TO PRINT-LINE.                            26900009
269100     PERFORM 4200-WRITE-REPORT1.                                  26910009
269200     MOVE SPACES TO PRINT-LINE.                                   26920009
269300     PERFORM 4200-WRITE-REPORT1.                                  26930009
269400***************** NYK CONTAINER MANIFEST LINES                    26940009
269500     MOVE PV-NYK-LINE-7 TO PRINT-LINE.                            26950009
269600     PERFORM 4200-WRITE-REPORT1.                                  26960009
269700     MOVE PV-NYK-LINE-8 TO PRINT-LINE.                            26970009
269800     PERFORM 4200-WRITE-REPORT1.                                  26980009
269900     MOVE PV-NYK-LINE-9 TO PRINT-LINE.                            26990009
270000     PERFORM 4200-WRITE-REPORT1.                                  27000009
270100     MOVE SPACES TO PRINT-LINE.                                   27010009
270200     PERFORM 4200-WRITE-REPORT1.                                  27020009
270300***************** NYK LINES END                                   27030009
270400* PB 06/30/2010 BEG                                               27040009
270500***************** WHSE REPLENISHMENT LINES                        27050009
270600     MOVE PV-PRT-TTL-TRI-WHSE-REPLEN-R      TO PRINT-LINE.        27060009
270700     PERFORM 4200-WRITE-REPORT1.                                  27070009
270800     MOVE PV-PRT-TTL-TRI-WHSE-RPLN-TST-W    TO PRINT-LINE.        27080009
270900     PERFORM 4200-WRITE-REPORT1.                                  27090009
271000     MOVE PV-PRT-TTL-TRI-WHSE-RPLN-PRD-W    TO PRINT-LINE.        27100009
271100     PERFORM 4200-WRITE-REPORT1.                                  27110009
271200     MOVE SPACES TO PRINT-LINE.                                   27120009
271300     PERFORM 4200-WRITE-REPORT1.                                  27130009
271400     MOVE PV-PRT-TTL-HUD-WHSE-REPLEN-R      TO PRINT-LINE.        27140009
271500     PERFORM 4200-WRITE-REPORT1.                                  27150009
271600     MOVE PV-PRT-TTL-HUD-WHSE-RPLN-TST-W    TO PRINT-LINE.        27160009
271700     PERFORM 4200-WRITE-REPORT1.                                  27170009
271800     MOVE PV-PRT-TTL-HUD-WHSE-RPLN-PRD-W    TO PRINT-LINE.        27180009
271900     PERFORM 4200-WRITE-REPORT1.                                  27190009
272000     MOVE SPACES TO PRINT-LINE.                                   27200009
272100     PERFORM 4200-WRITE-REPORT1.                                  27210009
272200     MOVE PV-PRT-TTL-APS-WHSE-REPLEN-R      TO PRINT-LINE.        27220009
272300     PERFORM 4200-WRITE-REPORT1.                                  27230009
272400     MOVE PV-PRT-TTL-APS-WHSE-RPLN-TST-W    TO PRINT-LINE.        27240009
272500     PERFORM 4200-WRITE-REPORT1.                                  27250009
272600     MOVE PV-PRT-TTL-APS-WHSE-RPLN-PRD-W    TO PRINT-LINE.        27260009
272700     PERFORM 4200-WRITE-REPORT1.                                  27270009
272800     MOVE SPACES TO PRINT-LINE.                                   27280009
272900     PERFORM 4200-WRITE-REPORT1.                                  27290009
273000     MOVE PV-PRT-TTL-GLB-WHSE-REPLEN-R      TO PRINT-LINE.        27300009
273100     PERFORM 4200-WRITE-REPORT1.                                  27310009
273200     MOVE PV-PRT-TTL-GLB-WHSE-RPLN-TST-W    TO PRINT-LINE.        27320009
273300     PERFORM 4200-WRITE-REPORT1.                                  27330009
273400     MOVE PV-PRT-TTL-GLB-WHSE-RPLN-PRD-W    TO PRINT-LINE.        27340009
273500     PERFORM 4200-WRITE-REPORT1.                                  27350009
273600     MOVE SPACES TO PRINT-LINE.                                   27360009
273700     PERFORM 4200-WRITE-REPORT1.                                  27370009
273800     MOVE PV-PRT-TTL-UWD-WHSE-REPLEN-R      TO PRINT-LINE.        27380009
273900     PERFORM 4200-WRITE-REPORT1.                                  27390009
274000     MOVE PV-PRT-TTL-UWD-WHSE-RPLN-TST-W    TO PRINT-LINE.        27400009
274100     PERFORM 4200-WRITE-REPORT1.                                  27410009
274200     MOVE PV-PRT-TTL-UWD-WHSE-RPLN-PRD-W    TO PRINT-LINE.        27420009
274300     PERFORM 4200-WRITE-REPORT1.                                  27430009
274400     MOVE SPACES TO PRINT-LINE.                                   27440009
274500     PERFORM 4200-WRITE-REPORT1.                                  27450009
274600* PB 06/30/2010 END                                               27460009
274700     MOVE PV-EXCEPT-LINE-W TO PRINT-LINE.                         27470009
274800     PERFORM 4200-WRITE-REPORT1.                                  27480009
274900     MOVE SPACE TO PRINT-LINE.                                    27490009
275000     PERFORM 4200-WRITE-REPORT1.                                  27500009
275100     MOVE PV-TTL-FILES-LINE TO PRINT-LINE.                        27510009
275200     PERFORM 4200-WRITE-REPORT1.                                  27520009
275300     MOVE PV-TRI-FILES-LINE TO PRINT-LINE.                        27530009
275400     PERFORM 4200-WRITE-REPORT1.                                  27540009
275500     MOVE PV-HUD-FILES-LINE TO PRINT-LINE.                        27550009
275600     PERFORM 4200-WRITE-REPORT1.                                  27560009
275700     MOVE PV-APS-FILES-LINE TO PRINT-LINE.                        27570009
275800     PERFORM 4200-WRITE-REPORT1.                                  27580009
275900     MOVE PV-GLB-FILES-LINE TO PRINT-LINE.                        27590009
276000     PERFORM 4200-WRITE-REPORT1.                                  27600009
276100     MOVE PV-EXP-FILES-LINE TO PRINT-LINE.                        27610009
276200     PERFORM 4200-WRITE-REPORT1.                                  27620009
276300     MOVE PV-MAERSK-FILES-LINE TO PRINT-LINE.                     27630009
276400     PERFORM 4200-WRITE-REPORT1.                                  27640009
276500     MOVE PV-NYK-FILES-LINE TO PRINT-LINE.                        27650009
276600     PERFORM 4200-WRITE-REPORT1.                                  27660009
276700     MOVE PV-NOT-PROC-LINE TO PRINT-LINE.                         27670009
276800     PERFORM 4200-WRITE-REPORT1.                                  27680009
276900     MOVE PV-INVALID-ENT-ID-LINE TO PRINT-LINE.                   27690009
277000     PERFORM 4200-WRITE-REPORT1.                                  27700009
277100     MOVE PV-TOT-LOGICAL-FILE    TO PRINT-LINE.                   27710009
277200     PERFORM 4200-WRITE-REPORT1.                                  27720009
277300     MOVE PV-TOT-RECORDS-FILE    TO PRINT-LINE.                   27730009
277400     PERFORM 4200-WRITE-REPORT1.                                  27740009
277500     MOVE PV-MISMATCH-LINE TO PRINT-LINE.                         27750009
277600     PERFORM 4200-WRITE-REPORT1.                                  27760009
277700     MOVE PV-MISSING-FILE-LINE TO PRINT-LINE.                     27770009
277800     PERFORM 4200-WRITE-REPORT1.                                  27780009
277900                                                                  27790009
278000******************************************************************27800009
278100* WRITE THE REPORT LINE AFTER ADVANCING A PAGE.                  *27810009
278200******************************************************************27820009
278300 4190-WRITE-TOP1.                                                 27830009
278400                                                                  27840009
278500     WRITE PRINT-LINE                                             27850009
278600          AFTER ADVANCING PAGE.                                   27860009
278700                                                                  27870009
278800     ADD 1     TO   PV-LINE-CNT.                                  27880009
278900                                                                  27890009
279000******************************************************************27900009
279100* WRITE THE REPORT LINE.                                         *27910009
279200******************************************************************27920009
279300 4200-WRITE-REPORT1.                                              27930009
279400                                                                  27940009
279500     WRITE PRINT-LINE                                             27950009
279600          AFTER ADVANCING 1.                                      27960009
279700                                                                  27970009
279800     ADD 1     TO PV-LINE-CNT.                                    27980009
279900                                                                  27990009
280000******************************************************************28000009
280100* WRITE TEST TRIANGLE RECORD.                                    *28010009
280200******************************************************************28020009
280300 5000-WRITE-TRIANGLE-T-REC.                                       28030009
280400                                                                  28040009
280500     ADD +1 TO PV-TRI-PKSLP-READ.                                 28050009
280600     ADD +1 TO PV-TRI-PKSLP-WRITTEN-TEST.                         28060009
280700                                                                  28070009
280800     WRITE TRIANGLE-PACKSLIPS-T-LINE                              28080009
280900          FROM TR090-RECORD-TYPE.                                 28090009
281000                                                                  28100009
281100     SET PV-WROTE-REC-TYP-TRI-PKSLP TO TRUE.                      28110009
281200                                                                  28120009
281300******************************************************************28130009
281400* WRITE PROD TRIANGLE RECORD.                                    *28140009
281500******************************************************************28150009
281600 5010-WRITE-TRIANGLE-P-REC.                                       28160009
281700                                                                  28170009
281800     ADD +1 TO PV-TRI-PKSLP-READ.                                 28180009
281900     ADD +1 TO PV-TRI-PKSLP-WRITTEN-PROD.                         28190009
282000                                                                  28200009
282100     WRITE TRIANGLE-PACKSLIPS-P-LINE                              28210009
282200          FROM TR090-RECORD-TYPE.                                 28220009
282300                                                                  28230009
282400     SET PV-WROTE-REC-TYP-TRI-PKSLP TO TRUE.                      28240009
282500                                                                  28250009
282600******************************************************************28260009
282700* WRITE TRIANGLE TEST DELIVERY RECORD.                           *28270009
282800******************************************************************28280009
282900*RJ                                                               28290009
283000 5012-WRITE-TRI-DELIVERY-T-REC.                                   28300009
283100                                                                  28310009
283200     EVALUATE TRUE                                                28320009
283300         WHEN PV-FOUND-TRIANGLE                                   28330009
283400             ADD +1 TO PV-TRI-DELIVERY-READ                       28340009
283500             ADD +1 TO PV-TRI-DELIVERY-WRITTEN-TEST               28350009
283600         WHEN PV-FOUND-HUDD                                       28360009
283700             ADD +1 TO PV-HUD-DELIVERY-READ                       28370009
283800             ADD +1 TO PV-HUD-DELIVERY-WRITTEN-TEST               28380009
283900         WHEN PV-FOUND-APS                                        28390009
284000             ADD +1 TO PV-APS-DELIVERY-READ                       28400009
284100             ADD +1 TO PV-APS-DELIVERY-WRITTEN-TEST               28410009
284200         WHEN PV-FOUND-GLB                                        28420009
284300             ADD +1 TO PV-GLB-DELIVERY-READ                       28430009
284400             ADD +1 TO PV-GLB-DELIVERY-WRITTEN-TEST               28440009
284500         WHEN PV-FOUND-UWD                                        28450009
284600             ADD +1 TO PV-UWD-DELIVERY-READ                       28460009
284700             ADD +1 TO PV-UWD-DELIVERY-WRITTEN-TEST               28470009
284800     END-EVALUATE.                                                28480009
284900                                                                  28490009
285000     WRITE DELIVERY-T-LINE                                        28500009
285100          FROM TR090-RECORD-TYPE.                                 28510009
285200                                                                  28520009
285300     SET PV-WROTE-REC-TYP-TRI-DELY TO TRUE.                       28530009
285400                                                                  28540009
285500* PB 06/30/2010 BEG                                               28550009
285600******************************************************************28560009
285700* WRITE TRIANGLE PROD WHSE REPLEN RECORD.                        *28570009
285800******************************************************************28580009
285900*                                                                 28590009
286000 5013-WRITE-TRI-WHSE-RPLN-P-REC.                                  28600009
286100                                                                  28610009
286200     EVALUATE TRUE                                                28620009
286300         WHEN PV-FOUND-TRIANGLE                                   28630009
286400             ADD +1 TO PV-TRI-WHSE-REPLEN-READ                    28640009
286500             ADD +1 TO PV-TRI-WHSE-RPLN-WRITTEN-PRD               28650009
286600         WHEN PV-FOUND-HUDD                                       28660009
286700             ADD +1 TO PV-HUD-WHSE-REPLEN-READ                    28670009
286800             ADD +1 TO PV-HUD-WHSE-RPLN-WRITTEN-PRD               28680009
286900         WHEN PV-FOUND-APS                                        28690009
287000             ADD +1 TO PV-APS-WHSE-REPLEN-READ                    28700009
287100             ADD +1 TO PV-APS-WHSE-RPLN-WRITTEN-PRD               28710009
287200         WHEN PV-FOUND-GLB                                        28720009
287300             ADD +1 TO PV-GLB-WHSE-REPLEN-READ                    28730009
287400             ADD +1 TO PV-GLB-WHSE-RPLN-WRITTEN-PRD               28740009
287500         WHEN PV-FOUND-UWD                                        28750009
287600             ADD +1 TO PV-UWD-WHSE-REPLEN-READ                    28760009
287700             ADD +1 TO PV-UWD-WHSE-RPLN-WRITTEN-PRD               28770009
287800     END-EVALUATE.                                                28780009
287900                                                                  28790009
288000     WRITE WHSE-REPLEN-P-LINE                                     28800009
288100          FROM TR090-RECORD-TYPE.                                 28810009
288200                                                                  28820009
288300     SET PV-WROTE-REC-TYP-TRI-WHSE-RPLN TO TRUE.                  28830009
288400                                                                  28840009
288500******************************************************************28850009
288600* WRITE TRIANGLE TEST WHSE REPLEN RECORD.                        *28860009
288700******************************************************************28870009
288800*                                                                 28880009
288900 5014-WRITE-TRI-WHSE-RPLN-T-REC.                                  28890009
289000                                                                  28900009
289100     EVALUATE TRUE                                                28910009
289200         WHEN PV-FOUND-TRIANGLE                                   28920009
289300             ADD +1 TO PV-TRI-WHSE-REPLEN-READ                    28930009
289400             ADD +1 TO PV-TRI-WHSE-RPLN-WRITTEN-TST               28940009
289500         WHEN PV-FOUND-HUDD                                       28950009
289600             ADD +1 TO PV-HUD-WHSE-REPLEN-READ                    28960009
289700             ADD +1 TO PV-HUD-WHSE-RPLN-WRITTEN-TST               28970009
289800         WHEN PV-FOUND-APS                                        28980009
289900             ADD +1 TO PV-APS-WHSE-REPLEN-READ                    28990009
290000             ADD +1 TO PV-APS-WHSE-RPLN-WRITTEN-TST               29000009
290100         WHEN PV-FOUND-GLB                                        29010009
290200             ADD +1 TO PV-GLB-WHSE-REPLEN-READ                    29020009
290300             ADD +1 TO PV-GLB-WHSE-RPLN-WRITTEN-TST               29030009
290400         WHEN PV-FOUND-UWD                                        29040009
290500             ADD +1 TO PV-UWD-WHSE-REPLEN-READ                    29050009
290600             ADD +1 TO PV-UWD-WHSE-RPLN-WRITTEN-TST               29060009
290700     END-EVALUATE.                                                29070009
290800                                                                  29080009
290900     WRITE WHSE-REPLEN-T-LINE                                     29090009
291000          FROM TR090-RECORD-TYPE.                                 29100009
291100                                                                  29110009
291200     SET PV-WROTE-REC-TYP-TRI-WHSE-RPLN TO TRUE.                  29120009
291300                                                                  29130009
291400* PB 06/30/2010 END                                               29140009
291500******************************************************************29150009
291600* WRITE TRIANGLE PROD DELIVERY RECORD.                           *29160009
291700******************************************************************29170009
291800*RJ                                                               29180009
291900 5015-WRITE-TRI-DELIVERY-P-REC.                                   29190009
292000                                                                  29200009
292100     EVALUATE TRUE                                                29210009
292200         WHEN PV-FOUND-TRIANGLE                                   29220009
292300             ADD +1 TO PV-TRI-DELIVERY-READ                       29230009
292400             ADD +1 TO PV-TRI-DELIVERY-WRITTEN-PROD               29240009
292500         WHEN PV-FOUND-HUDD                                       29250009
292600             ADD +1 TO PV-HUD-DELIVERY-READ                       29260009
292700             ADD +1 TO PV-HUD-DELIVERY-WRITTEN-PROD               29270009
292800         WHEN PV-FOUND-APS                                        29280009
292900             ADD +1 TO PV-APS-DELIVERY-READ                       29290009
293000             ADD +1 TO PV-APS-DELIVERY-WRITTEN-PROD               29300009
293100         WHEN PV-FOUND-GLB                                        29310009
293200             ADD +1 TO PV-GLB-DELIVERY-READ                       29320009
293300             ADD +1 TO PV-GLB-DELIVERY-WRITTEN-PROD               29330009
293400         WHEN PV-FOUND-UWD                                        29340009
293500             ADD +1 TO PV-UWD-DELIVERY-READ                       29350009
293600             ADD +1 TO PV-UWD-DELIVERY-WRITTEN-PROD               29360009
293700     END-EVALUATE.                                                29370009
293800                                                                  29380009
293900     WRITE DELIVERY-P-LINE                                        29390009
294000          FROM TR090-RECORD-TYPE.                                 29400009
294100                                                                  29410009
294200     SET PV-WROTE-REC-TYP-TRI-DELY TO TRUE.                       29420009
294300                                                                  29430009
294400******************************************************************29440009
294500* WRITE TEST IMPORT BKG RECORD.                                  *29450009
294600******************************************************************29460009
294700 5020-WRITE-IMPORT-BKG-T-REC.                                     29470009
294800                                                                  29480009
294900     IF PV-FOUND-EXPEDITOR                                        29490009
295000       ADD +1 TO  PV-EXP-BKG-WRITTEN-TEST                         29500009
295100       ADD +1 TO  PV-EXP-BKG-READ                                 29510009
295200     END-IF.                                                      29520009
295300                                                                  29530009
295400     IF PV-FOUND-MAERSK                                           29540009
295500       ADD +1 TO  PV-MAERSK-BKG-WRITTEN-TEST                      29550009
295600       ADD +1 TO  PV-MAERSK-BKG-READ                              29560009
295700     END-IF.                                                      29570009
295800                                                                  29580009
295900     IF PV-FOUND-NYK                                              29590009
296000       ADD +1 TO  PV-NYK-BKG-WRITTEN-TEST                         29600009
296100       ADD +1 TO  PV-NYK-BKG-READ                                 29610009
296200     END-IF.                                                      29620009
296300                                                                  29630009
296400     WRITE CONSOL-IMPORT-BKG-T-LINE                               29640009
296500         FROM TR090-RECORD-TYPE.                                  29650009
296600                                                                  29660009
296700     SET PV-WROTE-REC-TYP-BKG TO TRUE.                            29670009
296800                                                                  29680009
296900******************************************************************29690009
297000* WRITE TEST IMPORT RCVG RECORD.                                 *29700009
297100******************************************************************29710009
297200 5025-WRITE-IMPORT-RCVG-T-REC.                                    29720009
297300                                                                  29730009
297400     IF PV-FOUND-EXPEDITOR                                        29740009
297500       ADD +1 TO  PV-EXP-RCVG-WRITTEN-TEST                        29750009
297600       ADD +1 TO  PV-EXP-RCVG-READ                                29760009
297700     END-IF.                                                      29770009
297800                                                                  29780009
297900     IF PV-FOUND-MAERSK                                           29790009
298000       ADD +1 TO  PV-MAERSK-RCVG-WRITTEN-TEST                     29800009
298100       ADD +1 TO  PV-MAERSK-RCVG-READ                             29810009
298200     END-IF.                                                      29820009
298300                                                                  29830009
298400     IF PV-FOUND-NYK                                              29840009
298500       ADD +1 TO  PV-NYK-RCVG-WRITTEN-TEST                        29850009
298600       ADD +1 TO  PV-NYK-RCVG-READ                                29860009
298700     END-IF.                                                      29870009
298800                                                                  29880009
298900     WRITE CONSOL-IMPORT-RCVG-T-LINE                              29890009
299000         FROM TR090-RECORD-TYPE.                                  29900009
299100     SET PV-WROTE-REC-TYP-RCVG TO TRUE.                           29910009
299200                                                                  29920009
299300******************************************************************29930009
299400* WRITE PROD IMPORT BKG RECORD.                                  *29940009
299500******************************************************************29950009
299600 5030-WRITE-IMPORT-BKG-P-REC.                                     29960009
299700                                                                  29970009
299800     IF PV-FOUND-EXPEDITOR                                        29980009
299900       ADD +1 TO  PV-EXP-BKG-WRITTEN-PROD                         29990009
300000       ADD +1 TO  PV-EXP-BKG-READ                                 30000009
300100     END-IF.                                                      30010009
300200                                                                  30020009
300300     IF PV-FOUND-MAERSK                                           30030009
300400       ADD +1 TO  PV-MAERSK-BKG-WRITTEN-PROD                      30040009
300500       ADD +1 TO  PV-MAERSK-BKG-READ                              30050009
300600     END-IF.                                                      30060009
300700                                                                  30070009
300800     IF PV-FOUND-NYK                                              30080009
300900       ADD +1 TO  PV-NYK-BKG-WRITTEN-PROD                         30090009
301000       ADD +1 TO  PV-NYK-BKG-READ                                 30100009
301100     END-IF.                                                      30110009
301200                                                                  30120009
301300     WRITE CONSOL-IMPORT-BKG-P-LINE                               30130009
301400         FROM TR090-RECORD-TYPE.                                  30140009
301500     SET PV-WROTE-REC-TYP-BKG TO TRUE.                            30150009
301600                                                                  30160009
301700******************************************************************30170009
301800* WRITE PROD IMPORT RCVG RECORD.                                 *30180009
301900******************************************************************30190009
302000 5035-WRITE-IMPORT-RCVG-P-REC.                                    30200009
302100                                                                  30210009
302200     IF PV-FOUND-EXPEDITOR                                        30220009
302300       ADD +1 TO  PV-EXP-RCVG-WRITTEN-PROD                        30230009
302400       ADD +1 TO  PV-EXP-RCVG-READ                                30240009
302500     END-IF.                                                      30250009
302600                                                                  30260009
302700     IF PV-FOUND-MAERSK                                           30270009
302800       ADD +1 TO  PV-MAERSK-RCVG-WRITTEN-PROD                     30280009
302900       ADD +1 TO  PV-MAERSK-RCVG-READ                             30290009
303000     END-IF.                                                      30300009
303100                                                                  30310009
303200     IF PV-FOUND-NYK                                              30320009
303300       ADD +1 TO  PV-NYK-RCVG-WRITTEN-PROD                        30330009
303400       ADD +1 TO  PV-NYK-RCVG-READ                                30340009
303500     END-IF.                                                      30350009
303600                                                                  30360009
303700     WRITE CONSOL-IMPORT-RCVG-P-LINE                              30370009
303800         FROM TR090-RECORD-TYPE.                                  30380009
303900     SET PV-WROTE-REC-TYP-RCVG TO TRUE.                           30390009
304000                                                                  30400009
304100******************************************************************30410009
304200* WRITE TEST CONTAINER MANIFEST RECORD.                          *30420009
304300******************************************************************30430009
304400 5040-WRITE-CONMAN-T-REC.                                         30440009
304500                                                                  30450009
304600     IF PV-FOUND-EXPEDITOR                                        30460009
304700       ADD +1 TO  PV-EXP-CONMAN-WRITTEN-TEST                      30470009
304800       ADD +1 TO  PV-EXP-CONMAN-READ                              30480009
304900     END-IF.                                                      30490009
305000                                                                  30500009
305100     IF PV-FOUND-MAERSK                                           30510009
305200       ADD +1 TO  PV-MAERSK-CONMAN-WRITTEN-TEST                   30520009
305300       ADD +1 TO  PV-MAERSK-CONMAN-READ                           30530009
305400     END-IF.                                                      30540009
305500                                                                  30550009
305600     IF PV-FOUND-NYK                                              30560009
305700       ADD +1 TO  PV-NYK-CONMAN-WRITTEN-TEST                      30570009
305800       ADD +1 TO  PV-NYK-CONMAN-READ                              30580009
305900     END-IF.                                                      30590009
306000                                                                  30600009
306100     WRITE CONSOL-CONMAN-T-LINE                                   30610009
306200         FROM TR090-RECORD-TYPE.                                  30620009
306300                                                                  30630009
306400     SET PV-WROTE-REC-TYP-CONT TO TRUE.                           30640009
306500                                                                  30650009
306600******************************************************************30660009
306700* WRITE PROD CONTAINER MANIFEST RECORD.                          *30670009
306800******************************************************************30680009
306900 5050-WRITE-CONMAN-P-REC.                                         30690009
307000                                                                  30700009
307100     IF PV-FOUND-EXPEDITOR                                        30710009
307200       ADD +1 TO  PV-EXP-CONMAN-WRITTEN-PROD                      30720009
307300       ADD +1 TO  PV-EXP-CONMAN-READ                              30730009
307400     END-IF.                                                      30740009
307500                                                                  30750009
307600     IF PV-FOUND-MAERSK                                           30760009
307700       ADD +1 TO  PV-MAERSK-CONMAN-WRITTEN-PROD                   30770009
307800       ADD +1 TO  PV-MAERSK-CONMAN-READ                           30780009
307900     END-IF.                                                      30790009
308000                                                                  30800009
308100     IF PV-FOUND-NYK                                              30810009
308200       ADD +1 TO  PV-NYK-CONMAN-WRITTEN-PROD                      30820009
308300       ADD +1 TO  PV-NYK-CONMAN-READ                              30830009
308400     END-IF.                                                      30840009
308500                                                                  30850009
308600     WRITE CONSOL-CONMAN-P-LINE                                   30860009
308700         FROM TR090-RECORD-TYPE.                                  30870009
308800     SET PV-WROTE-REC-TYP-CONT TO TRUE.                           30880009
308900                                                                  30890009
309000******************************************************************30900009
309100* WRITE TEST EXPEDITOR IMPORT ARRIVAL FILE.                      *30910009
309200******************************************************************30920009
309300 5060-WRITE-CONOL-ARRIV-T-REC.                                    30930009
309400                                                                  30940009
309500        ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-TEST.                   30950009
309600        ADD +1 TO  PV-EXP-ARRIVAL-READ.                           30960009
309700                                                                  30970009
309800        WRITE CONSOL-ARRIVAL-T-LINE                               30980009
309900            FROM TR090-RECORD-TYPE.                               30990009
310000        SET PV-WROTE-REC-TYP-ARRIVAL TO TRUE.                     31000009
310100                                                                  31010009
310200******************************************************************31020009
310300* WRITE PROD EXPEDITOR IMPORT ARRIVAL FILE.                      *31030009
310400******************************************************************31040009
310500 5070-WRITE-CONOL-ARRIV-P-REC.                                    31050009
310600                                                                  31060009
310700        ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-PROD.                   31070009
310800        ADD +1 TO  PV-EXP-ARRIVAL-READ.                           31080009
310900                                                                  31090009
311000        WRITE CONSOL-ARRIVAL-P-LINE                               31100009
311100            FROM TR090-RECORD-TYPE.                               31110009
311200        SET PV-WROTE-REC-TYP-ARRIVAL TO TRUE.                     31120009
311300                                                                  31130009
311400******************************************************************31140009
311500* WRITE TEST EXPEDITOR CUSTOMS DOCUMENT FILE.                    *31150009
311600******************************************************************31160009
311700 5080-WRITE-CNSLDT-CUST-T-REC.                                    31170009
311800                                                                  31180009
311900     EVALUATE TRUE                                                31190009
312000         WHEN PV-FOUND-EXPEDITOR                                  31200009
312100              ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-TEST              31210009
312200              ADD +1 TO  PV-EXP-CUSTOMS-READ                      31220009
312300         WHEN PV-FOUND-LIVINGSTON                                 31230009
312400              ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-TEST              31240009
312500              ADD +1 TO  PV-LVG-CUSTOMS-READ                      31250009
312600     END-EVALUATE                                                 31260009
312700                                                                  31270009
312800        WRITE CONSOL-CUSTOMS-T-LINE                               31280009
312900            FROM TR090-RECORD-TYPE.                               31290009
313000        SET PV-WROTE-REC-TYP-CUST TO TRUE.                        31300009
313100                                                                  31310009
313200******************************************************************31320009
313300* WRITE PROD EXPEDITOR CUSTOMS DOCUMENT FILE.                    *31330009
313400******************************************************************31340009
313500 5090-WRITE-CNSLDT-CUST-P-REC.                                    31350009
313600                                                                  31360009
313700        EVALUATE TRUE                                             31370009
313800           WHEN PV-FOUND-EXPEDITOR                                31380009
313900                ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-PROD            31390009
314000                ADD +1 TO  PV-EXP-CUSTOMS-READ                    31400009
314100           WHEN PV-FOUND-LIVINGSTON                               31410009
314200                ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-PROD            31420009
314300                ADD +1 TO  PV-LVG-CUSTOMS-READ                    31430009
314400        END-EVALUATE                                              31440009
314500                                                                  31450009
314600        WRITE CONSOL-CUSTOMS-P-LINE                               31460009
314700            FROM TR090-RECORD-TYPE.                               31470009
314800        SET PV-WROTE-REC-TYP-CUST TO TRUE.                        31480009
314900                                                                  31490009
315000******************************************************************31500009
315100* WRITE RECORD TO THE EXCEPTION FILE.                            *31510009
315200******************************************************************31520009
315300 5120-WRITE-EXCEPTION-REC.                                        31530009
315400                                                                  31540009
315500        ADD +1 TO  PV-EXCP-COUNTER.                               31550009
315600                                                                  31560009
315700        IF PS-CTT-PRESENT                                         31570009
315800           ADD +1 TO  PV-EXCP-COUNTER                             31580009
315900        END-IF.                                                   31590009
316000                                                                  31600009
316100        IF PS-IEA-PRESENT                                         31610009
316200           ADD +1 TO  PV-EXCP-COUNTER                             31620009
316300        END-IF.                                                   31630009
316400                                                                  31640009
316500        WRITE CONSOL-EXCP-LINE                                    31650009
316600            FROM TR090-RECORD-TYPE.                               31660009
316700                                                                  31670009
316800******************************************************************31680009
316900* WRITE TEST EXPEDITOR IMPORT BKG FREIGHT MOVEMENT FILE.         *31690009
317000******************************************************************31700009
317100 5220-WRITE-IMPORT-BKG-T-WS.                                      31710009
317200                                                                  31720009
317300     WRITE CONSOL-IMPORT-BKG-T-LINE                               31730009
317400         FROM PV-WS-RECORD-TYPE.                                  31740009
317500                                                                  31750009
317600     IF PV-FOUND-EXPEDITOR                                        31760009
317700       ADD +1 TO  PV-EXP-BKG-WRITTEN-TEST                         31770009
317800       ADD +1 TO  PV-EXP-BKG-READ                                 31780009
317900       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        31790009
318000          ADD +1 TO  PV-EXP-BKG-WRITTEN-TEST                      31800009
318100       END-IF                                                     31810009
318200     END-IF.                                                      31820009
318300                                                                  31830009
318400     IF PV-FOUND-MAERSK                                           31840009
318500       ADD +1 TO  PV-MAERSK-BKG-WRITTEN-TEST                      31850009
318600       ADD +1 TO  PV-MAERSK-BKG-READ                              31860009
318700       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        31870009
318800          ADD +1 TO  PV-MAERSK-BKG-WRITTEN-TEST                   31880009
318900       END-IF                                                     31890009
319000     END-IF.                                                      31900009
319100                                                                  31910009
319200     IF PV-FOUND-NYK                                              31920009
319300       ADD +1 TO  PV-NYK-BKG-WRITTEN-TEST                         31930009
319400       ADD +1 TO  PV-NYK-BKG-READ                                 31940009
319500       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        31950009
319600          ADD +1 TO  PV-NYK-BKG-WRITTEN-TEST                      31960009
319700       END-IF                                                     31970009
319800     END-IF.                                                      31980009
319900                                                                  31990009
320000                                                                  32000009
320100******************************************************************32010009
320200* WRITE TEST IMPORT RCVG FREIGHT MOVEMENT FILE.                  *32020009
320300******************************************************************32030009
320400 5225-WRITE-IMPORT-RCVG-T-WS.                                     32040009
320500                                                                  32050009
320600     WRITE CONSOL-IMPORT-RCVG-T-LINE                              32060009
320700         FROM PV-WS-RECORD-TYPE.                                  32070009
320800                                                                  32080009
320900     IF PV-FOUND-EXPEDITOR                                        32090009
321000       ADD +1 TO  PV-EXP-RCVG-WRITTEN-TEST                        32100009
321100       ADD +1 TO  PV-EXP-RCVG-READ                                32110009
321200       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32120009
321300          ADD +1 TO  PV-EXP-RCVG-WRITTEN-TEST                     32130009
321400       END-IF                                                     32140009
321500     END-IF.                                                      32150009
321600                                                                  32160009
321700     IF PV-FOUND-MAERSK                                           32170009
321800       ADD +1 TO  PV-MAERSK-RCVG-WRITTEN-TEST                     32180009
321900       ADD +1 TO  PV-MAERSK-RCVG-READ                             32190009
322000       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32200009
322100          ADD +1 TO  PV-MAERSK-RCVG-WRITTEN-TEST                  32210009
322200       END-IF                                                     32220009
322300     END-IF.                                                      32230009
322400                                                                  32240009
322500     IF PV-FOUND-NYK                                              32250009
322600       ADD +1 TO  PV-NYK-RCVG-WRITTEN-TEST                        32260009
322700       ADD +1 TO  PV-NYK-RCVG-READ                                32270009
322800       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32280009
322900          ADD +1 TO  PV-NYK-RCVG-WRITTEN-TEST                     32290009
323000       END-IF                                                     32300009
323100     END-IF.                                                      32310009
323200                                                                  32320009
323300******************************************************************32330009
323400* WRITE PROD IMPORT BKG FREIGHT MOVEMENT FILE.                   *32340009
323500******************************************************************32350009
323600 5230-WRITE-IMPORT-BKG-P-WS.                                      32360009
323700                                                                  32370009
323800     WRITE CONSOL-IMPORT-BKG-P-LINE                               32380009
323900         FROM PV-WS-RECORD-TYPE.                                  32390009
324000                                                                  32400009
324100     IF PV-FOUND-EXPEDITOR                                        32410009
324200       ADD +1 TO  PV-EXP-BKG-WRITTEN-PROD                         32420009
324300       ADD +1 TO  PV-EXP-BKG-READ                                 32430009
324400       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32440009
324500          ADD +1 TO  PV-EXP-BKG-WRITTEN-PROD                      32450009
324600       END-IF                                                     32460009
324700     END-IF.                                                      32470009
324800                                                                  32480009
324900     IF PV-FOUND-MAERSK                                           32490009
325000       ADD +1 TO  PV-MAERSK-BKG-WRITTEN-PROD                      32500009
325100       ADD +1 TO  PV-MAERSK-BKG-READ                              32510009
325200       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32520009
325300          ADD +1 TO  PV-MAERSK-BKG-WRITTEN-PROD                   32530009
325400       END-IF                                                     32540009
325500     END-IF.                                                      32550009
325600                                                                  32560009
325700     IF PV-FOUND-NYK                                              32570009
325800       ADD +1 TO  PV-NYK-BKG-WRITTEN-PROD                         32580009
325900       ADD +1 TO  PV-NYK-BKG-READ                                 32590009
326000       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32600009
326100          ADD +1 TO  PV-NYK-BKG-WRITTEN-PROD                      32610009
326200       END-IF                                                     32620009
326300     END-IF.                                                      32630009
326400                                                                  32640009
326500******************************************************************32650009
326600* WRITE PROD IMPORT RCVG FREIGHT MOVEMENT FILE.                  *32660009
326700******************************************************************32670009
326800 5235-WRITE-IMPORT-RCVG-P-WS.                                     32680009
326900                                                                  32690009
327000     WRITE CONSOL-IMPORT-RCVG-P-LINE                              32700009
327100         FROM PV-WS-RECORD-TYPE.                                  32710009
327200                                                                  32720009
327300     IF PV-FOUND-EXPEDITOR                                        32730009
327400       ADD +1 TO  PV-EXP-RCVG-WRITTEN-PROD                        32740009
327500       ADD +1 TO  PV-EXP-RCVG-READ                                32750009
327600       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32760009
327700          ADD +1 TO  PV-EXP-RCVG-WRITTEN-PROD                     32770009
327800       END-IF                                                     32780009
327900     END-IF.                                                      32790009
328000                                                                  32800009
328100     IF PV-FOUND-MAERSK                                           32810009
328200       ADD +1 TO  PV-MAERSK-RCVG-WRITTEN-PROD                     32820009
328300       ADD +1 TO  PV-MAERSK-RCVG-READ                             32830009
328400       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32840009
328500          ADD +1 TO  PV-MAERSK-RCVG-WRITTEN-PROD                  32850009
328600       END-IF                                                     32860009
328700     END-IF.                                                      32870009
328800                                                                  32880009
328900     IF PV-FOUND-NYK                                              32890009
329000       ADD +1 TO  PV-NYK-RCVG-WRITTEN-PROD                        32900009
329100       ADD +1 TO  PV-NYK-RCVG-READ                                32910009
329200       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        32920009
329300          ADD +1 TO  PV-NYK-RCVG-WRITTEN-PROD                     32930009
329400       END-IF                                                     32940009
329500     END-IF.                                                      32950009
329600                                                                  32960009
329700******************************************************************32970009
329800* WRITE PROD CONTAINER MANIFEST RECORD.                          *32980009
329900******************************************************************32990009
330000 5240-WRITE-CONMAN-T-REC-WS.                                      33000009
330100                                                                  33010009
330200     WRITE CONSOL-CONMAN-T-LINE                                   33020009
330300         FROM PV-WS-RECORD-TYPE.                                  33030009
330400                                                                  33040009
330500     IF PV-FOUND-EXPEDITOR                                        33050009
330600       ADD +1 TO  PV-EXP-CONMAN-WRITTEN-TEST                      33060009
330700       ADD +1 TO  PV-EXP-CONMAN-READ                              33070009
330800       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        33080009
330900          ADD +1 TO  PV-EXP-CONMAN-WRITTEN-TEST                   33090009
331000       END-IF                                                     33100009
331100     END-IF.                                                      33110009
331200                                                                  33120009
331300     IF PV-FOUND-MAERSK                                           33130009
331400       ADD +1 TO  PV-MAERSK-CONMAN-WRITTEN-TEST                   33140009
331500       ADD +1 TO  PV-MAERSK-CONMAN-READ                           33150009
331600       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        33160009
331700          ADD +1 TO  PV-MAERSK-CONMAN-WRITTEN-TEST                33170009
331800       END-IF                                                     33180009
331900     END-IF.                                                      33190009
332000                                                                  33200009
332100     IF PV-FOUND-NYK                                              33210009
332200       ADD +1 TO  PV-NYK-CONMAN-WRITTEN-TEST                      33220009
332300       ADD +1 TO  PV-NYK-CONMAN-READ                              33230009
332400       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        33240009
332500          ADD +1 TO  PV-NYK-CONMAN-WRITTEN-TEST                   33250009
332600       END-IF                                                     33260009
332700     END-IF.                                                      33270009
332800                                                                  33280009
332900******************************************************************33290009
333000* WRITE PROD CONTAINER MANIFEST RECORD.                          *33300009
333100******************************************************************33310009
333200 5250-WRITE-CONMAN-P-REC-WS.                                      33320009
333300                                                                  33330009
333400     WRITE CONSOL-CONMAN-P-LINE                                   33340009
333500         FROM PV-WS-RECORD-TYPE.                                  33350009
333600                                                                  33360009
333700     IF PV-FOUND-EXPEDITOR                                        33370009
333800       ADD +1 TO  PV-EXP-CONMAN-WRITTEN-PROD                      33380009
333900       ADD +1 TO  PV-EXP-CONMAN-READ                              33390009
334000       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        33400009
334100          ADD +1 TO  PV-EXP-CONMAN-WRITTEN-PROD                   33410009
334200       END-IF                                                     33420009
334300     END-IF.                                                      33430009
334400                                                                  33440009
334500     IF PV-FOUND-MAERSK                                           33450009
334600       ADD +1 TO  PV-MAERSK-CONMAN-WRITTEN-PROD                   33460009
334700       ADD +1 TO  PV-MAERSK-CONMAN-READ                           33470009
334800       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        33480009
334900          ADD +1 TO  PV-MAERSK-CONMAN-WRITTEN-PROD                33490009
335000       END-IF                                                     33500009
335100     END-IF.                                                      33510009
335200                                                                  33520009
335300     IF PV-FOUND-NYK                                              33530009
335400       ADD +1 TO  PV-NYK-CONMAN-WRITTEN-PROD                      33540009
335500       ADD +1 TO  PV-NYK-CONMAN-READ                              33550009
335600       IF PS-CTT-PRESENT OR PS-IEA-PRESENT                        33560009
335700          ADD +1 TO  PV-NYK-CONMAN-WRITTEN-PROD                   33570009
335800       END-IF                                                     33580009
335900     END-IF.                                                      33590009
336000                                                                  33600009
336100******************************************************************33610009
336200* WRITE TEST EXPEDITOR IMPORT ARRIVAL FILE.                      *33620009
336300******************************************************************33630009
336400 5260-WRITE-CONOL-ARRIV-T-WS.                                     33640009
336500                                                                  33650009
336600     WRITE CONSOL-ARRIVAL-T-LINE                                  33660009
336700         FROM PV-WS-RECORD-TYPE.                                  33670009
336800                                                                  33680009
336900        ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-TEST.                   33690009
337000        ADD +1 TO  PV-EXP-ARRIVAL-READ.                           33700009
337100                                                                  33710009
337200        IF PS-CTT-PRESENT                                         33720009
337300           ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-TEST                 33730009
337400        END-IF.                                                   33740009
337500                                                                  33750009
337600        IF PS-IEA-PRESENT                                         33760009
337700           ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-TEST                 33770009
337800        END-IF.                                                   33780009
337900                                                                  33790009
338000******************************************************************33800009
338100* WRITE PROD EXPEDITOR IMPORT ARRIVAL FILE.                      *33810009
338200******************************************************************33820009
338300 5270-WRITE-CONOL-ARRIV-P-WS.                                     33830009
338400                                                                  33840009
338500     WRITE CONSOL-ARRIVAL-P-LINE                                  33850009
338600         FROM PV-WS-RECORD-TYPE.                                  33860009
338700                                                                  33870009
338800        ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-PROD.                   33880009
338900        ADD +1 TO  PV-EXP-ARRIVAL-READ.                           33890009
339000                                                                  33900009
339100        IF PS-CTT-PRESENT                                         33910009
339200           ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-PROD                 33920009
339300        END-IF.                                                   33930009
339400                                                                  33940009
339500        IF PS-IEA-PRESENT                                         33950009
339600           ADD +1 TO  PV-EXP-ARRIVAL-WRITTEN-PROD                 33960009
339700        END-IF.                                                   33970009
339800                                                                  33980009
339900******************************************************************33990009
340000* WRITE TEST EXPEDITOR CUSTOMS DOCUMENT FILE.                    *34000009
340100******************************************************************34010009
340200 5280-WRITE-CNSLDT-CUST-T-WS.                                     34020009
340300                                                                  34030009
340400     WRITE CONSOL-CUSTOMS-T-LINE                                  34040009
340500         FROM PV-WS-RECORD-TYPE.                                  34050009
340600       EVALUATE TRUE                                              34060009
340700           WHEN PV-FOUND-EXPEDITOR                                34070009
340800                ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-TEST            34080009
340900                ADD +1 TO  PV-EXP-CUSTOMS-READ                    34090009
341000           WHEN PV-FOUND-LIVINGSTON                               34100009
341100                ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-TEST            34110009
341200                ADD +1 TO  PV-LVG-CUSTOMS-READ                    34120009
341300       END-EVALUATE                                               34130009
341400                                                                  34140009
341500        IF PS-CTT-PRESENT                                         34150009
341600           IF PV-FOUND-LIVINGSTON                                 34160009
341700              ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-TEST              34170009
341800           ELSE                                                   34180009
341900              ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-TEST              34190009
342000           END-IF                                                 34200009
342100        END-IF.                                                   34210009
342200                                                                  34220009
342300        IF PS-IEA-PRESENT                                         34230009
342400           IF PV-FOUND-LIVINGSTON                                 34240009
342500              ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-TEST              34250009
342600           ELSE                                                   34260009
342700              ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-TEST              34270009
342800           END-IF                                                 34280009
342900        END-IF.                                                   34290009
343000                                                                  34300009
343100******************************************************************34310009
343200* WRITE PROD EXPEDITOR CUSTOMS DOCUMENT FILE.                    *34320009
343300******************************************************************34330009
343400 5290-WRITE-CNSLDT-CUST-P-WS.                                     34340009
343500                                                                  34350009
343600     WRITE CONSOL-CUSTOMS-P-LINE                                  34360009
343700         FROM PV-WS-RECORD-TYPE.                                  34370009
343800                                                                  34380009
343900       EVALUATE TRUE                                              34390009
344000           WHEN PV-FOUND-EXPEDITOR                                34400009
344100                ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-PROD            34410009
344200                ADD +1 TO  PV-EXP-CUSTOMS-READ                    34420009
344300           WHEN PV-FOUND-LIVINGSTON                               34430009
344400                ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-PROD            34440009
344500                ADD +1 TO  PV-LVG-CUSTOMS-READ                    34450009
344600       END-EVALUATE                                               34460009
344700                                                                  34470009
344800                                                                  34480009
344900        IF PS-CTT-PRESENT                                         34490009
345000           IF PV-FOUND-LIVINGSTON                                 34500009
345100              ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-PROD              34510009
345200           ELSE                                                   34520009
345300              ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-PROD              34530009
345400           END-IF                                                 34540009
345500        END-IF.                                                   34550009
345600                                                                  34560009
345700        IF PS-IEA-PRESENT                                         34570009
345800           IF PV-FOUND-LIVINGSTON                                 34580009
345900              ADD +1 TO  PV-LVG-CUSTOMS-WRITTEN-PROD              34590009
346000           ELSE                                                   34600009
346100              ADD +1 TO  PV-EXP-CUSTOMS-WRITTEN-PROD              34610009
346200           END-IF                                                 34620009
346300        END-IF.                                                   34630009
346400                                                                  34640009
346500******************************************************************34650009
346600* WRITE TRIANGLE WS TEST PACKSLIP RECORD.                        *34660009
346700******************************************************************34670009
346800 5320-WRITE-TRI-PKSLP-T-REC-WS.                                   34680009
346900                                                                  34690009
347000     WRITE TRIANGLE-PACKSLIPS-T-LINE                              34700009
347100          FROM PV-WS-RECORD-TYPE.                                 34710009
347200                                                                  34720009
347300     ADD +1 TO PV-TRI-PKSLP-READ.                                 34730009
347400     ADD +1 TO PV-TRI-PKSLP-WRITTEN-TEST.                         34740009
347500                                                                  34750009
347600     IF PS-CTT-PRESENT OR PS-IEA-PRESENT                          34760009
347700         ADD +1 TO PV-TRI-PKSLP-WRITTEN-TEST                      34770009
347800     END-IF.                                                      34780009
347900                                                                  34790009
348000******************************************************************34800009
348100* WRITE TRIANGLE WS PROD PACKSLIP RECORD.                        *34810009
348200******************************************************************34820009
348300 5325-WRITE-TRI-PKSLP-P-REC-WS.                                   34830009
348400                                                                  34840009
348500     WRITE TRIANGLE-PACKSLIPS-P-LINE                              34850009
348600          FROM PV-WS-RECORD-TYPE.                                 34860009
348700                                                                  34870009
348800     ADD +1 TO PV-TRI-PKSLP-READ.                                 34880009
348900     ADD +1 TO PV-TRI-PKSLP-WRITTEN-PROD.                         34890009
349000                                                                  34900009
349100     IF PS-CTT-PRESENT OR PS-IEA-PRESENT                          34910009
349200         ADD +1 TO PV-TRI-PKSLP-WRITTEN-PROD                      34920009
349300     END-IF.                                                      34930009
349400                                                                  34940009
349500******************************************************************34950009
349600* WRITE TRIANGLE WS TEST DELIVERY RECORD.                        *34960009
349700******************************************************************34970009
349800*RJ                                                               34980009
349900 5330-WRITE-DELY-T-REC-WS.                                        34990009
350000                                                                  35000009
350100     WRITE DELIVERY-T-LINE                                        35010009
350200          FROM PV-WS-RECORD-TYPE.                                 35020009
350300                                                                  35030009
350400     EVALUATE TRUE                                                35040009
350500         WHEN PV-FOUND-TRIANGLE                                   35050009
350600             ADD +1 TO PV-TRI-DELIVERY-READ                       35060009
350700             ADD +1 TO PV-TRI-DELIVERY-WRITTEN-TEST               35070009
350800         WHEN PV-FOUND-HUDD                                       35080009
350900             ADD +1 TO PV-HUD-DELIVERY-READ                       35090009
351000             ADD +1 TO PV-HUD-DELIVERY-WRITTEN-TEST               35100009
351100         WHEN PV-FOUND-APS                                        35110009
351200             ADD +1 TO PV-APS-DELIVERY-READ                       35120009
351300             ADD +1 TO PV-APS-DELIVERY-WRITTEN-TEST               35130009
351400         WHEN PV-FOUND-GLB                                        35140009
351500             ADD +1 TO PV-GLB-DELIVERY-READ                       35150009
351600             ADD +1 TO PV-GLB-DELIVERY-WRITTEN-TEST               35160009
351700         WHEN PV-FOUND-UWD                                        35170009
351800             ADD +1 TO PV-UWD-DELIVERY-READ                       35180009
351900             ADD +1 TO PV-UWD-DELIVERY-WRITTEN-TEST               35190009
352000     END-EVALUATE.                                                35200009
352100                                                                  35210009
352200     IF PS-CTT-PRESENT OR PS-IEA-PRESENT                          35220009
352300         EVALUATE TRUE                                            35230009
352400             WHEN PV-FOUND-TRIANGLE                               35240009
352500                 ADD +1 TO PV-TRI-DELIVERY-WRITTEN-TEST           35250009
352600             WHEN PV-FOUND-HUDD                                   35260009
352700                 ADD +1 TO PV-HUD-DELIVERY-WRITTEN-TEST           35270009
352800             WHEN PV-FOUND-APS                                    35280009
352900                 ADD +1 TO PV-APS-DELIVERY-WRITTEN-TEST           35290009
353000             WHEN PV-FOUND-GLB                                    35300009
353100                 ADD +1 TO PV-GLB-DELIVERY-WRITTEN-TEST           35310009
353200             WHEN PV-FOUND-UWD                                    35320009
353300                 ADD +1 TO PV-UWD-DELIVERY-WRITTEN-TEST           35330009
353400         END-EVALUATE                                             35340009
353500     END-IF.                                                      35350009
353600                                                                  35360009
353700******************************************************************35370009
353800* WRITE TRIANGLE WS PROD DELIVERY RECORD.                        *35380009
353900******************************************************************35390009
354000*RJ                                                               35400009
354100 5335-WRITE-DELY-P-REC-WS.                                        35410009
354200                                                                  35420009
354300     WRITE DELIVERY-P-LINE                                        35430009
354400          FROM PV-WS-RECORD-TYPE.                                 35440009
354500                                                                  35450009
354600     EVALUATE TRUE                                                35460009
354700         WHEN PV-FOUND-TRIANGLE                                   35470009
354800             ADD +1 TO PV-TRI-DELIVERY-READ                       35480009
354900             ADD +1 TO PV-TRI-DELIVERY-WRITTEN-PROD               35490009
355000         WHEN PV-FOUND-HUDD                                       35500009
355100             ADD +1 TO PV-HUD-DELIVERY-READ                       35510009
355200             ADD +1 TO PV-HUD-DELIVERY-WRITTEN-PROD               35520009
355300         WHEN PV-FOUND-APS                                        35530009
355400             ADD +1 TO PV-APS-DELIVERY-READ                       35540009
355500             ADD +1 TO PV-APS-DELIVERY-WRITTEN-PROD               35550009
355600         WHEN PV-FOUND-GLB                                        35560009
355700             ADD +1 TO PV-GLB-DELIVERY-READ                       35570009
355800             ADD +1 TO PV-GLB-DELIVERY-WRITTEN-PROD               35580009
355900         WHEN PV-FOUND-UWD                                        35590009
356000             ADD +1 TO PV-UWD-DELIVERY-READ                       35600009
356100             ADD +1 TO PV-UWD-DELIVERY-WRITTEN-PROD               35610009
356200     END-EVALUATE.                                                35620009
356300                                                                  35630009
356400     IF PS-CTT-PRESENT OR PS-IEA-PRESENT                          35640009
356500         EVALUATE TRUE                                            35650009
356600             WHEN PV-FOUND-TRIANGLE                               35660009
356700                 ADD +1 TO PV-TRI-DELIVERY-WRITTEN-PROD           35670009
356800             WHEN PV-FOUND-HUDD                                   35680009
356900                 ADD +1 TO PV-HUD-DELIVERY-WRITTEN-PROD           35690009
357000             WHEN PV-FOUND-APS                                    35700009
357100                 ADD +1 TO PV-APS-DELIVERY-WRITTEN-PROD           35710009
357200             WHEN PV-FOUND-GLB                                    35720009
357300                 ADD +1 TO PV-GLB-DELIVERY-WRITTEN-PROD           35730009
357400             WHEN PV-FOUND-UWD                                    35740009
357500                 ADD +1 TO PV-UWD-DELIVERY-WRITTEN-PROD           35750009
357600         END-EVALUATE                                             35760009
357700     END-IF.                                                      35770009
357800                                                                  35780009
357900* PB 06/30/2010 BEG                                               35790009
358000******************************************************************35800009
358100* WRITE TRIANGLE WS TEST WHSE REPLEN RECORD.                     *35810009
358200******************************************************************35820009
358300*                                                                 35830009
358400 5340-WRITE-WHSE-RPLN-T-REC-WS.                                   35840009
358500                                                                  35850009
358600     WRITE WHSE-REPLEN-T-LINE                                     35860009
358700          FROM PV-WS-RECORD-TYPE.                                 35870009
358800                                                                  35880009
358900     EVALUATE TRUE                                                35890009
359000         WHEN PV-FOUND-TRIANGLE                                   35900009
359100             ADD +1 TO PV-TRI-WHSE-REPLEN-READ                    35910009
359200             ADD +1 TO PV-TRI-WHSE-RPLN-WRITTEN-TST               35920009
359300         WHEN PV-FOUND-HUDD                                       35930009
359400             ADD +1 TO PV-HUD-WHSE-REPLEN-READ                    35940009
359500             ADD +1 TO PV-HUD-WHSE-RPLN-WRITTEN-TST               35950009
359600         WHEN PV-FOUND-APS                                        35960009
359700             ADD +1 TO PV-APS-WHSE-REPLEN-READ                    35970009
359800             ADD +1 TO PV-APS-WHSE-RPLN-WRITTEN-TST               35980009
359900         WHEN PV-FOUND-GLB                                        35990009
360000             ADD +1 TO PV-GLB-WHSE-REPLEN-READ                    36000009
360100             ADD +1 TO PV-GLB-WHSE-RPLN-WRITTEN-TST               36010009
360200         WHEN PV-FOUND-UWD                                        36020009
360300             ADD +1 TO PV-UWD-WHSE-REPLEN-READ                    36030009
360400             ADD +1 TO PV-UWD-WHSE-RPLN-WRITTEN-TST               36040009
360500     END-EVALUATE.                                                36050009
360600                                                                  36060009
360700     IF PS-CTT-PRESENT OR PS-IEA-PRESENT                          36070009
360800         EVALUATE TRUE                                            36080009
360900             WHEN PV-FOUND-TRIANGLE                               36090009
361000                 ADD +1 TO PV-TRI-WHSE-RPLN-WRITTEN-TST           36100009
361100             WHEN PV-FOUND-HUDD                                   36110009
361200                 ADD +1 TO PV-HUD-WHSE-RPLN-WRITTEN-TST           36120009
361300             WHEN PV-FOUND-APS                                    36130009
361400                 ADD +1 TO PV-APS-WHSE-RPLN-WRITTEN-TST           36140009
361500             WHEN PV-FOUND-GLB                                    36150009
361600                 ADD +1 TO PV-GLB-WHSE-RPLN-WRITTEN-TST           36160009
361700             WHEN PV-FOUND-UWD                                    36170009
361800                 ADD +1 TO PV-UWD-WHSE-RPLN-WRITTEN-TST           36180009
361900         END-EVALUATE                                             36190009
362000     END-IF.                                                      36200009
362100                                                                  36210009
362200******************************************************************36220009
362300* WRITE TRIANGLE WS PROD WHSE REPLEN RECORD.                     *36230009
362400******************************************************************36240009
362500*                                                                 36250009
362600 5345-WRITE-WHSE-RPLN-P-REC-WS.                                   36260009
362700                                                                  36270009
362800     WRITE WHSE-REPLEN-P-LINE                                     36280009
362900          FROM PV-WS-RECORD-TYPE.                                 36290009
363000                                                                  36300009
363100     EVALUATE TRUE                                                36310009
363200         WHEN PV-FOUND-TRIANGLE                                   36320009
363300             ADD +1 TO PV-TRI-WHSE-REPLEN-READ                    36330009
363400             ADD +1 TO PV-TRI-WHSE-RPLN-WRITTEN-PRD               36340009
363500         WHEN PV-FOUND-HUDD                                       36350009
363600             ADD +1 TO PV-HUD-WHSE-REPLEN-READ                    36360009
363700             ADD +1 TO PV-HUD-WHSE-RPLN-WRITTEN-PRD               36370009
363800         WHEN PV-FOUND-APS                                        36380009
363900             ADD +1 TO PV-APS-WHSE-REPLEN-READ                    36390009
364000             ADD +1 TO PV-APS-WHSE-RPLN-WRITTEN-PRD               36400009
364100         WHEN PV-FOUND-GLB                                        36410009
364200             ADD +1 TO PV-GLB-WHSE-REPLEN-READ                    36420009
364300             ADD +1 TO PV-GLB-WHSE-RPLN-WRITTEN-PRD               36430009
364400         WHEN PV-FOUND-UWD                                        36440009
364500             ADD +1 TO PV-UWD-WHSE-REPLEN-READ                    36450009
364600             ADD +1 TO PV-UWD-WHSE-RPLN-WRITTEN-PRD               36460009
364700     END-EVALUATE.                                                36470009
364800                                                                  36480009
364900     IF PS-CTT-PRESENT OR PS-IEA-PRESENT                          36490009
365000         EVALUATE TRUE                                            36500009
365100             WHEN PV-FOUND-TRIANGLE                               36510009
365200                 ADD +1 TO PV-TRI-WHSE-RPLN-WRITTEN-PRD           36520009
365300             WHEN PV-FOUND-HUDD                                   36530009
365400                 ADD +1 TO PV-HUD-WHSE-RPLN-WRITTEN-PRD           36540009
365500             WHEN PV-FOUND-APS                                    36550009
365600                 ADD +1 TO PV-APS-WHSE-RPLN-WRITTEN-PRD           36560009
365700             WHEN PV-FOUND-GLB                                    36570009
365800                 ADD +1 TO PV-GLB-WHSE-RPLN-WRITTEN-PRD           36580009
365900             WHEN PV-FOUND-UWD                                    36590009
366000                 ADD +1 TO PV-UWD-WHSE-RPLN-WRITTEN-PRD           36600009
366100         END-EVALUATE                                             36610009
366200     END-IF.                                                      36620009
366300                                                                  36630009
366400* PB 06/30/2010 END                                               36640009
366500******************************************************************36650009
366600*  ACCUMULATE RECORDS WRITTEN.                                   *36660009
366700******************************************************************36670009
366800 6000-ADD-TO-TOT-RECS-CONSOL.                                     36680009
367000     ADD +1 TO  PV-CONSOLIDATOR-WRITTEN.                          36700009
367100     ADD +1 TO  PV-TOT-RECS-WRITTEN.                              36710009
367200                                                                  36720009
367300******************************************************************36730009
367400*  ACCUMULATE RECORDS WRITTEN.                                   *36740009
367500******************************************************************36750009
367600 6010-ADD-TO-TOT-RECS-TRIANGLE.                                   36760009
367700                                                                  36770009
367800     ADD +1 TO  PV-DECONSOL-WRITTEN.                              36780009
367900     ADD +1 TO  PV-TOT-RECS-WRITTEN.                              36790009
368000                                                                  36800009
368100******************************************************************36810009
368200*  QUERY TO RETURN WHICH VENDOR WE ARE DEALING WITH              *36820009
368300******************************************************************36830009
368400*RJ                                                               36840009
368500 7000-GET-VENDOR.                                                 36850009
368700     MOVE +1 TO PV-POINTER.                                       36870009
368800                                                                  36880009
368900     STRING TR090-IMP-VEND-INCHG-ID DELIMITED BY ' '              36890009
369000           INTO   PV-VENDOR-NAME-S                                36900009
369100           WITH   POINTER PV-POINTER.                             36910009
369200     SUBTRACT +1 FROM PV-POINTER.                                 36920009
369300                                                                  36930009
369400            EXEC SQL                                              36940009
369500              SELECT DISTINCT                                     36950009
369600                     B.ENT_NAME_DESC,                             36960009
369700                     A.INACTV_DTE                                 36970009
369800              INTO  :ENTNME-ENT-NAME-DESC,                        36980009
369900                    :TRDPRT-INACTV-DTE                            36990009
370000              FROM   TTRDPRT A,                                   37000009
370100                     TENTNME B,                                   37010009
370200                     TEXTENT C                                    37020009
370300              WHERE  A.ENT_ID           = B.ENT_ID                37030009
370400                AND (B.ENT_NAME_DESC LIKE :DK-WHERE-3             37040009
370500                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-4             37050009
370600                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-5             37060009
370700                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-6             37070009
370800                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-7             37080009
370900                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-8             37090009
371000                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-9             37100009
371100                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-10            37110009
371200                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-11            37120009
371300                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-12            37130009
371400                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-13            37140009
371500                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-14            37150009
371600                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-15            37160009
371700                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-16            37170009
371800                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-17            37180009
371900                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-18            37190009
372000                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-19            37200009
372100                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-20            37210009
372200                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-21            37220009
372300                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-22            37230009
372400                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-23            37240009
372500                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-24            37250009
372600                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-25            37260009
372700                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-26            37270009
372800                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-27            37280009
372900                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-28            37290009
373000                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-29            37300009
373100                 OR  B.ENT_NAME_DESC LIKE :DK-WHERE-30)           37310009
373200                AND B.TYPE_CDE          = '01'                    37320009
373300                AND A.VEND_INCHG_ID     =                         37330009
373400                    SUBSTR(:PV-VENDOR-NAME-S,1,:PV-POINTER)       37340009
373500                AND A.VEND_INCHG_ID_DESC =:                       37350009
373600                                     TR090-IMP-VEND-INCHG-ID-DESC 37360009
373700                AND CURRENT DATE        <= A.INACTV_DTE           37370009
373800                AND B.ENT_ID = C.ENT_ID                           37380009
373900                AND C.CARRIER_IND = 'Y'                           37390009
374000            END-EXEC.                                             37400009
374100                                                                  37410009
374200      EVALUATE TRUE                                               37420009
374300          WHEN SQLCODE = +100                                     37430009
374400            SET PS-VENDOR-FOUND-NO TO TRUE                        37440009
374500          WHEN SQLCODE = ZERO                                     37450009
374600          WHEN SQLCODE = -811                                     37460009
374700            SET PS-VENDOR-FOUND    TO TRUE                        37470009
374900             EVALUATE PV-NAME-SUB                                 37490009
375000                 WHEN 1                                           37500009
375100                   SET PV-FOUND-TRIANGLE  TO TRUE                 37510009
375200                 WHEN 2                                           37520009
375300                   SET PV-FOUND-HELLMAN   TO TRUE                 37530009
375400                 WHEN 3                                           37540009
375500                   SET PV-FOUND-EXPEDITOR TO TRUE                 37550009
375600                 WHEN 4                                           37560009
375700                   SET PV-FOUND-MAERSK    TO TRUE                 37570009
375800                 WHEN 5                                           37580009
375900                   SET PV-FOUND-NYK       TO TRUE                 37590009
376000                 WHEN 6                                           37600009
376100                   SET PV-FOUND-HUDD      TO TRUE                 37610009
376200                 WHEN 7                                           37620009
376300                   SET PV-FOUND-UWD       TO TRUE                 37630009
376400                 WHEN 8                                           37640009
376500                   SET PV-FOUND-APS       TO TRUE                 37650009
376600                 WHEN 9                                           37660009
376700                   SET PV-FOUND-GLB       TO TRUE                 37670009
376800                 WHEN 10                                          37680009
376900                   SET PV-FOUND-APS       TO TRUE                 37690009
377000                 WHEN 11                                          37700009
377100                   SET PV-FOUND-LIVINGSTON TO TRUE                37710009
377200* IF NEW VENDORS ARE ADDED, ADD WHEN 12, ETC...                   37720009
377300                 WHEN OTHER                                       37730009
377400                   SET PV-FOUND-NONE      TO TRUE                 37740009
377500             END-EVALUATE                                         37750009
377600                                                                  37760009
377700          WHEN SQLCODE > 0                                        37770009
377800          WHEN SQLCODE < 0                                        37780009
377900          WHEN SQLWARN0 NOT EQUAL SPACE                           37790009
378000             MOVE '7000-GET-VENDOR' TO    PV-PARAGRAPH-NAME       37800009
378100             DISPLAY ' PV-VENDOR-NAME-S='                         37810009
378200                        PV-VENDOR-NAME-S                          37820009
378300             DISPLAY    'PV-POINTER='                             37830009
378400                        PV-POINTER                                37840009
378500             DISPLAY ' TR090-IMP-VEND-INCHG-ID-DESC='             37850009
378600                       TR090-IMP-VEND-INCHG-ID-DESC               37860009
378700             DISPLAY  DK-WHERE-11                                 37870009
378800             DISPLAY  DK-WHERE-12                                 37880009
378900             DISPLAY  DK-WHERE-13                                 37890009
379000             DISPLAY  DK-WHERE-14                                 37900009
379100             DISPLAY  DK-WHERE-15                                 37910009
379200             DISPLAY  DK-WHERE-16                                 37920009
379300             DISPLAY  DK-WHERE-17                                 37930009
379400             DISPLAY  DK-WHERE-18                                 37940009
379500             DISPLAY  DK-WHERE-19                                 37950009
379600             DISPLAY  DK-WHERE-20                                 37960009
379700             DISPLAY  DK-WHERE-21                                 37970009
379800             PERFORM 9900-SQL-ERROR                               37980009
379900      END-EVALUATE.                                               37990009
380000                                                                  38000009
380100******************************************************************38010009
380200*  CLOSE THE FILES.                                              *38020009
380300******************************************************************38030009
380400 8000-CLOSE-FILES.                                                38040009
380500                                                                  38050009
380600     CLOSE       TRIANGLE-PACKSLIPS-T-FILE                        38060009
380700                 TRIANGLE-PACKSLIPS-P-FILE                        38070009
380800                 DELIVERY-T-FILE                                  38080009
380900                 DELIVERY-P-FILE                                  38090009
381000                 CONSOL-IMPORT-BKG-T-FILE                         38100009
381100                 CONSOL-IMPORT-BKG-P-FILE                         38110009
381200                 CONSOL-IMPORT-RCVG-T-FILE                        38120009
381300                 CONSOL-IMPORT-RCVG-P-FILE                        38130009
381400                 CONSOL-ARRIVAL-P-FILE                            38140009
381500                 CONSOL-ARRIVAL-T-FILE                            38150009
381600                 CONSOL-CONMAN-P-FILE                             38160009
381700                 CONSOL-CONMAN-T-FILE                             38170009
381800                 CONSOL-CUSTOMS-P-FILE                            38180009
381900                 CONSOL-CUSTOMS-T-FILE                            38190009
382000                 CONSOL-EXCP-FILE                                 38200009
382100* PB 06/30/2010 BEG                                               38210009
382200                 WHSE-REPLEN-P-FILE                               38220009
382300                 WHSE-REPLEN-T-FILE                               38230009
382400* PB 06/30/2010 END                                               38240009
382500                 REPORT-FILE.                                     38250009
382600                                                                  38260009
382700******************************************************************38270009
382800* SQL WARNING AND ERROR PROCESSING                               *38280009
382900******************************************************************38290009
383000 9900-SQL-ERROR.                                                  38300009
383100                                                                  38310009
383200     MOVE SQLCODE    TO SQLCODE2.                                 38320009
383300     MOVE SQLERRD(3) TO SQLERRD3.                                 38330009
383400     DISPLAY '** ABEND **       ** = SQLERROR'.                   38340009
383500     DISPLAY '** PROGRAM        ** = TRKUT090'.                   38350009
383600     DISPLAY '** PARAGRAPH      ** = ' PV-PARAGRAPH-NAME.         38360009
383700     DISPLAY '** SQLCODE        ** = ' SQLCODE2.                  38370009
383800     DISPLAY '** ROWS PROCESSED ** = ' SQLERRD3.                  38380009
383900     DISPLAY '** SQLERRM        ** = ' SQLERRM.                   38390009
384000     DISPLAY '**   LERRMC       ** = ' SQLERRMC.                  38400009
384100     MOVE +4013 TO PV-ABEND-CODE.                                 38410009
384200     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         38420009
