      ******************************************************************        
      * THIS COPYBOOK USED IN A WEBSERVICE ARRIVEINBOUNDTRAILER                 
      * PLEASE CHECK IN CICS WEBSERVICE PLAYBOOK FOR STEPS TO FOLLOW            
      * FOR MAKING CHANGES TO THIS COPYBOOK LAYOUT                              
      ******************************************************************        
       01  TR069-INP-ARRIVE-INB-TLR.                                            
           05  TR069-DC-NBR              PIC 9(04)  VALUE ZEROES.               
           05  TR069-TRLR-SCAC-CDE       PIC X(04)  VALUE SPACES.               
           05  TR069-TRAILER-ID          PIC X(12)  VALUE SPACES.               
           05  TR069-USER-ID             PIC X(08)  VALUE SPACES.               
