000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RECORD LAYOUT FOR EDITED IMPORT ORIGIN     * 00020000
000300*                    RECEIVING DATA.                            * 00030001
000400*    RECORD LENGTH:  300                                        * 00040012
000500*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD025   * 00050002
000600***************************************************************** 00060000
000601* NOTE: THE RECORD LENGTH WAS INCREASED FROM 165 TO 300 BYTES   * 00060112
000602*        IN 4/2000. THIS IS SO KOHLS CAN ADD ENT-ID AND FILE-ID * 00060212
000603*        PRESENTLY, AND POSSIBLY OTHER FIELDS IN THE FUTURE     * 00060312
000610***************************************************************** 00061012
000700* ESTIMATED TRIP  (VESSEL, AIR, MOTOR).                         * 00070000
000800* THE DATE ON WHICH THE CARRIER IS EXPECTED TO DEPART.          * 00080000
000900* ERD AND LOG RECORD TYPES ARE SENT TOGETHER AS A SET.          * 00090002
001000***************************************************************** 00100000
001100 01  TR025-REC-TYP-ERD.                                           00110003
001120     05 TR025-ERD-REC-KEY.                                        00112009
001130        10 TR025-ERD-TRN-TYP            PIC X(01).                00113009
001140           88 TR025-ERD-TRN-TYP-ADD                VALUE 'A',     00114009
001150                                                         'B',     00115009
001160                                                         'Z'.     00116009
001170           88 TR025-ERD-TRN-TYP-CHG                VALUE 'C'.     00117009
001180           88 TR025-ERD-TRN-TYP-DEL                VALUE 'D',     00118009
001190                                                         'E'.     00119009
001191        10 TR025-ERD-REC-TYP-CDE        PIC X(06).                00119109
001192           88 TR025-ERD-REC-TYP-CDE-ERD            VALUE 'ERD   '.00119209
001193        10 TR025-ERD-SEQ-NBR            PIC X(02).                00119309
001194           88 TR025-ERD-SEQ-NBR-10                 VALUE '10'.    00119409
001195        10 TR025-ERD-3RD-PARTY-CDE      PIC X(06).                00119509
001196           88 TR025-ERD-3RD-PARTY-CDE-EI           VALUE '      '.00119609
001197        10 TR025-ERD-PO-NBR             PIC 9(09).                00119709
001198        10 TR025-ERD-PO-NBR-X REDEFINES                           00119809
001199           TR025-ERD-PO-NBR             PIC X(09).                00119909
001200        10 TR025-ERD-EXTL-REF-NBR       PIC X(15).                00120009
001201        10 TR025-ERD-PO-RCVD-DELY-DTE   PIC X(08).                00120110
001202        10 TR025-ERD-PO-RCVD-DELY-TM    PIC X(04).                00120210
001203        10 TR025-ERD-ORGN-SHPD-FR-CDE   PIC X(03).                00120309
001204           88 TR025-ERD-ORGN-SHPD-FR-CFS         VALUE 'CFS'.     00120409
001205           88 TR025-ERD-ORGN-SHPD-FR-CY          VALUE 'CY '.     00120509
001206        10 TR025-ERD-IMPRT-TRIP-ID      PIC X(10).                00120609
001207        10 TR025-ERD-CARR-SCAC-ID       PIC X(04).                00120709
001208     05 TR025-ERD-IMPRT-VEH-NM          PIC X(25).                00120811
001209     05 TR025-ERD-POE-DELY-DTE          PIC X(08).                00120909
001210     05 TR025-ERD-POE-DELY-TM           PIC X(04).                00121009
001211     05 TR025-ERD-DPRTR-DTE             PIC X(08).                00121109
001212     05 TR025-ERD-DPRTR-TM              PIC X(04).                00121209
001213     05 TR025-ERD-FOB-CDE               PIC X(05).                00121309
001214     05 TR025-ERD-DEST-POE-CDE          PIC X(04).                00121409
001215     05 TR025-ERD-TRIP-TYP-CDE          PIC X(01).                00121509
001216        88 TR025-ERD-TRIP-TYP-CDE-AIR              VALUE 'A'.     00121609
001217        88 TR025-ERD-TRIP-TYP-CDE-MOTOR            VALUE 'M'.     00121709
001218        88 TR025-ERD-TRIP-TYP-CDE-OCEAN            VALUE 'O'.     00121809
001219     05 TR025-ERD-EST-LBD-NM            PIC X(18).                00121909
001220     05 TR025-ERD-FILLER                PIC X(131).               00122012
001221     05 TR025-ERD-FILE-ID               PIC X(09).                00122112
001222     05 TR025-ERD-ENT-ID                PIC 9(09).                00122212
001224     05 TR025-ERD-PROCESS-SEQ-NBR       PIC 9(06).                00122409
001225*                                                                 00122509
004600***************************************************************** 00460000
004700* ESTIMATED TRIP (VESSEL, AIR, MOTOR).                          * 00470000
004800* THE REASON THE PURCHASE ORDER NEEDED TO BE RE-BOOKED ON A     * 00480000
004900* DIFFERENT VOYAGE.  IF NOT RE-BOOKED AN ERDRSN RECORD WON'T    * 00490003
005000* BE TRANSMITTED.                                               * 00500000
005100***************************************************************** 00510000
008010 01  TR025-REC-TYP-ERDRSN REDEFINES TR025-REC-TYP-ERD.            00801009
008020     05 TR025-ERDRSN-REC-KEY.                                     00802009
008030        10 TR025-ERDRSN-TRN-TYP         PIC X(01).                00803009
008040           88 TR025-ERDRSN-TRN-TYP-ADD             VALUE 'A',     00804009
008050                                                         'B',     00805009
008060                                                         'Z'.     00806009
008070           88 TR025-ERDRSN-TRN-TYP-CHG             VALUE 'C'.     00807009
008080           88 TR025-ERDRSN-TRN-TYP-DEL             VALUE 'D',     00808009
008090                                                         'E'.     00809009
008091        10 TR025-ERDRSN-REC-TYP-CDE     PIC X(06).                00809109
008092           88 TR025-ERDRSN-REC-TYP-CD-ERDRSN     VALUE 'ERDRSN'.  00809209
008093        10 TR025-ERDRSN-SEQ-NBR         PIC X(02).                00809309
008094           88 TR025-ERDRSN-SEQ-NBR-11              VALUE '11'.    00809409
008095        10 TR025-ERDRSN-3RD-PARTY-CDE   PIC X(06).                00809509
008096           88 TR025-ERDRSN-3RD-PARTY-CDE-EI        VALUE '      '.00809609
008097        10 TR025-ERDRSN-PO-NBR          PIC 9(09).                00809709
008098        10 TR025-ERDRSN-PO-NBR-X REDEFINES                        00809809
008099           TR025-ERDRSN-PO-NBR          PIC X(09).                00809909
008100        10 TR025-ERDRSN-EXTL-REF-NBR    PIC X(15).                00810009
008110        10 TR025-ERDRSN-PO-RCVD-DELY-DTE PIC X(08).               00811010
008120        10 TR025-ERDRSN-PO-RCVD-DELY-TM  PIC X(04).               00812010
008130        10 TR025-ERDRSN-ORGN-SHPD-FR-CDE PIC X(03).               00813009
008140           88 TR025-ERDRSN-ORGN-SHPD-FR-CFS      VALUE 'CFS'.     00814009
008150           88 TR025-ERDRSN-ORGN-SHPD-FR-CY       VALUE 'CY '.     00815009
008160        10 TR025-ERDRSN-IMPRT-TRIP-ID   PIC X(10).                00816009
008170        10 TR025-ERDRSN-CARR-SCAC-ID    PIC X(04).                00817009
008180     05 TR025-ERDRSN-POE-DELY-DTE       PIC X(08).                00818009
008190     05 TR025-ERDRSN-POE-DELY-TM        PIC X(04).                00819009
008191     05 TR025-ERDRSN-DPRTR-DTE          PIC X(08).                00819109
008192     05 TR025-ERDRSN-DPRTR-TM           PIC X(04).                00819209
008193     05 TR025-ERDRSN-VOY-CHG-RSN-DESC   PIC X(30).                00819309
008194     05 TR025-ERDRSN-FILLER             PIC X(154).               00819412
008195     05 TR025-ERDRSN-FILE-ID            PIC X(09).                00819512
008196     05 TR025-ERDRSN-ENT-ID             PIC 9(09).                00819612
008197     05 TR025-ERDRSN-PROCESS-SEQ-NBR    PIC 9(06).                00819709
008198*                                                                 00819809
008200***************************************************************** 00820000
008300* FOR CARGO FORWARDERS SERVICE (CFS), THE DATE THE PURCHASE     * 00830000
008400* ORDER IS RECEIVED AT THE CONSOLIDATOR.  FOR CARRIER'S YARD(CY)* 00840004
008500* SHIPMENTS, THE DATE THE PURCHASE ORDER IS RECEIVED AT THE     * 00850004
008600* CARRIER'S YARD.  THE SEGMENT IS RESENT MULTIPLE TIMES ONCE    * 00860004
008700* WAREHOUSE QUANTITY IS SCHEDULED.  IF PART OR ALL OF FREIGHT   * 00870004
008800* IS WAREHOUSED, NEW LOG RECORDS WILL BE SENT WITH THE SAME     * 00880004
008810* RECEIPT DATE, BUT WITH DIFFERENT REFERENCE NUMBERS.           * 00881004
008900***************************************************************** 00890000
009000 01  TR025-REC-TYP-LOG REDEFINES TR025-REC-TYP-ERDRSN.            00900009
009100     05 TR025-LOG-REC-KEY.                                        00910009
009200        10 TR025-LOG-TRN-TYP            PIC X(01).                00920009
009300           88 TR025-LOG-TRN-TYP-ADD              VALUE 'A',       00930009
009400                                                       'B',       00940009
009500                                                       'Z'.       00950009
009600           88 TR025-LOG-TRN-TYP-CHG              VALUE 'C'.       00960009
009700           88 TR025-LOG-TRN-TYP-DEL              VALUE 'D',       00970009
009800                                                       'E'.       00980009
009900        10 TR025-LOG-REC-TYP-CDE        PIC X(06).                00990009
010000           88 TR025-LOG-REC-TYP-CDE-LOG          VALUE 'LOG   '.  01000009
010100        10 TR025-LOG-SEQ-NBR            PIC X(02).                01010009
010200           88 TR025-LOG-SEQ-NBR-20               VALUE '20'.      01020009
010300        10 TR025-LOG-3RD-PARTY-CDE      PIC X(06).                01030009
010400           88 TR025-LOG-3RD-PARTY-CDE-EI         VALUE '      '.  01040009
010500        10 TR025-LOG-PO-NBR             PIC 9(09).                01050009
010600        10 TR025-LOG-PO-NBR-X REDEFINES                           01060009
010700           TR025-LOG-PO-NBR             PIC X(09).                01070009
010800        10 TR025-LOG-EXTL-REF-NBR       PIC X(15).                01080009
010900        10 TR025-LOG-PO-RCVD-DELY-DTE   PIC X(08).                01090010
011000        10 TR025-LOG-PO-RCVD-DELY-TM    PIC X(04).                01100010
011100        10 TR025-LOG-ORGN-SHPD-FR-CDE   PIC X(03).                01110009
011200           88 TR025-LOG-ORGN-SHPD-FR-CFS         VALUE 'CFS'.     01120009
011300           88 TR025-LOG-ORGN-SHPD-FR-CY          VALUE 'CY '.     01130009
011400     05 TR025-LOG-PROD-FCTRY-NM         PIC X(35).                01140009
011500     05 TR025-LOG-C-O-PROD-CDE          PIC X(03).                01150009
011600     05 TR025-LOG-PO-CART-CNT           PIC 9(09).                01160009
011700     05 TR025-LOG-PO-CART-CNT-X REDEFINES                         01170009
011800        TR025-LOG-PO-CART-CNT           PIC X(09).                01180009
011900     05 TR025-LOG-PO-UNT-QTY            PIC 9(09).                01190009
012000     05 TR025-LOG-PO-UNT-QTY-X REDEFINES                          01200009
012100        TR025-LOG-PO-UNT-QTY            PIC X(09).                01210009
012110     05 TR025-LOG-PO-CBMT-QTY           PIC 9(07)V99.             01211009
012120     05 TR025-LOG-PO-CBMT-QTY-X REDEFINES                         01212009
012130        TR025-LOG-PO-CBMT-QTY           PIC X(09).                01213009
012140     05 TR025-LOG-PO-WT-KGRM-QTY        PIC 9(09).                01214009
012150     05 TR025-LOG-PO-WT-KGRM-QTY-X REDEFINES                      01215009
012160        TR025-LOG-PO-WT-KGRM-QTY        PIC X(09).                01216009
012170     05 TR025-LOG-CONSOL-SCAC-ID        PIC X(04).                01217009
012180     05 TR025-LOG-FILLER                PIC X(144).               01218012
012181     05 TR025-LOG-FILE-ID               PIC X(09).                01218112
012182     05 TR025-LOG-ENT-ID                PIC 9(09).                01218212
012190     05 TR025-LOG-PROCESS-SEQ-NBR       PIC 9(06).                01219009
012191                                                                  01219109
012200***************************************************************** 01220000
012400* VENDOR STYLE RECORD.                                          * 01240000
012500* THIS SEGMENT IS REPEATED FOR EACH VENDOR STYLE.               * 01250000
012600***************************************************************** 01260000
015310 01  TR025-REC-TYP-LOGVS REDEFINES TR025-REC-TYP-LOG.             01531009
015320     05 TR025-LOGVS-REC-KEY.                                      01532009
015330        10 TR025-LOGVS-TRN-TYP          PIC X(01).                01533009
015340           88 TR025-LOGVS-TRN-TYP-ADD              VALUE 'A',     01534009
015350                                                         'B',     01535009
015360                                                         'Z'.     01536009
015370           88 TR025-LOGVS-TRN-TYP-CHG              VALUE 'C'.     01537009
015380           88 TR025-LOGVS-TRN-TYP-DEL              VALUE 'D',     01538009
015390                                                         'E'.     01539009
015391        10 TR025-LOGVS-REC-TYP-CDE      PIC X(06).                01539109
015392           88 TR025-LOGVS-REC-TYP-CDE-LOGVS        VALUE 'LOGVS '.01539209
015393        10 TR025-LOGVS-SEQ-NBR          PIC X(02).                01539309
015394           88 TR025-LOGVS-SEQ-NBR-21               VALUE '21'.    01539409
015395        10 TR025-LOGVS-3RD-PARTY-CDE    PIC X(06).                01539509
015396           88 TR025-LOGVS-3RD-PARTY-CDE-EI         VALUE '      '.01539609
015397        10 TR025-LOGVS-PO-NBR           PIC 9(09).                01539709
015398        10 TR025-LOGVS-PO-NBR-X REDEFINES                         01539809
015399           TR025-LOGVS-PO-NBR           PIC X(09).                01539909
015400        10 TR025-LOGVS-EXTL-REF-NBR     PIC X(15).                01540009
015410        10 TR025-LOGVS-PO-RCVD-DELY-DTE PIC X(08).                01541010
015420        10 TR025-LOGVS-PO-RCVD-DELY-TM  PIC X(04).                01542010
015430        10 TR025-LOGVS-ORGN-SHPD-FR-CDE PIC X(03).                01543009
015440           88 TR025-LOGVS-ORGN-SHPD-FR-CFS       VALUE 'CFS'.     01544009
015450           88 TR025-LOGVS-ORGN-SHPD-FR-CY        VALUE 'CY '.     01545009
015460     05 TR025-LOGVS-VS-NBR              PIC X(20).                01546009
015470     05 TR025-LOGVS-VS-CART-CNT         PIC 9(09).                01547009
015480     05 TR025-LOGVS-VS-CART-CNT-X REDEFINES                       01548009
015490        TR025-LOGVS-VS-CART-CNT         PIC X(09).                01549009
015491     05 TR025-LOGVS-VS-UNT-QTY          PIC 9(09).                01549109
015492     05 TR025-LOGVS-VS-UNT-QTY-X REDEFINES                        01549209
015493        TR025-LOGVS-VS-UNT-QTY          PIC X(09).                01549309
015494     05 TR025-LOGVS-VS-CBMT-QTY         PIC 9(07)V99.             01549409
015495     05 TR025-LOGVS-VS-CBMT-QTY-X REDEFINES                       01549509
015496        TR025-LOGVS-VS-CBMT-QTY         PIC X(09).                01549609
015497     05 TR025-LOGVS-VS-WT-KGRM-QTY      PIC 9(09).                01549709
015498     05 TR025-LOGVS-VS-WT-KGRM-QTY-X REDEFINES                    01549809
015499        TR025-LOGVS-VS-WT-KGRM-QTY      PIC X(09).                01549909
015500     05 TR025-LOGVS-FILLER              PIC X(166).               01550012
015501     05 TR025-LOGVS-FILE-ID             PIC X(09).                01550112
015502     05 TR025-LOGVS-ENT-ID              PIC 9(09).                01550212
015503     05 TR025-LOGVS-PROCESS-SEQ-NBR     PIC 9(06).                01550309
015504*                                                                 01550409
015510***************************************************************** 01551000
015600* UPC RECORD.                                                   * 01560000
015700* THIS SEGMENT IS REPEATED FOR EACH UPC.                        * 01570000
015800***************************************************************** 01580000
019284 01  TR025-REC-TYP-LOGUPC REDEFINES TR025-REC-TYP-LOGVS.          01928409
019285     05 TR025-LOGUPC-REC-KEY.                                     01928509
019286        10 TR025-LOGUPC-TRN-TYP         PIC X(01).                01928609
019287           88 TR025-LOGUPC-TRN-TYP-ADD             VALUE 'A',     01928709
019288                                                         'B',     01928809
019289                                                         'Z'.     01928909
019290           88 TR025-LOGUPC-TRN-TYP-CHG             VALUE 'C'.     01929009
019291           88 TR025-LOGUPC-TRN-TYP-DEL             VALUE 'D',     01929109
019292                                                         'E'.     01929209
019293        10 TR025-LOGUPC-REC-TYP-CDE     PIC X(06).                01929309
019294           88 TR025-LOGUPC-REC-TYP-CD-LOGUPC       VALUE 'LOGUPC'.01929409
019295        10 TR025-LOGUPC-SEQ-NBR         PIC X(02).                01929509
019296           88 TR025-LOGUPC-SEQ-NBR-22              VALUE '22'.    01929609
019297        10 TR025-LOGUPC-3RD-PARTY-CDE   PIC X(06).                01929709
019298           88 TR025-LOGUPC-3RD-PARTY-CDE-EI        VALUE '      '.01929809
019299        10 TR025-LOGUPC-PO-NBR          PIC 9(09).                01929909
019300        10 TR025-LOGUPC-PO-NBR-X REDEFINES                        01930009
019301           TR025-LOGUPC-PO-NBR          PIC X(09).                01930109
019302        10 TR025-LOGUPC-EXTL-REF-NBR    PIC X(15).                01930209
019303        10 TR025-LOGUPC-PO-RCVD-DELY-DTE PIC X(08).               01930310
019304        10 TR025-LOGUPC-PO-RCVD-DELY-TM  PIC X(04).               01930410
019305        10 TR025-LOGUPC-ORGN-SHPD-FR-CDE PIC X(03).               01930510
019306           88 TR025-LOGUPC-ORGN-SHPD-FR-CFS      VALUE 'CFS'.     01930609
019307           88 TR025-LOGUPC-ORGN-SHPD-FR-CY       VALUE 'CY '.     01930709
019308     05 TR025-LOGUPC-VS-NBR             PIC X(20).                01930809
019309     05 TR025-LOGUPC-UPC-NBR            PIC 9(15).                01930909
019310     05 TR025-LOGUPC-UPC-NBR-X REDEFINES                          01931009
019311        TR025-LOGUPC-UPC-NBR            PIC X(15).                01931109
019312     05 TR025-LOGUPC-UPC-CART-CNT       PIC 9(09).                01931209
019313     05 TR025-LOGUPC-UPC-CART-CNT-X REDEFINES                     01931309
019314        TR025-LOGUPC-UPC-CART-CNT       PIC X(09).                01931409
019315     05 TR025-LOGUPC-UPC-UNT-QTY        PIC 9(09).                01931509
019316     05 TR025-LOGUPC-UPC-UNT-QTY-X REDEFINES                      01931609
019317        TR025-LOGUPC-UPC-UNT-QTY        PIC X(09).                01931709
019318     05 TR025-LOGUPC-UPC-CBMT-QTY       PIC 9(07)V99.             01931809
019319     05 TR025-LOGUPC-UPC-CBMT-QTY-X REDEFINES                     01931909
019320        TR025-LOGUPC-UPC-CBMT-QTY       PIC X(09).                01932009
019321     05 TR025-LOGUPC-UPC-WT-KGRM-QTY    PIC 9(09).                01932109
019322     05 TR025-LOGUPC-UPC-WT-KGRM-QTY-X REDEFINES                  01932209
019323        TR025-LOGUPC-UPC-WT-KGRM-QTY    PIC X(09).                01932309
019330     05 TR025-LOGUPC-FILLER             PIC X(151).               01933012
019331     05 TR025-LOGUPC-FILE-ID            PIC X(09).                01933112
019340     05 TR025-LOGUPC-ENT-ID             PIC 9(09).                01934012
019400     05 TR025-LOGUPC-PROCESS-SEQ-NBR    PIC 9(06).                01940009
