      ******************************************************************        
      * TRRD272 - 8/17/12 NOTE: THIS DUPLICATES DCLGEN TRT00050                 
      *                         FOR TRT_VND_TRANS_RT.                           
      * RECORD LENGTH - 184 BYTES                                               
      ******************************************************************        
       01  TR272-VENDOR-TRANS-RATE-REC.                                         
           05 TR272-VND-TRANS-RT-ID         PIC  S9(9) COMP.                    
           05 TR272-VND-NBR                 PIC   X(10).                        
           05 TR272-TRANS-RT-TYP-CDE        PIC   X(4).                         
           05 TR272-EFF-RT-BEG-DTE          PIC   X(26).                        
           05 TR272-EFF-RT-END-DTE          PIC   X(26).                        
           05 TR272-DCONSLR-SCAC-ID         PIC   X(4).                         
           05 TR272-POE-STD-EDI-CDE         PIC   X(5).                         
           05 TR272-FOB-STD-EDI-CDE         PIC   X(5).                         
           05 TR272-EDI-CONTNR-SZ-TYP-CDE   PIC   X(4).                         
           05 TR272-CMDTY-TYP-GRP-CDE       PIC   X(4).                         
           05 TR272-TRANS-RT-AMT            PIC  S9(8)V9(2) COMP-3.             
           05 TR272-RT-WT-TYP-CDE           PIC   X(3).                         
           05 TR272-UOM-CDE                 PIC   X(3).                         
           05 TR272-RT-BSS-MAX-QTY          PIC  S9(8)V9(2) COMP-3.             
           05 TR272-RT-BSS-MIN-QTY          PIC  S9(8)V9(2) COMP-3.             
           05 TR272-CRE-TMST                PIC   X(26).                        
           05 TR272-CRE-USRID               PIC   X(8).                         
           05 TR272-LAST-UPD-TMST           PIC   X(26).                        
           05 TR272-LAST-UPD-USRID          PIC   X(8).                         
