000100***************************************************************** 00010000
000200*    RECORD PURPOSE: IMPORT ORIGIN BOOKING EVENT DATA RECEIVED  * 00020011
000210*                    FROM THE CONSOLIDATOR.  ORIGIN IS THE LOCA-* 00021000
000300*                    TION (OUTSIDE OF THE U.S.) FROM WHERE      * 00030000
000400*                    FREIGHT IS BEING SHIPPED.  THIS IS BOOKING * 00040000
000500*                    INFORMATION THAT THE CONSOLIDATOR MAKES    * 00050000
000510*                    WITH THE FACTORY ESTIMATING WHEN THE MER-  * 00051000
000520*                    CHANDISE WILL BE DROPPED OFF FOR FORWARDING* 00052000
000530*                    TO KOHLS.  IT ALSO CONTAINS INFORMATION    * 00053000
000540*                    CONCERNING THE OCEAN/AIR VOYAGE TO THE     * 00054000
000550*                    PORT OF ENTRY.                             * 00055000
000551*                                                               * 00055100
000552*    NOTE:THE RECORD COMING FROM THE CONSOLIDATOR CAN BE A MAX  * 00055200
000553*         OF 148 BYTES.  EVEN THOUGH THE RECORD LENGTH IS 150,  * 00055300
000560*         EDI USES ONE BYTE FOR THE SEGMENT END CHARACTER AND   * 00056000
000570*         ANOTHER BYTE AT THE END OF THE RECORD FOR ????.  SO   * 00057000
000580*         THIS LAYOUT WILL NEVER USE BYTES 149 AND 150 UNLESS   * 00058000
000590*         THE PROGRAMS(S) AND EDI ARE CHANGED. PLUS THE CONSOL- * 00059000
000600*         IDATOR USES BYTE 147 FOR THEIR END OF RECORD BEFORE   * 00060000
000700*         THEY WRAP THE FILE WITH EDI RCDS SO 147 CAN NOT BE    * 00070000
000800*         USED EITHER.                                          * 00080000
000900*    RECORD LENGTH:  300                                        * 00090006
001000*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD014   * 00100000
001100***************************************************************** 00110000
001200* NOTE: THE RECORD LENGTH WAS INCREASED FROM 150 TO 300 BYTES   * 00120006
001300*        IN 4/2000. THIS IS SO KOHLS CAN ADD ENT-ID AND FILE-ID * 00130006
001400*        PRESENTLY, AND POSSIBLY OTHER FIELDS IN THE FUTURE     * 00140006
001500***************************************************************** 00150006
011200* ESTIMATED TRIP  (VESSEL, AIR, MOTOR).                         * 01120000
011300* THE DATE ON WHICH THE CARRIER IS EXPECTED TO DEPART.          * 01130000
011600* EDL AND EDD RECORD TYPES ARE SENT TOGETHER AS A SET.          * 01160000
011800***************************************************************** 01180000
011900 01  TR014-REC-TYP-EDD.                                           01190000
012000     05 TR014-EDD-REC-KEY.                                        01200000
012800        10 TR014-EDD-TRN-TYP            PIC X(01).                01280000
012900           88 TR014-EDD-TRN-TYP-ADD                VALUE 'A'.     01290000
013000           88 TR014-EDD-TRN-TYP-CHG                VALUE 'C'.     01300000
013100           88 TR014-EDD-TRN-TYP-DEL                VALUE 'D'.     01310000
013101        10 TR014-EDD-REC-TYP-CDE        PIC X(06).                01310100
013102           88 TR014-EDD-REC-TYP-CDE-EDD            VALUE 'EDD   '.01310200
013103        10 TR014-EDD-SEQ-NBR            PIC X(02).                01310300
013104           88 TR014-EDD-SEQ-NBR-10                 VALUE '10'.    01310400
013105        10 TR014-EDD-3RD-PARTY-CDE      PIC X(06).                01310500
013106           88 TR014-EDD-3RD-PARTY-CDE-EI           VALUE '      '.01310600
013400        10 TR014-EDD-PO-NBR             PIC 9(09).                01340000
013500        10 TR014-EDD-PO-NBR-X REDEFINES                           01350000
013501           TR014-EDD-PO-NBR             PIC X(09).                01350100
013502        10 TR014-EDD-EXTL-REF-NBR       PIC X(15).                01350200
013600        10 TR014-EDD-PO-BKG-DELY-DTE    PIC X(08).                01360000
013700        10 TR014-EDD-PO-BKG-DELY-TM     PIC X(04).                01370000
013701        10 TR014-EDD-ORGN-SHPD-FR-CDE   PIC X(03).                01370100
013702           88 TR014-EDD-ORGN-SHPD-FR-CFS         VALUE 'CFS'.     01370200
013703           88 TR014-EDD-ORGN-SHPD-FR-CY          VALUE 'CY '.     01370300
014000        10 TR014-EDD-IMPRT-TRIP-ID      PIC X(10).                01400000
014100        10 TR014-EDD-CARR-SCAC-ID       PIC X(04).                01410000
014500     05 TR014-EDD-IMPRT-VEH-NM          PIC X(25).                01450005
014600     05 TR014-EDD-POE-DELY-DTE          PIC X(08).                01460000
014700     05 TR014-EDD-POE-DELY-TM           PIC X(04).                01470000
014800     05 TR014-EDD-DPRTR-DTE             PIC X(08).                01480000
014900     05 TR014-EDD-DPRTR-TM              PIC X(04).                01490000
015000     05 TR014-EDD-FOB-CDE               PIC X(05).                01500000
015100     05 TR014-EDD-DEST-POE-CDE          PIC X(04).                01510000
015200     05 TR014-EDD-TRIP-TYP-CDE          PIC X(01).                01520000
015300        88 TR014-EDD-TRIP-TYP-CDE-AIR              VALUE 'A'.     01530000
015400        88 TR014-EDD-TRIP-TYP-CDE-MOTOR            VALUE 'M'.     01540000
015500        88 TR014-EDD-TRIP-TYP-CDE-OCEAN            VALUE 'O'.     01550000
015510     05 TR014-EDD-EST-LBD-NM            PIC X(18).                01551002
015600     05 FILLER                          PIC X(02).                01560002
015700     05 TR014-EDD-CONSOL-END            PIC X(01).                01570000
015800     05 TR014-EDD-EDI-SEG-END           PIC X(01).                01580000
015900     05 TR014-EDD-EDI                   PIC X(01).                01590000
015901     05 TR014-EDD-FILE-ID               PIC X(09).                01590107
015910     05 TR014-EDD-ENT-ID                PIC 9(09).                01591007
015920     05 FILLER                          PIC X(132).               01592009
016000*                                                                 01600000
016100***************************************************************** 01610000
016200* ESTIMATED TRIP (VESSEL, AIR, MOTOR).                          * 01620000
016300* THE REASON THE PURCHASE ORDER NEEDED TO BE RE-BOOKED ON A     * 01630000
016400* DIFFERENT VOYAGE.  IF NOT RE-BOOKED AN RESRSN RECORD WON'T    * 01640008
016500* BE TRANSMITTED.                                               * 01650000
016900***************************************************************** 01690000
017000 01  TR014-REC-TYP-EDDRSN REDEFINES TR014-REC-TYP-EDD.            01700000
017100     05 TR014-EDDRSN-REC-KEY.                                     01710000
017900        10 TR014-EDDRSN-TRN-TYP         PIC X(01).                01790000
018000           88 TR014-EDDRSN-TRN-TYP-ADD             VALUE 'A'.     01800000
018100           88 TR014-EDDRSN-TRN-TYP-CHG             VALUE 'C'.     01810000
018200           88 TR014-EDDRSN-TRN-TYP-DEL             VALUE 'D'.     01820000
018201        10 TR014-EDDRSN-REC-TYP-CDE     PIC X(06).                01820100
018202           88 TR014-EDDRSN-REC-TYP-CD-EDDRSN     VALUE 'EDDRSN'.  01820200
018203        10 TR014-EDDRSN-SEQ-NBR         PIC X(02).                01820300
018204           88 TR014-EDDRSN-SEQ-NBR-11              VALUE '11'.    01820400
018205        10 TR014-EDDRSN-3RD-PARTY-CDE   PIC X(06).                01820500
018206           88 TR014-EDDRSN-3RD-PARTY-CDE-EI        VALUE '      '.01820600
018500        10 TR014-EDDRSN-PO-NBR          PIC 9(09).                01850000
018600        10 TR014-EDDRSN-PO-NBR-X REDEFINES                        01860000
018601           TR014-EDDRSN-PO-NBR          PIC X(09).                01860100
018602        10 TR014-EDDRSN-EXTL-REF-NBR    PIC X(15).                01860200
018700        10 TR014-EDDRSN-PO-BKG-DELY-DTE PIC X(08).                01870000
018800        10 TR014-EDDRSN-PO-BKG-DELY-TM  PIC X(04).                01880000
018801        10 TR014-EDDRSN-ORGN-SHPD-FR-CDE PIC X(03).               01880100
018802           88 TR014-EDDRSN-ORGN-SHPD-FR-CFS         VALUE 'CFS'.  01880200
018803           88 TR014-EDDRSN-ORGN-SHPD-FR-CY          VALUE 'CY '.  01880300
019100        10 TR014-EDDRSN-IMPRT-TRIP-ID   PIC X(10).                01910000
019200        10 TR014-EDDRSN-CARR-SCAC-ID    PIC X(04).                01920000
019300     05 TR014-EDDRSN-POE-DELY-DTE       PIC X(08).                01930000
019400     05 TR014-EDDRSN-POE-DELY-TM        PIC X(04).                01940000
019500     05 TR014-EDDRSN-DPRTR-DTE          PIC X(08).                01950000
019600     05 TR014-EDDRSN-DPRTR-TM           PIC X(04).                01960000
019700     05 TR014-EDDRSN-VOY-CHG-RSN-DESC   PIC X(30).                01970000
019800     05 FILLER                          PIC X(25).                01980000
019900     05 TR014-EDDRSN-CONSOL-END         PIC X(01).                01990000
020000     05 TR014-EDDRSN-EDI-SEG-END        PIC X(01).                02000000
020100     05 TR014-EDDRSN-EDI                PIC X(01).                02010000
020101     05 TR014-EDDRSN-FILE-ID            PIC X(09).                02010107
020102     05 TR014-EDDRSN-ENT-ID             PIC 9(09).                02010207
020103     05 FILLER                          PIC X(132).               02010309
020104*                                                                 02010400
020105***************************************************************** 02010500
020106* PRE-BOOKING -- ESTIMATED FOB DELIVERY DATE                    * 02010600
020107* FOR CARGO FORWARDERS SERVICE (CFS), THE DATE THE PURCHASE     * 02010700
020108* ORDER IS SCHEDULED TO BE DROPPED OFF AT THE CONSOLIDATOR BY   * 02010800
020109* THE FACTORY.                                                  * 02010900
020110* FOR CARRIER'S YARD (CY) SHIPMENTS, THE DATE THE PURCHASE      * 02011000
020111* ORDER IS SCHEDULED TO BE DROPPED OFF AT THE CARRIER'S YARD BY * 02011100
020112* THE FACTORY.                                                  * 02011200
020113***************************************************************** 02011300
020114 01  TR014-REC-TYP-EDL REDEFINES TR014-REC-TYP-EDDRSN.            02011400
020115     05 TR014-EDL-REC-KEY.                                        02011500
020116        10 TR014-EDL-TRN-TYP            PIC X(01).                02011600
020117           88 TR014-EDL-TRN-TYP-ADD              VALUE 'A'.       02011700
020118           88 TR014-EDL-TRN-TYP-CHG              VALUE 'C'.       02011800
020119           88 TR014-EDL-TRN-TYP-DEL              VALUE 'D'.       02011900
020120        10 TR014-EDL-REC-TYP-CDE        PIC X(06).                02012000
020121           88 TR014-EDL-REC-TYP-CDE-EDL          VALUE 'EDL   '.  02012100
020122        10 TR014-EDL-SEQ-NBR            PIC X(02).                02012200
020123           88 TR014-EDL-SEQ-NBR-20               VALUE '20'.      02012300
020124        10 TR014-EDL-3RD-PARTY-CDE      PIC X(06).                02012400
020125           88 TR014-EDL-3RD-PARTY-CDE-EI         VALUE '      '.  02012500
020126        10 TR014-EDL-PO-NBR             PIC 9(09).                02012600
020127        10 TR014-EDL-PO-NBR-X REDEFINES                           02012700
020128           TR014-EDL-PO-NBR             PIC X(09).                02012800
020129        10 TR014-EDL-EXTL-REF-NBR       PIC X(15).                02012900
020130        10 TR014-EDL-PO-BKG-DELY-DTE    PIC X(08).                02013000
020131        10 TR014-EDL-PO-BKG-DELY-TM     PIC X(04).                02013100
020132        10 TR014-EDL-ORGN-SHPD-FR-CDE   PIC X(03).                02013200
020133           88 TR014-EDL-ORGN-SHPD-FR-CFS         VALUE 'CFS'.     02013300
020134           88 TR014-EDL-ORGN-SHPD-FR-CY          VALUE 'CY '.     02013400
020135     05 TR014-EDL-PROD-FCTRY-NM         PIC X(35).                02013500
020136     05 TR014-EDL-C-O-PROD-CDE          PIC X(03).                02013600
020137     05 TR014-EDL-PO-CART-CNT           PIC 9(09).                02013700
020138     05 TR014-EDL-PO-CART-CNT-X REDEFINES                         02013800
020139        TR014-EDL-PO-CART-CNT           PIC X(09).                02013900
020140     05 TR014-EDL-PO-UNT-QTY            PIC 9(09).                02014000
020141     05 TR014-EDL-PO-UNT-QTY-X REDEFINES                          02014100
020142        TR014-EDL-PO-UNT-QTY            PIC X(09).                02014200
020143     05 TR014-EDL-PO-CBMT-QTY           PIC 9(07)V99.             02014300
020150     05 TR014-EDL-PO-CBMT-QTY-X REDEFINES                         02015000
020151        TR014-EDL-PO-CBMT-QTY           PIC X(09).                02015100
020152     05 TR014-EDL-PO-WT-KGRM-QTY        PIC 9(09).                02015200
020153     05 TR014-EDL-PO-WT-KGRM-QTY-X REDEFINES                      02015300
020154        TR014-EDL-PO-WT-KGRM-QTY        PIC X(09).                02015400
020155     05 TR014-EDL-CONSOL-SCAC-ID        PIC X(04).                02015500
020156     05 FILLER                          PIC X(15).                02015600
020157     05 TR014-EDL-CONSOL-END            PIC X(01).                02015700
020158     05 TR014-EDL-EDI-SEG-END           PIC X(01).                02015800
020159     05 TR014-EDL-EDI                   PIC X(01).                02015900
020160     05 TR014-EDL-FILE-ID               PIC X(09).                02016007
020161     05 TR014-EDL-ENT-ID                PIC 9(09).                02016107
020162     05 FILLER                          PIC X(132).               02016209
020163*                                                                 02016307
020164***************************************************************** 02016400
020165* PRE-BOOKING  --ESTIMATED FOB DELIVERY DATE.                   * 02016500
020166* VENDOR STYLE RECORD.                                          * 02016600
020167* THIS SEGMENT IS REPEATED FOR EACH VENDOR STYLE.               * 02016700
020168***************************************************************** 02016800
020169 01  TR014-REC-TYP-EDLVS REDEFINES TR014-REC-TYP-EDL.             02016900
020170     05 TR014-EDLVS-REC-KEY.                                      02017000
020171        10 TR014-EDLVS-TRN-TYP          PIC X(01).                02017100
020172           88 TR014-EDLVS-TRN-TYP-ADD              VALUE 'A'.     02017200
020173           88 TR014-EDLVS-TRN-TYP-CHG              VALUE 'C'.     02017300
020174           88 TR014-EDLVS-TRN-TYP-DEL              VALUE 'D'.     02017400
020175        10 TR014-EDLVS-REC-TYP-CDE      PIC X(06).                02017500
020176           88 TR014-EDLVS-REC-TYP-CDE-EDLVS        VALUE 'EDLVS '.02017600
020177        10 TR014-EDLVS-SEQ-NBR          PIC X(02).                02017700
020178           88 TR014-EDLVS-SEQ-NBR-21               VALUE '21'.    02017800
020179        10 TR014-EDLVS-3RD-PARTY-CDE    PIC X(06).                02017900
020180           88 TR014-EDLVS-3RD-PARTY-CDE-EI         VALUE '      '.02018000
020181        10 TR014-EDLVS-PO-NBR           PIC 9(09).                02018100
020182        10 TR014-EDLVS-PO-NBR-X REDEFINES                         02018200
020183           TR014-EDLVS-PO-NBR           PIC X(09).                02018300
020184        10 TR014-EDLVS-EXTL-REF-NBR     PIC X(15).                02018400
020185        10 TR014-EDLVS-PO-BKG-DELY-DTE  PIC X(08).                02018500
020186        10 TR014-EDLVS-PO-BKG-DELY-TM   PIC X(04).                02018600
020187        10 TR014-EDLVS-ORGN-SHPD-FR-CDE PIC X(03).                02018700
020188           88 TR014-EDLVS-ORGN-SHPD-FR-CFS         VALUE 'CFS'.   02018800
020189           88 TR014-EDLVS-ORGN-SHPD-FR-CY          VALUE 'CY '.   02018900
020190     05 TR014-EDLVS-VS-NBR              PIC X(20).                02019000
020191     05 TR014-EDLVS-VS-CART-CNT         PIC 9(09).                02019100
020192     05 TR014-EDLVS-VS-CART-CNT-X REDEFINES                       02019200
020193        TR014-EDLVS-VS-CART-CNT         PIC X(09).                02019300
020200     05 TR014-EDLVS-VS-UNT-QTY          PIC 9(09).                02020000
020300     05 TR014-EDLVS-VS-UNT-QTY-X REDEFINES                        02030000
020301        TR014-EDLVS-VS-UNT-QTY          PIC X(09).                02030100
020302     05 TR014-EDLVS-VS-CBMT-QTY         PIC 9(07)V99.             02030200
020303     05 TR014-EDLVS-VS-CBMT-QTY-X REDEFINES                       02030300
020304        TR014-EDLVS-VS-CBMT-QTY         PIC X(09).                02030400
020305     05 TR014-EDLVS-VS-WT-KGRM-QTY      PIC 9(09).                02030500
020306     05 TR014-EDLVS-VS-WT-KGRM-QTY-X REDEFINES                    02030600
020307        TR014-EDLVS-VS-WT-KGRM-QTY      PIC X(09).                02030700
020308     05 FILLER                          PIC X(37).                02030800
020309     05 TR014-EDLVS-CONSOL-END          PIC X(01).                02030900
020310     05 TR014-EDLVS-EDI-SEG-END         PIC X(01).                02031000
020311     05 TR014-EDLVS-EDI                 PIC X(01).                02031100
020312     05 TR014-EDLVS-FILE-ID             PIC X(09).                02031207
020313     05 TR014-EDLVS-ENT-ID              PIC 9(09).                02031307
020314     05 FILLER                          PIC X(132).               02031409
020315*                                                                 02031500
020316***************************************************************** 02031600
020317* PRE-BOOKING  --ESTIMATED FOB DELIVERY DATE.                   * 02031700
020318* UPC RECORD.                                                   * 02031800
020319* THIS SEGMENT IS REPEATED FOR EACH UPC.                        * 02031900
020320***************************************************************** 02032000
020321 01  TR014-REC-TYP-EDLUPC REDEFINES TR014-REC-TYP-EDLVS.          02032100
020322     05 TR014-EDLUPC-REC-KEY.                                     02032200
020323        10 TR014-EDLUPC-TRN-TYP         PIC X(01).                02032300
020324           88 TR014-EDLUPC-TRN-TYP-ADD             VALUE 'A'.     02032400
020325           88 TR014-EDLUPC-TRN-TYP-CHG             VALUE 'C'.     02032500
020326           88 TR014-EDLUPC-TRN-TYP-DEL             VALUE 'D'.     02032600
020327        10 TR014-EDLUPC-REC-TYP-CDE     PIC X(06).                02032700
020328           88 TR014-EDLUPC-REC-TYP-CD-EDLUPC       VALUE 'EDLUPC'.02032800
020329        10 TR014-EDLUPC-SEQ-NBR         PIC X(02).                02032900
020330           88 TR014-EDLUPC-SEQ-NBR-22              VALUE '22'.    02033000
020331        10 TR014-EDLUPC-3RD-PARTY-CDE   PIC X(06).                02033100
020332           88 TR014-EDLUPC-3RD-PARTY-CDE-EI        VALUE '      '.02033200
020333        10 TR014-EDLUPC-PO-NBR          PIC 9(09).                02033300
020340        10 TR014-EDLUPC-PO-NBR-X REDEFINES                        02034000
020341           TR014-EDLUPC-PO-NBR          PIC X(09).                02034100
020342        10 TR014-EDLUPC-EXTL-REF-NBR    PIC X(15).                02034200
020343        10 TR014-EDLUPC-PO-BKG-DELY-DTE PIC X(08).                02034300
020344        10 TR014-EDLUPC-PO-BKG-DELY-TM  PIC X(04).                02034400
020345        10 TR014-EDLUPC-ORGN-SHPD-FR-CDE PIC X(03).               02034500
020346           88 TR014-EDLUPC-ORGN-SHPD-FR-CFS         VALUE 'CFS'.  02034600
020347           88 TR014-EDLUPC-ORGN-SHPD-FR-CY          VALUE 'CY '.  02034700
020348     05 TR014-EDLUPC-VS-NBR             PIC X(20).                02034800
020349     05 TR014-EDLUPC-UPC-NBR            PIC 9(15).                02034900
020350     05 TR014-EDLUPC-UPC-NBR-X REDEFINES                          02035000
020351        TR014-EDLUPC-UPC-NBR            PIC X(15).                02035100
020352     05 TR014-EDLUPC-UPC-CART-CNT       PIC 9(09).                02035200
020353     05 TR014-EDLUPC-UPC-CART-CNT-X REDEFINES                     02035300
020354        TR014-EDLUPC-UPC-CART-CNT       PIC X(09).                02035400
020355     05 TR014-EDLUPC-UPC-UNT-QTY        PIC 9(09).                02035500
020356     05 TR014-EDLUPC-UPC-UNT-QTY-X REDEFINES                      02035600
020357        TR014-EDLUPC-UPC-UNT-QTY        PIC X(09).                02035700
020358     05 TR014-EDLUPC-UPC-CBMT-QTY       PIC 9(07)V99.             02035800
020359     05 TR014-EDLUPC-UPC-CBMT-QTY-X REDEFINES                     02035900
020360        TR014-EDLUPC-UPC-CBMT-QTY       PIC X(09).                02036000
020370     05 TR014-EDLUPC-UPC-WT-KGRM-QTY    PIC 9(09).                02037000
020380     05 TR014-EDLUPC-UPC-WT-KGRM-QTY-X REDEFINES                  02038000
020381        TR014-EDLUPC-UPC-WT-KGRM-QTY    PIC X(09).                02038100
020382     05 FILLER                          PIC X(22).                02038210
020383     05 TR014-EDLUPC-CONSOL-END         PIC X(01).                02038300
020384     05 TR014-EDLUPC-EDI-SEG-END        PIC X(01).                02038400
020385     05 TR014-EDLUPC-EDI                PIC X(01).                02038500
020386     05 TR014-EDLUPC-FILE-ID            PIC X(09).                02038607
020387     05 TR014-EDLUPC-ENT-ID             PIC 9(09).                02038707
020388     05 FILLER                          PIC X(132).               02038809
