       01  TR043-CONTAINER-PO-TABLE.                                    00010007
           05  TR043-ACTL-POE-DELY-CDE       PIC X(01)  VALUE SPACES.   00020007
           05  FILLER                        PIC X(01)  VALUE '|'.      00030007
           05  TR043-BKR-FRGT-RLSE-CDE       PIC X(01)  VALUE SPACES.   00040007
           05  FILLER                        PIC X(01)  VALUE '|'.      00050007
           05  TR043-CONTNR-ID               PIC X(12)  VALUE SPACES.   00060007
           05  FILLER                        PIC X(01)  VALUE '|'.      00070007
           05  TR043-CONTNR-PU-CDE           PIC X(01)  VALUE SPACES.   00080007
           05  FILLER                        PIC X(01)  VALUE '|'.      00090007
           05  TR043-CONTNR-SEQ-NBR          PIC 9(06)  VALUE ZERO.     00100007
           05  FILLER                        PIC X(01)  VALUE '|'.      00110007
           05  TR043-CRE-TMST                PIC X(26)  VALUE SPACES.   00120007
           05  FILLER                        PIC X(01)  VALUE '|'.      00130007
           05  TR043-CSTM-ENTR-ID            PIC X(12)  VALUE SPACES.   00140007
           05  FILLER                        PIC X(01)  VALUE '|'.      00150007
           05  TR043-DCONSLR-RET-CDE         PIC X(01)  VALUE SPACES.   00160007
           05  FILLER                        PIC X(01)  VALUE '|'.      00170007
           05  TR043-DO-RCVD-CDE             PIC X(01)  VALUE SPACES.   00180007
           05  FILLER                        PIC X(01)  VALUE '|'.      00190007
           05  TR043-DOC-RCVD-ORGN-TMST      PIC X(26)  VALUE SPACES.   00200007
           05  FILLER                        PIC X(01)  VALUE '|'.      00210007
           05  TR043-DVN-CDE                 PIC X(01)  VALUE SPACES.   00220007
           05  FILLER                        PIC X(01)  VALUE '|'.      00230007
           05  TR043-EXTL-REF-NBR            PIC X(15)  VALUE SPACES.   00240007
           05  FILLER                        PIC X(01)  VALUE '|'.      00250007
           05  TR043-HSE-BOL-NBR             PIC X(30)  VALUE SPACES.   00260007
           05  FILLER                        PIC X(01)  VALUE '|'.      00270007
           05  TR043-LAST-UPD-TMST           PIC X(26)  VALUE SPACES.   00280007
           05  FILLER                        PIC X(01)  VALUE '|'.      00290007
           05  TR043-MSTR-BOL-NBR            PIC X(30)  VALUE SPACES.   00300007
           05  FILLER                        PIC X(01)  VALUE '|'.      00310007
           05  TR043-PO-C-O-PROD-CDE         PIC X(03)  VALUE SPACES.   00320007
           05  FILLER                        PIC X(01)  VALUE '|'.      00330007
           05  TR043-PO-CART-CNT             PIC 9(06)  VALUE ZERO.     00340007
           05  FILLER                        PIC X(01)  VALUE '|'.      00350007
           05  TR043-PO-CBMT-QTY             PIC 9(09)V99 VALUE ZERO.   00360007
           05  FILLER                        PIC X(01)  VALUE '|'.      00370007
           05  TR043-PO-NBR                  PIC 9(09)  VALUE ZERO.     00380007
           05  FILLER                        PIC X(01)  VALUE '|'.      00390007
           05  TR043-PO-RCVD-DELY-TMST       PIC X(26)  VALUE SPACES.   00400007
           05  FILLER                        PIC X(01)  VALUE '|'.      00410007
           05  TR043-PO-UNT-QTY              PIC 9(09)  VALUE ZERO.     00420007
           05  FILLER                        PIC X(01)  VALUE '|'.      00430007
           05  TR043-PO-WT-KGRM-QTY          PIC 9(09)  VALUE ZERO.     00440007
           05  FILLER                        PIC X(01)  VALUE '|'.      00450007
           05  TR043-SPLT-XMIT-CDE           PIC X(01)  VALUE SPACES.   00460007
           05  FILLER                        PIC X(01)  VALUE '|'.      00470007
           05  TR043-DCONSLR-ACTL-DTE        PIC X(10)  VALUE SPACES.   00480007
           05  FILLER                        PIC X(01)  VALUE '|'.      00490007
           05  TR043-TIMESTAMP               PIC X(26)  VALUE SPACES.   00500007
P47386     05  FILLER                        PIC X(01)  VALUE '|'.      00510007
P47386     05  TR043-BKR-FRGT-RLSE-TMST      PIC X(26)  VALUE SPACES.   00520007
P47386     05  FILLER                        PIC X(01)  VALUE '|'.      00530007
P47386     05  TR043-CONTNR-PU-TMST          PIC X(26)  VALUE SPACES.   00540007
P47386     05  FILLER                        PIC X(26)  VALUE SPACES.   00550007
