       01  TR044-CONTAINER-TABLE.                                               
           05  TR044-ACTL-DEST-POE-CDE          PIC X(04)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-ACTL-LBD-NM                PIC X(30)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-ACTL-LBD-TMST              PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-ACTL-POE-DELY-TMST         PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-BKR-FRGT-RLSE-TMST         PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-CART-CNT                   PIC 9(09)  VALUE ZERO.          
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-CBMT-QTY                   PIC 9(09)V99 VALUE ZERO.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-CONSLR-SCAC-ID             PIC X(04)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-CONTNR-ID                  PIC X(12)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-CONTNR-PU-TMST             PIC 9(06)  VALUE ZERO.          
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-CONTNR-SEQ-NBR             PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-CRE-TMST                   PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-DCONSLR-RET-TMST           PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-DCONSLR-SCAC-ID            PIC X(04)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-DO-RCVD-TMST               PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-DVN-TMST                   PIC 9(26)  VALUE ZERO.          
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-EST-LBD-NM                 PIC X(30)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-EST-LBD-TMST               PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-CARR-SCAC-ID           PIC X(04)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-DPRTR-TMST             PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-FOB-CDE                PIC X(05)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-IMPRT-TRIP-ID          PIC X(10)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-IMPRT-VEH-NM           PIC X(25)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-TRIP-TYP-CDE           PIC X(01)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-LAST-UPD-TMST              PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-CARR-SCAC-ID           PIC X(04)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-DPRTR-TMST             PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-FOB-CDE                PIC X(05)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-IMPRT-VEH-NM           PIC X(25)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-POE-DELY-TMST          PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-TRIP-TYP-CDE           PIC X(01)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-ORGN-SHPD-FR-CDE           PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-ORGN-SHPD-TO-CDE           PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-SIZE-CDE                   PIC X(05)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-UNT-QTY                    PIC 9(09)  VALUE ZERO.          
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-WT-KGRM-QTY                PIC 9(09)  VALUE ZERO.          
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-DEST-POE-CDE           PIC X(04)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-POE-CDE                    PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-IMPRT-TRIP-ID          PIC X(10)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FOB-CDE                    PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-POL-CDE                PIC X(05)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-POL-IMPRT-ORGN-CDE     PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-POR-CDE                PIC X(05)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-FDR-POR-IMPRT-ORGN-CDE     PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-POL-CDE                PIC X(05)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-POL-IMPRT-ORGN-CDE     PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-POR-CDE                PIC X(05)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-MOM-POR-IMPRT-ORGN-CDE     PIC X(03)  VALUE SPACES.        
           05  FILLER                           PIC X(01)  VALUE '|'.           
           05  TR044-TIMESTAMP                  PIC X(26)  VALUE SPACES.        
           05  FILLER                           PIC X(56)  VALUE SPACES.        
