000100***************************************************************** 00010000
000200*    COPYBOOK NAME:  TRRD072                                    * 00020000
000300*    RECORD PURPOSE: THIS RECORD LAYOUT IS THE LAYOUT FOR THE   * 00030000
000400*                    SHIPMENTS NOT MARKED COMPLETE WHEN THE     * 00040000
000410*                    TRIP IS ET.                                * 00041000
000420*    RECORD LENGTH:  200                                        * 00042000
000430*    RECORD FORMAT:  SEQUENTIAL                                 * 00043000
000440***************************************************************** 00044000
000450                                                                  00045000
000460 01  TR072-DATA-RECORD.                                           00046000
000470     05  TR072-INTR-TRIP-ID               PIC  S9(09) COMP.       00047000
000480     05  TR072-EXT-SHP-ID                 PIC   X(20).            00048000
000490     05  TR072-DWNLD-TMST                 PIC   X(26).            00049000
000500     05  TR072-DEST-LOC-NBR               PIC  S9(04) COMP.       00050000
000600     05  TR072-DWNLD-CDE                  PIC   X(01).            00060000
000700     05  TR072-TRIP-STATUS-CDE            PIC   X(02).            00070000
000800     05  TR072-STATUS-DTE                 PIC   X(10).            00080000
000900     05  TR072-STATUS-TME                 PIC   X(08).            00090000
001000     05  TR072-TMST-SW                    PIC   X(01).            00100000
001200     05  FILLER                           PIC   X(26).            00120000
