000100 01  TR270-CONTNR-PO-MIN-DATES.                                           
000200     05  TR270-PO-NBR                  PIC 9(09)  VALUE ZEROS.            
000400     05  TR270-MOM-DPRTR-DTE           PIC X(10)  VALUE SPACES.           
000600     05  TR270-MOM-POE-DELY-DTE        PIC X(10)  VALUE SPACES.           
000800     05  TR270-PO-BKG-DELY-DTE         PIC X(10)  VALUE SPACES.           
001000     05  TR270-PO-RCVD-DELY-DTE        PIC X(10)  VALUE SPACES.           
001200     05  TR270-CSTMS-FILD-DTE          PIC X(10)  VALUE SPACES.           
