000100***************************************************************** 00010000
000200*    RECORD PURPOSE: ERROR REPORT EXTRACT FILE FOR IMPORT       * 00020003
000300*                    DECONSOLIDATION RETRANSMISSION USED IN     * 00030003
000400*                    TRKRP006.                                  * 00040003
000410*  ALL DATES EXCEPT PROCESS-DATE ARE IN MMDDYY FORMAT.          * 00040003
000420*  PROCESS-DATE HAS FORMAT YYYYMMDD FORMAT.                     * 00040003
000500*    RECORD LENGTH:  254                                        * 00050002
000600*    RECORD FORMAT:  SEQUENTIAL                TRRD006          * 00060003
000700***************************************************************** 00070000
000800                                                                  00080000
000900 01  TR006-RECORD.                                                00082901
001000     05  TR006-REPORT-TYPE                PIC X(01)  VALUE SPACE. 00083004
001100         88  TR006-XMIT-RPT                          VALUE 'T'.   00083104
001200         88  TR006-REXMIT-RPT                        VALUE 'R'.   00083204
001210     05  TR006-ERROR-TYPE                 PIC X(01)  VALUE SPACE.         
001220         88  TR006-ERROR-TYPE-ERROR                  VALUE 'E'.           
001230         88  TR006-ERROR-TYPE-MISS-SPLT              VALUE 'S'.           
001300     05  TR006-PROCESS-DATE.                                              
001310         10  TR006-PROCESS-YYYY           PIC X(04)  VALUE SPACE.         
001320         10  TR006-PROCESS-MM             PIC X(02)  VALUE SPACE.         
001330         10  TR006-PROCESS-DD             PIC X(02)  VALUE SPACE.         
001400     05  TR006-DEPT-NBR                   PIC 9(04)  VALUE ZERO.          
001500     05  TR006-PO-NBR                     PIC 9(08)  VALUE ZERO.          
001600     05  TR006-UPC-NBR                    PIC 9(15)  VALUE ZERO.          
001700     05  TR006-ETA-DATE                   PIC X(08)  VALUE SPACE.         
001710*  FORMAT IS YYYYMMDD                                                     
           05  TR006-TRIP-TYPE                  PIC X(02)  VALUE SPACE.         
001900     05  TR006-VESSEL-NAME                PIC X(10)  VALUE SPACE.         
002100     05  TR006-CONTAINER-NUMBER           PIC X(22)  VALUE SPACE.         
002200     05  TR006-DONT-SHIP-BEFORE-DATE      PIC X(06)  VALUE SPACE.         
002210     05  TR006-PACK-ID                    PIC 9(08)  VALUE ZERO.          
002220     05  TR006-PKGNG-CDE                  PIC X(01)  VALUE SPACE.         
002300     05  TR006-ERROR-MSG                  PIC X(32)  VALUE SPACE.         
002310     05  TR006-PGM-NAME                   PIC X(08)  VALUE SPACE.         
009000     05  TR006-SKU                        PIC 9(08)  VALUE ZERO.          
002400     05  FILLER                           PIC X(112) VALUE SPACE.         
