000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RECORD LAYOUT FOR CONTAINER RULES DATA.    * 00020001
000400*    RECORD LENGTH:  500                                        * 00040009
000500*    RECORD FORMAT:  SEQUENTIAL    DATES:TMST FORMAT  TRRD265   * 00050005
000501***************************************************************** 00050100
000510 01  TR265-CONTNR-RULES-REC.                                      00051002
           05 TR265-COMMON-FIELDS1.                                     00052025
000530       07 TR265-CONTNR-TRN-TYP            PIC X(01).              00053025
000540          88 TR265-CONTNR-TRN-TYP-ADD                VALUE 'A'.   00054025
000550          88 TR265-CONTNR-TRN-TYP-CHG                VALUE 'C'.   00055025
000560          88 TR265-CONTNR-TRN-TYP-DEL                VALUE 'D'.   00056025
000900       07 TR265-CONTNR-ID                 PIC X(12).              00090025
001000       07 TR265-CONTNR-SEQ-NBR-PREV       PIC S9(4) COMP.         00100025
001010       07 TR265-CONTNR-SEQ-NBR-CUR        PIC S9(4) COMP.         00101025
001100       07 TR265-CONTNR-DPRTR-TMST-PREV    PIC X(26).              00110025
001110       07 TR265-CONTNR-DPRTR-TMST-CUR     PIC X(26).              00111025
001200       07 TR265-CONTNR-POE-DELY-TMST-PRV  PIC X(26).              00120025
001201       07 TR265-CONTNR-POE-DELY-TMST-CUR  PIC X(26).              00120125
001202       07 TR265-CONTNR-POE-CDE-PREV       PIC X(04).              00120225
001203       07 TR265-CONTNR-POE-CDE-CUR        PIC X(04).              00120325
001204       07 TR265-CONTNR-FOB-CDE-PREV       PIC X(05).              00120425
001205       07 TR265-CONTNR-FOB-CDE-CUR        PIC X(05).              00120525
001206       07 TR265-CONTNR-VEH-NM-PREV        PIC X(25).              00120625
001207       07 TR265-CONTNR-VEH-NM-CUR         PIC X(25).              00120725
001208       07 TR265-CONTNR-TRIP-ID-PREV       PIC X(10).              00120825
001209       07 TR265-CONTNR-TRIP-ID-CUR        PIC X(10).              00120925
001210       07 TR265-CONTNR-REC-SRC            PIC X(03).              00121025
001211          88 TR265-CONTNR-REC-SRC-CMN                VALUE 'CMN'. 00121125
001212          88 TR265-CONTNR-REC-SRC-CON                VALUE 'CON'. 00121225
001213       07 TR265-CONTNR-DVN-TMST           PIC X(26).              00121325
003417       07 TR265-CONTNR-FILE-ID            PIC X(09).              00341725
           05 FILL1                             PIC X(03).              00341826
           05 TR265-COMMON-FIELDS2.                                     00341925
003418       07 TR265-CONTNR-DAT-SRC-ENTID      PIC 9(09).              00342025
003423       07 TR265-CONTNR-SHIPT-ID           PIC S9(9) COMP.         00342325
003424       07 TR265-CONTNR-PO-UPD-IND         PIC X      VALUE 'N'.   00342425
003425          88 TR265-CONTNR-PO-UPD-YES                 VALUE 'Y'.   00342525
003426          88 TR265-CONTNR-PO-UPD-NO                  VALUE 'N'.   00342625
003427       07 TR265-CONTNR-TRN-SRCE           PIC X(03).              00342725
003428          88 TR265-CONTNR-TRN-SRCE-TRD               VALUE 'TRD'. 00342825
003429          88 TR265-CONTNR-TRN-SRCE-TRC               VALUE 'TRC'. 00342925
003430          88 TR265-CONTNR-TRN-SRCE-SHA               VALUE 'SHA'. 00343025
003431          88 TR265-CONTNR-TRN-SRCE-SHC               VALUE 'SHC'. 00343125
003432          88 TR265-CONTNR-TRN-SRCE-SHD               VALUE 'SHD'. 00343225
003433          88 TR265-CONTNR-TRN-SRCE-POA               VALUE 'POA'. 00343325
003434          88 TR265-CONTNR-TRN-SRCE-POC               VALUE 'POC'. 00343425
003435          88 TR265-CONTNR-TRN-SRCE-POD               VALUE 'POD'. 00343525
003436       07 TR265-CONTNR-CURRENT-TMST       PIC X(26).              00343625
003437       07 TR265-REPORT-REC-TYP            PIC X(03).              00343725
003438          88 TR265-REPORT-REC-TYP-DTL     VALUE 'DTL'.            00343825
003439          88 TR265-REPORT-REC-TYP-ERR     VALUE 'ERR'.            00343925
003440       07 TR265-ERROR-TEXT                PIC X(50).              00344025
003450       07 FILL2                           PIC X(154).             00345026
