000100***************************************************************** 00010000
000200*    TRRD075                                                    * 00020000
000210*    RECORD PURPOSE: RECORD LAYOUT USED FOR CLEANING UP OLD     * 00021000
000220*                    INBOUND TRIPS                              * 00022000
000230*    RECORD LENGTH:  125                                        * 00023000
000240***************************************************************** 00024000
000250* CONTAINER DATA.                                               * 00025000
000260***************************************************************** 00026000
000270 01  TR075-RECORD.                                                00027000
000280     05 TR075-TRIP-ID                PIC  S9(09) VALUE ZEROES.    00028000
000290     05 TR075-SHIPT-ID               PIC  S9(09) VALUE ZEROES.    00029000
000300     05 TR075-SHIPT-STATUS-CDE       PIC   X(29) VALUE SPACES.    00030000
000400     05 TR075-STATUS-DTE             PIC   X(10) VALUE SPACES.    00040000
000500     05 TR075-STATUS-TME             PIC   X(08) VALUE SPACES.    00050000
000510     05 TR075-NEW-STATUS-DTE         PIC   X(10) VALUE SPACES.    00051000
000520     05 FILLER                       PIC   X(25) VALUE SPACES.    00052000
