000100***************************************************************** 00010000
000200*    COPYBOOK NAME:  TRRD065                                    * 00020012
000300*    RECORD PURPOSE: THIS RECORD LAYOUT IS THE TRIP LAYOUT      * 00030008
000400*                    NEEDED AS INPUT TO TRKUP085.               * 00040012
000900*    RECORD LENGTH:  200                                        * 00080006
001000*    RECORD FORMAT:  SEQUENTIAL                                 * 00090000
000100***************************************************************** 00118000
001200                                                                  00119000
001300 01  TR065-DATA-RECORD.                                           00120012
001360     05  TR065-TRIP-ID                    PIC  9(09).             00130012
001810     05  TR065-VEH-NBR                    PIC  X(10).             00180013
001810     05  TR065-OWNR-SCAC-ID               PIC  X(04).             00181013
001810     05  TR065-OPER-UNT-ID                PIC  9(04).             00183012
001360     05  TR065-SHIP-ID                    PIC  9(09).             00183112
001810     05  FILLER                           PIC  X(170).            00183211
