000100***************************************************************** 00010000
000200*    RECORD PURPOSE: IMPORT VOYAGE EVENT DATA RECEIVED FROM THE * 00020000
000300*                    CUSTOMS BROKER.  FREIGHT MOVEMENT FROM     * 00030000
000400*                    ORIGIN TO DESTINATION. CALLED ARRIVAL.     * 00040000
000500*    RECORD LENGTH:  300                                        * 00050000
000600*    NOTE:THE RECORD COMING FROM THE CONSOLIDATOR CAN BE A MAX  * 00060000
000700*         OF 147 BYTES.  POSITION 148 IS USED BY SOME THIRD     * 00070000
000800*         PARTIES AS THEIR END OF RECORD INDICATOR. EDI USE ONE * 00080000
000900*         BYTE, 149, FOR THE SEGMENT END CHARACTER & 150 FOR ?. * 00090000
001000*         SO THIS LAYOUT WILL NEVER USE BYTES 148, 149, AND 150 * 00100000
001100*         UNLESS THE PROGRAM(S) AND EDI ARE CHANGED.            * 00110000
001200*    RECORD FORMAT:  SEQUENTIAL    DATES-CCYYMMDD     TRRD016   * 00120000
001300***************************************************************** 00130000
001400* DATE THE CARRIER IS SCHEDULED TO ARRIVE AT THE PORT OF ENTRY. * 00140000
001500* DATE TO THE FINAL DESTINATION IF LAND BRIDGED (INLAND CITY).  * 00150000
001600* (VESSEL, AIR, OR MOTOR).                                      * 00160000
001700* ETA UPDATE AFTER THE VESSEL SAILS.  SENT TO INDICATE WHEN     * 00170000
001800* THERE IS A CHANGE TO THE VOYAGE ETA.                          * 00180000
001900***************************************************************** 00190000
002000 01  TR016-REC-TYP-ETA.                                           00200000
002100     05 TR016-ETA-REC-KEY.                                        00210000
002200        10 TR016-ETA-TRN-TYP            PIC X(01).                00220000
002300           88 TR016-ETA-TRN-TYP-ADD                VALUE 'A'.     00230000
002400           88 TR016-ETA-TRN-TYP-CHG                VALUE 'C'.     00240000
002500           88 TR016-ETA-TRN-TYP-DEL                VALUE 'D'.     00250000
002600        10 TR016-ETA-REC-TYP-CDE        PIC X(06).                00260000
002700           88 TR016-ETA-REC-TYP-CDE-ETA            VALUE 'ETA   '.00270000
002800        10 TR016-ETA-SEQ-NBR            PIC X(02).                00280000
002900           88 TR016-ETA-SEQ-NBR-10                 VALUE '10'.    00290000
003000        10 TR016-ETA-3RD-PARTY-CDE      PIC X(06).                00300000
003100           88 TR016-ETA-3RD-PARTY-CDE-EI           VALUE '      '.00310000
003200        10 TR016-ETA-PO-NBR             PIC 9(09).                00320000
003300        10 TR016-ETA-EXTL-REF-NBR       PIC X(15).                00330000
003400     05 TR016-ETA-TRIP-TYP-CDE-MOM      PIC X(01).                00340000
003500        88 TR016-ETA-TRIP-TYP-MOM-AIR              VALUE 'A'.     00350000
003600        88 TR016-ETA-TRIP-TYP-MOM-MOTOR            VALUE 'M'.     00360000
003700        88 TR016-ETA-TRIP-TYP-MOM-OCEAN            VALUE 'O'.     00370000
003800     05 TR016-ETA-CARR-SCAC-ID          PIC X(04).                00380000
003900     05 TR016-ETA-IMPRT-TRIP-ID         PIC X(10).                00390000
004000     05 TR016-ETA-IMPRT-VEH-NM          PIC X(25).                00400000
004100     05 TR016-ETA-DEST-POE-CDE-MOM      PIC X(04).                00410000
004200     05 TR016-ETA-EST-POE-DELY-DTE      PIC X(08).                00420000
004300     05 TR016-ETA-EST-POE-DELY-TM       PIC X(04).                00430000
004400     05 TR016-ETA-EST-LBD-NM            PIC X(18).                00440000
004500     05 TR016-ETA-EST-LBD-DTE           PIC X(08).                00450000
004600     05 TR016-ETA-EST-LBD-TM            PIC X(04).                00460000
004700     05 FILLER                          PIC X(10).                00470000
004800** FOLLOWING 2 FIELDS ARE FOR KOHL'S INTERNAL PROCESSING ONLY **  00480000
004900     05 TR016-ETA-TURN-CRE-DTE          PIC X(08).                00490000
005000     05 TR016-ETA-TURN-CRE-TM           PIC X(04).                00500000
005100     05 TR016-ETA-CONSOL-END            PIC X(01).                00510000
005200     05 TR016-ETA-EDI-SEG-END           PIC X(01).                00520000
005300     05 TR016-ETA-EDI                   PIC X(01).                00530000
005301     05 TR016-ETA-FILE-ID               PIC X(09).                00530100
005302     05 TR016-ETA-ENT-ID                PIC 9(09).                00530200
005310     05 FILLER                          PIC X(132).               00531000
005400***************************************************************** 00540000
005500* DATE THE CARRIER ARRIVED AT THE PORT OF ENTRY.                * 00550000
005600* (VESSEL, AIR, OR MOTOR).                                      * 00560000
005700* ARRIVAL DATE TO THE PORT OF UNLOADING.  SENT AFTER THE VESSEL * 00570000
005800* ARRIVES AT THE PORT OF ENTRY.                                 * 00580000
005900***************************************************************** 00590000
006000 01  TR016-REC-TYP-ADU REDEFINES TR016-REC-TYP-ETA.               00600000
006100     05 TR016-ADU-REC-KEY.                                        00610000
006200        10 TR016-ADU-TRN-TYP            PIC X(01).                00620000
006300           88 TR016-ADU-TRN-TYP-ADD                VALUE 'A'.     00630000
006400           88 TR016-ADU-TRN-TYP-CHG                VALUE 'C'.     00640000
006500           88 TR016-ADU-TRN-TYP-DEL                VALUE 'D'.     00650000
006600        10 TR016-ADU-REC-TYP-CDE        PIC X(06).                00660000
006700           88 TR016-ADU-REC-TYP-CDE-ADU            VALUE 'ADU   '.00670000
006800        10 TR016-ADU-SEQ-NBR            PIC X(02).                00680000
006900           88 TR016-ADU-SEQ-NBR-20                 VALUE '20'.    00690000
007000        10 TR016-ADU-3RD-PARTY-CDE      PIC X(06).                00700000
007100           88 TR016-ADU-3RD-PARTY-CDE-EI           VALUE '      '.00710000
007200        10 TR016-ADU-PO-NBR             PIC 9(09).                00720000
007300        10 TR016-ADU-EXTL-REF-NBR       PIC X(15).                00730000
007400     05 TR016-ADU-TRIP-TYP-CDE-MOM      PIC X(01).                00740000
007500        88 TR016-ADU-TRIP-TYP-MOM-AIR              VALUE 'A'.     00750000
007600        88 TR016-ADU-TRIP-TYP-MOM-MOTOR            VALUE 'M'.     00760000
007700        88 TR016-ADU-TRIP-TYP-MOM-OCEAN            VALUE 'O'.     00770000
007800     05 TR016-ADU-CARR-SCAC-ID          PIC X(04).                00780000
007900     05 TR016-ADU-IMPRT-TRIP-ID         PIC X(10).                00790000
008000     05 TR016-ADU-IMPRT-VEH-NM          PIC X(25).                00800000
008100     05 TR016-ADU-ACTL-DEST-POE-CDE     PIC X(04).                00810000
008200     05 TR016-ADU-ACTL-POE-DELY-DTE     PIC X(08).                00820000
008300     05 TR016-ADU-ACTL-POE-DELY-TM      PIC X(04).                00830000
008400     05 FILLER                          PIC X(40).                00840000
008500** FOLLOWING 2 FIELDS ARE FOR KOHL'S INTERNAL PROCESSING ONLY **  00850000
008600     05 TR016-ADU-TURN-CRE-DTE          PIC X(08).                00860000
008700     05 TR016-ADU-TURN-CRE-TM           PIC X(04).                00870000
008800     05 TR016-ADU-CONSOL-END            PIC X(01).                00880000
008900     05 TR016-ADU-EDI-SEG-END           PIC X(01).                00890000
009000     05 TR016-ADU-EDI                   PIC X(01).                00900000
009010     05 TR016-ADU-FILE-ID               PIC X(09).                00901000
009020     05 TR016-ADU-ENT-ID                PIC 9(09).                00902000
009030     05 FILLER                          PIC X(132).               00903000
009100***************************************************************** 00910000
009200* DATE THE CARRIER ARRIVED AT THE PORT OF ENTRY.                * 00920000
009300* (VESSEL, AIR, OR MOTOR).                                      * 00930000
009400* ARRIVAL DATE TO THE PORT OF UNLOADING.  SENT AFTER THE VESSEL * 00940000
009500* ARRIVES AT THE PORT OF ENTRY.                                 * 00950000
009600* ADURD IS AN ADU FROM THE RECYCLE FILE. CREATED IN CONTAINER   * 00960000
009700* LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.                     * 00970000
009800***************************************************************** 00980000
009900 01  TR016-REC-TYP-ADURD REDEFINES TR016-REC-TYP-ADU.             00990000
010000     05 TR016-ADURD-REC-KEY.                                      01000000
010100        10 TR016-ADURD-TRN-TYP          PIC X(01).                01010000
010200           88 TR016-ADURD-TRN-TYP-ADD              VALUE 'A'.     01020000
010300           88 TR016-ADURD-TRN-TYP-CHG              VALUE 'C'.     01030000
010400           88 TR016-ADURD-TRN-TYP-DEL              VALUE 'D'.     01040000
010500        10 TR016-ADURD-REC-TYP-CDE      PIC X(06).                01050000
010600           88 TR016-ADURD-REC-TYP-CDE-ADURDA       VALUE 'ADURDA'.01060000
010700        10 TR016-ADURD-SEQ-NBR          PIC X(02).                01070000
010800           88 TR016-ADURD-SEQ-NBR-30               VALUE '30'.    01080000
010900        10 TR016-ADURD-3RD-PARTY-CDE    PIC X(06).                01090000
011000           88 TR016-ADURD-3RD-PARTY-CDE-EI         VALUE '      '.01100000
011100        10 TR016-ADURD-PO-NBR           PIC 9(09).                01110000
011200        10 TR016-ADURD-EXTL-REF-NBR     PIC X(15).                01120000
011300*THE 4 FIELDS BETWEEN THESE MESSAGES ARE NOT USED                 01130000
011400     05 TR016-ADURD-TRIP-TYP-CDE-MOM    PIC X(01).                01140000
011500        88 TR016-ADURD-TRIP-TYP-MOM-AIR            VALUE 'A'.     01150000
011600        88 TR016-ADURD-TRIP-TYP-MOM-MOTOR          VALUE 'M'.     01160000
011700        88 TR016-ADURD-TRIP-TYP-MOM-OCEAN          VALUE 'O'.     01170000
011800     05 TR016-ADURD-CARR-SCAC-ID        PIC X(04).                01180000
011900     05 TR016-ADURD-IMPRT-TRIP-ID       PIC X(10).                01190000
012000     05 TR016-ADURD-IMPRT-VEH-NM        PIC X(25).                01200000
012100*THE FIELDS BETWEEN THESE MESSAGES ARE NOT USED                   01210000
012200     05 TR016-ADURD-ACTL-DEST-POE-CDE   PIC X(04).                01220000
012300     05 TR016-ADURD-ACTL-POE-DELY-DTE   PIC X(08).                01230000
012400     05 TR016-ADURD-ACTL-POE-DELY-TM    PIC X(04).                01240000
012500     05 FILLER                          PIC X(40).                01250000
012600** FOLLOWING 2 FIELDS ARE FOR KOHL'S INTERNAL PROCESSING ONLY **  01260000
012700     05 TR016-ADURD-TURN-CRE-DTE        PIC X(08).                01270000
012800     05 TR016-ADURD-TURN-CRE-TM         PIC X(04).                01280000
012900     05 TR016-ADURD-CONSOL-END          PIC X(01).                01290000
013000     05 TR016-ADURD-EDI-SEG-END         PIC X(01).                01300000
013100     05 TR016-ADURD-EDI                 PIC X(01).                01310000
013200     05 TR016-ADURD-FILE-ID             PIC X(09).                01320000
013300     05 TR016-ADURD-ENT-ID              PIC 9(09).                01330000
013400     05 FILLER                          PIC X(132).               01340000
