000100******************************************************************00010001
000200*    RECORD PURPOSE: CONTAINER EXTRACT DETAILS FORMAT TO SEND TO *00020009
000300*                    TRANSINTERNATIONAL.                         *00030009
000400*    RECORD LENGTH:  136                                         *00040007
000500*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD                *00050001
000600******************************************************************00060001
000700 01  TR200-RECORD.                                                00070001
001100     05  TR200-COMMON-FIELDS.                                     00110001
001200         10 TR200-CONTNR-ID          PIC X(12)    VALUE SPACE.    00120001
001300         10 TR200-REC-TYP-CDE        PIC X(3)     VALUE SPACE.    00130001
001400            88 TR200-CONTNR-HDR                   VALUE 'HDR'.    00140001
001500            88 TR200-CONTNR-PO-DTL                VALUE 'DTL'.    00150001
001600     05  TR200-DATA-FIELDS           PIC X(121).                  00160007
001610     05  TR200-HEADER-FIELDS REDEFINES TR200-DATA-FIELDS.         00161001
001800         10 TR200-VESSEL-TYP         PIC X.                       00180005
001900            88 TR200-OCEAN                        VALUE 'O'.      00190001
002000            88 TR200-AIR                          VALUE 'A'.      00200001
002100            88 TR200-MOTOR                        VALUE 'M'.      00210001
002200         10 TR200-VESSEL-NAME        PIC X(25).                   00220005
002210         10 TR200-VOYAGE             PIC X(12).                   00221005
002300         10 TR200-CARR-SCAC-ID       PIC X(4).                    00230005
002400         10 TR200-FOB-CDE            PIC X(5).                    00240005
002500         10 TR200-POE-CDE            PIC X(4).                    00250005
002600         10 TR200-ACTL-DPRTR-DTE     PIC X(8).                    00260005
002700         10 TR200-EST-ARR-DTE        PIC X(8).                    00270005
002800         10 TR200-CONSOL-SCAC-ID     PIC X(4).                    00280005
002900         10 TR200-TOTAL-CARTONS      PIC 9(9).                    00290005
003000         10 TR200-TOTAL-UNITS        PIC 9(9).                    00300005
003100         10 TR200-TOTAL-CBMS         PIC 9(9).99.                 00310007
003200         10 TR200-TOTAL-KGRMS        PIC 9(9).                    00320005
003300         10 TR200-SHPD-FROM-CDE      PIC X(3).                    00330005
003400         10 TR200-SHPD-TO-CDE        PIC X(3).                    00340005
003500         10 TR200-CONTNR-SIZE        PIC X(5).                    00350005
003700     05  TR200-DETAIL-FIELDS REDEFINES TR200-DATA-FIELDS.         00370001
003800         10 TR200-PO-NBR             PIC 9(9).                    00380005
003900         10 TR200-PO-CARTONS         PIC 9(9).                    00390005
004000         10 TR200-PO-UNITS           PIC 9(9).                    00400005
004100         10 TR200-PO-CBMS            PIC 9(9).99.                 00410008
004200         10 TR200-PO-KGRMS           PIC 9(9).                    00420005
004300         10 TR200-MSTR-BOL-NBR       PIC X(30).                   00430005
004400         10 TR200-HSE-BOL-NBR        PIC X(30).                   00440005
004500         10 TR200-ACTL-DELY-DTE      PIC X(8).                    00450005
004600         10 FILLER                   PIC X(5).                    00460008
