000001*****************************************************************         
000002*    RECORD PURPOSE: PO EDI RECORD                              *         
000007*    RECORD LENGTH:  132 BYTES                                  *         
000008*    RECORD FORMAT:  SEQUENTIAL                                 *         
000009*****************************************************************         
000010 01  TR009-RECORD.                                                        
000011     05  TR009-PO-EDI-RECORD.                                             
000012         10 TR009-PO-EDI-REC-TYPE    PIC X(001) VALUE ' '.                
000013            88  TR009-PO-EDI-REC-TYPE-HEADER    VALUE 'H'.                
000014            88  TR009-PO-EDI-REC-TYPE-DETAIL    VALUE 'A'                 
000015                                                      'D'                 
000016                                                      'R'.                
000017            88  TR009-PO-EDI-REC-TYPE-TRAILR    VALUE 'T'.                
000018         10 FILLER                   PIC X(131) VALUE SPACES.             
000019*                                                                         
000020     05  TR009-PO-EDI-HEADER-REC REDEFINES TR009-PO-EDI-RECORD.           
000021         10 TR009-HD-EDI-REC-TYPE    PIC X(01).                           
000022         10 TR009-HD-EDI-CUST-ID     PIC X(05).                           
000023         10 TR009-HD-EDI-CURR-DATE   PIC X(08).                           
000024         10 TR009-HD-EDI-CURR-TIME   PIC X(06).                           
000025         10 TR009-HD-EDI-FILLER      PIC X(110).                          
000026         10 TR009-HD-EDI-KOHLS-FILLER PIC X(01).                          
000027         10 TR009-HD-EDI-KOHLS-HEX-51 PIC X(01).                          
000028*                                                                         
000029     05  TR009-PO-EDI-DETAIL-REC REDEFINES TR009-PO-EDI-RECORD.           
000030         10 TR009-DT-EDI-REC-TYPE     PIC X(01).                          
000031         10 TR009-DT-EDI-POANUMBR     PIC X(30).                          
000032         10 TR009-DT-EDI-POADPTNO     PIC X(10).                          
000033         10 TR009-DT-EDI-POADPTNO-N REDEFINES                             
000034            TR009-DT-EDI-POADPTNO     PIC 9(10).                          
000035         10 TR009-DT-EDI-DEPT-FILLER  PIC X(40).                          
000036         10 TR009-DT-EDI-PO-TYPE      PIC X(03).                          
000037         10 TR009-DT-EDI-CARTON-CNT   PIC X(05).                          
000038         10 TR009-DT-EDI-WEIGHT       PIC X(05).                          
000039         10 TR009-DT-EDI-RECV-PROC-CDE PIC X(02).                         
000040         10 TR009-DT-EDI-DATE-QUAL-1  PIC X(02).                          
000041         10 TR009-DT-EDI-DATE1.                                           
000042            20 TR009-DT-EDI-DATE1-CC  PIC XX.                             
000043            20 TR009-DT-EDI-DATE1-YY  PIC XX.                             
000044            20 TR009-DT-EDI-DATE1-MM  PIC XX.                             
000045            20 TR009-DT-EDI-DATE1-DD  PIC XX.                             
000046         10 TR009-DT-EDI-DATE-QUAL-2  PIC X(02).                          
000047         10 TR009-DT-EDI-DATE2.                                           
000048            20 TR009-DT-EDI-DATE2-CC  PIC XX.                             
000049            20 TR009-DT-EDI-DATE2-YY  PIC XX.                             
000050            20 TR009-DT-EDI-DATE2-MM  PIC XX.                             
000051            20 TR009-DT-EDI-DATE2-DD  PIC XX.                             
000052         10 TR009-DT-EDI-AD-DATE.                                         
000053            20 TR009-DT-EDI-AD-DATE-CC PIC XX.                            
000054            20 TR009-DT-EDI-AD-DATE-YY PIC XX.                            
000055            20 TR009-DT-EDI-AD-DATE-MM PIC XX.                            
000056            20 TR009-DT-EDI-AD-DATE-DD PIC XX.                            
000057         10 TR009-DT-EDI-FILLER       PIC X(06).                          
000058         10 TR009-DT-EDI-KOHLS-FILLER PIC X(01).                          
000059         10 TR009-DT-EDI-KOHLS-HEX-51 PIC X(01).                          
000060*                                                                         
000061     05  TR009-PO-EDI-TRAILER-REC REDEFINES TR009-PO-EDI-RECORD.          
000062         10 TR009-TR-EDI-REC-TYPE     PIC  X(01).                         
000063         10 TR009-TR-EDI-TOTAL-REC    PIC  9(06).                         
000064         10 TR009-TR-EDI-FILLER       PIC X(123).                         
000065         10 TR009-TR-EDI-KOHLS-FILLER PIC  X(01).                         
000070         10 TR009-TR-EDI-KOHLS-HEX-51 PIC  X(01).                         
