000001***************************************************************** 00000101
000002*    RECORD PURPOSE: RECORD LAYOUT FOR EDITED CUSTOMS DATA.     * 00000201
000003*    RECORD LENGTH:  300                                        * 00000301
000004*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD027   * 00000401
000005***************************************************************** 00000501
000006* CUSTOMS ENTRY FILED.  THE DATE THE 3461 OR 7510 IS FILED.     * 00000601
000007* SENT AFTER THE 3461 OR 7510 IS FILED.  CONSOLIDATOR FILES     * 00000701
000008* ENTRY WITH CUSTOMS BROKER FOR ENTRY.                          * 00000801
000009* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00000901
000010* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00001001
000011***************************************************************** 00001101
000012 01  TR027-REC-TYP-ENF.                                           00001201
000013     05 TR027-ENF-REC-KEY.                                        00001301
000014        10 TR027-ENF-TRN-TYP            PIC X(01).                00001401
000015           88 TR027-ENF-TRN-TYP-ADD                VALUE 'A'.     00001501
000016           88 TR027-ENF-TRN-TYP-CHG                VALUE 'C'.     00001601
000017           88 TR027-ENF-TRN-TYP-DEL                VALUE 'D'.     00001701
000018        10 TR027-ENF-REC-TYP-CDE        PIC X(06).                00001801
000019           88 TR027-ENF-REC-TYP-CD-ENF             VALUE 'ENF   '.00001901
000020        10 TR027-ENF-SEQ-NBR            PIC X(02).                00002001
000021           88 TR027-ENF-SEQ-NBR-10                 VALUE '10'.    00002101
000022        10 TR027-ENF-3RD-PARTY-CDE      PIC X(06).                00002201
000023           88 TR027-ENF-3RD-PARTY-CDE-EI           VALUE '      '.00002301
000024        10 TR027-ENF-CSTM-ENTR-ID       PIC X(12).                00002401
000026     05 TR027-ENF-BKR-REF-NBR           PIC X(15).                00002601
000027     05 TR027-ENF-FILD-DTE              PIC X(08).                00002701
000028     05 TR027-ENF-FILD-TM               PIC X(04).                00002801
000029     05 TR027-ENF-MOM-TRIP-TYP-CDE      PIC X(01).                00002901
000030        88 TR027-ENF-MOM-TRIP-TYP-AIR              VALUE 'A'.     00003001
000031        88 TR027-ENF-MOM-TRIP-TYP-MOTOR            VALUE 'M'.     00003101
000032        88 TR027-ENF-MOM-TRIP-TYP-OCEAN            VALUE 'O'.     00003201
000033        88 TR027-ENF-MOM-TRIP-TYP-VALID            VALUE 'A',     00003301
000034                                                         'O',     00003401
000035                                                         'M'.     00003501
000036     05 TR027-ENF-ENTR-TYP-CDE          PIC X(02).                00003601
000037     05 TR027-ENF-ENTR-TYP-DESC         PIC X(30).                00003701
000038     05 TR027-ENF-POE-STD-EDI-CDE       PIC X(04).                00003801
000039     05 TR027-ENF-POE-NM                PIC X(30).                00003901
000040     05 FILLER                          PIC X(155).               00004002
000041     05 TR027-ENF-FILE-ID               PIC X(09).                00004101
000042     05 TR027-ENF-ENT-ID                PIC 9(09).                00004201
000043     05 TR027-ENF-PROCESS-SEQ-NBR       PIC 9(06).                00004301
000044                                                                  00004401
000045***************************************************************** 00004501
000046* CUSTOMS ENTRY FILED FOR BOL(S).  THE DATE THE 3461 OR 7510 IS * 00004601
000047* FILED.  SENT AFTER THE 3461 OR 7510 IS FILED.  CONSOLIDATOR   * 00004701
000048* FILES ENTRY WITH CUSTOMS BROKER FOR ENTRY.                    * 00004801
000049* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00004901
000050* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00005001
000051***************************************************************** 00005101
000052 01  TR027-REC-TYP-ENFBOL REDEFINES TR027-REC-TYP-ENF.            00005201
000053     05 TR027-ENFBOL-REC-KEY.                                     00005301
000054        10 TR027-ENFBOL-TRN-TYP         PIC X(01).                00005401
000055           88 TR027-ENFBOL-TRN-TYP-ADD             VALUE 'A'.     00005501
000056           88 TR027-ENFBOL-TRN-TYP-CHG             VALUE 'C'.     00005601
000057           88 TR027-ENFBOL-TRN-TYP-DEL             VALUE 'D'.     00005701
000058        10 TR027-ENFBOL-REC-TYP-CDE     PIC X(06).                00005801
000059           88 TR027-ENFBOL-REC-TYP-CD-ENFBOL       VALUE 'ENFBOL'.00005901
000060        10 TR027-ENFBOL-SEQ-NBR         PIC X(02).                00006001
000061           88 TR027-ENFBOL-SEQ-NBR-15              VALUE '15'.    00006101
000062        10 TR027-ENFBOL-3RD-PARTY-CDE   PIC X(06).                00006201
000063           88 TR027-ENFBOL-3RD-PARTY-CDE-EI        VALUE '      '.00006301
000064        10 TR027-ENFBOL-CSTM-ENTR-ID    PIC X(12).                00006401
000066        10 TR027-ENFBOL-MSTR-BOL-NBR    PIC X(30).                00006601
000067        10 TR027-ENFBOL-HSE-BOL-NBR     PIC X(30).                00006701
000068     05 TR027-ENFBOL-BKR-REF-NBR        PIC X(15).                00006801
000069     05 TR027-ENFBOL-CARR-SCAC-ID       PIC X(04).                00006901
000070     05 TR027-ENFBOL-POE-STD-EDI-CDE    PIC X(04).                00007001
000071     05 TR027-ENFBOL-POE-NM             PIC X(30).                00007101
000072     05 FILLER                          PIC X(136).               00007202
000073     05 TR027-ENFBOL-FILE-ID            PIC X(09).                00007301
000074     05 TR027-ENFBOL-ENT-ID             PIC 9(09).                00007401
000075     05 TR027-ENFBOL-PROCESS-SEQ-NBR    PIC 9(06).                00007501
000076                                                                  00007601
000077***************************************************************** 00007701
000078* CUSTOMS ENTRY FILED (CONTAINER NUMBERS).  THE DATE THE 3461   * 00007801
000079* 7510 IS FILED.  SENT AFTER THE 3461 OR 7510 IS FILED.         * 00007901
000080* CONSOLIDATOR FILES ENTRY WITH CUSTOMS BROKER FOR ENTRY.       * 00008001
000081* THE BROKER PROVIDES THE CONTAINER NUMBERS.                    * 00008101
000082* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00008201
000083* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00008301
000084***************************************************************** 00008401
000085 01  TR027-REC-TYP-ENFCON REDEFINES TR027-REC-TYP-ENFBOL.         00008501
000086     05 TR027-ENFCON-REC-KEY.                                     00008601
000087        10 TR027-ENFCON-TRN-TYP         PIC X(01).                00008701
000088           88 TR027-ENFCON-TRN-TYP-ADD             VALUE 'A'.     00008801
000089           88 TR027-ENFCON-TRN-TYP-CHG             VALUE 'C'.     00008901
000090           88 TR027-ENFCON-TRN-TYP-DEL             VALUE 'D'.     00009001
000091        10 TR027-ENFCON-REC-TYP-CDE     PIC X(06).                00009101
000092           88 TR027-ENFCON-REC-TYP-CD-ENFCON       VALUE 'ENFCON'.00009201
000093        10 TR027-ENFCON-SEQ-NBR         PIC X(02).                00009301
000094           88 TR027-ENFCON-SEQ-NBR-20              VALUE '20'.    00009401
000095        10 TR027-ENFCON-3RD-PARTY-CDE   PIC X(06).                00009501
000096           88 TR027-ENFCON-3RD-PARTY-CDE-EI        VALUE '      '.00009601
000097        10 TR027-ENFCON-CSTM-ENTR-ID    PIC X(12).                00009701
000099        10 TR027-ENFCON-CONTNR-ID       PIC X(12).                00009901
000100     05 TR027-ENFCON-BKR-REF-NBR        PIC X(15).                00010001
000101     05 TR027-ENFCON-POE-STD-EDI-CDE    PIC X(04).                00010101
000102     05 TR027-ENFCON-POE-NM             PIC X(30).                00010201
000104     05 FILLER                          PIC X(188).               00010402
000105     05 TR027-ENFCON-FILE-ID            PIC X(09).                00010501
000106     05 TR027-ENFCON-ENT-ID             PIC 9(09).                00010601
000107     05 TR027-ENFCON-PROCESS-SEQ-NBR    PIC 9(06).                00010701
000108                                                                  00010801
000109***************************************************************** 00010901
000110* DELIVERY ORDER PREPARED FOR DECONSOLIDATOR.  THE DATE THE     * 00011001
000111* CUSTOMS BROKER DECLARED THEY PREPARED AND SENT THE DELIVERY   * 00011101
000112* ORDER.  SENT AFTER THE DELIVERY IS PREPARED AND HAS BEEN SENT * 00011201
000113* TO THE DECONSOLIDATOR.                                        * 00011301
000114***************************************************************** 00011401
000115 01  TR027-REC-TYP-DOP REDEFINES TR027-REC-TYP-ENFCON.            00011501
000116     05 TR027-DOP-REC-KEY.                                        00011601
000117        10 TR027-DOP-TRN-TYP            PIC X(01).                00011701
000118           88 TR027-DOP-TRN-TYP-ADD                VALUE 'A'.     00011801
000119           88 TR027-DOP-TRN-TYP-CHG                VALUE 'C'.     00011901
000120           88 TR027-DOP-TRN-TYP-DEL                VALUE 'D'.     00012001
000121        10 TR027-DOP-REC-TYP-CDE        PIC X(06).                00012101
000122           88 TR027-DOP-REC-TYP-CDE-DOP            VALUE 'DOP   '.00012201
000123        10 TR027-DOP-SEQ-NBR            PIC X(02).                00012301
000124           88 TR027-DOP-SEQ-NBR-10                 VALUE '25'.    00012401
000125        10 TR027-DOP-3RD-PARTY-CDE      PIC X(06).                00012501
000126           88 TR027-DOP-3RD-PARTY-CDE-EI           VALUE '      '.00012601
000127        10 TR027-DOP-CSTM-ENTR-ID       PIC X(12).                00012701
000129        10 TR027-DOP-CONTNR-ID          PIC X(12).                00012901
000130     05 TR027-DOP-BKR-REF-NBR           PIC X(15).                00013001
000131     05 TR027-DOP-DELY-ORD-SNT-DTE      PIC X(08).                00013101
000132     05 TR027-DOP-DELY-ORD-SNT-TM       PIC X(04).                00013201
000133     05 TR027-DOP-POE-STD-EDI-CDE       PIC X(04).                00013301
000134     05 TR027-DOP-POE-NM                PIC X(30).                00013401
000136     05 FILLER                          PIC X(176).               00013602
000137     05 TR027-DOP-FILE-ID               PIC X(09).                00013701
000138     05 TR027-DOP-ENT-ID                PIC 9(09).                00013801
000139     05 TR027-DOP-PROCESS-SEQ-NBR       PIC 9(06).                00013901
000140                                                                  00014001
000141***************************************************************** 00014101
000142* CUSTOMS ENTRY FILED (PO'S).  THE DATE THE 3461 OR 7510 IS     * 00014201
000143* FILED.  SENT AFTER THE 3461 OR 7510 IS FILED.  CONSOLIDATOR   * 00014301
000144* FILES ENTRY WITH CUSTOMS BROKER FOR ENTRY.                    * 00014401
000145* THE BROKER PROVIDES THE PURCHASE ORDER NUMBERS.               * 00014501
000146* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00014601
000147* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00014701
000148***************************************************************** 00014801
000149 01  TR027-REC-TYP-ENFPO REDEFINES TR027-REC-TYP-DOP.             00014901
000150     05 TR027-ENFPO-REC-KEY.                                      00015001
000151        10 TR027-ENFPO-TRN-TYP          PIC X(01).                00015101
000152           88 TR027-ENFPO-TRN-TYP-ADD              VALUE 'A'.     00015201
000153           88 TR027-ENFPO-TRN-TYP-CHG              VALUE 'C'.     00015301
000154           88 TR027-ENFPO-TRN-TYP-DEL              VALUE 'D'.     00015401
000155        10 TR027-ENFPO-REC-TYP-CDE      PIC X(06).                00015501
000156           88 TR027-ENFPO-REC-TYP-CDE-ENFPO        VALUE 'ENFPO '.00015601
000157        10 TR027-ENFPO-SEQ-NBR          PIC X(02).                00015701
000158           88 TR027-ENFPO-SEQ-NBR-25               VALUE '30'.    00015801
000159        10 TR027-ENFPO-3RD-PARTY-CDE    PIC X(06).                00015901
000160           88 TR027-ENFPO-3RD-PARTY-CDE-EI         VALUE '      '.00016001
000161        10 TR027-ENFPO-CSTM-ENTR-ID     PIC X(12).                00016101
000163        10 TR027-ENFPO-PO-NBR           PIC X(09).                00016301
000164        10 TR027-ENFPO-EXTL-REF-NBR     PIC X(15).                00016401
000165     05 TR027-ENFPO-BKR-REF-NBR         PIC X(15).                00016501
000166     05 TR027-ENFPO-POE-STD-EDI-CDE     PIC X(04).                00016601
000167     05 TR027-ENFPO-POE-NM              PIC X(30).                00016701
000168     05 TR027-ENFPO-FOB-CDE             PIC X(03).                00016801
000169     05 FILLER                          PIC X(173).               00016902
000170     05 TR027-ENFPO-FILE-ID             PIC X(09).                00017001
000171     05 TR027-ENFPO-ENT-ID              PIC 9(09).                00017101
000172     05 TR027-ENFPO-PROCESS-SEQ-NBR     PIC 9(06).                00017201
000173                                                                  00017301
000174***************************************************************** 00017401
000175* CUSTOMS EXAM DATE.  THE DATE CUSTOMS NOTIFIED THE BROKER THEY * 00017501
000176* WOULD LIKE TO SCHEDULE AN EXAM.  SENT IF THE PURCHASE ORDER   * 00017601
000177* OR ENTIRE ENTRY IS TO BE EXAMINED.                            * 00017701
000178***************************************************************** 00017801
000179 01  TR027-REC-TYP-EXD REDEFINES TR027-REC-TYP-ENFPO.             00017901
000180     05 TR027-EXD-REC-KEY.                                        00018001
000181        10 TR027-EXD-TRN-TYP            PIC X(01).                00018101
000182           88 TR027-EXD-TRN-TYP-ADD                VALUE 'A'.     00018201
000183           88 TR027-EXD-TRN-TYP-CHG                VALUE 'C'.     00018301
000184           88 TR027-EXD-TRN-TYP-DEL                VALUE 'D'.     00018401
000185        10 TR027-EXD-REC-TYP-CDE        PIC X(06).                00018501
000186           88 TR027-EXD-REC-TYP-CDE-EXD            VALUE 'EXD   '.00018601
000187        10 TR027-EXD-SEQ-NBR            PIC X(02).                00018701
000188           88 TR027-EXD-SEQ-NBR-30                 VALUE '35'.    00018801
000189        10 TR027-EXD-3RD-PARTY-CDE      PIC X(06).                00018901
000190           88 TR027-EXD-3RD-PARTY-CDE-EI           VALUE '      '.00019001
000191        10 TR027-EXD-CSTM-ENTR-ID       PIC X(12).                00019101
000193     05 TR027-EXD-BKR-REF-NBR           PIC X(15).                00019301
000194     05 TR027-EXD-EXM-DTE               PIC X(08).                00019401
000195     05 TR027-EXD-EXM-TM                PIC X(04).                00019501
000196     05 TR027-EXD-POE-STD-EDI-CDE       PIC X(04).                00019601
000197     05 TR027-EXD-POE-NM                PIC X(30).                00019701
000199     05 FILLER                          PIC X(188).               00019902
000200     05 TR027-EXD-FILE-ID               PIC X(09).                00020001
000201     05 TR027-EXD-ENT-ID                PIC 9(09).                00020101
000202     05 TR027-EXD-PROCESS-SEQ-NBR       PIC 9(06).                00020201
000203                                                                  00020301
000204***************************************************************** 00020401
000205* CUSTOMS REJECTION DATE.  THE DATE U.S. CUSTOMS REJECTED THE   * 00020501
000206* ENTRY.  SENT IF AN ENTRY WAS REJECTED, OR A PURCHASE ORDER OR * 00020601
000207* ENTRY FAILED.                                                   00020701
000208***************************************************************** 00020801
000209 01  TR027-REC-TYP-REJ REDEFINES TR027-REC-TYP-EXD.               00020901
000210     05 TR027-REJ-REC-KEY.                                        00021001
000211        10 TR027-REJ-TRN-TYP            PIC X(01).                00021101
000212           88 TR027-REJ-TRN-TYP-ADD                VALUE 'A'.     00021201
000213           88 TR027-REJ-TRN-TYP-CHG                VALUE 'C'.     00021301
000214           88 TR027-REJ-TRN-TYP-DEL                VALUE 'D'.     00021401
000215        10 TR027-REJ-REC-TYP-CDE        PIC X(06).                00021501
000216           88 TR027-REJ-REC-TYP-CDE-REJ            VALUE 'REJ   '.00021601
000217        10 TR027-REJ-SEQ-NBR            PIC X(02).                00021701
000218           88 TR027-REJ-SEQ-NBR-35                 VALUE '40'.    00021801
000219        10 TR027-REJ-3RD-PARTY-CDE      PIC X(06).                00021901
000220           88 TR027-REJ-3RD-PARTY-CDE-EI           VALUE '      '.00022001
000221        10 TR027-REJ-CSTM-ENTR-ID       PIC X(12).                00022101
000223     05 TR027-REJ-BKR-REF-NBR           PIC X(15).                00022301
000224     05 TR027-REJ-REJ-DTE               PIC X(08).                00022401
000225     05 TR027-REJ-REJ-TM                PIC X(04).                00022501
000226     05 TR027-REJ-REJ-DESC              PIC X(30).                00022601
000227     05 TR027-REJ-POE-STD-EDI-CDE       PIC X(04).                00022701
000228     05 TR027-REJ-POE-NM                PIC X(30).                00022801
000230     05 FILLER                          PIC X(158).               00023002
000231     05 TR027-REJ-FILE-ID               PIC X(09).                00023101
000232     05 TR027-REJ-ENT-ID                PIC 9(09).                00023201
000233     05 TR027-REJ-PROCESS-SEQ-NBR       PIC 9(06).                00023301
000234                                                                  00023401
000235***************************************************************** 00023501
000236* ESTIMATED CUSTOMS CLEARANCE DATE.  THE ESTIMATED DATE U.S.    * 00023601
000237* CUSTOMS SHOULD CLEAR THE ENTRY.                               * 00023701
000238***************************************************************** 00023801
000239 01  TR027-REC-TYP-ECR REDEFINES TR027-REC-TYP-REJ.               00023901
000240     05 TR027-ECR-REC-KEY.                                        00024001
000241        10 TR027-ECR-TRN-TYP            PIC X(01).                00024101
000242           88 TR027-ECR-TRN-TYP-ADD                VALUE 'A'.     00024201
000243           88 TR027-ECR-TRN-TYP-CHG                VALUE 'C'.     00024301
000244           88 TR027-ECR-TRN-TYP-DEL                VALUE 'D'.     00024401
000245        10 TR027-ECR-REC-TYP-CDE        PIC X(06).                00024501
000246           88 TR027-ECR-REC-TYP-CDE-ECR            VALUE 'ECR   '.00024601
000247        10 TR027-ECR-SEQ-NBR            PIC X(02).                00024701
000248           88 TR027-ECR-SEQ-NBR-40                 VALUE '45'.    00024801
000249        10 TR027-ECR-3RD-PARTY-CDE      PIC X(06).                00024901
000250           88 TR027-ECR-3RD-PARTY-CDE-EI           VALUE '      '.00025001
000251        10 TR027-ECR-CSTM-ENTR-ID       PIC X(12).                00025101
000253     05 TR027-ECR-BKR-REF-NBR           PIC X(15).                00025301
000254     05 TR027-ECR-EST-CLR-DTE           PIC X(08).                00025401
000255     05 TR027-ECR-EST-CLR-TM            PIC X(04).                00025501
000256     05 TR027-ECR-POE-STD-EDI-CDE       PIC X(04).                00025601
000257     05 TR027-ECR-POE-NM                PIC X(30).                00025701
000259     05 FILLER                          PIC X(188).               00025902
000260     05 TR027-ECR-FILE-ID               PIC X(09).                00026001
000261     05 TR027-ECR-ENT-ID                PIC 9(09).                00026101
000262     05 TR027-ECR-PROCESS-SEQ-NBR       PIC 9(06).                00026201
000263                                                                  00026301
000264***************************************************************** 00026401
000265* ACTUAL CUSTOMS CLEARANCE DATE.  THE DATE U.S. CUSTOMS CLEARED * 00026501
000266* THE ENTRY.  SENT AFTER THE PURCHASE ORDER AND/OR ENTRY HAS    * 00026601
000267* CLEARED CUSTOMS.                                              * 00026701
000268***************************************************************** 00026801
000269 01  TR027-REC-TYP-RLS REDEFINES TR027-REC-TYP-ECR.               00026901
000270     05 TR027-RLS-REC-KEY.                                        00027001
000271        10 TR027-RLS-TRN-TYP            PIC X(01).                00027101
000272           88 TR027-RLS-TRN-TYP-ADD                VALUE 'A'.     00027201
000273           88 TR027-RLS-TRN-TYP-CHG                VALUE 'C'.     00027301
000274           88 TR027-RLS-TRN-TYP-DEL                VALUE 'D'.     00027401
000275        10 TR027-RLS-REC-TYP-CDE        PIC X(06).                00027501
000276           88 TR027-RLS-REC-TYP-CDE-RLS            VALUE 'RLS   '.00027601
000277        10 TR027-RLS-SEQ-NBR            PIC X(02).                00027701
000278           88 TR027-RLS-SEQ-NBR-45                 VALUE '50'.    00027801
000279        10 TR027-RLS-3RD-PARTY-CDE      PIC X(06).                00027901
000280           88 TR027-RLS-3RD-PARTY-CDE-EI           VALUE '      '.00028001
000281        10 TR027-RLS-CSTM-ENTR-ID       PIC X(12).                00028101
000283     05 TR027-RLS-BKR-REF-NBR           PIC X(15).                00028301
000284     05 TR027-RLS-ACTL-CLR-DTE          PIC X(08).                00028401
000285     05 TR027-RLS-ACTL-CLR-TM           PIC X(04).                00028501
000286     05 TR027-RLS-POE-STD-EDI-CDE       PIC X(04).                00028601
000287     05 TR027-RLS-POE-NM                PIC X(30).                00028701
000289     05 FILLER                          PIC X(188).               00028902
000290     05 TR027-RLS-FILE-ID               PIC X(09).                00029001
000291     05 TR027-RLS-ENT-ID                PIC 9(09).                00029101
000292     05 TR027-RLS-PROCESS-SEQ-NBR       PIC 9(06).                00029201
000293                                                                  00029301
000294***************************************************************** 00029401
000295* CUSTOMS LIQUIDATION DATE.  THE DATE U.S. CUSTOMS DECLARES THE * 00029501
000296* ENTRY LIQUIDATED.  SENT AFTER THE ENTRY HAS CLEARED CUSTOMS.  * 00029601
000297***************************************************************** 00029701
000298 01  TR027-REC-TYP-LIQ REDEFINES TR027-REC-TYP-RLS.               00029801
000299     05 TR027-LIQ-REC-KEY.                                        00029901
000300        10 TR027-LIQ-TRN-TYP            PIC X(01).                00030001
000301           88 TR027-LIQ-TRN-TYP-ADD                VALUE 'A'.     00030101
000302           88 TR027-LIQ-TRN-TYP-CHG                VALUE 'C'.     00030201
000303           88 TR027-LIQ-TRN-TYP-DEL                VALUE 'D'.     00030301
000304        10 TR027-LIQ-REC-TYP-CDE        PIC X(06).                00030401
000305           88 TR027-LIQ-REC-TYP-CDE-LIQ            VALUE 'LIQ   '.00030501
000306        10 TR027-LIQ-SEQ-NBR            PIC X(02).                00030601
000307           88 TR027-LIQ-SEQ-NBR-50                 VALUE '55'.    00030701
000308        10 TR027-LIQ-3RD-PARTY-CDE      PIC X(06).                00030801
000309           88 TR027-LIQ-3RD-PARTY-CDE-EI           VALUE '      '.00030901
000310        10 TR027-LIQ-CSTM-ENTR-ID       PIC X(12).                00031001
000312     05 TR027-LIQ-BKR-REF-NBR           PIC X(15).                00031201
000313     05 TR027-LIQ-LQDN-DTE              PIC X(08).                00031301
000314     05 TR027-LIQ-LQDN-TM               PIC X(04).                00031401
000315     05 TR027-LIQ-POE-STD-EDI-CDE       PIC X(04).                00031501
000316     05 TR027-LIQ-POE-NM                PIC X(30).                00031601
000318     05 FILLER                          PIC X(188).               00031802
000319     05 TR027-LIQ-FILE-ID               PIC X(09).                00031901
000320     05 TR027-LIQ-ENT-ID                PIC 9(09).                00032001
000321     05 TR027-LIQ-PROCESS-SEQ-NBR       PIC 9(06).                00032101
000322                                                                  00032201
000323***************************************************************** 00032301
000324* CUSTOMS LIQUIDATION SUSPENSION DATE.  THE DATE U.S. CUSTOMS   * 00032401
000325* DECLARES THE ENTRY IS SUSPENDED FROM LIQUIDATION.  SENT AFTER * 00032501
000326* THE ENTRY HAS CLEARED CUSTOMS.                                * 00032601
000327***************************************************************** 00032701
000328 01  TR027-REC-TYP-LSU REDEFINES TR027-REC-TYP-LIQ.               00032801
000329     05 TR027-LSU-REC-KEY.                                        00032901
000330        10 TR027-LSU-TRN-TYP            PIC X(01).                00033001
000331           88 TR027-LSU-TRN-TYP-ADD                VALUE 'A'.     00033101
000332           88 TR027-LSU-TRN-TYP-CHG                VALUE 'C'.     00033201
000333           88 TR027-LSU-TRN-TYP-DEL                VALUE 'D'.     00033301
000334        10 TR027-LSU-REC-TYP-CDE        PIC X(06).                00033401
000335           88 TR027-LSU-REC-TYP-CDE-LSU            VALUE 'LSU   '.00033501
000336        10 TR027-LSU-SEQ-NBR            PIC X(02).                00033601
000337           88 TR027-LSU-SEQ-NBR-55                 VALUE '60'.    00033701
000338        10 TR027-LSU-3RD-PARTY-CDE      PIC X(06).                00033801
000339           88 TR027-LSU-3RD-PARTY-CDE-EI           VALUE '      '.00033901
000340        10 TR027-LSU-CSTM-ENTR-ID       PIC X(12).                00034001
000342     05 TR027-LSU-BKR-REF-NBR           PIC X(15).                00034201
000343     05 TR027-LSU-LQDN-SSPNN-DTE        PIC X(08).                00034301
000344     05 TR027-LSU-LQDN-SSPNN-TM         PIC X(04).                00034401
000345     05 TR027-LSU-LQDN-SSPNN-DESC       PIC X(30).                00034501
000346     05 TR027-LSU-POE-STD-EDI-CDE       PIC X(04).                00034601
000347     05 TR027-LSU-POE-NM                PIC X(30).                00034701
000349     05 FILLER                          PIC X(158).               00034902
000350     05 TR027-LSU-FILE-ID               PIC X(09).                00035001
000351     05 TR027-LSU-ENT-ID                PIC 9(09).                00035101
000360     05 TR027-LSU-PROCESS-SEQ-NBR       PIC 9(06).                00036001
