000100***************************************************************** 00010000
000200*    TRRD074                                                    * 00020000
000210*    RECORD PURPOSE: RECORD LAYOUT USED FOR CLEANING UP OLD     * 00021000
000220*                    INBOUND TRIPS                              * 00022000
000230*    RECORD LENGTH:  125                                        * 00023000
000240***************************************************************** 00024000
000250* CONTAINER DATA.                                               * 00025000
000260***************************************************************** 00026000
000270 01  TR074-RECORD.                                                00027000
000280     05 TR074-OWNER-SCAC-ID          PIC   X(04) VALUE SPACES.    00028000
000290     05 TR074-VEH-NBR                PIC   X(10) VALUE SPACES.    00029000
000300     05 TR074-TRIP-ID                PIC  S9(09) VALUE ZEROES     00030000
000400                                                 COMP.            00040000
000500     05 TR074-TRIP-STATUS-CDE        PIC   X(02) VALUE SPACES.    00050000
000510     05 TR074-TRIP-STATUS-DTE        PIC   X(10) VALUE SPACES.    00051000
000520     05 TR074-TRIP-STATUS-TME        PIC   X(08) VALUE SPACES.    00052000
000530     05 TR074-TRIP-STATUS-UID        PIC   X(08) VALUE SPACES.    00053000
000540     05 TR074-OPER-UNT-ID            PIC  S9(04) VALUE ZEROES     00054000
000550                                                 COMP.            00055000
000560     05 TR074-FCLTY-ID               PIC  S9(04) VALUE ZEROES     00056000
000561                                                 COMP.            00056100
000562     05 TR074-VEH-STATUS-CDE         PIC   X(02) VALUE SPACES.    00056200
000563     05 TR074-VEH-OPER-UNT-ID        PIC  S9(04) VALUE ZEROES     00056300
000564                                                 COMP.            00056400
000565     05 TR074-VEH-FCLTY-ID           PIC  S9(04) VALUE ZEROES     00056500
000566                                                 COMP.            00056600
000567     05 TR074-VEH-TRIP-ID            PIC  S9(09) VALUE ZEROES     00056700
000568                                                 COMP.            00056800
000569     05 TR074-SHIPMT-COUNT           PIC  S9(09) VALUE ZEROES     00056900
000570                                                 COMP.            00057000
000580     05 TR074-SHIPMT-DATE            PIC   X(10) VALUE SPACES.    00058000
000581     05 TR074-SHIPMT-TIME            PIC   X(08) VALUE SPACES.    00058100
000582     05 TR074-SHIPMT-STATUS          PIC   X(02) VALUE SPACES.    00058200
000583     05 TR074-NEW-STATUS-DTE         PIC   X(10) VALUE SPACES.    00058300
000584                                                                  00058400
000585     05 FILLER                       PIC   X(31) VALUE SPACES.    00058500
