000100*****************************************************************         
000200*    RECORD PURPOSE: VESSEL/VOYAGE ARRIVAL DETAIL/ERROR DATA    *         
000300*                    FROM EDIT PROGRAM.                         *         
000400*    RECORD LENGTH:  508                              TOUTTR8   *         
000500*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD231   *         
000602*****************************************************************         
000603 01  TR231-RECORD.                                                        
000604                                                                          
000605*  -------------------------------------------------------------          
000606*  - THIS 05 LEVEL MOVED TO THE 1ST COLUMN OF WORK TBL TOUTTR8 -          
000607*  -------------------------------------------------------------          
000608   05 TR231-ARRVL-PAR-1-ODR.                                              
000609                                                                          
000610*    ---------------------------------------------------------            
000611*    - DATA COMMON TO ALL RECORD TYPES.                      -            
000612*    ---------------------------------------------------------            
000613     10  TR231-RPT-TYP                 PIC X(01).                         
000614         88 TR231-RPT-TYP-ERROR                VALUE 'E'.                 
000615         88 TR231-RPT-TYP-DETAIL               VALUE 'D'.                 
000616     10  TR231-PROCESS-SEQ-NBR         PIC 9(06)  VALUE ZERO.             
000617     10  TR231-TRN-TYP             PIC X(01).                             
000620        88 TR231-TRN-TYP-ADD                  VALUE 'A'.                  
000640        88 TR231-TRN-TYP-CHG                  VALUE 'C'.                  
000650        88 TR231-TRN-TYP-DEL                  VALUE 'D'.                  
000670     10 TR231-CONTNR-ID            PIC X(15)  VALUE SPACES.               
000800     10 TR231-EXTL-REF-NBR         PIC X(15)  VALUE SPACES.               
000900     10 TR231-PO-NBR               PIC 9(09)  VALUE ZEROES.               
001000     10 TR231-FOB-CDE              PIC X(03)  VALUE SPACES.               
001100     10 TR231-EXTENT-SCAC-CDE      PIC X(04)  VALUE SPACES.               
001300     10 TR231-DATA-IN-ERROR        PIC X(15)  VALUE SPACES.               
001400     10 TR231-DATA-VALUE-NUM.                                             
001500        15 TR231-DATA-VALUE-X      PIC 9(02)  VALUE ZERO.                 
001600        15 TR231-DATA-VALUE-N      PIC 9(15)V9(3) VALUE ZERO.             
001700     10 TR231-DATA-VALUE REDEFINES                                        
001800        TR231-DATA-VALUE-NUM       PIC X(20).                             
001900     10 TR231-ERROR-TYPE           PIC X(03)  VALUE SPACES.               
002000     10 TR231-ERROR-MSG            PIC X(50)  VALUE SPACES.               
002001     10 TR231-DAT-SRC-ENT-ID       PIC X(09)  VALUE SPACE.                
002010     10 FILLER                     PIC X(103) VALUE SPACES.               
002100                                                                          
002110*  -------------------------------------------------------------          
002120*  - THIS 05 LEVEL MOVED TO THE 2ND COLUMN OF WORK TBL TOUTTR8 -          
002130*  -------------------------------------------------------------          
002410   05 TR231-ARRVL-PAR-2-ODR.                                              
002411                                                                          
002420*    --------------------------------------------------------             
002430*    - INFO ABOUT THE HEADER ON THE ERROR OR DETAIL REPORT. -             
002440*    --------------------------------------------------------             
002500     10  TR231-REC-TYP-HDR.                                               
002600         15 TR231-REC-TYP-HDR-CDE      PIC X(06).                         
002700            88 TR231-REC-TYP-HDR-CDE-HDR          VALUE 'HDR   '.         
002800         15 TR231-HDR-SEQ-NBR          PIC X(02).                         
002900            88 TR231-HDR-SEQ-NBR-01               VALUE '01'.             
003000         15 TR231-HDR-3RD-PARTY-CDE    PIC X(06).                         
003100            88 TR231-HDR-3RD-PARTY-CDE-EI         VALUE '      '.         
003200         15 TR231-HDR-CONSOL-ENTNME    PIC X(30)  VALUE SPACES.           
003300         15 TR231-HDR-CONSOL-TRNS-DTE  PIC X(08)  VALUE SPACES.           
003400         15 TR231-HDR-CONSOL-TRNS-TM   PIC X(04)  VALUE SPACES.           
003500         15 TR231-HDR-CONSOL-FIL-ID    PIC X(09)  VALUE SPACES.           
003600         15 TR231-HDR-LOAD-DTE         PIC X(08)  VALUE SPACES.           
003700         15 TR231-HDR-LOAD-TM          PIC X(04)  VALUE SPACES.           
003800         15 TR231-HDR-FILLER           PIC X(177) VALUE SPACES.           
003900                                                                          
003910*    --------------------------------------------------------             
003920*    - INFO ABOUT ETA RECORDS SENT TO INDICATE WHEN THERE   -             
003921*    - IS A CHANGE TO VOYAGE ETA AFTER CONTAINER MANIFEST   -             
003922*    - IS SENT.                                             -             
003930*    --------------------------------------------------------             
004500     10 TR231-REC-TYP-ETA REDEFINES TR231-REC-TYP-HDR.                    
004600        15 TR231-REC-TYP-ETA-CDE        PIC X(06).                        
004700           88 TR231-REC-TYP-ETA-CDE-ETA           VALUE 'ETA   '.         
004800        15 TR231-ETA-SEQ-NBR            PIC X(02).                        
004900           88 TR231-ETA-SEQ-NBR-10                VALUE '10'.             
005000        15 TR231-ETA-3RD-PARTY-CDE      PIC X(06).                        
005100           88 TR231-ETA-3RD-PARTY-CDE-EI          VALUE '      '.         
005101        15 TR231-ETA-TRIP-TYP-CDE-MOM   PIC X(01).                        
005102           88 TR231-ETA-TRIP-TYP-MOM-AIR          VALUE 'A'.              
005103           88 TR231-ETA-TRIP-TYP-MOM-MOTOR        VALUE 'M'.              
005104           88 TR231-ETA-TRIP-TYP-MOM-OCEAN        VALUE 'O'.              
005110        15 TR231-ETA-CARR-SCAC-ID       PIC X(04).                        
005200        15 TR231-ETA-IMPRT-TRIP-ID      PIC X(10).                        
005400        15 TR231-ETA-IMPRT-VEH-NM       PIC X(25).                        
005410        15 TR231-ETA-DEST-POE-NM        PIC X(23).                        
005500        15 TR231-ETA-EST-POE-DELY-DTE   PIC X(08).                        
005600        15 TR231-ETA-EST-POE-DELY-TM    PIC X(04).                        
006500        15 TR231-ETA-EST-LBD-NM         PIC X(18).                        
006510        15 TR231-ETA-EST-LBD-DTE        PIC X(08).                        
006520        15 TR231-ETA-EST-LBD-TM         PIC X(04).                        
006530        15 TR231-ETA-FILLER             PIC X(135).                       
006700                                                                          
006751*    --------------------------------------------------------             
006753*    - REPORT INFO FOR ADU RECORDS SENT AFTER THE VESSEL    -             
006754*    - ARRIVES AT THE PORT OF ENTRY                         -             
006755*    --------------------------------------------------------             
006760     10 TR231-REC-TYP-ADU REDEFINES TR231-REC-TYP-HDR.                    
006770        15 TR231-REC-TYP-ADU-CDE        PIC X(06).                        
006780           88 TR231-REC-TYP-ADU-CDE-ADU           VALUE 'ADU   '.         
006790        15 TR231-ADU-SEQ-NBR            PIC X(02).                        
006791           88 TR231-ADU-SEQ-NBR-20                VALUE '20'.             
006792        15 TR231-ADU-3RD-PARTY-CDE      PIC X(06).                        
006793           88 TR231-ADU-3RD-PARTY-CDE-EI          VALUE '      '.         
006794        15 TR231-ADU-TRIP-TYP-CDE-MOM   PIC X(01).                        
006795           88 TR231-ADU-TRIP-TYP-MOM-AIR          VALUE 'A'.              
006796           88 TR231-ADU-TRIP-TYP-MOM-MOTOR        VALUE 'M'.              
006797           88 TR231-ADU-TRIP-TYP-MOM-OCEAN        VALUE 'O'.              
006798        15 TR231-ADU-CARR-SCAC-ID       PIC X(04).                        
006799        15 TR231-ADU-IMPRT-TRIP-ID      PIC X(10).                        
006800        15 TR231-ADU-IMPRT-VEH-NM       PIC X(25).                        
006801        15 TR231-ADU-ACTL-DEST-POE-NM   PIC X(30).                        
006802        15 TR231-ADU-ACTL-POE-DELY-DTE  PIC X(08).                        
006803        15 TR231-ADU-ACTL-POE-DELY-TM   PIC X(04).                        
006804        15 TR231-ADU-FILLER             PIC X(158).                       
006805                                                                          
006806*    --------------------------------------------------------             
006807*    - REPORT INFO FOR ADU RECORDS SENT AFTER THE VESSEL    -             
006808*    - ARRIVES AT THE PORT OF ENTRY                         -             
006809*    - ADURD IS AN ADU FROM THE RECYCLE FILE. CREATED IN    -             
006810*    - CONTAINER LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.  -             
006812*    --------------------------------------------------------             
006813     10 TR231-REC-TYP-ADURD REDEFINES TR231-REC-TYP-HDR.                  
006814        15 TR231-REC-TYP-ADURD-CDE      PIC X(06).                        
006815           88 TR231-REC-TYP-ADURD-CDE-ADURDA      VALUE 'ADURDA'.         
006816        15 TR231-ADURD-SEQ-NBR            PIC X(02).                      
006817           88 TR231-ADURD-SEQ-NBR-20              VALUE '30'.             
006822        15 TR231-ADURD-3RD-PARTY-CDE    PIC X(06).                        
006823           88 TR231-ADURD-3RD-PARTY-CDE-EI        VALUE '      '.         
006824        15 TR231-ADURD-TRIP-TYP-CDE-MOM PIC X(01).                        
006825           88 TR231-ADURD-TRIP-TYP-MOM-AIR        VALUE 'A'.              
006826           88 TR231-ADURD-TRIP-TYP-MOM-MOTOR      VALUE 'M'.              
006827           88 TR231-ADURD-TRIP-TYP-MOM-OCEAN      VALUE 'O'.              
006828        15 TR231-ADURD-CARR-SCAC-ID     PIC X(04).                        
006829        15 TR231-ADURD-IMPRT-TRIP-ID    PIC X(10).                        
006830        15 TR231-ADURD-IMPRT-VEH-NM     PIC X(25).                        
006831        15 TR231-ADURD-ACTL-DEST-POE-NM PIC X(30).                        
006832        15 TR231-ADURD-ACTL-POE-DELY-DTE PIC X(08).                       
006833        15 TR231-ADURD-ACTL-POE-DELY-TM PIC X(04).                        
006834        15 TR231-ADURD-TEXT-MSG1        PIC X(40).                        
006835        15 TR231-ADURD-FILLER           PIC X(118).                       
006840*                                                                         
