000100***************************************************************** 00010000
000200*    RECORD PURPOSE: RECORD LAYOUT FOR EDITED IMPORT ORIGIN     * 00020000
000300*                    BOOKING DATA.                              * 00030000
000400*    RECORD LENGTH:  300                                        * 00040005
000500*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD024   * 00050000
000501***************************************************************** 00050101
000502* NOTE: THE RECORD LENGTH WAS INCREASED FROM 165 TO 300 BYTES   * 00050201
000503*        IN 4/2000. THIS IS SO KOHLS CAN ADD ENT-ID AND FILE-ID * 00050301
000504*        PRESENTLY, AND POSSIBLY OTHER FIELDS IN THE FUTURE     * 00050401
000600***************************************************************** 00060000
000700* ESTIMATED TRIP  (VESSEL, AIR, MOTOR).                         * 00070000
000800* THE DATE ON WHICH THE CARRIER IS EXPECTED TO DEPART.          * 00080000
000900* EDL AND EDD RECORD TYPES ARE SENT TOGETHER AS A SET.          * 00090000
001000***************************************************************** 00100000
001100 01  TR024-REC-TYP-EDD.                                           00110000
001200     05 TR024-EDD-REC-KEY.                                        00120000
001300        10 TR024-EDD-TRN-TYP            PIC X(01).                00130000
001400           88 TR024-EDD-TRN-TYP-ADD                VALUE 'A',     00140000
001500                                                         'B',     00150000
001600                                                         'Z'.     00160000
001700           88 TR024-EDD-TRN-TYP-CHG                VALUE 'C'.     00170000
001800           88 TR024-EDD-TRN-TYP-DEL                VALUE 'D',     00180000
001900                                                         'E'.     00190000
002000        10 TR024-EDD-REC-TYP-CDE        PIC X(06).                00200000
002100           88 TR024-EDD-REC-TYP-CDE-EDD            VALUE 'EDD   '.00210000
002200        10 TR024-EDD-SEQ-NBR            PIC X(02).                00220000
002300           88 TR024-EDD-SEQ-NBR-10                 VALUE '10'.    00230000
002400        10 TR024-EDD-3RD-PARTY-CDE      PIC X(06).                00240000
002500           88 TR024-EDD-3RD-PARTY-CDE-EI           VALUE '      '.00250000
002600        10 TR024-EDD-PO-NBR             PIC 9(09).                00260000
002610        10 TR024-EDD-PO-NBR-X REDEFINES                           00261000
002620           TR024-EDD-PO-NBR             PIC X(09).                00262000
002630        10 TR024-EDD-EXTL-REF-NBR       PIC X(15).                00263000
002640        10 TR024-EDD-PO-BKG-DELY-DTE    PIC X(08).                00264000
002650        10 TR024-EDD-PO-BKG-DELY-TM     PIC X(04).                00265000
002660        10 TR024-EDD-ORGN-SHPD-FR-CDE   PIC X(03).                00266000
002670           88 TR024-EDD-ORGN-SHPD-FR-CFS         VALUE 'CFS'.     00267000
002680           88 TR024-EDD-ORGN-SHPD-FR-CY          VALUE 'CY '.     00268000
002690        10 TR024-EDD-IMPRT-TRIP-ID      PIC X(10).                00269000
002700        10 TR024-EDD-CARR-SCAC-ID       PIC X(04).                00270000
002800     05 TR024-EDD-IMPRT-VEH-NM          PIC X(25).                00280000
002900     05 TR024-EDD-POE-DELY-DTE          PIC X(08).                00290000
003000     05 TR024-EDD-POE-DELY-TM           PIC X(04).                00300000
003100     05 TR024-EDD-DPRTR-DTE             PIC X(08).                00310000
003200     05 TR024-EDD-DPRTR-TM              PIC X(04).                00320000
003300     05 TR024-EDD-FOB-CDE               PIC X(05).                00330000
003400     05 TR024-EDD-DEST-POE-CDE          PIC X(04).                00340000
003500     05 TR024-EDD-TRIP-TYP-CDE          PIC X(01).                00350000
003600        88 TR024-EDD-TRIP-TYP-CDE-AIR              VALUE 'A'.     00360000
003700        88 TR024-EDD-TRIP-TYP-CDE-MOTOR            VALUE 'M'.     00370000
003800        88 TR024-EDD-TRIP-TYP-CDE-OCEAN            VALUE 'O'.     00380000
003900     05 TR024-EDD-EST-LBD-NM            PIC X(18).                00390000
004000     05 TR024-EDD-FILLER                PIC X(131).               00400004
004201     05 TR024-EDD-FILE-ID               PIC X(09).                00420101
004202     05 TR024-EDD-ENT-ID                PIC 9(09).                00420201
004203     05 TR024-EDD-PROCESS-SEQ-NBR       PIC 9(06).                00420304
004300*                                                                 00430000
004400***************************************************************** 00440000
004500* ESTIMATED TRIP (VESSEL, AIR, MOTOR).                          * 00450000
004600* THE REASON THE PURCHASE ORDER NEEDED TO BE RE-BOOKED ON A     * 00460000
004700* DIFFERENT VOYAGE.  IF NOT RE-BOOKED AN EDDRSN RECORD WON'T    * 00470000
004800* BE TRANSMITTED.                                               * 00480000
004900***************************************************************** 00490000
005000 01  TR024-REC-TYP-EDDRSN REDEFINES TR024-REC-TYP-EDD.            00500000
005100     05 TR024-EDDRSN-REC-KEY.                                     00510000
005200        10 TR024-EDDRSN-TRN-TYP         PIC X(01).                00520000
005300           88 TR024-EDDRSN-TRN-TYP-ADD             VALUE 'A',     00530000
005400                                                         'B',     00540000
005500                                                         'Z'.     00550000
005600           88 TR024-EDDRSN-TRN-TYP-CHG             VALUE 'C'.     00560000
005700           88 TR024-EDDRSN-TRN-TYP-DEL             VALUE 'D',     00570000
005800                                                         'E'.     00580000
005900        10 TR024-EDDRSN-REC-TYP-CDE     PIC X(06).                00590000
006000           88 TR024-EDDRSN-REC-TYP-CD-EDDRSN     VALUE 'EDDRSN'.  00600000
006100        10 TR024-EDDRSN-SEQ-NBR         PIC X(02).                00610000
006200           88 TR024-EDDRSN-SEQ-NBR-11              VALUE '11'.    00620000
006300        10 TR024-EDDRSN-3RD-PARTY-CDE   PIC X(06).                00630000
006400           88 TR024-EDDRSN-3RD-PARTY-CDE-EI        VALUE '      '.00640000
006500        10 TR024-EDDRSN-PO-NBR          PIC 9(09).                00650000
006600        10 TR024-EDDRSN-PO-NBR-X REDEFINES                        00660000
006700           TR024-EDDRSN-PO-NBR          PIC X(09).                00670000
006800        10 TR024-EDDRSN-EXTL-REF-NBR    PIC X(15).                00680000
006900        10 TR024-EDDRSN-PO-BKG-DELY-DTE PIC X(08).                00690000
007000        10 TR024-EDDRSN-PO-BKG-DELY-TM  PIC X(04).                00700000
007001        10 TR024-EDDRSN-ORGN-SHPD-FR-CDE PIC X(03).               00700100
007002           88 TR024-EDDRSN-ORGN-SHPD-FR-CFS      VALUE 'CFS'.     00700200
007003           88 TR024-EDDRSN-ORGN-SHPD-FR-CY       VALUE 'CY '.     00700300
007004        10 TR024-EDDRSN-IMPRT-TRIP-ID   PIC X(10).                00700400
007005        10 TR024-EDDRSN-CARR-SCAC-ID    PIC X(04).                00700500
007006     05 TR024-EDDRSN-POE-DELY-DTE       PIC X(08).                00700600
007007     05 TR024-EDDRSN-POE-DELY-TM        PIC X(04).                00700700
007008     05 TR024-EDDRSN-DPRTR-DTE          PIC X(08).                00700800
007009     05 TR024-EDDRSN-DPRTR-TM           PIC X(04).                00700900
007010     05 TR024-EDDRSN-VOY-CHG-RSN-DESC   PIC X(30).                00701000
007020     05 TR024-EDDRSN-FILLER             PIC X(154).               00702004
007031     05 TR024-EDDRSN-FILE-ID            PIC X(09).                00703101
007032     05 TR024-EDDRSN-ENT-ID             PIC 9(09).                00703201
007033     05 TR024-EDDRSN-PROCESS-SEQ-NBR    PIC 9(06).                00703304
007040*                                                                 00704000
007050***************************************************************** 00705000
007060* PRE-BOOKING -- ESTIMATED FOB DELIVERY DATE                    * 00706000
007070* FOR CARGO FORWARDERS SERVICE (CFS), THE DATE THE PURCHASE     * 00707000
007080* ORDER IS SCHEDULED TO BE DROPPED OFF AT THE CONSOLIDATOR BY   * 00708000
007090* THE FACTORY.                                                  * 00709000
007100* FOR CARRIER'S YARD (CY) SHIPMENTS, THE DATE THE PURCHASE      * 00710000
007200* ORDER IS SCHEDULED TO BE DROPPED OFF AT THE CARRIER'S YARD BY * 00720000
007300* THE FACTORY.                                                  * 00730000
007400***************************************************************** 00740000
007500 01  TR024-REC-TYP-EDL REDEFINES TR024-REC-TYP-EDDRSN.            00750000
007600     05 TR024-EDL-REC-KEY.                                        00760000
007700        10 TR024-EDL-TRN-TYP            PIC X(01).                00770000
007800           88 TR024-EDL-TRN-TYP-ADD              VALUE 'A',       00780000
007900                                                       'B',       00790000
008000                                                       'Z'.       00800000
008100           88 TR024-EDL-TRN-TYP-CHG              VALUE 'C'.       00810000
008200           88 TR024-EDL-TRN-TYP-DEL              VALUE 'D',       00820000
008300                                                       'E'.       00830000
008400        10 TR024-EDL-REC-TYP-CDE        PIC X(06).                00840000
008500           88 TR024-EDL-REC-TYP-CDE-EDL          VALUE 'EDL   '.  00850000
008600        10 TR024-EDL-SEQ-NBR            PIC X(02).                00860000
008700           88 TR024-EDL-SEQ-NBR-20               VALUE '20'.      00870000
008800        10 TR024-EDL-3RD-PARTY-CDE      PIC X(06).                00880000
008900           88 TR024-EDL-3RD-PARTY-CDE-EI         VALUE '      '.  00890000
009000        10 TR024-EDL-PO-NBR             PIC 9(09).                00900000
009100        10 TR024-EDL-PO-NBR-X REDEFINES                           00910000
009200           TR024-EDL-PO-NBR             PIC X(09).                00920000
009300        10 TR024-EDL-EXTL-REF-NBR       PIC X(15).                00930000
009400        10 TR024-EDL-PO-BKG-DELY-DTE    PIC X(08).                00940000
009500        10 TR024-EDL-PO-BKG-DELY-TM     PIC X(04).                00950000
009600        10 TR024-EDL-ORGN-SHPD-FR-CDE   PIC X(03).                00960000
009700           88 TR024-EDL-ORGN-SHPD-FR-CFS         VALUE 'CFS'.     00970000
009800           88 TR024-EDL-ORGN-SHPD-FR-CY          VALUE 'CY '.     00980000
009900     05 TR024-EDL-PROD-FCTRY-NM         PIC X(35).                00990000
010000     05 TR024-EDL-C-O-PROD-CDE          PIC X(03).                01000000
010100     05 TR024-EDL-PO-CART-CNT           PIC 9(09).                01010000
010200     05 TR024-EDL-PO-CART-CNT-X REDEFINES                         01020000
010300        TR024-EDL-PO-CART-CNT           PIC X(09).                01030000
010400     05 TR024-EDL-PO-UNT-QTY            PIC 9(09).                01040000
010500     05 TR024-EDL-PO-UNT-QTY-X REDEFINES                          01050000
010600        TR024-EDL-PO-UNT-QTY            PIC X(09).                01060000
010700     05 TR024-EDL-PO-CBMT-QTY           PIC 9(07)V99.             01070000
010800     05 TR024-EDL-PO-CBMT-QTY-X REDEFINES                         01080000
010900        TR024-EDL-PO-CBMT-QTY           PIC X(09).                01090000
011000     05 TR024-EDL-PO-WT-KGRM-QTY        PIC 9(09).                01100000
011100     05 TR024-EDL-PO-WT-KGRM-QTY-X REDEFINES                      01110000
011200        TR024-EDL-PO-WT-KGRM-QTY        PIC X(09).                01120000
011300     05 TR024-EDL-CONSOL-SCAC-ID        PIC X(04).                01130000
011400     05 TR024-EDL-FILLER                PIC X(144).               01140004
011501     05 TR024-EDL-FILE-ID               PIC X(09).                01150101
011502     05 TR024-EDL-ENT-ID                PIC 9(09).                01150201
011503     05 TR024-EDL-PROCESS-SEQ-NBR       PIC 9(06).                01150304
011600*                                                                 01160001
011700***************************************************************** 01170000
011800* PRE-BOOKING  --ESTIMATED FOB DELIVERY DATE.                   * 01180000
011900* VENDOR STYLE RECORD.                                          * 01190000
012000* THIS SEGMENT IS REPEATED FOR EACH VENDOR STYLE.               * 01200000
012100***************************************************************** 01210000
012200 01  TR024-REC-TYP-EDLVS REDEFINES TR024-REC-TYP-EDL.             01220000
012300     05 TR024-EDLVS-REC-KEY.                                      01230000
012400        10 TR024-EDLVS-TRN-TYP          PIC X(01).                01240000
012500           88 TR024-EDLVS-TRN-TYP-ADD              VALUE 'A',     01250000
012600                                                         'B',     01260000
012700                                                         'Z'.     01270000
012800           88 TR024-EDLVS-TRN-TYP-CHG              VALUE 'C'.     01280000
012900           88 TR024-EDLVS-TRN-TYP-DEL              VALUE 'D',     01290000
013000                                                         'E'.     01300000
013100        10 TR024-EDLVS-REC-TYP-CDE      PIC X(06).                01310000
013200           88 TR024-EDLVS-REC-TYP-CDE-EDLVS        VALUE 'EDLVS '.01320000
013300        10 TR024-EDLVS-SEQ-NBR          PIC X(02).                01330000
013400           88 TR024-EDLVS-SEQ-NBR-21               VALUE '21'.    01340000
013500        10 TR024-EDLVS-3RD-PARTY-CDE    PIC X(06).                01350000
013600           88 TR024-EDLVS-3RD-PARTY-CDE-EI         VALUE '      '.01360000
013700        10 TR024-EDLVS-PO-NBR           PIC 9(09).                01370000
013800        10 TR024-EDLVS-PO-NBR-X REDEFINES                         01380000
013900           TR024-EDLVS-PO-NBR           PIC X(09).                01390000
014000        10 TR024-EDLVS-EXTL-REF-NBR     PIC X(15).                01400000
014100        10 TR024-EDLVS-PO-BKG-DELY-DTE  PIC X(08).                01410000
014200        10 TR024-EDLVS-PO-BKG-DELY-TM   PIC X(04).                01420000
014300        10 TR024-EDLVS-ORGN-SHPD-FR-CDE PIC X(03).                01430000
014400           88 TR024-EDLVS-ORGN-SHPD-FR-CFS       VALUE 'CFS'.     01440000
014500           88 TR024-EDLVS-ORGN-SHPD-FR-CY        VALUE 'CY '.     01450000
014600     05 TR024-EDLVS-VS-NBR              PIC X(20).                01460000
014700     05 TR024-EDLVS-VS-CART-CNT         PIC 9(09).                01470000
014710     05 TR024-EDLVS-VS-CART-CNT-X REDEFINES                       01471000
014720        TR024-EDLVS-VS-CART-CNT         PIC X(09).                01472000
014730     05 TR024-EDLVS-VS-UNT-QTY          PIC 9(09).                01473000
014740     05 TR024-EDLVS-VS-UNT-QTY-X REDEFINES                        01474000
014750        TR024-EDLVS-VS-UNT-QTY          PIC X(09).                01475000
014760     05 TR024-EDLVS-VS-CBMT-QTY         PIC 9(07)V99.             01476000
014770     05 TR024-EDLVS-VS-CBMT-QTY-X REDEFINES                       01477000
014780        TR024-EDLVS-VS-CBMT-QTY         PIC X(09).                01478000
014790     05 TR024-EDLVS-VS-WT-KGRM-QTY      PIC 9(09).                01479000
014800     05 TR024-EDLVS-VS-WT-KGRM-QTY-X REDEFINES                    01480000
014900        TR024-EDLVS-VS-WT-KGRM-QTY      PIC X(09).                01490000
015000     05 TR024-EDLVS-FILLER              PIC X(166).               01500004
015101     05 TR024-EDLVS-FILE-ID             PIC X(09).                01510101
015102     05 TR024-EDLVS-ENT-ID              PIC 9(09).                01510201
015103     05 TR024-EDLVS-PROCESS-SEQ-NBR     PIC 9(06).                01510304
015200*                                                                 01520000
015300***************************************************************** 01530000
015400* PRE-BOOKING  --ESTIMATED FOB DELIVERY DATE.                   * 01540000
015500* UPC RECORD.                                                   * 01550000
015600* THIS SEGMENT IS REPEATED FOR EACH UPC.                        * 01560000
015700***************************************************************** 01570000
015800 01  TR024-REC-TYP-EDLUPC REDEFINES TR024-REC-TYP-EDLVS.          01580000
015900     05 TR024-EDLUPC-REC-KEY.                                     01590000
016000        10 TR024-EDLUPC-TRN-TYP         PIC X(01).                01600000
016100           88 TR024-EDLUPC-TRN-TYP-ADD             VALUE 'A',     01610000
016200                                                         'B',     01620000
016300                                                         'Z'.     01630000
016400           88 TR024-EDLUPC-TRN-TYP-CHG             VALUE 'C'.     01640000
016500           88 TR024-EDLUPC-TRN-TYP-DEL             VALUE 'D',     01650000
016600                                                         'E'.     01660000
016700        10 TR024-EDLUPC-REC-TYP-CDE     PIC X(06).                01670000
016800           88 TR024-EDLUPC-REC-TYP-CD-EDLUPC       VALUE 'EDLUPC'.01680000
016900        10 TR024-EDLUPC-SEQ-NBR         PIC X(02).                01690000
017000           88 TR024-EDLUPC-SEQ-NBR-22              VALUE '22'.    01700000
017100        10 TR024-EDLUPC-3RD-PARTY-CDE   PIC X(06).                01710000
017200           88 TR024-EDLUPC-3RD-PARTY-CDE-EI        VALUE '      '.01720000
017300        10 TR024-EDLUPC-PO-NBR          PIC 9(09).                01730000
017400        10 TR024-EDLUPC-PO-NBR-X REDEFINES                        01740000
017410           TR024-EDLUPC-PO-NBR          PIC X(09).                01741000
017420        10 TR024-EDLUPC-EXTL-REF-NBR    PIC X(15).                01742000
017430        10 TR024-EDLUPC-PO-BKG-DELY-DTE PIC X(08).                01743000
017440        10 TR024-EDLUPC-PO-BKG-DELY-TM  PIC X(04).                01744000
017450        10 TR024-EDLUPC-ORGN-SHPD-FR-CDE   PIC X(03).             01745000
017460           88 TR024-EDLUPC-ORGN-SHPD-FR-CFS      VALUE 'CFS'.     01746000
017470           88 TR024-EDLUPC-ORGN-SHPD-FR-CY       VALUE 'CY '.     01747000
017480     05 TR024-EDLUPC-VS-NBR             PIC X(20).                01748000
017490     05 TR024-EDLUPC-UPC-NBR            PIC 9(15).                01749000
017500     05 TR024-EDLUPC-UPC-NBR-X REDEFINES                          01750000
017600        TR024-EDLUPC-UPC-NBR            PIC X(15).                01760000
017700     05 TR024-EDLUPC-UPC-CART-CNT       PIC 9(09).                01770000
017800     05 TR024-EDLUPC-UPC-CART-CNT-X REDEFINES                     01780000
017900        TR024-EDLUPC-UPC-CART-CNT       PIC X(09).                01790000
018000     05 TR024-EDLUPC-UPC-UNT-QTY        PIC 9(09).                01800000
018100     05 TR024-EDLUPC-UPC-UNT-QTY-X REDEFINES                      01810000
018110        TR024-EDLUPC-UPC-UNT-QTY        PIC X(09).                01811000
018120     05 TR024-EDLUPC-UPC-CBMT-QTY       PIC 9(07)V99.             01812000
018130     05 TR024-EDLUPC-UPC-CBMT-QTY-X REDEFINES                     01813000
018140        TR024-EDLUPC-UPC-CBMT-QTY       PIC X(09).                01814000
018150     05 TR024-EDLUPC-UPC-WT-KGRM-QTY    PIC 9(09).                01815000
018160     05 TR024-EDLUPC-UPC-WT-KGRM-QTY-X REDEFINES                  01816000
018170        TR024-EDLUPC-UPC-WT-KGRM-QTY    PIC X(09).                01817000
018180     05 TR024-EDLUPC-FILLER             PIC X(151).               01818004
018191     05 TR024-EDLUPC-FILE-ID            PIC X(09).                01819101
018192     05 TR024-EDLUPC-ENT-ID             PIC 9(09).                01819201
018193     05 TR024-EDLUPC-PROCESS-SEQ-NBR    PIC 9(06).                01819304
