       01  TR049-TRIP-TABLE.                                                    
           05  TR049-EST-AR-TMST             PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR049-OWNER-SCAC-ID           PIC X(04)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR049-TRIP-ID                 PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR049-VEH-NBR                 PIC X(10)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR049-TIMESTAMP               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(30)  VALUE SPACES.           
