000100**************************************************************            
016300* THIS IS THE COPYBOOK OF VARIABLES FOR COPYBOOK TRPD266.                 
016301**************************************************************            
016302* FOR THE DECON CONTROL PANEL, DETERMINE BEGINING AND ENDING              
016303* DATE OF THE WEEK FOR THE WORKING DECONSOLIDATOR WINDOW.                 
016304* AS OF JULY 2004, THE WINDOW IS THURSDAY THRU WEDNESDAY.                 
016305**************************************************************            
016306* CHOOSE THE DAY TO START WEEK TO BE HARD CODED HERE.                     
016307* I.E. IF WEEK BEGINS WITH MONDAY, PC-266-START-DAY-VAL                   
016308* SHOULD EQUAL 2.                                                         
016310*     SUN = 1                                                             
016400*     MON = 2                                                             
016500*     TUE = 3                                                             
016600*     WED = 4                                                             
016700*     THR = 5                                                             
016710*     FRI = 6                                                             
016720*     SAT = 7                                                             
016730                                                                          
016731* CURRENTLY THE WEEK WILL START THURSDAY AND END WEDNESDAY                
016740 01  PC-TRPD266-CONSTANTS.                                                
016800     05  PC-266-START-DAY-VAL            PIC S9(1)   VALUE 5.             
017000                                                                          
019300                                                                          
019400 01  PV-TRPD266-VARIABLES.                                                
019500     05  PV-266-DAY-OF-WEEK              PIC S9(04)   COMP.               
019600     05  PV-266-DAYS-BACK                PIC S9(04)   COMP.               
019700*        YYYY-MM-DD                                                       
023200     05  PV-266-DATE-ENTERED             PIC  X(10).                      
023300     05  PV-266-BEGIN-DATE               PIC  X(10).                      
023400     05  PV-266-END-DATE                 PIC  X(10).                      
023900                                                                          
023901 01  PV-TRPD266-SWITCHES.                                                 
024000     05  PS-266-ERRORS-SW             PIC  X(01)  VALUE  'N'.             
024100         88  PS-266-ERRORS                        VALUE  'Y'.             
024200         88  PS-266-ERRORS-NO                     VALUE  'N'.             
