      ******************************************************************00030001
      *                         TRRD960                                *00040001
      *                                                                *00050001
      *   THIS LAYOUT IS FOR THE RECORDS RESULTED OUT OF THE QUERY     *00060001
      *                                                                *00080001
      *   LENGTH:183 BYTES                                             *00090001
      ******************************************************************00100001
       01  TR960-RECORD.                                                        
           10 TR960-RUL-ID                  PIC  S9(09) COMP.                   
           10 TR960-RUL-CNSTR-CDE           PIC  S9(04) COMP.                   
           10 TR960-RUL-CNSTR-TYP-CDE       PIC   X(04).                        
           10 TR960-RUL-CDE                 PIC   X(03).                        
           10 TR960-RUL-CNSTR-VAL-DECON     PIC   X(30).                        
           10 TR960-RUL-CNSTR-VAL-VESSEL    PIC   X(30).                        
           10 TR960-RUL-CNSTR-VAL-CONT      PIC   X(30).                        
           10 FILLER                        PIC   X(01).                        
           10 TR960-RUL-CNSTR-VAL-POE       PIC   X(30).                        
           10 TR960-RUL-ETA                 PIC   X(10).                        
           10 TR960-RUL-CREATE              PIC   X(10).                        
           10 TR960-RUL-WEEK-BEGIN          PIC   X(10).                        
           10 TR960-RUL-WEEK-END            PIC   X(10).                        
           10 FILLER                        PIC   X(01).                        
           10 TR960-RUL-CRE-BY-USR-ID       PIC   X(08).                        
