000100***************************************************************** 00010000
       01  TR040-PO-TABLE.                                              00020002
           05  TR040-ENT-NAME-DESC              PIC X(30)  VALUE SPACES.00030003
           05  FILLER                           PIC X(01)  VALUE '|'.   00040002
           05  TR040-DMA-NBR                    PIC X(03)  VALUE SPACES.00050003
           05  FILLER                           PIC X(01)  VALUE '|'.   00060002
           05  TR040-DONT-SHIP-BEF-DTE          PIC X(10)  VALUE SPACES.00070003
           05  FILLER                           PIC X(01)  VALUE '|'.   00080002
           05  TR040-EXT-CAN-DTE                PIC X(10)  VALUE SPACES.00090003
           05  FILLER                           PIC X(01)  VALUE '|'.   00100002
           05  TR040-FOB-CDE                    PIC X(03)  VALUE SPACES.00110003
           05  FILLER                           PIC X(01)  VALUE '|'.   00120002
           05  TR040-LAST-FCTRY-DTE             PIC X(10)  VALUE SPACES.00130003
           05  FILLER                           PIC X(01)  VALUE '|'.   00140002
           05  TR040-POE-CDE                    PIC X(03)  VALUE SPACES.00150003
           05  FILLER                           PIC X(01)  VALUE '|'.   00160002
           05  TR040-STRT-FCTRY-DTE             PIC X(10)  VALUE SPACES.00170003
           05  FILLER                           PIC X(01)  VALUE '|'.   00180002
           05  TR040-DEPT-NBR                   PIC X(03)  VALUE SPACES.00190003
           05  FILLER                           PIC X(01)  VALUE '|'.   00200002
           05  TR040-EDI-IND                    PIC X(01)  VALUE SPACES.00210003
           05  FILLER                           PIC X(01)  VALUE '|'.   00220002
           05  TR040-OTB-PER-NBR                PIC X(06)  VALUE SPACES.00230003
           05  FILLER                           PIC X(01)  VALUE '|'.   00240002
P47386     05  TR040-OTB-WEEK                   PIC 9(01)  VALUE ZERO.  00241012
P47386     05  FILLER                           PIC X(01)  VALUE '|'.   00242012
           05  TR040-PKGNG-CDE                  PIC X(01)  VALUE SPACES.00250003
           05  FILLER                           PIC X(01)  VALUE '|'.   00260002
           05  TR040-PO-NBR                     PIC 9(09)  VALUE ZERO.  00270003
           05  FILLER                           PIC X(01)  VALUE '|'.   00280002
           05  TR040-PO-TYP-CDE                 PIC X(02)  VALUE SPACES.00290005
           05  FILLER                           PIC X(01)  VALUE '|'.   00300002
           05  TR040-PROD-CNTRY-CDE             PIC X(03)  VALUE SPACES.00310003
           05  FILLER                           PIC X(01)  VALUE '|'.   00320002
           05  TR040-QTA-CTG-CDE                PIC X(05)  VALUE SPACES.00330003
           05  FILLER                           PIC X(01)  VALUE '|'.   00340002
           05  TR040-SEASET-SHRT-NM             PIC X(05)  VALUE SPACES.00350003
           05  FILLER                           PIC X(01)  VALUE '|'.   00360002
           05  TR040-STATUS-CDE                 PIC X(02)  VALUE SPACES.00370003
           05  FILLER                           PIC X(01)  VALUE '|'.   00380002
           05  TR040-TIMESTAMP                  PIC X(26)  VALUE SPACES.00390003
           05  FILLER                           PIC X(01)  VALUE '|'.   00400006
P47386     05  TR040-EST-CLR-TMST               PIC X(26)  VALUE SPACES.00410006
P47386     05  FILLER                           PIC X(01)  VALUE '|'.   00420006
P47386     05  TR040-ACTL-CLR-TMST              PIC X(26)  VALUE SPACES.00430006
P47386     05  FILLER                           PIC X(01)  VALUE '|'.   00440006
P47386     05  TR040-ATA                        PIC X(05)  VALUE SPACES.00450006
P47386     05  FILLER                           PIC X(01)  VALUE '|'.   00460006
P47386     05  TR040-FIRST-RCPT-DTE             PIC X(08)  VALUE SPACES.00470006
P47386     05  FILLER                           PIC X(01)  VALUE '|'.   00480011
P47386     05  TR040-COST-AMT                   PIC 9(8).9(2).          00490008
P47386     05  FILLER                           PIC X(01)  VALUE '|'.   00500006
P47386     05  TR040-RTL-AMT                    PIC 9(8).9(2).          00510008
P47386     05  FILLER                           PIC X(01)  VALUE '|'.   00520006
P47386     05  TR040-UNT-QTY                    PIC 9(09).              00530009
P47386     05  FILLER                           PIC X(29)  VALUE SPACES.00540011
