       01  TR048-SHIPMENT-TABLE.                                                
           05  TR048-BOL-NBR                 PIC X(30)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR048-PRO-NBR                 PIC X(22)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR048-SHIPT-ID                PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR048-TRIP-ID                 PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR048-TIMESTAMP               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(30)  VALUE SPACES.           
