000100***************************************************************** 00010000
000200*    RECORD PURPOSE: OUTPUT RECORD OF DC SPLIT INFORMATION THAT * 00020000
000300*                    IS SENT TO THE DECONSOLIDATOR FOR IMPORT   * 00030000
000400*                    MERCHANDISE.  THIS RECORD CONTAINS THE     * 00040000
000500*                    SHIPPING DATA AND PO ORDER DATA WHERE THE  * 00050000
000600*                    CONTAINER ISN'T RECEIVED OR CONTAINER LEVEL* 00060000
000700*                    SPLIT DATA WHERE THE CONTAINER IS RECEIVED * 00070000
000800*    RECORD LENGTH:  200                                        * 00080000
000900*    RECORD FORMAT:  SEQUENTIAL                     TRRD004     * 00090000
001000***************************************************************** 00100000
001100                                                                  00110000
001200 01  TR004-REC-TYPE-POE.                                          00120000
001300     05 TR004-REC-TYPE-CDE-POE            PIC X(03)  VALUE 'POE'. 00130000
001400     05 TR004-PROCESS-POE                 PIC X(08).              00140000
001500        88 TR004-PROCESS-POE-RETRANS-CON        VALUE 'RTRNSCON'. 00150000
001600        88 TR004-PROCESS-POE-RETRANS-CMN        VALUE 'RTRNSCMN'. 00160000
001700        88 TR004-PROCESS-POE-TRANSMISSION       VALUE 'TRANSMSN'. 00170000
001800*    PORT-OF-ENTRY-LOC NOT USED FOR RTRNSCON                      00180000
001900     05 TR004-PORT-OF-ENTRY-CTY           PIC X(30)  VALUE SPACE. 00190000
002000     05 FILLER                            PIC X(208) VALUE SPACE. 00200000
002100     05 FILLER                            PIC X(01)  VALUE X'15'. 00210000
002200                                                                  00220000
002300 01  TR004-REC-TYPE-ETA.                                          00230000
002400     05 TR004-REC-TYPE-CDE-ETA            PIC X(03)  VALUE 'ETA'. 00240000
002500     05 TR004-PROCESS-ETA                 PIC X(08).              00250000
002600        88 TR004-PROCESS-ETA-RETRANS-CON        VALUE 'RTRNSCON'. 00260000
002700        88 TR004-PROCESS-ETA-RETRANS-CMN        VALUE 'RTRNSCMN'. 00270000
002800        88 TR004-PROCESS-ETA-TRANSMISSION       VALUE 'TRANSMSN'. 00280000
002900*    VESSEL-ETA-DATE NOT USED FOR RTRNSCON                        00290000
003000     05 TR004-VESSEL-ETA-DATE             PIC X(08)  VALUE SPACE. 00300000
003100     05 FILLER                            PIC X(230) VALUE SPACE. 00310000
003200     05 FILLER                            PIC X(01)  VALUE X'15'. 00320000
003300                                                                  00330000
003400 01  TR004-REC-TYPE-VES.                                          00340000
003500     05 TR004-REC-TYPE-CDE-VES            PIC X(03)  VALUE 'VES'. 00350000
003600     05 TR004-PROCESS-VES                 PIC X(08).              00360000
003700        88 TR004-PROCESS-VES-RETRANS-CON        VALUE 'RTRNSCON'. 00370000
003800        88 TR004-PROCESS-VES-RETRANS-CMN        VALUE 'RTRNSCMN'. 00380000
003900        88 TR004-PROCESS-VES-TRANSMISSION       VALUE 'TRANSMSN'. 00390000
004000*    VESSEL AND TRIP-TYP-CDE NOT USED FOR RTRNSCON                00400000
004100     05 TR004-VESSEL-NAME                 PIC X(10)  VALUE SPACE. 00410000
004200     05 TR004-TRIP-TYP-CDE                PIC X(01)  VALUE SPACE. 00420000
004210     05 TR004-VOYAGE-ID-NBR               PIC X(10)  VALUE SPACE. 00430000
004220     05 TR004-CARR-SCAC-ID                PIC X(04)  VALUE SPACE. 00440000
004300     05 FILLER                            PIC X(213) VALUE SPACE. 00450000
004400     05 FILLER                            PIC X(01)  VALUE X'15'. 00460000
004500                                                                  00470000
004600*    CON-CONTAINER SPLITS FROM ORDERED DATA                       00480000
004700*    CMN-CONTAINER LEVEL SPLITS FROM SHIPPED DATA                 00490000
004800 01  TR004-REC-TYPE-CONTAINER.                                    00500000
004900     05 TR004-REC-TYPE-CDE-CONTAINER      PIC X(03).              00510000
005000        88 TR004-REC-TYPE-CDE-CON                    VALUE 'CON'. 00520000
005100        88 TR004-REC-TYPE-CDE-CMN                    VALUE 'CMN'. 00530000
005200     05 TR004-CONTNR-ID                   PIC X(22)  VALUE SPACE. 00540000
005300     05 TR004-POE-CDE                     PIC X(04)  VALUE SPACE. 00550000
005330     05 TR004-CONTNR-SIZE-CDE             PIC X(05)  VALUE SPACE. 00560000
005400     05 FILLER                            PIC X(215) VALUE SPACE. 00570000
005500     05 FILLER                            PIC X(01)  VALUE X'15'. 00580000
005600                                                                  00590000
005700 01  TR004-REC-TYPE-PO.                                           00600000
005800     05 TR004-REC-TYPE-CDE-PO             PIC X(03)  VALUE 'PO '. 00610000
005900     05 TR004-PO-NBR                      PIC 9(08)  VALUE ZERO.  00620000
006000*       REFERENCE ONLY PRESENT WHEN CMN CONTAINER RECORD TYPE     00630000
006100     05 TR004-EXTL-REF-NBR                PIC X(15)  VALUE SPACE. 00640000
006200     05 TR004-VENDOR-NAME                 PIC X(32)  VALUE SPACE. 00650000
006300     05 TR004-DO-NOT-SHIP-BEF-DTE         PIC X(08)  VALUE SPACE. 00660000
006400     05 TR004-CANCEL-DATE                 PIC X(08)  VALUE SPACE. 00670000
006500     05 TR004-OPEN-TO-BUY-PERIOD          PIC X(06)  VALUE SPACE. 00680000
006600     05 TR004-PKGNG-CDE                   PIC X(01)  VALUE SPACE. 00690000
006700     05 TR004-CART-PER-PO                 PIC 9(12)  VALUE ZERO.  00700000
006800* UNIT QTY APPLIES TO ALL CMN BUT TRANS CON ONLY. RETRANS CON BE- 00710000
006900* CAUSE OF PURITM STATUS CHG, MAY NOT BE ACCURATE, SO ISN'T SENT. 00720000
007000     05 TR004-PO-UNIT-QTY                 PIC 9(12)  VALUE ZERO.  00730000
007100     05 TR004-AD-DATE                     PIC X(08)  VALUE SPACE. 00740000
007710     05 TR004-PO-TYP-CDE                  PIC X(02)  VALUE SPACE. 00750000
007800     05 FILLER                            PIC X(134) VALUE SPACE. 00760000
007900     05 FILLER                            PIC X(01)  VALUE X'15'. 00770000
008000                                                                  00780000
008100 01  TR004-REC-TYPE-INS.                                          00790000
008200     05 TR004-REC-TYPE-CDE-INS            PIC X(03)  VALUE 'INS'. 00800000
008300     05 TR004-SPEC-INSTR                  PIC X(150) VALUE SPACE. 00810000
008400     05 FILLER                            PIC X(96)  VALUE SPACE. 00820000
008500     05 FILLER                            PIC X(01)  VALUE X'15'. 00830000
008600                                                                  00840000
008700*PACK LEVEL USED ONLY FOR PREPACK ORDERS                          00850000
008800 01  TR004-REC-TYPE-PCK.                                          00860000
008900     05 TR004-REC-TYPE-CDE-PCK            PIC X(03)  VALUE 'PCK'. 00870000
009000     05 TR004-PACK-VEND-STYL-NAME         PIC X(32)  VALUE SPACE. 00880000
009100     05 TR004-PACK-COLOR-CDE              PIC X(05)  VALUE SPACE. 00890000
009200     05 TR004-PACK-COLOR-DESC             PIC X(25)  VALUE SPACE. 00900000
009300     05 TR004-PACK-SIZE-DESC              PIC X(30)  VALUE SPACE. 00910000
009400     05 TR004-PACK-UNITS-PER-CTN          PIC 9(12)  VALUE ZERO.  00920000
009500     05 TR004-PACK-CART-CT                PIC 9(12)  VALUE ZERO.  00930000
009600     05 TR004-PACK-UNIT-QTY               PIC 9(12)  VALUE ZERO.  00940000
009700     05 TR004-PACK-DESC                   PIC X(40)  VALUE SPACE. 00950000
009800     05 TR004-PACK-ID                     PIC 9(08)  VALUE ZERO.  00960000
009900     05 TR004-PACK-UPC-NBR                PIC X(15)  VALUE SPACE. 00970000
010000     05 TR004-PACKS-PER-CART              PIC 9(09)  VALUE ZERO.  00980000
010100     05 TR004-PACK-SKU                    PIC 9(08)  VALUE ZERO.  00990000
010210     05 TR004-PACK-CBMT-QTY               PIC 9(07)V99            01010000
010220                                                     VALUE ZERO.  01020000
010240     05 TR004-PACK-WT-KGRM-QTY            PIC 9(09)  VALUE ZERO.  01030000
010250     05 TR004-PCK-NO-LBL-CART-CT          PIC 9(12)  VALUE ZERO.  01031002
010300     05 FILLER                            PIC X(08)  VALUE SPACE. 01040002
010400     05 FILLER                            PIC X(01)  VALUE X'15'. 01050000
010500                                                                  01060000
010600*PDC - USED ONLY FOR PREPACK ORDERS                               01070000
010700 01  TR004-REC-TYPE-PDC.                                          01080000
010800     05 TR004-REC-TYPE-CDE-PDC            PIC X(03)  VALUE 'PDC'. 01090000
010900     05 TR004-PDC-DIST-CNTR               PIC X(04)  VALUE SPACE. 01100000
011000     05 TR004-PDC-UNIT-QTY                PIC 9(12)  VALUE ZERO.  01110000
011100     05 TR004-PDC-PERCNT                  PIC 9(12)  VALUE ZERO.  01120000
011200     05 TR004-PDC-CART-CT                 PIC 9(12)  VALUE ZERO.  01130000
011210     05 TR004-PDC-NO-LBL-CART-CT          PIC 9(12)  VALUE ZERO.  01131002
011300     05 FILLER                            PIC X(194) VALUE SPACE. 01140002
011400     05 FILLER                            PIC X(01)  VALUE X'15'. 01150000
013400                                                                  01151004
013500*CARTON LABEL RECORD FOR PACK APPLIES TO PACK CMN ONLY.           01152004
014400 01  TR004-REC-TYPE-PACK-CARTON.                                  01153005
014500     05 TR004-REC-TYPE-CDE-PCT            PIC X(03)  VALUE 'PCT'. 01154015
014501     05 TR004-PCT-SSCC-ID                 PIC X(48)  VALUE SPACE. 01155014
014502     05 TR004-PCT-CARTON-UNIT-QTY         PIC 9(12)  VALUE ZERO.  01155114
014800     05 FILLER                            PIC X(186) VALUE SPACE. 01156007
014801     05 FILLER                            PIC X(01)  VALUE X'15'. 01157004
014802                                                                  01158004
014803 01  TR004-REC-TYPE-UPC.                                          01170000
014804     05 TR004-REC-TYPE-CDE-UPC            PIC X(03)  VALUE 'UPC'. 01180000
014805     05 TR004-UPC-NBR                     PIC X(15)  VALUE SPACE. 01190000
014806     05 TR004-VEND-STYL-NAME              PIC X(32)  VALUE SPACE. 01200000
014807     05 TR004-UPC-COLOR-CDE               PIC X(05)  VALUE SPACE. 01210000
014808     05 TR004-UPC-COLOR-DESC              PIC X(25)  VALUE SPACE. 01220000
014809     05 TR004-UPC-SIZE-DESC               PIC X(30)  VALUE SPACE. 01230000
014810     05 TR004-SKU-DESC                    PIC X(25)  VALUE SPACE. 01240000
014811     05 TR004-DEPT-NBR                    PIC X(04)  VALUE SPACE. 01250000
014812     05 TR004-CLASS                       PIC X(04)  VALUE SPACE. 01260000
014813     05 TR004-SUB-CLASS                   PIC X(04)  VALUE SPACE. 01270000
014814     05 TR004-SKU-SEQ-NBR                 PIC 9(08)  VALUE ZERO.  01280000
014815     05 TR004-OUTR-PK-QTY                 PIC 9(12)  VALUE ZERO.  01290000
014816     05 TR004-PACK-RATIO-QTY              PIC 9(12)  VALUE ZERO.  01300000
014817     05 TR004-UPC-UNIT-QTY                PIC 9(12)  VALUE ZERO.  01310000
014819     05 TR004-UPC-CBMT-QTY                PIC 9(07)V99            01330000
014820                                                     VALUE ZERO.  01340000
014821     05 TR004-UPC-WT-KGRM-QTY             PIC 9(09)  VALUE ZERO.  01350000
014824     05 TR004-UPC-NO-LBL-CART-CT          PIC 9(12)  VALUE ZERO.  01353016
014825     05 FILLER                            PIC X(27)  VALUE SPACE. 01360016
014826     05 FILLER                            PIC X(01)  VALUE X'15'. 01370000
014827                                                                  01380000
014828*SEND DC RECORD FOR BULK ONLY                                     01390000
014829 01  TR004-REC-TYPE-DC.                                           01400000
014830     05 TR004-REC-TYPE-CDE-DC             PIC X(03)  VALUE 'DC '. 01410000
014831     05 TR004-DIST-CNTR                   PIC X(04)  VALUE SPACE. 01420000
014832     05 TR004-DC-UNIT-QTY                 PIC 9(12)  VALUE ZERO.  01430000
014833     05 TR004-DC-PERCNT                   PIC 9(12)  VALUE ZERO.  01440000
014834     05 TR004-DC-CART-CT                  PIC 9(12)  VALUE ZERO.  01450000
014835     05 TR004-DC-NO-LBL-CART-CT           PIC 9(12)  VALUE ZERO.  01451002
014836     05 FILLER                            PIC X(194) VALUE SPACE. 01460002
014837     05 FILLER                            PIC X(01)  VALUE X'15'. 01470000
014838                                                                  01480000
014839*CARTON LABEL RECORD FOR BULK APPLIES TO BULK CMN ONLY.           01480104
014840 01  TR004-REC-TYPE-DC-CARTON.                                    01481005
014850     05 TR004-REC-TYPE-CDE-DC-CARTON      PIC X(03)  VALUE 'DCT'. 01481104
014851     05 TR004-DCT-SSCC-ID                 PIC X(48)  VALUE SPACE. 01481213
014852     05 TR004-DCT-CARTON-UNIT-QTY         PIC 9(12)  VALUE ZERO.  01481313
014853     05 FILLER                            PIC X(186) VALUE SPACE. 01481407
014854     05 FILLER                            PIC X(01)  VALUE X'15'. 01481504
014855                                                                  01482001
055200* CONTAINER SEAL INFORMATION.                                   * 01483007
055201 01  TR004-REC-TYPE-CONTAINER-SEAL.                               01484008
055202     05 TR004-REC-TYPE-CDE-CONTNR-SEAL    PIC X(03)  VALUE 'SEA'. 01485007
056900     05 TR004-SEA-CONTNR-SEAL-NBR         PIC X(15)  VALUE SPACE. 01486013
056901     05 FILLER                            PIC X(231) VALUE SPACE. 01487007
056902     05 FILLER                            PIC X(01)  VALUE X'15'. 01488007
056903                                                                  01489007
056904 01  TR004-REC-TYPE-CTT.                                          01490000
056905     05 TR004-REC-TYPE-CDE-CTT            PIC X(03)  VALUE 'CTT'. 01500000
056906     05 TR004-HASH-TOTALS                 PIC 9(09)  VALUE ZERO.  01510000
056907     05 FILLER                            PIC X(237) VALUE SPACE. 01520000
056908     05 FILLER                            PIC X(01)  VALUE X'15'. 01530000
056909                                                                  01540000
