000100*****************************************************************         
000200*    RECORD PURPOSE: DETAIL REPORT EXTRACT LAYOUT OF PURCHASE   *         
000300*                    ORDER DATA FOR THE IMPORT DECONSOLIDATION  *         
000400*                    TRANSMISSION.  THE DATA IS CREATED IN      *         
000500*                    TRKUP005 AND TRKUP006 AND USED AS INPUT    *         
000600*                    IN TRKRP009.                               *         
000700*    RECORD LENGTH:  508                                        *         
000800*    RECORD FORMAT:  SEQUENTIAL               TRRD020           *         
000900*****************************************************************         
001000                                                                          
001100 01  TR020-REC-TYPE-PO.                                                   
001200     05 TR020-REC-TYPE-CDE-PO           PIC X(05)  VALUE '10PO '.         
001210     05 TR020-SEC-REC-TYP-PO            PIC 9(01)  VALUE ZERO.            
001300     05 TR020-REPORT-TYPE-PO            PIC X(01)  VALUE SPACES.          
001400        88  TR020-XMIT-RPT-PO                      VALUE 'T'.             
001500        88  TR020-REXMIT-RPT-PO                    VALUE 'R'.             
001600     05 TR020-PROCESS-DATE-PO           PIC X(08)  VALUE SPACES.          
001700     05 TR020-PO-NBR-PO                 PIC 9(08)  VALUE ZEROES.          
001800     05 TR020-CONTNR-ID-PO              PIC X(22)  VALUE SPACES.          
001910     05 TR020-PACK-ID-PO                PIC 9(08)  VALUE ZEROES.          
001920     05 TR020-VEND-STYL-NAME-PO         PIC X(32)  VALUE SPACES.          
001930     05 TR020-COLOR-CDE-PO              PIC X(06)  VALUE SPACES.          
001940     05 TR020-SIZE-DESC-PO              PIC X(30)  VALUE SPACES.          
001950     05 FILLER                          PIC X(04)  VALUE SPACES.          
002000     05 TR020-VENDOR-NAME-PO            PIC X(32)  VALUE SPACES.          
002100     05 TR020-DO-NOT-SHIP-BEF-DTE-PO    PIC X(08)  VALUE SPACES.          
002200     05 TR020-CANCEL-DATE-PO            PIC X(08)  VALUE SPACES.          
002300     05 TR020-OPEN-TO-BUY-PERIOD-PO     PIC X(06)  VALUE SPACES.          
002400     05 TR020-PGM-NAME                  PIC X(08)  VALUE SPACES.          
002410     05 TR020-PKGNG-CDE-PO              PIC X(01)  VALUE SPACES.          
002420     05 TR020-AD-DATE-PO                PIC X(08)  VALUE SPACES.          
002430     05 TR020-PO-TYP-CDE-PO             PIC X(02)  VALUE SPACES.          
002500     05 FILLER                          PIC X(310) VALUE SPACES.          
002600                                                                          
004200 01  TR020-REC-TYPE-INS.                                                  
004210     05 TR020-REC-TYPE-INS-1.                                             
004300        10 TR020-REC-TYPE-CDE-INS       PIC X(05)  VALUE '20INS'.         
004310        10 TR020-SEC-REC-TYP-INS        PIC 9(01)  VALUE ZERO.            
004400        10 TR020-REPORT-TYPE-INS        PIC X(01)  VALUE SPACES.          
004500           88  TR020-XMIT-RPT-INS                  VALUE 'T'.             
004600           88  TR020-REXMIT-RPT-INS                VALUE 'R'.             
004700        10 TR020-PROCESS-DATE-INS       PIC X(08)  VALUE SPACES.          
004800        10 TR020-PO-NBR-INS             PIC 9(08)  VALUE ZEROES.          
004900        10 TR020-CONTNR-ID-INS          PIC X(22)  VALUE SPACES.          
005000        10 TR020-PACK-ID-INS            PIC 9(08)  VALUE ZEROES.          
005010        10 TR020-VEND-STYL-NAME-INS     PIC X(32)  VALUE SPACES.          
005020        10 TR020-COLOR-CDE-INS          PIC X(06)  VALUE SPACES.          
005030        10 TR020-SIZE-DESC-INS          PIC X(30)  VALUE SPACES.          
005100        10 FILLER                       PIC X(133) VALUE SPACES.          
005110     05 TR020-REC-TYPE-INS-2.                                             
005120        10 TR020-SPEC-INSTR-INS         PIC X(150) VALUE SPACES.          
005200        10 FILLER                       PIC X(104) VALUE SPACES.          
005300                                                                          
005302*    CON-CONTAINER SPLITS FROM ORDERED DATA                               
005303*    CMN-CONTAINER LEVEL SPLITS FROM SHIPPED DATA                         
005304 01  TR020-REC-TYPE-CONTNR.                                               
005305     05 TR020-REC-TYPE-CDE-CONTNR       PIC X(05).                        
005306        88 TR020-REC-TYPE-CDE-CON-CONTNR           VALUE '30CON'.         
005307        88 TR020-REC-TYPE-CDE-CMN-CONTNR           VALUE '30CMN'.         
005308     05 TR020-SEC-REC-TYP-CONTNR        PIC 9(01)  VALUE ZERO.            
005309     05 TR020-REPORT-TYPE-CONTNR        PIC X(01)  VALUE SPACES.          
005310        88  TR020-XMIT-RPT-CONTNR                  VALUE 'T'.             
005311        88  TR020-REXMIT-RPT-CONTNR                VALUE 'R'.             
005312     05 TR020-PROCESS-DATE-CONTNR       PIC X(08)  VALUE SPACES.          
005313     05 TR020-PO-NBR-CONTNR             PIC 9(08)  VALUE ZEROES.          
005314     05 TR020-CONTNR-ID-CONTNR          PIC X(22)  VALUE SPACES.          
005315     05 TR020-PACK-ID-CONTNR            PIC 9(08)  VALUE ZEROES.          
005316     05 TR020-VEND-STYL-NAME-CONTNR     PIC X(32)  VALUE SPACES.          
005317     05 TR020-COLOR-CDE-CONTNR          PIC X(06)  VALUE SPACES.          
005318     05 TR020-SIZE-DESC-CONTNR          PIC X(30)  VALUE SPACES.          
005319     05 FILLER                          PIC X(04)  VALUE SPACES.          
005320     05 TR020-EXTL-REF-CONTNR           PIC X(15)  VALUE SPACES.          
005321     05 TR020-VESSEL-NAME-CONTNR        PIC X(10)  VALUE SPACES.          
005322     05 TR020-VESSEL-ETA-DATE-CONTNR    PIC X(08)  VALUE SPACES.          
005323     05 TR020-POE-CDE-CONTNR            PIC X(04)  VALUE SPACES.          
005324     05 TR020-TRIP-TYP-CDE-CONTNR       PIC X(02)  VALUE SPACES.          
005325     05 TR020-EXP-CART-CT-CONTNR        PIC 9(12)  VALUE ZEROES.          
005326* UNIT QTY APPLIES TO ALL CMN BUT TRANS CON ONLY. RETRANS CON BE-         
005327* CAUSE OF PURITM STATUS CHG, MAY NOT BE ACCURATE, SO ISN'T SENT.         
005331     05 TR020-UNIT-QTY-CONTNR           PIC 9(12)  VALUE ZEROES.          
005332     05 TR020-VOYAGE-ID-NBR-CONTNR      PIC X(10)  VALUE SPACES.          
005333     05 TR020-CARR-SCAC-ID-CONTNR       PIC X(04)  VALUE SPACES.          
005334     05 TR020-CONTNR-SIZE-CDE-CONTNR    PIC X(05)  VALUE SPACES.          
005335     05 FILLER                          PIC X(301) VALUE SPACES.          
005336                                                                          
005345*PACK LEVEL - USED ONLY FOR PREPACK ORDERS                                
005346 01  TR020-REC-TYPE-PCK.                                                  
005347     05 TR020-REC-TYPE-CDE-PCK          PIC X(05)  VALUE '40PCK'.         
005348     05 TR020-SEC-REC-TYP-PCK           PIC 9(01)  VALUE ZERO.            
005349     05 TR020-REPORT-TYPE-PCK           PIC X(01)  VALUE SPACES.          
005350        88  TR020-XMIT-RPT-PCK                     VALUE 'T'.             
005351        88  TR020-REXMIT-RPT-PCK                   VALUE 'R'.             
005354     05 TR020-PROCESS-DATE-PCK          PIC X(08)  VALUE SPACES.          
005355     05 TR020-PO-NBR-PCK                PIC 9(08)  VALUE ZEROES.          
005356     05 TR020-CONTNR-ID-PCK             PIC X(22)  VALUE SPACES.          
005359     05 TR020-PACK-ID-PCK               PIC 9(08)  VALUE ZEROES.          
005360     05 TR020-VEND-STYL-NAME-PCK        PIC X(32)  VALUE SPACES.          
005361     05 TR020-COLOR-CDE-PCK             PIC X(06)  VALUE SPACES.          
005362     05 TR020-SIZE-DESC-PCK             PIC X(30)  VALUE SPACES.          
005363     05 FILLER                          PIC X(04)  VALUE SPACES.          
005364     05 TR020-COLOR-DESC-PCK            PIC X(25)  VALUE SPACES.          
005366     05 TR020-UNITS-PER-CTN-PCK         PIC 9(12)  VALUE ZEROES.          
005367     05 TR020-CART-CT-PCK               PIC 9(12)  VALUE ZEROES.          
005368     05 TR020-UNIT-QTY-PCK              PIC 9(12)  VALUE ZEROES.          
005369     05 TR020-DESC-PCK                  PIC X(24)  VALUE SPACES.          
005372     05 TR020-UPC-NBR-PCK               PIC 9(15)  VALUE ZEROES.          
005373     05 TR020-PACKS-PER-CART-PCK        PIC 9(09)  VALUE ZERO.            
009000     05 TR020-SKU-PCK                   PIC 9(08)  VALUE ZERO.            
009002     05 TR020-ASN-PKGNG-CDE-PCK         PIC X(02)  VALUE SPACES.          
009003     05 TR020-CBMT-QTY-PCK              PIC 9(07)V99                      
009004                                                   VALUE ZEROES.          
009007     05 TR020-WT-KGRM-QTY-PCK           PIC 9(09)  VALUE ZEROES.          
009008     05 TR020-NO-LBL-CART-CT-PCK        PIC 9(09)  VALUE ZEROES.          
009009     05 FILLER                          PIC X(237) VALUE SPACES.          
009010                                                                          
009011*DC PACK LEVEL - USED ONLY FOR PREPACK ORDERS                             
009012 01  TR020-REC-TYPE-PDC.                                                  
009013     05 TR020-REC-TYPE-CDE-PDC          PIC X(05)  VALUE '50PDC'.         
009014     05 TR020-SEC-REC-TYP-PDC           PIC 9(01)  VALUE ZERO.            
009015     05 TR020-REPORT-TYPE-PDC           PIC X(01)  VALUE SPACES.          
009016        88  TR020-XMIT-RPT-PDC                     VALUE 'T'.             
009017        88  TR020-REXMIT-RPT-PDC                   VALUE 'R'.             
009018     05 TR020-PROCESS-DATE-PDC          PIC X(08)  VALUE SPACES.          
009019     05 TR020-PO-NBR-PDC                PIC 9(08)  VALUE ZEROES.          
009020     05 TR020-CONTNR-ID-PDC             PIC X(22)  VALUE SPACES.          
009021     05 TR020-PACK-ID-PDC               PIC 9(08)  VALUE ZEROES.          
009022     05 TR020-VEND-STYL-NAME-PDC        PIC X(32)  VALUE SPACES.          
009023     05 TR020-COLOR-CDE-PDC             PIC X(06)  VALUE SPACES.          
009024     05 TR020-SIZE-DESC-PDC             PIC X(30)  VALUE SPACES.          
009025     05 TR020-DIST-CNTR-PDC             PIC X(04)  VALUE SPACES.          
009026     05 TR020-UNIT-QTY-PDC              PIC 9(12)  VALUE ZEROES.          
009027     05 TR020-PERCNT-PDC                PIC 9(09)  VALUE ZEROES.          
009028     05 TR020-CART-CT-PDC               PIC 9(12)  VALUE ZEROES.          
009029     05 TR020-NO-LBL-CART-CT-PDC        PIC 9(09)  VALUE ZEROES.          
009030     05 FILLER                          PIC X(341) VALUE SPACES.          
009031                                                                          
009032 01  TR020-REC-TYPE-PACK-CART.                                            
009033     05 TR020-REC-TYPE-CDE-PCT          PIC X(05)  VALUE '50PDC'.         
009034     05 TR020-SEC-REC-TYP-PCT           PIC 9(01)  VALUE 1.               
009035     05 TR020-REPORT-TYPE-PCT           PIC X(01)  VALUE SPACES.          
009036        88  TR020-XMIT-RPT-PCT                     VALUE 'T'.             
009037        88  TR020-REXMIT-RPT-PCT                   VALUE 'R'.             
009038     05 TR020-PROCESS-DATE-PCT          PIC X(08)  VALUE SPACES.          
009039     05 TR020-PO-NBR-PCT                PIC 9(08)  VALUE ZEROES.          
009040     05 TR020-CONTNR-ID-PCT             PIC X(22)  VALUE SPACES.          
009041     05 TR020-PACK-ID-PCT               PIC 9(08)  VALUE ZEROES.          
009042     05 TR020-VEND-STYL-NAME-PCT        PIC X(32)  VALUE SPACES.          
009043     05 TR020-COLOR-CDE-PCT             PIC X(06)  VALUE SPACES.          
009044     05 TR020-SIZE-DESC-PCT             PIC X(30)  VALUE SPACES.          
009045     05 TR020-DIST-CNTR-PCT             PIC X(04)  VALUE SPACES.          
009046     05 TR020-SSCC-ID-PCT               PIC X(48).                        
009047     05 TR020-UNT-QTY-PCT               PIC 9(12).                        
009048     05 FILLER                          PIC X(323) VALUE SPACES.          
009049                                                                          
009050 01  TR020-REC-TYPE-UPC.                                                  
009051     05 TR020-REC-TYPE-CDE-UPC          PIC X(05)  VALUE '60UPC'.         
009052     05 TR020-SEC-REC-TYP-UPC           PIC 9(01)  VALUE ZERO.            
009053     05 TR020-REPORT-TYPE-UPC           PIC X(01)  VALUE SPACES.          
009054        88  TR020-XMIT-RPT-UPC                     VALUE 'T'.             
009055        88  TR020-REXMIT-RPT-UPC                   VALUE 'R'.             
009056     05 TR020-PROCESS-DATE-UPC          PIC X(08)  VALUE SPACES.          
009057     05 TR020-PO-NBR-UPC                PIC 9(08)  VALUE ZEROES.          
009058     05 TR020-CONTNR-ID-UPC             PIC X(22)  VALUE SPACES.          
009059     05 TR020-PACK-ID-UPC               PIC 9(08)  VALUE ZEROES.          
009060     05 TR020-VEND-STYL-NAME-UPC        PIC X(32)  VALUE SPACES.          
009061     05 TR020-COLOR-CDE-UPC             PIC X(06)  VALUE SPACES.          
009062     05 TR020-SIZE-DESC-UPC             PIC X(30)  VALUE SPACES.          
009063     05 FILLER                          PIC X(04)  VALUE SPACES.          
009064     05 TR020-UPC-NBR-UPC               PIC 9(15)  VALUE ZEROES.          
009065     05 TR020-COLOR-DESC-UPC            PIC X(25)  VALUE SPACES.          
009066     05 TR020-SKU-DESC-UPC              PIC X(25)  VALUE SPACES.          
009067     05 TR020-DEPT-NBR-UPC              PIC 9(04)  VALUE ZEROES.          
009068     05 TR020-CLASS-UPC                 PIC 9(04)  VALUE ZEROES.          
009069     05 TR020-SUB-CLASS-UPC             PIC 9(04)  VALUE ZEROES.          
009070     05 TR020-SKU-UPC                   PIC 9(08)  VALUE ZEROES.          
009071     05 TR020-OUTR-PK-QTY-UPC           PIC 9(12)  VALUE ZEROES.          
009072     05 TR020-PACK-RATIO-QTY-UPC        PIC 9(12)  VALUE ZEROES.          
009073     05 TR020-UNIT-QTY-UPC              PIC 9(12)  VALUE ZEROES.          
009074     05 TR020-ASN-PKGNG-CDE-UPC         PIC X(02)  VALUE SPACES.          
009075     05 TR020-CBMT-QTY-UPC              PIC 9(07)V99                      
009076                                                   VALUE ZEROES.          
009077     05 TR020-WT-KGRM-QTY-UPC           PIC 9(09)  VALUE ZEROES.          
009078     05 TR020-NO-LBL-CART-CT-UPC        PIC 9(09)  VALUE ZEROES.          
009079     05 FILLER                          PIC X(233) VALUE SPACES.          
009080                                                                          
009081 01  TR020-REC-TYPE-DC.                                                   
009082     05 TR020-REC-TYPE-CDE-DC           PIC X(05)  VALUE '70DC '.         
009083     05 TR020-SEC-REC-TYP-DC            PIC 9(01)  VALUE ZERO.            
009084     05 TR020-REPORT-TYPE-DC            PIC X(01)  VALUE SPACES.          
009085        88  TR020-XMIT-RPT-DC                      VALUE 'T'.             
009086        88  TR020-REXMIT-RPT-DC                    VALUE 'R'.             
009087     05 TR020-PROCESS-DATE-DC           PIC X(08)  VALUE SPACES.          
009088     05 TR020-PO-NBR-DC                 PIC 9(08)  VALUE ZEROES.          
009089     05 TR020-CONTNR-ID-DC              PIC X(22)  VALUE SPACES.          
009090     05 TR020-PACK-ID-DC                PIC 9(08)  VALUE ZEROES.          
009091     05 TR020-VEND-STYL-NAME-DC         PIC X(32)  VALUE SPACES.          
009092     05 TR020-COLOR-CDE-DC              PIC X(06)  VALUE SPACES.          
009093     05 TR020-SIZE-DESC-DC              PIC X(30)  VALUE SPACES.          
009094     05 TR020-DIST-CNTR-DC              PIC X(04)  VALUE SPACES.          
009095     05 TR020-UPC-NBR-DC                PIC 9(15)  VALUE ZEROES.          
009096     05 TR020-UNIT-QTY-DC               PIC 9(12)  VALUE ZEROES.          
009097     05 TR020-PERCNT-DC                 PIC 9(09)  VALUE ZEROES.          
009098     05 TR020-CART-CT-DC                PIC 9(12)  VALUE ZEROES.          
009099     05 TR020-NO-LBL-CART-CT-DC         PIC 9(09)  VALUE ZEROES.          
009100     05 FILLER                          PIC X(326) VALUE SPACES.          
009101                                                                          
009102 01  TR020-REC-TYPE-DC-CARTON.                                            
009110     05 TR020-REC-TYPE-CDE-DCT          PIC X(05)  VALUE '70DC '.         
009111     05 TR020-SEC-REC-TYP-DCT           PIC 9(01)  VALUE 1.               
009200     05 TR020-REPORT-TYPE-DCT           PIC X(01)  VALUE SPACES.          
009210        88  TR020-XMIT-RPT-DCT                     VALUE 'T'.             
009220        88  TR020-REXMIT-RPT-DCT                   VALUE 'R'.             
009221     05 TR020-PROCESS-DATE-DCT          PIC X(08)  VALUE SPACES.          
009222     05 TR020-PO-NBR-DCT                PIC 9(08)  VALUE ZEROES.          
009223     05 TR020-CONTNR-ID-DCT             PIC X(22)  VALUE SPACES.          
009224     05 TR020-PACK-ID-DCT               PIC 9(08)  VALUE ZEROES.          
009225     05 TR020-VEND-STYL-NAME-DCT        PIC X(32)  VALUE SPACES.          
009226     05 TR020-COLOR-CDE-DCT             PIC X(06)  VALUE SPACES.          
009227     05 TR020-SIZE-DESC-DCT             PIC X(30)  VALUE SPACES.          
009228     05 TR020-DIST-CNTR-DCT             PIC X(04)  VALUE SPACES.          
009230     05 TR020-SSCC-ID-DCT               PIC X(48).                        
009240     05 TR020-UNT-QTY-DCT               PIC 9(12).                        
009400     05 FILLER                          PIC X(323) VALUE SPACES.          
009410                                                                          
009500 01  TR020-REC-TYPE-CONTAINER-SEAL.                                       
009600     05 TR020-REC-TYPE-CDE-CONTNR-SEAL  PIC X(05)  VALUE '80SEA'.         
009610     05 TR020-SEC-REC-TYP-SEAL          PIC 9(01)  VALUE ZERO.            
009700     05 TR020-REPORT-TYPE-SEAL          PIC X(01)  VALUE SPACES.          
009800        88  TR020-XMIT-RPT-SEAL                    VALUE 'T'.             
009900        88  TR020-REXMIT-RPT-SEAL                  VALUE 'R'.             
009910     05 TR020-PROCESS-DATE-SEAL         PIC X(08)  VALUE SPACES.          
009920     05 TR020-PO-NBR-SEAL               PIC 9(08)  VALUE ZEROES.          
009930     05 TR020-CONTNR-ID-SEAL            PIC X(22)  VALUE SPACES.          
009940     05 TR020-PACK-ID-SEAL              PIC 9(08)  VALUE ZEROES.          
009950     05 TR020-VEND-STYL-NAME-SEAL       PIC X(32)  VALUE SPACES.          
009960     05 TR020-COLOR-CDE-SEAL            PIC X(06)  VALUE SPACES.          
009970     05 TR020-SIZE-DESC-SEAL            PIC X(30)  VALUE SPACES.          
009980     05 FILLER                          PIC X(04)  VALUE SPACES.          
010000     05 TR020-CONTNR-SEAL               PIC X(15).                        
010100     05 FILLER                          PIC X(368) VALUE SPACES.          
