000100***************************************************************** 00010000
000200*    RECORD PURPOSE: IMPORT CUSTOMS DOCUMENT MOVEMENT EVENT     * 00020000
000300*                    DATA RECEIVED FROM THE CUSTOMS BROKER.     * 00030000
000400*    RECORD LENGTH:  300                                        * 00040000
001000*    RECORD FORMAT:  SEQUENTIAL    DATES-CCYYMMDD     TRRD017   * 00100000
001100***************************************************************** 00110000
001200* CUSTOMS ENTRY FILED.  THE DATE THE 3461 OR 7510 IS FILED.     * 00120000
006210* SENT AFTER THE 3461 OR 7510 IS FILED.  CONSOLIDATOR FILES     * 00621000
006220* ENTRY WITH CUSTOMS BROKER FOR ENTRY.                          * 00622000
006300* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00630000
006400* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00640000
006500***************************************************************** 00650000
006600 01  TR017-REC-TYP-ENF.                                           00660000
006700     05 TR017-ENF-REC-KEY.                                        00670000
006800        10 TR017-ENF-TRN-TYP            PIC X(01).                00680000
006900           88 TR017-ENF-TRN-TYP-ADD                VALUE 'A'.     00690000
007000           88 TR017-ENF-TRN-TYP-CHG                VALUE 'C'.     00700000
007100           88 TR017-ENF-TRN-TYP-DEL                VALUE 'D'.     00710000
007200        10 TR017-ENF-REC-TYP-CDE        PIC X(06).                00720000
007300           88 TR017-ENF-REC-TYP-CD-ENF             VALUE 'ENF   '.00730000
007400        10 TR017-ENF-SEQ-NBR            PIC X(02).                00740000
007500           88 TR017-ENF-SEQ-NBR-10                 VALUE '10'.    00750000
007600        10 TR017-ENF-3RD-PARTY-CDE      PIC X(06).                00760000
007700           88 TR017-ENF-3RD-PARTY-CDE-EI           VALUE '      '.00770000
007800        10 TR017-ENF-CSTM-ENTR-ID       PIC X(12).                00780000
007900     05 TR017-ENF-BKR-REF-NBR           PIC X(15).                00790000
008000     05 TR017-ENF-FILD-DTE              PIC X(08).                00800000
008100     05 TR017-ENF-FILD-TM               PIC X(04).                00810000
008110     05 TR017-ENF-MOM-TRIP-TYP-CDE      PIC X(01).                00811000
008111        88 TR017-ENF-MOM-TRIP-TYP-AIR              VALUE 'A'.     00811100
008112        88 TR017-ENF-MOM-TRIP-TYP-MOTOR            VALUE 'M'.     00811200
008113        88 TR017-ENF-MOM-TRIP-TYP-OCEAN            VALUE 'O'.     00811300
008114        88 TR017-ENF-MOM-TRIP-TYP-VALID            VALUE 'A',     00811400
008115                                                         'O',     00811500
008116                                                         'M'.     00811600
008120     05 TR017-ENF-ENTR-TYP-CDE          PIC X(02).                00812000
008200     05 TR017-ENF-POE-STD-EDI-CDE       PIC X(04).                00820000
008500     05 FILLER                          PIC X(86).                00850000
008600     05 TR017-ENF-CONSOL-END            PIC X(01).                00860000
008700     05 TR017-ENF-EDI-SEG-END           PIC X(01).                00870000
008710     05 TR017-ENF-EDI                   PIC X(01).                00871000
008711     05 TR017-ENF-FILE-ID               PIC X(09).                00871100
008712     05 TR017-ENF-ENT-ID                PIC 9(09).                00871200
008713     05 FILLER                          PIC X(132).               00871300
008714                                                                  00871400
008715***************************************************************** 00871500
008716* CUSTOMS ENTRY FILED FOR BOL(S).  THE DATE THE 3461 OR 7510 IS * 00871600
008717* FILED.  SENT AFTER THE 3461 OR 7510 IS FILED.  CONSOLIDATOR   * 00871700
008718* FILES ENTRY WITH CUSTOMS BROKER FOR ENTRY.                    * 00871800
008719* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00871900
008720* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00872000
008721***************************************************************** 00872100
008722 01  TR017-REC-TYP-ENFBOL REDEFINES TR017-REC-TYP-ENF.            00872200
008723     05 TR017-ENFBOL-REC-KEY.                                     00872300
008724        10 TR017-ENFBOL-TRN-TYP         PIC X(01).                00872400
008725           88 TR017-ENFBOL-TRN-TYP-ADD             VALUE 'A'.     00872500
008726           88 TR017-ENFBOL-TRN-TYP-CHG             VALUE 'C'.     00872600
008727           88 TR017-ENFBOL-TRN-TYP-DEL             VALUE 'D'.     00872700
008728        10 TR017-ENFBOL-REC-TYP-CDE     PIC X(06).                00872800
008729           88 TR017-ENFBOL-REC-TYP-CD-ENFBOL       VALUE 'ENFBOL'.00872900
008730        10 TR017-ENFBOL-SEQ-NBR         PIC X(02).                00873000
008731           88 TR017-ENFBOL-SEQ-NBR-15              VALUE '15'.    00873100
008732        10 TR017-ENFBOL-3RD-PARTY-CDE   PIC X(06).                00873200
008733           88 TR017-ENFBOL-3RD-PARTY-CDE-EI        VALUE '      '.00873300
008734        10 TR017-ENFBOL-CSTM-ENTR-ID    PIC X(12).                00873400
008735        10 TR017-ENFBOL-MSTR-BOL-NBR    PIC X(30).                00873500
008736        10 TR017-ENFBOL-HSE-BOL-NBR     PIC X(30).                00873600
008737     05 TR017-ENFBOL-BKR-REF-NBR        PIC X(15).                00873700
008738     05 TR017-ENFBOL-CARR-SCAC-ID       PIC X(04).                00873800
008739     05 TR017-ENFBOL-POE-STD-EDI-CDE    PIC X(04).                00873901
008740     05 FILLER                          PIC X(37).                00874002
008741     05 TR017-ENFBOL-CONSOL-END         PIC X(01).                00874100
008742     05 TR017-ENFBOL-EDI-SEG-END        PIC X(01).                00874200
008743     05 TR017-ENFBOL-EDI                PIC X(01).                00874300
008744     05 TR017-ENFBOL-FILE-ID            PIC X(09).                00874400
008745     05 TR017-ENFBOL-ENT-ID             PIC 9(09).                00874500
008746     05 FILLER                          PIC X(132).               00874600
008747                                                                  00874700
008748***************************************************************** 00874800
008749* CUSTOMS ENTRY FILED (CONTAINER NUMBERS).  THE DATE THE 3461   * 00874900
008750* 7510 IS FILED.  SENT AFTER THE 3461 OR 7510 IS FILED.         * 00875000
008751* CONSOLIDATOR FILES ENTRY WITH CUSTOMS BROKER FOR ENTRY.       * 00875100
008752* THE BROKER PROVIDES THE CONTAINER NUMBERS.                    * 00875200
008760* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00876000
008770* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00877000
008780***************************************************************** 00878000
008790 01  TR017-REC-TYP-ENFCON REDEFINES TR017-REC-TYP-ENFBOL.         00879000
008791     05 TR017-ENFCON-REC-KEY.                                     00879100
008792        10 TR017-ENFCON-TRN-TYP         PIC X(01).                00879200
008793           88 TR017-ENFCON-TRN-TYP-ADD             VALUE 'A'.     00879300
008794           88 TR017-ENFCON-TRN-TYP-CHG             VALUE 'C'.     00879400
008795           88 TR017-ENFCON-TRN-TYP-DEL             VALUE 'D'.     00879500
008796        10 TR017-ENFCON-REC-TYP-CDE     PIC X(06).                00879600
008797           88 TR017-ENFCON-REC-TYP-CD-ENFCON       VALUE 'ENFCON'.00879700
008798        10 TR017-ENFCON-SEQ-NBR         PIC X(02).                00879800
008799           88 TR017-ENFCON-SEQ-NBR-20              VALUE '20'.    00879900
008800        10 TR017-ENFCON-3RD-PARTY-CDE   PIC X(06).                00880000
008801           88 TR017-ENFCON-3RD-PARTY-CDE-EI        VALUE '      '.00880100
008802        10 TR017-ENFCON-CSTM-ENTR-ID    PIC X(12).                00880200
008804        10 TR017-ENFCON-CONTNR-ID       PIC X(12).                00880400
008805     05 TR017-ENFCON-BKR-REF-NBR        PIC X(15).                00880500
008806     05 TR017-ENFCON-POE-STD-EDI-CDE    PIC X(04).                00880600
008808     05 FILLER                          PIC X(89).                00880800
008809     05 TR017-ENFCON-CONSOL-END         PIC X(01).                00880900
008810     05 TR017-ENFCON-EDI-SEG-END        PIC X(01).                00881000
008811     05 TR017-ENFCON-EDI                PIC X(01).                00881100
008812     05 TR017-ENFCON-FILE-ID            PIC X(09).                00881200
008813     05 TR017-ENFCON-ENT-ID             PIC 9(09).                00881300
008814     05 FILLER                          PIC X(132).               00881400
008815                                                                  00881500
008816***************************************************************** 00881600
008817* DELIVERY ORDER PREPARED FOR DECONSOLIDATOR.  THE DATE THE     * 00881700
008818* CUSTOMS BROKER DECLARED THEY PREPARED AND SENT THE DELIVERY   * 00881800
008819* ORDER.  SENT AFTER THE DELIVERY IS PREPARED AND HAS BEEN SENT * 00881900
008820* TO THE DECONSOLIDATOR.                                        * 00882000
008821***************************************************************** 00882100
008822 01  TR017-REC-TYP-DOP REDEFINES TR017-REC-TYP-ENFCON.            00882200
008823     05 TR017-DOP-REC-KEY.                                        00882300
008824        10 TR017-DOP-TRN-TYP            PIC X(01).                00882400
008825           88 TR017-DOP-TRN-TYP-ADD                VALUE 'A'.     00882500
008826           88 TR017-DOP-TRN-TYP-CHG                VALUE 'C'.     00882600
008827           88 TR017-DOP-TRN-TYP-DEL                VALUE 'D'.     00882700
008828        10 TR017-DOP-REC-TYP-CDE        PIC X(06).                00882800
008829           88 TR017-DOP-REC-TYP-CDE-DOP            VALUE 'DOP   '.00882900
008830        10 TR017-DOP-SEQ-NBR            PIC X(02).                00883000
008831           88 TR017-DOP-SEQ-NBR-25                 VALUE '25'.    00883100
008832        10 TR017-DOP-3RD-PARTY-CDE      PIC X(06).                00883200
008833           88 TR017-DOP-3RD-PARTY-CDE-EI           VALUE '      '.00883300
008834        10 TR017-DOP-CSTM-ENTR-ID       PIC X(12).                00883400
008835        10 TR017-DOP-CONTNR-ID          PIC X(12).                00883500
008836     05 TR017-DOP-BKR-REF-NBR           PIC X(15).                00883600
008840     05 TR017-DOP-DELY-ORD-SNT-DTE      PIC X(08).                00884000
008841     05 TR017-DOP-DELY-ORD-SNT-TM       PIC X(04).                00884100
008842     05 TR017-DOP-POE-STD-EDI-CDE       PIC X(04).                00884200
008844     05 FILLER                          PIC X(77).                00884400
008845     05 TR017-DOP-CONSOL-END            PIC X(01).                00884500
008846     05 TR017-DOP-EDI-SEG-END           PIC X(01).                00884600
008847     05 TR017-DOP-EDI                   PIC X(01).                00884700
008848     05 TR017-DOP-FILE-ID               PIC X(09).                00884800
008849     05 TR017-DOP-ENT-ID                PIC 9(09).                00884900
008850     05 FILLER                          PIC X(132).               00885000
008851***************************************************************** 00885100
008852* CUSTOMS ENTRY FILED (PO'S).  THE DATE THE 3461 OR 7510 IS     * 00885200
008853* FILED.  SENT AFTER THE 3461 OR 7510 IS FILED.  CONSOLIDATOR   * 00885300
008854* FILES ENTRY WITH CUSTOMS BROKER FOR ENTRY.                    * 00885400
008855* THE BROKER PROVIDES THE PURCHASE ORDER NUMBERS.               * 00885500
008856* HAPPENS AFTER DOCUMENTS ARE RECEIVED FOR NON-QUOTA PRODUCT,   * 00885600
008857* AND AFTER THE VESSEL ARRIVES FOR QUOTA PRODUCT.               * 00885700
008858***************************************************************** 00885800
008859 01  TR017-REC-TYP-ENFPO REDEFINES TR017-REC-TYP-DOP.             00885900
008860     05 TR017-ENFPO-REC-KEY.                                      00886000
008861        10 TR017-ENFPO-TRN-TYP          PIC X(01).                00886100
008862           88 TR017-ENFPO-TRN-TYP-ADD              VALUE 'A'.     00886200
008863           88 TR017-ENFPO-TRN-TYP-CHG              VALUE 'C'.     00886300
008864           88 TR017-ENFPO-TRN-TYP-DEL              VALUE 'D'.     00886400
008865        10 TR017-ENFPO-REC-TYP-CDE      PIC X(06).                00886500
008866           88 TR017-ENFPO-REC-TYP-CDE-ENFPO        VALUE 'ENFPO '.00886600
008867        10 TR017-ENFPO-SEQ-NBR          PIC X(02).                00886700
008868           88 TR017-ENFPO-SEQ-NBR-30               VALUE '30'.    00886800
008869        10 TR017-ENFPO-3RD-PARTY-CDE    PIC X(06).                00886900
008870           88 TR017-ENFPO-3RD-PARTY-CDE-EI         VALUE '      '.00887000
008871        10 TR017-ENFPO-CSTM-ENTR-ID     PIC X(12).                00887100
008872        10 TR017-ENFPO-PO-NBR           PIC X(09).                00887200
008873        10 TR017-ENFPO-EXTL-REF-NBR     PIC X(15).                00887300
008874     05 TR017-ENFPO-BKR-REF-NBR         PIC X(15).                00887400
008875     05 TR017-ENFPO-POE-STD-EDI-CDE     PIC X(04).                00887500
008876     05 FILLER                          PIC X(77).                00887600
008877     05 TR017-ENFPO-CONSOL-END          PIC X(01).                00887700
008878     05 TR017-ENFPO-EDI-SEG-END         PIC X(01).                00887800
008879     05 TR017-ENFPO-EDI                 PIC X(01).                00887900
008880     05 TR017-ENFPO-FILE-ID             PIC X(09).                00888000
008881     05 TR017-ENFPO-ENT-ID              PIC 9(09).                00888100
008882     05 FILLER                          PIC X(132).               00888200
008883                                                                  00888300
008890***************************************************************** 00889000
008900* CUSTOMS EXAM DATE.  THE DATE CUSTOMS NOTIFIED THE BROKER THEY * 00890000
009000* WOULD LIKE TO SCHEDULE AN EXAM.  SENT IF THE PURCHASE ORDER   * 00900000
009100* OR ENTIRE ENTRY IS TO BE EXAMINED.                            * 00910000
009200***************************************************************** 00920000
009300 01  TR017-REC-TYP-EXD REDEFINES TR017-REC-TYP-ENFPO.             00930000
009400     05 TR017-EXD-REC-KEY.                                        00940000
009500        10 TR017-EXD-TRN-TYP            PIC X(01).                00950000
009600           88 TR017-EXD-TRN-TYP-ADD                VALUE 'A'.     00960000
009700           88 TR017-EXD-TRN-TYP-CHG                VALUE 'C'.     00970000
009800           88 TR017-EXD-TRN-TYP-DEL                VALUE 'D'.     00980000
009900        10 TR017-EXD-REC-TYP-CDE        PIC X(06).                00990000
010000           88 TR017-EXD-REC-TYP-CDE-EXD            VALUE 'EXD   '.01000000
010100        10 TR017-EXD-SEQ-NBR            PIC X(02).                01010000
010200           88 TR017-EXD-SEQ-NBR-35                 VALUE '35'.    01020000
010300        10 TR017-EXD-3RD-PARTY-CDE      PIC X(06).                01030000
010400           88 TR017-EXD-3RD-PARTY-CDE-EI           VALUE '      '.01040000
010500        10 TR017-EXD-CSTM-ENTR-ID       PIC X(12).                01050000
010600     05 TR017-EXD-BKR-REF-NBR           PIC X(15).                01060000
010610     05 TR017-EXD-EXM-DTE               PIC X(08).                01061000
010620     05 TR017-EXD-EXM-TM                PIC X(04).                01062000
010630     05 TR017-EXD-POE-STD-EDI-CDE       PIC X(04).                01063000
010700     05 FILLER                          PIC X(89).                01070000
010800     05 TR017-EXD-CONSOL-END            PIC X(01).                01080000
010900     05 TR017-EXD-EDI-SEG-END           PIC X(01).                01090000
011000     05 TR017-EXD-EDI                   PIC X(01).                01100000
011100     05 TR017-EXD-FILE-ID               PIC X(09).                01110000
011110     05 TR017-EXD-ENT-ID                PIC 9(09).                01111003
011120     05 FILLER                          PIC X(132).               01112000
011200                                                                  01120000
011300***************************************************************** 01130000
011400* CUSTOMS REJECTION DATE.  THE DATE U.S. CUSTOMS REJECTED THE   * 01140000
011500* ENTRY.  SENT IF AN ENTRY WAS REJECTED, OR A PURCHASE ORDER OR * 01150000
011510* ENTRY FAILED.                                                   01151000
011600***************************************************************** 01160000
011700 01  TR017-REC-TYP-REJ REDEFINES TR017-REC-TYP-EXD.               01170000
011800     05 TR017-REJ-REC-KEY.                                        01180000
011900        10 TR017-REJ-TRN-TYP            PIC X(01).                01190000
012000           88 TR017-REJ-TRN-TYP-ADD                VALUE 'A'.     01200000
012100           88 TR017-REJ-TRN-TYP-CHG                VALUE 'C'.     01210000
012200           88 TR017-REJ-TRN-TYP-DEL                VALUE 'D'.     01220000
012300        10 TR017-REJ-REC-TYP-CDE        PIC X(06).                01230000
012400           88 TR017-REJ-REC-TYP-CDE-REJ            VALUE 'REJ   '.01240000
012500        10 TR017-REJ-SEQ-NBR            PIC X(02).                01250000
012600           88 TR017-REJ-SEQ-NBR-40                 VALUE '40'.    01260000
012700        10 TR017-REJ-3RD-PARTY-CDE      PIC X(06).                01270000
012800           88 TR017-REJ-3RD-PARTY-CDE-EI           VALUE '      '.01280000
012900        10 TR017-REJ-CSTM-ENTR-ID       PIC X(12).                01290000
013000     05 TR017-REJ-BKR-REF-NBR           PIC X(15).                01300000
013100     05 TR017-REJ-REJ-DTE               PIC X(08).                01310000
013200     05 TR017-REJ-REJ-TM                PIC X(04).                01320000
013210     05 TR017-REJ-REJ-DESC              PIC X(30).                01321000
013220     05 TR017-REJ-POE-STD-EDI-CDE       PIC X(04).                01322000
013300     05 FILLER                          PIC X(59).                01330000
013400     05 TR017-REJ-CONSOL-END            PIC X(01).                01340000
013500     05 TR017-REJ-EDI-SEG-END           PIC X(01).                01350000
013600     05 TR017-REJ-EDI                   PIC X(01).                01360000
013601     05 TR017-REJ-FILE-ID               PIC X(09).                01360100
013602     05 TR017-REJ-ENT-ID                PIC 9(09).                01360200
013603     05 FILLER                          PIC X(132).               01360300
013610                                                                  01361000
013800***************************************************************** 01380000
013810* ESTIMATED CUSTOMS CLEARANCE DATE.  THE ESTIMATED DATE U.S.    * 01381000
013900* CUSTOMS SHOULD CLEAR THE ENTRY.                               * 01390000
014100***************************************************************** 01410000
014200 01  TR017-REC-TYP-ECR REDEFINES TR017-REC-TYP-REJ.               01420000
014300     05 TR017-ECR-REC-KEY.                                        01430000
014400        10 TR017-ECR-TRN-TYP            PIC X(01).                01440000
014500           88 TR017-ECR-TRN-TYP-ADD                VALUE 'A'.     01450000
014600           88 TR017-ECR-TRN-TYP-CHG                VALUE 'C'.     01460000
014700           88 TR017-ECR-TRN-TYP-DEL                VALUE 'D'.     01470000
014800        10 TR017-ECR-REC-TYP-CDE        PIC X(06).                01480000
014900           88 TR017-ECR-REC-TYP-CDE-ECR            VALUE 'ECR   '.01490000
015000        10 TR017-ECR-SEQ-NBR            PIC X(02).                01500000
015100           88 TR017-ECR-SEQ-NBR-45                 VALUE '45'.    01510000
015200        10 TR017-ECR-3RD-PARTY-CDE      PIC X(06).                01520000
015300           88 TR017-ECR-3RD-PARTY-CDE-EI           VALUE '      '.01530000
015400        10 TR017-ECR-CSTM-ENTR-ID       PIC X(12).                01540000
015500     05 TR017-ECR-BKR-REF-NBR           PIC X(15).                01550000
015600     05 TR017-ECR-EST-CLR-DTE           PIC X(08).                01560000
015700     05 TR017-ECR-EST-CLR-TM            PIC X(04).                01570000
015710     05 TR017-ECR-POE-STD-EDI-CDE       PIC X(04).                01571000
015720     05 FILLER                          PIC X(89).                01572000
015730     05 TR017-ECR-CONSOL-END            PIC X(01).                01573000
015740     05 TR017-ECR-EDI-SEG-END           PIC X(01).                01574000
015750     05 TR017-ECR-EDI                   PIC X(01).                01575000
015751     05 TR017-ECR-FILE-ID               PIC X(09).                01575100
015752     05 TR017-ECR-ENT-ID                PIC 9(09).                01575200
015753     05 FILLER                          PIC X(132).               01575300
015760                                                                  01576000
015770***************************************************************** 01577000
015771* ACTUAL CUSTOMS CLEARANCE DATE.  THE DATE U.S. CUSTOMS CLEARED * 01577100
015780* THE ENTRY.  SENT AFTER THE PURCHASE ORDER AND/OR ENTRY HAS    * 01578000
015800* CLEARED CUSTOMS.                                              * 01580000
015810***************************************************************** 01581000
015820 01  TR017-REC-TYP-RLS REDEFINES TR017-REC-TYP-ECR.               01582000
015830     05 TR017-RLS-REC-KEY.                                        01583000
015840        10 TR017-RLS-TRN-TYP            PIC X(01).                01584000
015850           88 TR017-RLS-TRN-TYP-ADD                VALUE 'A'.     01585000
015860           88 TR017-RLS-TRN-TYP-CHG                VALUE 'C'.     01586000
015870           88 TR017-RLS-TRN-TYP-DEL                VALUE 'D'.     01587000
015880        10 TR017-RLS-REC-TYP-CDE        PIC X(06).                01588000
015890           88 TR017-RLS-REC-TYP-CDE-RLS            VALUE 'RLS   '.01589000
015891        10 TR017-RLS-SEQ-NBR            PIC X(02).                01589100
015892           88 TR017-RLS-SEQ-NBR-50                 VALUE '50'.    01589200
015893        10 TR017-RLS-3RD-PARTY-CDE      PIC X(06).                01589300
015894           88 TR017-RLS-3RD-PARTY-CDE-EI           VALUE '      '.01589400
015895        10 TR017-RLS-CSTM-ENTR-ID       PIC X(12).                01589500
015896     05 TR017-RLS-BKR-REF-NBR           PIC X(15).                01589600
015897     05 TR017-RLS-ACTL-CLR-DTE          PIC X(08).                01589700
015898     05 TR017-RLS-ACTL-CLR-TM           PIC X(04).                01589800
015899     05 TR017-RLS-POE-STD-EDI-CDE       PIC X(04).                01589900
015901     05 FILLER                          PIC X(89).                01590100
015902     05 TR017-RLS-CONSOL-END            PIC X(01).                01590200
015903     05 TR017-RLS-EDI-SEG-END           PIC X(01).                01590300
015904     05 TR017-RLS-EDI                   PIC X(01).                01590400
015905     05 TR017-RLS-FILE-ID               PIC X(09).                01590500
015906     05 TR017-RLS-ENT-ID                PIC 9(09).                01590600
015907     05 FILLER                          PIC X(132).               01590700
015908                                                                  01590800
015910***************************************************************** 01591000
016000* CUSTOMS LIQUIDATION DATE.  THE DATE U.S. CUSTOMS DECLARES THE * 01600000
016100* ENTRY LIQUIDATED.  SENT AFTER THE ENTRY HAS CLEARED CUSTOMS.  * 01610000
016300***************************************************************** 01630000
016400 01  TR017-REC-TYP-LIQ REDEFINES TR017-REC-TYP-RLS.               01640000
016500     05 TR017-LIQ-REC-KEY.                                        01650000
016600        10 TR017-LIQ-TRN-TYP            PIC X(01).                01660000
016700           88 TR017-LIQ-TRN-TYP-ADD                VALUE 'A'.     01670000
016800           88 TR017-LIQ-TRN-TYP-CHG                VALUE 'C'.     01680000
016900           88 TR017-LIQ-TRN-TYP-DEL                VALUE 'D'.     01690000
017000        10 TR017-LIQ-REC-TYP-CDE        PIC X(06).                01700000
017100           88 TR017-LIQ-REC-TYP-CDE-LIQ            VALUE 'LIQ   '.01710000
017200        10 TR017-LIQ-SEQ-NBR            PIC X(02).                01720000
017300           88 TR017-LIQ-SEQ-NBR-55                 VALUE '55'.    01730000
017400        10 TR017-LIQ-3RD-PARTY-CDE      PIC X(06).                01740000
017500           88 TR017-LIQ-3RD-PARTY-CDE-EI           VALUE '      '.01750000
017600        10 TR017-LIQ-CSTM-ENTR-ID       PIC X(12).                01760000
017700     05 TR017-LIQ-BKR-REF-NBR           PIC X(15).                01770000
017800     05 TR017-LIQ-LQDN-DTE              PIC X(08).                01780000
017810     05 TR017-LIQ-LQDN-TM               PIC X(04).                01781000
017811     05 TR017-LIQ-POE-STD-EDI-CDE       PIC X(04).                01781100
017820     05 FILLER                          PIC X(89).                01782000
017830     05 TR017-LIQ-CONSOL-END            PIC X(01).                01783000
017840     05 TR017-LIQ-EDI-SEG-END           PIC X(01).                01784000
017850     05 TR017-LIQ-EDI                   PIC X(01).                01785000
017860     05 TR017-LIQ-FILE-ID               PIC X(09).                01786000
017870     05 TR017-LIQ-ENT-ID                PIC 9(09).                01787000
017880     05 FILLER                          PIC X(132).               01788000
017900                                                                  01790000
018000***************************************************************** 01800000
018100* CUSTOMS LIQUIDATION SUSPENSION DATE.  THE DATE U.S. CUSTOMS   * 01810000
018200* DECLARES THE ENTRY IS SUSPENDED FROM LIQUIDATION.  SENT AFTER * 01820000
018300* THE ENTRY HAS CLEARED CUSTOMS.                                * 01830000
018400***************************************************************** 01840000
018500 01  TR017-REC-TYP-LSU REDEFINES TR017-REC-TYP-LIQ.               01850000
018600     05 TR017-LSU-REC-KEY.                                        01860000
018700        10 TR017-LSU-TRN-TYP            PIC X(01).                01870000
018800           88 TR017-LSU-TRN-TYP-ADD                VALUE 'A'.     01880000
018900           88 TR017-LSU-TRN-TYP-CHG                VALUE 'C'.     01890000
019000           88 TR017-LSU-TRN-TYP-DEL                VALUE 'D'.     01900000
019100        10 TR017-LSU-REC-TYP-CDE        PIC X(06).                01910000
019200           88 TR017-LSU-REC-TYP-CDE-LSU            VALUE 'LSU   '.01920000
019300        10 TR017-LSU-SEQ-NBR            PIC X(02).                01930000
019400           88 TR017-LSU-SEQ-NBR-60                 VALUE '60'.    01940000
019500        10 TR017-LSU-3RD-PARTY-CDE      PIC X(06).                01950000
019600           88 TR017-LSU-3RD-PARTY-CDE-EI           VALUE '      '.01960000
019700        10 TR017-LSU-CSTM-ENTR-ID       PIC X(12).                01970000
019800     05 TR017-LSU-BKR-REF-NBR           PIC X(15).                01980000
019900     05 TR017-LSU-LQDN-SSPNN-DTE        PIC X(08).                01990000
020000     05 TR017-LSU-LQDN-SSPNN-TM         PIC X(04).                02000000
020010     05 TR017-LSU-LQDN-SSPNN-DESC       PIC X(30).                02001000
020020     05 TR017-LSU-POE-STD-EDI-CDE       PIC X(04).                02002000
020100     05 FILLER                          PIC X(59).                02010000
020200     05 TR017-LSU-CONSOL-END            PIC X(01).                02020000
020300     05 TR017-LSU-EDI-SEG-END           PIC X(01).                02030000
020400     05 TR017-LSU-EDI                   PIC X(01).                02040000
020500     05 TR017-LSU-FILE-ID               PIC X(09).                02050000
020600     05 TR017-LSU-ENT-ID                PIC 9(09).                02060000
020700     05 FILLER                          PIC X(132).               02070000
