       01  TR050-CUSTOMS-ENTRY-PO-TABLE.                                        
           05  TR050-CSTM-ENTR-ID            PIC X(12)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR050-PO-NBR                  PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR050-CRE-TMST                PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR050-LAST-UPD-TMST           PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR050-EXTL-REF-NBR            PIC X(15)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR050-TIMESTAMP               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(30)  VALUE SPACES.           
