000100***************************************************************** 01/26/95
000200*    RECORD PURPOSE: INPUT RECORD LAYOUT FOR THE ASN CONTAINER  * SNRD001I
000300*    06-25-2004      EDIT PROGRAM. ORIGINALLY COPIED FROM       *    LV001
000400*                    SNRD001I, EDI MAPPED RAW ASN TO SNK LAYOUT.* SNRD001I
000500*                    ADD ISA CONTROL NUMBER, ASN NUMBER AND 11  *         
000501*                    BYTES OF FILLER TO THE END OF SNRD001I.    *         
000502*                                                  400 BYTES    *         
000600***************************************************************** 01/26/95
000700 01  TR063-ADV-SHIP-NOTICE-DTL-REC.                               SNRD001I
000800     05  TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
000900         10  TR063-REC-TYP-CDE                  PIC X(3).         SNRD001I
001000             88  ID-IDENTIFICATION-REC        VALUE 'ID '.              1I
001100             88  HL-HIERARCHICAL-REC          VALUE 'HL '.              1I
001200             88  PO4-ITEM-PHYSICAL-DTL-REC    VALUE 'PO4'.              1I
001300             88  TD1-CARRIER-QTY-WGHT-REC     VALUE 'TD1'.              1I
001400             88  TD5-CARRIER-RTE-TRNST-REC    VALUE 'TD5'.              1I
001500             88  TD4-CARRIER-SPECIAL-HAND     VALUE 'TD4'.                
001600             88  TD3-CARRIER-EQUIPMENT-REC    VALUE 'TD3'.              1I
001700             88  REF-REFERENCE-NUMBERS-REC    VALUE 'REF'.              1I
001800             88  DTM-DTE-TME-REFERENCE-REC    VALUE 'DTM'.              1I
001900             88  FOB-FOB-RELATED-INSTR-REC    VALUE 'FOB'.              1I
002000             88  N1-NAME-REC                  VALUE 'N1 '.              1I
002100             88  N2-ADDITIONAL-NAME-REC       VALUE 'N2 '.              1I
002200             88  N3-ADDRESS-REC               VALUE 'N3 '.              1I
002300             88  N4-GEOGRAPHIC-LOC-REC        VALUE 'N4 '.              1I
002400             88  PRF-PURCHASE-ORDER-REF-REC   VALUE 'PRF'.              1I
002500             88  CUR-CURRENCY-REC             VALUE 'CUR'.              1I
002600             88  PKG-MRKG-PCKG-LDG-REC        VALUE 'PKG'.              1I
002700             88  MAN-MARKS-NUMBERS-REC        VALUE 'MAN'.              1I
002800             88  LIN-ITEM-IDENTIFICATION-REC  VALUE 'LIN'.              1I
002900             88  SN1-ITEM-DETAIL-REC          VALUE 'SN1'.              1I
003000             88  SLN-SUBITEM-DETAIL-REC       VALUE 'SLN'.              1I
003100         10  TR063-FILLER-1                     PIC X(24).              1I
003200         10  TR063-LVL-CDE                      PIC X(2).               1I
003300             88  SHIPMENT-LEVEL                 VALUE 'S '.             1I
003400             88  ORDER-LEVEL                    VALUE 'O '.             1I
003500             88  PACK-LEVEL                     VALUE 'P '.             1I
003600             88  ITEM-LEVEL                     VALUE 'I '.             1I
003700         10  TR063-CHILD-CDE                    PIC X(1).               1I
003800             88  STD-PACK                       VALUE '1'.              1I
003900             88  NO-CARTON                      VALUE '0'.              1I
004000         10  TR063-FILLER-2                     PIC X(320).             1I
004100         10  TR063-ISA-CNTL-NBR-SEQ             PIC 9(9).                 
004200         10  TR063-SHIPT-ID-SEQ                 PIC X(30).                
004210         10  TR063-DAT-XFER-CNTL                PIC 9(9).               1I
004220         10  TR063-FILLER-3                     PIC X(02).        SNRD001I
004400*                                                                 SNRD001I
004500     05  TR063-HEADER-LEVEL-RECORD                                SNRD001I
004600                                     REDEFINES                    SNRD001I
004700         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
004800         10  TR063-HEADER-LEVEL-ID              PIC XXX.          SNRD001I
004900         10  TR063-EDI-VEND-ID.                                   SNRD001I
005000             15  TR063-VEND-DUNNS-NBR           PIC X(9).         SNRD001I
005100             15  TR063-VEND-ID-FILLER           PIC X(8).         SNRD001I
005200         10  TR063-BSN01-TRANS-CDE              PIC X(2).         SNRD001I
005300         10  TR063-BSN02-SHIPT-ID               PIC X(30).        SNRD001I
005400         10  TR063-BSN03-SHIPT-DTE              PIC 9(6).         SNRD001I
005500         10  TR063-BSN04-SHIPT-TIME             PIC 9(4).         SNRD001I
005600         10  TR063-RECYCLE-DATE.                                  SNRD001I
005700             15  TR063-RECYCLE-YY               PIC 9(2).         SNRD001I
005800             15  TR063-RECYCLE-MM               PIC 9(2).         SNRD001I
005900             15  TR063-RECYCLE-DD               PIC 9(2).         SNRD001I
006000         10  TR063-STRUC-CDE                    PIC X(4).         SNRD001I
006100         10  TR063-ISA-CNTL-NBR                 PIC 9(9).         SNRD001I
006200         10  TR063-GS-CNTL-NBR                  PIC 9(9).         SNRD001I
006300         10  TR063-ST-CNTL-NBR                  PIC X(9).         SNRD001I
006400         10  TR063-ISA-TMST                     PIC X(26).                
006500         10  TR063-SESSION-NBR                  PIC 9(6).                 
006600         10  TR063-ISA-ID-QUAL                  PIC X(2).                 
006700         10  TR063-ISA-ID                       PIC X(15).                
006800         10  TR063-FILLER                       PIC X(202).       SNRD001I
006900         10  TR063-ISA-CNTL-NBR-SEQ-ID          PIC 9(9).                 
007000         10  TR063-SHIPT-ID-SEQ-ID              PIC X(30).                
007100         10  TR063-DAT-XFER-CNTL-ID             PIC 9(9).               1I
007200         10  TR063-FILLER-1                     PIC X(02).        SNRD001I
007300*                                                                 SNRD001I
007400     05  TR063-HL-SEGMENT                                         SNRD001I
007500                                     REDEFINES                    SNRD001I
007600         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
007700         10  TR063-HL-ID                        PIC XXX.          SNRD001I
007800         10  TR063-HL01-ID-NBR                  PIC X(12).        SNRD001I
007900         10  TR063-HL02-PARENT-ID               PIC X(12).        SNRD001I
008000         10  TR063-HL03-LVL-CDE                 PIC X(2).         SNRD001I
008100         10  TR063-HL04-CHILD-CDE               PIC X(1).         SNRD001I
008200         10  TR063-HL-FILLER                    PIC X(320).       SNRD001I
008300         10  TR063-ISA-CNTL-NBR-SEQ-HL          PIC 9(9).                 
008400         10  TR063-SHIPT-ID-SEQ-HL              PIC X(30).                
008401         10  TR063-DAT-XFER-CNTL-HL             PIC 9(9).               1I
008500         10  TR063-HL-FILLER1                   PIC X(02).        SNRD001I
008600*                                                                 SNRD001I
008700     05  TR063-PO4-SEGMENT                                        SNRD001I
008800                                     REDEFINES                    SNRD001I
008900         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
009000         10  TR063-PO4-ID                       PIC XXX.          SNRD001I
009100         10  TR063-PO401-PKG-SIZE-QTY           PIC S9(7)         SNRD001I
009200                                      COMP-3.                     SNRD001I
009300         10  TR063-PO402-SIZE-MSMT              PIC S9(9)V9(2)    SNRD001I
009400                                      COMP-3.                     SNRD001I
009500         10  TR063-PO403-SIZE-UM-CDE            PIC X(2).         SNRD001I
009600         10  TR063-PO405-WGHT-QUAL-CDE          PIC X(2).         SNRD001I
009700         10  TR063-PO406-GRO-WGHT-MSMT          PIC S9(9)V9(2)    SNRD001I
009800                                      COMP-3.                     SNRD001I
009900         10  TR063-PO407-WGHT-UM-CDE            PIC X(2).         SNRD001I
010000         10  TR063-PO408-GRO-VOL-MSMT           PIC S9(9)V9(2)    SNRD001I
010100                                      COMP-3.                     SNRD001I
010200         10  TR063-PO409-VOL-UM-CDE             PIC X(2).         SNRD001I
010300         10  TR063-PO410-LEN-MSMT               PIC S9(9)V9(2)    SNRD001I
010400                                      COMP-3.                     SNRD001I
010500         10  TR063-PO411-WDTH-MSMT              PIC S9(9)V9(2)    SNRD001I
010600                                      COMP-3.                     SNRD001I
010700         10  TR063-PO412-HT-MSMT                PIC S9(9)V9(2)    SNRD001I
010800                                      COMP-3.                     SNRD001I
010900         10  TR063-PO413-UM-CDE                 PIC X(2).         SNRD001I
011000         10  TR063-PO414-INPK-EA-QTY            PIC 9(6).         SNRD001I
011100         10  TR063-PO4-FILLER                   PIC X(291).       SNRD001I
011200         10  TR063-ISA-CNTL-NBR-SEQ-PO4         PIC 9(9).                 
011300         10  TR063-SHIPT-ID-SEQ-PO4             PIC X(30).                
011310         10  TR063-DAT-XFER-CNTL-PO4            PIC 9(9).               1I
011400         10  TR063-PO4-FILLER1                  PIC X(02).        SNRD001I
011500*                                                                 SNRD001I
011600     05  TR063-TD1-SEGMENT                                        SNRD001I
011700                                     REDEFINES                    SNRD001I
011800         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
011900         10  TR063-TD1-ID                       PIC XXX.          SNRD001I
012000         10  TR063-TD101-PKG-CDE                PIC X(5).         SNRD001I
012100         10  TR063-TD102-SHIPT-QTY              PIC S9(7)         SNRD001I
012200                                      COMP-3.                     SNRD001I
012300         10  TR063-TD106-WGHT-QUAL-CDE          PIC X(2).         SNRD001I
012400         10  TR063-TD107-WGHT-MSMT              PIC S9(9)V9(2)    SNRD001I
012500                                      COMP-3.                     SNRD001I
012600         10  TR063-TD108-UM-CDE                 PIC X(2).         SNRD001I
012700         10  TR063-TD1-FILLER                   PIC X(328).       SNRD001I
012800         10  TR063-ISA-CNTL-NBR-SEQ-TD1         PIC 9(9).                 
012900         10  TR063-SHIPT-ID-SEQ-TD1             PIC X(30).                
012901         10  TR063-DAT-XFER-CNTL-TD1            PIC 9(9).               1I
012902         10  TR063-TD1-FILLER1                  PIC X(02).        SNRD001I
012903*                                                                         
012904     05  TR063-TD4-SEGMENT                                                
012905                                     REDEFINES                            
012906         TR063-SHIP-NOTICE-DTL-RECORD.                                    
012907         10  TR063-TD4-ID                       PIC XXX.                  
012908         10  TR063-TD401-CARR-SPECIAL-HAND      PIC X(3).                 
013100         10  TR063-TD4-FILLER                   PIC X(344).               
013200         10  TR063-ISA-CNTL-NBR-SEQ-TD4         PIC 9(9).                 
013300         10  TR063-SHIPT-ID-SEQ-TD4             PIC X(30).                
013301         10  TR063-DAT-XFER-CNTL-TD4            PIC 9(9).               1I
013302         10  TR063-TD4-FILLER1                  PIC X(02).        SNRD001I
013303*                                                                         
013304     05  TR063-TD5-SEGMENT                                        SNRD001I
013305                                     REDEFINES                    SNRD001I
013306         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
013307         10  TR063-TD5-ID                       PIC XXX.          SNRD001I
013308         10  TR063-TD501-RTE-SEQ-CDE            PIC X(2).         SNRD001I
013309         10  TR063-TD502-CARR-ID-QUAL-CDE       PIC X(2).         SNRD001I
013310         10  TR063-TD503-CARR-ID-CDE            PIC X(17).        SNRD001I
013311         10  TR063-TD504-TRANS-MTHD-CDE         PIC X(2).         SNRD001I
013320         10  TR063-TD505-CARR-NME               PIC X(35).        SNRD001I
013321         10  TR063-TD506-STATUS-CDE             PIC X(2).         SNRD001I
013322         10  TR063-TD507-LOC-QUAL               PIC X(2).                 
013323         10  TR063-TD508-LOC-ID                 PIC X(30).                
013324         10  TR063-TD510-TRNS-TME-QUAL-CDE      PIC X(2).         SNRD001I
013325         10  TR063-TD511-TRNST-TIME             PIC S9(4)V9(5)    SNRD001I
013326                                      COMP-3.                     SNRD001I
013327         10  TR063-TD5-FILLER                   PIC X(248).       SNRD001I
013328         10  TR063-ISA-CNTL-NBR-SEQ-TD5         PIC 9(9).                 
013329         10  TR063-SHIPT-ID-SEQ-TD5             PIC X(30).                
013330         10  TR063-DAT-XFER-CNTL-TD5            PIC 9(9).               1I
013331         10  TR063-TD5-FILLER1                  PIC X(02).        SNRD001I
013340*                                                                 SNRD001I
013350     05  TR063-TD3-SEGMENT                                        SNRD001I
013360                                     REDEFINES                    SNRD001I
013370         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
013380         10  TR063-TD3-ID                       PIC XXX.          SNRD001I
013390         10  TR063-TD301-EQUIP-CDE              PIC X(2).         SNRD001I
013400         10  TR063-TD302-EQUIP-INIT-CDE         PIC X(4).         SNRD001I
013500         10  TR063-TD303-EQUIP-NBR              PIC X(10).        SNRD001I
013600         10  TR063-TD3-FILLER                   PIC X(331).       SNRD001I
013700         10  TR063-ISA-CNTL-NBR-SEQ-TD3         PIC 9(9).                 
013800         10  TR063-SHIPT-ID-SEQ-TD3             PIC X(30).                
013810         10  TR063-DAT-XFER-CNTL-TD3            PIC 9(9).               1I
013900         10  TR063-TD3-FILLER1                  PIC X(02).        SNRD001I
014000*                                                                 SNRD001I
014100     05  TR063-REF-SEGMENT                                        SNRD001I
014200                                     REDEFINES                    SNRD001I
014300         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
014400         10  TR063-REF-ID                       PIC XXX.          SNRD001I
014500         10  TR063-REF01-NBR-QUAL-CDE           PIC X(2).         SNRD001I
014600         10  TR063-REF02-NBR                    PIC X(30).        SNRD001I
014700         10  TR063-REF-FILLER                   PIC X(315).       SNRD001I
014800         10  TR063-ISA-CNTL-NBR-SEQ-REF         PIC 9(9).                 
014900         10  TR063-SHIPT-ID-SEQ-REF             PIC X(30).                
014910         10  TR063-DAT-XFER-CNTL-REF            PIC 9(9).               1I
015000         10  TR063-REF-FILLER1                  PIC X(02).        SNRD001I
015100*                                                                 SNRD001I
015200     05  TR063-DTM-SEGMENT                                        SNRD001I
015300                                     REDEFINES                    SNRD001I
015400         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
015500         10  TR063-DTM-ID                       PIC XXX.          SNRD001I
015600         10  TR063-DTM01-DTE-QUAL-CDE           PIC X(3).         SNRD001I
015700         10  TR063-DTM02-DTE                    PIC 9(6).         SNRD001I
015800         10  TR063-DTM03-SHIP-TIME              PIC 9(4).         SNRD001I
015900         10  TR063-DTM-FILLER                   PIC X(334).       SNRD001I
016000         10  TR063-ISA-CNTL-NBR-SEQ-DTM         PIC 9(9).                 
016100         10  TR063-SHIPT-ID-SEQ-DTM             PIC X(30).                
016110         10  TR063-DAT-XFER-CNTL-DTM            PIC 9(9).               1I
016200         10  TR063-DTM-FILLER1                  PIC X(02).        SNRD001I
016300*                                                                 SNRD001I
016400     05  TR063-FOB-SEGMENT                                        SNRD001I
016500                                     REDEFINES                    SNRD001I
016600         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
016700         10  TR063-FOB-ID                       PIC XXX.          SNRD001I
016800         10  TR063-FOB01-SHIP-PAYT-TRM-CDE      PIC X(2).         SNRD001I
016900         10  TR063-FOB02-RESPBL-LOC-CDE         PIC X(2).         SNRD001I
017000         10  TR063-FOB03-RESPBL-LOC-DESC        PIC X(80).        SNRD001I
017100         10  TR063-FOB-FILLER                   PIC X(263).       SNRD001I
017200         10  TR063-ISA-CNTL-NBR-SEQ-FOB         PIC 9(9).                 
017300         10  TR063-SHIPT-ID-SEQ-FOB             PIC X(30).                
017310         10  TR063-DAT-XFER-CNTL-FOB            PIC 9(9).               1I
017400         10  TR063-FOB-FILLER1                  PIC X(02).        SNRD001I
017500*                                                                 SNRD001I
017600     05  TR063-N1-SEGMENT                                         SNRD001I
017700                                     REDEFINES                    SNRD001I
017800         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
017900         10  TR063-N1-ID                        PIC XXX.          SNRD001I
018000         10  TR063-N101-ID-CDE                  PIC X(2).         SNRD001I
018100         10  TR063-N102-CUST-NME                PIC X(35).        SNRD001I
018200         10  TR063-N103-NME-ID-QUAL-CDE         PIC X(2).         SNRD001I
018300         10  TR063-N104-NME-ID-CDE              PIC X(17).        SNRD001I
018400         10  TR063-N1-FILLER                    PIC X(291).       SNRD001I
018500         10  TR063-ISA-CNTL-NBR-SEQ-N1          PIC 9(9).                 
018600         10  TR063-SHIPT-ID-SEQ-N1              PIC X(30).                
018601         10  TR063-DAT-XFER-CNTL-N1             PIC 9(9).               1I
018700         10  TR063-N1-FILLER1                   PIC X(02).        SNRD001I
018800*                                                                 SNRD001I
018900     05  TR063-N2-SEGMENT                                         SNRD001I
019000                                     REDEFINES                    SNRD001I
019100         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
019200         10  TR063-N2-ID                        PIC XXX.          SNRD001I
019300         10  TR063-N201-NME1-TXT                PIC X(35).        SNRD001I
019400         10  TR063-N202-NME2-TXT                PIC X(35).        SNRD001I
019500         10  TR063-N2-FILLER                    PIC X(277).       SNRD001I
019600         10  TR063-ISA-CNTL-NBR-SEQ-N2          PIC 9(9).                 
019700         10  TR063-SHIPT-ID-SEQ-N2              PIC X(30).                
019710         10  TR063-DAT-XFER-CNTL-N2             PIC 9(9).               1I
019800         10  TR063-N2-FILLER1                   PIC X(02).        SNRD001I
019900*                                                                 SNRD001I
020000     05  TR063-N3-SEGMENT                                         SNRD001I
020100                                     REDEFINES                    SNRD001I
020200         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
020300         10  TR063-N3-ID                        PIC XXX.          SNRD001I
020400         10  TR063-N301-ADR1-TXT                PIC X(35).        SNRD001I
020500         10  TR063-N302-ADR2-TXT                PIC X(35).        SNRD001I
020600         10  TR063-N3-FILLER                    PIC X(277).       SNRD001I
020700         10  TR063-ISA-CNTL-NBR-SEQ-N3          PIC 9(9).                 
020800         10  TR063-SHIPT-ID-SEQ-N3              PIC X(30).                
020810         10  TR063-DAT-XFER-CNTL-N3             PIC 9(9).               1I
020900         10  TR063-N3-FILLER1                   PIC X(02).        SNRD001I
021000*                                                                 SNRD001I
021100     05  TR063-N4-SEGMENT                                         SNRD001I
021200                                     REDEFINES                    SNRD001I
021300         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
021400         10  TR063-N4-ID                        PIC XXX.          SNRD001I
021500         10  TR063-N401-CTY-NAME                PIC X(19).        SNRD001I
021600         10  TR063-N402-ST-CDE                  PIC X(2).         SNRD001I
021700         10  TR063-N403-ZIP-CDE                 PIC X(9).         SNRD001I
021800         10  TR063-N404-CNTRY-CDE               PIC X(2).         SNRD001I
021900         10  TR063-N4-FILLER                    PIC X(315).       SNRD001I
022000         10  TR063-ISA-CNTL-NBR-SEQ-N4          PIC 9(9).                 
022100         10  TR063-SHIPT-ID-SEQ-N4              PIC X(30).                
022110         10  TR063-DAT-XFER-CNTL-N4             PIC 9(9).               1I
022200         10  TR063-N4-FILLER1                   PIC X(02).        SNRD001I
022300*                                                                 SNRD001I
022400     05  TR063-PRF-SEGMENT                                        SNRD001I
022500                                     REDEFINES                    SNRD001I
022600         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
022700         10  TR063-PRF-ID                       PIC XXX.          SNRD001I
022800         10  TR063-PRF01-PO-NBR                 PIC X(22).        SNRD001I
022900         10  TR063-PRF03-PO-SEQ-NBR             PIC X(8).         SNRD001I
023000         10  TR063-PRF04-PO-DTE                 PIC 9(6).         SNRD001I
023100         10  TR063-PRF-FILLER                   PIC X(311).       SNRD001I
023200         10  TR063-ISA-CNTL-NBR-SEQ-PRF         PIC 9(9).                 
023300         10  TR063-SHIPT-ID-SEQ-PRF             PIC X(30).                
023310         10  TR063-DAT-XFER-CNTL-PRF            PIC 9(9).               1I
023400         10  TR063-PRF-FILLER1                  PIC X(02).        SNRD001I
023500*                                                                 SNRD001I
023600     05  TR063-CUR-SEGMENT                                        SNRD001I
023700                                     REDEFINES                    SNRD001I
023800         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
023900         10  TR063-CUR-ID                       PIC XXX.          SNRD001I
024000         10  TR063-CUR01-ID-CDE                 PIC X(2).         SNRD001I
024100         10  TR063-CUR02-CURR-CDE               PIC X(3).         SNRD001I
024200         10  TR063-CUR03-EXCH-FCTR              PIC S9(6)V9(5)    SNRD001I
024300                                      COMP-3.                     SNRD001I
024400         10  TR063-CUR04-ID-CDE                 PIC X(2).         SNRD001I
024500         10  TR063-CUR05-CURR-CDE               PIC X(3).         SNRD001I
024600         10  TR063-CUR-FILLER                   PIC X(331).       SNRD001I
024700         10  TR063-ISA-CNTL-NBR-SEQ-CUR         PIC 9(9).                 
024800         10  TR063-SHIPT-ID-SEQ-CUR             PIC X(30).                
024810         10  TR063-DAT-XFER-CNTL-CUR            PIC 9(9).               1I
024900         10  TR063-CUR-FILLER1                  PIC X(02).        SNRD001I
025000*                                                                 SNRD001I
025100     05  TR063-PKG-SEGMENT                                        SNRD001I
025200                                     REDEFINES                    SNRD001I
025300         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
025400         10  TR063-PKG-ID                       PIC XXX.          SNRD001I
025500         10  TR063-PKG01-TYP-CDE                PIC X(1).         SNRD001I
025600         10  TR063-PKG02-PKG-CDE                PIC X(5).         SNRD001I
025700         10  TR063-PKG03-QUAL-CDE               PIC X(2).         SNRD001I
025800         10  TR063-PKG04-DESC-CDE               PIC X(7).         SNRD001I
025900         10  TR063-PKG-FILLER                   PIC X(332).       SNRD001I
026000         10  TR063-ISA-CNTL-NBR-SEQ-PKG         PIC 9(9).                 
026100         10  TR063-SHIPT-ID-SEQ-PKG             PIC X(30).                
026110         10  TR063-DAT-XFER-CNTL-PKG            PIC 9(9).               1I
026200         10  TR063-PKG-FILLER1                  PIC X(02).        SNRD001I
026300*                                                                 SNRD001I
026400     05  TR063-MAN-SEGMENT                                        SNRD001I
026500                                     REDEFINES                    SNRD001I
026600         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
026700         10  TR063-MAN-ID                       PIC XXX.          SNRD001I
026800         10  TR063-MAN01-NBR-QUAL-CDE           PIC X(2).         SNRD001I
026900         10  TR063-MAN02-NBR                    PIC X(45).        SNRD001I
027000         10  TR063-MAN-FILLER                   PIC X(300).       SNRD001I
027100         10  TR063-ISA-CNTL-NBR-SEQ-MAN         PIC 9(9).                 
027200         10  TR063-SHIPT-ID-SEQ-MAN             PIC X(30).                
027210         10  TR063-DAT-XFER-CNTL-MAN            PIC 9(9).               1I
027300         10  TR063-MAN-FILLER1                  PIC X(02).        SNRD001I
027400*                                                                 SNRD001I
027500     05  TR063-LIN-SEGMENT                                        SNRD001I
027600                                     REDEFINES                    SNRD001I
027700         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
027800         10  TR063-LIN-ID                       PIC XXX.          SNRD001I
027900         10  TR063-LIN01-ID-CDE                 PIC X(6).         SNRD001I
028000         10  TR063-PROD-ID-GROUP   OCCURS    10.                  SNRD001I
028100             15  TR063-LIN02-PROD-ID-QUAL-CDE   PIC X(2).         SNRD001I
028200             15  TR063-LIN03-PROD-ID            PIC X(30).        SNRD001I
028300         10  TR063-FILLER                       PIC X(21).        SNRD001I
028400         10  TR063-ISA-CNTL-NBR-SEQ-LIN         PIC 9(9).                 
028500         10  TR063-SHIPT-ID-SEQ-LIN             PIC X(30).                
028510         10  TR063-DAT-XFER-CNTL-LIN            PIC 9(9).               1I
028600         10  TR063-LIN-FILLER1                  PIC X(02).        SNRD001I
028700*                                                                 SNRD001I
028800     05  TR063-SN1-SEGMENT                                        SNRD001I
028900                                     REDEFINES                    SNRD001I
029000         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
029100         10  TR063-SN1-ID                       PIC XXX.          SNRD001I
029200         10  TR063-SN101-ID-CDE                 PIC X(6).         SNRD001I
029300         10  TR063-SN102-SHIP-QTY               PIC S9(7)         SNRD001I
029400                                      COMP-3.                     SNRD001I
029500         10  TR063-SN103-SHIP-UM-CDE            PIC X(2).         SNRD001I
029600         10  TR063-SN104-SHIPT-DTE-QTY          PIC S9(7)         SNRD001I
029700                                      COMP-3.                     SNRD001I
029800         10  TR063-SN105-ORD-QTY                PIC S9(7)         SNRD001I
029900                                      COMP-3.                     SNRD001I
030000         10  TR063-SN106-ORD-UM-CDE             PIC X(2).         SNRD001I
030100         10  TR063-SN1-FILLER                   PIC X(325).       SNRD001I
030200         10  TR063-ISA-CNTL-NBR-SEQ-SN1         PIC 9(9).                 
030300         10  TR063-SHIPT-ID-SEQ-SN1             PIC X(30).                
030310         10  TR063-DAT-XFER-CNTL-SN1            PIC 9(9).               1I
030400         10  TR063-SN1-FILLER1                  PIC X(02).        SNRD001I
030500*                                                                 SNRD001I
030600     05  TR063-SLN-SEGMENT                                        SNRD001I
030700                                     REDEFINES                    SNRD001I
030800         TR063-SHIP-NOTICE-DTL-RECORD.                            SNRD001I
030900         10  TR063-SLN-ID                       PIC XXX.          SNRD001I
031000         10  TR063-SLN01-ID                     PIC X(6).         SNRD001I
031100         10  TR063-SLN03-CONFIG-CDE             PIC X(1).         SNRD001I
031200         10  TR063-SLN04-QTY                    PIC S9(7)         SNRD001I
031300                                      COMP-3.                     SNRD001I
031400         10  TR063-SLN05-UM-CDE                 PIC X(2).         SNRD001I
031500         10  TR063-SLN06-UNIT-PRICE-AMT         PIC S9(9)V9(2)    SNRD001I
031600                                      COMP-3.                     SNRD001I
031700         10  TR063-SLN07-UNIT-PRICE-CDE         PIC X(2).         SNRD001I
031800         10  TR063-SLN08-PRICE-CD               PIC X(1).         SNRD001I
031900         10  TR063-PROD-ID-GROUP   OCCURS    10.                  SNRD001I
032000             15  TR063-SLN09-PROD-ID-QUAL-CDE   PIC X(2).         SNRD001I
032100             15  TR063-SLN10-PROD-ID            PIC X(30).        SNRD001I
032200         10  TR063-SLN-FILLER                   PIC X(05).        SNRD001I
032300         10  TR063-ISA-CNTL-NBR-SEQ-SLN         PIC 9(9).                 
032400         10  TR063-SHIPT-ID-SEQ-SLN             PIC X(30).                
032410         10  TR063-DAT-XFER-CNTL-SLN            PIC 9(9).               1I
032500         10  TR063-SLN-FILLER1                  PIC X(02).        SNRD001I
032600                                                                  SNRD001I
032700                                                                  SNRD001I
