000100***************************************************************** 00010000
000200*    RECORD PURPOSE: DELIVERY ORDER DETAIL/ERROR DATA FROM      * 00020000
000300*                    EDIT PROGRAM.                              * 00030000
000400*    RECORD LENGTH:  508                              TOUTTR9   * 00040000
000500*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD251   * 00050000
000600***************************************************************** 00060000
000603 01  TR251-RECORD.                                                00070000
000604*  ************************************************************** 00080000
000605*  * DATA COMMON TO ALL RECORD TYPES.                           * 00090000
000606*  ************************************************************** 00100000
000607   05  TR241-DLV-RPT-PAR-1-ODR.                                   00110000
000608     07  TR251-RPT-TYP                 PIC X(01).                 00120000
000609         88 TR251-RPT-TYP-ERROR                VALUE 'E'.         00130000
000610         88 TR251-RPT-TYP-DETAIL               VALUE 'D'.         00140000
000611     07  TR251-PROCESS-SEQ-NBR         PIC 9(06)  VALUE ZERO.     00150000
000612     07  TR251-TRN-TYPES.                                         00160000
000613         10  TR251-TRN-TYP             PIC X(01).                 00170000
000620            88 TR251-TRN-TYP-ADD                  VALUE 'A'.      00180000
000640            88 TR251-TRN-TYP-CHG                  VALUE 'C'.      00190000
000650            88 TR251-TRN-TYP-DEL                  VALUE 'D'.      00200000
000670         10 TR251-CONTNR-ID            PIC X(15)  VALUE SPACES.   00210000
000671         10 TR251-EXTL-REF-NBR         PIC X(15)  VALUE SPACES.   00220000
000680         10 TR251-PO-NBR               PIC 9(09)  VALUE ZERO.     00230000
000690         10 TR251-POE-NM               PIC X(30)  VALUE SPACES.   00240000
000700         10 TR251-DCONSLR-SCAC-ID      PIC X(04)  VALUE SPACES.   00250000
001300         10 TR251-DATA-IN-ERROR        PIC X(15)  VALUE SPACES.   00260000
001400         10 TR251-DATA-VALUE-NUM.                                 00270000
001500            15 TR251-DATA-VALUE-X      PIC 9(02)  VALUE ZERO.     00280000
001600            15 TR251-DATA-VALUE-N      PIC 9(15)V9(3) VALUE ZERO. 00290000
001700         10 TR251-DATA-VALUE REDEFINES                            00300000
001800            TR251-DATA-VALUE-NUM       PIC X(20).                 00310000
001900         10 TR251-ERROR-TYPE           PIC X(03)  VALUE SPACES.   00320000
002000         10 TR251-ERROR-MSG            PIC X(50)  VALUE SPACES.   00330000
002001         10 TR251-DAT-SRC-ENT-ID       PIC X(09)  VALUE SPACES.   00340000
002010         10 FILLER                     PIC X(76)  VALUE SPACES.   00350000
002100                                                                  00360000
002110   05  TR241-DLV-RPT-PAR-2-ODR.                                   00370000
002200*  ************************************************************** 00380000
002300*  * INFORMATION ABOUT THE HEADER ON THE ERROR OR DETAIL REPORT.* 00390000
002400*  ************************************************************** 00400000
002500     07  TR251-REC-TYP-HDR.                                       00410000
002600         10 TR251-REC-TYP-HDR-CDE      PIC X(06).                 00420000
002700            88 TR251-REC-TYP-HDR-CDE-HDR          VALUE 'HDR   '. 00430000
002800         10 TR251-HDR-SEQ-NBR          PIC X(02).                 00440000
002900            88 TR251-HDR-SEQ-NBR-01               VALUE '01'.     00450000
003000         10 TR251-HDR-3RD-PARTY-CDE    PIC X(06).                 00460000
003100            88 TR251-HDR-3RD-PARTY-CDE-EI         VALUE '      '. 00470000
003200         10 TR251-HDR-CONSOL-ENTNME    PIC X(30)  VALUE SPACES.   00480000
003300         10 TR251-HDR-CONSOL-TRNS-DTE  PIC X(08)  VALUE SPACES.   00490000
003400         10 TR251-HDR-CONSOL-TRNS-TM   PIC X(04)  VALUE SPACES.   00500000
003500         10 TR251-HDR-CONSOL-FIL-ID    PIC X(09)  VALUE SPACES.   00510000
003600         10 TR251-HDR-LOAD-DTE         PIC X(08)  VALUE SPACES.   00520000
003700         10 TR251-HDR-LOAD-TM          PIC X(04)  VALUE SPACES.   00530000
003800         10 FILLER                     PIC X(177) VALUE SPACES.   00540000
006700*                                                                 00550000
006701***************************************************************** 00560000
006702* REPORT INFORMATION FOR DPU RECORDS SENT TO INDICATE WHEN      * 00570000
006703* THE DECONSOLIDATOR CONFIRMED THAT THEY RECEIVED               * 00580000
006704* THE DELIVERY ORDER.                                           * 00590000
006705***************************************************************** 00600000
006706     07 TR251-REC-TYP-DPU REDEFINES TR251-REC-TYP-HDR.            00610000
006707        10 TR251-REC-TYP-DPU-CDE        PIC X(06).                00620000
006708           88 TR251-REC-TYP-DPU-CDE-DPU           VALUE 'DPU   '. 00630000
006709        10 TR251-DPU-SEQ-NBR            PIC X(02).                00640000
006710           88 TR251-DPU-SEQ-NBR-10                VALUE '10'.     00650000
006711        10 TR251-DPU-3RD-PARTY-CDE      PIC X(06).                00660000
006712           88 TR251-DPU-3RD-PARTY-CDE-EI          VALUE '      '. 00670000
006719        10 TR251-DPU-IMPRT-VEH-NM       PIC X(25).                00680000
006720        10 TR251-DPU-DELY-ORD-RCVD-DTE  PIC X(08).                00690000
006721        10 TR251-DPU-DELY-ORD-RCVD-TM   PIC X(04).                00700000
006724        10 FILLER                       PIC X(203).               00710000
006725*                                                                 00720000
006726***************************************************************** 00730000
006727* CRP RECORDS SENT TO INDICATE WHEN THE BROKER DECLARED THE     * 00740000
006728* CONTAINER READY FOR PICKUP BY DECONSOL.   (WAS FRL.) SENT     * 00750000
006729* AFTER THE BILL OF LADING AND FREIGHT IS PAID.                 * 00760000
006730***************************************************************** 00770000
006741     07 TR251-REC-TYP-CRP REDEFINES TR251-REC-TYP-HDR.            00780000
006742        10 TR251-REC-TYP-CRP-CDE        PIC X(06).                00790000
006743           88 TR251-REC-TYP-CRP-CDE-CRP           VALUE 'CRP   '. 00800000
006744        10 TR251-CRP-SEQ-NBR            PIC X(02).                00810000
006745           88 TR251-CRP-SEQ-NBR-20                VALUE '20'.     00820000
006746        10 TR251-CRP-3RD-PARTY-CDE      PIC X(06).                00830000
006747           88 TR251-CRP-3RD-PARTY-CDE-EI          VALUE '      '. 00840000
006748        10 TR251-CRP-IMPRT-VEH-NM       PIC X(25).                00850000
006749        10 TR251-CRP-FRGT-RLSE-DTE      PIC X(08).                00860000
006750        10 TR251-CRP-FRGT-RLSE-TM       PIC X(04).                00870000
006752        10 FILLER                       PIC X(203).               00880000
006753*                                                                 00890000
006754***************************************************************** 00900000
006755* REPORT INFORMATION FOR DLV RECORDS SENT TO INDICATE WHEN      * 00910000
006756* THE DECONSOLIDATOR PICKED UP THE CONTAINER.                   * 00920000
006757***************************************************************** 00930000
006758     07 TR251-REC-TYP-DLV REDEFINES TR251-REC-TYP-HDR.            00940000
006759        10 TR251-REC-TYP-DLV-CDE        PIC X(06).                00950000
006760           88 TR251-REC-TYP-DLV-CDE-DLV           VALUE 'DLV   '. 00960000
006761        10 TR251-DLV-SEQ-NBR            PIC X(02).                00970000
006762           88 TR251-DLV-SEQ-NBR-30                VALUE '30'.     00980000
006763        10 TR251-DLV-3RD-PARTY-CDE      PIC X(06).                00990000
006764           88 TR251-DLV-3RD-PARTY-CDE-EI          VALUE '      '. 01000000
006765        10 TR251-DLV-IMPRT-VEH-NM       PIC X(25).                01010000
006766        10 TR251-DLV-CONTNR-PCKUP-DTE   PIC X(08).                01020000
006767        10 TR251-DLV-CONTNR-PCKUP-TM    PIC X(04).                01030000
006769        10 FILLER                       PIC X(203).               01040000
006770*                                                                 01050000
006780***************************************************************** 01060000
006790* REPORT INFORMATION FOR DVN RECORDS SENT TO INDICATE WHEN      * 01070000
006800* THE DECONSOLIDATOR UNLOADED THE CONTAINER.                    * 01080000
006900***************************************************************** 01090000
007000     07 TR251-REC-TYP-DVN REDEFINES TR251-REC-TYP-HDR.            01100000
007100        10 TR251-REC-TYP-DVN-CDE        PIC X(06).                01110000
007200           88 TR251-REC-TYP-DVN-CDE-DVN           VALUE 'DVN   '. 01120000
007300        10 TR251-DVN-SEQ-NBR            PIC X(02).                01130000
007400           88 TR251-DVN-SEQ-NBR-40                VALUE '40'.     01140000
007500        10 TR251-DVN-3RD-PARTY-CDE      PIC X(06).                01150000
007600           88 TR251-DVN-3RD-PARTY-CDE-EI          VALUE '      '. 01160000
007900        10 TR251-DVN-IMPRT-VEH-NM       PIC X(25).                01170000
008000        10 TR251-DVN-CONTNR-DEVAN-DTE   PIC X(08).                01180000
008100        10 TR251-DVN-CONTNR-DEVAN-TM    PIC X(04).                01190000
008400        10 FILLER                       PIC X(203).               01200000
008500*                                                                 01210000
008501***************************************************************** 01220000
008502* CONTAINER RETURNED BY DECONSOLIDATOR.  THE DATE THE           * 01230000
008510* DECONSOLIDATOR RETURNED THE CONTAINER TO THE DOCK.            * 01240000
008600***************************************************************** 01250000
008700     07 TR251-REC-TYP-RTN REDEFINES TR251-REC-TYP-HDR.            01260000
008800        10 TR251-REC-TYP-RTN-CDE        PIC X(06).                01270000
008900           88 TR251-REC-TYP-RTN-CDE-RTN           VALUE 'RTN   '. 01280000
009000        10 TR251-RTN-SEQ-NBR            PIC X(02).                01290000
009100           88 TR251-RTN-SEQ-NBR-50                VALUE '50'.     01300000
009200        10 TR251-RTN-3RD-PARTY-CDE      PIC X(06).                01310000
009300           88 TR251-RTN-3RD-PARTY-CDE-EI          VALUE '      '. 01320000
009400        10 TR251-RTN-IMPRT-VEH-NM       PIC X(25).                01330000
009500        10 TR251-RTN-CONTNR-RETURN-DTE  PIC X(08).                01340000
009600        10 TR251-RTN-CONTNR-RETURN-TM   PIC X(04).                01350000
009800        10 FILLER                       PIC X(203).               01360000
009900*                                                                 01370000
010000***************************************************************** 01380000
010100* REPORT INFORMATION FOR DPU RECORDS SENT TO INDICATE WHEN      * 01390000
010200* THE DECONSOLIDATOR CONFIRMED THAT THEY RECEIVED               * 01400000
010300* THE DELIVERY ORDER.                                           * 01410000
010310* DPURD IS AN DPU FROM THE RECYCLE FILE. CREATED IN CONTAINER   * 01420000
010320* LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.                     * 01430000
010400***************************************************************** 01440000
010500     07 TR251-REC-TYP-DPURD REDEFINES TR251-REC-TYP-HDR.          01450000
010600        10 TR251-REC-TYP-DPURD-CDE      PIC X(06).                01460000
010700           88 TR251-REC-TYP-DPURD-CDE-DPURDD      VALUE 'DPURDD'. 01470000
010800        10 TR251-DPURD-SEQ-NBR          PIC X(02).                01480000
010900           88 TR251-DPURD-SEQ-NBR-15              VALUE '15'.     01490000
011000        10 TR251-DPURD-3RD-PARTY-CDE    PIC X(06).                01500000
011100           88 TR251-DPURD-3RD-PARTY-CDE-EI        VALUE '      '. 01510000
011200        10 TR251-DPURD-IMPRT-VEH-NM     PIC X(25).                01520000
011300        10 TR251-DPURD-DELY-ORD-RCVD-DTE  PIC X(08).              01530000
011400        10 TR251-DPURD-DELY-ORD-RCVD-TM PIC X(04).                01540000
011500        10 FILLER                       PIC X(203).               01550000
011600*                                                                 01560000
011700***************************************************************** 01570000
011800* CRP RECORDS SENT TO INDICATE WHEN THE BROKER DECLARED THE     * 01580000
011900* CONTAINER READY FOR PICKUP BY DECONSOL.   (WAS FRL.) SENT     * 01590000
012000* AFTER THE BILL OF LADING AND FREIGHT IS PAID.                 * 01600000
012010* CRPRD IS AN CRP FROM THE RECYCLE FILE. CREATED IN CONTAINER   * 01610000
012020* LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.                     * 01620000
012100***************************************************************** 01630000
012200     07 TR251-REC-TYP-CRPRD REDEFINES TR251-REC-TYP-HDR.          01640000
012300        10 TR251-REC-TYP-CRPRD-CDE      PIC X(06).                01650000
012400           88 TR251-REC-TYP-CRPRD-CDE-CRPRDD      VALUE 'CRPRDD'. 01660000
012500        10 TR251-CRPRD-SEQ-NBR          PIC X(02).                01670000
012600           88 TR251-CRPRD-SEQ-NBR-25                VALUE '25'.   01680000
012700        10 TR251-CRPRD-3RD-PARTY-CDE    PIC X(06).                01690000
012800           88 TR251-CRPRD-3RD-PARTY-CDE-EI        VALUE '      '. 01700000
012900        10 TR251-CRPRD-IMPRT-VEH-NM     PIC X(25).                01710000
013000        10 TR251-CRPRD-FRGT-RLSE-DTE    PIC X(08).                01720000
013100        10 TR251-CRPRD-FRGT-RLSE-TM     PIC X(04).                01730000
013200        10 FILLER                       PIC X(203).               01740000
013300*                                                                 01750000
013400***************************************************************** 01760000
013500* REPORT INFORMATION FOR DLV RECORDS SENT TO INDICATE WHEN      * 01770000
013600* THE DECONSOLIDATOR PICKED UP THE CONTAINER.                   * 01780000
013610* DLVRD IS AN DLV FROM THE RECYCLE FILE. CREATED IN CONTAINER   * 01790000
013620* LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.                     * 01800000
013700***************************************************************** 01810000
013800     07 TR251-REC-TYP-DLVRD REDEFINES TR251-REC-TYP-HDR.          01820000
013900        10 TR251-REC-TYP-DLVRD-CDE      PIC X(06).                01830000
014000           88 TR251-REC-TYP-DLVRD-CDE-DLVRDD      VALUE 'DLVRDD'. 01840000
014100        10 TR251-DLVRD-SEQ-NBR          PIC X(02).                01850000
014200           88 TR251-DLVRD-SEQ-NBR-35              VALUE '35'.     01860000
014300        10 TR251-DLVRD-3RD-PARTY-CDE    PIC X(06).                01870000
014400           88 TR251-DLVRD-3RD-PARTY-CDE-EI        VALUE '      '. 01880000
014500        10 TR251-DLVRD-IMPRT-VEH-NM     PIC X(25).                01890000
014600        10 TR251-DLVRD-CONTNR-PCKUP-DTE PIC X(08).                01900000
014700        10 TR251-DLVRD-CONTNR-PCKUP-TM  PIC X(04).                01910000
014800        10 FILLER                       PIC X(203).               01920000
014900*                                                                 01930000
015000***************************************************************** 01940000
015100* REPORT INFORMATION FOR DVN RECORDS SENT TO INDICATE WHEN      * 01950000
015200* THE DECONSOLIDATOR UNLOADED THE CONTAINER.                    * 01960000
015210* DVNRD IS AN DVN FROM THE RECYCLE FILE. CREATED IN CONTAINER   * 01970000
015220* LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.                     * 01980000
015300***************************************************************** 01990000
015400     07 TR251-REC-TYP-DVNRD REDEFINES TR251-REC-TYP-HDR.          02000000
015500        10 TR251-REC-TYP-DVNRD-CDE      PIC X(06).                02010000
015600           88 TR251-REC-TYP-DVNRD-CDE-DVNRDD      VALUE 'DVNRDD'. 02020000
015700        10 TR251-DVNRD-SEQ-NBR          PIC X(02).                02030000
015800           88 TR251-DVNRD-SEQ-NBR-45              VALUE '45'.     02040000
015900        10 TR251-DVNRD-3RD-PARTY-CDE    PIC X(06).                02050000
016000           88 TR251-DVNRD-3RD-PARTY-CDE-EI        VALUE '      '. 02060000
016100        10 TR251-DVNRD-IMPRT-VEH-NM     PIC X(25).                02070000
016200        10 TR251-DVNRD-CONTNR-DEVAN-DTE PIC X(08).                02080000
016300        10 TR251-DVNRD-CONTNR-DEVAN-TM  PIC X(04).                02090000
016400        10 FILLER                       PIC X(203).               02100000
016500*                                                                 02110000
016600***************************************************************** 02120000
016700* CONTAINER RETURNED BY DECONSOLIDATOR.  THE DATE THE           * 02130000
016800* DECONSOLIDATOR RETURNED THE CONTAINER TO THE DOCK.            * 02140000
016810* RTNRD IS AN RTN FROM THE RECYCLE FILE. CREATED IN CONTAINER   * 02150000
016820* LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.                     * 02160000
016900***************************************************************** 02170000
017000     07 TR251-REC-TYP-RTNRD REDEFINES TR251-REC-TYP-HDR.          02180000
017100        10 TR251-REC-TYP-RTNRD-CDE      PIC X(06).                02190000
017200           88 TR251-REC-TYP-RTNRD-CDE-RTNRDD      VALUE 'RTNRDD'. 02200000
017300        10 TR251-RTNRD-SEQ-NBR          PIC X(02).                02210000
017400           88 TR251-RTNRD-SEQ-NBR-55              VALUE '55'.     02220000
017500        10 TR251-RTNRD-3RD-PARTY-CDE    PIC X(06).                02230000
017600           88 TR251-RTNRD-3RD-PARTY-CDE-EI        VALUE '      '. 02240000
017700        10 TR251-RTNRD-IMPRT-VEH-NM     PIC X(25).                02250000
017800        10 TR251-RTNRD-CONTNR-RETURN-DTE  PIC X(08).              02260000
017900        10 TR251-RTNRD-CONTNR-RETURN-TM PIC X(04).                02270000
018000        10 FILLER                       PIC X(203).               02280000
018100*                                                                 02290000
      ***************************************************************** 02310004
      * REPORT INFORMATION FOR ARVDCN RECORDS SENT TO INDICATE THE    * 02320000
      * ARRIVAL OF CONTAINER AT THE DECONSOLIDATOR                    * 02330000
      ***************************************************************** 02340001
           07 TR251-REC-TYP-ARVDCN REDEFINES TR251-REC-TYP-HDR.         02350001
              10 TR251-REC-TYP-ARVDCN-CDE      PIC X(06).               02360001
                 88 TR251-REC-TYP-ARVDCN-CD-ARVDCN      VALUE 'ARVDCN'. 02370002
              10 TR251-ARVDCN-SEQ-NBR          PIC X(02).               02380001
                 88 TR251-ARVDCN-SEQ-NBR-37              VALUE '37'.    02390003
              10 TR251-ARVDCN-3RD-PARTY-CDE    PIC X(06).               02400001
                 88 TR251-ARVDCN-3RD-PARTY-CDE-EI        VALUE '      '.02410003
              10 TR251-ARVDCN-IMPRT-VEH-NM     PIC X(25).               02420001
              10 TR251-ARVDCN-ARRIVE-DECON-DTE PIC X(08).               02430001
              10 TR251-ARVDCN-ARRIVE-DECON-TM  PIC X(04).               02440001
              10 FILLER                        PIC X(203).              02450001
      ***************************************************************** 02460001
      * REPORT INFORMATION FOR ARVDCN RECORDS SENT TO INDICATE THE    * 02470001
      * ARRIVAL OF CONTAINER AT THE DECONSOLIDATOR                    * 02480001
      * ARVDRD IS A ARVDCN FROM THE RECYCLE FILE. CREATED IN CONTAINER* 02490001
      * LOAD PROGRAM WHEN TIMCNTK ROW IS DELETED.                     * 02500001
      ***************************************************************** 02510001
           07 TR251-REC-TYP-ARVDRD REDEFINES TR251-REC-TYP-HDR.         02520001
              10 TR251-REC-TYP-ARVDRD-CDE      PIC X(06).               02530001
                 88 TR251-REC-TYP-ARVDRD-CD-ARVDRD     VALUE 'ARVDRD'.  02540002
              10 TR251-ARVDRD-SEQ-NBR          PIC X(02).               02550001
                 88 TR251-ARVDRD-SEQ-NBR-15             VALUE '38'.     02560001
              10 TR251-ARVDRD-3RD-PARTY-CDE    PIC X(06).               02570001
                 88 TR251-ARVDRD-3RD-PARTY-CDE-EI       VALUE '      '. 02580001
              10 TR251-ARVDRD-IMPRT-VEH-NM     PIC X(25).               02590001
              10 TR251-ARVDRD-ARRIVE-DECON-DTE PIC X(08).               02600001
              10 TR251-ARVDRD-ARRIVE-DECON-TM  PIC X(04).               02610001
              10 FILLER                        PIC X(203).              02620001
      *                                                                 02630004
