       01  TR051-CUSTOMS-ENTRY-TABLE.                                           
           05  TR051-ACTL-CLR-TMST           PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-BKR-REF-NBR             PIC X(15)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-CRE-TMST                PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-CSTM-ENTR-ID            PIC X(12)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-DAT-SRC-ENT-ID          PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-ENT-ID                  PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-ENTR-TYP-CDE            PIC X(02)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-EST-CLR-TMST            PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-EXM-TMST                PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-FILD-TMST               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-LAST-UPD-TMST           PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-LQDN-SSPNN-TMST         PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-LQDN-TMST               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-MOM-DEST-POE-CDE        PIC X(04)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-MOM-TRIP-TYP-CDE        PIC X(01)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-REJ-TMST                PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR051-TIMESTAMP               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(30)  VALUE SPACES.           
