000100***************************************************************** 00010000
000200*    RECORD PURPOSE: ORIGIN BOOKING DETAIL/ERROR DATA FROM EDIT * 00020000
000300*                    PROGRAM.                                   * 00030000
000400*    RECORD LENGTH:  254                                        * 00040000
000500*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD201   * 00050000
000600***************************************************************** 00060000
000601*  DATA COMMON TO ALL RECORD TYPES.                             * 00060100
000602***************************************************************** 00061000
000700 01  TR201-RECORD.                                                00070000
000800     05  TR201-RPT-TYP                 PIC X(01).                 00080000
000900         88 TR201-RPT-TYP-ERROR                VALUE 'E'.         00090000
001000         88 TR201-RPT-TYP-DETAIL               VALUE 'D'.         00100000
001100     05  TR201-PROCESS-SEQ-NBR         PIC 9(06)  VALUE ZERO.     00110000
001200     05  TR201-TRN-TYPES.                                         00120000
001300         10  TR201-TRN-TYP             PIC X(01).                 00130000
001400            88 TR201-TRN-TYP-ADD                  VALUE 'A'.      00140000
001500            88 TR201-TRN-TYP-ADD-EDIT-GRP         VALUE 'B'.      00150000
001600            88 TR201-TRN-TYP-ADD-EDIT-SGL         VALUE 'Z'.      00160000
001700            88 TR201-TRN-TYP-CHG                  VALUE 'C'.      00170000
001800            88 TR201-TRN-TYP-DEL                  VALUE 'D'.      00180000
001900            88 TR201-TRN-TYP-DEL-EDIT             VALUE 'E'.      00190000
002000         10 TR201-PO-NBR               PIC 9(09).                 00200000
002100         10 TR201-PO-NBR-X REDEFINES                              00210000
002200            TR201-PO-NBR               PIC X(09).                 00220000
002300         10 TR201-EXTL-REF-NBR         PIC X(15)  VALUE SPACE.    00230000
002400         10 TR201-PO-BKG-DELY-DTE      PIC X(08)  VALUE SPACE.    00240000
002500         10 TR201-PO-BKG-DELY-TM       PIC X(04)  VALUE SPACE.    00250000
002600         10  TR201-ORGN-SHPD-FR-CDE    PIC X(03).                 00260000
002700             88 TR201-ORGN-SHPD-FR-CFS            VALUE 'CFS'.    00270000
002800             88 TR201-ORGN-SHPD-FR-CY             VALUE 'CY '.    00280000
002900         10 TR201-DATA-IN-ERROR        PIC X(15)  VALUE SPACE.    00290000
003000         10 TR201-DATA-VALUE-NUM.                                 00300000
003100            15 TR201-DATA-VALUE-X      PIC 9(02)  VALUE ZERO.     00310000
003200            15 TR201-DATA-VALUE-N      PIC 9(15)V9(3) VALUE ZERO. 00320000
003300         10 TR201-DATA-VALUE REDEFINES                            00330000
003400            TR201-DATA-VALUE-NUM       PIC X(20).                 00340000
003500         10 TR201-ERROR-TYPE           PIC X(03)  VALUE SPACE.    00350000
003600         10 TR201-ERROR-MSG            PIC X(50)  VALUE SPACE.    00360000
003610         10 TR201-DAT-SRC-ENT-ID       PIC X(09)  VALUE SPACE.    00361000
003700                                                                  00370000
003800***************************************************************** 00380000
003900* INFORMATION ABOUT THE HEADER ON THE ERROR OR DETAIL REPORT.   * 00390000
004000***************************************************************** 00400000
004100     05  TR201-REC-TYP-HDR.                                       00410000
004200         10 TR201-REC-TYP-HDR-CDE      PIC X(06).                 00420000
004300            88 TR201-REC-TYP-HDR-CDE-HDR          VALUE 'HDR   '. 00430000
004400         10 TR201-HDR-SEQ-NBR          PIC X(02).                 00440000
004500            88 TR201-HDR-SEQ-NBR-01               VALUE '01'.     00450000
004600         10 TR201-HDR-3RD-PARTY-CDE    PIC X(06).                 00460000
004700            88 TR201-HDR-3RD-PARTY-CDE-EI         VALUE '      '. 00470000
004800         10 TR201-HDR-CONSOL-ENTNME    PIC X(30)  VALUE SPACE.    00480000
004900         10 TR201-HDR-CONSOL-TRNS-DTE  PIC X(08)  VALUE SPACE.    00490000
005000         10 TR201-HDR-CONSOL-TRNS-TM   PIC X(04)  VALUE SPACE.    00500000
005100         10 TR201-HDR-CONSOL-FIL-ID    PIC X(09)  VALUE SPACE.    00510000
005200         10 TR201-HDR-LOAD-DTE         PIC X(08)  VALUE SPACE.    00520000
005300         10 TR201-HDR-LOAD-TM          PIC X(04)  VALUE SPACE.    00530000
005400         10 TR201-HDR-FILLER           PIC X(33)  VALUE SPACE.    00540001
005500                                                                  00550000
005600***************************************************************** 00560000
005700* REPORT INFORMATION FOR EDD RECORDS FOR ESTIMATED TRIP.  THE   * 00570000
005800* ESTIMATED TRIP  (VESSEL, AIR, MOTOR) IS BASED ON THE DATE ON  * 00580000
005900* WHICH THE CARRIER IS EXPECTED TO DEPART.                      * 00590000
006000***************************************************************** 00600000
006100     05 TR201-REC-TYP-EDD REDEFINES TR201-REC-TYP-HDR.            00610000
006200        10 TR201-REC-TYP-EDD-CDE        PIC X(06).                00620000
006300           88 TR201-REC-TYP-EDD-CDE-EDD           VALUE 'EDD   '. 00630000
006400        10 TR201-EDD-SEQ-NBR            PIC X(02).                00640000
006500           88 TR201-EDD-SEQ-NBR-10                VALUE '10'.     00650000
006600        10 TR201-EDD-3RD-PARTY-CDE      PIC X(06).                00660000
006700           88 TR201-EDD-3RD-PARTY-CDE-EI          VALUE '      '. 00670000
006800        10 TR201-EDD-IMPRT-TRIP-ID      PIC X(10).                00680000
006900        10 TR201-EDD-CARR-SCAC-ID       PIC X(04).                00690000
007000        10 TR201-EDD-IMPRT-VEH-NM       PIC X(25).                00700000
007100        10 TR201-EDD-POE-DELY-DTE       PIC X(08).                00710000
007200        10 TR201-EDD-POE-DELY-TM        PIC X(04).                00720000
007300        10 TR201-EDD-DPRTR-DTE          PIC X(08).                00730000
007400        10 TR201-EDD-DPRTR-TM           PIC X(04).                00740000
007500        10 TR201-EDD-FOB-CDE            PIC X(05).                00750000
007600        10 TR201-EDD-DEST-POE-CDE       PIC X(04).                00760000
007700        10 TR201-EDD-TRIP-TYP-CDE       PIC X(01).                00770000
007800           88 TR201-EDD-TRIP-TYP-CDE-AIR          VALUE 'A'.      00780000
007900           88 TR201-EDD-TRIP-TYP-CDE-MOTOR        VALUE 'M'.      00790000
008000           88 TR201-EDD-TRIP-TYP-CDE-OCEAN        VALUE 'O'.      00800000
015100        10 TR201-EDD-EST-LBD-NM         PIC X(18).                00801000
015101        10 TR201-EDD-FILLER             PIC X(05).                00810001
015102*                                                                 00820000
015103***************************************************************** 00830000
015104* REPORT INFORMATION FOR EDDRSN RECORDS FOR ESTIMATED TRIP. THE * 00840000
015105* REASON THE PURCHASE ORDER NEEDED TO BE RE-BOOKED ON A         * 00850000
015106* DIFFERENT VOYAGE.                                             * 00860000
015107***************************************************************** 00870000
015108     05 TR201-REC-TYP-EDDRSN REDEFINES TR201-REC-TYP-HDR.         00880000
015109        10 TR201-REC-TYP-EDDRSN-CDE     PIC X(06).                00890000
015110           88 TR201-REC-TYP-EDDRSN-CD-EDDRSN      VALUE 'EDDRSN'. 00900000
015111        10 TR201-EDDRSN-SEQ-NBR         PIC X(02).                00910000
015112           88 TR201-EDDRSN-SEQ-NBR-11             VALUE '11'.     00920000
015113        10 TR201-EDDRSN-3RD-PARTY-CDE   PIC X(06).                00930000
015114           88 TR201-EDDRSN-3RD-PARTY-CDE-EI       VALUE '      '. 00940000
015115        10 TR201-EDDRSN-IMPRT-TRIP-ID   PIC X(10).                00950000
015116        10 TR201-EDDRSN-CARR-SCAC-ID    PIC X(04).                00960000
015117        10 TR201-EDDRSN-POE-DELY-DTE    PIC X(08).                00970000
015118        10 TR201-EDDRSN-POE-DELY-TM     PIC X(04).                00980000
015119        10 TR201-EDDRSN-DPRTR-DTE       PIC X(08).                00990000
015120        10 TR201-EDDRSN-DPRTR-TM        PIC X(04).                01000000
015121        10 TR201-EDDRSN-VOY-CHG-RSN-DESC  PIC X(30).              01010000
015122        10 TR201-EDDRSN-FILLER          PIC X(28).                01020001
015123*                                                                 01030000
015124***************************************************************** 01040000
015125* REPORT INFORMATION FOR EDL RECORDS FOR ESTIMATED DELIVERY.    * 01050000
015126***************************************************************** 01060000
015127     05 TR201-REC-TYP-EDL REDEFINES TR201-REC-TYP-HDR.            01070000
015128        10 TR201-REC-TYP-EDL-CDE        PIC X(06).                01080000
015129           88 TR201-REC-TYP-EDL-CDE-EDL           VALUE 'EDL   '. 01090000
015130        10 TR201-EDL-SEQ-NBR            PIC X(02).                01100000
015131           88 TR201-EDL-SEQ-NBR-20                VALUE '20'.     01110000
015132        10 TR201-EDL-3RD-PARTY-CDE      PIC X(06).                01120000
015133           88 TR201-EDL-3RD-PARTY-CDE-EI          VALUE '      '. 01130000
015134        10 TR201-EDL-PROD-FCTRY-NM      PIC X(35).                01140000
015135        10 TR201-EDL-C-O-PROD-CDE       PIC X(03).                01150000
015136        10 TR201-EDL-PO-CART-CNT        PIC 9(09).                01160000
015137        10 TR201-EDL-PO-CART-CNT-X REDEFINES                      01170000
015138           TR201-EDL-PO-CART-CNT        PIC X(09).                01180000
015139        10 TR201-EDL-PO-UNT-QTY         PIC 9(09).                01190000
015140        10 TR201-EDL-PO-UNT-QTY-X REDEFINES                       01200000
015141           TR201-EDL-PO-UNT-QTY         PIC X(09).                01210000
015142        10 TR201-EDL-PO-CBMT-QTY        PIC 9(07)V99.             01220000
015143        10 TR201-EDL-PO-CBMT-QTY-X REDEFINES                      01230000
015144           TR201-EDL-PO-CBMT-QTY        PIC X(09).                01240000
015145        10 TR201-EDL-PO-WT-KGRM-QTY     PIC 9(09).                01250000
015146        10 TR201-EDL-PO-WT-KGRM-QTY-X REDEFINES                   01260000
015147           TR201-EDL-PO-WT-KGRM-QTY     PIC X(09).                01270000
015148        10 TR201-EDL-CONSOL-SCAC-ID     PIC X(04).                01280000
015149        10 TR201-EDL-FILLER             PIC X(18).                01290001
015150                                                                  01300000
015151***************************************************************** 01310000
015152* REPORT INFORMATION FOR EDLVS RECORDS FOR ESTIMATED DELIVERY.  * 01320000
015153***************************************************************** 01330000
015154     05 TR201-REC-TYP-EDLVS REDEFINES TR201-REC-TYP-HDR.          01340000
015155        10 TR201-REC-TYP-EDLVS-CDE      PIC X(06).                01350000
015156           88 TR201-REC-TYP-EDLVS-CDE-EDLVS       VALUE 'EDLVS '. 01360000
015157        10 TR201-EDLVS-SEQ-NBR          PIC X(02).                01370000
015158           88 TR201-EDLVS-SEQ-NBR-21              VALUE '21'.     01380000
015159        10 TR201-EDLVS-3RD-PARTY-CDE    PIC X(06).                01390000
015160           88 TR201-EDLVS-3RD-PARTY-CDE-EI        VALUE '      '. 01400000
015161        10 TR201-EDLVS-VS-NBR           PIC X(20).                01410000
015162        10 TR201-EDLVS-VS-CART-CNT      PIC 9(09).                01420000
015163        10 TR201-EDLVS-VS-CART-CNT-X REDEFINES                    01430000
015164           TR201-EDLVS-VS-CART-CNT      PIC X(09).                01440000
015165        10 TR201-EDLVS-VS-UNT-QTY       PIC 9(09).                01450000
015166        10 TR201-EDLVS-VS-UNT-QTY-X REDEFINES                     01460000
015167           TR201-EDLVS-VS-UNT-QTY       PIC X(09).                01470000
015168        10 TR201-EDLVS-VS-CBMT-QTY      PIC 9(07)V99.             01480000
015169        10 TR201-EDLVS-VS-CBMT-QTY-X REDEFINES                    01490000
015170           TR201-EDLVS-VS-CBMT-QTY      PIC X(09).                01500000
015180        10 TR201-EDLVS-VS-WT-KGRM-QTY   PIC 9(09).                01510000
015200        10 TR201-EDLVS-VS-WT-KGRM-QTY-X REDEFINES                 01520000
015300           TR201-EDLVS-VS-WT-KGRM-QTY   PIC X(09).                01530000
015400        10 TR201-EDLVS-FILLER           PIC X(40).                01540001
015500*                                                                 01550000
015600***************************************************************** 01560000
015700* REPORT INFORMATION FOR EDLUPC RECORDS FOR ESTIMATED DELIVERY. * 01570000
015800***************************************************************** 01580000
015900     05 TR201-REC-TYP-EDLUPC REDEFINES TR201-REC-TYP-HDR.         01590000
016000        10 TR201-REC-TYP-EDLUPC-CDE     PIC X(06).                01600000
016100           88 TR201-REC-TYP-EDLUPC-CD-EDLUPC      VALUE 'EDLUPC'. 01610000
016200        10 TR201-EDLUPC-SEQ-NBR         PIC X(02).                01620000
016300           88 TR201-EDLUPC-SEQ-NBR-22             VALUE '22'.     01630000
016400        10 TR201-EDLUPC-3RD-PARTY-CDE   PIC X(06).                01640000
016500           88 TR201-EDLUPC-3RD-PARTY-CDE-EI       VALUE '      '. 01650000
016600        10 TR201-EDLUPC-VS-NBR          PIC X(20).                01660000
016700        10 TR201-EDLUPC-UPC-NBR         PIC 9(15).                01670000
016800        10 TR201-EDLUPC-UPC-NBR-X REDEFINES                       01680000
016900           TR201-EDLUPC-UPC-NBR         PIC X(15).                01690000
017000        10 TR201-EDLUPC-UPC-CART-CNT    PIC 9(09).                01700000
017100        10 TR201-EDLUPC-UPC-CART-CNT-X REDEFINES                  01710000
017200           TR201-EDLUPC-UPC-CART-CNT    PIC X(09).                01720000
017300        10 TR201-EDLUPC-UPC-UNT-QTY     PIC 9(09).                01730000
017400        10 TR201-EDLUPC-UPC-UNT-QTY-X REDEFINES                   01740000
017500           TR201-EDLUPC-UPC-UNT-QTY     PIC X(09).                01750000
017600        10 TR201-EDLUPC-UPC-CBMT-QTY    PIC 9(07)V99.             01760000
017700        10 TR201-EDLUPC-UPC-CBMT-QTY-X REDEFINES                  01770000
017800           TR201-EDLUPC-UPC-CBMT-QTY    PIC X(09).                01780000
017900        10 TR201-EDLUPC-UPC-WT-KGRM-QTY PIC 9(09).                01790000
018000        10 TR201-EDLUPC-UPC-WT-KGRM-QTY-X REDEFINES               01800000
018100           TR201-EDLUPC-UPC-WT-KGRM-QTY PIC X(09).                01810000
018200        10 TR201-EDLUPC-FILLER          PIC X(25).                01820001
