000100 01  TR271-FOB-TABLE.                                                     
000200     05  TR271-FOB-CDE                 PIC X(03)  VALUE SPACES.           
000800     05  TR271-FOB-STD-EDI-CDE         PIC X(05)  VALUE SPACES.           
000900     05  TR271-FOB-CTY-NM              PIC X(30)  VALUE SPACES.           
001000     05  TR271-FOB-CNTRY-CDE           PIC X(03)  VALUE SPACES.           
001100     05  TR271-CONSLR-SCAC             PIC X(04)  VALUE ZEROS.            
001300     05  TR271-POE-CDE                 PIC X(03)  VALUE SPACES.           
001400     05  FILLER                        PIC X(12)  VALUE SPACES.           
