000100***************************************************************** 00010000
000200*    RECORD PURPOSE: IMPORT RECEIVING DATA RECEIVED FROM THE    * 00020000
000300*                    CONSOLIDATOR.  ORIGIN IS THE LOCATION      * 00030000
000400*                    (OUTSIDE OF THE U.S.) FROM WHERE FREIGHT   * 00040000
000500*                    IS BEING SHIPPED.  THIS IS INFORMATION     * 00050000
000510*                    ABOUT THE MERCHANDISE RECEIVED BY THE      * 00051000
000520*                    CONSOLIDATOR FROM THE FACTORY.  IT ALSO    * 00052000
000530*                    CONTAINS INFORMATION CONCERNING THE OCEAN/ * 00053000
000540*                    AIR VOYAGE TO THE PORT OF ENTRY.           * 00054000
000550*    NOTE:THE RECORD COMING FROM THE CONSOLIDATOR CAN BE A MAX  * 00055000
000560*         OF 148 BYTES.  EVEN THOUGH THE RECORD LENGTH IS 150,  * 00056000
000570*         EDI USES ONE BYTE FOR THE SEGMENT END CHARACTER AND   * 00057000
000580*         ANOTHER BYTE AT THE END OF THE RECORD FOR ????.  SO   * 00058000
000590*         THIS LAYOUT WILL NEVER USE BYTES 149 AND 150 UNLESS   * 00059000
000600*         THE PROGRAMS(S) AND EDI ARE CHANGED. PLUS THE CONSOL- * 00060000
000700*         USES 147 FOR THEIR END OF RECORD BEFORE THEY WRAP THE * 00070000
000800*         THE FILE WITH EDI RCDS SO 147 CAN NOT BE USED EITHER. * 00080000
000900*    RECORD LENGTH:  300                                        * 00090001
001000*    RECORD FORMAT:  SEQUENTIAL    DATES:CCYYMMDD     TRRD015   * 00100000
001100***************************************************************** 00110000
001101* NOTE: THE RECORD LENGTH WAS INCREASED FROM 150 TO 300 BYTES   * 00110101
001102*        IN 4/2000. THIS IS SO KOHLS CAN ADD ENT-ID AND FILE-ID * 00110201
001103*        PRESENTLY, AND POSSIBLY OTHER FIELDS IN THE FUTURE     * 00110301
001110***************************************************************** 00111001
001200***************************************************************** 00120000
001300* ESTIMATED TRIP  (VESSEL, AIR, MOTOR).                         * 00130000
001400* THE DATE ON WHICH THE CARRIER IS EXPECTED TO DEPART.          * 00140000
001500* ERD AND LOG RECORD TYPES ARE SENT TOGETHER AS A SET.          * 00150000
001600***************************************************************** 00160000
001700 01  TR015-REC-TYP-ERD.                                           00170000
001800     05 TR015-ERD-REC-KEY.                                        00180000
001900        10 TR015-ERD-TRN-TYP             PIC X(01).               00190001
002000           88 TR015-ERD-TRN-TYP-ADD                VALUE 'A'.     00200000
002100           88 TR015-ERD-TRN-TYP-CHG                VALUE 'C'.     00210000
002200           88 TR015-ERD-TRN-TYP-DEL                VALUE 'D'.     00220000
002300        10 TR015-ERD-REC-TYP-CDE         PIC X(06).               00230001
002400           88 TR015-ERD-REC-TYP-CDE-ERD            VALUE 'ERD   '.00240000
002500        10 TR015-ERD-SEQ-NBR             PIC X(02).               00250001
002600           88 T0012-ERD-SEQ-NBR-25                 VALUE '25'.    00260000
002700        10 TR015-ERD-3RD-PARTY-CDE       PIC X(06).               00270001
002800           88 TR015-ERD-3RD-PARTY-CDE-EI           VALUE '      '.00280000
002900        10 TR015-ERD-PO-NBR              PIC 9(09).               00290001
003000        10 TR015-ERD-PO-NBR-X REDEFINES                           00300000
003100           TR015-ERD-PO-NBR              PIC X(09).               00310001
003200        10 TR015-ERD-EXTL-REF-NBR        PIC X(15).               00320001
003300        10 TR015-ERD-PO-RCVD-DELY-DTE    PIC X(08).               00330001
003400        10 TR015-ERD-PO-RCVD-DELY-TM     PIC X(04).               00340001
003500        10 TR015-ERD-ORGN-SHPD-FR-CDE    PIC X(03).               00350001
003600           88 TR015-ERD-ORGN-SHPD-FR-CFS           VALUE 'CFS'.   00360000
003700           88 TR015-ERD-ORGN-SHPD-FR-CY            VALUE 'CY'.    00370000
003800        10 TR015-ERD-IMPRT-TRIP-ID       PIC X(10).               00380001
003900        10 TR015-ERD-CARR-SCAC-ID        PIC X(04).               00390001
004000     05 TR015-ERD-IMPRT-VEH-NM           PIC X(25).               00400001
004100     05 TR015-ERD-POE-DELY-DTE           PIC X(08).               00410001
004200     05 TR015-ERD-POE-DELY-TM            PIC X(04).               00420001
004300     05 TR015-ERD-DPRTR-DTE              PIC X(08).               00430001
004400     05 TR015-ERD-DPRTR-TM               PIC X(04).               00440001
004500     05 TR015-ERD-FOB-CDE                PIC X(05).               00450001
004600     05 TR015-ERD-DEST-POE-CDE           PIC X(04).               00460001
004700     05 TR015-ERD-TRIP-TYP-CDE           PIC X(01).               00470001
004800        88 TR015-ERD-TRIP-TYP-CDE-AIR              VALUE 'A'.     00480000
004900        88 TR015-ERD-TRIP-TYP-CDE-MOTOR            VALUE 'M'.     00490000
005000        88 TR015-ERD-TRIP-TYP-CDE-OCEAN            VALUE 'O'.     00500000
005100     05 TR015-ERD-EST-LBD-NM             PIC X(18).               00510001
005200     05 FILLER                           PIC X(02).               00520001
005300     05 TR015-ERD-CONSOL-END             PIC X(01).               00530001
005400     05 TR015-ERD-EDI-SEG-END            PIC X(01).               00540001
005500     05 TR015-ERD-EDI                    PIC X(01).               00550001
005501     05 TR015-ERD-FILE-ID                PIC X(09).               00550101
005502     05 TR015-ERD-ENT-ID                 PIC 9(09).               00550201
005510     05 FILLER                           PIC X(132).              00551001
005600*                                                                 00560000
005700***************************************************************** 00570000
005800* ESTIMATED TRIP (VESSEL, AIR, MOTOR).                          * 00580000
005900* THE REASON THE PURCHASE ORDER NEEDED TO BE RE-BOOKED ON A     * 00590000
006000* DIFFERENT VOYAGE.  IF NOT REBOOKED AN EDDRSN RECORD WILL NOT  * 00600000
006100* BE TRANSMITTED.                                               * 00610000
006200***************************************************************** 00620000
006300 01  TR015-REC-TYP-ERDRSN REDEFINES TR015-REC-TYP-ERD.            00630000
006400     05 TR015-ERDRSN-REC-KEY.                                     00640000
006500        10 TR015-ERDRSN-TRN-TYP          PIC X(01).               00650001
006600           88 TR015-ERDRSN-TRN-TYP-ADD             VALUE 'A'.     00660000
006700           88 TR015-ERDRSN-TRN-TYP-CHG             VALUE 'C'.     00670000
006800           88 TR015-ERDRSN-TRN-TYP-DEL             VALUE 'D'.     00680000
006900        10 TR015-ERDRSN-REC-TYP-CDE      PIC X(06).               00690001
007000           88 TR015-ERDRSN-REC-TYP-CD-ERDRSN       VALUE 'EDDRSN'.00700000
007100        10 TR015-ERDRSN-SEQ-NBR          PIC X(02).               00710001
007200           88 TR015-ERDRSN-SEQ-NBR-26              VALUE '26'.    00720000
007300        10 TR015-ERDRSN-3RD-PARTY-CDE    PIC X(06).               00730001
007400           88 TR015-ERDRSN-3RD-PARTY-CDE-EI        VALUE '      '.00740000
007500        10 TR015-ERDRSN-PO-NBR           PIC 9(09).               00750000
007600        10 TR015-ERDRSN-PO-NBR-X REDEFINES                        00760000
007700           TR015-ERDRSN-PO-NBR           PIC X(09).               00770000
007800        10 TR015-ERDRSN-EXTL-REF-NBR     PIC X(15).               00780000
007900        10 TR015-ERDRSN-PO-RCVD-DELY-DTE PIC X(08).               00790000
008000        10 TR015-ERDRSN-PO-RCVD-DELY-TM  PIC X(04).               00800000
008100        10 TR015-ERDRSN-ORGN-SHPD-FR-CDE PIC X(03).               00810000
008200           88 TR015-ERDRSN-ORGN-SHPD-FR-CFS       VALUE 'CFS'.    00820000
008300           88 TR015-ERDRSN-ORGN-SHPD-FR-CY        VALUE 'CY'.     00830000
008400        10 TR015-ERDRSN-IMPRT-TRIP-ID    PIC X(10).               00840000
008500        10 TR015-ERDRSN-CARR-SCAC-ID     PIC X(04).               00850000
008600     05 TR015-ERDRSN-POE-DELY-DTE        PIC X(08).               00860000
008700     05 TR015-ERDRSN-POE-DELY-TM         PIC X(04).               00870000
008800     05 TR015-ERDRSN-DPRTR-DTE           PIC X(08).               00880000
008900     05 TR015-ERDRSN-DPRTR-TM            PIC X(04).               00890000
009000     05 TR015-ERDRSN-VOY-CHG-RSN-DESC    PIC X(30).               00900000
009100     05 FILLER                           PIC X(25).               00910000
009200     05 TR015-ERDRSN-CONSOL-END          PIC X(01).               00920000
009300     05 TR015-ERDRSN-EDI-SEG-END         PIC X(01).               00930000
009400     05 TR015-ERDRSN-EDI                 PIC X(01).               00940000
009410     05 TR015-ERDRSN-FILE-ID             PIC X(09).               00941001
009420     05 TR015-ERDRSN-ENT-ID              PIC 9(09).               00942001
009430     05 FILLER                           PIC X(132).              00943001
009500*                                                                 00950000
009600***************************************************************** 00960000
009700* FOR CARGO FORWARDERS SERVICE (CFS), THE DATE THE PURCHASE     * 00970000
009800* ORDER IS RECEIVED AT THE CONSOLIDATOR.  FOR CARRIER'S YARD(CY)* 00980000
009900* SHIPMENTS, THE DATE THE PURCHASE ORDER IS RECEIVED AT THE     * 00990000
010000* CARRIER'S YARD.  THE SEGMENT IS RESENT MULTIPLE TIMES ONCE    * 01000000
010100* WAREHOUSE QUANTITY IS SCHEDULED.  IF PART OR ALL OF FREIGHT   * 01010000
010200* IS WAREHOUSED, NEW LOG RECORDS WILL BE SENT WITH THE SAME     * 01020000
010300* RECEIPT DATE, BUT WITH DIFFERENT REFERENCE NUMBERS.           * 01030000
010400***************************************************************** 01040000
010500 01  TR015-REC-TYP-LOG REDEFINES TR015-REC-TYP-ERDRSN.            01050000
010600     05 TR015-LOG-REC-KEY.                                        01060000
010700        10 TR015-LOG-TRN-TYP             PIC X(01).               01070001
010800           88 TR015-LOG-TRN-TYP-ADD                VALUE 'A'.     01080000
010900           88 TR015-LOG-TRN-TYP-CHG                VALUE 'C'.     01090000
011000           88 TR015-LOG-TRN-TYP-DEL                VALUE 'D'.     01100000
011100        10 TR015-LOG-REC-TYP-CDE         PIC X(06).               01110001
011200           88 TR015-LOG-REC-TYP-CDE-LOG            VALUE 'LOG   '.01120000
011300        10 TR015-LOG-SEQ-NBR             PIC X(02).               01130001
011400           88 TR015-LOG-SEQ-NBR-30                 VALUE '30'.    01140000
011500        10 TR015-LOG-3RD-PARTY-CDE       PIC X(06).               01150001
011600           88 TR015-LOG-3RD-PARTY-CDE-EI           VALUE '      '.01160000
011700        10 TR015-LOG-PO-NBR              PIC 9(09).               01170001
011800        10 TR015-LOG-PO-NBR-X REDEFINES                           01180000
011900           TR015-LOG-PO-NBR              PIC X(09).               01190001
012000        10 TR015-LOG-EXTL-REF-NBR        PIC X(15).               01200001
012100        10 TR015-LOG-PO-RCVD-DELY-DTE    PIC X(08).               01210001
012200        10 TR015-LOG-PO-RCVD-DELY-TM     PIC X(04).               01220001
012300        10 TR015-LOG-ORGN-SHPD-FR-CDE    PIC X(03).               01230001
012400           88 TR015-LOG-ORGN-SHPD-FR-CFS           VALUE 'CFS'.   01240000
012500           88 TR015-LOG-ORGN-SHPD-FR-CY            VALUE 'CY'.    01250000
012600     05 TR015-LOG-PROD-FCTRY-NM          PIC X(35).               01260001
012700     05 TR015-LOG-C-O-PROD-CDE           PIC X(03).               01270001
012800     05 TR015-LOG-PO-CART-CNT            PIC 9(09).               01280001
012900     05 TR015-LOG-PO-CART-CNT-X REDEFINES                         01290000
013000        TR015-LOG-PO-CART-CNT            PIC X(09).               01300001
013100     05 TR015-LOG-PO-UNT-QTY             PIC 9(09).               01310001
013200     05 TR015-LOG-PO-UNT-QTY-X REDEFINES                          01320000
013300        TR015-LOG-PO-UNT-QTY             PIC X(09).               01330001
013400     05 TR015-LOG-PO-CBMT-QTY            PIC 9(07)V99.            01340001
013500     05 TR015-LOG-PO-CBMT-QTY-X REDEFINES                         01350000
013600        TR015-LOG-PO-CBMT-QTY            PIC X(09).               01360001
013700     05 TR015-LOG-PO-WT-KGRM-QTY         PIC 9(09).               01370001
013800     05 TR015-LOG-PO-WT-KGRM-QTY-X REDEFINES                      01380000
013900        TR015-LOG-PO-WT-KGRM-QTY         PIC X(09).               01390001
014000     05 TR015-LOG-CONSOL-SCAC-ID         PIC X(04).               01400001
014100     05 FILLER                           PIC X(15).               01410001
014200     05 TR015-LOG-CONSOL-END             PIC X(01).               01420001
014300     05 TR015-LOG-EDI-SEG-END            PIC X(01).               01430001
014400     05 TR015-LOG-EDI                    PIC X(01).               01440001
014410     05 TR015-LOG-FILE-ID                PIC X(09).               01441001
014420     05 TR015-LOG-ENT-ID                 PIC 9(09).               01442001
014430     05 FILLER                           PIC X(132).              01443001
014500*                                                                 01450000
014600***************************************************************** 01460000
014700* FOR CARGO FORWARDERS SERVICE (CFS), THE DATE THE PURCHASE     * 01470000
014800* ORDER IS RECEIVED AT THE CONSOLIDATOR.  FOR CARRIER'S YARD(CY)* 01480000
014900* SHIPMENTS, THE DATE THE PURCHASE ORDER IS RECEIVED AT THE     * 01490000
015000* CARRIER'S YARD.  VENDOR STYLES THAT WERE RECEIVED.  MULTIPLE  * 01500000
015100* SEGMENTS WILL BE SENT FOR EACH VENDOR STYLE UNDER A PO.       * 01510000
015200***************************************************************** 01520000
015300 01  TR015-REC-TYP-LOGVS REDEFINES TR015-REC-TYP-LOG.             01530000
015400     05 TR015-LOGVS-REC-KEY.                                      01540000
015500        10 TR015-LOGVS-TRN-TYP           PIC X(01).               01550001
015600           88 TR015-LOGVS-TRN-TYP-ADD              VALUE 'A'.     01560000
015700           88 TR015-LOGVS-TRN-TYP-CHG              VALUE 'C'.     01570000
015800           88 TR015-LOGVS-TRN-TYP-DEL              VALUE 'D'.     01580000
015900        10 TR015-LOGVS-REC-TYP-CDE       PIC X(06).               01590001
016000           88 TR015-LOGVS-REC-TYP-CDE-LOGVS        VALUE 'LOGVS '.01600000
016100        10 TR015-LOGVS-SEQ-NBR           PIC X(02).               01610001
016200           88 TR015-LOGVS-SEQ-NBR-31               VALUE '31'.    01620000
016300        10 TR015-LOGVS-3RD-PARTY-CDE     PIC X(06).               01630001
016400           88 TR015-LOGVS-3RD-PARTY-CDE-EI         VALUE '      '.01640000
016500        10 TR015-LOGVS-PO-NBR            PIC 9(09).               01650001
016600        10 TR015-LOGVS-PO-NBR-X REDEFINES                         01660000
016700           TR015-LOGVS-PO-NBR            PIC X(09).               01670001
016800        10 TR015-LOGVS-EXTL-REF-NBR      PIC X(15).               01680001
016900        10 TR015-LOGVS-PO-RCVD-DELY-DTE  PIC X(08).               01690001
017000        10 TR015-LOGVS-PO-RCVD-DELY-TM   PIC X(04).               01700001
017100        10 TR015-LOGVS-ORGN-SHPD-FR-CDE  PIC X(03).               01710001
017200           88 TR015-LOGVS-ORGN-SHPD-FR-CFS         VALUE 'CFS'.   01720000
017300           88 TR015-LOGVS-ORGN-SHPD-FR-CY          VALUE 'CY'.    01730000
017400     05 TR015-LOGVS-VS-NBR               PIC X(20).               01740001
017500     05 TR015-LOGVS-VS-CART-CNT          PIC 9(09).               01750001
017600     05 TR015-LOGVS-VS-CART-CNT-X REDEFINES                       01760000
017700        TR015-LOGVS-VS-CART-CNT          PIC X(09).               01770001
017800     05 TR015-LOGVS-VS-UNT-QTY           PIC 9(09).               01780001
017900     05 TR015-LOGVS-VS-UNT-QTY-X REDEFINES                        01790000
018000        TR015-LOGVS-VS-UNT-QTY           PIC X(09).               01800001
018100     05 TR015-LOGVS-VS-CBMT-QTY          PIC 9(07)V99.            01810001
018200     05 TR015-LOGVS-VS-CBMT-QTY-X REDEFINES                       01820000
018300        TR015-LOGVS-VS-CBMT-QTY          PIC X(09).               01830001
018400     05 TR015-LOGVS-VS-WT-KGRM-QTY       PIC 9(09).               01840001
018500     05 TR015-LOGVS-VS-WT-KGRM-QTY-X REDEFINES                    01850000
018600        TR015-LOGVS-VS-WT-KGRM-QTY       PIC X(09).               01860001
018700     05 FILLER                           PIC X(37).               01870001
018800     05 TR015-LOGVS-CONSOL-END           PIC X(01).               01880001
018900     05 TR015-LOGVS-EDI-SEG-END          PIC X(01).               01890001
019000     05 TR015-LOGVS-EDI                  PIC X(01).               01900001
019010     05 TR015-LOGVS-FILE-ID              PIC X(09).               01901001
019020     05 TR015-LOGVS-ENT-ID               PIC 9(09).               01902001
019030     05 FILLER                           PIC X(132).              01903001
019100*                                                                 01910000
019200***************************************************************** 01920000
019300* FOR CARGO FORWARDERS SERVICE (CFS), THE DATE THE PURCHASE     * 01930000
019400* ORDER IS RECEIVED AT THE CONSOLIDATOR.  FOR CARRIER'S YARD(CY)* 01940000
019500* SHIPMENTS, THE DATE THE PURCHASE ORDER IS RECEIVED AT THE     * 01950000
019600* CARRIER'S YARD.  VENDOR STYLE UPCS THAT WERE RECEIVED.        * 01960000
019700* MULTIPLE SEGMENTS WILL BE SENT FOR EACH UPC UNDER A VENDOR    * 01970000
019800* STYLE.                                                        * 01980000
019900***************************************************************** 01990000
020000 01  TR015-REC-TYP-LOGUPC REDEFINES TR015-REC-TYP-LOGVS.          02000000
020100     05 TR015-LOGUPC-REC-KEY.                                     02010000
020200        10 TR015-LOGUPC-TRN-TYP          PIC X(01).               02020001
020300           88 TR015-LOGUPC-TRN-TYP-ADD             VALUE 'A'.     02030000
020400           88 TR015-LOGUPC-TRN-TYP-CHG             VALUE 'C'.     02040000
020500           88 TR015-LOGUPC-TRN-TYP-DEL             VALUE 'D'.     02050000
020600        10 TR015-LOGUPC-REC-TYP-CDE      PIC X(06).               02060001
020700           88 TR015-LOGUPC-REC-TYP-CD-LOGUPC       VALUE 'LOGUPC'.02070000
020800        10 TR015-LOGUPC-SEQ-NBR          PIC X(02).               02080001
020900           88 TR015-LOGUPC-SEQ-NBR-32              VALUE '32'.    02090000
021000        10 TR015-LOGUPC-3RD-PARTY-CDE    PIC X(06).               02100001
021100           88 TR015-LOGUPC-3RD-PARTY-CDE-EI        VALUE '      '.02110000
021200        10 TR015-LOGUPC-PO-NBR           PIC 9(09).               02120000
021300        10 TR015-LOGUPC-PO-NBR-X REDEFINES                        02130000
021400           TR015-LOGUPC-PO-NBR           PIC X(09).               02140000
021500        10 TR015-LOGUPC-EXTL-REF-NBR     PIC X(15).               02150000
021600        10 TR015-LOGUPC-PO-RCVD-DELY-DTE PIC X(08).               02160000
021700        10 TR015-LOGUPC-PO-RCVD-DELY-TM  PIC X(04).               02170000
021800        10 TR015-LOGUPC-ORGN-SHPD-FR-CDE PIC X(03).               02180000
021900           88 TR015-LOGUPC-ORGN-SHPD-FR-CFS        VALUE 'CFS'.   02190000
022000           88 TR015-LOGUPC-ORGN-SHPD-FR-CY         VALUE 'CY'.    02200000
022100     05 TR015-LOGUPC-VS-NBR              PIC X(20).               02210000
022200     05 TR015-LOGUPC-UPC-NBR             PIC 9(15).               02220000
022300     05 TR015-LOGUPC-UPC-NBR-X REDEFINES                          02230000
022400        TR015-LOGUPC-UPC-NBR             PIC X(15).               02240000
022500     05 TR015-LOGUPC-UPC-CART-CNT        PIC 9(09).               02250000
022600     05 TR015-LOGUPC-UPC-CART-CNT-X REDEFINES                     02260000
022700        TR015-LOGUPC-UPC-CART-CNT        PIC X(09).               02270000
022800     05 TR015-LOGUPC-UPC-UNT-QTY         PIC 9(09).               02280000
022900     05 TR015-LOGUPC-UPC-UNT-QTY-X REDEFINES                      02290000
023000        TR015-LOGUPC-UPC-UNT-QTY         PIC X(09).               02300000
023100     05 TR015-LOGUPC-UPC-CBMT-QTY        PIC 9(07)V99.            02310000
023200     05 TR015-LOGUPC-UPC-CBMT-QTY-X REDEFINES                     02320000
023300        TR015-LOGUPC-UPC-CBMT-QTY        PIC X(09).               02330000
023400     05 TR015-LOGUPC-UPC-WT-KGRM-QTY     PIC 9(09).               02340000
023500     05 TR015-LOGUPC-UPC-WT-KGRM-QTY-X REDEFINES                  02350000
023600        TR015-LOGUPC-UPC-WT-KGRM-QTY     PIC X(09).               02360000
023700     05 FILLER                           PIC X(22).               02370000
023800     05 TR015-LOGUPC-CONSOL-END          PIC X(01).               02380000
023900     05 TR015-LOGUPC-EDI-SEG-END         PIC X(01).               02390000
024000     05 TR015-LOGUPC-EDI                 PIC X(01).               02400000
024100     05 TR015-LOGUPC-FILE-ID             PIC X(09).               02410001
024200     05 TR015-LOGUPC-ENT-ID              PIC 9(09).               02420001
024300     05 FILLER                           PIC X(132).              02430001
