       01  TR052-BOOKING-TABLE.                                                 
           05  TR052-C-O-PROD-CDE            PIC X(03)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-CONSLR-SCAC-ID          PIC X(04)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-CRE-TMST                PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-DAT-SRC-ENT-ID          PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-DEST-POE-CDE            PIC X(04)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-DPRTR-TMST              PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-EST-LBD-NM              PIC X(30)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-EST-LBD-TMST            PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-EXTL-REF-NBR            PIC X(15)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-FOB-CDE                 PIC X(05)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-IMPRT-VEH-NM            PIC X(25)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-LAST-UPD-TMST           PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-ORGN-SHPD-FR-CDE        PIC X(03)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-PO-BKG-DELY-TMST        PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-PO-CART-CNT             PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-PO-CBMT-QTY             PIC 9(09)V99 VALUE ZERO.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-PO-NBR                  PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-PO-UNT-QTY              PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-PO-WT-KGRM-QTY          PIC 9(09)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-PROD-FCTRY-NM           PIC X(35)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-TRIP-TYP-CDE            PIC X(01)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR052-TIMESTAMP               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(30)  VALUE SPACES.           
