       01  TR045-SEAL-TABLE.                                                    
           05  TR045-CONTNR-ID               PIC X(12)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR045-CONTNR-SEQ-NBR          PIC 9(06)  VALUE ZERO.             
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR045-CRE-TMST                PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR045-LAST-UPD-TMST           PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR045-SEAL-NBR                PIC X(15)  VALUE SPACES.           
           05  FILLER                        PIC X(01)  VALUE '|'.              
           05  TR045-TIMESTAMP               PIC X(26)  VALUE SPACES.           
           05  FILLER                        PIC X(30)  VALUE SPACES.           
