000100***************************************************************** 00010000
000200*    COPYBOOK NAME:  TRRD068                                    * 00020000
000300*    RECORD PURPOSE: THIS RECORD LAYOUT IS THE LAYOUT FOR THE   * 00030000
000400*                    "NOPRO" SHIPMENTS CREATED BY TRKUT087      * 00040000
000410*                    USED TO UPDATE SHIPMENTS IN TRKUP087       * 00041000
000500*    RECORD LENGTH:  200                                        * 00050000
000600*    RECORD FORMAT:  SEQUENTIAL                                 * 00060000
000700***************************************************************** 00070000
000800                                                                  00080000
000900 01  TR068-DATA-RECORD.                                           00090000
001410     05  TR068-SHIPT-ID                   PIC  S9(9) COMP.        00141000
001420     05  TR068-TRIP-ID                    PIC  S9(9) COMP.        00142000
001430     05  TR068-PRO-NBR                    PIC   X(22).            00143000
001440     05  TR068-ORD-NBR                    PIC  S9(9) COMP.        00144000
001450     05  TR068-RCVR-SEQ-NBR               PIC  S9(9) COMP.        00145000
001460     05  TR068-OPER-UNT-ID                PIC  S9(4) COMP.        00146000
001470     05  TR068-PRCG-STAT-CDE              PIC   X(1).             00147000
001480     05  TR068-TRIP-STATUS-CDE            PIC   X(2).             00148000
001490     05  TR068-STATUS-DTE                 PIC   X(10).            00149000
001491     05  TR068-STATUS-TME                 PIC   X(8).             00149100
001500     05  FILLER                           PIC  X(139).            00150000
