00001 ******************************************************************02/20/93
00002 **                        TRWS197                               **DPWS056 
00003 **                                                              **   LV009
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR SEAL      **   CL**5
00005 **  NUMBER TRACKING MAINTENANCE.                                **   CL**2
00006 **  LENGTH:  200 BYTES                                          **DPWS056 
00007 ******************************************************************DPWS056 
00008          10  TR197-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00009              INTER-APPL-COMM-AREA.                                DPWS056 
00010              15  FILLER                         PIC X(01).           CL**3
00011              15  TR197-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
00012                                                     COMP-3.       DPWS056 
00013              15  TR197-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
00014                                                     COMP-3.          CL**8
00015              15  TR197-SEL-QUEUE-NAME           PIC X(8).            CL**8
00015              15  TR197-SEAL-NBR                 PIC X(15).           CL**8
                   15  FILLER                         PIC X(156).          CL**9
