00001 ******************************************************************10/06/95
00002 **                        TRWS013                               **TRWS013 
00003 **                                                              **   LV001
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR THE       **TRWS013 
00005 **  TRAFFIC FREIGHT BILL CRITERIA SPECIFICATION                 **TRWS013 
00006 **                                                              **TRWS013 
00007 **  LENGTH:  200 BYTES                                          **TRWS013 
00008 ******************************************************************TRWS013 
00009          10  TR013-INTER-APPL-COMMAREA  REDEFINES                 TRWS013 
00010              INTER-APPL-COMM-AREA.                                TRWS013 
00011              15  FILLER                         PIC X(01).        TRWS013 
00012              15  TR013-PO-NBR                   PIC S9(09) COMP.  TRWS013 
00013              15  TR013-ARRIVAL-DTE-BEG          PIC X(10).        TRWS013 
00014              15  TR013-ARRIVAL-DTE-END          PIC X(10).        TRWS013 
00015              15  TR013-OWNER-SCAC-ID            PIC X(04).        TRWS013 
00016              15  TR013-PRO-NBR                  PIC X(22).        TRWS013 
00017              15  TR013-PRINTER-ID               PIC X(08).        TRWS013 
00018              15  FILLER                         PIC X(141).       TRWS013 
