000100*----------------------------------------------------------------*02/17/93
000200*                         TRWS021                                *TRWS021 
000300*                                                                *        
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *TRWS021 
000500*   MAINTENANCE PROGRAMS TO PASS THE FOB INFORMATION.            *TRWS021 
000600*                                                                *TRWS021 
000700*----------------------------------------------------------------*TRWS021 
000800                                                                  TRWS021 
000900 01  TR021-FOB-SEL-REC.                                                   
001000       05  TR021-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
001100                                                    VALUE ZERO.      CL**2
001200       05  TR021-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
001300       05  TR021-SELECTED-ITEM-ARRAY.                                CL**6
001400           10  FILLER                   OCCURS 20 TIMES              CL**6
001500                                        INDEXED BY TR021-IDX.        CL**2
001600               15  TR021-ITEM           PIC S9(09)  COMP-3.          CL**7
001700               15  TR021-ACTION-SW      PIC  X(01).                  CL**6
001800                   88  TR021-INQ                    VALUE 'I'.       CL**6
001900                   88  TR021-UPD                    VALUE 'U'.       CL**6
002000                   88  TR021-DEL                    VALUE 'D'.       CL**6
002100                   88  TR021-ERR                    VALUE 'E'.       CL**6
002200               15  TR021-KEY-DATA.                                   CL**6
002300                   20  TR021-ACTION            PIC  X(03).                
028000                   20  TR021-FOB-CODE          PIC  X(03).                
028300                   20  TR021-FOB-CNTRY-CODE    PIC  X(03).                
028301                   20  TR021-FOB-CNTRY-NAME    PIC  X(12).                
028310                   20  TR021-FOB-CITY-NAME     PIC  X(25).                
028400                   20  TR021-CONSLR-SCAC       PIC  X(04).                
028410                   20  TR021-CONSLR-ENT-ID     PIC S9(9).                 
028500                   20  TR021-CSTM-BKR-SCAC     PIC  X(04).                
028510                   20  TR021-CSTM-BKR-ENT-ID   PIC S9(9).                 
028600                   20  TR021-POE-CODE          PIC  X(03).                
028610                   20  TR021-FOB-STD-EDI-CDE   PIC  X(05).                
028400                   20  TR021-DECONL-SCAC       PIC  X(04).                
028410                   20  TR021-DECONL-ENT-ID     PIC S9(9).                 
028410                   20  TR021-INCOTERM-CODE     PIC  X(03).                
