00001 *----------------------------------------------------------------*06/09/93
00002 *                         TRWS004                                *TRWS004 
00003 *                                                                *   LV005
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE TRAFFIC FREIGHT   *   CL**2
00005 *   BILL LIST PROGRAM TO PASS THE KEYS.                          *   CL**2
00006 *                                                                *TRWS004 
00007 *----------------------------------------------------------------*TRWS004 
00008                                                                   TRWS004 
00009  01  TR004-TS-SEL-REC.                                            TRWS004 
00010        05  TR004-SELECTED-ITEMS       PIC S9(05)  COMP-3          TRWS004 
00011                                                   VALUE ZERO.     TRWS004 
00012        05  TR004-MAX-ITEMS            PIC  9(02)  VALUE 20.       TRWS004 
00013        05  TR004-SELECTED-ITEM-ARRAY.                             TRWS004 
00014            10  FILLER                 OCCURS 20 TIMES             TRWS004 
00015                                       INDEXED BY TR004-IDX.       TRWS004 
00016                15  TR004-ITEM         PIC S9(09)  COMP-3.         TRWS004 
00017                15  TR004-ACTION-SW    PIC  X(01).                 TRWS004 
00018                    88  TR004-INQ                  VALUE 'I'.      TRWS004 
00019                    88  TR004-UPD                  VALUE 'U'.      TRWS004 
00020                    88  TR004-DEL                  VALUE 'D'.      TRWS004 
00021                    88  TR004-ERR                  VALUE 'E'.      TRWS004 
00022                15  TR004-KEY-DATA.                                TRWS004 
00023                    20  TR004-PRO-NBR  PIC X(16).                     CL**5
00024                    20  TR004-SCAC-CDE PIC X(04).                  TRWS004 
