00001 ******************************************************************04/05/93
00002 **                        TRWS107                               **ADWS001 
00003 **                                                              **   LV011
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **ADWS001 
00005 **  PO TRACKING SAILING LIST.                                   **ADWS001 
00006 **  LENGTH:  200 BYTES                                          **ADWS001 
00007 ******************************************************************ADWS001 
00008          10  TR109-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00009              INTER-APPL-COMM-AREA.                                DPWS056 
00010              15  FILLER                         PIC X(01).           CL**3
00011              15  TR109-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
00012                                                     COMP-3.       DPWS056 
00013              15  TR109-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
00014                                                     COMP-3.          CL**8
00015              15  TR109-SEL-QUEUE-NAME           PIC X(8).            CL**8
00015              15  TR109-PO-NBR                   PIC S9(09) COMP.     CL**8
00015              15  TR109-TRIP-ID                  PIC S9(09) COMP.     CL**8
00015              15  TR109-OWNER-SCAC-ID            PIC X(04).           CL**8
00015              15  TR109-VEH-NBR                  PIC X(10).           CL**8
00015              15  TR109-OPER-UNT-ID              PIC S9(4)  COMP.     CL**8
00015              15  TR109-FCLTY-ID                 PIC S9(4)  COMP.     CL**8
00016              15  FILLER                         PIC X(157).          CL**9
