000100******************************************************************        
000200**                        TRWS117                               **        
000300**                                                              **        
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR BOOKING   **        
000500**  PO AND RECEIVING PO HISTORY                                 **        
000600**  LENGTH:  200 BYTES                                          **        
000700******************************************************************        
000800         10  TR117-INTER-APPL-COMMAREA  REDEFINES                         
000900             INTER-APPL-COMM-AREA.                                        
001000             15  FILLER                         PIC X(01).                
001100             15  TR117-NUMBER-OF-SELECTED-ITEMS PIC S9(09)                
001200                                                    COMP-3.               
001300             15  TR117-NUMBER-OF-TS-ITEMS       PIC S9(05)                
001400                                                    COMP-3.               
001500             15  TR117-SEL-QUEUE-NAME           PIC X(8).                 
001800             15  TR117-PO-NBR                   PIC S9(09) COMP.          
001801             15  TR117-PO-SEQ-NBR               PIC S9(09) COMP.          
001802             15  TR117-DELY-DTE                 PIC X(10).                
001803             15  TR117-ORGN-SHPD-FR-TYP         PIC X(03).                
