000100*----------------------------------------------------------------*        
000400* THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE   *        
000500* FOR TEMP STORAGE.                                              *        
000800*----------------------------------------------------------------*        
001000 01  TR325-TEMP-SEL-AREA.                                                 
001100     05  TR325-SELECTED-ITEMS         PIC S9(05)  COMP-3                  
001200                                                    VALUE ZERO.           
001300     05  TR325-MAX-ITEMS              PIC  9(02)  VALUE 20.               
001400     05  TR325-SELECTED-ITEM-ARRAY.                                       
001500        10  FILLER                   OCCURS 20 TIMES                      
001600                                        INDEXED BY TR322-IDX.             
001800         15  TR325-LIST-ITEM-NUMBER     PIC S9(09)  COMP-3.               
001810         15  TR325-ACTION-SW      PIC  X(01).                             
001820             88  TR325-INQ                    VALUE 'I'.                  
001830             88  TR325-UPD                    VALUE 'U'.                  
001840             88  TR325-DEL                    VALUE 'D'.                  
001850             88  TR325-ERR                    VALUE 'E'.                  
002400         15  TR325-VESSEL               PIC  X(10).                       
002600         15  TR325-CONTNR-ID            PIC  X(12).                       
002700         15  TR325-CONTNR-SEQ-NBR       PIC  9(06).                       
002710* EXPANDED THE PO FIELE FROM 7 TO 9 AS PART OF PO EXTN                    
002710         15  TR325-PO-NBR               PIC  9(09).                       
002800         15  TR325-ETA-DATE             PIC  X(10).                       
003500         15  TR325-DECNSL-SCAC          PIC  X(04).                       
003510         15  TR325-MESSAGE              PIC  X(05).                       
003520         15  TR325-RUL-ID-DEFLT         PIC  S9(9)                        
003530                                              COMP.                       
003540         15  TR325-RUL-ID-USED          PIC  S9(9)                        
003550                                              COMP.                       
003560         15  TR325-RUL-CDE-USED         PIC  X(04).                       
003570         15  TR325-RUL-TYP-CDE-USED     PIC  X(03).                       
