00001 ******************************************************************04/05/93
00002 **                        TRWS186                               **ADWS001 
00003 **                                                              **   LV011
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **ADWS001 
00005 **  CONTAINER CRITERIA SPECIFICATION.                           **ADWS001 
00006 **  LENGTH:  200 BYTES                                          **ADWS001 
00007 ******************************************************************ADWS001 
00008          10  TR186-INTER-APPL-COMMAREA  REDEFINES                 ADWS001 
00009              INTER-APPL-COMM-AREA.                                ADWS001 
00010              15  FILLER                         PIC  X(01).          CL**6
00011              15  TR186-CONTNR-NO                PIC  X(12).          CL**6
00014              15  FILLER                         PIC  X(187).         CL*10
