00001 ******************************************************************04/05/93
00002 **                        TRWS105                               **ADWS001 
00003 **                                                              **   LV011
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM THE      **ADWS001 
00005 **  PO TRACKING CRIT SPEC AND SUMMARY.                          **ADWS001 
00006 **  LENGTH:  200 BYTES                                          **ADWS001 
00007 ******************************************************************ADWS001 
00008          10  TR105-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00009              INTER-APPL-COMM-AREA.                                DPWS056 
00010              15  FILLER                         PIC X(01).           CL**3
00015              15  TR105-PO-NBR                   PIC S9(09) COMP.     CL**8
00016              15  FILLER                         PIC X(195).          CL**9
