00001 *    THIS IS THE CODE NEEDED TO CALL THIS PARAGRAPH:              03/14/94
00002 *            MOVE (SIX-BYTE-WS-FIELD)    TO PV-ALPHA-6            TRWS012 
00003 *            PERFORM 3080-RIGHT-JUSTIFY                              LV001
00004 *            MOVE PV-ALPHA-6 TO (SIX-BYTE-WS-FIELD)               TRWS012 
00005 /                                                                 TRWS012 
00006 *----------------------------------------------------------------*TRWS012 
00007 *  RIGHT JUSTIFY A 6 BYTE ALPHA FIELD                            *TRWS012 
00008 *----------------------------------------------------------------*TRWS012 
00009                                                                   TRWS012 
00010  3080-RIGHT-JUSTIFY.                                              TRWS012 
00011                                                                   TRWS012 
00012      UNSTRING PV-ALPHA-6                                          TRWS012 
00013          DELIMITED BY SPACES                                      TRWS012 
00014          INTO PV-ALPHA-6-AFTER COUNT IN COUNTR.                   TRWS012 
00015      MOVE SPACES           TO PV-ALPHA-6-AFTER.                   TRWS012 
00016      IF COUNTR = 6 OR 0                                           TRWS012 
00017          MOVE PV-ALPHA-1-6 TO PV-ALPHA-AFTER-1-6                  TRWS012 
00018      ELSE                                                         TRWS012 
00019      IF COUNTR = 5                                                TRWS012 
00020          MOVE PV-ALPHA-1-5 TO PV-ALPHA-AFTER-1-5                  TRWS012 
00021      ELSE                                                         TRWS012 
00022      IF COUNTR = 4                                                TRWS012 
00023          MOVE PV-ALPHA-1-4 TO PV-ALPHA-AFTER-1-4                  TRWS012 
00024      ELSE                                                         TRWS012 
00025      IF COUNTR = 3                                                TRWS012 
00026          MOVE PV-ALPHA-1-3 TO PV-ALPHA-AFTER-1-3                  TRWS012 
00027      ELSE                                                         TRWS012 
00028      IF COUNTR = 2                                                TRWS012 
00029          MOVE PV-ALPHA-1-2 TO PV-ALPHA-AFTER-1-2                  TRWS012 
00030      ELSE                                                         TRWS012 
00031      IF COUNTR = 1                                                TRWS012 
00032          MOVE PV-ALPHA-1-1 TO PV-ALPHA-AFTER-1-1.                 TRWS012 
00033      MOVE PV-ALPHA-6-AFTER TO PV-ALPHA-6.                         TRWS012 
