00001 ******************************************************************04/26/95
00002 **                        TRWS017                               **TRWS017 
00003 **                                                              **   LV005
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR TRAFFIC   **TRWS017 
00005 **  FREIGHT BILL RECEIVER SYSTEM                                **TRWS017 
00006 **  LENGTH:  200 BYTES                                          **TRWS017 
00007 ******************************************************************TRWS017 
00008          10  TR017-INTER-APPL-COMMAREA  REDEFINES                 TRWS017 
00009              INTER-APPL-COMM-AREA.                                TRWS017 
00010              15  FILLER                         PIC X(01).        TRWS017 
00011              15  TR017-NUMBER-OF-SELECTED-ITEMS PIC S9(09)        TRWS017 
00012                                                     COMP-3.       TRWS017 
00013              15  TR017-NUMBER-OF-TS-ITEMS       PIC S9(05)        TRWS017 
00014                                                     COMP-3.       TRWS017 
00015              15  TR017-SEL-QUEUE-NAME           PIC X(8).         TRWS017 
00016              15  TR017-OPER-UNIT                PIC  9(04).          CL**3
00017              15  TR017-FCLTY-ID                 PIC  9(04).          CL**3
00018              15  TR017-FCLTY-NME                PIC  X(25).          CL**5
00019              15  TR017-SHIPT-ID                 PIC S9(09) COMP.     CL**3
00020              15  TR017-PRO-NBR                  PIC  X(22).          CL**5
00021              15  TR017-BOL-NBR                  PIC  X(30).          CL**5
00022              15  FILLER                         PIC  X(94).          CL**5
