00001 *----------------------------------------------------------------*02/17/93
00002 *                         TRWS106                                *DPWS057 
00003 *                                                                *   LV007
00004 * THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE   *DPWS057 
00005 * MAINTENANCE PROGRAMS TO PASS THE PO NUMBER                     *DPWS057 
00006 *                                                                *DPWS057 
00007 *----------------------------------------------------------------*DPWS057 
00008                                                                   DPWS057 
00009  01  TR106-PO-SEL-REC.                                               CL**4
00010        05  TR106-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
00011                                                     VALUE ZERO.      CL**2
00012        05  TR106-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
00013        05  TR106-SELECTED-ITEM-ARRAY.                                CL**6
00014            10  FILLER                   OCCURS 20 TIMES              CL**6
00015                                         INDEXED BY TR106-IDX.        CL**2
00016                15  TR106-ITEM           PIC S9(09)  COMP-3.          CL**7
00017                15  TR106-ACTION-SW      PIC  X(01).                  CL**6
00018                    88  TR106-INQ                    VALUE 'I'.       CL**6
00019                    88  TR106-UPD                    VALUE 'U'.       CL**6
00020                    88  TR106-DEL                    VALUE 'D'.       CL**6
00021                    88  TR106-ERR                    VALUE 'E'.       CL**6
00022                15  TR106-KEY-DATA.                                   CL**6
00023                    20  TR106-PO-NBR     PIC S9(09) COMP.             CL**6
00023                    20  TR106-VSL-NAME   PIC  X(20).                  CL**6
00023                    20  TR106-VOY-NO     PIC  X(10).                  CL**6
