000100******************************************************************        
000200**                        TRWS183                               **        
000300**                                                              **        
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR CONTAINER **        
000500**  MANIFEST PO PACK DETAIL.                                    **        
000600**  LENGTH:  200 BYTES                                          **        
000700******************************************************************        
000800         10  TR183-INTER-APPL-COMMAREA  REDEFINES                         
000900             INTER-APPL-COMM-AREA.                                        
001000             15  FILLER                         PIC X(01).                
001100             15  TR183-NUMBER-OF-SELECTED-ITEMS PIC S9(09)                
001200                                                    COMP-3.               
001300             15  TR183-NUMBER-OF-TS-ITEMS       PIC S9(05)                
001400                                                    COMP-3.               
001500             15  TR183-SEL-QUEUE-NAME           PIC X(8).                 
001600             15  TR183-CONTNR-NO                PIC X(12).                
001700             15  TR183-CONTNR-SEQ-NO            PIC S9(04) COMP.          
001800             15  TR183-PO-NBR                   PIC S9(09) COMP.          
001811             15  TR183-PKGING-TYP               PIC X(01).                
001813             15  TR183-PACK-CTNS                PIC 9(05).                
001814             15  TR183-PACK-UNITS               PIC 9(09).                
001815             15  TR183-PACK-SKU                 PIC S9(08).               
001816             15  TR183-PACK-UPC                 PIC S9(15)V               
001817                                                    COMP-3.               
001818             15  TR183-PO-PREPK-ID              PIC S9(04) COMP.          
001819             15  TR183-PK-SKU-NBR               PIC S9(08)V               
001820                                                    COMP-3.               
001830             15  TR183-PREPK-DESC               PIC X(40).                
001840             15  TR183-ASN-PKGNG-CDE            PIC X(02).                
002000             15  FILLER                         PIC X(85).                
