00001 ******************************************************************02/20/93
00002 **                        TRWS194                               **DPWS056 
00003 **                                                              **   LV009
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR CARTON    **   CL**5
00005 **  SSCC NUMBER TRACKING MAINTENANCE.                           **   CL**2
00006 **  LENGTH:  200 BYTES                                          **DPWS056 
00007 ******************************************************************DPWS056 
00008          10  TR194-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00009              INTER-APPL-COMM-AREA.                                DPWS056 
00010              15  FILLER                         PIC X(01).           CL**3
00011              15  TR194-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
00012                                                     COMP-3.       DPWS056 
00013              15  TR194-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
00014                                                     COMP-3.          CL**8
00015              15  TR194-SEL-QUEUE-NAME           PIC X(8).            CL**8
00015              15  TR194-CONTNR-NO                PIC X(12).           CL**8
                   15  TR194-CONTNR-SEQ-NO            PIC S9(04) COMP.          
00015              15  TR194-PO-NBR                   PIC S9(09) COMP.     CL**8
                   15  TR194-UPC-NO                   PIC S9(15)V               
                                                                 COMP-3.        
                   15  TR194-SKU-NO                   PIC S9(08).               
                   15  TR194-PKGING-TYP               PIC X(01).                
                   15  TR194-PO-PREPK-ID              PIC S9(04).               
                   15  TR194-COLOR                    PIC X(10).                
                   15  TR194-SIZE                     PIC X(10).                
                   15  TR194-CTNS                     PIC 9(05).                
                   15  TR194-UNITS                    PIC 9(09).                
                   15  TR194-VS-NBR                   PIC X(20).                
                   15  FILLER                         PIC X(90).           CL**9
