00001 ******************************************************************03/16/94
00002 **                        TRWS007                               **TRWS007 
00003 **                                                              **   LV002
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR TRAFFIC   **TRWS007 
00005 **  DOCK SCHEDULING.                                            **TRWS007 
00006 **  LENGTH:  200 BYTES                                          **TRWS007 
00007 ******************************************************************TRWS007 
00008          10  TR007-INTER-APPL-COMMAREA  REDEFINES                 TRWS007 
00009              INTER-APPL-COMM-AREA.                                TRWS007 
00010              15  FILLER                         PIC X(01).        TRWS007 
00011              15  TR007-NUMBER-OF-SELECTED-ITEMS PIC S9(09)        TRWS007 
00012                                                     COMP-3.       TRWS007 
00013              15  TR007-NUMBER-OF-TS-ITEMS       PIC S9(05)        TRWS007 
00014                                                     COMP-3.       TRWS007 
00015              15  TR007-SEL-QUEUE-NAME           PIC X(8).         TRWS007 
00016              15  TR007-OPER-UNT-ID              PIC S9(04) COMP.  TRWS007 
00017              15  TR007-FCLTY-ID                 PIC S9(04) COMP.  TRWS007 
00018              15  TR007-OWNER-SCAC-ID            PIC X(04).        TRWS007 
00019              15  TR007-VEH-NBR                  PIC X(10).        TRWS007 
00020              15  TR007-MANIFEST-NBR             PIC X(15).        TRWS007 
00021              15  TR007-TRIP-ID                  PIC S9(09) COMP.     CL**2
00022              15  FILLER                         PIC X(145).          CL**2
