00001 ******************************************************************12/17/93
00002 *    INTER-APPLICATION COMMUNICATION AREA FOR :                   TRWS008 
00003 *    TRKCS113 - PARKING SPACE LIST                                   LV001
00004 *    LENGTH = 200 BYTES                                           TRWS008 
00005 ******************************************************************TRWS008 
00006          10  TR008-INTER-APPL-COMMAREA  REDEFINES                 TRWS008 
00007                                         INTER-APPL-COMM-AREA.     TRWS008 
00008              15  FILLER                    PIC X.                 TRWS008 
00009              15  TR008-YARD                PIC X(06).             TRWS008 
00010              15  TR008-SPACE               PIC X(06).             TRWS008 
