000100******************************************************************        
000200**                        TRWS114                               **        
000300**                                                              **        
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR IMPORTS   **        
000500**  CUSTOMS INQUIRY.                                            **        
000600**  LENGTH:  200 BYTES                                          **        
000700******************************************************************        
000800         10  TR114-INTER-APPL-COMMAREA  REDEFINES                         
000900             INTER-APPL-COMM-AREA.                                        
001000             15  FILLER                         PIC X(01).                
001010             15  TR114-NUMBER-OF-SELECTED-ITEMS                           
001020                                                PIC S9(09) COMP-3.        
001100             15  TR114-NUMBER-OF-TS-ITEMS       PIC S9(05)                
001110                                                    COMP-3.               
001200             15  TR114-SEL-QUEUE-NAME           PIC X(08).                
001300             15  TR114-CSTM-ENTRY-ID            PIC X(12).                
001400             15  TR114-CONTNR-ID                PIC X(12).                
001510             15  TR114-PO-NBR                   PIC 9(09).                
001600             15  TR114-HSE-BOL-NBR              PIC X(30).                
001700             15  TR114-MSTR-BOL-NBR             PIC X(30).                
001800             15  TR114-ENT-ID                   PIC S9(09) COMP.          
