00001 *----------------------------------------------------------------*02/17/93
00002 *                         TRWS159                                *DPWS057 
00003 *                                                                *   LV007
00004 * THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE   *DPWS057 
00005 * MAINTENANCE PROGRAMS TO PASS THE POL/POR INFO.                 *DPWS057 
00006 *                                                                *DPWS057 
00007 *----------------------------------------------------------------*DPWS057 
00008                                                                   DPWS057 
00009  01  TR159-ORGN-CDE-SEL-REC.                                         CL**4
00010        05  TR159-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
00011                                                     VALUE ZERO.      CL**2
00012        05  TR159-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
00013        05  TR159-SELECTED-ITEM-ARRAY.                                CL**6
00014            10  FILLER                   OCCURS 20 TIMES              CL**6
00015                                         INDEXED BY TR159-IDX.        CL**2
00016                15  TR159-ITEM           PIC S9(09)  COMP-3.          CL**7
00017                15  TR159-ACTION-SW      PIC  X(01).                  CL**6
00018                    88  TR159-INQ                    VALUE 'I'.       CL**6
00019                    88  TR159-UPD                    VALUE 'U'.       CL**6
00020                    88  TR159-DEL                    VALUE 'D'.       CL**6
00021                    88  TR159-ERR                    VALUE 'E'.       CL**6
00022                15  TR159-KEY-DATA.                                   CL**6
00023                    20  TR159-CNTRY-CDE  PIC  X(03).                  CL**6
00023                    20  TR159-CNTRY-DES  PIC  X(12).                  CL**6
00023                    20  TR159-ORGN-CDE   PIC  X(03).                  CL**6
00023                    20  TR159-ORGN-TYP   PIC  X(03).                  CL**6
00023                    20  TR159-CTY-NME    PIC  X(25).                  CL**6
00023                    20  TR159-EDI-CDE    PIC  X(05).                  CL**6
