000100*----------------------------------------------------------------*        
000200*                         TRWS023                                *        
000300*                                                                *        
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE *        
000500*   MAINTENANCE PROGRAMS TO PASS THE POE INFORMATION.            *        
000600*                                                                *        
000700*----------------------------------------------------------------*        
000800                                                                          
000900 01  TR023-POE-SEL-REC.                                                   
001000       05  TR023-SELECTED-ITEMS         PIC S9(05)  COMP-3                
001100                                                    VALUE ZERO.           
001200       05  TR023-MAX-ITEMS              PIC  9(02)  VALUE 20.             
001300       05  TR023-SELECTED-ITEM-ARRAY.                                     
001400           10  FILLER                   OCCURS 20 TIMES                   
001500                                        INDEXED BY TR023-IDX.             
001600               15  TR023-ITEM           PIC S9(09)  COMP-3.               
001700               15  TR023-ACTION-SW      PIC  X(01).                       
001800                   88  TR023-INQ                    VALUE 'I'.            
001900                   88  TR023-UPD                    VALUE 'U'.            
002000                   88  TR023-DEL                    VALUE 'D'.            
002100                   88  TR023-ERR                    VALUE 'E'.            
002200               15  TR023-KEY-DATA.                                        
002300                   20  TR023-ACTION            PIC  X(03).                
002400                   20  TR023-POE-CODE          PIC  X(03).                
002410                   20  TR023-POE-NAME          PIC  X(30).                
002500                   20  TR023-POE-CITY-NAME     PIC  X(30).                
002600                   20  TR023-POE-STATE-CODE    PIC  X(02).                
028400                   20  TR023-DCONSLR-SCAC      PIC  X(04).                
028410                   20  TR023-DCONSLR-ENT-ID    PIC  S9(9).                
028610                   20  TR023-POE-STD-EDI-CDE   PIC  X(04).                
028620                   20  TR023-ALLOWED-ON-PO     PIC  X(01).                
028630                   20  TR023-TRIP-TYP-CDE      PIC  X(01).                
028640                   20  TR023-IATA-CDE          PIC  X(03).                
