000100******************************************************************        
000200*                         TRWS157                                *        
001200*   LENGTH:  200  BYTES                                          *        
001300******************************************************************        
001400         10  TR157-INTER-APPL-COMMAREA  REDEFINES                         
001500                 INTER-APPL-COMM-AREA.                                    
001600             15  FILLER                         PIC X(01).                
001810             15  TR157-IMPRT-ORGN-CDE           PIC X(03).                
001810             15  TR157-IMPRT-ORGN-TYP-CDE       PIC X(03).                
                   15  TR157-CNTRY-CDE                PIC X(03).                
028501             15  TR157-STD-EDI-CDE              PIC X(05).                
001900             15  TR157-CTY-NM                   PIC X(25).                
028519             15  TR157-STAT-CDE                 PIC X(01).                
028506*                                                                         
028507             15  TR157-NUMBER-OF-SELECTED-ITEMS PIC S9(09)                
028508                                                    COMP-3.               
028509             15  TR157-NUMBER-OF-TS-ITEMS       PIC S9(05)                
028510                                                    COMP-3.               
028511             15  TR157-SEL-QUEUE-NAME           PIC X(08).                
028512             15  TR157-QUEUE-LENGTH             PIC S9(04)                
028513                                                    COMP.                 
028514             15  TR157-LIST-ITEM-NUMBER         PIC S9(09)                
028515                                                    COMP-3.               
028516             15  TR157-RECORD-UPDATED-SW        PIC X(01).                
028517                 88  TR157-RECORD-UPDATED       VALUE 'Y'.                
028518                 88  TR157-RECORD-NOT-UPDATED   VALUE 'N'.                
001600             15  FILLER                         PIC X(135).               
