000100******************************************************************02/20/93
000200**                        TRWS113                               **DPWS056 
000300**                                                              **   LV009
000400**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR CONTAINER **   CL**5
000500**  TRACKING MAINTENANCE.                                       **   CL**2
000600**  LENGTH:  200 BYTES                                          **DPWS056 
000700******************************************************************DPWS056 
000800         10  TR113-INTER-APPL-COMMAREA  REDEFINES                    CL**2
000900             INTER-APPL-COMM-AREA.                                DPWS056 
001000             15  FILLER                         PIC X(01).           CL**3
001100             15  TR113-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
001200                                                    COMP-3.       DPWS056 
001300             15  TR113-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
001400                                                    COMP-3.          CL**8
001500             15  TR113-SEL-QUEUE-NAME           PIC X(8).            CL**8
001800             15  TR113-PO-NBR                   PIC S9(09) COMP.     CL**8
001900             15  FILLER                         PIC X(179).          CL**9
