00001 ******************************************************************04/18/94
00002 **                        TRWS014                               **TRWS014 
00003 **                                                              **   LV002
00004 **  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FOR TRAFFIC   **TRWS014 
00005 **  FREIGHT BILL RECEIVER SYSTEM                                **TRWS014 
00006 **  LENGTH:  200 BYTES                                          **TRWS014 
00007 ******************************************************************TRWS014 
00008          10  TR014-INTER-APPL-COMMAREA  REDEFINES                    CL**2
00009              INTER-APPL-COMM-AREA.                                TRWS014 
00010              15  FILLER                         PIC X(01).        TRWS014 
00011              15  TR014-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
00012                                                     COMP-3.       TRWS014 
00013              15  TR014-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**2
00014                                                     COMP-3.       TRWS014 
00015              15  TR014-SEL-QUEUE-NAME           PIC X(8).            CL**2
00016              15  FILLER                         PIC X(183).       TRWS014 
