000100*----------------------------------------------------------------         
000200*                         TRWS112                                         
000300*                                                                         
000400* THIS IS TS QUEUE RECORD LAYOUT USED IN THE CICS ARCHITECTURE            
000500* MAINTENANCE PROGRAMS TO PASS THE CUSTOMS ENTRY ID                       
000600*                                                                         
000700*----------------------------------------------------------------         
000800                                                                          
000900 01  TR112-PO-SELECT-RECORD.                                              
001100       05  TR112-SELECTED-ITEMS         PIC S9(05)  COMP-3                
001200                                                    VALUE ZERO.           
001300       05  TR112-MAX-ITEMS              PIC  9(02)  VALUE 20.             
001400       05  TR112-SELECTED-ITEM-ARRAY.                                     
001500           10  FILLER                   OCCURS 20 TIMES                   
001600                                        INDEXED BY TR112-IDX.             
001700               15  TR112-ITEM           PIC S9(09)  COMP-3.               
001800               15  TR112-ACTION-SW      PIC  X(01).                       
001900                   88  TR112-INQ                    VALUE 'I'.            
002000                   88  TR112-UPD                    VALUE 'U'.            
002100                   88  TR112-DEL                    VALUE 'D'.            
002200                   88  TR112-ERR                    VALUE 'E'.            
002300               15  TR112-KEY-DATA.                                        
002400                   20  TR112-CSTM-ENTRY-ID  PIC X(12).                    
002401                   20  TR112-ENT-ID         PIC S9(9) COMP.               
002402                   20  TR112-CONTAINER      PIC X(12).                    
