000100****************************************************************  00010000
000300* TXRD002                                          LRECL=125   *  00020003
000400* THIS IS THE COPYBOOK FOR ENVIROMENTAL BAG FEES COLLECTED AND *  00030005
000500* RETURNED.                                                    *  00040007
000510****************************************************************  00050100
000530 01  TX002-BAG-FEE-RECORD.                                        00050201
002536     05  TX002-SKU-NBR                  PIC   9(08).              00050300
002000     05  TX002-SKU-DESC                 PIC   X(25).              00050400
000540     05  TX002-STR-NBR                  PIC   9(04).              00050500
000540     05  TX002-RGST-ID                  PIC   9(04).              00050602
000540     05  TX002-TRN-NBR                  PIC   9(04).              00050702
000540     05  TX002-SLS-DTE                  PIC   X(10).              00050804
000540     05  TX002-STRT-TM                  PIC   X(08).              00050906
000550     05  TX002-ST-CDE                   PIC   X(02).              00051202
000560     05  TX002-UNITS-SOLD               PIC   9(09).              00051302
000590     05  TX002-FEES-CHRGD               PIC  S9(09)V99.           00051402
000100     05  TX002-UNITS-RTND               PIC   9(09).              00051502
000700     05  TX002-FEES-RTND                PIC  S9(09)V99.           00051602
002550     05  FILLER                         PIC   X(20).              00052003
