000100****************************************************************  00010013
000200*                                                  LRECL=200   *  00020013
000300* TXRD006                                                      *  00030013
000400* THIS IS THE LAYOUT FOR TAX ADJUSTMENT RECORDS FOR EMPLOYEE   *  00040013
000500* DISCOUNTS AND FULFILLMENT CENTER POS TRANSACTIONS.           *  00050013
000501*                                                              *  00050113
000502* 08/14/2003 ADDED AN INDICATOR FOR VOID TRANSACTIONS.  THIS   *  00050213
000503*            WILL BE USED IN BY TXKRP031 TO REVERSE THE AMOUNT *  00050313
000504*            ON THE TRANSACTION FOR BALANCING WHEN IT IS A     *  00050413
000505*            LATE VOID.  PM00570467                            *  00050513
000502* 02/18/2014 MODIFIED TRAN INDICATOR SWITCH TO HAVE BOTH THE   *  00050616
000503*            TRANSACTION BOPUS BPS AND SFS AS PART OF BOPUS    *  00050719
000504*            PROJECT     CHG0076279                            *  00050820
000506****************************************************************  00051016
000507                                                                  00051116
000508 01  TX006-TAX-AUDIT-RECORD.                                      00051216
000509     05  TX006-STR-NBR                  PIC   9(04).              00051316
000510     05  TX006-ST-CDE                   PIC   X(02).              00051416
000520     05  TX006-ZIP-CDE                  PIC   X(05).              00052013
000530     05  TX006-GEO-CDE                  PIC   X(02).              00053013
000540     05  TX006-TAXWARE-PROD-CDE         PIC   X(05).              00054013
000550     05  TX006-ORDER-DTE                PIC   X(10).              00055013
000560     05  TX006-PROCESS-DTE              PIC   X(10).              00056013
000570     05  TX006-TAX-RT-PCT               PIC  S9V9(05) COMP-3.     00057013
000580     05  TX006-EXEMPT-IND               PIC   X(01).              00058013
000590         88 TX006-EXEMPT-YES           VALUE '1'.                 00059013
000600         88 TX006-EXEMPT-NO            VALUE '0'.                 00060013
000700     05  TX006-CREDIT-IND               PIC   X(01).              00070013
000800         88 TX006-CREDIT-YES           VALUE '1'.                 00080013
000900         88 TX006-CREDIT-NO            VALUE '0'.                 00090013
001000     05  TX006-SLD-QTY                  PIC  S9(05)   COMP-3.     00100013
001100     05  TX006-TAXABLE-AMT              PIC  S9(7)V99 COMP-3.     00110013
001200     05  TX006-TX-AMT                   PIC  S9(7)V99 COMP-3.     00120013
001300     05  TX006-DEPT-NBR                 PIC   9(03).              00130013
001400     05  TX006-SUB-CL-NBR               PIC   9(02).              00140013
001500     05  TX006-VOID-IND                 PIC   X(01).              00150013
001600         88 TX006-VOID-TRANSACTION     VALUE 'Y'.                 00160013
001700     05  TX006-TRN-TYP-CDE              PIC   X(02).              00170013
001800     05  TX006-POS-DESC                 PIC   X(25).              00180013
001900     05  TX006-TAX-EXMPT-ID             PIC   X(25).              00190013
002000     05  TX006-PROCESS-TYPE             PIC   X(01).              00200013
002100         88  TX006-TAX-AMOUNT-PASSED   VALUE 'T'.                 00210013
002200         88  TX006-SALES-AMOUNT-PASSED VALUE 'G'.                 00220013
002300     05  TX006-MDSE-ID                  PIC  S9(15) COMP-3.       00230013
002400     05  TX006-PARTITION                PIC  S9(04) COMP.         00240013
002500     05  TX006-RGST-ID                  PIC  S9(4)  COMP.         00250013
002510     05  TX006-TRN-NBR                  PIC  S9(4)  COMP.         00251013
002520     05  TX006-START-TIME               PIC   X(08).              00252013
002530     05  TX006-SLS-CORR-SEQ-NBR         PIC  S9(04) COMP.         00253013
002531     05  TX006-LNE-ITM-SEQ-NBR          PIC  S9(04) COMP.         00253113
002532     05  TX006-RCPT-TX-TOT-CDE          PIC   X(02).              00253213
002533     05  TX006-ECOMMERCE-ORDER-NUMBER   PIC   X(40).              00253313
002534     05  TX006-SKU-NBR                  PIC   X(08).              00253413
002535     05  TX006-SKU-NBR-9 REDEFINES TX006-SKU-NBR                  00253513
002536                                        PIC   9(08).              00253613
002537     05  TX006-MAJ-CL-NBR               PIC  S9(04) COMP-3.       00253713
002538     05  TX006-POS-CPBL-LVL-NBR         PIC  S9(4)  COMP.         00253813
002539     05  TX006-TRAN-INDICATOR-CDE       PIC   X(01).              00253921
000590         88 TX006-TRAN-IND-SFS          VALUE 'S'.                00254016
000600         88 TX006-TRAN-IND-BPS          VALUE 'B'.                00254116
000600         88 TX006-TRAN-IND-OTH          VALUE 'N'.                00254217
002540     05  FILLER                         PIC   X(02).              00255013
