000100****************************************************************  00010001
000200*                                                  LRECL=180   *  00020001
000300* TXRD007                                                      *  00030001
000400* THIS IS THE LAYOUT SUMMARIZED TAX AUDIT RECORDS.  IT IS      *  00040001
000500* SUMMARIZED BY STORE NUMBER, STATE CODE, ZIP CODE, TAXWARE    *  00050001
000500* GEO CODE, ORDER DATE AND TAXWARE PRODUCT CODE.  THERE WILL   *  00051001
000500* BE ONE RECORD CONTAINING ALL TRANSACTIONS FOR TAX EXEMPT     *  00052001
000500* CUSTOMERS,  THE TAXWARE PRODUCT CODE WILL BE SPACES.         *  00053001
000900****************************************************************  00060001
001000                                                                  00070001
001100 01  TX007-TAX-SUMMARY-RECORD.                                    00080006
001800     05  TX007-COMPANY-ID                    PIC   X(02).         00090001
001910     05  TX007-STR-NBR                       PIC   9(04).         00100010
001951     05  TX007-ST-CDE                        PIC   X(02).         00110001
001960     05  TX007-ZIP-CDE                       PIC   X(05).         00120001
001970     05  TX007-GEO-CDE                       PIC   X(02).         00121001
001940     05  TX007-ORDER-DTE                     PIC   X(08).         00130001
      *    DATE FORMAT IS CCYYMMDD                                      00131001
001940     05  TX007-PROCESS-DTE                   PIC   X(08).         00132004
      *    DATE FORMAT IS CCYYMMDD                                      00133004
010400     05  TX007-TAXWARE-PROD-CDE              PIC   X(05).         00140010
           05  TX007-EXEMPT-IND                    PIC   X(01).         00150007
               88 TX007-EXEMPT-YES           VALUE '1'.                 00160001
               88 TX007-EXEMPT-NO            VALUE '0'.                 00170001
002500     05  TX007-CREDIT-IND                    PIC   X(01).         00200001
002600         88 TX007-CREDIT-YES           VALUE '1'.                 00210001
002700         88 TX007-CREDIT-NO            VALUE '0'.                 00220001
002800     05  TX007-GROSS-AMT                     PIC  9(12)V99.       00230010
004000     05  TX007-TAX-AMT                       PIC  9(12)V99.       00240010
           05  TX007-NO-OF-ITEMS                   PIC  9(14).          00250010
           05  TX007-CALC-TYP-IND                  PIC  X(01).          00260003
               88  TX007-TAX-AMOUNT-PASSED   VALUE 'T'.                 00270003
               88  TX007-SALES-AMOUNT-PASSED VALUE 'G'.                 00280003
           05  TX007-TAX-RATE                      PIC  9V9(04).        00290009
           05  TX007-TX-EXMPT-ID                   PIC  X(25).          00300010
