000100****************************************************************  00010000
000200*                                                  LRECL=164   *  00020000
000300* TXRD025                                                      *  00030000
000400* THIS IS THE LAYOUT SUMMARIZED TAX AUDIT RECORDS.  IT IS      *  00040000
000500* SUMMARIZED BY STORE NUMBER, STATE CODE, ZIP CODE, TAXWARE    *  00050000
000500* GEO CODE, ORDER DATE AND TAXWARE PRODUCT CODE.  THERE WILL   *  00060000
000500* BE ONE RECORD CONTAINING ALL TRANSACTIONS FOR TAX EXEMPT     *  00070000
000500* CUSTOMERS,  THE TAXWARE PRODUCT CODE WILL BE SPACES.         *  00080000
000900****************************************************************  00090000
001000                                                                  00100000
001100 01  TX052-TAX-SUMMARY-RECORD.                                    00110001
001910     05  TX052-STR-NBR                       PIC   9(04).         00120000
           05  FILLER                              PIC X VALUE ','.     00121001
001951     05  TX052-ST-CDE                        PIC   X(02).         00130000
           05  FILLER                              PIC X VALUE ','.     00131001
001951     05  TX052-COUNTY-NAME                   PIC   X(26).         00140005
           05  FILLER                              PIC X VALUE ','.     00140101
001951     05  TX052-CITY-NAME                     PIC   X(26).         00141005
           05  FILLER                              PIC X VALUE ','.     00141101
001960     05  TX052-ZIP-CDE                       PIC   X(05).         00142000
           05  FILLER                              PIC X VALUE ','.     00142101
001970     05  TX052-GEO-CDE                       PIC   X(02).         00143000
           05  FILLER                              PIC X VALUE ','.     00143101
001940     05  TX052-ORDER-DTE                     PIC   X(08).         00144000
           05  FILLER                              PIC X VALUE ','.     00144101
      *    DATE FORMAT IS CCYYMMDD                                      00145000
001940     05  TX052-PROCESS-DTE                   PIC   X(08).         00146000
           05  FILLER                              PIC X VALUE ','.     00146101
      *    DATE FORMAT IS CCYYMMDD                                      00147000
010400     05  TX052-TAXWARE-PROD-CDE              PIC   X(05).         00148000
           05  FILLER                              PIC X VALUE ','.     00148101
           05  TX052-EXEMPT-IND                    PIC   X(01).         00149000
               88 TX052-EXEMPT-YES           VALUE '1'.                 00150000
               88 TX052-EXEMPT-NO            VALUE '0'.                 00160000
           05  FILLER                              PIC X VALUE ','.     00161001
002500     05  TX052-CREDIT-IND                    PIC   X(01).         00170000
002600         88 TX052-CREDIT-YES           VALUE '1'.                 00180000
002700         88 TX052-CREDIT-NO            VALUE '0'.                 00190000
           05  FILLER                              PIC X VALUE ','.     00191001
002800     05  TX052-GROSS-AMT                     PIC  9(12)V99.       00200000
           05  FILLER                              PIC X VALUE ','.     00201001
004000     05  TX052-TAX-AMT                       PIC  9(12)V99.       00210000
           05  FILLER                              PIC X VALUE ','.     00211001
           05  TX052-NO-OF-ITEMS                   PIC  9(14).          00220000
           05  FILLER                              PIC X VALUE ','.     00221001
           05  TX052-CALC-TYP-IND                  PIC  X(01).          00230000
               88  TX052-TAX-AMOUNT-PASSED   VALUE 'T'.                 00240000
               88  TX052-SALES-AMOUNT-PASSED VALUE 'G'.                 00250000
           05  FILLER                              PIC X VALUE ','.     00251001
           05  TX052-TAX-RATE                      PIC  9V9(05).        00260003
           05  FILLER                              PIC X VALUE ','.     00261001
           05  TX052-TX-EXMPT-ID                   PIC  X(25).          00270000
           05  FILLER                              PIC X VALUE ','.     00271001
           05  TX052-DEPT-NBR                      PIC  X(03).          00280000
           05  FILLER                              PIC X VALUE ','.     00290001
           05  TX052-UNIT-AMT                      PIC  9(12)V99.       00300002
           05  FILLER                              PIC X VALUE ','.     00310002
           05  TX052-WARNING                       PIC X(1).            00320004
           05  FILLER                              PIC X VALUE ','.     00330002
           05  TX052-ORDER-NBR                     PIC X(10).           00340002
           05  FILLER                              PIC X VALUE ','.     00350002
           05  TX052-SKU-NBR                       PIC X(8).            00360002
           05  FILLER                              PIC X VALUE ','.     00370002
