000100****************************************************************  00010000
000200*                                                  LRECL=155   *  00020000
000300* TXRD020                                                      *  00030000
000400* THIS IS THE LAYOUT FOR THE TAX MARKETPLACE EXTRACT FILE.     *  00040000
000506****************************************************************  00050000
000507                                                                  00051000
000508 01  TX020-MARKETPLACE-RECORD.                                    00051100
002400     05  TX020-PARTN-NBR                PIC   9(04).              00051200
000509     05  TX020-STR-NBR                  PIC   9(04).              00051300
002500     05  TX020-RGST-ID                  PIC   9(04).              00051400
002510     05  TX020-TRN-NBR                  PIC   9(04).              00051500
002520     05  TX020-START-TIME               PIC   X(08).              00051600
002530     05  TX020-SLS-CORR-SEQ-NBR         PIC   9(04).              00051700
002531     05  TX020-LNE-ITM-SEQ-NBR          PIC   9(04).              00051800
001700     05  TX020-TRN-TYP-CDE              PIC   X(02).              00051900
001700     05  TX020-SLD-QTY                  PIC   9(05).              00052000
001100     05  TX020-TAXABLE-AMT              PIC  S9(7)V99 COMP-3.     00052100
001200     05  TX020-TX-AMT                   PIC  S9(7)V99 COMP-3.     00052200
001200     05  TX020-SHP-CHRG-AMT             PIC  S9(7)V99 COMP-3.     00052300
001200     05  TX020-SHP-TX-AMT               PIC  S9(7)V99 COMP-3.     00052400
001200     05  TX020-SHP-TX-RT-PCT            PIC  S9(3)V9(5).          00052500
001300     05  TX020-DEPT-NBR                 PIC   9(03).              00052600
000510     05  TX020-ST-CDE                   PIC   X(02).              00052700
000520     05  TX020-ZIP-CDE                  PIC   X(05).              00052800
000530     05  TX020-GEO-CDE                  PIC   X(02).              00052900
000550     05  TX020-ORDER-DTE                PIC   X(10).              00053000
002533     05  TX020-ORDER-NUMBER             PIC   X(40).              00054000
002533     05  TX020-MDSE-ID                  PIC   S9(15).             00055000
002540     05  FILLER                         PIC   X(11).              00056000
