000010******************************************************************00001001
000020* TAX OUT OF BALANCE RECORD LAYOUT                     LRECL=90  *00002003
000030******************************************************************00003001
000100 01  TX031-OUT-OF-BAL-RECORD.                                     00010000
000200     05  TX031-STR-NBR        PIC ZZZ9.                           00020000
000300     05  FILLER               PIC X(1)   VALUE ','.               00030000
000400     05  TX031-SLS-DTE        PIC X(08).                          00040000
000500     05  FILLER               PIC X(01)  VALUE ','.               00050000
000600     05  TX031-RGST-ID        PIC ZZZ9.                           00060000
000700     05  FILLER               PIC X(01)  VALUE ','.               00070000
000800     05  TX031-TRN-NBR        PIC ZZZ9.                           00080000
000900     05  FILLER               PIC X(01)  VALUE ','.               00090000
001000     05  TX031-STRT-TM        PIC X(08).                          00100000
001100     05  FILLER               PIC X(01)  VALUE ','.               00110000
001200     05  TX031-SLS-CORR-SEQ-NBR PIC ZZZ9.                         00120000
001300     05  FILLER               PIC X(01)  VALUE ','.               00130000
001400     05  TX031-TEPTRN-SLS-AMT PIC --------9.99.                   00140002
001500     05  FILLER               PIC X(01)  VALUE ','.               00150000
001600     05  TX031-TEPTRN-TAX-AMT PIC --------9.99.                   00160002
001700     05  FILLER               PIC X(01)  VALUE ','.               00170000
001800     05  TX031-TAXRPT-SLS-AMT PIC --------9.99.                   00180002
001900     05  FILLER               PIC X(01)  VALUE ','.               00190000
002000     05  TX031-TAXRPT-TAX-AMT PIC --------9.99.                   00200003
002100     05  FILLER               PIC X(01)  VALUE ' '.               00210003
