           EXEC CICS                                                    00010000
             ASSIGN                                                     00020000
               APPLID (PV-CICS-ID)                                      00030000
           END-EXEC.                                                    00040000
                                                                        00050000
           EVALUATE TRUE                                                00060000
               WHEN PV-CICS-REGION-PRODUCTION                           00070000
      *** PRB0057132 start                                              00080000
      *            MOVE 'mfclient' TO UP003-MQ-USER-ID                  00100000
                   MOVE 'MFCLIENT' TO UP003-MQ-USER-ID                  00100100
      *** PRB0057132 end                                                00101000
      *** PRB0059564 start                                              00102000
      *            MOVE 'RJG3m9/CDKHDrfFSuEYCZg=='                      00110000
      *            MOVE 'Yf6i57GadfexDU5rQB6fKe8KFhw='                  00111000
                   MOVE 'mfclient' TO UP003-MQ-PASSWORD                 00112000
      *** PRB0059564 end                                                00120100
                   MOVE 'Product'  TO  UP003-MQ-ENTERPRISE              00121000
               WHEN PV-CICS-REGION-TEST                                 00130000
               WHEN PV-CICS-REGION-SYSTEST                              00140000
                   MOVE 'admin' TO UP003-MQ-USER-ID                     00170000
                   MOVE 'admin' TO UP003-MQ-PASSWORD                    00180000
                   MOVE 'Product'  TO  UP003-MQ-ENTERPRISE              00190000
               WHEN PV-CICS-REGION-LEARNING                             00200000
                   MOVE 'mfclient' TO UP003-MQ-USER-ID                  00203000
                   MOVE 'RJG3m9/CDKHDrfFSuEYCZg=='                      00204000
                                   TO UP003-MQ-PASSWORD                 00205000
                   MOVE 'Product'  TO  UP003-MQ-ENTERPRISE              00206000
               WHEN PV-CICS-REGION-QUALITY                              00260000
                   MOVE 'MFCLIENT' TO UP003-MQ-USER-ID                  00283000
                   MOVE 'L8o7EAFTE4DTRR9D0U8pAg=='                      00284000
                                   TO UP003-MQ-PASSWORD                 00285000
                   MOVE 'Product'  TO  UP003-MQ-ENTERPRISE              00286000
               WHEN PV-CICS-REGION-ACCEPTANCE                           00320000
                   MOVE 'mfclient' TO UP003-MQ-USER-ID                  00323000
                   MOVE 'RJG3m9/CDKHDrfFSuEYCZg=='                      00324000
                                   TO UP003-MQ-PASSWORD                 00325000
                   MOVE 'Product'  TO  UP003-MQ-ENTERPRISE              00326000
           END-EVALUATE.                                                00380000
                                                                        00390000
