       01  PV-PROGRAM-VARS-FOR-EMS-LOGON.                                       
           05  PV-CICS-ID.                                                   DPW
               10  PV-FIRST-4              PIC X(4).                            
               10  PV-CICS-REGION-TYPE     PIC X.                            DPW
                   88  PV-CICS-REGION-PRODUCTION  VALUE 'P'.                 DPW
                   88  PV-CICS-REGION-ACCEPTANCE  VALUE 'A'.                 DPW
                   88  PV-CICS-REGION-QUALITY     VALUE 'Q'.                 DPW
                   88  PV-CICS-REGION-LEARNING    VALUE 'L'.                 DPW
                   88  PV-CICS-REGION-TEST        VALUE 'T'.                 DPW
                   88  PV-CICS-REGION-SYSTEST     VALUE 'S'.                 DPW
               10  PV-CICS-REGION-CODE     PIC X.                            DPW
               10  PV-LAST-2               PIC X(2).                            
