      ******************************************************************        
      *                                                                *        
      * UPWS009 - WORKING STORAGE SECTION FOR CICS/ONLINE PROGRAM      *        
      *                                                                *        
      *----------------------------------------------------------------*        
      *                                                                *        
      * DESCRIPTION: THIS COPY BOOK HAS ALL THE VARIBLES REQUIRED FOR  *        
      *              PERFORMING OPERATIONS ON MESSAGING QUEUES.        *        
      *                                                                *        
      *----------------------------------------------------------------*        
      * HOW TO USE THIS COPYBOOK :                                     *        
      *                                                                *        
      *  1.  INCLUDE COPY BOOK UPWS009 IN THE MAIN PROGRAM.            *        
      *                                                                *        
      *----------------------------------------------------------------*        
      * CHANGE HISTORY:                                                *        
      * WR NUMBER     PROGRAMMER       DATE                            *        
      * ---------------------------------------------------------------*        
      * ORIGINAL VERSION               02/08/2013                      *        
      *                                                                *        
      ******************************************************************        
                                                                                
      ******************************************************************00940000
      *   VARIABLES FOR MQ FUNCTION CALLS                               00950000
      ******************************************************************00960000
       01  UP009-WORKING-STORAGE.                                       00970000
           05  UP009-MQCONN                 PIC  X(08) VALUE 'CSQCCONN'.00980000
           05  UP009-MQOPEN                 PIC  X(08) VALUE 'CSQCOPEN'.00990000
           05  UP009-MQGET                  PIC  X(08) VALUE 'CSQCGET'. 01010000
           05  UP009-MQPUT                  PIC  X(08) VALUE 'CSQCPUT'. 01020000
           05  UP009-MQCMIT                 PIC  X(08) VALUE 'CSQCCOMM'.01040000
           05  UP009-MQBACK                 PIC  X(08) VALUE 'CSQCBACK'.01050000
           05  UP009-MQCLOSE                PIC  X(08) VALUE 'CSQCCLOS'.01060000
           05  UP009-MQDISC                 PIC  X(08) VALUE 'CSQCDISC'.01070000
           05  UP009-MQCHECK                PIC  X(08) VALUE 'MQR2C'.   01080000
      ******************************************************************00670000
      *  MQ PROGRAM SWITCHES                                            00680000
      ******************************************************************00690000
       01  UP009-PROGRAM-SWITCHES.                                      00700000
           05  UP009-ERROR-WEBSERVICE          PIC  X(01) VALUE 'N'.    00710000
               88  UP009-ERROR-FOUND                      VALUE 'Y'.    00720000
               88  UP009-ERROR-NOT-FOUND                  VALUE 'N'.    00720000
           05  UP009-END-OF-DAY                PIC  X(01) VALUE 'N'.    00710000
               88  UP009-END-OF-DAY-MSG                   VALUE 'Y'.    00720000
                                                                        00860000
           05  UP009-MQPUT-SUCCESSFUL-IND      PIC  X(01) VALUE 'N'.    00910000
               88 UP009-MQPUT-SUCCESSFUL                  VALUE 'Y'.    00920000
                                                                        00930000
           05  UP009-DC-MSG-SW                 PIC  X(01) VALUE 'N'.    00870000
               88  UP009-GOOD-DC-MSG                      VALUE 'Y'.    00880000
               88  UP009-BAD-DC-MSG                       VALUE 'N'.    00890000
                                                                                
           05  UP009-CONNECTION-SW             PIC  X(01) VALUE 'N'.    00870000
               88  UP009-CONNECTED                        VALUE 'Y'.    00880000
               88  UP009-DISCONNECTED                     VALUE 'N'.    00890000
                                                                                
           05  UP009-ERROR-CODE                PIC  X(25).                      
                 88  UP009-CICS-REGION-NOT-FOUND                                
                                          VALUE 'CICS REGION NOT FOUND'.        
                                                                                
           05  UP009-SYS-ID                    PIC X(04).               01150000
               88  UP009-KOHLS-TEST-SYSTEM             VALUE 'CIT1'.    01160000
               88  UP009-KOHLS-QA-SYSTEM               VALUE 'CIQA',    01210000
                                                             'CIQT'.    01220000
               88  UP009-KOHLS-PROD-SYSTEM             VALUE 'CIPS',    01250000
                                                             'CIP1',    01260000
                                                             'CIP3',    01270000
                                                             'CIP4',    01280000
                                                             'CIP6'.    01290000
                                                                                
           05  UP009-QMGR-NAME                 PIC X(48).               01041000
               88  UP009-TEST-QMGR-NAME                VALUE 'QKST'.    01049000
               88  UP009-QA-QMGR-NAME                  VALUE 'QKSQ'.    01047000
               88  UP009-PROD-QMGR-NAME                VALUE 'QKSP'.    01043000
      ******************************************************************01470000
      *  PROGRAM VARIABLES SPECIFIC TO MQ                               01480000
      ******************************************************************01490000
       01 UP009-PROGRAM-VARIABLES.                                      01500000
           05  UP009-QM-NAME                  PIC  X(48).               01510000
           05  UP009-REPLYTOQNAME             PIC  X(48).               01510000
           05  UP009-SQ-NAME                  PIC  X(48) VALUE          01510000
                                             'UP.MDM.SERVICE.REQUEST.Q'.        
           05  UP009-MODEL-NAME               PIC  X(48)                01510000
                                   VALUE 'SYSTEM.DEFAULT.REPLY.MODEL'.          
           05  UP009-DYMODELQ-NAME            PIC  X(48)                01510000
                                   VALUE 'SYSTEM.DEFAULT.REPLY.MODEL.*'.        
           05  UP009-HCONN                    PIC S9(9)  VALUE +0 COMP. 01540000
           05  UP009-SAVE-REASON              PIC S9(09) BINARY.        01550000
           05  UP009-SAVE-COMP-CODE           PIC S9(09) BINARY.        01560000
           05  UP009-COMPLETION-CODE          PIC S9(09) BINARY.        01570000
           05  UP009-REASON                   PIC S9(09) BINARY.        01580000
           05  UP009-CON-REASON               PIC S9(09) BINARY.        01590000
           05  UP009-COMMIT-MSG-COUNT         PIC S9(02) VALUE ZERO.    01600000
           05  UP009-ERROR-MESSAGE            PIC  X(48) VALUE SPACES.  01660000
           05  UP009-OPEN-OPTIONS             PIC S9(09) BINARY.        01670000
           05  UP009-CLOSE-HANDLE             PIC S9(09) BINARY VALUE 0.01680000
           05  UP009-GQ-HANDLE                PIC S9(09) BINARY VALUE 0.01710000
           05  UP009-PQ-HANDLE                PIC S9(09) BINARY VALUE 0.01730000
           05  UP009-MSGLENGTH                PIC S9(09)                01790000
                                              VALUE +10000  COMP.       01800000
           05  UP009-DATA-LENGTH              PIC S9(09) BINARY.        01810000
           05  UP009-REASON-TEXT              PIC  X(30) VALUE SPACES.  01820000
           05  UP009-ENCODING                 PIC S9(09) BINARY VALUE 0.01910000
           05  UP009-ENCODING2                PIC S9(09) VALUE 785.     01910000
           05  UP009-CODEDCHARSETID           PIC S9(09) BINARY VALUE 0.01920000
           05  UP009-CODEDCHARSETID2          PIC S9(09) VALUE  37.     01920000
           05  UP009-ABEND-CODE               PIC S9(04) COMP                   
                                              VALUE ZERO.                       
           05  UP009-PARAGRAPH                PIC  X(48) VALUE SPACES.  01640000
           05  UP009-RESPONSE1                PIC  X(05) VALUE SPACES.          
           05  UP009-RESPONSE2                PIC  X(05) VALUE SPACES.          
           05  UP009-RESPONSE-MSG             PIC  X(30) VALUE SPACES.          
           05  UP009-CICS-REGION              PIC  X(08) VALUE SPACES.          
           05  UP009-RESPONSE                 PIC S9(04) VALUE +0               
                                                         COMP SYNC.             
           05  UP009-WS-SIGN                  PIC  X(03) VALUE "$@$".           
           05  UP009-WHERE-SIGN               PIC  X(03) VALUE "&".             
           05  UP009-WAIT-TIME                PIC S9(09) VALUE +120000          
                                                                  COMP.         
      ******************************************************************01340000
      *    REQUEST RESPONSE RELATED VARIABLES.                          01350000
      ******************************************************************01360000
       01 UP009-STRING-VARIABLES.                                       01500000
           05  UP009-QUERY-ID                 PIC  X(10) VALUE SPACES.          
           05  UP009-JOB-NUMBER               PIC  9(10) VALUE ZERO.            
           05  UP009-JOB-NUMBER-X             PIC  X(10) VALUE SPACES.          
           05  UP009-ACTION                   PIC  X(01) VALUE SPACES.          
           05  UP009-STATUS                   PIC  X(30) VALUE SPACES.          
           05  UP009-ROWS-RETURNED            PIC  9(10) VALUE ZERO.            
           05  UP009-TEMP-CNT                 PIC  9(02) VALUE 1.               
           05  UP009-SELECT-CNT               PIC  9(02) VALUE ZERO.            
           05  UP009-WHERE-CNT                PIC  9(02) VALUE ZERO.            
           05  UP009-SELECT-CLAUSE            OCCURS 10  TIMES.                 
               10  UP009-SELECT               PIC X(50).                        
           05  UP009-SELECT-VALUE             OCCURS 10  TIMES.                 
               10  UP009-SEL-VAL              PIC X(50).                        
           05  UP009-WHERE-CLAUSE             OCCURS 10  TIMES.                 
               10  UP009-WHERE                PIC X(50).                        
           05  UP009-WHERE-VALUE              OCCURS 10  TIMES.                 
               10  UP009-VALUE                PIC X(20).                        
           05  UP009-STRING-POINTER           PIC  9(08)  VALUE ZERO.           
           05  UP009-MQ-RESPONSE              PIC X(2000) VALUE SPACES.         
       01 UP009-MESSAGE-STRING.                                                 
           05  UP009-REQ-MSGBUFFER          PIC X(10000)  VALUE SPACES. 01780000
           05  UP009-RES-MSGBUFFER          PIC X(10000)  VALUE SPACES. 01780000
                                                                                
       01  UP009-RESPONSE-TYPE              PIC  X(20).                         
             88  UP009-SUCCESS              VALUE 'SUCCESS'.                    
             88  UP009-NO-DATA              VALUE 'BUS-DATA-001'.               
      ******************************************************************01340000
      *    MQ PROGRAM CONSTANTS                                         01350000
      ******************************************************************01360000
       01 UP009-CONSTANTS.                                              01370000
           05  UP009-END-PGM-MSG            PIC  X(100)                 01410000
                                            VALUE 'END RUN OF PROGRAM '.01420000
           05  UP009-DELAY-INTERVAL.                                    01430000
               10  FILLER                   PIC  X(02) VALUE SPACES.    01440000
               10  UP009-DELAY-TIME         PIC  9(08) VALUE 1500.      01450000
                                                                                
