      ******************************************************************        
      *  VARD014 - SHORTAGE EXTRACT FILE                                        
      *                                                                         
W34517*                                                                         
W34517*                                                                         
W34517*              !!!   I M P O R T A N T   !!!                              
W34517*                                                                         
W34517*    THIS COPYBOOK MUST BE KEPT IN SYNC WITH INRD014                      
W34517*            FOR THE BV / VA  SPLIT PROJECT                               
W34517*                                                                         
W34517*                                                                         
      *                                                                         
      *CHANGE HISTORY:                                                          
      * WR/PROJ DATE       PGMR        DESCRIPTION OF CHANGES                   
      * ------- ---------- ----------- --------------------------------         
W26600* W26600  04-05-2004 ROD JANSSEN INV LEDGER STORE EXPANSION               
W20445* W20445  09-01-2004 ROD JANSSEN DETAILED INVNENTORY ADJUSTMENT           
W28545* W28545  05-20-2006 JILL LIN    ADD TERRITORY NUMBER TO FILLER           
W?????* W?????  12-20-2005 C. SCHWENN  VENDOR/BRAND CHANGE ENT-ID TO            
W?????* W?????                         ML-LWST-ID.                              
W34517* W34517  10-14-2008 JACK KRAMER - ADD DOC WARNING TO                     
W34517*                    KEEP VARD014 IN SYNC WITH INRD014                    
W33304* W33304  11-28-2008 NIJESH/INFOSYS HOLDING INVENTORY LEDGER OPEN         
W33304* W33304                         ACROSS PERIODS                           
      ******************************************************************        
       01  VA014-SHORTAGE-EXTR-REC.                                             
           05  VA014-GMA-NBR                PIC X(02)      VALUE SPACES.        
           05  VA014-BYR-NBR                PIC X(03)      VALUE SPACES.        
           05  VA014-BYR-NAME               PIC X(20)      VALUE SPACES.        
           05  VA014-DEPT-NBR               PIC X(03)      VALUE SPACES.        
           05  VA014-DEPT-MDSEAR-DESC       PIC X(20)      VALUE SPACES.        
           05  VA014-MAJ-CL-NBR             PIC X(02)      VALUE SPACES.        
           05  VA014-SUB-CL-NBR             PIC X(02)      VALUE SPACES.        
W20445     05  VA014-ML-LWST-ID             PIC S9(9) COMP VALUE ZERO.          
           05  VA014-RPT-CL-NBR             PIC X(02)      VALUE ZERO.          
           05  VA014-RPT-LVL                PIC X(03)      VALUE ZERO.          
           05  VA014-STR-NBR                PIC S9(4) COMP VALUE ZERO.          
           05  VA014-STR-NAME               PIC X(10)      VALUE SPACES.        
W26600     05  VA014-BOOK-INV-RTL-AMT       PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  VA014-SLS-BSE-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  VA014-SHNK-RTL-AMT           PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  VA014-TOTAL-BOOK-RTL-AMT     PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  VA014-PHY-INV-RTL-AMT        PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  VA014-SHORTAGE-RTL-AMT       PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  VA014-ESTIMATED-INV-ADJ-AMT  PIC S9(13)V99  COMP-3               
                                                           VALUE ZERO.          
W26600     05  VA014-DISTRICT-NMBR          PIC S9(4)V     COMP-3               
W26600                                                     VALUE ZERO.          
W26600     05  VA014-REGION-NBR             PIC S9(4)V     COMP-3               
W26600                                                     VALUE ZERO.          
W28545     05  VA014-TERRITORY-NBR          PIC S9(4)V     COMP-3               
W28545                                                     VALUE ZERO.          
W33304     05  VA014-OPN-FSCL-MN-DTE        PIC X(10)      VALUE SPACES.        
W33304     05  VA014-INV-ID                 PIC S9(9) COMP VALUE ZERO.          
W33304     05  VA014-FINCL-INV-STAT-CDE     PIC X(02)      VALUE SPACES.        
W33304     05  FILLER                       PIC X(16)      VALUE SPACES.        
