000100*-----------------------*                                         06/13/94
000200 IDENTIFICATION DIVISION.                                         POKCS088
000300*-----------------------*                                            LV013
000400 PROGRAM-ID.    VLKCS588.                                         POKCS088
000500 AUTHOR.        MARY SARDINA.                                           03
000600 DATE-WRITTEN.  08/96.                                            POKCS088
000700*---------------------------------------------------------------* POKCS088
000800*    V588 - PRETICKET REQUEST REASON CODE SCREEN                * POKCS088
000900*                                                               * POKCS088
001000*    THIS PROGRAM GENERATES A LIST PF REASON CODES AND          * POKCS088
001100*    DESCRIPTIONS FOR RESUBMITTING A PRETICKET REQUEST          * POKCS088
001200*                                                               * POKCS088
001300*---------------------------------------------------------------* POKCS088
263627* CHANGED 11/05/2021    BY JIM HUNTER      WR: CHG0263627                 
263627* CHANGE CALL OF DPKUT100 TO CALL DP010I-NUMERIC-EDIT-ROUTINE             
263627* MAKING THE CALL DYNAMIC VS STATIC.                                      
263627*---------------------------------------------------------------*         
CICS  * CHANGED 11/14/2022    BY JIM HUNTER      WR: CHG0278236                 
CICS  * ADD COPYBOOK DPWS930 AND MAKE THE CICS ARCHITECTURE CALL                
CICS  * DYNAMIC INSTEAD OF STATIC BY CALLING DP930-CICS-ARCH-API.               
CICS  *****************************************************************         
001400 ENVIRONMENT DIVISION.                                            POKCS088
001500 DATA DIVISION.                                                   POKCS088
001600                                                                  POKCS088
001700 WORKING-STORAGE SECTION.                                         POKCS088
001800                                                                  POKCS088
001900 01  DK-DB2-KEY.                                                  POKCS088
001910     05  DK-PO-REQ-NBR                  PIC S9(09)  VALUE +0      POKCS088
001920                                                    COMP-3.       POKCS088
002000     05  DK-STATUS-CODE                 PIC  X(01)  VALUE SPACES. POKCS088
002100     05  DK-VEND-NAME                   PIC  X(30)  VALUE SPACE.  POKCS088
002200     05  DK-VEND-NAME-BYTE              REDEFINES DK-VEND-NAME    POKCS088
002300                                        OCCURS 30 TIMES           POKCS088
002400                                        PIC  X(01).               POKCS088
002500     05  DK-PRIM-NAME                   PIC  X(30).               POKCS088
002600                                                                  POKCS088
002700 01  PC-PROGRAM-CONSTANTS.                                        POKCS088
002800     05  PC-CURRENT-MAP-NAME            PIC  X(08)  VALUE         POKCS088
002900                                                    'VL588A  '.   POKCS088
003000     05  PC-CURRENT-MAPSET-NAME         PIC  X(08)  VALUE         POKCS088
003100                                                    'VLKM588 '.   POKCS088
003200     05  PC-CURRENT-PROGRAM-NAME        PIC  X(08)  VALUE         POKCS088
003300                                                    'VLKCS588'.   POKCS088
003400     05  PC-LIST-QUEUE-SEQ              PIC  9(01)  VALUE 1.      POKCS088
003500     05  PC-SEL-QUEUE-SEQ               PIC  9(01)  VALUE 2.      POKCS088
003600     05  PC-CRIT-SPEC-FORMAT            PIC  X(01)  VALUE '2'.    POKCS088
003610     05  PC-LIST-FORMAT                 PIC  X(01)  VALUE '1'.    POKCS088
003700     05  PC-ITEMS-PER-PANEL             PIC S9(04)  VALUE +12     POKCS088
003800                                                    COMP SYNC.    POKCS088
003900     05  PC-MAX-BLOCKS-IN-ARRAY         PIC S9(04)  VALUE +2      POKCS088
004000                                                    COMP SYNC.    POKCS088
004100     05  PC-MAX-ITEMS                   PIC S9(09)  VALUE         POKCS088
004200                                                    +1000000      POKCS088
004300                                                    COMP-3.       POKCS088
004400     05  PC-ITM-NUMBER-LENGTH           PIC S9(04)  VALUE +7      POKCS088
004500                                                    COMP SYNC.    POKCS088
004600     05  PC-MAX-RETRIES                 PIC S9(03)  VALUE 3       POKCS088
004700                                                    COMP-3.       POKCS088
004800     05  PC-INQ                         PIC  X(03)  VALUE 'INQ'.  POKCS088
004900     05  PC-UPD                         PIC  X(03)  VALUE 'UPD'.  POKCS088
005000     05  PC-DEL                         PIC  X(03)  VALUE 'DEL'.  POKCS088
005100     05  PC-ERR                         PIC  X(03)  VALUE 'ERR'.  POKCS088
005200     05  PC-PERCENT                     PIC  X(01)  VALUE '%'.    POKCS088
005300     05  PC-TYPE-CODES.                                           POKCS088
005400         10  PC-PRIMARY                 PIC  X(02)  VALUE '01'.   POKCS088
005500         10  PC-ALIAS                   PIC  X(02)  VALUE '02'.   POKCS088
005600         10  PC-LABEL                   PIC  X(02)  VALUE '03'.   POKCS088
005700         10  PC-SHORTNAME               PIC  X(02)  VALUE '04'.   POKCS088
005800                                                                  POKCS088
005900     05  PC-TSYMSG-NUMBERS.                                       POKCS088
006000         10  PC-TSYMSG-00005            PIC  9(05)  VALUE 00005.  POKCS088
006100         10  PC-TSYMSG-00008            PIC  9(05)  VALUE 00008.  POKCS088
006200         10  PC-TSYMSG-00050            PIC  9(05)  VALUE 00050.  POKCS088
006300         10  PC-TSYMSG-00051            PIC  9(05)  VALUE 00051.  POKCS088
006400         10  PC-TSYMSG-00052            PIC  9(05)  VALUE 00052.  POKCS088
006500         10  PC-TSYMSG-00053            PIC  9(05)  VALUE 00053.  POKCS088
006600         10  PC-TSYMSG-00054            PIC  9(05)  VALUE 00054.  POKCS088
006700         10  PC-TSYMSG-00055            PIC  9(05)  VALUE 00055.  POKCS088
006800         10  PC-TSYMSG-00047            PIC  9(05)  VALUE 00047.  POKCS088
006810         10  PC-TSYMSG-00057            PIC  9(05)  VALUE 00057.  POKCS088
006900         10  PC-TSYMSG-00069            PIC  9(05)  VALUE 00069.  POKCS088
007000         10  PC-TSYMSG-00070            PIC  9(05)  VALUE 00070.  POKCS088
007100         10  PC-TSYMSG-00101            PIC  9(05)  VALUE 00101.  POKCS088
007110         10  PC-TSYMSG-00148            PIC  9(05)  VALUE 00148.  POKCS088
007200         10  PC-TSYMSG-00279            PIC  9(05)  VALUE 00279.  POKCS088
007210         10  PC-TSYMSG-00302            PIC  9(05)  VALUE 00302.  POKCS088
007220         10  PC-TSYMSG-00551            PIC  9(05)  VALUE 00551.  POKCS088
007300         10  PC-TSYMSG-99901            PIC  9(05)  VALUE 99901.  POKCS088
007400                                                                  POKCS088
007500 01  PS-PROGRAM-SWITCHES.                                         POKCS088
007600     05  PS-ERROR-SW                    PIC  X(01)  VALUE 'Y'.    POKCS088
007700         88  PS-NO-ERROR                            VALUE 'Y'.    POKCS088
007800         88  PS-ERROR                               VALUE 'N'.    POKCS088
007801     05  PS-NEXT-SCREEN-SW                PIC  X    VALUE 'N'.          79
007802         88  PS-NO-NEXT-SCREEN                      VALUE 'N'.          79
007810         88  PS-NEXT-SCREEN                         VALUE 'Y'.          79
007811     05  PS-RSN-SEL-SW                    PIC  X    VALUE 'N'.          79
007812         88  PS-NO-RSN-SEL-FOUND                    VALUE 'N'.          79
007813         88  PS-RSN-SEL-FOUND                       VALUE 'Y'.          79
007814     05  PS-UPDATE-SW                    PIC  X    VALUE 'N'.           79
007815         88  PS-NO-UPDATES-DONE                     VALUE 'N'.          79
007820         88  PS-UPDATES-DONE                        VALUE 'Y'.          79
007900     05  PS-COMMAREA-SW                 PIC  X(01)  VALUE 'N'.    POKCS088
008000         88  PS-COMMAREA-VALID                      VALUE 'Y'.    POKCS088
008100         88  PS-COMMAREA-NOT-VALID                  VALUE 'N'.    POKCS088
008200     05  PS-DONE-SW                     PIC  X(01)  VALUE 'N'.    POKCS088
008300         88  PS-DONE                                VALUE 'Y'.    POKCS088
008400         88  PS-NOT-DONE                            VALUE 'N'.    POKCS088
008401     05  PS-LIST-END-SW                 PIC X(01)   VALUE 'N'.      CL* *1
008402         88  PS-LIST-END                            VALUE 'Y'.      CL* *1
008410         88  PS-NO-LIST-END                         VALUE 'N'.      CL* *1
008411     05  PS-RSN-QUEUE-SW                PIC X(01)   VALUE 'N'.      CL* *1
008412         88  PS-RSN-QUEUE-WRITTEN                   VALUE 'Y'.      CL* *1
008413         88  PS-RSN-QUEUE-NOT-WRITTEN               VALUE 'N'.      CL* *1
008500                                                                  POKCS088
008600 01  PL-PROGRAM-LITERALS.                                         POKCS088
008700     05  PL-PRIMARY                     PIC  X(10)  VALUE         POKCS088
008800                                                    'PRIMARY   '. POKCS088
008900     05  PL-ALIAS                       PIC  X(10)  VALUE         POKCS088
009000                                                    'ALIAS     '. POKCS088
009100     05  PL-LABEL                       PIC  X(10)  VALUE         POKCS088
009200                                                    'LABEL     '. POKCS088
009300     05  PL-SHORTNAME                   PIC  X(10)  VALUE         POKCS088
009400                                                    'SHORT NAME'. POKCS088
009500                                                                  POKCS088
009600 01  PV-PROGRAM-VARIABLES.                                        POKCS088
009700     05  PV-SUB                         PIC S9(04)  VALUE +0      POKCS088
009800                                                    COMP SYNC.    POKCS088
009900     05  PV-REMAINDER                   PIC S9(04)  VALUE +0      POKCS088
010000                                                    COMP SYNC.    POKCS088
010100     05  PV-READ-COUNT                  PIC S9(09)  VALUE +0      POKCS088
010200                                                    COMP-3.       POKCS088
010300     05  PV-ITEMS-PROCESSED             PIC S9(09)  VALUE +0      POKCS088
010400                                                    COMP-3.       POKCS088
010500     05  PV-HOLD-SELECTED-ITEMS         PIC S9(09)  VALUE +0      POKCS088
010600                                                    COMP-3.       POKCS088
010700     05  PV-ITEM-IN-USE                 PIC S9(09)  VALUE +0      POKCS088
010800                                                    COMP-3.       POKCS088
010900     05  PV-TOP-ITEM                    PIC S9(09)  VALUE +0      POKCS088
011000                                                    COMP-3.       POKCS088
011100     05  PV-BOTTOM-ITEM                 PIC S9(09)  VALUE +0      POKCS088
011200                                                    COMP-3.       POKCS088
011300     05  PV-TEMP-BLOCK-NUMBER           PIC S9(09)  VALUE +0      POKCS088
011400                                                    COMP-3.       POKCS088
011500     05  PV-BLOCK-NUMBER                PIC S9(04)  VALUE +0      POKCS088
011600                                                    COMP SYNC.    POKCS088
011700     05  PV-CICS-RESP                   PIC S9(04)  VALUE +0      POKCS088
011800                                                    COMP SYNC.    POKCS088
011900     05  PV-ITEM                        PIC S9(04)  VALUE +0      POKCS088
012000                                                    COMP SYNC.    POKCS088
012100     05  PV-SEL-QUEUE-ITEM              PIC S9(04)  VALUE +0      POKCS088
012200                                                    COMP SYNC.    POKCS088
012300     05  PV-SAVE-ITEM                   PIC S9(04)  VALUE +0      POKCS088
012400                                                    COMP SYNC.    POKCS088
012500     05  PV-HIGHEST-BLOCK-WRITTEN       PIC S9(04)  VALUE +0      POKCS088
012600                                                    COMP SYNC.    POKCS088
012700     05  PV-LIST-ITEM-NUMBER            PIC S9(04)  VALUE +0      POKCS088
012800                                                    COMP SYNC.    POKCS088
012900     05  PV-FIRST-BLOCK-IN-ARRAY        PIC S9(04)  VALUE +0      POKCS088
013000                                                    COMP SYNC.    POKCS088
013100     05  PV-NEXT-BLOCK-IN-ARRAY         PIC S9(04)  VALUE +0      POKCS088
013200                                                    COMP SYNC.    POKCS088
013300     05  PV-PREV-BLOCK-IN-ARRAY         PIC S9(04)  VALUE +0      POKCS088
013400                                                    COMP SYNC.    POKCS088
013500     05  PV-FIRST-BLOCK-IN-RANGE        PIC S9(04)  VALUE +0      POKCS088
013600                                                    COMP SYNC.    POKCS088
013700     05  PV-LAST-BLOCK-IN-RANGE         PIC S9(04)  VALUE +0      POKCS088
013800                                                    COMP SYNC.    POKCS088
013900     05  PV-START-OF-SELECTED-RANGE     PIC S9(04)  VALUE +0      POKCS088
014000                                                    COMP SYNC.    POKCS088
014100     05  PV-END-OF-SELECTED-RANGE       PIC S9(04)  VALUE +0      POKCS088
014200                                                    COMP SYNC.    POKCS088
014300     05  PV-SQL-SUB                     PIC S9(04)  VALUE +0      POKCS088
014400                                                    COMP SYNC.    POKCS088
014500     05  PV-RETRY-COUNTER               PIC S9(04)  VALUE +0      POKCS088
014600                                                    COMP SYNC.    POKCS088
014700******************************************************************POKCS088
014800**  THIS IS THE LAYOUT FOR THE LIST ITEMS TEMP STORAGE QUEUE.   **POKCS088
014900**  THIS MUST BE THE EXACT SAME FORMAT A BLOCK IN THE           **POKCS088
015000**  APPLICATION-SPECIFIC COMMAREA.                              **POKCS088
015100******************************************************************POKCS088
015200 01  LQW-LIST-QUEUE-WORK-AREA.                                    POKCS088
015300     05  LQW-BLOCK-MODIFIED             PIC  X(01)  VALUE SPACE.  POKCS088
015400     05  LQW-ITEM-ENTRIES               OCCURS 12 TIMES           POKCS088
015500                                        INDEXED BY LQW-IDX.       POKCS088
015600         10  LQW-LIST-ITEM-NUMBER       PIC S9(09)  COMP-3.       POKCS088
015700         10  LQW-TEMP-SELECTED-SW       PIC  X(01).               POKCS088
015800         10  LQW-SELECTED-SW            PIC  X(01).               POKCS088
015900             88  LQW-SELECT                         VALUE 'S'.    POKCS088
016000             88  LQW-DESELECT                       VALUE ' '.    POKCS088
016200         10  LQW-REQ-RSN-CDE            PIC  X(01).                     88
016210         10  LQW-REQ-REASN-DESC         PIC  X(50).                     *2
016700                                                                  POKCS088
016800*---------------------------------------------------------------* POKCS088
016900*  RECORD LAYOUT FOR THE PRETICKET SELECTION TEMP STORAGE QUEUE.* POKCS088
017000*---------------------------------------------------------------* POKCS088
017100     COPY VLWS008.                                                   CL*13
017200                                                                  POKCS088
017300*---------------------------------------------------------------* POKCS088
017400*    MAP LAYOUT                                                 * POKCS088
017500*---------------------------------------------------------------* POKCS088
017600     COPY VLKM588.                                                POKCS088
017700                                                                  POKCS088
017800 01  MR-OCCURS-LAYOUT                   REDEFINES  VL588AO.       POKCS088
017900     05  FILLER                         PIC X(55).                POKCS088
018000     05  MR-SCROLL-AREA                 OCCURS 12 TIMES.          POKCS088
018100         10  MR-SELECTL                 PIC S9(04) COMP.          POKCS088
018200         10  MR-SELECTA                 PIC  X(01).               POKCS088
018300         10  MR-SELECTC                 PIC  X(01).               POKCS088
018400         10  MR-SELECTH                 PIC  X(01).               POKCS088
018500         10  MR-SELECTI                 PIC  X(01).               POKCS088
018600                                                                  POKCS088
018700         10  MR-RSNL                    PIC S9(04) COMP.          POKCS088
018800         10  MR-RSNA                    PIC  X(01).               POKCS088
018900         10  MR-RSNC                    PIC  X(01).               POKCS088
019000         10  MR-RSNH                    PIC  X(01).               POKCS088
019100         10  MR-RSN                     PIC  X(01).               POKCS088
019200                                                                  POKCS088
019300         10  MR-DESC-L                  PIC S9(04) COMP.             CL**2
019400         10  MR-DESC-A                  PIC  X(01).                  CL**2
019500         10  MR-DESC-C                  PIC  X(01).                  CL**2
019600         10  MR-DESC-H                  PIC  X(01).                  CL**2
019700         10  MR-DESC                    PIC  X(50).                  CL**2
019800                                                                     CL**2
020400                                                                  POKCS088
021600                                                                  POKCS088
021700*---------------------------------------------------------------* POKCS088
021800*    ATTRIBUTE SETTINGS COPYBOOK.                               * POKCS088
021900*---------------------------------------------------------------* POKCS088
022000     COPY DPWS015.                                                POKCS088
022100                                                                  POKCS088
022200*---------------------------------------------------------------* POKCS088
022300*    FUNCTION KEYS COPYBOOK.                                    * POKCS088
022400*---------------------------------------------------------------* POKCS088
022500     COPY DPWS016.                                                POKCS088
022600                                                                  POKCS088
022700*---------------------------------------------------------------* POKCS088
022800*    NUMERIC EDIT LAYOUT.                                       * POKCS088
022900*---------------------------------------------------------------* POKCS088
023000     COPY DPWS010I.                                               POKCS088
023100                                                                  POKCS088
023200*---------------------------------------------------------------* POKCS088
023300*    PARAMETERS FOR CALLING THE CICS ARCHITECTURE API.          * POKCS088
023400*---------------------------------------------------------------* POKCS088
023500     COPY DPWS030.                                                POKCS088
CICS       COPY DPWS930.                                                POKCS088
023600                                                                  POKCS088
023700*---------------------------------------------------------------* POKCS088
023800*    STANDARD COMMAREA.                                         * POKCS088
023900*---------------------------------------------------------------* POKCS088
024000     COPY DPWS020.                                                POKCS088
024100     05  FILLER REDEFINES DP020-VARIABLE-COMMAREA.                POKCS088
024200*---------------------------------------------------------------* POKCS088
024300* INTER-APPLICATION COMMAREA.                                   * POKCS088
024400*   VLWS005 - INPUT FROM PO PRETICKET REQUEST                   * POKCS088
024600*---------------------------------------------------------------* POKCS088
024700         10  INTER-APPL-COMM-AREA       PIC X(200).               POKCS088
024800     COPY VLWS005.                                                   CL*13
025000*---------------------------------------------------------------* POKCS088
025100*  THIS IS THE APPLICATION-SPECIFIC COMMAREA.                   * POKCS088
025200*---------------------------------------------------------------* POKCS088
025300         10  ASC-SPECIFIC-COMMAREA.                               POKCS088
025412             15  ASC-PO-NUMBER                       PIC S9(09)   POKCS088
025413                                                     COMP.                
025414             15  ASC-KEY-RSN-CDE                     PIC X(01).         *1
025800             15  ASC-BLOCK-ENTRIES OCCURS 2 TIMES.                POKCS088
025900                 20  ASC-BLOCK-MODIFIED-SW           PIC  X(01).  POKCS088
026000                     88  ASC-BLOCK-NOT-MODIFIED      VALUE 'N'.   POKCS088
026100                     88  ASC-BLOCK-MODIFIED          VALUE 'Y'.   POKCS088
026200                                                                  POKCS088
026300                 20  ASC-ITEM-ARRAY.                              POKCS088
026400                     25  ASC-ITEM-ENTRIES OCCURS 12 TIMES.        POKCS088
026500                         30  ASC-LIST-ITEM-NUMBER                 POKCS088
026600                                                     PIC S9(09)   POKCS088
026700                                                     COMP-3.      POKCS088
026800                         30  ASC-TEMP-SELECTED-SW    PIC  X(01).  POKCS088
026900                             88  ASC-VALID-SELECT    VALUE ' '    POKCS088
027000                                                           'S'    POKCS088
027100                                                           'B'    POKCS088
027200                                                           'E'.   POKCS088
027300                             88  ASC-TEMP-NO-SELECT  VALUE ' '.   POKCS088
027400                             88  ASC-TEMP-SELECT     VALUE 'S'.   POKCS088
027500                             88  ASC-TEMP-BEGIN      VALUE 'B'.   POKCS088
027600                             88  ASC-TEMP-END        VALUE 'E'.   POKCS088
027700                         30  ASC-SELECTED-SW         PIC  X(01).  POKCS088
027800                             88  ASC-NO-SELECT       VALUE ' '.   POKCS088
027900                             88  ASC-SELECT          VALUE 'S'.   POKCS088
028000                             88  ASC-BEGIN           VALUE 'B'.   POKCS088
028100                             88  ASC-END             VALUE 'E'.   POKCS088
028200                         30  ASC-REQ-RSN-CDE         PIC  X(01).  POKCS088
028400                         30  ASC-REQ-RSN-DESC        PIC  X(50).     CL**2
028900                                                                        84
029000             15  ASC-BLK-SUB                         PIC S9(04)   POKCS088
029100                                                          COMP    POKCS088
029200                                                          SYNC.   POKCS088
029300             15  ASC-ITEM-SUB                        PIC S9(04)   POKCS088
029400                                                          COMP    POKCS088
029500                                                          SYNC.   POKCS088
029501             15  ASC-SEL-SUB                         PIC S9(04)      CL**1
029502                                                         COMP.       CL**1
029503             15  ASC-SEL-ITEM                        PIC S9(04)      CL**1
029510                                                         COMP.       CL**1
029600             15  ASC-NUMBER-OF-ITEMS-READ            PIC S9(09)   POKCS088
029700                                                          COMP-3. POKCS088
029710             15  ASC-NUMBER-OF-TS-ITEMS              PIC S9(09)   POKCS088
029720                                                          COMP-3. POKCS088
029800             15  ASC-NUMBER-OF-SELECTED-ITEMS        PIC S9(09)   POKCS088
029900                                                          COMP-3. POKCS088
030000             15  ASC-ITEMS-DISPLAYED                 PIC S9(03)   POKCS088
030100                                                          COMP-3. POKCS088
030200             15  ASC-ITEM-AT-TOP-OF-PANEL            PIC S9(09)   POKCS088
030300                                                          COMP-3. POKCS088
030400             15  ASC-ITEM-AT-BOT-OF-PANEL            PIC S9(09)   POKCS088
030500                                                          COMP-3. POKCS088
030600             15  ASC-HIGHEST-BLOCK-WRITTEN           PIC S9(04)   POKCS088
030700                                                          COMP    POKCS088
030800                                                          SYNC.   POKCS088
030900             15  ASC-START-OF-SELECTED-RANGE         PIC S9(09)   POKCS088
031000                                                          COMP-3. POKCS088
031100             15  ASC-END-OF-SELECTED-RANGE           PIC S9(09)   POKCS088
031200                                                          COMP-3. POKCS088
031300             15  ASC-ITEMS-LEFT-INDICATOR            PIC  X(01).  POKCS088
031400                 88  ASC-ITEMS-LEFT-ON-DB            VALUE 'Y'.   POKCS088
031500                 88  ASC-NO-ITEMS-LEFT-ON-DB         VALUE 'N'.   POKCS088
031600             15  ASC-TEMP-QUEUE-UPDATE-SW            PIC  X(01).  POKCS088
031700                 88  ASC-UPDATE-TSQ                  VALUE 'Y'.   POKCS088
031800                 88  ASC-NO-TSQ-UPDATE               VALUE ' '.   POKCS088
031900             15  ASC-LIST-QUEUE-NAME.                             POKCS088
032000                 20  ASC-LIST-TERM-ID                PIC  X(04).  POKCS088
032100                 20  ASC-LIST-TASK-NUMBER            PIC S9(05)   POKCS088
032200                                                          COMP-3. POKCS088
032300                 20  ASC-LIST-SEQ                    PIC  9(01).  POKCS088
032400             15  ASC-SEL-QUEUE-NAME.                              POKCS088
032500                 20  ASC-SEL-TERM-ID                 PIC  X(04).  POKCS088
032600                 20  ASC-SEL-TASK-NUMBER             PIC S9(05)   POKCS088
032700                                                          COMP-3. POKCS088
032800                 20  ASC-SEL-SEQ                     PIC  9(01).  POKCS088
032900                                                                  POKCS088
033000             15  ASC-START-ITEM-REQUEST.                          POKCS088
033100                 20  ASC-START-ITEM-REQUEST-N        PIC  9(07).  POKCS088
033210             15  ASC-HOLD-INTER-APPL                 PIC X(200).          
033300                                                                  POKCS088
033400*---------------------------------------------------------------* POKCS088
033500*    ABEND PROCESSING COPYBOOK.                                 * POKCS088
033600*---------------------------------------------------------------* POKCS088
033700     COPY DPWS013.                                                POKCS088
033800                                                                  POKCS088
033801 EJECT                                                                    
033802*---------------------------------------------------------------*         
033803*    DB2 AREA FOR THE PRETICKET REQUEST REASON CODE DESCRIPTION *         
033804*    TABLE                                                      *         
033805*---------------------------------------------------------------*         
033806     EXEC SQL                                                             
033810          INCLUDE TPTRDSC                                                 
033900     END-EXEC.                                                            
034000 EJECT                                                                    
034100*---------------------------------------------------------------*         
034200*    DB2 AREA FOR THE PRETICKET REASON CODE ASSOCIATION         *         
034300*    TABLE                                                      *         
034400*---------------------------------------------------------------*         
034500     EXEC SQL                                                             
034600          INCLUDE TPTKRSN                                                 
034700     END-EXEC.                                                            
035200                                                                  POKCS088
035300*---------------------------------------------------------------* POKCS088
035400*    DB2 AREA FOR COMMUNICATIONS                                * POKCS088
035500*---------------------------------------------------------------* POKCS088
035600     EXEC SQL                                                     POKCS088
035700          INCLUDE SQLCA                                           POKCS088
035800     END-EXEC.                                                    POKCS088
035900                                                                  POKCS088
036000*---------------------------------------------------------------* POKCS088
036100*    VENDOR CURSOR WHEN VENDOR NAME IS ENTERED                  * POKCS088
036200*---------------------------------------------------------------* POKCS088
036300     EXEC SQL                                                     POKCS088
036400          DECLARE RSNDSC_CSR CURSOR FOR                                 88
036500           SELECT REQ_RSN_CDE                                           *2
036510                 ,REQ_RSN_DESC                                          *2
037100             FROM TPTRDSC                                               *2
037600         ORDER BY REQ_RSN_CDE                                           *2
037800     END-EXEC.                                                    POKCS088
037900                                                                  POKCS088
038000 LINKAGE SECTION.                                                 POKCS088
038100                                                                  POKCS088
038200 01  DFHCOMMAREA.                                                 POKCS088
038300     05  FILLER                         OCCURS  1 TO 4072 TIMES   POKCS088
038400                                        DEPENDING ON EIBCALEN.    POKCS088
038500         10  FILLER                     PIC X.                    POKCS088
038600                                                                  POKCS088
038700 PROCEDURE DIVISION.                                              POKCS088
038800                                                                     CL**6
038900     INITIALIZE DP030-CICS-API-FIELDS.                            POKCS088
039000     MOVE +1                       TO DP030-NUMBER-OF-MAPS.       POKCS088
039100     MOVE PC-CURRENT-MAPSET-NAME   TO DP030-MAPSET-NAME.          POKCS088
039200     MOVE PC-CURRENT-MAP-NAME      TO DP030-MAP-NAME (1).         POKCS088
039300     SET DP030-RECEIVE-APPL-MAP    TO TRUE.                       POKCS088
039400     MOVE LENGTH OF VL588AI        TO DP030-MAP-LENGTH (1).       POKCS088
039500     MOVE 'PROGRAM ENTRY CALL'     TO DP013-MESSAGE-TEXT (1).     POKCS088
039600                                                                     CL**6
039700     PERFORM 0001-CALL-CICS-ARCH-API.                             POKCS088
039800                                                                  POKCS088
039900     PERFORM 1000-CONTROL-PROCESSING                              POKCS088
040000                                                                  POKCS088
040100     MOVE 'PROGRAM EXIT CALL'      TO DP013-MESSAGE-TEXT (1).     POKCS088
040200                                                                     CL**6
040300     PERFORM 0001-CALL-CICS-ARCH-API.                             POKCS088
040400                                                                  POKCS088
040500******************************************************************POKCS088
040600**  THIS PARAGRAPH CALLS THE CICS ARCHITECTURE API SUBROUTINE   **POKCS088
040700**  AND WILL ABEND IF ANY ERRORS OCCURRED IN THAT CALL.         **POKCS088
040800******************************************************************POKCS088
040900 0001-CALL-CICS-ARCH-API.                                         POKCS088
041000                                                                  POKCS088
CICS       CALL DP930-CICS-ARCH-API USING DFHEIBLK                              
041200                                    DFHCOMMAREA                           
041300                                    DP030-CICS-API-FIELDS                 
041400                                    DP020-STANDARD-COMMAREA               
041500                                    VL588AI.                              
041600                                                                  POKCS088
041700     IF DP030-RC-CALL-SUCCESSFUL                                     CL**6
041800         CONTINUE                                                 POKCS088
041900     ELSE                                                         POKCS088
042000         SET DP013-NO-ROLLBACK                                    POKCS088
042100             DP013-XCTL-DISPLAY-RESTART                           POKCS088
042200             DP013-CICS-ABEND      TO TRUE                        POKCS088
042300         MOVE '0001-CALL-CICS-ARCH-API'                           POKCS088
042400                                   TO DP013-PARAGRAPH             POKCS088
CICS           MOVE 'CALL TO CICS ARCH API NOT SUCCESSFUL, RETURN-CODE O        
CICS  -             'N NEXT LINE'        TO DP013-MESSAGE-TEXT (2)              
042700         MOVE DP030-RETURN-CODE    TO DP013-MESSAGE-TEXT (3)      POKCS088
042800         PERFORM DP013-0000-PROCESS-ABEND.                        POKCS088
042900                                                                  POKCS088
043000*----------------------------------------------------------------*POKCS088
043100* PROCESS THE APPROPRIATE PARAGRAPHS BASED ON WHAT THE NEXT      *POKCS088
043200* COURSE OF ACTION IS FOR THIS TRANSACTION.                      *POKCS088
043300*----------------------------------------------------------------*POKCS088
043400 1000-CONTROL-PROCESSING.                                         POKCS088
043500                                                                  POKCS088
043600     EVALUATE TRUE                                                POKCS088
043700         WHEN DP020-NEXT-ACT-INITIAL                              POKCS088
043800             INITIALIZE ASC-SPECIFIC-COMMAREA                     POKCS088
043900             MOVE EIBTRMID              TO ASC-LIST-TERM-ID          CL**6
044000                                           ASC-SEL-TERM-ID           CL**6
044100             MOVE DP020-SRC-TASK-NUMBER TO ASC-LIST-TASK-NUMBER      CL**6
044200                                           ASC-SEL-TASK-NUMBER       CL**6
044300             MOVE PC-LIST-QUEUE-SEQ     TO ASC-LIST-SEQ              CL**6
044400             MOVE PC-SEL-QUEUE-SEQ      TO ASC-SEL-SEQ               CL**6
044500                                                                     CL**6
044600             PERFORM 1100-PROCESS-INTER-APPL-COMM                 POKCS088
044700             MOVE VL005-PO-NUMBER TO ASC-PO-NUMBER                   CL**6
044710             MOVE VL005-PO-REQ-NBR TO DK-PO-REQ-NBR                  CL**6
044800             PERFORM 4000-BUILD-INITIAL-PANEL                           88
044801*            IF  VL005-NUMBER-OF-RSN-CODES NOT NUMERIC                  *8
044802*                MOVE ZEROES TO VL005-NUMBER-OF-RSN-CODES                 
044803*            END-IF                                                       
044804*            IF ASC-NUMBER-OF-SELECTED-ITEMS > ZERO                       
044810*                MOVE ASC-ITEM-AT-TOP-OF-PANEL                            
044820*                                      TO PV-TOP-ITEM                     
044830*                MOVE ZERO      TO ASC-ITEM-AT-TOP-OF-PANEL               
044832*                IF VL005-NUMBER-OF-RSN-CODES  > 0                        
044833*                    SET ASC-UPDATE-TSQ        TO  TRUE                 88
044834*                END-IF                                                   
044835*                PERFORM 2050-DELETE-LIST-QUEUE                      RC K0
044840*                PERFORM 6000-REFRESH-PANEL-FROM-TEMP                   00
044841*                PERFORM 3000-EDIT-DATA-IN-COMMAREA                     88
044842*                PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                   00
044843*                IF PS-RSN-SEL-FOUND                                    *1
044844*                   PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                00
044845*                END-IF                                                   
044850*            END-IF                                                       
044900                                                                  POKCS088
045000         WHEN DP020-NEXT-ACT-READ-MAP                             POKCS088
045100             MOVE ASC-ITEM-AT-TOP-OF-PANEL TO PV-TOP-ITEM            CL**6
045200                                                                     CL**6
045300             PERFORM 2000-PROCESS-PANEL                           POKCS088
045400                                                                  POKCS088
045501         WHEN DP020-NEXT-ACT-RETURN                                       
045502*           IF (VL005-DEL OR                                              
045503*                VL005-ADD)                                               
045505*               MOVE ASC-ITEM-AT-TOP-OF-PANEL                       RCK000
045506*                                    TO PV-TOP-ITEM                 RCK000
045507*               MOVE ZERO          TO ASC-ITEM-AT-TOP-OF-PANEL            
045508*               PERFORM 2050-DELETE-LIST-QUEUE                      RCK000
045509*               PERFORM 4000-BUILD-INITIAL-PANEL                    RCK000
045510*           ELSE                                                          
045511*               MOVE VL005-NUMBER-OF-RSN-TS-ITEMS                         
045512*                                  TO PV-HOLD-SELECTED-ITEMS      RCK00050
045513*               MOVE ASC-HOLD-INTER-APPL                                  
045514*                                TO INTER-APPL-COMM-AREA                  
045515*               PERFORM 2050-DELETE-LIST-QUEUE                      RCK000
045516*               PERFORM 4000-BUILD-INITIAL-PANEL                    RCK000
045517*               PERFORM 3200-RESET-ATTRIBUTES                       RCK000
045518*               MOVE ASC-ITEM-AT-TOP-OF-PANEL                       RCK000
045519*                                    TO PV-TOP-ITEM                 RCK000
045520*               MOVE ZERO          TO ASC-ITEM-AT-TOP-OF-PANEL            
045521                MOVE ASC-ITEM-AT-TOP-OF-PANEL                             
045522                                       TO PV-TOP-ITEM                     
045523                MOVE ZERO      TO ASC-ITEM-AT-TOP-OF-PANEL                
045524                PERFORM 6000-REFRESH-PANEL-FROM-TEMP                RCK000
045525*               PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                RCK000
045526*               PERFORM 3000-EDIT-DATA-IN-COMMAREA                      88
045527*         END-IF                                                          
045528*             PERFORM 3200-RESET-ATTRIBUTES                       RCK00050
045529*             PERFORM 2050-DELETE-LIST-QUEUE                      RCK00050
045530*             THIS PROGRAM REQUIRES THAT ANY ADDED OR CHANGED             
045531*             INFORMATION BE DISPLAYED UPON RETURN TO THIS                
045532*             PROGRAM.  THEREFORE THE LIST QUEUE IS REBUILT.              
045533                                                                          
045534*             PERFORM 2050-DELETE-LIST-QUEUE                              
045535*             PERFORM 6000-REFRESH-PANEL-FROM-TEMP                      84
045540*             PERFORM 4000-BUILD-INITIAL-PANEL                            
045600*            MOVE ASC-ITEM-AT-TOP-OF-PANEL TO PV-TOP-ITEM            CL**6
045700*            MOVE ZERO TO ASC-ITEM-AT-TOP-OF-PANEL                   CL**6
045800                                                                     CL**6
045900*            PERFORM 6000-REFRESH-PANEL-FROM-TEMP                 POKCS088
046000                                                                     CL**6
046100*            PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 POKCS088
046200                                                                     CL**6
046300*            PERFORM 3000-EDIT-DATA-IN-COMMAREA                   POKCS088
046400                                                                  POKCS088
046500         WHEN OTHER                                               POKCS088
046600             SET DP013-LOGIC-ABEND                                   CL**6
046700                 DP013-NO-ROLLBACK TO TRUE                           CL**6
046800             MOVE '1000-CONTROL-PROCESSING' TO DP013-PARAGRAPH       CL**6
046900             MOVE 'INVALID NEXT APPLICATION ACTIVITY RECEIVED'    POKCS088
047000                                          TO DP013-MESSAGE-TEXT(1)   CL**6
047100             PERFORM DP013-0000-PROCESS-ABEND                     POKCS088
047200     END-EVALUATE.                                                POKCS088
047300                                                                  POKCS088
047400*----------------------------------------------------------------*POKCS088
047500* DETERMINE IF DATA WAS PASSED THROUGH INTER-APPL COMMAREA OR    *POKCS088
047600* IF THERE IS DATA TO BE USED IN THE NAV-KEY FIELD.              *POKCS088
047700*----------------------------------------------------------------*POKCS088
047800 1100-PROCESS-INTER-APPL-COMM.                                    POKCS088
047900                                                                  POKCS088
047901     SET PS-COMMAREA-VALID     TO TRUE.                              CL**1
047903     MOVE SPACE                TO ASC-START-ITEM-REQUEST.            CL**1
047904     EVALUATE DP020-INT-APPL-FORMAT-IND                              CL**1
047905*        WHEN PC-CRIT-SPEC-FORMAT                                    CL**1
047906*            IF DP071-MESSAGE-NUMBER > ZERO                          CL**1
047907*                MOVE DP071-MESSAGE-NUMBER                           CL**1
047908*                              TO ASC-KEY-MESSAGE-NUMBER             CL**1
047909*                                 PV-DB2-MESSAGE-NUMBER              CL**1
047910*            ELSE                                                    CL**1
047911*                MOVE PC-TSYMSG-00148                                CL**1
047912*                              TO DP020-MSG-NUMBER                   CL**1
047913*                SET DP020-MSG-FATAL TO TRUE                         CL**1
047914*                SET DP020-NEXT-ACT-APPL-ERROR TO TRUE               CL**1
047915*            END-IF                                                  CL**1
047916         WHEN PC-LIST-FORMAT                                         CL**1
047917*            SET ASC-USE-SELECTION-QUEUE TO TRUE                     CL**1
047918             MOVE VL005-NUMBER-OF-RSN-TS-ITEMS                          *1
047919                               TO ASC-NUMBER-OF-TS-ITEMS             CL**1
047920             MOVE VL005-RSN-QUEUE-NAME                               CL**1
047921                               TO ASC-SEL-QUEUE-NAME                 CL**1
047922             PERFORM 1120-PREPARE-LIST-ENTRY                         CL**1
047923         WHEN OTHER                                                  CL**1
047924             CONTINUE                                                     
047925*            IF  DP020-NAV-KEY-DATA > SPACE                          CL**1
047926*                PERFORM 1110-EDIT-NAV-KEY                           CL**1
047927*            ELSE                                                    CL**1
047928*                MOVE PC-TSYMSG-00148                                CL**1
047929*                              TO DP020-MSG-NUMBER                   CL**1
047930*                SET DP020-MSG-FATAL TO TRUE                         CL**1
047931*                SET DP020-NEXT-ACT-APPL-ERROR TO TRUE               CL**1
047932*            END-IF                                                  CL**1
047940     END-EVALUATE.                                                   CL**1
049301                                                                     CL**1
049302*----------------------------------------------------------------*   CL**1
049303*    EDIT THE KEY ENTERED BY THE USER INTO THE KEY FIELD OF THE  *   CL**1
049304*    COMMAND LINE.  A VALID MESSAGE NUMBER IS THE ONLY KEY       *   CL**1
049305*    ACCEPTED.                                                   *   CL**1
049306*----------------------------------------------------------------*   CL**1
049307                                                                     CL**1
049308*1110-EDIT-NAV-KEY.                                                  CL**1
049309                                                                     CL**1
049310*    MOVE DP020-NAV-KEY-DATA TO DP010I-UNEDITED-FIELD.               CL**1
049311*    MOVE PC-MSG-NUMBER-LENGTH     TO DP010I-MAXIMUM-DIGITS.         CL**1
049312*    MOVE ZERO                TO DP010I-MAXIMUM-DECIMALS.            CL**1
049313*    SET DP010I-NEGATIVE-NOT-ALLOWED TO TRUE.                        CL**1
263627*    CALL DP010I-NUMERIC-EDIT-ROUTINE                                     
263627*         USING DP010I-NUMERIC-EDIT-AREA.                                 
049315*    IF  DP010I-ERROR-DETECTED                                       CL**1
049316*        SET PS-ERROR TO TRUE                                        CL**1
049317*        SET DP020-MSG-FATAL TO TRUE                                 CL**1
049318*        MOVE PC-TSYMSG-00302 TO DP020-MSG-NUMBER                    CL**1
049319*        SET DP020-NEXT-ACT-APPL-ERROR TO TRUE                       CL**1
049320*    ELSE                                                            CL**1
049321*        MOVE DP010I-NUMERIC-FIELD   TO ASC-KEY-MESSAGE-NUMBER       CL**1
049322*                                       PV-DB2-MESSAGE-NUMBER        CL**1
049323*    END-IF.                                                         CL**1
049324                                                                     CL**1
049325                                                                     CL**1
049326 1120-PREPARE-LIST-ENTRY.                                            CL**1
049327                                                                     CL**1
049328     MOVE VL008-MAX-ITEMS TO ASC-SEL-SUB.                            CL**1
049330     MOVE +1              TO ASC-SEL-ITEM.                           CL**1
049331     PERFORM 9100-READ-SEL-QUEUE.                                         
049332     IF PV-CICS-RESP = 0                                                  
049333         SET PS-RSN-SEL-FOUND TO TRUE                                   *1
049334         MOVE  VL005-NUMBER-OF-RSN-CODES                                *8
049336                  TO ASC-NUMBER-OF-SELECTED-ITEMS                         
049337     ELSE                                                                 
049338         SET PS-NO-RSN-SEL-FOUND TO TRUE                                *1
049339         MOVE 0 TO VL005-NUMBER-OF-RSN-CODES                            *8
049340         MOVE 0 TO ASC-NUMBER-OF-SELECTED-ITEMS                           
049341         PERFORM 9200-WRITE-SEL-QUEUE                                   *1
049350     END-IF.                                                              
049400                                                                  POKCS088
049500*----------------------------------------------------------------*POKCS088
049600* DO ANY PROCESSING FOR KEYS FOR WHICH NO EDITTING OF THE DATA   *POKCS088
049700* ON THE SCREEN NEEDS TO BE DONE.  IF ONE OF THOSE KEYS IS NOT   *POKCS088
049800* USED, EDIT THE DATA ON THE SCREEN AND GO ON TO CHECK THE REST  *POKCS088
049900* OF THE FUNCTION KEYS.  NOTE THAT WITH THE API, NO INVALID      *POKCS088
050000* FUNCTION KEYS CAN GET THIS FAR.                                *POKCS088
050100*----------------------------------------------------------------*POKCS088
050200 2000-PROCESS-PANEL.                                              POKCS088
050300                                                                  POKCS088
050400     EVALUATE TRUE                                                POKCS088
050500         WHEN DP020-SRC-AID = DP016-CLEAR                         POKCS088
050600              MOVE ZERO TO ASC-ITEM-AT-TOP-OF-PANEL                  CL**6
050700                                                                     CL**6
050800              PERFORM 3000-EDIT-DATA-IN-COMMAREA                     CL**6
050900                                                                     CL**6
051000              PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                   CL**6
051100                                                                  POKCS088
051200         WHEN DP020-FK-REFRESH (DP020-SRC-AID)                    POKCS088
051300              PERFORM 2050-DELETE-LIST-QUEUE                         CL**6
051400                                                                     CL**6
051500              PERFORM 4000-BUILD-INITIAL-PANEL                       CL**6
051600                                                                  POKCS088
051700         WHEN DP020-FK-DESELECT(DP020-SRC-AID)                    POKCS088
051800              PERFORM 2140-DESELECT-ALL-ITEMS                        CL**6
051900                                                                     CL**6
052000              PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                   CL**6
052100                                                                  POKCS088
052200         WHEN DP020-FK-SELECT-ALL(DP020-SRC-AID)                  POKCS088
052300              PERFORM 2150-SELECT-ALL-ITEMS                          CL**6
052400                                                                     CL**6
052500              PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                   CL**6
052600                                                                  POKCS088
052700         WHEN OTHER                                               POKCS088
052800              PERFORM 2200-MOVE-SCREEN-TO-COMMAREA                   CL**6
052900                                                                     CL**6
053000              PERFORM 3000-EDIT-DATA-IN-COMMAREA                     CL**6
053100                                                                     CL**6
053200              IF PS-NO-ERROR                                         CL**6
053300                  SET DP030-CONTINUE-GO TO TRUE                      CL**6
053400                                                                     CL**6
053500                  PERFORM 2100-CHECK-FUNCTION-KEY                    CL**6
053600              ELSE                                                   CL**6
053700                  SET DP030-OVERRIDE-GO TO TRUE                      CL**6
053800              END-IF                                                 CL**6
053900     END-EVALUATE.                                                POKCS088
054000                                                                  POKCS088
054100*----------------------------------------------------------------*POKCS088
054200*  DELETE THE LIST ITEMS TEMP STORAGE QUEUE.                     *POKCS088
054300*----------------------------------------------------------------*POKCS088
054400 2050-DELETE-LIST-QUEUE.                                          POKCS088
054500                                                                  POKCS088
054600     EXEC CICS                                                    POKCS088
054700         DELETEQ TS                                               POKCS088
054800             QUEUE (ASC-LIST-QUEUE-NAME)                          POKCS088
054900             RESP  (PV-CICS-RESP)                                 POKCS088
055000     END-EXEC.                                                    POKCS088
055100                                                                  POKCS088
055200     IF (PV-CICS-RESP = DFHRESP(NORMAL)) OR                       POKCS088
055300        (PV-CICS-RESP = DFHRESP(QIDERR))                          POKCS088
055400         CONTINUE                                                 POKCS088
055500     ELSE                                                         POKCS088
055600         SET DP013-CICS-ABEND                                        CL**6
055700             DP013-NO-ROLLBACK TO TRUE                               CL**6
055800                                                                  POKCS088
055900         MOVE '2050-DELETE-LIST-QUEUE'                            POKCS088
056000                                   TO DP013-PARAGRAPH             POKCS088
056100         MOVE 'ERROR TRYING TO DELETE LIST TEMP STORAGE QUEUE'    POKCS088
056200                                   TO DP013-MESSAGE-TEXT (1)      POKCS088
056300         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
056400     END-IF.                                                      POKCS088
056500                                                                  POKCS088
056600     MOVE +0                       TO ASC-HIGHEST-BLOCK-WRITTEN.  POKCS088
056700                                                                  POKCS088
056800*----------------------------------------------------------------*POKCS088
056900* ACT ON ANY FUNCTION KEYS THAT REQUIRE EDITS TO BE PASSED FIRST.*POKCS088
057000* NOTE THAT INVALID FUNCTION KEYS WILL NOT BE RETURNED FROM THE  *POKCS088
057100* CICS ARCHITECTURE API.                                         *POKCS088
057200*----------------------------------------------------------------*POKCS088
057300 2100-CHECK-FUNCTION-KEY.                                         POKCS088
057400                                                                  POKCS088
057500     EVALUATE TRUE                                                POKCS088
057510* REQUEST ADD KEY WAS PRESSED                                             
057520*        WHEN DP020-FK-LOCAL-FUNC-01(DP020-SRC-AID)                       
057521*             MOVE ZERO TO ASC-NUMBER-OF-SELECTED-ITEMS                   
057522*             IF ASC-NUMBER-OF-SELECTED-ITEMS > ZERO                 CL**6
057523*                 INITIALIZE VL005-INTER-APPL-COMMAREA               CL**6
057524*                 MOVE ASC-NUMBER-OF-SELECTED-ITEMS                     *6
057525*                               TO VL005-NUMBER-OF-SELECTED-ITEMS POKCS088
057526*                 PERFORM 5000-PREPARE-SEL-QUEUE                     CL**6
057527*                 SET VL005-ADD TO TRUE                                   
057528* REQUEST INCLUDE KEY WAS PRESSED                                         
057529*        WHEN DP020-FK-LOCAL-FUNC-04(DP020-SRC-AID)                       
057530*             MOVE ZERO TO ASC-NUMBER-OF-SELECTED-ITEMS                   
057531*             IF ASC-NUMBER-OF-SELECTED-ITEMS > ZERO                 CL**6
057532*                 INITIALIZE VL005-INTER-APPL-COMMAREA               CL**6
057533*                 MOVE ASC-NUMBER-OF-SELECTED-ITEMS                     *6
057534*                               TO VL005-NUMBER-OF-SELECTED-ITEMS POKCS088
057535*                 PERFORM 5000-PREPARE-SEL-QUEUE                     CL**6
057540* REQUEST UPDATE KEY WAS PRESSED                                          
057550* REQUEST DELETE KEY WAS PRESSED                                          
057600         WHEN DP020-FK-LOCAL-FUNC-02(DP020-SRC-AID)                     84
057610         WHEN DP020-FK-LOCAL-FUNC-03(DP020-SRC-AID)                     84
057700              IF ASC-NUMBER-OF-SELECTED-ITEMS > ZERO                 CL**6
057800                  INITIALIZE VL005-INTER-APPL-COMMAREA               CL**6
057900                  MOVE ASC-NUMBER-OF-SELECTED-ITEMS                  CL**6
058000                                TO VL005-NUMBER-OF-SELECTED-ITEMS POKCS088
058100                  PERFORM 5000-PREPARE-SEL-QUEUE                     CL**6
058200              ELSE                                                   CL**6
058300                  SET DP030-OVERRIDE-GO                              CL**6
058400                      DP020-MSG-WARNING TO TRUE                      CL**6
058500                  MOVE PC-TSYMSG-00057  TO DP020-MSG-NUMBER          CL**6
058600             END-IF                                               POKCS088
058700                                                                  POKCS088
058800         WHEN DP020-FK-FIRST-PAGE(DP020-SRC-AID)                  POKCS088
058900             MOVE +1               TO PV-TOP-ITEM                 POKCS088
059000                                                                     CL**6
059100             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 POKCS088
059200                                                                     CL**6
059300             PERFORM 3200-RESET-ATTRIBUTES                        POKCS088
059400                                                                  POKCS088
059500         WHEN DP020-FK-PREV-PAGE(DP020-SRC-AID)                   POKCS088
059600             PERFORM 2110-BROWSE-BACKWARD                         POKCS088
059700                                                                     CL**6
059800             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 POKCS088
059900                                                                     CL**6
060000             PERFORM 3200-RESET-ATTRIBUTES                        POKCS088
060100                                                                  POKCS088
060200         WHEN DP020-FK-NEXT-PAGE(DP020-SRC-AID)                   POKCS088
060300             PERFORM 2120-BROWSE-FORWARD                          POKCS088
060400                                                                     CL**6
060500             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 POKCS088
060600                                                                     CL**6
060700             PERFORM 3200-RESET-ATTRIBUTES                        POKCS088
060800                                                                  POKCS015
060810         WHEN DP020-FK-LOCAL-FUNC-01(DP020-SRC-AID)                       
060900*        WHEN DP020-FK-DISPN-RETURN(DP020-SRC-AID)                POKCS015
061400*            IF  ASC-NUMBER-OF-SELECTED-ITEMS > 0                 POKCS015
061800                 PERFORM 5000-PREPARE-SEL-QUEUE                   POKCS015
061900*            ELSE                                                 POKCS015
062000*                SET DP030-OVERRIDE-GO                            POKCS015
062100*                                  TO TRUE                        POKCS015
062200*                MOVE PC-TSYMSG-00047                             POKCS015
062300*                                  TO DP020-MSG-NUMBER            POKCS015
062400*                SET DP020-MSG-FATAL                              POKCS015
062500*                                  TO TRUE                        POKCS015
062600*            END-IF                                               POKCS015
062601                                                                  POKCS015
062602                                                                  POKCS088
062603         WHEN DP020-SRC-AID = DP016-ENTER                         POKCS088
062604*            PERFORM 2130-CHECK-FOR-JUMP-BROWSE                   POKCS088
062605                                                                     CL**6
062606             IF PS-ERROR                                             CL**6
062607                 CONTINUE                                         POKCS088
062608             ELSE                                                 POKCS088
062609                 PERFORM 4400-MOVE-COMMAREA-TO-SCREEN             POKCS088
062610             END-IF                                               POKCS088
062611                                                                  POKCS088
062612         WHEN OTHER                                               POKCS088
062613             SET DP013-NO-ROLLBACK                                POKCS088
062614                 DP013-XCTL-DISPLAY-RESTART                       POKCS088
062615                 DP013-CICS-ABEND  TO TRUE                        POKCS088
062616             MOVE '2100-CHECK-FUNCTION-KEY'                       POKCS088
062617                                   TO DP013-PARAGRAPH             POKCS088
062618             MOVE 'INVALID FUNCTION KEY NOT CAPTURED BY API'      POKCS088
062619                                   TO DP013-MESSAGE-TEXT (1)      POKCS088
062620             PERFORM DP013-0000-PROCESS-ABEND                     POKCS088
062700     END-EVALUATE.                                                POKCS088
062800                                                                  POKCS088
062900*----------------------------------------------------------------*POKCS088
063000*    IF THE USER HITS THE PAGE BACKWARD KEY, COMPUTE THE TOP     *POKCS088
063100*    ITEM NUMBER FOR THE NEW PAGE.  IF IT IS ABOVE THE TOP,      *POKCS088
063200*    SET THE TOP ITEM NUMBER TO +1 AND DISPLAY THE TOP OF LIST   *POKCS088
063300*    MESSAGE.                                                    *POKCS088
063400*----------------------------------------------------------------*POKCS088
063500 2110-BROWSE-BACKWARD.                                            POKCS088
063600                                                                  POKCS088
063700     SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-AT-TOP-OF-PANEL    POKCS088
063800         GIVING PV-TOP-ITEM.                                      POKCS088
063900                                                                  POKCS088
064000     IF  ((PV-TOP-ITEM < +1)                                      POKCS088
064100       OR (PV-TOP-ITEM = +1))                                     POKCS088
064200         MOVE +1                   TO PV-TOP-ITEM                 POKCS088
064300*        -- TOP OF LIST --                                        POKCS088
064400         MOVE PC-TSYMSG-00069      TO DP020-MSG-NUMBER            POKCS088
064500         SET DP020-MSG-INFORMATIONAL TO TRUE                      POKCS088
064600     END-IF.                                                      POKCS088
064700                                                                  POKCS088
064800*----------------------------------------------------------------*POKCS088
064900*    IF THE USER HITS THE PAGE FORWARD KEY, COMPUTE THE TOP      *POKCS088
065000*    ITEM NUMBER FOR THE NEW PAGE.  IF THE USER ATTEMPTS TO GO   *POKCS088
065100*    PAST THE END, ISSUE THE BOTTOM OF LIST MESSAGE.             *POKCS088
065200*----------------------------------------------------------------*POKCS088
065300 2120-BROWSE-FORWARD.                                             POKCS088
065400                                                                  POKCS088
065500     ADD PC-ITEMS-PER-PANEL ASC-ITEM-AT-TOP-OF-PANEL              POKCS088
065600         GIVING PV-TOP-ITEM.                                      POKCS088
065700     IF  PV-TOP-ITEM > ASC-NUMBER-OF-ITEMS-READ                   POKCS088
065800         MOVE ASC-ITEM-AT-TOP-OF-PANEL                            POKCS088
065900                                   TO PV-TOP-ITEM                 POKCS088
066000*        -- BOTTOM OF LIST --                                     POKCS088
066100         MOVE PC-TSYMSG-00070      TO DP020-MSG-NUMBER            POKCS088
066200         SET DP020-MSG-INFORMATIONAL                              POKCS088
066300                                   TO TRUE                        POKCS088
066400     ELSE                                                         POKCS088
066500         COMPUTE PV-BOTTOM-ITEM =                                 POKCS088
066600             PV-TOP-ITEM + PC-ITEMS-PER-PANEL - 1                 POKCS088
066700         IF  PV-BOTTOM-ITEM > ASC-NUMBER-OF-ITEMS-READ            POKCS088
066800*            -- BOTTOM OF LIST --                                 POKCS088
066900             MOVE PC-TSYMSG-00070  TO DP020-MSG-NUMBER            POKCS088
067000             SET DP020-MSG-INFORMATIONAL                          POKCS088
067100                                   TO TRUE                        POKCS088
067200         END-IF                                                   POKCS088
067300     END-IF.                                                      POKCS088
067400                                                                  POKCS088
067500*----------------------------------------------------------------*POKCS088
067600*    THE USER CAN CHANGE THE CURRENT BEGINNING LIST NUMBER SO    *POKCS088
067700*    THAT THE TRANSACTION WILL JUMP TO THAT POINT IN THE LIST.   *POKCS088
067800*    THIS IS A FASTER WAY TO GET TO A CERTAIN POINT IN THE LIST  *POKCS088
067900*    RATHER THAN HITTING NEXT-PAGE TO GET TO THAT POINT.         *POKCS088
068000*    THE NEW LIST NUMBER ENTERED IS EDITED TO MAKE SURE THAT     *POKCS088
068100*    IT IS NUMERIC AND FALLS BETWEEN A SPECIFIED RANGE.          *POKCS088
068200*----------------------------------------------------------------*POKCS088
068300 2130-CHECK-FOR-JUMP-BROWSE.                                      POKCS088
068400                                                                  POKCS088
068500     SET PS-NO-ERROR               TO TRUE.                       POKCS088
068600     IF (ASC-START-ITEM-REQUEST = SPACE)                          POKCS088
068700         MOVE ASC-ITEM-AT-TOP-OF-PANEL                            POKCS088
068800                                   TO PV-TOP-ITEM                 POKCS088
068900     ELSE                                                         POKCS088
069000         MOVE ASC-START-ITEM-REQUEST                              POKCS088
069100                                   TO DP010I-UNEDITED-FIELD       POKCS088
069200         MOVE PC-ITM-NUMBER-LENGTH TO DP010I-MAXIMUM-DIGITS       POKCS088
069300         MOVE +0                   TO DP010I-MAXIMUM-DECIMALS     POKCS088
069400         SET DP010I-NEGATIVE-NOT-ALLOWED                          POKCS088
069500                                   TO TRUE                        POKCS088
263627         CALL DP010I-NUMERIC-EDIT-ROUTINE                                 
263627              USING DP010I-NUMERIC-EDIT-AREA                              
069700                                                                  POKCS088
069800         IF  NOT DP010I-ERROR-DETECTED                            POKCS088
069900             MOVE DP010I-NUMERIC-FIELD                            POKCS088
070000                                   TO  ASC-START-ITEM-REQUEST-N   POKCS088
070100             IF  ASC-START-ITEM-REQUEST-N > ZERO                  POKCS088
070200                 IF  ASC-START-ITEM-REQUEST-N >                   POKCS088
070300                                          ASC-NUMBER-OF-ITEMS-READPOKCS088
070400                     MOVE SPACE TO ASC-START-ITEM-REQUEST         POKCS088
070500                     COMPUTE PV-TOP-ITEM =                        POKCS088
070600                             ASC-NUMBER-OF-ITEMS-READ             POKCS088
070700                             - PC-ITEMS-PER-PANEL + 1             POKCS088
070800                     IF  PV-TOP-ITEM < +1                         POKCS088
070900                         MOVE +1   TO PV-TOP-ITEM                 POKCS088
071000                         MOVE PC-TSYMSG-00070                     POKCS088
071100                                   TO DP020-MSG-NUMBER            POKCS088
071200                         SET DP020-MSG-INFORMATIONAL              POKCS088
071300                                   TO TRUE                        POKCS088
071400                     END-IF                                       POKCS088
071500                 ELSE                                             POKCS088
071600                     MOVE ASC-START-ITEM-REQUEST-N                POKCS088
071700                                   TO PV-TOP-ITEM                 POKCS088
071800                     MOVE SPACE    TO ASC-START-ITEM-REQUEST      POKCS088
071900                     COMPUTE PV-BOTTOM-ITEM =                     POKCS088
072000                         PV-TOP-ITEM + PC-ITEMS-PER-PANEL - 1     POKCS088
072100                     IF  PV-BOTTOM-ITEM > ASC-NUMBER-OF-ITEMS-READPOKCS088
072200*                        -- BOTTOM OF LIST --                     POKCS088
072300                         MOVE PC-TSYMSG-00070                     POKCS088
072400                                   TO DP020-MSG-NUMBER            POKCS088
072500                         SET DP020-MSG-INFORMATIONAL              POKCS088
072600                                   TO TRUE                        POKCS088
072700                     END-IF                                       POKCS088
072800                 END-IF                                           POKCS088
072900             ELSE                                                 POKCS088
072910                CONTINUE                                                  
073000*                --- VALUE OUT OF RANGE ----                      POKCS088
073100                 MOVE PC-TSYMSG-00101                             POKCS088
073200                                   TO DP020-MSG-NUMBER            POKCS088
073300                 MOVE -1           TO ASTRTITL                    POKCS088
073400                 SET DP030-SET-CURSOR-APPL-1                      POKCS088
073500                                   TO TRUE                        POKCS088
073600                 MOVE DP015-REVERSE                               POKCS088
073700                                   TO ASTRTITH                    POKCS088
073800                 MOVE DP015-RED    TO ASTRTITC                    POKCS088
073900                 MOVE DP015-UNP-NUM-BRT-MDT                       POKCS088
074000                                   TO ASTRTITA                    POKCS088
074100                 SET DP020-MSG-FATAL                              POKCS088
074200                                   TO TRUE                        POKCS088
074300                 SET PS-ERROR      TO TRUE                        POKCS088
074400             END-IF                                               POKCS088
074500                                                                  POKCS088
074600         ELSE                                                     POKCS088
074610             CONTINUE                                                     
074700             MOVE PC-TSYMSG-00008  TO DP020-MSG-NUMBER            POKCS088
074800             MOVE -1               TO ASTRTITL                    POKCS088
074900             SET DP030-SET-CURSOR-APPL-1 TO TRUE                  POKCS088
075000             MOVE DP015-REVERSE    TO ASTRTITH                    POKCS088
075100             MOVE DP015-RED        TO ASTRTITC                    POKCS088
075200             MOVE DP015-UNP-NUM-BRT-MDT                           POKCS088
075300                                   TO ASTRTITA                    POKCS088
075400             SET DP020-MSG-FATAL   TO TRUE                        POKCS088
075500             SET PS-ERROR          TO TRUE                        POKCS088
075600         END-IF                                                   POKCS088
075700     END-IF.                                                      POKCS088
075701                                                                          
075703 2140-GET-NEXT-RSN.                                                     *1
075704                                                                     CL**1
075705*    ADD +1                       TO ASC-SEL-SUB.                    CL**1
075706*    IF  ASC-SEL-SUB > VL008-MAX-ITEMS                               CL**1
075707*        ADD +1                   TO ASC-SEL-ITEM                    CL**1
075708*        MOVE +1                  TO ASC-SEL-SUB                     CL**1
075709*    END-IF.                                                         CL**1
075710*    IF  ASC-SEL-ITEM NOT > ASC-NUMBER-OF-TS-ITEMS                   CL**1
075716     IF VL008-REQ-RSN-CDE (VL008-IDX) =                                   
075717                        ASC-REQ-RSN-CDE                                   
075718                            (ASC-BLK-SUB ASC-ITEM-SUB)                    
075719          SET ASC-TEMP-SELECT                                             
075720                            (ASC-BLK-SUB ASC-ITEM-SUB)                    
075721              ASC-SELECT    (ASC-BLK-SUB ASC-ITEM-SUB)                    
075722             PS-LIST-END TO TRUE                                          
075723          ADD +1                                                          
075724                    TO ASC-NUMBER-OF-SELECTED-ITEMS                       
075725*                      VL005-NUMBER-OF-RSN-CODES                        *8
075726*     MOVE ASC-SELECTED-SW  (ASC-BLK-SUB ASC-ITEM-SUB)                  88
075727*             TO ASC-TEMP-SELECTED-SW                                   88
075728*                           (ASC-BLK-SUB ASC-ITEM-SUB)                  88
075729      ELSE                                                                
075730           SET ASC-NO-SELECT                                              
075731                            (ASC-BLK-SUB ASC-ITEM-SUB)                    
075732                       TO TRUE                                            
075733*     MOVE ASC-SELECTED-SW  (ASC-BLK-SUB ASC-ITEM-SUB)                  88
075734*             TO ASC-TEMP-SELECTED-SW                                   88
075735*                           (ASC-BLK-SUB ASC-ITEM-SUB)                  88
075736      END-IF.                                                             
075737      IF VL008-IDX GREATER THAN VL008-MAX-ITEMS                           
075738              SET PS-LIST-END TO TRUE                                     
075739     END-IF.                                                              
075740     SET VL008-IDX UP BY 1.                                               
075750                                                                     CL**1
075800                                                                  POKCS088
075900*----------------------------------------------------------------*POKCS088
076000*    IF THE USER HITS THE DESELECT KEY, CLEAR THE SELECTION      *POKCS088
076100*    SWITCH FOR ALL ITEMS THAT WERE PREVIOUSLY SELECTED.         *POKCS088
076200*----------------------------------------------------------------*POKCS088
076300 2140-DESELECT-ALL-ITEMS.                                         POKCS088
076400                                                                  POKCS088
076500     MOVE +1                       TO ASC-BLK-SUB.                POKCS088
076600                                                                  POKCS088
076700     PERFORM 2141-CLEAR-SELECTED-INDS                             POKCS088
076800         VARYING ASC-ITEM-SUB                                     POKCS088
076900         FROM 1 BY 1                                              POKCS088
077000         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 POKCS088
077100                                                                  POKCS088
077200     ADD +1                        TO ASC-BLK-SUB.                POKCS088
077300                                                                  POKCS088
077400     PERFORM 2141-CLEAR-SELECTED-INDS                             POKCS088
077500         VARYING ASC-ITEM-SUB                                     POKCS088
077600         FROM 1 BY 1                                              POKCS088
077700         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 POKCS088
077800                                                                  POKCS088
077900     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               POKCS088
078000                                   TO PV-LIST-ITEM-NUMBER.        POKCS088
078100                                                                  POKCS088
078200     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            POKCS088
078300         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    POKCS088
078400                                                                  POKCS088
078500     IF (PV-FIRST-BLOCK-IN-ARRAY NOT = +1) OR                     POKCS088
078600        (ASC-HIGHEST-BLOCK-WRITTEN > PC-MAX-BLOCKS-IN-ARRAY)      POKCS088
078700         MOVE +1                   TO ASC-BLK-SUB                 POKCS088
078800                                                                  POKCS088
078900         PERFORM 5100-WRITE-TEMP-STORAGE                          POKCS088
079000                                                                  POKCS088
079100         MOVE +1                   TO PV-BLOCK-NUMBER             POKCS088
079200                                                                  POKCS088
079300         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         POKCS088
079400             PV-FIRST-BLOCK-IN-ARRAY - 1                          POKCS088
079500                                                                  POKCS088
079600         PERFORM                                                  POKCS088
079700             UNTIL PV-BLOCK-NUMBER > PV-PREV-BLOCK-IN-ARRAY       POKCS088
079800                                                                  POKCS088
079900             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
080000                                                                  POKCS088
080100             PERFORM 2141-CLEAR-SELECTED-INDS                     POKCS088
080200                 VARYING ASC-ITEM-SUB FROM 1 BY 1                 POKCS088
080300                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          POKCS088
080400                                                                  POKCS088
080500             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
080600                                                                  POKCS088
080700             ADD +1                TO PV-BLOCK-NUMBER             POKCS088
080800                                                                  POKCS088
080900         END-PERFORM                                              POKCS088
081000                                                                  POKCS088
081100         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         POKCS088
081200             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     POKCS088
081300                                                                  POKCS088
081400         PERFORM                                                  POKCS088
081500             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       POKCS088
081600                   ASC-HIGHEST-BLOCK-WRITTEN                      POKCS088
081700                                                                  POKCS088
081800             MOVE PV-NEXT-BLOCK-IN-ARRAY                          POKCS088
081900                                   TO PV-BLOCK-NUMBER             POKCS088
082000                                                                  POKCS088
082100             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
082200                                                                  POKCS088
082300             PERFORM 2141-CLEAR-SELECTED-INDS                     POKCS088
082400                 VARYING ASC-ITEM-SUB                             POKCS088
082500                 FROM 1 BY 1                                      POKCS088
082600                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          POKCS088
082700                                                                  POKCS088
082800             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
082900                                                                  POKCS088
083000             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      POKCS088
083100                                                                  POKCS088
083200         END-PERFORM                                              POKCS088
083300                                                                  POKCS088
083400         MOVE PV-FIRST-BLOCK-IN-ARRAY                             POKCS088
083500                                   TO PV-BLOCK-NUMBER             POKCS088
083600                                                                  POKCS088
083700         PERFORM 4410-READ-TEMP-STORAGE                           POKCS088
083800     END-IF.                                                      POKCS088
083900                                                                  POKCS088
084000                                                                  POKCS088
084100     MOVE +0                     TO ASC-NUMBER-OF-SELECTED-ITEMS. POKCS088
084200     MOVE +0                       TO ASC-START-OF-SELECTED-RANGE.POKCS088
084300     MOVE +0                       TO ASC-END-OF-SELECTED-RANGE.  POKCS088
084400                                                                  POKCS088
084500     PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                        POKCS088
084600                                                                  POKCS088
084700*----------------------------------------------------------------*POKCS088
084800*    MARK EACH ITEM AS BEING NOT SELECTED.                       *POKCS088
084900*----------------------------------------------------------------*POKCS088
085000 2141-CLEAR-SELECTED-INDS.                                        POKCS088
085100                                                                  POKCS088
085200     IF  ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB ASC-ITEM-SUB)           POKCS088
085300             NOT EQUAL ZERO                                       POKCS088
085400         IF  NOT ASC-NO-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          POKCS088
085500             SET ASC-NO-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          POKCS088
085600                 ASC-TEMP-NO-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)    POKCS088
085700                 ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                  POKCS088
085800                                   TO TRUE                        POKCS088
085900         END-IF                                                   POKCS088
086000     END-IF.                                                      POKCS088
086100                                                                  POKCS088
086200*----------------------------------------------------------------*POKCS088
086300*  IF THE USER HITS THE SELECT-ALL KEY, SET THE SELECTIO SWITCH  *POKCS088
086400*  FOR ALL ITEMS.                                                *POKCS088
086500*----------------------------------------------------------------*POKCS088
086600 2150-SELECT-ALL-ITEMS.                                           POKCS088
086700                                                                  POKCS088
086800     MOVE +1                       TO ASC-BLK-SUB.                POKCS088
086900                                                                  POKCS088
087000     PERFORM 2151-SET-SELECTED-INDS                               POKCS088
087100         VARYING ASC-ITEM-SUB                                     POKCS088
087200         FROM 1 BY 1                                              POKCS088
087300         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 POKCS088
087400                                                                  POKCS088
087500     ADD +1                        TO ASC-BLK-SUB.                POKCS088
087600                                                                  POKCS088
087700     PERFORM 2151-SET-SELECTED-INDS                               POKCS088
087800         VARYING ASC-ITEM-SUB                                     POKCS088
087900         FROM 1 BY 1                                              POKCS088
088000         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 POKCS088
088100                                                                  POKCS088
088200     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               POKCS088
088300                                   TO PV-LIST-ITEM-NUMBER.        POKCS088
088400                                                                  POKCS088
088500     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            POKCS088
088600         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    POKCS088
088700                                                                  POKCS088
088800     IF (PV-FIRST-BLOCK-IN-ARRAY NOT = +1) OR                     POKCS088
088900        (ASC-HIGHEST-BLOCK-WRITTEN >   PC-MAX-BLOCKS-IN-ARRAY)    POKCS088
089000         MOVE +1                   TO ASC-BLK-SUB                 POKCS088
089100                                                                  POKCS088
089200         PERFORM 5100-WRITE-TEMP-STORAGE                          POKCS088
089300                                                                  POKCS088
089400         MOVE +1                   TO PV-BLOCK-NUMBER             POKCS088
089500                                                                  POKCS088
089600         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         POKCS088
089700             PV-FIRST-BLOCK-IN-ARRAY - 1                          POKCS088
089800                                                                  POKCS088
089900         PERFORM                                                  POKCS088
090000             UNTIL PV-BLOCK-NUMBER > PV-PREV-BLOCK-IN-ARRAY       POKCS088
090100                                                                  POKCS088
090200             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
090300                                                                  POKCS088
090400             PERFORM 2151-SET-SELECTED-INDS                       POKCS088
090500                 VARYING ASC-ITEM-SUB                             POKCS088
090600                 FROM 1 BY 1                                      POKCS088
090700                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          POKCS088
090800                                                                  POKCS088
090900             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
091000                                                                  POKCS088
091100             ADD +1                TO PV-BLOCK-NUMBER             POKCS088
091200                                                                  POKCS088
091300         END-PERFORM                                              POKCS088
091400                                                                  POKCS088
091500         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         POKCS088
091600             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     POKCS088
091700                                                                  POKCS088
091800         PERFORM                                                  POKCS088
091900             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       POKCS088
092000                   ASC-HIGHEST-BLOCK-WRITTEN                      POKCS088
092100                                                                  POKCS088
092200             MOVE PV-NEXT-BLOCK-IN-ARRAY                          POKCS088
092300                                   TO PV-BLOCK-NUMBER             POKCS088
092400                                                                  POKCS088
092500             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
092600                                                                  POKCS088
092700             PERFORM 2151-SET-SELECTED-INDS                       POKCS088
092800                 VARYING ASC-ITEM-SUB                             POKCS088
092900                 FROM 1 BY 1                                      POKCS088
093000                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          POKCS088
093100                                                                  POKCS088
093200             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
093300                                                                  POKCS088
093400             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      POKCS088
093500                                                                  POKCS088
093600         END-PERFORM                                              POKCS088
093700                                                                  POKCS088
093800         MOVE PV-FIRST-BLOCK-IN-ARRAY                             POKCS088
093900                                   TO PV-BLOCK-NUMBER             POKCS088
094000                                                                  POKCS088
094100         PERFORM 4410-READ-TEMP-STORAGE                           POKCS088
094200     END-IF.                                                      POKCS088
094300                                                                  POKCS088
094400                                                                  POKCS088
094500     MOVE ASC-NUMBER-OF-ITEMS-READ TO                             POKCS088
094600                       ASC-NUMBER-OF-SELECTED-ITEMS.              POKCS088
094700                                                                  POKCS088
094800     PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                        POKCS088
094900                                                                  POKCS088
095000*----------------------------------------------------------------*POKCS088
095100*    MARK EACH ITEM AS BEING SELECTED.                           *POKCS088
095200*----------------------------------------------------------------*POKCS088
095300 2151-SET-SELECTED-INDS.                                          POKCS088
095400                                                                  POKCS088
095500     IF  ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB ASC-ITEM-SUB)           POKCS088
095600             NOT EQUAL ZERO                                       POKCS088
095700         IF  NOT ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)             POKCS088
095800             SET ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)             POKCS088
095900                 ASC-TEMP-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)        POKCS088
096000                 ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                  POKCS088
096100                               TO  TRUE                           POKCS088
096200         END-IF                                                   POKCS088
096300     END-IF.                                                      POKCS088
096400                                                                  POKCS088
096500******************************************************************POKCS088
096600** MOVE ALL OF THE FIELDS THAT WERE ENTERED / CHANGED ON THE    **POKCS088
096700** SCREEN INTO THE COMMAREA.  ALL EDITTING IS DONE IN THE COMM. **POKCS088
096800******************************************************************POKCS088
096900 2200-MOVE-SCREEN-TO-COMMAREA.                                    POKCS088
097000                                                                  POKCS088
097100     MOVE PV-TOP-ITEM              TO PV-ITEM-IN-USE.             POKCS088
097200     MOVE +1                       TO PV-SUB.                     POKCS088
097300                                                                  POKCS088
097400     PERFORM 3100-SET-SUBSCRIPTS.                                 POKCS088
097500     IF  ASTRTITL > ZERO                                          POKCS088
097600         MOVE ASTRTITI         TO ASC-START-ITEM-REQUEST          POKCS088
097700     ELSE                                                         POKCS088
097800         IF  ASTRTITF = DP015-ERASE-EOF                           POKCS088
097900             INITIALIZE ASC-START-ITEM-REQUEST                    POKCS088
098000         END-IF                                                   POKCS088
098100     END-IF.                                                      POKCS088
098200     PERFORM 2210-MOVE-LINES-TO-COMMAREA                          POKCS088
098300         VARYING PV-SUB                                           POKCS088
098400         FROM 1 BY 1                                              POKCS088
098500         UNTIL PV-SUB > ASC-ITEMS-DISPLAYED.                      POKCS088
098600                                                                  POKCS088
098700******************************************************************POKCS088
098800** MOVE THE ENTERABLE FIELDS ON EACH LIST LINE INTO THE COMMAREA**POKCS088
098900******************************************************************POKCS088
099000 2210-MOVE-LINES-TO-COMMAREA.                                     POKCS088
099100                                                                  POKCS088
099200     IF  MR-SELECTL (PV-SUB) > ZERO                               POKCS088
099300         SET ASC-BLOCK-MODIFIED (ASC-BLK-SUB) TO TRUE             POKCS088
099400         MOVE MR-SELECTI (PV-SUB)                                 POKCS088
099500                                   TO ASC-TEMP-SELECTED-SW        POKCS088
099600                                 (ASC-BLK-SUB, ASC-ITEM-SUB)      POKCS088
099700     ELSE                                                         POKCS088
099800         IF  MR-SELECTA (PV-SUB) = DP015-ERASE-EOF                POKCS088
099900                 SET ASC-BLOCK-MODIFIED (ASC-BLK-SUB) TO TRUE     POKCS088
100000                 MOVE SPACE        TO ASC-TEMP-SELECTED-SW        POKCS088
100100                                 (ASC-BLK-SUB, ASC-ITEM-SUB)      POKCS088
100200         END-IF                                                   POKCS088
100300     END-IF.                                                      POKCS088
100400     ADD +1                        TO ASC-ITEM-SUB.               POKCS088
100500     IF  ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                        POKCS088
100600         ADD +1                    TO ASC-BLK-SUB                 POKCS088
100700         MOVE +1                   TO ASC-ITEM-SUB                POKCS088
100800     END-IF.                                                      POKCS088
100900                                                                  POKCS088
101000******************************************************************POKCS088
101100** EDIT ALL OF THE DATA ON THE SCREEN AS IT RESIDES IN THE      **POKCS088
101200** COMMAREA (EDITTING IS NOT DONE AGAINST THE SCREEN DIRECTLY). **POKCS088
101300******************************************************************POKCS088
101400 3000-EDIT-DATA-IN-COMMAREA.                                      POKCS088
101500                                                                  POKCS088
101600     SET PS-NO-ERROR               TO TRUE.                       POKCS088
101700     PERFORM 3200-RESET-ATTRIBUTES.                               POKCS088
101800     MOVE ASC-ITEMS-DISPLAYED      TO PV-SUB.                     POKCS088
101900**                                                                POKCS088
102000* CALCULATE THE POSITION OF THE LAST ITEM DISPLAYED.              POKCS088
102100* EDITTING IS DONE FROM THE BOTTOM UP.                            POKCS088
102200**                                                                POKCS088
102300     COMPUTE PV-ITEM-IN-USE = PV-TOP-ITEM +                       POKCS088
102400         ASC-ITEMS-DISPLAYED - 1.                                 POKCS088
102500     PERFORM 3100-SET-SUBSCRIPTS.                                 POKCS088
102600     PERFORM 3300-EDIT-SELECTIONS                                 POKCS088
102700         VARYING PV-SUB                                           POKCS088
102800         FROM PV-SUB BY -1                                        POKCS088
102900         UNTIL PV-SUB < +1                                        POKCS088
103000                                                                  POKCS088
103100     IF  PS-NO-ERROR                                              POKCS088
103200         PERFORM 3400-CHECK-RANGE-SEQUENCE                        POKCS088
103300     END-IF.                                                      POKCS088
103400                                                                  POKCS088
103500     IF  ((PS-NO-ERROR)                                           POKCS088
103600       AND (ASC-START-OF-SELECTED-RANGE > ZERO)                   POKCS088
103700       AND (ASC-END-OF-SELECTED-RANGE > ZERO))                    POKCS088
103800             PERFORM 3500-MARK-RANGE-AS-SELECTED                  POKCS088
103900     END-IF.                                                      POKCS088
104000                                                                  POKCS088
104100*----------------------------------------------------------------*POKCS088
104200*    DETERMINE THE VALUE OF THE ITEM SUBSCRIPT BASED ON THE ITEM *POKCS088
104300*    CURRENTLY IN USE AND THE FIRST ITEM IN THE ARRAY.  THIS WILL*POKCS088
104400*    POSITION US IN THE 1ST BLOCK OF THE ARRAY.                  *POKCS088
104500*                                                                *POKCS088
104600*    IF THE ITEM SUBSCRIPT EXCEEDS THE MAXIMUM NUMBER OF ITEMS   *POKCS088
104700*    IN A BLOCK, RECALCULATE THE SUBSCRIPT BY SUBTRACTING OUT    *POKCS088
104800*    THE MAXIMUM NUMBER OF ITEMS.  THIS WILL CORRECTLY POSITION  *POKCS088
104900*    US IN THE 2ND BLOCK OF THE ARRAY.                           *POKCS088
105000*----------------------------------------------------------------*POKCS088
105100 3100-SET-SUBSCRIPTS.                                             POKCS088
105200                                                                  POKCS088
105300     COMPUTE ASC-ITEM-SUB =                                       POKCS088
105400         (PV-ITEM-IN-USE - ASC-LIST-ITEM-NUMBER(1 1)) + 1.        POKCS088
105500                                                                  POKCS088
105600     IF ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                         POKCS088
105700         SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-SUB            POKCS088
105800                                                                  POKCS088
105900         MOVE PC-MAX-BLOCKS-IN-ARRAY TO ASC-BLK-SUB               POKCS088
106000     ELSE                                                         POKCS088
106100         MOVE +1                     TO ASC-BLK-SUB               POKCS088
106200     END-IF.                                                      POKCS088
106300                                                                  POKCS088
106400******************************************************************POKCS088
106500** RESET THE ATTRIBUTES OF ALL ENTERABLE FIELDS ON THE MAP.     **POKCS088
106600******************************************************************POKCS088
106700 3200-RESET-ATTRIBUTES.                                           POKCS088
106800                                                                  POKCS088
106900     MOVE DP015-UNP-ALP-NOR-OFF TO ASTRTITA.                      POKCS088
107000     MOVE DP015-GREEN           TO ASTRTITC.                      POKCS088
107100     MOVE DP015-UNDERLINE       TO ASTRTITH.                      POKCS088
107200                                                                  POKCS088
107300     IF DP020-NEXT-ACT-RETURN OR                                  POKCS088
107400        DP020-NEXT-ACT-READ-MAP                                   POKCS088
107500         PERFORM VARYING PV-SUB  FROM 1 BY 1                      POKCS088
107600                 UNTIL   PV-SUB > ASC-ITEMS-DISPLAYED             POKCS088
107700                  MOVE DP015-UNP-ALP-NOR-OFF                      POKCS088
107800                                       TO MR-SELECTA (PV-SUB)     POKCS088
107900                  MOVE DP015-GREEN     TO MR-SELECTC (PV-SUB)     POKCS088
108000                  MOVE DP015-UNDERLINE TO MR-SELECTH (PV-SUB)     POKCS088
108100         END-PERFORM                                              POKCS088
108200     ELSE                                                         POKCS088
108300         PERFORM VARYING PV-SUB  FROM 1 BY 1                      POKCS088
108400                 UNTIL   PV-SUB > PC-ITEMS-PER-PANEL              POKCS088
108500                  MOVE DP015-UNP-ALP-NOR-OFF                      POKCS088
108600                                       TO MR-SELECTA (PV-SUB)     POKCS088
108700                  MOVE DP015-GREEN     TO MR-SELECTC (PV-SUB)     POKCS088
108800                  MOVE DP015-UNDERLINE TO MR-SELECTH (PV-SUB)     POKCS088
108900         END-PERFORM.                                             POKCS088
109000                                                                  POKCS088
109100******************************************************************POKCS088
109200** EDIT THE SELECTIONS MADE.  NOTE THAT THE 'SELECTED-SW' IS    **POKCS088
109300** WHAT WAS PREVIOUSLY CHECKED AND CORRECT 'TEMP-SELECTED-SW'   **POKCS088
109400** IS WHAT HAS JUST BEEN ENTERED AND HAS NOT BEEN EDITTED OR    **POKCS088
109500** WAS ENTERED EARLIER, BUT DID NOT PASS THE EDITS.             **POKCS088
109600******************************************************************POKCS088
109700 3300-EDIT-SELECTIONS.                                            POKCS088
109800                                                                  POKCS088
109900     EVALUATE TRUE                                                POKCS088
110000         WHEN ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)     POKCS088
110100             = ASC-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)         POKCS088
110200                 CONTINUE                                         POKCS088
110300         WHEN ASC-TEMP-SELECT  (ASC-BLK-SUB ASC-ITEM-SUB)         POKCS088
110400             IF  NOT ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)        POKCS088
110500                 ADD +1         TO ASC-NUMBER-OF-SELECTED-ITEMS   POKCS088
110600                 MOVE ASC-TEMP-SELECTED-SW                        POKCS088
110700                                      (ASC-BLK-SUB ASC-ITEM-SUB)  POKCS088
110800                                TO ASC-SELECTED-SW                POKCS088
110900                                      (ASC-BLK-SUB ASC-ITEM-SUB)  POKCS088
111000             END-IF                                               POKCS088
111100         WHEN ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)     POKCS088
111200                 = SPACE                                          POKCS088
111300             EVALUATE TRUE                                        POKCS088
111400                 WHEN ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)       POKCS088
111500                     SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMSPOKCS088
111600                     MOVE SPACE TO ASC-SELECTED-SW                POKCS088
111700                                      (ASC-BLK-SUB ASC-ITEM-SUB)  POKCS088
111800                 WHEN ASC-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)        POKCS088
111900                     MOVE ZERO  TO ASC-START-OF-SELECTED-RANGE    POKCS088
112000                     MOVE SPACE TO ASC-SELECTED-SW                POKCS088
112100                                      (ASC-BLK-SUB ASC-ITEM-SUB)  POKCS088
112200                 WHEN ASC-END (ASC-BLK-SUB ASC-ITEM-SUB)          POKCS088
112300                     MOVE ZERO  TO ASC-END-OF-SELECTED-RANGE      POKCS088
112400                     MOVE SPACE TO ASC-SELECTED-SW                POKCS088
112500                                      (ASC-BLK-SUB ASC-ITEM-SUB)  POKCS088
112600             END-EVALUATE                                         POKCS088
112700         WHEN ASC-TEMP-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)           POKCS088
112800             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            POKCS088
112900                 SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMS    POKCS088
113000             END-IF                                               POKCS088
113100             PERFORM 3310-EDIT-RANGE                              POKCS088
113200         WHEN ASC-TEMP-END (ASC-BLK-SUB ASC-ITEM-SUB)             POKCS088
113300             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            POKCS088
113400                 SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMS    POKCS088
113500             END-IF                                               POKCS088
113600             PERFORM 3310-EDIT-RANGE                              POKCS088
113700         WHEN OTHER                                               POKCS088
113800             MOVE PC-TSYMSG-00005   TO DP020-MSG-NUMBER           POKCS088
113900             SET DP020-MSG-FATAL    TO TRUE                       POKCS088
114000             MOVE -1                TO MR-SELECTL (PV-SUB)        POKCS088
114100             SET DP030-SET-CURSOR-APPL-1                          POKCS088
114200                                    TO TRUE                       POKCS088
114300             MOVE DP015-RED         TO MR-SELECTC (PV-SUB)        POKCS088
114400             MOVE DP015-REVERSE     TO MR-SELECTH (PV-SUB)        POKCS088
114500             SET PS-ERROR TO TRUE                                 POKCS088
114600             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            POKCS088
114700                 SUBTRACT 1 FROM ASC-NUMBER-OF-SELECTED-ITEMS     POKCS088
114800                 MOVE SPACE         TO ASC-SELECTED-SW            POKCS088
114900                                        (ASC-BLK-SUB ASC-ITEM-SUB)POKCS088
115000             END-IF                                               POKCS088
115100     END-EVALUATE.                                                POKCS088
115200                                                                  POKCS088
115300     SUBTRACT +1             FROM PV-ITEM-IN-USE.                 POKCS088
115400     SUBTRACT +1 FROM ASC-ITEM-SUB.                               POKCS088
115500     IF  ASC-ITEM-SUB < 1                                         POKCS088
115600         SUBTRACT +1 FROM ASC-BLK-SUB                             POKCS088
115700         MOVE PC-ITEMS-PER-PANEL   TO ASC-ITEM-SUB                POKCS088
115800     END-IF.                                                      POKCS088
115900                                                                  POKCS088
116000******************************************************************POKCS088
116100** IF A BEGINNING AND END OF RANGE WAS ENTERED TO SELECT A      **POKCS088
116200** RANGE OF LINES, MAKE SURE THERE IS ONLY 1 BEGINNING AND 1    **POKCS088
116300** ENDING AND MAKE SURE THAT THE BEGINNING IS BEFORE (LESS THAN)**POKCS088
116400** THE ENDING.                                                  **POKCS088
116500******************************************************************POKCS088
116600 3310-EDIT-RANGE.                                                 POKCS088
116700                                                                  POKCS088
116800     IF  ASC-TEMP-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)                POKCS088
116900         IF  ASC-START-OF-SELECTED-RANGE = ZERO                   POKCS088
117000             MOVE ASC-TEMP-SELECTED-SW  (ASC-BLK-SUB ASC-ITEM-SUB)POKCS088
117100                                   TO ASC-SELECTED-SW             POKCS088
117200                                        (ASC-BLK-SUB ASC-ITEM-SUB)POKCS088
117300             MOVE PV-ITEM-IN-USE   TO ASC-START-OF-SELECTED-RANGE POKCS088
117400         ELSE                                                     POKCS088
117500             IF  ASC-START-OF-SELECTED-RANGE = PV-ITEM-IN-USE     POKCS088
117600                 CONTINUE                                         POKCS088
117700             ELSE                                                 POKCS088
117800*                -- ONLY ONE BEGINNING-OF-RANGE-ALLOWED --        POKCS088
117900                 MOVE PC-TSYMSG-00054                             POKCS088
118000                                   TO DP020-MSG-NUMBER            POKCS088
118100                 SET DP020-MSG-FATAL                              POKCS088
118200                                   TO TRUE                        POKCS088
118300                 MOVE -1           TO MR-SELECTL (PV-SUB)         POKCS088
118400                 SET DP030-SET-CURSOR-APPL-1                      POKCS088
118500                                   TO TRUE                        POKCS088
118600                 MOVE DP015-RED    TO MR-SELECTC (PV-SUB)         POKCS088
118700                 MOVE DP015-UNDERLINE                             POKCS088
118800                                   TO MR-SELECTH (PV-SUB)         POKCS088
118900                 SET PS-ERROR      TO TRUE                        POKCS088
119000             END-IF                                               POKCS088
119100         END-IF                                                   POKCS088
119200     ELSE                                                         POKCS088
119300         IF  ASC-END-OF-SELECTED-RANGE = ZERO                     POKCS088
119400             MOVE ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB) POKCS088
119500                                   TO ASC-SELECTED-SW             POKCS088
119600                                     (ASC-BLK-SUB ASC-ITEM-SUB)   POKCS088
119700             MOVE PV-ITEM-IN-USE   TO ASC-END-OF-SELECTED-RANGE   POKCS088
119800         ELSE                                                     POKCS088
119900             IF  ASC-END-OF-SELECTED-RANGE = PV-ITEM-IN-USE       POKCS088
120000                 CONTINUE                                         POKCS088
120100             ELSE                                                 POKCS088
120200*                -- ONLY ONE END-OF-RANGE ALLOWED --              POKCS088
120300                 MOVE PC-TSYMSG-00055                             POKCS088
120400                                   TO DP020-MSG-NUMBER            POKCS088
120500                 SET DP020-MSG-FATAL                              POKCS088
120600                                   TO TRUE                        POKCS088
120700                 MOVE -1           TO MR-SELECTL (PV-SUB)         POKCS088
120800                 SET DP030-SET-CURSOR-APPL-1                      POKCS088
120900                                   TO TRUE                        POKCS088
121000                 SET PS-ERROR      TO TRUE                        POKCS088
121100             END-IF                                               POKCS088
121200         END-IF                                                   POKCS088
121300     END-IF.                                                      POKCS088
121400                                                                  POKCS088
121500******************************************************************POKCS088
121600** IF BOTH A BEGINNING AND END OF RANGE HAVE BEEN SPECIFIED,    **POKCS088
121700** MAKE SURE THAT THE BEGINNING IS BEFORE (LESS THAN) THE END.  **POKCS088
121800******************************************************************POKCS088
121900 3400-CHECK-RANGE-SEQUENCE.                                       POKCS088
122000                                                                  POKCS088
122100     IF  ASC-START-OF-SELECTED-RANGE > ZERO                       POKCS088
122200       AND  ASC-END-OF-SELECTED-RANGE > ZERO                      POKCS088
122300       AND  ASC-START-OF-SELECTED-RANGE >                         POKCS088
122400                                         ASC-END-OF-SELECTED-RANGEPOKCS088
122500*        -- END-OF-RANGE BEFORE BEGINNING-OF-RANGE                POKCS088
122600         MOVE PC-TSYMSG-00052 TO DP020-MSG-NUMBER                 POKCS088
122700         SET DP020-MSG-FATAL TO TRUE                              POKCS088
122800         SET PS-ERROR TO TRUE                                     POKCS088
122900         PERFORM 3410-POSITION-AT-ERROR                           POKCS088
123000     END-IF.                                                      POKCS088
123100                                                                  POKCS088
123200******************************************************************POKCS088
123300** BECAUSE RANGES CAN SPAN ACROSS MULTIPLE PAGES, A SEPARATE    **POKCS088
123400** PARAGRAPH (THIS ONE) IS NEEDED TO DETERMINE WHERE THE CURSOR **POKCS088
123500** SHOULD BE POSITIONED ON A RANGE ERROR.                       **POKCS088
123600******************************************************************POKCS088
123700 3410-POSITION-AT-ERROR.                                          POKCS088
123800                                                                  POKCS088
123900     SET DP030-SET-CURSOR-APPL-1                                  POKCS088
124000                                   TO TRUE.                       POKCS088
124100     COMPUTE PV-SUB = ASC-START-OF-SELECTED-RANGE                 POKCS088
124200                    - PV-TOP-ITEM + 1.                            POKCS088
124300     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      POKCS088
124400         CONTINUE                                                 POKCS088
124500     ELSE                                                         POKCS088
124600         MOVE -1                   TO MR-SELECTL (PV-SUB)         POKCS088
124700         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         POKCS088
124800         MOVE DP015-RED            TO MR-SELECTC (PV-SUB)         POKCS088
124900     END-IF.                                                      POKCS088
125000                                                                  POKCS088
125100     COMPUTE PV-SUB = ASC-END-OF-SELECTED-RANGE                   POKCS088
125200                    - PV-TOP-ITEM + 1.                            POKCS088
125300     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      POKCS088
125400         CONTINUE                                                 POKCS088
125500     ELSE                                                         POKCS088
125600         MOVE -1                   TO MR-SELECTL (PV-SUB)         POKCS088
125700         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         POKCS088
125800         MOVE DP015-RED            TO MR-SELECTC (PV-SUB)         POKCS088
125900     END-IF.                                                      POKCS088
126000                                                                  POKCS088
126100*----------------------------------------------------------------*POKCS088
126200*    WHENEVER THE USER SELECTS AN ITEM AS THE BEGINNING RANGE    *POKCS088
126300*    AND ONE AS THE ENDING RANGE, MARK THESE ITEMS AS WELL AS    *POKCS088
126400*    THOSE THAT FALL IN THE RANGE AS BEING SELECTED.             *POKCS088
126500*----------------------------------------------------------------*POKCS088
126600 3500-MARK-RANGE-AS-SELECTED.                                     POKCS088
126700                                                                  POKCS088
126800     MOVE +1                       TO  ASC-BLK-SUB.               POKCS088
126900     PERFORM 3510-MARK-SELECTED-INDS                              POKCS088
127000         VARYING ASC-ITEM-SUB                                     POKCS088
127100         FROM 1 BY 1                                              POKCS088
127200         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 POKCS088
127300                                                                  POKCS088
127400     ADD +1                        TO ASC-BLK-SUB.                POKCS088
127500     PERFORM 3510-MARK-SELECTED-INDS                              POKCS088
127600         VARYING ASC-ITEM-SUB                                     POKCS088
127700         FROM 1 BY 1                                              POKCS088
127800         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 POKCS088
127900                                                                  POKCS088
128000     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               POKCS088
128100                                   TO  PV-LIST-ITEM-NUMBER.       POKCS088
128200     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            POKCS088
128300         1 + ((PV-LIST-ITEM-NUMBER - 1) /                         POKCS088
128400               PC-ITEMS-PER-PANEL).                               POKCS088
128500                                                                  POKCS088
128600     MOVE ASC-START-OF-SELECTED-RANGE                             POKCS088
128700                                   TO PV-START-OF-SELECTED-RANGE. POKCS088
128800     COMPUTE PV-FIRST-BLOCK-IN-RANGE =                            POKCS088
128900         1 + ((PV-START-OF-SELECTED-RANGE - 1) /                  POKCS088
129000               PC-ITEMS-PER-PANEL).                               POKCS088
129100                                                                  POKCS088
129200     MOVE ASC-END-OF-SELECTED-RANGE                               POKCS088
129300                                   TO  PV-END-OF-SELECTED-RANGE.  POKCS088
129400     COMPUTE PV-LAST-BLOCK-IN-RANGE =                             POKCS088
129500         1 + ((PV-END-OF-SELECTED-RANGE - 1) /                    POKCS088
129600               PC-ITEMS-PER-PANEL).                               POKCS088
129700     COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                             POKCS088
129800         PV-FIRST-BLOCK-IN-ARRAY + 1.                             POKCS088
129900                                                                  POKCS088
130000     IF (PV-FIRST-BLOCK-IN-RANGE < PV-FIRST-BLOCK-IN-ARRAY) OR    POKCS088
130100        (PV-LAST-BLOCK-IN-RANGE  > PV-NEXT-BLOCK-IN-ARRAY)        POKCS088
130200         MOVE +1                   TO ASC-BLK-SUB                 POKCS088
130300         PERFORM 5100-WRITE-TEMP-STORAGE                          POKCS088
130400         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         POKCS088
130500             PV-FIRST-BLOCK-IN-ARRAY - 1                          POKCS088
130600                                                                  POKCS088
130700         PERFORM                                                  POKCS088
130800             UNTIL PV-FIRST-BLOCK-IN-RANGE >                      POKCS088
130900                   PV-PREV-BLOCK-IN-ARRAY                         POKCS088
131000             MOVE PV-FIRST-BLOCK-IN-RANGE                         POKCS088
131100                                   TO PV-BLOCK-NUMBER             POKCS088
131200             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
131300             PERFORM 3510-MARK-SELECTED-INDS                      POKCS088
131400                 VARYING ASC-ITEM-SUB                             POKCS088
131500                 FROM 1 BY 1                                      POKCS088
131600                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          POKCS088
131700             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
131800             ADD +1                TO PV-FIRST-BLOCK-IN-RANGE     POKCS088
131900         END-PERFORM                                              POKCS088
132000                                                                  POKCS088
132100         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         POKCS088
132200             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     POKCS088
132300         PERFORM                                                  POKCS088
132400             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       POKCS088
132500                   PV-LAST-BLOCK-IN-RANGE                         POKCS088
132600             MOVE PV-NEXT-BLOCK-IN-ARRAY                          POKCS088
132700                                   TO PV-BLOCK-NUMBER             POKCS088
132800             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
132900             PERFORM 3510-MARK-SELECTED-INDS                      POKCS088
133000                 VARYING ASC-ITEM-SUB                             POKCS088
133100                 FROM 1 BY 1                                      POKCS088
133200                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          POKCS088
133300             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
133400             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      POKCS088
133500         END-PERFORM                                              POKCS088
133600                                                                  POKCS088
133700         MOVE PV-FIRST-BLOCK-IN-ARRAY                             POKCS088
133800                                   TO PV-BLOCK-NUMBER             POKCS088
133900         PERFORM 4410-READ-TEMP-STORAGE                           POKCS088
134000     END-IF.                                                      POKCS088
134100                                                                  POKCS088
134200     MOVE +0                       TO ASC-START-OF-SELECTED-RANGE POKCS088
134300                                      ASC-END-OF-SELECTED-RANGE.  POKCS088
134400                                                                  POKCS088
134500*----------------------------------------------------------------*POKCS088
134600* SET THE SELECTION INDICATOR TO 'S' WITHIN THE RANGE.           *POKCS088
134700*----------------------------------------------------------------*POKCS088
134800 3510-MARK-SELECTED-INDS.                                         POKCS088
134900                                                                  POKCS088
135000     IF (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                         POKCS088
135100                                ASC-ITEM-SUB) >                   POKCS088
135200         ASC-START-OF-SELECTED-RANGE)                             POKCS088
135300     OR (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                         POKCS088
135400                                ASC-ITEM-SUB) =                   POKCS088
135500         ASC-START-OF-SELECTED-RANGE)                             POKCS088
135600                                                                  POKCS088
135700         IF (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                     POKCS088
135800                                    ASC-ITEM-SUB) <               POKCS088
135900             ASC-END-OF-SELECTED-RANGE)                           POKCS088
136000         OR (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                     POKCS088
136100                                    ASC-ITEM-SUB) =               POKCS088
136200             ASC-END-OF-SELECTED-RANGE)                           POKCS088
136300                                                                  POKCS088
136400             IF NOT ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          POKCS088
136500                 SET ASC-SELECT     (ASC-BLK-SUB  ASC-ITEM-SUB)   POKCS088
136600                     ASC-TEMP-SELECT(ASC-BLK-SUB  ASC-ITEM-SUB)   POKCS088
136700                               TO TRUE                            POKCS088
136800                 SET ASC-BLOCK-MODIFIED(ASC-BLK-SUB)              POKCS088
136900                               TO TRUE                            POKCS088
137000                 ADD +1        TO ASC-NUMBER-OF-SELECTED-ITEMS    POKCS088
137100             END-IF                                               POKCS088
137200         END-IF                                                   POKCS088
137300     END-IF.                                                      POKCS088
137400                                                                  POKCS088
137500*----------------------------------------------------------------*POKCS088
137600*    INITIALIZE BOTH BLOCKS IN THE ARRAY.                        *POKCS088
137700*    INITIALIZE ALL COUNTERS AND FLAGS.                          *POKCS088
137800*    READ THE DATA BASE FOR THE 1ST TIME AND FILL UP THE ARRAY.  *POKCS088
137900*    DISPLAY THE PANEL TO USER.                                  *POKCS088
138000*----------------------------------------------------------------*POKCS088
138100 4000-BUILD-INITIAL-PANEL.                                        POKCS088
138200                                                                  POKCS088
138300     INITIALIZE                  ASC-BLOCK-ENTRIES (1)            POKCS088
138400                                 ASC-BLOCK-ENTRIES (2).           POKCS088
138500     MOVE +1                 TO ASC-BLK-SUB.                      POKCS088
138600     SET ASC-ITEMS-LEFT-ON-DB                                     POKCS088
138700                             TO TRUE.                             POKCS088
138800                                                                  POKCS088
138900     MOVE +0                 TO ASC-ITEM-SUB                      POKCS088
139000                                ASC-NUMBER-OF-ITEMS-READ          POKCS088
139100                                ASC-NUMBER-OF-SELECTED-ITEMS      POKCS088
139200                                ASC-HIGHEST-BLOCK-WRITTEN         POKCS088
139300                                ASC-START-OF-SELECTED-RANGE       POKCS088
139400                                ASC-END-OF-SELECTED-RANGE         POKCS088
139500                                ASC-ITEM-AT-TOP-OF-PANEL.         POKCS088
139600                                                                  POKCS088
139700*    PERFORM 4050-PREPARE-CURSOR-KEY                              POKCS088
139800                                                                  POKCS088
139900     PERFORM 4010-OPEN-CURSOR.                                    POKCS088
140000                                                                  POKCS088
140100     PERFORM 4200-READ-ITEMS-FROM-DB.                             POKCS088
140200                                                                  POKCS088
140300     PERFORM 4020-CLOSE-CURSOR.                                   POKCS088
140400                                                                  POKCS088
140500     MOVE +1                   TO  PV-TOP-ITEM.                   POKCS088
140600*    IF  ASC-NUMBER-OF-ITEMS-READ = ZERO                          POKCS088
140700*        SET DP020-NEXT-ACT-APPL-ERROR TO TRUE                    POKCS088
140800*        SET DP020-MSG-FATAL   TO  TRUE                           POKCS088
140900*        MOVE PC-TSYMSG-00050  TO  DP020-MSG-NUMBER               POKCS088
141000*    ELSE                                                         POKCS088
141100*        MOVE -1               TO MR-SELECTL (1).                 POKCS088
141200         SET DP030-SET-CURSOR-APPL-1                              POKCS088
141300                               TO TRUE.                           POKCS088
141400         PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                    POKCS088
141500*    END-IF.                                                      POKCS088
141600                                                                  POKCS088
141700*----------------------------------------------------------------*POKCS088
141800* PREPARE THE DB KEY BY REPLACING * WITH %                       *POKCS088
141900*----------------------------------------------------------------*POKCS088
142000*4050-PREPARE-CURSOR-KEY.                                         POKCS088
142100*                                                                 POKCS088
142200*    MOVE ASC-KEY-VEND-NAME    TO DK-VEND-NAME.                   POKCS088
142300*    MOVE ASC-KEY-STATUS-CODE  TO DK-STATUS-CODE.                 POKCS088
142400*    IF DK-VEND-NAME > SPACES                                     POKCS088
142500*        IF DK-VEND-NAME-BYTE (1) = '*'                           POKCS088
142600*            MOVE PC-PERCENT   TO DK-VEND-NAME-BYTE (1)           POKCS088
142700*            INSPECT DK-VEND-NAME                                 POKCS088
142800*                REPLACING FIRST '*' BY PC-PERCENT                POKCS088
142900*        END-IF                                                   POKCS088
143000*        SET PS-NOT-DONE TO TRUE                                  POKCS088
143100*        PERFORM VARYING PV-SUB                                   POKCS088
143200*            FROM LENGTH OF DK-VEND-NAME BY -1                    POKCS088
143300*            UNTIL PV-SUB = 1                                     POKCS088
143400*               OR PS-DONE                                        POKCS088
143500*                IF DK-VEND-NAME-BYTE (PV-SUB) = '*'              POKCS088
143600*                    MOVE PC-PERCENT TO DK-VEND-NAME-BYTE (PV-SUB)POKCS088
143700*                    SET PS-DONE TO TRUE                          POKCS088
143800*                END-IF                                           POKCS088
143900**               IF DK-VEND-NAME-BYTE (PV-SUB) > SPACES           POKCS088
144000*                    SET PS-DONE TO TRUE                          POKCS088
144100*                ELSE                                             POKCS088
144200*                    MOVE PC-PERCENT TO DK-VEND-NAME-BYTE (PV-SUB)POKCS088
144300*                END-IF                                           POKCS088
144400*        END-PERFORM                                              POKCS088
144500*    ELSE                                                         POKCS088
144600*        MOVE ALL '%' TO DK-VEND-NAME.                            POKCS088
144700                                                                  POKCS088
144800*----------------------------------------------------------------*POKCS088
144900* OPEN  THE VENDOR   CURSOR.                                     *POKCS088
145000*----------------------------------------------------------------*POKCS088
145100 4010-OPEN-CURSOR.                                                POKCS088
145200                                                                  POKCS088
145300     PERFORM                                                      POKCS088
145400         WITH TEST AFTER                                          POKCS088
145500         VARYING PV-RETRY-COUNTER                                 POKCS088
145600         FROM 1 BY 1                                              POKCS088
145700         UNTIL ((PV-RETRY-COUNTER > PC-MAX-RETRIES)               POKCS088
145800                   OR (SQLCODE = ZERO))                           POKCS088
145900             MOVE 'CURSOR:  RSNDSC_CSR'                                 88
146000                               TO DP013-MESSAGE-TEXT (2)          POKCS088
146100             EXEC SQL                                             POKCS088
146200                  OPEN RSNDSC_CSR                                       88
146300             END-EXEC                                             POKCS088
146400                                                                  POKCS088
146500         EVALUATE TRUE                                            POKCS088
146600             WHEN SQLCODE = ZERO                                  POKCS088
146700             WHEN SQLCODE = -904                                  POKCS088
146800             WHEN SQLCODE = -913                                  POKCS088
146900                 CONTINUE                                         POKCS088
147000             WHEN SQLWARN0 NOT = SPACES                           POKCS088
147100             WHEN SQLCODE < ZERO                                  POKCS088
147200             WHEN SQLCODE > ZERO                                  POKCS088
147300                 MOVE '4010-OPEN-CURSOR'                          POKCS088
147400                                   TO DP013-PARAGRAPH             POKCS088
147500                 MOVE 'OPEN VENDOR CURSOR - '                     POKCS088
147600                                   TO DP013-MESSAGE-TEXT (1)      POKCS088
147700                 MOVE SQLCA        TO DP013-SQLCA                 POKCS088
147800                 MOVE 'TSYMSG  '   TO DP013-DB2-TABLE-NAME (1)    POKCS088
147900                 SET DP013-DB2-ABEND                              POKCS088
148000                     DP013-XCTL-DISPLAY-RESTART TO TRUE           POKCS088
148100                 PERFORM DP013-0000-PROCESS-ABEND                 POKCS088
148200         END-EVALUATE                                             POKCS088
148300     END-PERFORM.                                                 POKCS088
148400                                                                  POKCS088
148500     IF  PV-RETRY-COUNTER > PC-MAX-RETRIES                        POKCS088
148600         MOVE '4010-OPEN-CURSOR'   TO DP013-PARAGRAPH             POKCS088
148700         MOVE 'MAXIMUM RETRIES EXCEEDED ATTEMPTING TO OPEN CSR'   POKCS088
148800                                   TO DP013-MESSAGE-TEXT (1)      POKCS088
148900         MOVE SQLCA                TO DP013-SQLCA                 POKCS088
149000         MOVE 'TSYMSG  '           TO DP013-DB2-TABLE-NAME (1)    POKCS088
149100         SET DP013-DB2-ABEND                                      POKCS088
149200             DP013-XCTL-DISPLAY-RESTART                           POKCS088
149300                                   TO TRUE                        POKCS088
149400         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
149500     END-IF.                                                      POKCS088
149600                                                                  POKCS088
149700*----------------------------------------------------------------*POKCS088
149800*    READ THE ITEMS FROM THE DATA BASE AND MOVE THEM INTO THE    *POKCS088
149900*    BLOCKS IN THE ARRAY.  WHENEVER BOTH BLOCKS BECOME FULL,     *POKCS088
150000*    WRITE OUT THE 1ST BLOCK TO TEMPORARY STORAGE, MOVE THE 2ND  *POKCS088
150100*    BLOCK IN THE ARRAY TO THE 1ST BLOCK, AND INITIALIZE THE     *POKCS088
150200*    2ND BLOCK MAKING IT AVAILABLE TO BE USED.                   *POKCS088
150300*----------------------------------------------------------------*POKCS088
150400 4200-READ-ITEMS-FROM-DB.                                         POKCS088
150500                                                                  POKCS088
150600     PERFORM VARYING PV-READ-COUNT  FROM 1 BY 1                      CL**3
150700             UNTIL   PV-READ-COUNT > PC-MAX-ITEMS OR                 CL**3
150800                     ASC-NO-ITEMS-LEFT-ON-DB                         CL**3
150900                                                                  POKCS088
151000             PERFORM 4210-FETCH-CURSOR                               CL**3
151100                                                                  POKCS088
151200             IF ASC-ITEMS-LEFT-ON-DB                                 CL**3
151300                IF ASC-ITEM-SUB < PC-ITEMS-PER-PANEL                 CL**3
151400                    CONTINUE                                         CL*10
151500                ELSE                                                 CL**3
151600                    ADD  +1 TO ASC-BLK-SUB                           CL**3
151700                    MOVE +0 TO ASC-ITEM-SUB                          CL**9
151800                    IF ASC-BLK-SUB > PC-MAX-BLOCKS-IN-ARRAY          CL**3
151900                        MOVE +1 TO ASC-BLK-SUB                       CL**3
152000                        SET ASC-BLOCK-MODIFIED (1) TO TRUE           CL**3
152100                                                                     CL**3
152200                        PERFORM 5100-WRITE-TEMP-STORAGE              CL**3
152300                                                                     CL**3
152400                        MOVE ASC-BLOCK-ENTRIES                       CL**3
152500                                          (PC-MAX-BLOCKS-IN-ARRAY)   CL**3
152600                                TO ASC-BLOCK-ENTRIES (ASC-BLK-SUB)   CL**3
152700                        ADD +1 TO ASC-BLK-SUB                        CL**3
152800                        INITIALIZE ASC-BLOCK-ENTRIES (ASC-BLK-SUB)   CL**3
152900                        SET ASC-BLOCK-NOT-MODIFIED   (ASC-BLK-SUB)   CL**3
153000                                                           TO TRUE   CL**3
153100                    END-IF                                           CL**3
153200                END-IF                                               CL**3
153300                PERFORM 4220-MOVE-DB-ITEMS THRU 4220-EXIT               10
153400             END-IF                                                  CL**3
153500     END-PERFORM.                                                 POKCS088
153600                                                                  POKCS088
153700     IF ASC-NUMBER-OF-ITEMS-READ > ZERO                              CL**3
153800         MOVE +1 TO ASC-BLK-SUB                                      CL**3
153900                                                                     CL**3
154000         PERFORM 5100-WRITE-TEMP-STORAGE                          POKCS088
154100                                                                     CL**3
154200         ADD  +1 TO ASC-BLK-SUB                                      CL**3
154300                                                                     CL**8
154400         PERFORM 5100-WRITE-TEMP-STORAGE                          POKCS088
154500                                                                  POKCS088
154600         MOVE 1  TO ASC-BLK-SUB                                      CL**3
154700                    PV-BLOCK-NUMBER                                  CL**3
154800                                                                     CL**3
154900         PERFORM 4410-READ-TEMP-STORAGE                           POKCS088
155000                                                                     CL**3
155100         IF ASC-HIGHEST-BLOCK-WRITTEN > 1                            CL**3
155200             MOVE 2 TO ASC-BLK-SUB                                   CL**3
155300                       PV-BLOCK-NUMBER                               CL**3
155400                                                                     CL**3
155500             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
155600         END-IF                                                   POKCS088
155700     END-IF.                                                      POKCS088
155800                                                                  POKCS088
155900 4210-FETCH-CURSOR.                                               POKCS088
156000                                                                  POKCS088
156100     EXEC SQL                                                     POKCS088
156210          FETCH RSNDSC_CSR                                              88
156300          INTO  :PTRDSC-REQ-RSN-CDE                                     *3
156400               ,:PTRDSC-REQ-RSN-DESC                                    *3
156900     END-EXEC                                                     POKCS088
157000                                                                  POKCS088
157100     EVALUATE TRUE                                                POKCS088
157200         WHEN SQLCODE = ZERO                                      POKCS088
157300         WHEN SQLCODE = +100                                      POKCS088
157400              CONTINUE                                            POKCS088
157500         WHEN SQLWARN0 NOT = SPACE                                POKCS088
157600         WHEN SQLCODE NOT = ZERO                                  POKCS088
157700              MOVE '4210-FETCH-CURSOR'                            POKCS088
157800                               TO DP013-PARAGRAPH                 POKCS088
157900              MOVE 'FETCH VENDOR CURSOR'                          POKCS088
158000                               TO DP013-MESSAGE-TEXT (1)          POKCS088
158100              MOVE SQLCA       TO DP013-SQLCA                     POKCS088
158200              SET DP013-DB2-ABEND                                 POKCS088
158300                               TO TRUE                            POKCS088
158400              PERFORM DP013-0000-PROCESS-ABEND                    POKCS088
158500     END-EVALUATE.                                                POKCS088
158600                                                                  POKCS088
158700     IF  SQLCODE EQUAL +100                                       POKCS088
158800         SET ASC-NO-ITEMS-LEFT-ON-DB                              POKCS088
158900                                   TO TRUE                        POKCS088
159000     END-IF.                                                      POKCS088
159100                                                                  POKCS088
159200 4220-MOVE-DB-ITEMS.                                                    10
162100                                                                     CL**3
162200     ADD +1 TO ASC-ITEM-SUB                                          CL**7
162300               ASC-NUMBER-OF-ITEMS-READ.                             CL**7
162400     MOVE ASC-NUMBER-OF-ITEMS-READ TO ASC-LIST-ITEM-NUMBER           CL**3
162500                                       (ASC-BLK-SUB ASC-ITEM-SUB).   CL**3
162810     MOVE PTRDSC-REQ-RSN-CDE TO    ASC-REQ-RSN-CDE                      *3
162900                                       (ASC-BLK-SUB ASC-ITEM-SUB).   CL**3
163020     MOVE PTRDSC-REQ-RSN-DESC  TO ASC-REQ-RSN-DESC                      *2
163100                                       (ASC-BLK-SUB ASC-ITEM-SUB).   CL**3
163110     IF PS-RSN-SEL-FOUND                                                  
163111         SET PS-NO-LIST-END TO TRUE                                       
163112         SET VL008-IDX TO 1                                               
163120         PERFORM  2140-GET-NEXT-RSN                                       
163121             UNTIL PS-LIST-END                                            
163130     ELSE                                                                 
163200        PERFORM 4030-SELECT-REASON                                        
163300           IF SQLCODE = 0                                                 
163400             SET ASC-SELECT                                               
163410                     (ASC-BLK-SUB ASC-ITEM-SUB)                         *3
163411                 ASC-TEMP-SELECT                                          
163412                     (ASC-BLK-SUB ASC-ITEM-SUB) TO TRUE                 *3
163420             ADD +1                                                       
163430                    TO ASC-NUMBER-OF-SELECTED-ITEMS                       
163440*                      VL005-NUMBER-OF-RSN-CODES                        *8
163500        ELSE                                                              
163600             CONTINUE                                                     
163700        END-IF                                                            
163710     END-IF.                                                              
163800 4220-EXIT.                                                          CL**3
163900     EXIT.                                                           CL**3
167400                                                                  POKCS088
167500*----------------------------------------------------------------*POKCS088
167600* CLOSE THE VENDOR   CURSOR.                                     *POKCS088
167700*----------------------------------------------------------------*POKCS088
167800 4020-CLOSE-CURSOR.                                               POKCS088
167900                                                                  POKCS088
168000     EXEC SQL                                                     POKCS088
168100         CLOSE RSNDSC_CSR                                               88
168200     END-EXEC                                                     POKCS088
168300                                                                  POKCS088
168400     EVALUATE TRUE                                                POKCS088
168500         WHEN SQLCODE = ZERO                                      POKCS088
168600             CONTINUE                                             POKCS088
168700         WHEN SQLWARN0 NOT = SPACES                               POKCS088
168800         WHEN SQLCODE < ZERO                                      POKCS088
168900         WHEN SQLCODE > ZERO                                      POKCS088
169000             MOVE '4020-CLOSE-CURSOR'                             POKCS088
169100                               TO DP013-PARAGRAPH                 POKCS088
169200             MOVE 'CLOSE VENDOR CURSOR '                          POKCS088
169300                               TO DP013-MESSAGE-TEXT (1)          POKCS088
169400             MOVE SQLCA        TO DP013-SQLCA                     POKCS088
169500             MOVE 'TSYMSG  '   TO DP013-DB2-TABLE-NAME (1)        POKCS088
169600             SET DP013-DB2-ABEND                                  POKCS088
169700                 DP013-XCTL-DISPLAY-RESTART TO TRUE               POKCS088
169800             PERFORM DP013-0000-PROCESS-ABEND                     POKCS088
169900     END-EVALUATE.                                                POKCS088
170000                                                                  POKCS088
170001 4030-SELECT-REASON.                                              POKCS088
170002                                                                  RCKCS279
170003     EXEC SQL                                                     RCKCS279
170004         SELECT PO_REQ_NBR                                              79
170005               ,REQ_RSN_CDE                                             79
170006         INTO :PTKRSN-PO-REQ-NBR                                        79
170007             ,:PTKRSN-REQ-RSN-CDE                                       79
170008         FROM  TPTKRSN                                                  79
170009         WHERE PO_REQ_NBR    = :DK-PO-REQ-NBR                           79
170010           AND REQ_RSN_CDE   = :PTRDSC-REQ-RSN-CDE                      *3
170013     END-EXEC                                                     RCKCS279
170014                                                                  RCKCS279
170015     EVALUATE TRUE                                                RCKCS279
170016         WHEN SQLCODE = ZERO                                      RCKCS279
170017             CONTINUE                                                   79
170018         WHEN SQLCODE = +100                                      RCKCS279
170019             CONTINUE                                                   79
170023         WHEN SQLCODE = -904                                      RCKCS279
170024         WHEN SQLCODE = -911                                      RCKCS279
170025         WHEN SQLCODE = -913                                      RCKCS279
170026             PERFORM 9900-SOFT-ABORT                              RCKCS279
170027         WHEN SQLWARN0 NOT = SPACE                                RCKCS279
170028         WHEN SQLCODE < ZERO                                      RCKCS279
170029         WHEN SQLCODE > ZERO                                      RCKCS279
170030             MOVE '4030-SELECT-REASON'                                  79
170031                             TO DP013-PARAGRAPH                   RCKCS279
170032             MOVE 'SELECT ON TPTKRSN'                                   79
170033                             TO DP013-MESSAGE-TEXT (1)            RCKCS279
170034             MOVE SQLCA          TO DP013-SQLCA                   RCKCS279
170035             MOVE 'TTRBNTF'      TO DP013-DB2-TABLE-NAME (1)      RCKCS279
170036             MOVE 'TTRBRSN'      TO DP013-DB2-TABLE-NAME (2)      RCKCS279
170037             SET DP013-DB2-ABEND                                  RCKCS279
170038                 DP013-XCTL-DISPLAY-RESTART                       RCKCS279
170039                             TO TRUE                              RCKCS279
170040              PERFORM DP013-0000-PROCESS-ABEND                    RCKCS279
170041     END-EVALUATE.                                                RCKCS279
170050/                                                                 RCKCS279
170100*----------------------------------------------------------------*POKCS088
170200* MOVE THE DISPLAYED FIELDS FROM THE COMMAREA TO THE SCREEN.     *POKCS088
170300*----------------------------------------------------------------*POKCS088
170400 4400-MOVE-COMMAREA-TO-SCREEN.                                    POKCS088
170500                                                                  POKCS088
170600     IF  (((PV-TOP-ITEM > ASC-LIST-ITEM-NUMBER (1 1))             POKCS088
170700         AND (PV-TOP-ITEM > ASC-LIST-ITEM-NUMBER (2 1)))          POKCS088
170800         OR  (PV-TOP-ITEM < ASC-LIST-ITEM-NUMBER (1 1)))          POKCS088
170900             MOVE +1    TO ASC-BLK-SUB                            POKCS088
171000             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
171100             ADD +1     TO ASC-BLK-SUB                            POKCS088
171200             PERFORM 5100-WRITE-TEMP-STORAGE                      POKCS088
171300             DIVIDE PV-TOP-ITEM BY PC-ITEMS-PER-PANEL             POKCS088
171400                 GIVING PV-BLOCK-NUMBER                           POKCS088
171500                 REMAINDER PV-REMAINDER                           POKCS088
171600             IF  PV-REMAINDER > ZERO                              POKCS088
171700                 ADD +1 TO PV-BLOCK-NUMBER                        POKCS088
171800             END-IF                                               POKCS088
171900             MOVE +1    TO ASC-BLK-SUB                            POKCS088
172000             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
172100             ADD +1     TO ASC-BLK-SUB                            POKCS088
172200                           PV-BLOCK-NUMBER                        POKCS088
172300             PERFORM 4410-READ-TEMP-STORAGE                       POKCS088
172400     END-IF.                                                      POKCS088
172500     MOVE +1            TO ASC-BLK-SUB.                           POKCS088
172600     COMPUTE ASC-ITEM-SUB =                                       POKCS088
172700         ((PV-TOP-ITEM - ASC-LIST-ITEM-NUMBER (1 1))              POKCS088
172800         + PC-ITEMS-PER-PANEL).                                   POKCS088
172900                                                                  POKCS088
173000     IF  ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                        POKCS088
173100         ADD +1         TO ASC-BLK-SUB                            POKCS088
173200         SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-SUB            POKCS088
173300     END-IF.                                                      POKCS088
173400                                                                  POKCS088
173500     COMPUTE ASC-ITEM-AT-BOT-OF-PANEL =                           POKCS088
173600         ((PV-TOP-ITEM + PC-ITEMS-PER-PANEL) - 1).                POKCS088
173700     PERFORM 4430-CHECK-FOR-BEGIN-AND-END.                        POKCS088
173800     PERFORM 4420-FORMAT-LIST-LINES                               POKCS088
173900         VARYING PV-SUB                                           POKCS088
174000         FROM PC-ITEMS-PER-PANEL BY -1                            POKCS088
174100         UNTIL PV-SUB < +1.                                       POKCS088
174200                                                                  POKCS088
174300     COMPUTE ASC-ITEMS-DISPLAYED =                                POKCS088
174400         ((ASC-ITEM-AT-BOT-OF-PANEL - PV-TOP-ITEM) + 1).          POKCS088
174500     MOVE PV-TOP-ITEM              TO ASC-ITEM-AT-TOP-OF-PANEL          88
174600                                      ASTRTITO.                   POKCS088
174700     MOVE ASC-ITEM-AT-BOT-OF-PANEL TO AENDITO.                    POKCS088
174800     MOVE ASC-NUMBER-OF-ITEMS-READ TO ATOTITO.                    POKCS088
174900     MOVE ASC-NUMBER-OF-SELECTED-ITEMS                            POKCS088
175000                                   TO ASELITO.                    POKCS088
175010     MOVE ASC-PO-NUMBER            TO APONBRO.                            
175100                                                                  POKCS088
175200     IF  DP020-MSG-NUMBER-X = SPACE                               POKCS088
175300         IF  ASC-ITEM-AT-BOT-OF-PANEL < ASC-NUMBER-OF-ITEMS-READ  POKCS088
175400*            --- MORE ITEMS TO DISPLAY ----                       POKCS088
175500             MOVE PC-TSYMSG-00279  TO DP020-MSG-NUMBER            POKCS088
175600             SET DP020-MSG-INFORMATIONAL TO TRUE                  POKCS088
175700         END-IF                                                   POKCS088
175800     END-IF.                                                      POKCS088
175900                                                                  POKCS088
176000*----------------------------------------------------------------*POKCS088
176100*    READ A BLOCK FROM TEMPORARY STORAGE INTO THE ARRAY.         *POKCS088
176200*----------------------------------------------------------------*POKCS088
176300 4410-READ-TEMP-STORAGE.                                          POKCS088
176400                                                                  POKCS088
176500     EXEC CICS                                                    POKCS088
176600         READQ TS                                                 POKCS088
176700             QUEUE (ASC-LIST-QUEUE-NAME)                          POKCS088
176800             INTO  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               POKCS088
176900             ITEM  (PV-BLOCK-NUMBER)                              POKCS088
177000             RESP  (PV-CICS-RESP)                                 POKCS088
177100     END-EXEC.                                                    POKCS088
177200                                                                  POKCS088
177300     IF  ((PV-CICS-RESP = DFHRESP (NORMAL))                       POKCS088
177400       OR (PV-CICS-RESP = DFHRESP (ITEMERR)))                     POKCS088
177500         CONTINUE                                                 POKCS088
177600     ELSE                                                         POKCS088
177700         SET DP013-CICS-ABEND     TO TRUE                         POKCS088
177800         SET DP013-NO-ROLLBACK    TO TRUE                         POKCS088
177900         MOVE '4410-READ-TEMP-STORAGE'                            POKCS088
178000                                  TO DP013-PARAGRAPH              POKCS088
178100         MOVE 'ERROR TRYING TO READ FROM TEMP STORAGE QUEUE'      POKCS088
178200                                  TO DP013-MESSAGE-TEXT(1)        POKCS088
178300         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
178400     END-IF.                                                      POKCS088
178500                                                                  POKCS088
178600     SET ASC-BLOCK-NOT-MODIFIED(ASC-BLK-SUB) TO TRUE.             POKCS088
178700                                                                  POKCS088
178800     IF  PV-CICS-RESP = DFHRESP (ITEMERR)                         POKCS088
178900         INITIALIZE ASC-BLOCK-ENTRIES (ASC-BLK-SUB)               POKCS088
179000     END-IF.                                                      POKCS088
179100                                                                  POKCS088
179200*----------------------------------------------------------------*POKCS088
179300*    PROCESS THE ITEMS IN THE ARRAY AND MOVE THEM TO THE MAP.    *POKCS088
179400*----------------------------------------------------------------*POKCS088
179500 4420-FORMAT-LIST-LINES.                                          POKCS088
179600                                                                  POKCS088
179700     IF ASC-ITEM-AT-BOT-OF-PANEL > ASC-NUMBER-OF-ITEMS-READ          CL**6
179800         SUBTRACT +1 FROM ASC-ITEM-AT-BOT-OF-PANEL                POKCS088
179900         MOVE DP015-ASK-DRK-OFF  TO MR-SELECTA   (PV-SUB)            CL**6
180000         MOVE SPACES             TO MR-SELECTI   (PV-SUB)            CL**6
180200                                    MR-RSN       (PV-SUB)            CL**6
180300                                    MR-DESC      (PV-SUB)         POKCS088
180600     ELSE                                                         POKCS088
180700         IF ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)          CL**6
180800                                                           > SPACE   CL**6
180900             MOVE ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB) POKCS088
181000                                           TO MR-SELECTI (PV-SUB)    CL**6
181100         ELSE                                                     POKCS088
181200             MOVE ASC-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)      POKCS088
181300                                           TO MR-SELECTI (PV-SUB)    CL**6
181400         END-IF                                                   POKCS088
181500                                                                  POKCS088
181600         IF DP030-SET-CURSOR-TRAILER                                 CL**6
181700             IF ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)      CL**6
181800                                                           > SPACE   CL**6
181900                OR PV-SUB = 1                                        CL**6
182000                 SET DP030-SET-CURSOR-APPL-1 TO TRUE                 CL**6
182100                 MOVE -1 TO MR-SELECTL (PV-SUB)                      CL**6
182200             END-IF                                               POKCS088
182300         END-IF                                                   POKCS088
182400                                                                  POKCS088
182500         IF PV-TOP-ITEM NOT = ASC-ITEM-AT-TOP-OF-PANEL               CL**6
182800*            IF ASC-REQ-RSN-CDE   (ASC-BLK-SUB ASC-ITEM-SUB) =          *5
182803*                VL005-REQ-RSN-CDE                                        
182804*                    MOVE 'ADD' TO MR-ACTION (PV-SUB)                     
182805*            ELSE                                                         
182806*                MOVE ASC-ACTION    (ASC-BLK-SUB ASC-ITEM-SUB)          *6
182807*                                            TO MR-ACTION (PV-SUB)   CL**6
182808*            END-IF                                                       
182810             MOVE ASC-REQ-RSN-CDE (ASC-BLK-SUB ASC-ITEM-SUB)            *5
182900                                      TO MR-RSN (PV-SUB)                *6
183000             MOVE ASC-REQ-RSN-DESC (ASC-BLK-SUB ASC-ITEM-SUB)           *5
183100                                          TO MR-DESC (PV-SUB)           *6
184400                                                                        84
184500     END-IF.                                                      POKCS088
184600                                                                     CL**6
184700     SUBTRACT +1 FROM ASC-ITEM-SUB.                                  CL**6
184800                                                                     CL**6
184900     IF ASC-ITEM-SUB < + 1                                           CL**6
185000         MOVE PC-ITEMS-PER-PANEL TO ASC-ITEM-SUB                  POKCS088
185100         MOVE +1                 TO ASC-BLK-SUB                   POKCS088
185200     END-IF.                                                      POKCS088
185300                                                                  POKCS088
185400******************************************************************POKCS088
185500** IF A BEGINNING OF RANGE WAS SPECIFIED, MAKE SURE AN END OF   **POKCS088
185600** RANGE WAS SPECIFIED AND VICE-VERSA.  IF ONE IS MISSING,      **POKCS088
185700** ISSUE A WARNING.                                             **POKCS088
185800******************************************************************POKCS088
185900 4430-CHECK-FOR-BEGIN-AND-END.                                    POKCS088
186000                                                                  POKCS088
186100     IF  ASC-START-OF-SELECTED-RANGE > ZERO                       POKCS088
186200         IF  ASC-END-OF-SELECTED-RANGE = ZERO                     POKCS088
186300*            -- NO END-OF-RANGE SPECFIED ---                      POKCS088
186400             MOVE PC-TSYMSG-00051  TO DP020-MSG-NUMBER            POKCS088
186500             SET DP020-MSG-WARNING TO TRUE                        POKCS088
186600             PERFORM 4431-POSITION-AT-WARNING                     POKCS088
186700         END-IF                                                   POKCS088
186800     ELSE                                                         POKCS088
186900         IF  ASC-END-OF-SELECTED-RANGE > ZERO                     POKCS088
187000*            -- NO BEGINNING-OF-RANGE SPECFIED ---                POKCS088
187100             MOVE PC-TSYMSG-00053  TO DP020-MSG-NUMBER            POKCS088
187200             SET DP020-MSG-WARNING TO TRUE                        POKCS088
187300             PERFORM 4431-POSITION-AT-WARNING                     POKCS088
187400         END-IF                                                   POKCS088
187500     END-IF.                                                      POKCS088
187600                                                                  POKCS088
187700******************************************************************POKCS088
187800** ONCE IT HAS BEEN DETERMINED THAT A WARNING IS TO BE ISSUED,  **POKCS088
187900** DETERMINE IF EITHER THE BEGINNING OF RANGE OR END OF RANGE   **POKCS088
188000** IS ON THE CURRENT SCREEN.  IF IT IS, HIGHLIGHT IT AND        **POKCS088
188100** POSITION THE CURSOR THERE.                                   **POKCS088
188200******************************************************************POKCS088
188300 4431-POSITION-AT-WARNING.                                        POKCS088
188400                                                                  POKCS088
188500     COMPUTE PV-SUB = ASC-START-OF-SELECTED-RANGE                 POKCS088
188600                    - PV-TOP-ITEM + 1.                            POKCS088
188700     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      POKCS088
188800         CONTINUE                                                 POKCS088
188900     ELSE                                                         POKCS088
189000         SET DP030-SET-CURSOR-APPL-1                              POKCS088
189100                                   TO TRUE                        POKCS088
189200         MOVE -1                   TO MR-SELECTL (PV-SUB)         POKCS088
189300         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         POKCS088
189400         MOVE DP015-YELLOW         TO MR-SELECTC (PV-SUB)         POKCS088
189500     END-IF.                                                      POKCS088
189600                                                                  POKCS088
189700     COMPUTE PV-SUB = ASC-END-OF-SELECTED-RANGE                   POKCS088
189800                    - PV-TOP-ITEM + 1.                            POKCS088
189900     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      POKCS088
190000         CONTINUE                                                 POKCS088
190100     ELSE                                                         POKCS088
190200         SET DP030-SET-CURSOR-APPL-1                              POKCS088
190300                                   TO TRUE                        POKCS088
190400         MOVE -1                   TO MR-SELECTL (PV-SUB)         POKCS088
190500         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         POKCS088
190600         MOVE DP015-YELLOW         TO MR-SELECTC (PV-SUB)         POKCS088
190700     END-IF.                                                      POKCS088
190800                                                                  POKCS088
190900*----------------------------------------------------------------*POKCS088
191000* PREPARE THE SELECTED ITEMS TEMP STORAGE QUEUE.  MOVE ALL SEL-  *POKCS088
191100* ECTED ITEMS FROM THE LIST TEMP STORAGE QUEUE TO THE LAYOUT     *POKCS088
191200* FOR THE SELECTED ITEMS QUEUE.                                  *POKCS088
191300*                                                                *POKCS088
191400* FIRST, DELETE THE SELECTION QUEUE, NEXT LOAD THE SELECTION     *POKCS088
191500* QUEUE RECORD.  FINALLY, WRITE THE SELECTION QUEUE ITEM WHEN    *POKCS088
191600* THE ARRAY IS FULL.                                             *POKCS088
191700*----------------------------------------------------------------*POKCS088
191800 5000-PREPARE-SEL-QUEUE.                                          POKCS088
191900                                                                  POKCS088
192000     MOVE +1                   TO  ASC-BLK-SUB.                   POKCS088
192100     PERFORM 5100-WRITE-TEMP-STORAGE.                             POKCS088
192200     ADD +1                    TO  ASC-BLK-SUB.                   POKCS088
192300     PERFORM 5100-WRITE-TEMP-STORAGE.                             POKCS088
192400                                                                  POKCS088
192503     MOVE ASC-SEL-QUEUE-NAME   TO                                   *    8
192504                  VL005-RSN-QUEUE-NAME                               CL**1
192505     INITIALIZE VL005-NUMBER-OF-RSN-CODES                                 
192530                                                                          
192600     PERFORM 6010-DELETE-SEL-QUEUE.                               POKCS088
192700                                                                  POKCS088
192800     SET ASC-UPDATE-TSQ        TO  TRUE.                          POKCS088
192900     SET PS-RSN-QUEUE-NOT-WRITTEN  TO TRUE.                       POKCS088
193000     SET VL008-IDX             TO  1.                             POKCS088
193100     MOVE ZERO                 TO VL005-NUMBER-OF-RSN-TS-ITEMS.         88
193200     INITIALIZE VL008-SELECTED-ITEM-ARRAY.                        POKCS088
193300                                                                  POKCS088
193400     PERFORM 5200-FILL-SEL-QUEUE-RECORD                           POKCS088
193500             VARYING PV-ITEM                                      POKCS088
193600             FROM 1 BY 1                                          POKCS088
193700             UNTIL PV-ITEM GREATER ASC-HIGHEST-BLOCK-WRITTEN.     POKCS088
193800                                                                  POKCS088
193900     IF  VL008-IDX > 1                                            POKCS088
194000         PERFORM 5205-WRITE-SEL-QUEUE                             POKCS088
194100         ADD +1                TO VL005-NUMBER-OF-RSN-TS-ITEMS          88
194200     END-IF.                                                      POKCS088
194300                                                                  POKCS088
194310     IF PS-RSN-QUEUE-NOT-WRITTEN                                          
194311         PERFORM 5205-WRITE-SEL-QUEUE                             POKCS088
194320         MOVE 1 TO VL005-NUMBER-OF-RSN-TS-ITEMS                           
194330     END-IF.                                                      POKCS088
194400*----------------------------------------------------------------*POKCS088
194500*    WRITE A NEW BLOCK FROM THE ARRAY TO TEMPORARY STORAGE.      *POKCS088
194600*    REWRITE AN EXISITING BLOCK ONLY IF IT HAS BEEN MODIFIED.    *POKCS088
194700*----------------------------------------------------------------*POKCS088
194800 5100-WRITE-TEMP-STORAGE.                                         POKCS088
194900                                                                  POKCS088
195000     MOVE ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB 1)                     POKCS088
195100                                   TO PV-LIST-ITEM-NUMBER.        POKCS088
195200     COMPUTE PV-BLOCK-NUMBER =                                    POKCS088
195300         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    POKCS088
195400                                                                  POKCS088
195500     IF (PV-BLOCK-NUMBER < ASC-HIGHEST-BLOCK-WRITTEN)             POKCS088
195600     OR (PV-BLOCK-NUMBER = ASC-HIGHEST-BLOCK-WRITTEN)             POKCS088
195700         IF  ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                      POKCS088
195800             PERFORM 5105-REWRITE-ASC-LISTQ                       POKCS088
195900         END-IF                                                   POKCS088
196000     ELSE                                                         POKCS088
196100         COMPUTE PV-HIGHEST-BLOCK-WRITTEN =                       POKCS088
196200         ASC-HIGHEST-BLOCK-WRITTEN + 1                            POKCS088
196300         PERFORM 5110-WRITE-ASC-LISTQ                             POKCS088
196400         ADD +1                    TO ASC-HIGHEST-BLOCK-WRITTEN   POKCS088
196500     END-IF.                                                      POKCS088
196600                                                                  POKCS088
196700     SET ASC-BLOCK-NOT-MODIFIED(ASC-BLK-SUB) TO TRUE.             POKCS088
196800******************************************************************POKCS088
196900** REWRITE THE LIST TEMP STORAGE QUEUE FROM THE APPLICATION-    **POKCS088
197000** SPECIFIC COMMAREA.                                           **POKCS088
197100******************************************************************POKCS088
197200 5105-REWRITE-ASC-LISTQ.                                          POKCS088
197300                                                                  POKCS088
197400     EXEC CICS                                                    POKCS088
197500         WRITEQ TS                                                POKCS088
197600             QUEUE (ASC-LIST-QUEUE-NAME)                          POKCS088
197700             FROM  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               POKCS088
197800             ITEM  (PV-BLOCK-NUMBER)                              POKCS088
197900             REWRITE                                              POKCS088
198000             RESP  (PV-CICS-RESP)                                 POKCS088
198100     END-EXEC.                                                    POKCS088
198200                                                                  POKCS088
198300     IF  PV-CICS-RESP = DFHRESP(NORMAL)                           POKCS088
198400         CONTINUE                                                 POKCS088
198500     ELSE                                                         POKCS088
198600         SET DP013-CICS-ABEND            TO TRUE                  POKCS088
198700         SET DP013-NO-ROLLBACK           TO TRUE                  POKCS088
198800         MOVE '5105-REWRITE-ASC-LISTQ'   TO DP013-PARAGRAPH       POKCS088
198900         MOVE 'ATTEMPTING TO REWRITE LIST TEMP STORAGE QUEUE'     POKCS088
199000                                         TO DP013-MESSAGE-TEXT(1) POKCS088
199100         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
199200     END-IF.                                                      POKCS088
199300                                                                  POKCS088
199400******************************************************************POKCS088
199500** WRITE THE LIST TEMP STORAGE QUEUE FROM THE APPLICATION-      **POKCS088
199600** SPECIFIC COMMAREA.                                           **POKCS088
199700******************************************************************POKCS088
199800 5110-WRITE-ASC-LISTQ.                                            POKCS088
199900                                                                  POKCS088
200000     EXEC CICS                                                    POKCS088
200100         WRITEQ TS                                                POKCS088
200200             QUEUE (ASC-LIST-QUEUE-NAME)                          POKCS088
200300             FROM  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               POKCS088
200400             ITEM  (PV-BLOCK-NUMBER)                              POKCS088
200500             RESP  (PV-CICS-RESP)                                 POKCS088
200600     END-EXEC.                                                    POKCS088
200700     IF  PV-CICS-RESP NOT = DFHRESP (NORMAL)                      POKCS088
200800         SET DP013-CICS-ABEND      TO TRUE                        POKCS088
200900         SET DP013-NO-ROLLBACK     TO TRUE                        POKCS088
201000         MOVE '5110-WRITE-ASC-LISTQ'                              POKCS088
201100                                   TO DP013-PARAGRAPH             POKCS088
201200         MOVE 'ATTEMPTING TO DELETE TEMP STORAGE QUEUE'           POKCS088
201300                                   TO DP013-MESSAGE-TEXT(1)       POKCS088
201400         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
201500     END-IF.                                                      POKCS088
201600                                                                  POKCS088
201700*----------------------------------------------------------------*POKCS088
201800* READ A LIST QUEUE RECORD AND MOVE THE KEYS OF SELECTED OBJECTS *POKCS088
201900* TO THE SELECTED ITEMS TEMP STORAGE QUEUE RECORD.               *POKCS088
202000*----------------------------------------------------------------*POKCS088
202100 5200-FILL-SEL-QUEUE-RECORD.                                      POKCS088
202200                                                                  POKCS088
202300     PERFORM 6112-READ-LIST-QUEUE.                                POKCS088
202400                                                                  POKCS088
202500     IF  PV-CICS-RESP EQUAL DFHRESP(NORMAL)                       POKCS088
202600         PERFORM                                                  POKCS088
202700         VARYING LQW-IDX                                          POKCS088
202800         FROM 1 BY 1                                              POKCS088
202900         UNTIL LQW-IDX GREATER THAN PC-ITEMS-PER-PANEL            POKCS088
203000           OR  LQW-LIST-ITEM-NUMBER (LQW-IDX) EQUAL ZERO          POKCS088
203100                                                                  POKCS088
203200             IF  LQW-SELECT (LQW-IDX)                             POKCS088
203300                 MOVE LQW-LIST-ITEM-NUMBER (LQW-IDX)              POKCS088
203400                                   TO VL008-ITEM (VL008-IDX)      POKCS088
203600                 MOVE LQW-REQ-RSN-CDE       (LQW-IDX)                   84
203610                           TO VL008-REQ-RSN-CDE  (VL008-IDX)            *6
203620                 ADD +1 TO VL005-NUMBER-OF-RSN-CODES                      
203900                 SET VL008-IDX UP BY 1                            POKCS088
204000                 IF  VL008-IDX > VL008-MAX-ITEMS                  POKCS088
204100                     PERFORM 5205-WRITE-SEL-QUEUE                 POKCS088
204200                     ADD +1   TO VL005-NUMBER-OF-RSN-TS-ITEMS           88
204300                     INITIALIZE VL008-SELECTED-ITEM-ARRAY         POKCS088
204400                     SET VL008-IDX TO  1                          POKCS088
204500                 END-IF                                           POKCS088
204600             END-IF                                               POKCS088
204700         END-PERFORM                                              POKCS088
204800     END-IF.                                                      POKCS088
204900                                                                  POKCS088
205000*----------------------------------------------------------------*POKCS088
205100*    WRITE THE SELECTED ITEMS TEMP STORAGE QUEUE.                *POKCS088
205200*----------------------------------------------------------------*POKCS088
205300 5205-WRITE-SEL-QUEUE.                                            POKCS088
205400                                                                  POKCS088
205500     MOVE ASC-NUMBER-OF-SELECTED-ITEMS                            POKCS088
205600                                   TO VL008-SELECTED-ITEMS              88
205620                                      VL005-NUMBER-OF-RSN-CODES.        *2
205700                                                                  POKCS088
205800     EXEC CICS                                                    POKCS088
205900          WRITEQ TS                                               POKCS088
206000              QUEUE (ASC-SEL-QUEUE-NAME)                          POKCS088
206110              FROM  (VL008-REASON-SEL-REC)                              84
206200              ITEM  (PV-SEL-QUEUE-ITEM)                           POKCS088
206300              RESP  (PV-CICS-RESP)                                POKCS088
206400     END-EXEC.                                                    POKCS088
206500                                                                  POKCS088
206600     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          POKCS088
206700         SET PS-RSN-QUEUE-WRITTEN  TO TRUE                               1
206800     ELSE                                                         POKCS088
206900         SET DP013-CICS-ABEND      TO TRUE                        POKCS088
207000         SET DP013-NO-ROLLBACK     TO TRUE                        POKCS088
207100         MOVE '5205-WRITE-SEL-QUEUE'                              POKCS088
207200                                   TO DP013-PARAGRAPH             POKCS088
207300         MOVE 'ATTEMPTING TO WRITE SELECTED ITEMS QUEUE'          POKCS088
207400                                   TO DP013-MESSAGE-TEXT(1)       POKCS088
207500         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
207600     END-IF.                                                      POKCS088
207700                                                                  POKCS088
207800******************************************************************POKCS088
207900** WHEN RETURNING TO THIS TRANSACTION FROM ANOTHER TRANSACTION, **POKCS088
208000** SETUP THE ARRAY AS IT WAS WHEN WE HAD LEFT PREVIOUSLY.  EDIT **POKCS088
208100** THE SELECTIONS MADE AT THAT TIME AND DISPLAY THE PANEL TO    **POKCS088
208200** THE USER.                                                    **POKCS088
208300******************************************************************POKCS088
208400 6000-REFRESH-PANEL-FROM-TEMP.                                    POKCS088
208500                                                                  POKCS088
208600     IF  ASC-UPDATE-TSQ                                           POKCS088
208700         SET ASC-NO-TSQ-UPDATE TO TRUE                            POKCS088
208800         MOVE ZERO                 TO PV-SAVE-ITEM                POKCS088
208900                                      PV-SEL-QUEUE-ITEM           POKCS088
209000         MOVE ASC-NUMBER-OF-SELECTED-ITEMS                        POKCS088
209100                                   TO PV-HOLD-SELECTED-ITEMS      POKCS088
209200         PERFORM 6100-UPDATE-TSQ                                  POKCS088
209300             UNTIL PV-ITEMS-PROCESSED >                           POKCS088
209400                                    ASC-NUMBER-OF-SELECTED-ITEMS.       88
209500*        PERFORM 6010-DELETE-SEL-QUEUE                            POKCS088
209600*        INITIALIZE ASC-BLOCK-ENTRIES (1)                         POKCS088
209700*                   ASC-BLOCK-ENTRIES (2).                        POKCS088
209701******ADDED                                                               
209702*        DIVIDE PV-TOP-ITEM BY PC-ITEMS-PER-PANEL                 RCK00050
209703*               GIVING PV-BLOCK-NUMBER                            RCK00050
209704*               REMAINDER PV-REMAINDER                            RCK00050
209705*        IF  PV-REMAINDER > ZERO                                  RCK00050
209706*            ADD +1     TO PV-BLOCK-NUMBER                        RCK00050
209707*        END-IF                                                   RCK00050
209708*        MOVE +1        TO ASC-BLK-SUB                            RCK00050
209709*        PERFORM 4410-READ-TEMP-STORAGE                           RCK00050
209710*        ADD +1         TO ASC-BLK-SUB                            RCK00050
209711*                          PV-BLOCK-NUMBER                        RCK00050
209712*        PERFORM 4410-READ-TEMP-STORAGE                           RCK00050
209713*                                                                 RCK00050
209720*    END-IF.                                                      RCK00050
209800                                                                        84
209810******ADDED                                                               
209900                                                                  POKCS088
210000*----------------------------------------------------------------*POKCS088
210100*    DELETE THE SELECTED ITEMS TEMP STORAGE QUEUE.               *POKCS088
210200*----------------------------------------------------------------*POKCS088
210300 6010-DELETE-SEL-QUEUE.                                           POKCS088
210400                                                                  POKCS088
210500     EXEC CICS                                                    POKCS088
210600         DELETEQ TS                                               POKCS088
210700             QUEUE (ASC-SEL-QUEUE-NAME)                           POKCS088
210800             RESP  (PV-CICS-RESP)                                 POKCS088
210900     END-EXEC.                                                    POKCS088
211000                                                                  POKCS088
211100     IF ((PV-CICS-RESP = DFHRESP(NORMAL)) OR                      POKCS088
211200        (PV-CICS-RESP = DFHRESP(QIDERR)))                         POKCS088
211300         CONTINUE                                                 POKCS088
211400     ELSE                                                         POKCS088
211500         SET DP013-CICS-ABEND TO TRUE                             POKCS088
211600         SET DP013-NO-ROLLBACK TO TRUE                            POKCS088
211700         MOVE '6010-DELETE-SEL-QUEUE'                             POKCS088
211800                        TO DP013-PARAGRAPH                        POKCS088
211900         MOVE 'ERROR TRYING TO DELETE SELECTION TS QUEUE'         POKCS088
212000                        TO DP013-MESSAGE-TEXT (1)                 POKCS088
212100         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
212200     END-IF.                                                      POKCS088
212300                                                                  POKCS088
212400*----------------------------------------------------------------*POKCS088
212500*    INCREMENT THE TSQ ITEM NUMBER AND READ THE LIST QUEUE.      *POKCS088
212600*    LOOP THROUGH THE LIST QUEUE TO OBTAIN THE LINE ITEM NUMBER  *POKCS088
212700*    TO BE USED TO UPDATE (DESELECT) THE CORRECT LINE ITEM IN    *POKCS088
212800*    THE TEMP QUEUE.                                             *POKCS088
212900*----------------------------------------------------------------*POKCS088
213000 6100-UPDATE-TSQ.                                                 POKCS088
213100                                                                  POKCS088
213200     ADD 1                     TO  PV-SEL-QUEUE-ITEM.             POKCS088
213300     PERFORM 6105-READ-SEL-QUEUE.                                 POKCS088
213400     PERFORM                                                      POKCS088
213500         VARYING VL008-IDX                                        POKCS088
213600         FROM 1 BY 1                                              POKCS088
213700         UNTIL ((PV-ITEMS-PROCESSED >                             POKCS088
213800                              PV-HOLD-SELECTED-ITEMS)             POKCS088
213900         OR (VL008-IDX GREATER THAN VL008-MAX-ITEMS))             POKCS088
214000         IF  VL008-REQ-RSN-CDE (VL008-IDX) > SPACE                      88
214100             PERFORM 6110-PROCESS-ITEMS                           POKCS088
214200         END-IF                                                   POKCS088
214300         ADD +1                TO PV-ITEMS-PROCESSED              POKCS088
214400     END-PERFORM.                                                 POKCS088
214500                                                                  POKCS088
214600     PERFORM 6111-WRITE-LIST-QUEUE.                               POKCS088
214700                                                                  POKCS088
214800*----------------------------------------------------------------*POKCS088
214900*    READ THE LIST QUEUE RECORD.                                 *POKCS088
215000*----------------------------------------------------------------*POKCS088
215100 6105-READ-SEL-QUEUE.                                             POKCS088
215200                                                                  POKCS088
215300     EXEC CICS                                                    POKCS088
215400          READQ TS                                                POKCS088
215500              QUEUE (ASC-SEL-QUEUE-NAME)                          POKCS088
215600              INTO  (VL008-REASON-SEL-REC)                              84
215700              ITEM  (PV-SEL-QUEUE-ITEM)                           POKCS088
215800              RESP  (PV-CICS-RESP)                                POKCS088
215900     END-EXEC.                                                    POKCS088
216000                                                                  POKCS088
216100     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          POKCS088
216200         CONTINUE                                                 POKCS088
216300     ELSE                                                         POKCS088
216400         SET DP013-CICS-ABEND      TO  TRUE                       POKCS088
216500         SET DP013-NO-ROLLBACK     TO  TRUE                       POKCS088
216600         MOVE '6105-READ-SEL-QUEUE'                               POKCS088
216700                                   TO  DP013-PARAGRAPH            POKCS088
216800         MOVE 'ATTEMPTING TO READ SELECTED ITEMS QUEUE'           POKCS088
216900                                   TO  DP013-MESSAGE-TEXT(1)      POKCS088
217000         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
217100     END-IF.                                                      POKCS088
217200                                                                  POKCS088
217300*----------------------------------------------------------------*POKCS088
217400*    CALCULATE THE TEMP QUEUE ITEM THAT MUST BE READ AND READ IT.*POKCS088
217500*    REWRITE THE CURRENT TEMP QUEUE ITEM IF NECESSARY.  CALCULATE*POKCS088
217600*    THE LINE ITEM OCCURENCE AND UPDATE (DESELECT) IT.           *POKCS088
217700*----------------------------------------------------------------*POKCS088
217800 6110-PROCESS-ITEMS.                                              POKCS088
217900                                                                  POKCS088
218000     COMPUTE PV-ITEM = 1 + ((VL008-ITEM (VL008-IDX) - 1)          POKCS088
218100                     / PC-ITEMS-PER-PANEL).                       POKCS088
218200                                                                  POKCS088
218300     IF  PV-ITEM NOT EQUAL PV-SAVE-ITEM                           POKCS088
218400         IF  PV-SAVE-ITEM NOT EQUAL ZERO                          POKCS088
218500             PERFORM 6111-WRITE-LIST-QUEUE                        POKCS088
218600         END-IF                                                   POKCS088
218700         MOVE PV-ITEM          TO PV-SAVE-ITEM                    POKCS088
218800                                                                  POKCS088
218900         PERFORM 6112-READ-LIST-QUEUE                             POKCS088
219000         IF  PV-CICS-RESP NOT EQUAL DFHRESP(NORMAL)               POKCS088
219100             CONTINUE                                             POKCS088
219200         END-IF                                                   POKCS088
219300     END-IF.                                                      POKCS088
219400                                                                  POKCS088
219500     COMPUTE PV-SUB = (VL008-ITEM (VL008-IDX)                     POKCS088
219600                    - LQW-LIST-ITEM-NUMBER (1)) + 1.              POKCS088
219700     SET LQW-DESELECT (PV-SUB) TO    TRUE                         POKCS088
219710*    SET LQW-SELECT   (PV-SUB) TO    TRUE                         POKCS088
219800     MOVE LQW-SELECTED-SW (PV-SUB)                                POKCS088
219900                               TO LQW-TEMP-SELECTED-SW (PV-SUB).  POKCS088
220000*    EVALUATE TRUE                                                POKCS088
220100*        WHEN VL006-INQ (VL006-IDX)                               POKCS088
220200*             MOVE PC-INQ      TO LQW-ACTION (PV-SUB)             POKCS088
220300*                                                                 POKCS088
220400*        WHEN VL006-UPD (VL006-IDX)                               POKCS088
220500*             MOVE PC-UPD      TO LQW-ACTION (PV-SUB)             POKCS088
220600*                                                                 POKCS088
220700*        WHEN VL006-DEL (VL006-IDX)                               POKCS088
220800*             MOVE PC-DEL      TO LQW-ACTION (PV-SUB)             POKCS088
220900*                                                                 POKCS088
221000*        WHEN VL006-ERR (VL006-IDX)                               POKCS088
221100*             MOVE PC-ERR      TO LQW-ACTION (PV-SUB)             POKCS088
221200*    END-EVALUATE.                                                POKCS088
221300                                                                  POKCS088
221400     SUBTRACT 1 FROM ASC-NUMBER-OF-SELECTED-ITEMS.                POKCS088
221500                                                                  POKCS088
221600*----------------------------------------------------------------*POKCS088
221700*    WRITE THE TS QUEUE RECORD JUST UPDATED IN C600.             *POKCS088
221800*----------------------------------------------------------------*POKCS088
221900 6111-WRITE-LIST-QUEUE.                                           POKCS088
222000                                                                  POKCS088
222100     EXEC CICS                                                    POKCS088
222200         WRITEQ TS                                                POKCS088
222300             QUEUE (ASC-LIST-QUEUE-NAME)                          POKCS088
222400             FROM  (LQW-LIST-QUEUE-WORK-AREA)                     POKCS088
222500             ITEM  (PV-SAVE-ITEM)                                 POKCS088
222600             REWRITE                                                      
222700             RESP  (PV-CICS-RESP)                                 POKCS088
222800     END-EXEC.                                                    POKCS088
222900                                                                  POKCS088
223000     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          POKCS088
223100         CONTINUE                                                 POKCS088
223200     ELSE                                                         POKCS088
223300         SET DP013-CICS-ABEND  TO  TRUE                           POKCS088
223400         SET DP013-NO-ROLLBACK TO  TRUE                           POKCS088
223500         MOVE '6111-WRITE-LIST-QUEUE'                             POKCS088
223600                               TO  DP013-PARAGRAPH                POKCS088
223700         MOVE 'ATTEMPTING TO REWRITE LIST QUEUE'                  POKCS088
223800                               TO  DP013-MESSAGE-TEXT(1)          POKCS088
223900         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
224000     END-IF.                                                      POKCS088
224100                                                                  POKCS088
224200*----------------------------------------------------------------*POKCS088
224300*    READ THE TEMPORARY STORAGE QUEUE INTO A TEMPORARY WORK AREA.*POKCS088
224400*----------------------------------------------------------------*POKCS088
224500 6112-READ-LIST-QUEUE.                                            POKCS088
224600                                                                  POKCS088
224700     EXEC CICS                                                    POKCS088
224800         READQ TS                                                 POKCS088
224900             QUEUE (ASC-LIST-QUEUE-NAME)                          POKCS088
225000             INTO  (LQW-LIST-QUEUE-WORK-AREA)                     POKCS088
225100             ITEM  (PV-ITEM)                                      POKCS088
225200             RESP  (PV-CICS-RESP)                                 POKCS088
225300     END-EXEC.                                                    POKCS088
225400                                                                  POKCS088
225500     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          POKCS088
225600         CONTINUE                                                 POKCS088
225700     ELSE                                                         POKCS088
225800         SET DP013-CICS-ABEND        TO TRUE                      POKCS088
225900         SET DP013-NO-ROLLBACK       TO TRUE                      POKCS088
226000         MOVE '6112-READ-LIST-QUEUE' TO DP013-PARAGRAPH           POKCS088
226100         MOVE 'ATTEMPTING TO READQ LIST QUEUE'                    POKCS088
226200                                     TO DP013-MESSAGE-TEXT(1)     POKCS088
226300         PERFORM DP013-0000-PROCESS-ABEND                         POKCS088
226400     END-IF.                                                      POKCS088
226401                                                                     CL**1
226402 9100-READ-SEL-QUEUE.                                                CL**1
226403                                                                     CL**8
226404     EXEC CICS                                                       CL**1
226405         READQ TS                                                    CL**1
226406             QUEUE (ASC-SEL-QUEUE-NAME)                              CL**1
226407             INTO  (VL008-REASON-SEL-REC)                               *1
226408             ITEM  (ASC-SEL-ITEM)                                    CL**1
226409             RESP  (PV-CICS-RESP)                                    CL**1
226410     END-EXEC.                                                       CL**1
226411                                                                     CL**1
226412     IF ((PV-CICS-RESP = DFHRESP(NORMAL)) OR                      RCKCS280
226413        (PV-CICS-RESP = DFHRESP(ITEMERR)) OR                            80
226414        (PV-CICS-RESP = DFHRESP(QIDERR)))                         RCKCS280
226415         CONTINUE                                                 RCKCS280
226418     ELSE                                                            CL**1
226419         SET DP013-LOGIC-ABEND                                       CL**1
226420             DP013-NO-ROLLBACK     TO TRUE                           CL**1
226421         MOVE '9100-READ-SEL-QUEUE'                                  CL**1
226422                                   TO DP013-PARAGRAPH                CL**1
226423         MOVE 'ATTEMPTING TO READ THE LIST SELECTIONS TS QUEUE'      CL**1
226424                                   TO DP013-MESSAGE-TEXT (1)         CL**1
226425         PERFORM DP013-0000-PROCESS-ABEND                            CL**1
226426     END-IF.                                                         CL**1
226427                                                                     CL**8
226428*----------------------------------------------------------------*   CL**1
226429* UPDATE AN ITEM IN THE SELECTED ITEMS TEMP STORAGE QUEUE.       *   CL**1
226430*----------------------------------------------------------------*   CL**1
226431                                                                     CL**8
226432 9200-WRITE-SEL-QUEUE.                                                  *1
226433                                                                     CL**8
226434     EXEC CICS                                                       CL**1
226435          WRITEQ TS                                                  CL**1
226436              QUEUE  (ASC-SEL-QUEUE-NAME)                            CL**1
226437              FROM   (VL008-REASON-SEL-REC)                             *1
226438              ITEM   (ASC-SEL-ITEM)                                  CL**1
226439              RESP   (PV-CICS-RESP)                                  CL**1
226440              WRITE                                                     *1
226441     END-EXEC.                                                       CL**1
226442                                                                     CL**1
226443     IF  PV-CICS-RESP NOT EQUAL DFHRESP(NORMAL)                      CL**1
226444         SET DP013-CICS-ABEND                                        CL**1
226445             DP013-NO-ROLLBACK     TO TRUE                           CL**1
226446         MOVE '9200-WRITE-SEL-QUEUE'                                    *1
226447                                   TO DP013-PARAGRAPH                CL**1
226448         MOVE 'ATTEMPTING TO REWRITE THE LIST SELECTIONS QUEUE'      CL**1
226449                                   TO DP013-MESSAGE-TEXT (1)         CL**1
226450         PERFORM DP013-0000-PROCESS-ABEND                            CL**1
226451     END-IF.                                                         CL**1
226452                                                                     CL**1
226460 EJECT                                                               CL**1
226461******************************************************************RCKCS279
226462*    THE DB2 RESOURCE IS NOT AVAILABLE, SET THE ERROR MESSAGE    *RCKCS279
226463*    AND THE ERROR SWITCHES.                                     *RCKCS279
226464******************************************************************RCKCS279
226465 9900-SOFT-ABORT.                                                 RCKCS279
226466     SET PS-ERROR         TO TRUE.                                RCKCS279
226467     SET DP020-MSG-FATAL  TO TRUE.                                RCKCS279
226468     MOVE PC-TSYMSG-00551 TO DP020-MSG-NUMBER.                    RCKCS279
226469     IF PS-NO-NEXT-SCREEN                                         RCKCS279
226470        SET DP020-NEXT-ACT-APPL-ERROR TO TRUE                     RCKCS279
226471     END-IF.                                                      RCKCS279
226472     IF PS-UPDATES-DONE AND SQLCODE = -913                        RCKCS279
226473        PERFORM 9901-BACKUP                                       RCKCS279
226474     END-IF.                                                      RCKCS279
226475     MOVE 'PROGRAM EXIT CALL' TO DP013-MESSAGE-TEXT (1).          RCKCS279
226476     PERFORM 0001-CALL-CICS-ARCH-API.                             RCKCS279
226477                                                                  RCKCS279
226478 9901-BACKUP.                                                     RCKCS279
226479     EXEC CICS SYNCPOINT                                          RCKCS279
226480          ROLLBACK                                                RCKCS279
226481     END-EXEC.                                                    RCKCS279
226490                                                                  RCKCS279
226500                                                                  POKCS088
226600*----------------------------------------------------------------*POKCS088
226700*    ABEND PROCESSOR MODULE                                      *POKCS088
226800*----------------------------------------------------------------*POKCS088
226900     COPY DPPD013.                                                POKCS088
