000100*-----------------------*                                         06/13/94
000200 IDENTIFICATION DIVISION.                                         VLKCS511
000300*-----------------------*                                            LV013
000400 PROGRAM-ID.    VLKCS511.                                         VLKCS511
000500 AUTHOR.        MARY SARDINA.                                           03
000600 DATE-WRITTEN.  08/96.                                            VLKCS511
000700*---------------------------------------------------------------* VLKCS511
000800*    V511 - PRETICKET REQUEST REASON CODE SCREEN                * VLKCS511
000900*                                                               * VLKCS511
001000*    THIS PROGRAM GENERATES A LIST PF REASON CODES AND          * VLKCS511
001100*    DESCRIPTIONS FOR RESUBMITTING A PRETICKET REQUEST          * VLKCS511
001200*                                                               * VLKCS511
001300*---------------------------------------------------------------* VLKCS511
263627* CHANGED 11/05/2021    BY JIM HUNTER      WR: CHG0263627                 
263627* CHANGE CALL OF DPKUT100 TO CALL DP010I-NUMERIC-EDIT-ROUTINE             
263627* MAKING THE CALL DYNAMIC VS STATIC.                                      
263627*---------------------------------------------------------------*         
CICS  * CHANGED 11/11/2022    BY JIM HUNTER      WR: CHG0278236                 
CICS  * ADD COPYBOOK DPWS930 AND MAKE THE CICS ARCHITECTURE CALL                
CICS  * DYNAMIC INSTEAD OF STATIC BY CALLING DP930-CICS-ARCH-API.               
CICS  *****************************************************************         
001400 ENVIRONMENT DIVISION.                                            VLKCS511
001500 DATA DIVISION.                                                   VLKCS511
001600                                                                  VLKCS511
001700 WORKING-STORAGE SECTION.                                         VLKCS511
001800                                                                  VLKCS511
001900 01  DK-DB2-KEY.                                                  VLKCS511
002000     05  DK-STATUS-CODE                 PIC  X(01)  VALUE SPACES. VLKCS511
002100     05  DK-VEND-NAME                   PIC  X(30)  VALUE SPACE.  VLKCS511
002200     05  DK-VEND-NAME-BYTE              REDEFINES DK-VEND-NAME    VLKCS511
002300                                        OCCURS 30 TIMES           VLKCS511
002400                                        PIC  X(01).               VLKCS511
002500     05  DK-PRIM-NAME                   PIC  X(30).               VLKCS511
002600                                                                  VLKCS511
002700 01  PC-PROGRAM-CONSTANTS.                                        VLKCS511
002800     05  PC-CURRENT-MAP-NAME            PIC  X(08)  VALUE         VLKCS511
002900                                                    'VL511A  '.   VLKCS511
003000     05  PC-CURRENT-MAPSET-NAME         PIC  X(08)  VALUE         VLKCS511
003100                                                    'VLKM511 '.   VLKCS511
003200     05  PC-CURRENT-PROGRAM-NAME        PIC  X(08)  VALUE         VLKCS511
003300                                                    'VLKCS511'.   VLKCS511
003400     05  PC-LIST-QUEUE-SEQ              PIC  9(01)  VALUE 1.      VLKCS511
003500     05  PC-SEL-QUEUE-SEQ               PIC  9(01)  VALUE 2.      VLKCS511
003600     05  PC-CRIT-SPEC-FORMAT            PIC  X(01)  VALUE '1'.    VLKCS511
003700     05  PC-ITEMS-PER-PANEL             PIC S9(04)  VALUE +12     VLKCS511
003800                                                    COMP SYNC.    VLKCS511
003900     05  PC-MAX-BLOCKS-IN-ARRAY         PIC S9(04)  VALUE +2      VLKCS511
004000                                                    COMP SYNC.    VLKCS511
004100     05  PC-MAX-ITEMS                   PIC S9(09)  VALUE         VLKCS511
004200                                                    +1000000      VLKCS511
004300                                                    COMP-3.       VLKCS511
004400     05  PC-ITM-NUMBER-LENGTH           PIC S9(04)  VALUE +7      VLKCS511
004500                                                    COMP SYNC.    VLKCS511
004600     05  PC-MAX-RETRIES                 PIC S9(03)  VALUE 3       VLKCS511
004700                                                    COMP-3.       VLKCS511
004800     05  PC-INQ                         PIC  X(03)  VALUE 'INQ'.  VLKCS511
004900     05  PC-UPD                         PIC  X(03)  VALUE 'UPD'.  VLKCS511
005000     05  PC-DEL                         PIC  X(03)  VALUE 'DEL'.  VLKCS511
005100     05  PC-ERR                         PIC  X(03)  VALUE 'ERR'.  VLKCS511
005200     05  PC-PERCENT                     PIC  X(01)  VALUE '%'.    VLKCS511
005300     05  PC-TYPE-CODES.                                           VLKCS511
005400         10  PC-PRIMARY                 PIC  X(02)  VALUE '01'.   VLKCS511
005500         10  PC-ALIAS                   PIC  X(02)  VALUE '02'.   VLKCS511
005600         10  PC-LABEL                   PIC  X(02)  VALUE '03'.   VLKCS511
005700         10  PC-SHORTNAME               PIC  X(02)  VALUE '04'.   VLKCS511
005800                                                                  VLKCS511
005900     05  PC-TSYMSG-NUMBERS.                                       VLKCS511
006000         10  PC-TSYMSG-00005            PIC  9(05)  VALUE 00005.  VLKCS511
006100         10  PC-TSYMSG-00008            PIC  9(05)  VALUE 00008.  VLKCS511
006200         10  PC-TSYMSG-00050            PIC  9(05)  VALUE 00050.  VLKCS511
006300         10  PC-TSYMSG-00051            PIC  9(05)  VALUE 00051.  VLKCS511
006400         10  PC-TSYMSG-00052            PIC  9(05)  VALUE 00052.  VLKCS511
006500         10  PC-TSYMSG-00053            PIC  9(05)  VALUE 00053.  VLKCS511
006600         10  PC-TSYMSG-00054            PIC  9(05)  VALUE 00054.  VLKCS511
006700         10  PC-TSYMSG-00055            PIC  9(05)  VALUE 00055.  VLKCS511
006800         10  PC-TSYMSG-00047            PIC  9(05)  VALUE 00047.  VLKCS511
006810         10  PC-TSYMSG-00057            PIC  9(05)  VALUE 00057.  VLKCS511
006900         10  PC-TSYMSG-00069            PIC  9(05)  VALUE 00069.  VLKCS511
007000         10  PC-TSYMSG-00070            PIC  9(05)  VALUE 00070.  VLKCS511
007100         10  PC-TSYMSG-00101            PIC  9(05)  VALUE 00101.  VLKCS511
007200         10  PC-TSYMSG-00279            PIC  9(05)  VALUE 00279.  VLKCS511
007300         10  PC-TSYMSG-99901            PIC  9(05)  VALUE 99901.  VLKCS511
007301 01  PS-PROGRAM-SWITCHES.                                         VLKCS511
007302     05  PS-ERROR-SW                    PIC  X(01)  VALUE 'Y'.    VLKCS511
007303         88  PS-NO-ERROR                            VALUE 'Y'.    VLKCS511
007304         88  PS-ERROR                               VALUE 'N'.    VLKCS511
007305     05  PS-COMMAREA-SW                 PIC  X(01)  VALUE 'N'.    VLKCS511
007306         88  PS-COMMAREA-VALID                      VALUE 'Y'.    VLKCS511
007307         88  PS-COMMAREA-NOT-VALID                  VALUE 'N'.    VLKCS511
007308     05  PS-DONE-SW                     PIC  X(01)  VALUE 'N'.    VLKCS511
007309         88  PS-DONE                                VALUE 'Y'.    VLKCS511
007310         88  PS-NOT-DONE                            VALUE 'N'.    VLKCS511
007311                                                                  VLKCS511
007312 01  PL-PROGRAM-LITERALS.                                         VLKCS511
007313     05  PL-PRIMARY                     PIC  X(10)  VALUE         VLKCS511
007314                                                    'PRIMARY   '. VLKCS511
007315     05  PL-ALIAS                       PIC  X(10)  VALUE         VLKCS511
007316                                                    'ALIAS     '. VLKCS511
007317     05  PL-LABEL                       PIC  X(10)  VALUE         VLKCS511
007318                                                    'LABEL     '. VLKCS511
007320     05  PL-SHORTNAME                   PIC  X(10)  VALUE         VLKCS511
007400                                                    'SHORT NAME'. VLKCS511
009600 01  PV-PROGRAM-VARIABLES.                                        VLKCS511
009700     05  PV-SUB                         PIC S9(04)  VALUE +0      VLKCS511
009800                                                    COMP SYNC.    VLKCS511
009900     05  PV-REMAINDER                   PIC S9(04)  VALUE +0      VLKCS511
010000                                                    COMP SYNC.    VLKCS511
010100     05  PV-READ-COUNT                  PIC S9(09)  VALUE +0      VLKCS511
010200                                                    COMP-3.       VLKCS511
010300     05  PV-ITEMS-PROCESSED             PIC S9(09)  VALUE +0      VLKCS511
010400                                                    COMP-3.       VLKCS511
010500     05  PV-HOLD-SELECTED-ITEMS         PIC S9(09)  VALUE +0      VLKCS511
010600                                                    COMP-3.       VLKCS511
010700     05  PV-ITEM-IN-USE                 PIC S9(09)  VALUE +0      VLKCS511
010800                                                    COMP-3.       VLKCS511
010900     05  PV-TOP-ITEM                    PIC S9(09)  VALUE +0      VLKCS511
011000                                                    COMP-3.       VLKCS511
011100     05  PV-BOTTOM-ITEM                 PIC S9(09)  VALUE +0      VLKCS511
011200                                                    COMP-3.       VLKCS511
011300     05  PV-TEMP-BLOCK-NUMBER           PIC S9(09)  VALUE +0      VLKCS511
011400                                                    COMP-3.       VLKCS511
011500     05  PV-BLOCK-NUMBER                PIC S9(04)  VALUE +0      VLKCS511
011600                                                    COMP SYNC.    VLKCS511
011700     05  PV-CICS-RESP                   PIC S9(04)  VALUE +0      VLKCS511
011800                                                    COMP SYNC.    VLKCS511
011900     05  PV-ITEM                        PIC S9(04)  VALUE +0      VLKCS511
012000                                                    COMP SYNC.    VLKCS511
012100     05  PV-SEL-QUEUE-ITEM              PIC S9(04)  VALUE +0      VLKCS511
012200                                                    COMP SYNC.    VLKCS511
012300     05  PV-SAVE-ITEM                   PIC S9(04)  VALUE +0      VLKCS511
012400                                                    COMP SYNC.    VLKCS511
012500     05  PV-HIGHEST-BLOCK-WRITTEN       PIC S9(04)  VALUE +0      VLKCS511
012600                                                    COMP SYNC.    VLKCS511
012700     05  PV-LIST-ITEM-NUMBER            PIC S9(04)  VALUE +0      VLKCS511
012800                                                    COMP SYNC.    VLKCS511
012900     05  PV-FIRST-BLOCK-IN-ARRAY        PIC S9(04)  VALUE +0      VLKCS511
013000                                                    COMP SYNC.    VLKCS511
013100     05  PV-NEXT-BLOCK-IN-ARRAY         PIC S9(04)  VALUE +0      VLKCS511
013200                                                    COMP SYNC.    VLKCS511
013300     05  PV-PREV-BLOCK-IN-ARRAY         PIC S9(04)  VALUE +0      VLKCS511
013400                                                    COMP SYNC.    VLKCS511
013500     05  PV-FIRST-BLOCK-IN-RANGE        PIC S9(04)  VALUE +0      VLKCS511
013600                                                    COMP SYNC.    VLKCS511
013700     05  PV-LAST-BLOCK-IN-RANGE         PIC S9(04)  VALUE +0      VLKCS511
013800                                                    COMP SYNC.    VLKCS511
013900     05  PV-START-OF-SELECTED-RANGE     PIC S9(04)  VALUE +0      VLKCS511
014000                                                    COMP SYNC.    VLKCS511
014100     05  PV-END-OF-SELECTED-RANGE       PIC S9(04)  VALUE +0      VLKCS511
014200                                                    COMP SYNC.    VLKCS511
014300     05  PV-SQL-SUB                     PIC S9(04)  VALUE +0      VLKCS511
014400                                                    COMP SYNC.    VLKCS511
014500     05  PV-RETRY-COUNTER               PIC S9(04)  VALUE +0      VLKCS511
014600                                                    COMP SYNC.    VLKCS511
014700******************************************************************VLKCS511
014800**  THIS IS THE LAYOUT FOR THE LIST ITEMS TEMP STORAGE QUEUE.   **VLKCS511
014900**  THIS MUST BE THE EXACT SAME FORMAT A BLOCK IN THE           **VLKCS511
015000**  APPLICATION-SPECIFIC COMMAREA.                              **VLKCS511
015100******************************************************************VLKCS511
015200 01  LQW-LIST-QUEUE-WORK-AREA.                                    VLKCS511
015300     05  LQW-BLOCK-MODIFIED             PIC  X(01)  VALUE SPACE.  VLKCS511
015400     05  LQW-ITEM-ENTRIES               OCCURS 12 TIMES           VLKCS511
015500                                        INDEXED BY LQW-IDX.       VLKCS511
015600         10  LQW-LIST-ITEM-NUMBER       PIC S9(09)  COMP-3.       VLKCS511
015700         10  LQW-TEMP-SELECTED-SW       PIC  X(01).               VLKCS511
015800         10  LQW-SELECTED-SW            PIC  X(01).               VLKCS511
015900             88  LQW-SELECT                         VALUE 'S'.    VLKCS511
016000             88  LQW-DESELECT                       VALUE ' '.    VLKCS511
016010         10  LQW-ACTION                 PIC  X(03).               POKCS084
016200         10  LQW-REQ-RSN-CDE            PIC  X(01).                     88
016210         10  LQW-REQ-REASN-DESC         PIC  X(50).                     *2
016700                                                                  VLKCS511
016800*---------------------------------------------------------------* VLKCS511
016900*  RECORD LAYOUT FOR THE PRETICKET SELECTION TEMP STORAGE QUEUE.* VLKCS511
017000*---------------------------------------------------------------* VLKCS511
017100     COPY VLWS006.                                                   CL*13
017200                                                                  VLKCS511
017300*---------------------------------------------------------------* VLKCS511
017400*    MAP LAYOUT                                                 * VLKCS511
017500*---------------------------------------------------------------* VLKCS511
017600     COPY VLKM511.                                                VLKCS511
017700                                                                  VLKCS511
017800 01  MR-OCCURS-LAYOUT                   REDEFINES  VL511AO.       VLKCS511
017900     05  FILLER                         PIC X(42).                VLKCS511
018000     05  MR-SCROLL-AREA                 OCCURS 12 TIMES.          VLKCS511
018100         10  MR-SELECTL                 PIC S9(04) COMP.          VLKCS511
018200         10  MR-SELECTA                 PIC  X(01).               VLKCS511
018300         10  MR-SELECTC                 PIC  X(01).               VLKCS511
018400         10  MR-SELECTH                 PIC  X(01).               VLKCS511
018500         10  MR-SELECTI                 PIC  X(01).               VLKCS511
018600                                                                  VLKCS511
018601         10  MR-ACTIONL                 PIC S9(04) COMP.          PO      
018602         10  MR-ACTIONA                 PIC  X(01).               PO      
018603         10  MR-ACTIONC                 PIC  X(01).               PO      
018604         10  MR-ACTIONH                 PIC  X(01).               PO      
018610         10  MR-ACTION                  PIC  X(03).               PO      
019200                                                                  VLKCS511
019300         10  MR-DESC-L                  PIC S9(04) COMP.             CL**2
019400         10  MR-DESC-A                  PIC  X(01).                  CL**2
019500         10  MR-DESC-C                  PIC  X(01).                  CL**2
019600         10  MR-DESC-H                  PIC  X(01).                  CL**2
019700         10  MR-DESC                    PIC  X(50).                  CL**2
019800                                                                     CL**2
020400                                                                  VLKCS511
021600                                                                  VLKCS511
021700*---------------------------------------------------------------* VLKCS511
021800*    ATTRIBUTE SETTINGS COPYBOOK.                               * VLKCS511
021900*---------------------------------------------------------------* VLKCS511
022000     COPY DPWS015.                                                VLKCS511
022100                                                                  VLKCS511
022200*---------------------------------------------------------------* VLKCS511
022300*    FUNCTION KEYS COPYBOOK.                                    * VLKCS511
022400*---------------------------------------------------------------* VLKCS511
022500     COPY DPWS016.                                                VLKCS511
022600                                                                  VLKCS511
022700*---------------------------------------------------------------* VLKCS511
022800*    NUMERIC EDIT LAYOUT.                                       * VLKCS511
022900*---------------------------------------------------------------* VLKCS511
023000     COPY DPWS010I.                                               VLKCS511
023100                                                                  VLKCS511
023200*---------------------------------------------------------------* VLKCS511
023300*    PARAMETERS FOR CALLING THE CICS ARCHITECTURE API           * VLKCS511
023400*---------------------------------------------------------------* VLKCS511
023500     COPY DPWS030.                                                VLKCS511
CICS       COPY DPWS930.                                                VLKCS511
023600                                                                  VLKCS511
023700*---------------------------------------------------------------* VLKCS511
023800*    STANDARD COMMAREA.                                         * VLKCS511
023900*---------------------------------------------------------------* VLKCS511
024000     COPY DPWS020.                                                VLKCS511
024100     05  FILLER REDEFINES DP020-VARIABLE-COMMAREA.                VLKCS511
024200*---------------------------------------------------------------* VLKCS511
024300* INTER-APPLICATION COMMAREA.                                   * VLKCS511
024400*   VLWS005 - INPUT FROM PO PRETICKET REQUEST                   * VLKCS511
024600*---------------------------------------------------------------* VLKCS511
024700         10  INTER-APPL-COMM-AREA       PIC X(200).               VLKCS511
024800     COPY VLWS005.                                                   CL*13
025000*---------------------------------------------------------------* VLKCS511
025100*  THIS IS THE APPLICATION-SPECIFIC COMMAREA.                   * VLKCS511
025200*---------------------------------------------------------------* VLKCS511
025300         10  ASC-SPECIFIC-COMMAREA.                               VLKCS511
025400             15  ASC-LIST-KEYS.                                   VLKCS511
025500                 20  ASC-KEY-VEND-NAME               PIC  X(30).  VLKCS511
025600                 20  ASC-KEY-VEND-TYPE               PIC  X(01).     CL**3
025800             15  ASC-BLOCK-ENTRIES OCCURS 2 TIMES.                VLKCS511
025900                 20  ASC-BLOCK-MODIFIED-SW           PIC  X(01).  VLKCS511
026000                     88  ASC-BLOCK-NOT-MODIFIED      VALUE 'N'.   VLKCS511
026100                     88  ASC-BLOCK-MODIFIED          VALUE 'Y'.   VLKCS511
026200                                                                  VLKCS511
026300                 20  ASC-ITEM-ARRAY.                              VLKCS511
026400                     25  ASC-ITEM-ENTRIES OCCURS 12 TIMES.        VLKCS511
026500                         30  ASC-LIST-ITEM-NUMBER                 VLKCS511
026600                                                     PIC S9(09)   VLKCS511
026700                                                     COMP-3.      VLKCS511
026800                         30  ASC-TEMP-SELECTED-SW    PIC  X(01).  VLKCS511
026900                             88  ASC-VALID-SELECT    VALUE ' '    VLKCS511
027000                                                           'S'    VLKCS511
027100                                                           'B'    VLKCS511
027200                                                           'E'.   VLKCS511
027300                             88  ASC-TEMP-NO-SELECT  VALUE ' '.   VLKCS511
027400                             88  ASC-TEMP-SELECT     VALUE 'S'.   VLKCS511
027500                             88  ASC-TEMP-BEGIN      VALUE 'B'.   VLKCS511
027600                             88  ASC-TEMP-END        VALUE 'E'.   VLKCS511
027700                         30  ASC-SELECTED-SW         PIC  X(01).  VLKCS511
027800                             88  ASC-NO-SELECT       VALUE ' '.   VLKCS511
027900                             88  ASC-SELECT          VALUE 'S'.   VLKCS511
028000                             88  ASC-BEGIN           VALUE 'B'.   VLKCS511
028100                             88  ASC-END             VALUE 'E'.   VLKCS511
028300                         30  ASC-ACTION              PIC  X(03).  POKCS084
028400                         30  ASC-REQ-RSN-CDE         PIC  X(01).     CL**2
028500                         30  ASC-REQ-RSN-DESC        PIC  X(50).     CL**2
028900                                                                        84
029000             15  ASC-BLK-SUB                         PIC S9(04)   VLKCS511
029100                                                          COMP    VLKCS511
029200                                                          SYNC.   VLKCS511
029300             15  ASC-ITEM-SUB                        PIC S9(04)   VLKCS511
029400                                                          COMP    VLKCS511
029500                                                          SYNC.   VLKCS511
029600             15  ASC-NUMBER-OF-ITEMS-READ            PIC S9(09)   VLKCS511
029700                                                          COMP-3. VLKCS511
029800             15  ASC-NUMBER-OF-SELECTED-ITEMS        PIC S9(09)   VLKCS511
029900                                                          COMP-3. VLKCS511
030000             15  ASC-ITEMS-DISPLAYED                 PIC S9(03)   VLKCS511
030100                                                          COMP-3. VLKCS511
030200             15  ASC-ITEM-AT-TOP-OF-PANEL            PIC S9(09)   VLKCS511
030300                                                          COMP-3. VLKCS511
030400             15  ASC-ITEM-AT-BOT-OF-PANEL            PIC S9(09)   VLKCS511
030500                                                          COMP-3. VLKCS511
030600             15  ASC-HIGHEST-BLOCK-WRITTEN           PIC S9(04)   VLKCS511
030700                                                          COMP    VLKCS511
030800                                                          SYNC.   VLKCS511
030900             15  ASC-START-OF-SELECTED-RANGE         PIC S9(09)   VLKCS511
031000                                                          COMP-3. VLKCS511
031100             15  ASC-END-OF-SELECTED-RANGE           PIC S9(09)   VLKCS511
031200                                                          COMP-3. VLKCS511
031300             15  ASC-ITEMS-LEFT-INDICATOR            PIC  X(01).  VLKCS511
031400                 88  ASC-ITEMS-LEFT-ON-DB            VALUE 'Y'.   VLKCS511
031500                 88  ASC-NO-ITEMS-LEFT-ON-DB         VALUE 'N'.   VLKCS511
031600             15  ASC-TEMP-QUEUE-UPDATE-SW            PIC  X(01).  VLKCS511
031700                 88  ASC-UPDATE-TSQ                  VALUE 'Y'.   VLKCS511
031800                 88  ASC-NO-TSQ-UPDATE               VALUE ' '.   VLKCS511
031900             15  ASC-LIST-QUEUE-NAME.                             VLKCS511
032000                 20  ASC-LIST-TERM-ID                PIC  X(04).  VLKCS511
032100                 20  ASC-LIST-TASK-NUMBER            PIC S9(05)   VLKCS511
032200                                                          COMP-3. VLKCS511
032300                 20  ASC-LIST-SEQ                    PIC  9(01).  VLKCS511
032400             15  ASC-SEL-QUEUE-NAME.                              VLKCS511
032500                 20  ASC-SEL-TERM-ID                 PIC  X(04).  VLKCS511
032600                 20  ASC-SEL-TASK-NUMBER             PIC S9(05)   VLKCS511
032700                                                          COMP-3. VLKCS511
032800                 20  ASC-SEL-SEQ                     PIC  9(01).  VLKCS511
032900                                                                  VLKCS511
033000             15  ASC-START-ITEM-REQUEST.                          VLKCS511
033100                 20  ASC-START-ITEM-REQUEST-N        PIC  9(07).  VLKCS511
033210             15  ASC-HOLD-INTER-APPL                 PIC X(200).          
033300                                                                  VLKCS511
033400*---------------------------------------------------------------* VLKCS511
033500*    ABEND PROCESSING COPYBOOK.                                 * VLKCS511
033600*---------------------------------------------------------------* VLKCS511
033700     COPY DPWS013.                                                VLKCS511
033800                                                                  VLKCS511
033801 EJECT                                                                    
033802*---------------------------------------------------------------*         
033803*    DB2 AREA FOR THE PRETICKET REQUEST REASON CODE ASSOCIATION *         
033804*    TABLE                                                      *         
033805*---------------------------------------------------------------*         
033806     EXEC SQL                                                             
033810          INCLUDE TPTRDSC                                                 
033900     END-EXEC.                                                            
035200                                                                  VLKCS511
035300*---------------------------------------------------------------* VLKCS511
035400*    DB2 AREA FOR COMMUNICATIONS                                * VLKCS511
035500*---------------------------------------------------------------* VLKCS511
035600     EXEC SQL                                                     VLKCS511
035700          INCLUDE SQLCA                                           VLKCS511
035800     END-EXEC.                                                    VLKCS511
035900                                                                  VLKCS511
036000*---------------------------------------------------------------* VLKCS511
036100*    VENDOR CURSOR WHEN VENDOR NAME IS ENTERED                  * VLKCS511
036200*---------------------------------------------------------------* VLKCS511
036300     EXEC SQL                                                     VLKCS511
036400          DECLARE RSNDSC_CSR CURSOR FOR                                 88
036500           SELECT REQ_RSN_CDE                                           *2
036510                 ,REQ_RSN_DESC                                          *2
037100             FROM TPTRDSC                                               *2
037600         ORDER BY REQ_RSN_CDE                                           *2
037800     END-EXEC.                                                    VLKCS511
037900                                                                  VLKCS511
038000 LINKAGE SECTION.                                                 VLKCS511
038100                                                                  VLKCS511
038200 01  DFHCOMMAREA.                                                 VLKCS511
038300     05  FILLER                         OCCURS  1 TO 4072 TIMES   VLKCS511
038400                                        DEPENDING ON EIBCALEN.    VLKCS511
038500         10  FILLER                     PIC X.                    VLKCS511
038600                                                                  VLKCS511
038700 PROCEDURE DIVISION.                                              VLKCS511
038800                                                                     CL**6
038900     INITIALIZE DP030-CICS-API-FIELDS.                            VLKCS511
039000     MOVE +1                       TO DP030-NUMBER-OF-MAPS.       VLKCS511
039100     MOVE PC-CURRENT-MAPSET-NAME   TO DP030-MAPSET-NAME.          VLKCS511
039200     MOVE PC-CURRENT-MAP-NAME      TO DP030-MAP-NAME (1).         VLKCS511
039300     SET DP030-RECEIVE-APPL-MAP    TO TRUE.                       VLKCS511
039400     MOVE LENGTH OF VL511AI        TO DP030-MAP-LENGTH (1).       VLKCS511
039500     MOVE 'PROGRAM ENTRY CALL'     TO DP013-MESSAGE-TEXT (1).     VLKCS511
039600                                                                     CL**6
039700     PERFORM 0001-CALL-CICS-ARCH-API.                             VLKCS511
039800                                                                  VLKCS511
039900     PERFORM 1000-CONTROL-PROCESSING                              VLKCS511
040000                                                                  VLKCS511
040100     MOVE 'PROGRAM EXIT CALL'      TO DP013-MESSAGE-TEXT (1).     VLKCS511
040200                                                                     CL**6
040300     PERFORM 0001-CALL-CICS-ARCH-API.                             VLKCS511
040400                                                                  VLKCS511
040500******************************************************************VLKCS511
040600**  THIS PARAGRAPH CALLS THE CICS ARCHITECTURE API SUBROUTINE   **VLKCS511
040700**  AND WILL ABEND IF ANY ERRORS OCCURRED IN THAT CALL.         **VLKCS511
040800******************************************************************VLKCS511
040900 0001-CALL-CICS-ARCH-API.                                         VLKCS511
041000                                                                  VLKCS511
CICS       CALL DP930-CICS-ARCH-API USING DFHEIBLK                              
041200                                    DFHCOMMAREA                           
041300                                    DP030-CICS-API-FIELDS                 
041400                                    DP020-STANDARD-COMMAREA               
041500                                    VL511AI.                              
041600                                                                          
041700     IF DP030-RC-CALL-SUCCESSFUL                                     CL**6
041800         CONTINUE                                                 VLKCS511
041900     ELSE                                                         VLKCS511
042000         SET DP013-NO-ROLLBACK                                    VLKCS511
042100             DP013-XCTL-DISPLAY-RESTART                           VLKCS511
042200             DP013-CICS-ABEND      TO TRUE                        VLKCS511
042300         MOVE '0001-CALL-CICS-ARCH-API'                           VLKCS511
042400                                   TO DP013-PARAGRAPH             VLKCS511
CICS           MOVE 'CALL TO CICS ARCH API NOT SUCCESSFUL, RETURN-CODE O        
CICS  -             'N NEXT LINE'        TO DP013-MESSAGE-TEXT (2)              
042700         MOVE DP030-RETURN-CODE    TO DP013-MESSAGE-TEXT (3)      VLKCS511
042800         PERFORM DP013-0000-PROCESS-ABEND.                        VLKCS511
042900                                                                  VLKCS511
043000*----------------------------------------------------------------*VLKCS511
043100* PROCESS THE APPROPRIATE PARAGRAPHS BASED ON WHAT THE NEXT      *VLKCS511
043200* COURSE OF ACTION IS FOR THIS TRANSACTION.                      *VLKCS511
043300*----------------------------------------------------------------*VLKCS511
043400 1000-CONTROL-PROCESSING.                                         VLKCS511
043500                                                                  VLKCS511
043600     EVALUATE TRUE                                                VLKCS511
043700         WHEN DP020-NEXT-ACT-INITIAL                              VLKCS511
043800             INITIALIZE ASC-SPECIFIC-COMMAREA                     VLKCS511
043900             MOVE EIBTRMID              TO ASC-LIST-TERM-ID          CL**6
044000                                           ASC-SEL-TERM-ID           CL**6
044100             MOVE DP020-SRC-TASK-NUMBER TO ASC-LIST-TASK-NUMBER      CL**6
044200                                           ASC-SEL-TASK-NUMBER       CL**6
044300             MOVE PC-LIST-QUEUE-SEQ     TO ASC-LIST-SEQ              CL**6
044400             MOVE PC-SEL-QUEUE-SEQ      TO ASC-SEL-SEQ               CL**6
044500                                                                     CL**6
044600             PERFORM 1100-PROCESS-INTER-APPL-COMM                 VLKCS511
044700                                                                     CL**6
044800             PERFORM 4000-BUILD-INITIAL-PANEL                     VLKCS511
044900                                                                  VLKCS511
045000         WHEN DP020-NEXT-ACT-READ-MAP                             VLKCS511
045100             MOVE ASC-ITEM-AT-TOP-OF-PANEL TO PV-TOP-ITEM            CL**6
045200                                                                     CL**6
045300             PERFORM 2000-PROCESS-PANEL                           VLKCS511
045400                                                                  VLKCS511
045501         WHEN DP020-NEXT-ACT-RETURN                                       
045503            IF (VL005-DEL OR                                              
045504                VL005-ERR OR                                              
045505                 VL005-ADD)                                               
045506                MOVE +0 TO  ASC-NUMBER-OF-SELECTED-ITEMS                *6
045507                MOVE ASC-ITEM-AT-TOP-OF-PANEL                       RCK000
045508                                     TO PV-TOP-ITEM                 RCK000
045509                MOVE ZERO          TO ASC-ITEM-AT-TOP-OF-PANEL            
045510                PERFORM 2050-DELETE-LIST-QUEUE                      RCK000
045511                PERFORM 4000-BUILD-INITIAL-PANEL                    RCK000
045512            ELSE                                                          
045513                PERFORM 3000-EDIT-DATA-IN-COMMAREA                      11
045514*               MOVE +0 TO  ASC-NUMBER-OF-SELECTED-ITEMS                *6
045515                MOVE VL005-NUMBER-OF-TS-ITEMS                             
045516                                   TO PV-HOLD-SELECTED-ITEMS      RCK00050
045517                MOVE ASC-HOLD-INTER-APPL                                  
045518                                 TO INTER-APPL-COMM-AREA                  
045519                PERFORM 2050-DELETE-LIST-QUEUE                      RCK000
045520                PERFORM 4000-BUILD-INITIAL-PANEL                    RCK000
045521                PERFORM 3200-RESET-ATTRIBUTES                       RCK000
045522                MOVE ASC-ITEM-AT-TOP-OF-PANEL                       RCK000
045523                                     TO PV-TOP-ITEM                 RCK000
045524                MOVE ZERO          TO ASC-ITEM-AT-TOP-OF-PANEL            
045525                PERFORM 6000-REFRESH-PANEL-FROM-TEMP                RCK000
045526                PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                RCK000
045527          END-IF                                                          
045528*             PERFORM 3200-RESET-ATTRIBUTES                       RCK00050
045529*             PERFORM 2050-DELETE-LIST-QUEUE                      RCK00050
045530*             THIS PROGRAM REQUIRES THAT ANY ADDED OR CHANGED             
045531*             INFORMATION BE DISPLAYED UPON RETURN TO THIS                
045532*             PROGRAM.  THEREFORE THE LIST QUEUE IS REBUILT.              
045533                                                                          
045534*             PERFORM 2050-DELETE-LIST-QUEUE                              
045535*             PERFORM 6000-REFRESH-PANEL-FROM-TEMP                      84
045540*             PERFORM 4000-BUILD-INITIAL-PANEL                            
045600*            MOVE ASC-ITEM-AT-TOP-OF-PANEL TO PV-TOP-ITEM            CL**6
045700*            MOVE ZERO TO ASC-ITEM-AT-TOP-OF-PANEL                   CL**6
045800                                                                     CL**6
045900*            PERFORM 6000-REFRESH-PANEL-FROM-TEMP                 VLKCS511
046000                                                                     CL**6
046100*            PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 VLKCS511
046200                                                                     CL**6
046300*            PERFORM 3000-EDIT-DATA-IN-COMMAREA                   VLKCS511
046400                                                                  VLKCS511
046500         WHEN OTHER                                               VLKCS511
046600             SET DP013-LOGIC-ABEND                                   CL**6
046700                 DP013-NO-ROLLBACK TO TRUE                           CL**6
046800             MOVE '1000-CONTROL-PROCESSING' TO DP013-PARAGRAPH       CL**6
046900             MOVE 'INVALID NEXT APPLICATION ACTIVITY RECEIVED'    VLKCS511
047000                                          TO DP013-MESSAGE-TEXT(1)   CL**6
047100             PERFORM DP013-0000-PROCESS-ABEND                     VLKCS511
047200     END-EVALUATE.                                                VLKCS511
047300                                                                  VLKCS511
047400*----------------------------------------------------------------*VLKCS511
047500* DETERMINE IF DATA WAS PASSED THROUGH INTER-APPL COMMAREA OR    *VLKCS511
047600* IF THERE IS DATA TO BE USED IN THE NAV-KEY FIELD.              *VLKCS511
047700*----------------------------------------------------------------*VLKCS511
047800 1100-PROCESS-INTER-APPL-COMM.                                    VLKCS511
047900                                                                  VLKCS511
048000     SET PS-COMMAREA-VALID TO TRUE.                                  CL**3
048100     MOVE SPACE TO ASC-START-ITEM-REQUEST.                           CL**3
048200                                                                     CL**3
048300     IF DP020-INT-APPL-FORMAT-IND = PC-CRIT-SPEC-FORMAT              CL**3
048310         CONTINUE                                                         
048400*        MOVE VN001-VENDOR-NAME         TO ASC-KEY-VEND-NAME         CL**3
048500*        MOVE VN001-VENDOR-TYPE         TO ASC-KEY-VEND-TYPE         CL**3
048600*        MOVE VN001-STATUS-CODE         TO ASC-KEY-STATUS-CODE       CL**3
048700*        MOVE VN001-INTER-APPL-COMMAREA TO ASC-HOLD-INTER-APPL    VLKCS511
048800     ELSE                                                         VLKCS511
048810         CONTINUE                                                         
048900*        IF DP020-NAV-KEY-DATA > SPACES                              CL**3
049000*            MOVE DP020-NAV-KEY-DATA TO ASC-KEY-VEND-NAME            CL**3
049100*        END-IF                                                      CL**3
049200*        MOVE 'A' TO ASC-KEY-STATUS-CODE                             CL**3
049300     END-IF.                                                         CL**3
049400                                                                  VLKCS511
049500*----------------------------------------------------------------*VLKCS511
049600* DO ANY PROCESSING FOR KEYS FOR WHICH NO EDITTING OF THE DATA   *VLKCS511
049700* ON THE SCREEN NEEDS TO BE DONE.  IF ONE OF THOSE KEYS IS NOT   *VLKCS511
049800* USED, EDIT THE DATA ON THE SCREEN AND GO ON TO CHECK THE REST  *VLKCS511
049900* OF THE FUNCTION KEYS.  NOTE THAT WITH THE API, NO INVALID      *VLKCS511
050000* FUNCTION KEYS CAN GET THIS FAR.                                *VLKCS511
050100*----------------------------------------------------------------*VLKCS511
050200 2000-PROCESS-PANEL.                                              VLKCS511
050300                                                                  VLKCS511
050400     EVALUATE TRUE                                                VLKCS511
050500         WHEN DP020-SRC-AID = DP016-CLEAR                         VLKCS511
050600              MOVE ZERO TO ASC-ITEM-AT-TOP-OF-PANEL                  CL**6
050700                                                                     CL**6
050800              PERFORM 3000-EDIT-DATA-IN-COMMAREA                     CL**6
050900                                                                     CL**6
051000              PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                   CL**6
051100                                                                  VLKCS511
051200         WHEN DP020-FK-REFRESH (DP020-SRC-AID)                    VLKCS511
051300              PERFORM 2050-DELETE-LIST-QUEUE                         CL**6
051400                                                                     CL**6
051500              PERFORM 4000-BUILD-INITIAL-PANEL                       CL**6
051600                                                                  VLKCS511
051700         WHEN DP020-FK-DESELECT(DP020-SRC-AID)                    VLKCS511
051800              PERFORM 2140-DESELECT-ALL-ITEMS                        CL**6
051900                                                                     CL**6
052000              PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                   CL**6
052100                                                                  VLKCS511
052200         WHEN DP020-FK-SELECT-ALL(DP020-SRC-AID)                  VLKCS511
052300              PERFORM 2150-SELECT-ALL-ITEMS                          CL**6
052400                                                                     CL**6
052500              PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                   CL**6
052600                                                                  VLKCS511
052700         WHEN OTHER                                               VLKCS511
052800              PERFORM 2200-MOVE-SCREEN-TO-COMMAREA                   CL**6
052900                                                                     CL**6
053000              PERFORM 3000-EDIT-DATA-IN-COMMAREA                     CL**6
053100                                                                     CL**6
053200              IF PS-NO-ERROR                                         CL**6
053300                  SET DP030-CONTINUE-GO TO TRUE                      CL**6
053400                                                                     CL**6
053500                  PERFORM 2100-CHECK-FUNCTION-KEY                    CL**6
053600              ELSE                                                   CL**6
053700                  SET DP030-OVERRIDE-GO TO TRUE                      CL**6
053800              END-IF                                                 CL**6
053900     END-EVALUATE.                                                VLKCS511
054000                                                                  VLKCS511
054100*----------------------------------------------------------------*VLKCS511
054200*  DELETE THE LIST ITEMS TEMP STORAGE QUEUE.                     *VLKCS511
054300*----------------------------------------------------------------*VLKCS511
054400 2050-DELETE-LIST-QUEUE.                                          VLKCS511
054500                                                                  VLKCS511
054600     EXEC CICS                                                    VLKCS511
054700         DELETEQ TS                                               VLKCS511
054800             QUEUE (ASC-LIST-QUEUE-NAME)                          VLKCS511
054900             RESP  (PV-CICS-RESP)                                 VLKCS511
055000     END-EXEC.                                                    VLKCS511
055100                                                                  VLKCS511
055200     IF (PV-CICS-RESP = DFHRESP(NORMAL)) OR                       VLKCS511
055300        (PV-CICS-RESP = DFHRESP(QIDERR))                          VLKCS511
055400         CONTINUE                                                 VLKCS511
055500     ELSE                                                         VLKCS511
055600         SET DP013-CICS-ABEND                                        CL**6
055700             DP013-NO-ROLLBACK TO TRUE                               CL**6
055800                                                                  VLKCS511
055900         MOVE '2050-DELETE-LIST-QUEUE'                            VLKCS511
056000                                   TO DP013-PARAGRAPH             VLKCS511
056100         MOVE 'ERROR TRYING TO DELETE LIST TEMP STORAGE QUEUE'    VLKCS511
056200                                   TO DP013-MESSAGE-TEXT (1)      VLKCS511
056300         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
056400     END-IF.                                                      VLKCS511
056500                                                                  VLKCS511
056600     MOVE +0                       TO ASC-HIGHEST-BLOCK-WRITTEN.  VLKCS511
056700                                                                  VLKCS511
056800*----------------------------------------------------------------*VLKCS511
056900* ACT ON ANY FUNCTION KEYS THAT REQUIRE EDITS TO BE PASSED FIRST.*VLKCS511
057000* NOTE THAT INVALID FUNCTION KEYS WILL NOT BE RETURNED FROM THE  *VLKCS511
057100* CICS ARCHITECTURE API.                                         *VLKCS511
057200*----------------------------------------------------------------*VLKCS511
057300 2100-CHECK-FUNCTION-KEY.                                         VLKCS511
057400                                                                  VLKCS511
057500     EVALUATE TRUE                                                VLKCS511
057510* REQUEST ADD KEY WAS PRESSED                                             
057520         WHEN DP020-FK-LOCAL-FUNC-01(DP020-SRC-AID)                       
057521              MOVE ZERO TO ASC-NUMBER-OF-SELECTED-ITEMS                   
057522*             IF ASC-NUMBER-OF-SELECTED-ITEMS > ZERO                 CL**6
057523                  INITIALIZE VL005-INTER-APPL-COMMAREA               CL**6
057524                  MOVE ASC-NUMBER-OF-SELECTED-ITEMS                     *6
057525                                TO VL005-NUMBER-OF-SELECTED-ITEMS VLKCS511
057526                  PERFORM 5000-PREPARE-SEL-QUEUE                     CL**6
057527                  SET VL005-ADD TO TRUE                                   
057528* REQUEST INCLUDE KEY WAS PRESSED                                         
057529*        WHEN DP020-FK-LOCAL-FUNC-04(DP020-SRC-AID)                       
057530*             MOVE ZERO TO ASC-NUMBER-OF-SELECTED-ITEMS                   
057531*             IF ASC-NUMBER-OF-SELECTED-ITEMS > ZERO                 CL**6
057532*                 INITIALIZE VL005-INTER-APPL-COMMAREA               CL**6
057533*                 MOVE ASC-NUMBER-OF-SELECTED-ITEMS                     *6
057534*                               TO VL005-NUMBER-OF-SELECTED-ITEMS VLKCS511
057535*                 PERFORM 5000-PREPARE-SEL-QUEUE                     CL**6
057540* REQUEST UPDATE KEY WAS PRESSED                                          
057550* REQUEST DELETE KEY WAS PRESSED                                          
057600         WHEN DP020-FK-LOCAL-FUNC-02(DP020-SRC-AID)                     84
057610         WHEN DP020-FK-LOCAL-FUNC-03(DP020-SRC-AID)                     84
057700              IF ASC-NUMBER-OF-SELECTED-ITEMS = 1                    CL**6
057800                  INITIALIZE VL005-INTER-APPL-COMMAREA               CL**6
057900                  MOVE ASC-NUMBER-OF-SELECTED-ITEMS                  CL**6
058000                                TO VL005-NUMBER-OF-SELECTED-ITEMS VLKCS511
058100                  PERFORM 5000-PREPARE-SEL-QUEUE                     CL**6
058200              ELSE                                                   CL**6
058201                  IF ASC-NUMBER-OF-SELECTED-ITEMS = ZERO                *6
058300                      SET DP030-OVERRIDE-GO                              C
058400                          DP020-MSG-WARNING TO TRUE                      C
058500                      MOVE PC-TSYMSG-00057  TO DP020-MSG-NUMBER          C
058501                    ELSE                                                  
058510                      SET DP030-OVERRIDE-GO                              C
058520                          DP020-MSG-WARNING TO TRUE                      C
058530                      MOVE PC-TSYMSG-00047  TO DP020-MSG-NUMBER          C
058540                  END-IF                                                  
058610           END-IF                                                       KC
058700                                                                  VLKCS511
058800         WHEN DP020-FK-FIRST-PAGE(DP020-SRC-AID)                  VLKCS511
058900             MOVE +1               TO PV-TOP-ITEM                 VLKCS511
059000                                                                     CL**6
059100             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 VLKCS511
059200                                                                     CL**6
059300             PERFORM 3200-RESET-ATTRIBUTES                        VLKCS511
059400                                                                  VLKCS511
059500         WHEN DP020-FK-PREV-PAGE(DP020-SRC-AID)                   VLKCS511
059600             PERFORM 2110-BROWSE-BACKWARD                         VLKCS511
059700                                                                     CL**6
059800             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 VLKCS511
059900                                                                     CL**6
060000             PERFORM 3200-RESET-ATTRIBUTES                        VLKCS511
060100                                                                  VLKCS511
060200         WHEN DP020-FK-NEXT-PAGE(DP020-SRC-AID)                   VLKCS511
060300             PERFORM 2120-BROWSE-FORWARD                          VLKCS511
060400                                                                     CL**6
060500             PERFORM 4400-MOVE-COMMAREA-TO-SCREEN                 VLKCS511
060600                                                                     CL**6
060700             PERFORM 3200-RESET-ATTRIBUTES                        VLKCS511
060800                                                                  POKCS015
060900         WHEN DP020-FK-DISPN-RETURN(DP020-SRC-AID)                POKCS015
061400             IF  ASC-NUMBER-OF-SELECTED-ITEMS = +1                POKCS015
061800                 PERFORM 5000-PREPARE-SEL-QUEUE                   POKCS015
061900             ELSE                                                 POKCS015
062000                 SET DP030-OVERRIDE-GO                            POKCS015
062100                                   TO TRUE                        POKCS015
062200                 MOVE PC-TSYMSG-00047                             POKCS015
062300                                   TO DP020-MSG-NUMBER            POKCS015
062400                 SET DP020-MSG-FATAL                              POKCS015
062500                                   TO TRUE                        POKCS015
062600             END-IF                                               POKCS015
062601                                                                  POKCS015
062602                                                                  VLKCS511
062603         WHEN DP020-SRC-AID = DP016-ENTER                         VLKCS511
062604*            PERFORM 2130-CHECK-FOR-JUMP-BROWSE                   VLKCS511
062605                                                                     CL**6
062606             IF PS-ERROR                                             CL**6
062607                 CONTINUE                                         VLKCS511
062608             ELSE                                                 VLKCS511
062609                 PERFORM 4400-MOVE-COMMAREA-TO-SCREEN             VLKCS511
062610             END-IF                                               VLKCS511
062611                                                                  VLKCS511
062612         WHEN OTHER                                               VLKCS511
062613             SET DP013-NO-ROLLBACK                                VLKCS511
062614                 DP013-XCTL-DISPLAY-RESTART                       VLKCS511
062615                 DP013-CICS-ABEND  TO TRUE                        VLKCS511
062616             MOVE '2100-CHECK-FUNCTION-KEY'                       VLKCS511
062617                                   TO DP013-PARAGRAPH             VLKCS511
062618             MOVE 'INVALID FUNCTION KEY NOT CAPTURED BY API'      VLKCS511
062619                                   TO DP013-MESSAGE-TEXT (1)      VLKCS511
062620             PERFORM DP013-0000-PROCESS-ABEND                     VLKCS511
062700     END-EVALUATE.                                                VLKCS511
062800                                                                  VLKCS511
062900*----------------------------------------------------------------*VLKCS511
063000*    IF THE USER HITS THE PAGE BACKWARD KEY, COMPUTE THE TOP     *VLKCS511
063100*    ITEM NUMBER FOR THE NEW PAGE.  IF IT IS ABOVE THE TOP,      *VLKCS511
063200*    SET THE TOP ITEM NUMBER TO +1 AND DISPLAY THE TOP OF LIST   *VLKCS511
063300*    MESSAGE.                                                    *VLKCS511
063400*----------------------------------------------------------------*VLKCS511
063500 2110-BROWSE-BACKWARD.                                            VLKCS511
063600                                                                  VLKCS511
063700     SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-AT-TOP-OF-PANEL    VLKCS511
063800         GIVING PV-TOP-ITEM.                                      VLKCS511
063900                                                                  VLKCS511
064000     IF  ((PV-TOP-ITEM < +1)                                      VLKCS511
064100       OR (PV-TOP-ITEM = +1))                                     VLKCS511
064200         MOVE +1                   TO PV-TOP-ITEM                 VLKCS511
064300*        -- TOP OF LIST --                                        VLKCS511
064400         MOVE PC-TSYMSG-00069      TO DP020-MSG-NUMBER            VLKCS511
064500         SET DP020-MSG-INFORMATIONAL TO TRUE                      VLKCS511
064600     END-IF.                                                      VLKCS511
064700                                                                  VLKCS511
064800*----------------------------------------------------------------*VLKCS511
064900*    IF THE USER HITS THE PAGE FORWARD KEY, COMPUTE THE TOP      *VLKCS511
065000*    ITEM NUMBER FOR THE NEW PAGE.  IF THE USER ATTEMPTS TO GO   *VLKCS511
065100*    PAST THE END, ISSUE THE BOTTOM OF LIST MESSAGE.             *VLKCS511
065200*----------------------------------------------------------------*VLKCS511
065300 2120-BROWSE-FORWARD.                                             VLKCS511
065400                                                                  VLKCS511
065500     ADD PC-ITEMS-PER-PANEL ASC-ITEM-AT-TOP-OF-PANEL              VLKCS511
065600         GIVING PV-TOP-ITEM.                                      VLKCS511
065700     IF  PV-TOP-ITEM > ASC-NUMBER-OF-ITEMS-READ                   VLKCS511
065800         MOVE ASC-ITEM-AT-TOP-OF-PANEL                            VLKCS511
065900                                   TO PV-TOP-ITEM                 VLKCS511
066000*        -- BOTTOM OF LIST --                                     VLKCS511
066100         MOVE PC-TSYMSG-00070      TO DP020-MSG-NUMBER            VLKCS511
066200         SET DP020-MSG-INFORMATIONAL                              VLKCS511
066300                                   TO TRUE                        VLKCS511
066400     ELSE                                                         VLKCS511
066500         COMPUTE PV-BOTTOM-ITEM =                                 VLKCS511
066600             PV-TOP-ITEM + PC-ITEMS-PER-PANEL - 1                 VLKCS511
066700         IF  PV-BOTTOM-ITEM > ASC-NUMBER-OF-ITEMS-READ            VLKCS511
066800*            -- BOTTOM OF LIST --                                 VLKCS511
066900             MOVE PC-TSYMSG-00070  TO DP020-MSG-NUMBER            VLKCS511
067000             SET DP020-MSG-INFORMATIONAL                          VLKCS511
067100                                   TO TRUE                        VLKCS511
067200         END-IF                                                   VLKCS511
067300     END-IF.                                                      VLKCS511
067400                                                                  VLKCS511
067500*----------------------------------------------------------------*VLKCS511
067600*    THE USER CAN CHANGE THE CURRENT BEGINNING LIST NUMBER SO    *VLKCS511
067700*    THAT THE TRANSACTION WILL JUMP TO THAT POINT IN THE LIST.   *VLKCS511
067800*    THIS IS A FASTER WAY TO GET TO A CERTAIN POINT IN THE LIST  *VLKCS511
067900*    RATHER THAN HITTING NEXT-PAGE TO GET TO THAT POINT.         *VLKCS511
068000*    THE NEW LIST NUMBER ENTERED IS EDITED TO MAKE SURE THAT     *VLKCS511
068100*    IT IS NUMERIC AND FALLS BETWEEN A SPECIFIED RANGE.          *VLKCS511
068200*----------------------------------------------------------------*VLKCS511
068300 2130-CHECK-FOR-JUMP-BROWSE.                                      VLKCS511
068400                                                                  VLKCS511
068500     SET PS-NO-ERROR               TO TRUE.                       VLKCS511
068600     IF (ASC-START-ITEM-REQUEST = SPACE)                          VLKCS511
068700         MOVE ASC-ITEM-AT-TOP-OF-PANEL                            VLKCS511
068800                                   TO PV-TOP-ITEM                 VLKCS511
068900     ELSE                                                         VLKCS511
069000         MOVE ASC-START-ITEM-REQUEST                              VLKCS511
069100                                   TO DP010I-UNEDITED-FIELD       VLKCS511
069200         MOVE PC-ITM-NUMBER-LENGTH TO DP010I-MAXIMUM-DIGITS       VLKCS511
069300         MOVE +0                   TO DP010I-MAXIMUM-DECIMALS     VLKCS511
069400         SET DP010I-NEGATIVE-NOT-ALLOWED                          VLKCS511
069500                                   TO TRUE                        VLKCS511
263627         CALL DP010I-NUMERIC-EDIT-ROUTINE                                 
263627              USING DP010I-NUMERIC-EDIT-AREA                              
069700                                                                  VLKCS511
069800         IF  NOT DP010I-ERROR-DETECTED                            VLKCS511
069900             MOVE DP010I-NUMERIC-FIELD                            VLKCS511
070000                                   TO  ASC-START-ITEM-REQUEST-N   VLKCS511
070100             IF  ASC-START-ITEM-REQUEST-N > ZERO                  VLKCS511
070200                 IF  ASC-START-ITEM-REQUEST-N >                   VLKCS511
070300                                          ASC-NUMBER-OF-ITEMS-READVLKCS511
070400                     MOVE SPACE TO ASC-START-ITEM-REQUEST         VLKCS511
070500                     COMPUTE PV-TOP-ITEM =                        VLKCS511
070600                             ASC-NUMBER-OF-ITEMS-READ             VLKCS511
070700                             - PC-ITEMS-PER-PANEL + 1             VLKCS511
070800                     IF  PV-TOP-ITEM < +1                         VLKCS511
070900                         MOVE +1   TO PV-TOP-ITEM                 VLKCS511
071000                         MOVE PC-TSYMSG-00070                     VLKCS511
071100                                   TO DP020-MSG-NUMBER            VLKCS511
071200                         SET DP020-MSG-INFORMATIONAL              VLKCS511
071300                                   TO TRUE                        VLKCS511
071400                     END-IF                                       VLKCS511
071500                 ELSE                                             VLKCS511
071600                     MOVE ASC-START-ITEM-REQUEST-N                VLKCS511
071700                                   TO PV-TOP-ITEM                 VLKCS511
071800                     MOVE SPACE    TO ASC-START-ITEM-REQUEST      VLKCS511
071900                     COMPUTE PV-BOTTOM-ITEM =                     VLKCS511
072000                         PV-TOP-ITEM + PC-ITEMS-PER-PANEL - 1     VLKCS511
072100                     IF  PV-BOTTOM-ITEM > ASC-NUMBER-OF-ITEMS-READVLKCS511
072200*                        -- BOTTOM OF LIST --                     VLKCS511
072300                         MOVE PC-TSYMSG-00070                     VLKCS511
072400                                   TO DP020-MSG-NUMBER            VLKCS511
072500                         SET DP020-MSG-INFORMATIONAL              VLKCS511
072600                                   TO TRUE                        VLKCS511
072700                     END-IF                                       VLKCS511
072800                 END-IF                                           VLKCS511
072900             ELSE                                                 VLKCS511
072910                CONTINUE                                                  
073000*                --- VALUE OUT OF RANGE ----                      VLKCS511
073100*                MOVE PC-TSYMSG-00101                             VLKCS511
073200*                                  TO DP020-MSG-NUMBER            VLKCS511
073300*                MOVE -1           TO ASTRTITL                    VLKCS511
073400*                SET DP030-SET-CURSOR-APPL-1                      VLKCS511
073500*                                  TO TRUE                        VLKCS511
073600*                MOVE DP015-REVERSE                               VLKCS511
073700*                                  TO ASTRTITH                    VLKCS511
073800*                MOVE DP015-RED    TO ASTRTITC                    VLKCS511
073900*                MOVE DP015-UNP-NUM-BRT-MDT                       VLKCS511
074000*                                  TO ASTRTITA                    VLKCS511
074100*                SET DP020-MSG-FATAL                              VLKCS511
074200*                                  TO TRUE                        VLKCS511
074300*                SET PS-ERROR      TO TRUE                        VLKCS511
074400             END-IF                                               VLKCS511
074500                                                                  VLKCS511
074600         ELSE                                                     VLKCS511
074610             CONTINUE                                                     
074700*            MOVE PC-TSYMSG-00008  TO DP020-MSG-NUMBER            VLKCS511
074800*            MOVE -1               TO ASTRTITL                    VLKCS511
074900*            SET DP030-SET-CURSOR-APPL-1 TO TRUE                  VLKCS511
075000*            MOVE DP015-REVERSE    TO ASTRTITH                    VLKCS511
075100*            MOVE DP015-RED        TO ASTRTITC                    VLKCS511
075200*            MOVE DP015-UNP-NUM-BRT-MDT                           VLKCS511
075300*                                  TO ASTRTITA                    VLKCS511
075400*            SET DP020-MSG-FATAL   TO TRUE                        VLKCS511
075500*            SET PS-ERROR          TO TRUE                        VLKCS511
075600         END-IF                                                   VLKCS511
075700     END-IF.                                                      VLKCS511
075800                                                                  VLKCS511
075900*----------------------------------------------------------------*VLKCS511
076000*    IF THE USER HITS THE DESELECT KEY, CLEAR THE SELECTION      *VLKCS511
076100*    SWITCH FOR ALL ITEMS THAT WERE PREVIOUSLY SELECTED.         *VLKCS511
076200*----------------------------------------------------------------*VLKCS511
076300 2140-DESELECT-ALL-ITEMS.                                         VLKCS511
076400                                                                  VLKCS511
076500     MOVE +1                       TO ASC-BLK-SUB.                VLKCS511
076600                                                                  VLKCS511
076700     PERFORM 2141-CLEAR-SELECTED-INDS                             VLKCS511
076800         VARYING ASC-ITEM-SUB                                     VLKCS511
076900         FROM 1 BY 1                                              VLKCS511
077000         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 VLKCS511
077100                                                                  VLKCS511
077200     ADD +1                        TO ASC-BLK-SUB.                VLKCS511
077300                                                                  VLKCS511
077400     PERFORM 2141-CLEAR-SELECTED-INDS                             VLKCS511
077500         VARYING ASC-ITEM-SUB                                     VLKCS511
077600         FROM 1 BY 1                                              VLKCS511
077700         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 VLKCS511
077800                                                                  VLKCS511
077900     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               VLKCS511
078000                                   TO PV-LIST-ITEM-NUMBER.        VLKCS511
078100                                                                  VLKCS511
078200     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            VLKCS511
078300         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    VLKCS511
078400                                                                  VLKCS511
078500     IF (PV-FIRST-BLOCK-IN-ARRAY NOT = +1) OR                     VLKCS511
078600        (ASC-HIGHEST-BLOCK-WRITTEN > PC-MAX-BLOCKS-IN-ARRAY)      VLKCS511
078700         MOVE +1                   TO ASC-BLK-SUB                 VLKCS511
078800                                                                  VLKCS511
078900         PERFORM 5100-WRITE-TEMP-STORAGE                          VLKCS511
079000                                                                  VLKCS511
079100         MOVE +1                   TO PV-BLOCK-NUMBER             VLKCS511
079200                                                                  VLKCS511
079300         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         VLKCS511
079400             PV-FIRST-BLOCK-IN-ARRAY - 1                          VLKCS511
079500                                                                  VLKCS511
079600         PERFORM                                                  VLKCS511
079700             UNTIL PV-BLOCK-NUMBER > PV-PREV-BLOCK-IN-ARRAY       VLKCS511
079800                                                                  VLKCS511
079900             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
080000                                                                  VLKCS511
080100             PERFORM 2141-CLEAR-SELECTED-INDS                     VLKCS511
080200                 VARYING ASC-ITEM-SUB FROM 1 BY 1                 VLKCS511
080300                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          VLKCS511
080400                                                                  VLKCS511
080500             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
080600                                                                  VLKCS511
080700             ADD +1                TO PV-BLOCK-NUMBER             VLKCS511
080800                                                                  VLKCS511
080900         END-PERFORM                                              VLKCS511
081000                                                                  VLKCS511
081100         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         VLKCS511
081200             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     VLKCS511
081300                                                                  VLKCS511
081400         PERFORM                                                  VLKCS511
081500             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       VLKCS511
081600                   ASC-HIGHEST-BLOCK-WRITTEN                      VLKCS511
081700                                                                  VLKCS511
081800             MOVE PV-NEXT-BLOCK-IN-ARRAY                          VLKCS511
081900                                   TO PV-BLOCK-NUMBER             VLKCS511
082000                                                                  VLKCS511
082100             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
082200                                                                  VLKCS511
082300             PERFORM 2141-CLEAR-SELECTED-INDS                     VLKCS511
082400                 VARYING ASC-ITEM-SUB                             VLKCS511
082500                 FROM 1 BY 1                                      VLKCS511
082600                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          VLKCS511
082700                                                                  VLKCS511
082800             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
082900                                                                  VLKCS511
083000             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      VLKCS511
083100                                                                  VLKCS511
083200         END-PERFORM                                              VLKCS511
083300                                                                  VLKCS511
083400         MOVE PV-FIRST-BLOCK-IN-ARRAY                             VLKCS511
083500                                   TO PV-BLOCK-NUMBER             VLKCS511
083600                                                                  VLKCS511
083700         PERFORM 4410-READ-TEMP-STORAGE                           VLKCS511
083800     END-IF.                                                      VLKCS511
083900                                                                  VLKCS511
084000                                                                  VLKCS511
084100     MOVE +0                     TO ASC-NUMBER-OF-SELECTED-ITEMS. VLKCS511
084200     MOVE +0                       TO ASC-START-OF-SELECTED-RANGE.VLKCS511
084300     MOVE +0                       TO ASC-END-OF-SELECTED-RANGE.  VLKCS511
084400                                                                  VLKCS511
084500     PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                        VLKCS511
084600                                                                  VLKCS511
084700*----------------------------------------------------------------*VLKCS511
084800*    MARK EACH ITEM AS BEING NOT SELECTED.                       *VLKCS511
084900*----------------------------------------------------------------*VLKCS511
085000 2141-CLEAR-SELECTED-INDS.                                        VLKCS511
085100                                                                  VLKCS511
085200     IF  ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB ASC-ITEM-SUB)           VLKCS511
085300             NOT EQUAL ZERO                                       VLKCS511
085400         IF  NOT ASC-NO-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          VLKCS511
085500             SET ASC-NO-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          VLKCS511
085600                 ASC-TEMP-NO-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)    VLKCS511
085700                 ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                  VLKCS511
085800                                   TO TRUE                        VLKCS511
085900         END-IF                                                   VLKCS511
086000     END-IF.                                                      VLKCS511
086100                                                                  VLKCS511
086200*----------------------------------------------------------------*VLKCS511
086300*  IF THE USER HITS THE SELECT-ALL KEY, SET THE SELECTIO SWITCH  *VLKCS511
086400*  FOR ALL ITEMS.                                                *VLKCS511
086500*----------------------------------------------------------------*VLKCS511
086600 2150-SELECT-ALL-ITEMS.                                           VLKCS511
086700                                                                  VLKCS511
086800     MOVE +1                       TO ASC-BLK-SUB.                VLKCS511
086900                                                                  VLKCS511
087000     PERFORM 2151-SET-SELECTED-INDS                               VLKCS511
087100         VARYING ASC-ITEM-SUB                                     VLKCS511
087200         FROM 1 BY 1                                              VLKCS511
087300         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 VLKCS511
087400                                                                  VLKCS511
087500     ADD +1                        TO ASC-BLK-SUB.                VLKCS511
087600                                                                  VLKCS511
087700     PERFORM 2151-SET-SELECTED-INDS                               VLKCS511
087800         VARYING ASC-ITEM-SUB                                     VLKCS511
087900         FROM 1 BY 1                                              VLKCS511
088000         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 VLKCS511
088100                                                                  VLKCS511
088200     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               VLKCS511
088300                                   TO PV-LIST-ITEM-NUMBER.        VLKCS511
088400                                                                  VLKCS511
088500     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            VLKCS511
088600         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    VLKCS511
088700                                                                  VLKCS511
088800     IF (PV-FIRST-BLOCK-IN-ARRAY NOT = +1) OR                     VLKCS511
088900        (ASC-HIGHEST-BLOCK-WRITTEN >   PC-MAX-BLOCKS-IN-ARRAY)    VLKCS511
089000         MOVE +1                   TO ASC-BLK-SUB                 VLKCS511
089100                                                                  VLKCS511
089200         PERFORM 5100-WRITE-TEMP-STORAGE                          VLKCS511
089300                                                                  VLKCS511
089400         MOVE +1                   TO PV-BLOCK-NUMBER             VLKCS511
089500                                                                  VLKCS511
089600         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         VLKCS511
089700             PV-FIRST-BLOCK-IN-ARRAY - 1                          VLKCS511
089800                                                                  VLKCS511
089900         PERFORM                                                  VLKCS511
090000             UNTIL PV-BLOCK-NUMBER > PV-PREV-BLOCK-IN-ARRAY       VLKCS511
090100                                                                  VLKCS511
090200             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
090300                                                                  VLKCS511
090400             PERFORM 2151-SET-SELECTED-INDS                       VLKCS511
090500                 VARYING ASC-ITEM-SUB                             VLKCS511
090600                 FROM 1 BY 1                                      VLKCS511
090700                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          VLKCS511
090800                                                                  VLKCS511
090900             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
091000                                                                  VLKCS511
091100             ADD +1                TO PV-BLOCK-NUMBER             VLKCS511
091200                                                                  VLKCS511
091300         END-PERFORM                                              VLKCS511
091400                                                                  VLKCS511
091500         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         VLKCS511
091600             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     VLKCS511
091700                                                                  VLKCS511
091800         PERFORM                                                  VLKCS511
091900             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       VLKCS511
092000                   ASC-HIGHEST-BLOCK-WRITTEN                      VLKCS511
092100                                                                  VLKCS511
092200             MOVE PV-NEXT-BLOCK-IN-ARRAY                          VLKCS511
092300                                   TO PV-BLOCK-NUMBER             VLKCS511
092400                                                                  VLKCS511
092500             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
092600                                                                  VLKCS511
092700             PERFORM 2151-SET-SELECTED-INDS                       VLKCS511
092800                 VARYING ASC-ITEM-SUB                             VLKCS511
092900                 FROM 1 BY 1                                      VLKCS511
093000                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          VLKCS511
093100                                                                  VLKCS511
093200             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
093300                                                                  VLKCS511
093400             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      VLKCS511
093500                                                                  VLKCS511
093600         END-PERFORM                                              VLKCS511
093700                                                                  VLKCS511
093800         MOVE PV-FIRST-BLOCK-IN-ARRAY                             VLKCS511
093900                                   TO PV-BLOCK-NUMBER             VLKCS511
094000                                                                  VLKCS511
094100         PERFORM 4410-READ-TEMP-STORAGE                           VLKCS511
094200     END-IF.                                                      VLKCS511
094300                                                                  VLKCS511
094400                                                                  VLKCS511
094500     MOVE ASC-NUMBER-OF-ITEMS-READ TO                             VLKCS511
094600                       ASC-NUMBER-OF-SELECTED-ITEMS.              VLKCS511
094700                                                                  VLKCS511
094800     PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                        VLKCS511
094900                                                                  VLKCS511
095000*----------------------------------------------------------------*VLKCS511
095100*    MARK EACH ITEM AS BEING SELECTED.                           *VLKCS511
095200*----------------------------------------------------------------*VLKCS511
095300 2151-SET-SELECTED-INDS.                                          VLKCS511
095400                                                                  VLKCS511
095500     IF  ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB ASC-ITEM-SUB)           VLKCS511
095600             NOT EQUAL ZERO                                       VLKCS511
095700         IF  NOT ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)             VLKCS511
095800             SET ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)             VLKCS511
095900                 ASC-TEMP-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)        VLKCS511
096000                 ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                  VLKCS511
096100                               TO  TRUE                           VLKCS511
096200         END-IF                                                   VLKCS511
096300     END-IF.                                                      VLKCS511
096400                                                                  VLKCS511
096500******************************************************************VLKCS511
096600** MOVE ALL OF THE FIELDS THAT WERE ENTERED / CHANGED ON THE    **VLKCS511
096700** SCREEN INTO THE COMMAREA.  ALL EDITTING IS DONE IN THE COMM. **VLKCS511
096800******************************************************************VLKCS511
096900 2200-MOVE-SCREEN-TO-COMMAREA.                                    VLKCS511
097000                                                                  VLKCS511
097100     MOVE PV-TOP-ITEM              TO PV-ITEM-IN-USE.             VLKCS511
097200     MOVE +1                       TO PV-SUB.                     VLKCS511
097300                                                                  VLKCS511
097400     PERFORM 3100-SET-SUBSCRIPTS.                                 VLKCS511
097500*    IF  ASTRTITL > ZERO                                          VLKCS511
097600*        MOVE ASTRTITI         TO ASC-START-ITEM-REQUEST          VLKCS511
097700*    ELSE                                                         VLKCS511
097800*        IF  ASTRTITF = DP015-ERASE-EOF                           VLKCS511
097900*            INITIALIZE ASC-START-ITEM-REQUEST                    VLKCS511
098000*        END-IF                                                   VLKCS511
098100*    END-IF.                                                      VLKCS511
098200     PERFORM 2210-MOVE-LINES-TO-COMMAREA                          VLKCS511
098300         VARYING PV-SUB                                           VLKCS511
098400         FROM 1 BY 1                                              VLKCS511
098500         UNTIL PV-SUB > ASC-ITEMS-DISPLAYED.                      VLKCS511
098600                                                                  VLKCS511
098700******************************************************************VLKCS511
098800** MOVE THE ENTERABLE FIELDS ON EACH LIST LINE INTO THE COMMAREA**VLKCS511
098900******************************************************************VLKCS511
099000 2210-MOVE-LINES-TO-COMMAREA.                                     VLKCS511
099100                                                                  VLKCS511
099200     IF  MR-SELECTL (PV-SUB) > ZERO                               VLKCS511
099300         SET ASC-BLOCK-MODIFIED (ASC-BLK-SUB) TO TRUE             VLKCS511
099400         MOVE MR-SELECTI (PV-SUB)                                 VLKCS511
099500                                   TO ASC-TEMP-SELECTED-SW        VLKCS511
099600                                 (ASC-BLK-SUB, ASC-ITEM-SUB)      VLKCS511
099700     ELSE                                                         VLKCS511
099800         IF  MR-SELECTA (PV-SUB) = DP015-ERASE-EOF                VLKCS511
099900                 SET ASC-BLOCK-MODIFIED (ASC-BLK-SUB) TO TRUE     VLKCS511
100000                 MOVE SPACE        TO ASC-TEMP-SELECTED-SW        VLKCS511
100100                                 (ASC-BLK-SUB, ASC-ITEM-SUB)      VLKCS511
100200         END-IF                                                   VLKCS511
100300     END-IF.                                                      VLKCS511
100400     ADD +1                        TO ASC-ITEM-SUB.               VLKCS511
100500     IF  ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                        VLKCS511
100600         ADD +1                    TO ASC-BLK-SUB                 VLKCS511
100700         MOVE +1                   TO ASC-ITEM-SUB                VLKCS511
100800     END-IF.                                                      VLKCS511
100900                                                                  VLKCS511
101000******************************************************************VLKCS511
101100** EDIT ALL OF THE DATA ON THE SCREEN AS IT RESIDES IN THE      **VLKCS511
101200** COMMAREA (EDITTING IS NOT DONE AGAINST THE SCREEN DIRECTLY). **VLKCS511
101300******************************************************************VLKCS511
101400 3000-EDIT-DATA-IN-COMMAREA.                                      VLKCS511
101500                                                                  VLKCS511
101600     SET PS-NO-ERROR               TO TRUE.                       VLKCS511
101700     PERFORM 3200-RESET-ATTRIBUTES.                               VLKCS511
101800     MOVE ASC-ITEMS-DISPLAYED      TO PV-SUB.                     VLKCS511
101900**                                                                VLKCS511
102000* CALCULATE THE POSITION OF THE LAST ITEM DISPLAYED.              VLKCS511
102100* EDITTING IS DONE FROM THE BOTTOM UP.                            VLKCS511
102200**                                                                VLKCS511
102300     COMPUTE PV-ITEM-IN-USE = PV-TOP-ITEM +                       VLKCS511
102400         ASC-ITEMS-DISPLAYED - 1.                                 VLKCS511
102500     PERFORM 3100-SET-SUBSCRIPTS.                                 VLKCS511
102600     PERFORM 3300-EDIT-SELECTIONS                                 VLKCS511
102700         VARYING PV-SUB                                           VLKCS511
102800         FROM PV-SUB BY -1                                        VLKCS511
102900         UNTIL PV-SUB < +1                                        VLKCS511
103000                                                                  VLKCS511
103100     IF  PS-NO-ERROR                                              VLKCS511
103200         PERFORM 3400-CHECK-RANGE-SEQUENCE                        VLKCS511
103300     END-IF.                                                      VLKCS511
103400                                                                  VLKCS511
103500     IF  ((PS-NO-ERROR)                                           VLKCS511
103600       AND (ASC-START-OF-SELECTED-RANGE > ZERO)                   VLKCS511
103700       AND (ASC-END-OF-SELECTED-RANGE > ZERO))                    VLKCS511
103800             PERFORM 3500-MARK-RANGE-AS-SELECTED                  VLKCS511
103900     END-IF.                                                      VLKCS511
104000                                                                  VLKCS511
104100*----------------------------------------------------------------*VLKCS511
104200*    DETERMINE THE VALUE OF THE ITEM SUBSCRIPT BASED ON THE ITEM *VLKCS511
104300*    CURRENTLY IN USE AND THE FIRST ITEM IN THE ARRAY.  THIS WILL*VLKCS511
104400*    POSITION US IN THE 1ST BLOCK OF THE ARRAY.                  *VLKCS511
104500*                                                                *VLKCS511
104600*    IF THE ITEM SUBSCRIPT EXCEEDS THE MAXIMUM NUMBER OF ITEMS   *VLKCS511
104700*    IN A BLOCK, RECALCULATE THE SUBSCRIPT BY SUBTRACTING OUT    *VLKCS511
104800*    THE MAXIMUM NUMBER OF ITEMS.  THIS WILL CORRECTLY POSITION  *VLKCS511
104900*    US IN THE 2ND BLOCK OF THE ARRAY.                           *VLKCS511
105000*----------------------------------------------------------------*VLKCS511
105100 3100-SET-SUBSCRIPTS.                                             VLKCS511
105200                                                                  VLKCS511
105300     COMPUTE ASC-ITEM-SUB =                                       VLKCS511
105400         (PV-ITEM-IN-USE - ASC-LIST-ITEM-NUMBER(1 1)) + 1.        VLKCS511
105500                                                                  VLKCS511
105600     IF ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                         VLKCS511
105700         SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-SUB            VLKCS511
105800                                                                  VLKCS511
105900         MOVE PC-MAX-BLOCKS-IN-ARRAY TO ASC-BLK-SUB               VLKCS511
106000     ELSE                                                         VLKCS511
106100         MOVE +1                     TO ASC-BLK-SUB               VLKCS511
106200     END-IF.                                                      VLKCS511
106300                                                                  VLKCS511
106400******************************************************************VLKCS511
106500** RESET THE ATTRIBUTES OF ALL ENTERABLE FIELDS ON THE MAP.     **VLKCS511
106600******************************************************************VLKCS511
106700 3200-RESET-ATTRIBUTES.                                           VLKCS511
106800                                                                  VLKCS511
106900*    MOVE DP015-UNP-ALP-NOR-OFF TO ASTRTITA.                      VLKCS511
107000*    MOVE DP015-GREEN           TO ASTRTITC.                      VLKCS511
107100*    MOVE DP015-UNDERLINE       TO ASTRTITH.                      VLKCS511
107200                                                                  VLKCS511
107300     IF DP020-NEXT-ACT-RETURN OR                                  VLKCS511
107400        DP020-NEXT-ACT-READ-MAP                                   VLKCS511
107500         PERFORM VARYING PV-SUB  FROM 1 BY 1                      VLKCS511
107600                 UNTIL   PV-SUB > ASC-ITEMS-DISPLAYED             VLKCS511
107700                  MOVE DP015-UNP-ALP-NOR-OFF                      VLKCS511
107800                                       TO MR-SELECTA (PV-SUB)     VLKCS511
107900                  MOVE DP015-GREEN     TO MR-SELECTC (PV-SUB)     VLKCS511
108000                  MOVE DP015-UNDERLINE TO MR-SELECTH (PV-SUB)     VLKCS511
108100         END-PERFORM                                              VLKCS511
108200     ELSE                                                         VLKCS511
108300         PERFORM VARYING PV-SUB  FROM 1 BY 1                      VLKCS511
108400                 UNTIL   PV-SUB > PC-ITEMS-PER-PANEL              VLKCS511
108500                  MOVE DP015-UNP-ALP-NOR-OFF                      VLKCS511
108600                                       TO MR-SELECTA (PV-SUB)     VLKCS511
108700                  MOVE DP015-GREEN     TO MR-SELECTC (PV-SUB)     VLKCS511
108800                  MOVE DP015-UNDERLINE TO MR-SELECTH (PV-SUB)     VLKCS511
108900         END-PERFORM.                                             VLKCS511
109000                                                                  VLKCS511
109100******************************************************************VLKCS511
109200** EDIT THE SELECTIONS MADE.  NOTE THAT THE 'SELECTED-SW' IS    **VLKCS511
109300** WHAT WAS PREVIOUSLY CHECKED AND CORRECT 'TEMP-SELECTED-SW'   **VLKCS511
109400** IS WHAT HAS JUST BEEN ENTERED AND HAS NOT BEEN EDITTED OR    **VLKCS511
109500** WAS ENTERED EARLIER, BUT DID NOT PASS THE EDITS.             **VLKCS511
109600******************************************************************VLKCS511
109700 3300-EDIT-SELECTIONS.                                            VLKCS511
109800                                                                  VLKCS511
109900     EVALUATE TRUE                                                VLKCS511
110000         WHEN ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)     VLKCS511
110100             = ASC-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)         VLKCS511
110200                 CONTINUE                                         VLKCS511
110300         WHEN ASC-TEMP-SELECT  (ASC-BLK-SUB ASC-ITEM-SUB)         VLKCS511
110400             IF  NOT ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)        VLKCS511
110500                 ADD +1         TO ASC-NUMBER-OF-SELECTED-ITEMS   VLKCS511
110600                 MOVE ASC-TEMP-SELECTED-SW                        VLKCS511
110700                                      (ASC-BLK-SUB ASC-ITEM-SUB)  VLKCS511
110800                                TO ASC-SELECTED-SW                VLKCS511
110900                                      (ASC-BLK-SUB ASC-ITEM-SUB)  VLKCS511
111000             END-IF                                               VLKCS511
111100         WHEN ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)     VLKCS511
111200                 = SPACE                                          VLKCS511
111300             EVALUATE TRUE                                        VLKCS511
111400                 WHEN ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)       VLKCS511
111500                     SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMSVLKCS511
111600                     MOVE SPACE TO ASC-SELECTED-SW                VLKCS511
111700                                      (ASC-BLK-SUB ASC-ITEM-SUB)  VLKCS511
111800                 WHEN ASC-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)        VLKCS511
111900                     MOVE ZERO  TO ASC-START-OF-SELECTED-RANGE    VLKCS511
112000                     MOVE SPACE TO ASC-SELECTED-SW                VLKCS511
112100                                      (ASC-BLK-SUB ASC-ITEM-SUB)  VLKCS511
112200                 WHEN ASC-END (ASC-BLK-SUB ASC-ITEM-SUB)          VLKCS511
112300                     MOVE ZERO  TO ASC-END-OF-SELECTED-RANGE      VLKCS511
112400                     MOVE SPACE TO ASC-SELECTED-SW                VLKCS511
112500                                      (ASC-BLK-SUB ASC-ITEM-SUB)  VLKCS511
112600             END-EVALUATE                                         VLKCS511
112700         WHEN ASC-TEMP-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)           VLKCS511
112800             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            VLKCS511
112900                 SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMS    VLKCS511
113000             END-IF                                               VLKCS511
113100             PERFORM 3310-EDIT-RANGE                              VLKCS511
113200         WHEN ASC-TEMP-END (ASC-BLK-SUB ASC-ITEM-SUB)             VLKCS511
113300             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            VLKCS511
113400                 SUBTRACT +1 FROM ASC-NUMBER-OF-SELECTED-ITEMS    VLKCS511
113500             END-IF                                               VLKCS511
113600             PERFORM 3310-EDIT-RANGE                              VLKCS511
113700         WHEN OTHER                                               VLKCS511
113800             MOVE PC-TSYMSG-00005   TO DP020-MSG-NUMBER           VLKCS511
113900             SET DP020-MSG-FATAL    TO TRUE                       VLKCS511
114000             MOVE -1                TO MR-SELECTL (PV-SUB)        VLKCS511
114100             SET DP030-SET-CURSOR-APPL-1                          VLKCS511
114200                                    TO TRUE                       VLKCS511
114300             MOVE DP015-RED         TO MR-SELECTC (PV-SUB)        VLKCS511
114400             MOVE DP015-REVERSE     TO MR-SELECTH (PV-SUB)        VLKCS511
114500             SET PS-ERROR TO TRUE                                 VLKCS511
114600             IF  ASC-SELECT (ASC-BLK-SUB ASC-ITEM-SUB)            VLKCS511
114700                 SUBTRACT 1 FROM ASC-NUMBER-OF-SELECTED-ITEMS     VLKCS511
114800                 MOVE SPACE         TO ASC-SELECTED-SW            VLKCS511
114900                                        (ASC-BLK-SUB ASC-ITEM-SUB)VLKCS511
115000             END-IF                                               VLKCS511
115100     END-EVALUATE.                                                VLKCS511
115200                                                                  VLKCS511
115300     SUBTRACT +1             FROM PV-ITEM-IN-USE.                 VLKCS511
115400     SUBTRACT +1 FROM ASC-ITEM-SUB.                               VLKCS511
115500     IF  ASC-ITEM-SUB < 1                                         VLKCS511
115600         SUBTRACT +1 FROM ASC-BLK-SUB                             VLKCS511
115700         MOVE PC-ITEMS-PER-PANEL   TO ASC-ITEM-SUB                VLKCS511
115800     END-IF.                                                      VLKCS511
115900                                                                  VLKCS511
116000******************************************************************VLKCS511
116100** IF A BEGINNING AND END OF RANGE WAS ENTERED TO SELECT A      **VLKCS511
116200** RANGE OF LINES, MAKE SURE THERE IS ONLY 1 BEGINNING AND 1    **VLKCS511
116300** ENDING AND MAKE SURE THAT THE BEGINNING IS BEFORE (LESS THAN)**VLKCS511
116400** THE ENDING.                                                  **VLKCS511
116500******************************************************************VLKCS511
116600 3310-EDIT-RANGE.                                                 VLKCS511
116700                                                                  VLKCS511
116800     IF  ASC-TEMP-BEGIN (ASC-BLK-SUB ASC-ITEM-SUB)                VLKCS511
116900         IF  ASC-START-OF-SELECTED-RANGE = ZERO                   VLKCS511
117000             MOVE ASC-TEMP-SELECTED-SW  (ASC-BLK-SUB ASC-ITEM-SUB)VLKCS511
117100                                   TO ASC-SELECTED-SW             VLKCS511
117200                                        (ASC-BLK-SUB ASC-ITEM-SUB)VLKCS511
117300             MOVE PV-ITEM-IN-USE   TO ASC-START-OF-SELECTED-RANGE VLKCS511
117400         ELSE                                                     VLKCS511
117500             IF  ASC-START-OF-SELECTED-RANGE = PV-ITEM-IN-USE     VLKCS511
117600                 CONTINUE                                         VLKCS511
117700             ELSE                                                 VLKCS511
117800*                -- ONLY ONE BEGINNING-OF-RANGE-ALLOWED --        VLKCS511
117900                 MOVE PC-TSYMSG-00054                             VLKCS511
118000                                   TO DP020-MSG-NUMBER            VLKCS511
118100                 SET DP020-MSG-FATAL                              VLKCS511
118200                                   TO TRUE                        VLKCS511
118300                 MOVE -1           TO MR-SELECTL (PV-SUB)         VLKCS511
118400                 SET DP030-SET-CURSOR-APPL-1                      VLKCS511
118500                                   TO TRUE                        VLKCS511
118600                 MOVE DP015-RED    TO MR-SELECTC (PV-SUB)         VLKCS511
118700                 MOVE DP015-UNDERLINE                             VLKCS511
118800                                   TO MR-SELECTH (PV-SUB)         VLKCS511
118900                 SET PS-ERROR      TO TRUE                        VLKCS511
119000             END-IF                                               VLKCS511
119100         END-IF                                                   VLKCS511
119200     ELSE                                                         VLKCS511
119300         IF  ASC-END-OF-SELECTED-RANGE = ZERO                     VLKCS511
119400             MOVE ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB) VLKCS511
119500                                   TO ASC-SELECTED-SW             VLKCS511
119600                                     (ASC-BLK-SUB ASC-ITEM-SUB)   VLKCS511
119700             MOVE PV-ITEM-IN-USE   TO ASC-END-OF-SELECTED-RANGE   VLKCS511
119800         ELSE                                                     VLKCS511
119900             IF  ASC-END-OF-SELECTED-RANGE = PV-ITEM-IN-USE       VLKCS511
120000                 CONTINUE                                         VLKCS511
120100             ELSE                                                 VLKCS511
120200*                -- ONLY ONE END-OF-RANGE ALLOWED --              VLKCS511
120300                 MOVE PC-TSYMSG-00055                             VLKCS511
120400                                   TO DP020-MSG-NUMBER            VLKCS511
120500                 SET DP020-MSG-FATAL                              VLKCS511
120600                                   TO TRUE                        VLKCS511
120700                 MOVE -1           TO MR-SELECTL (PV-SUB)         VLKCS511
120800                 SET DP030-SET-CURSOR-APPL-1                      VLKCS511
120900                                   TO TRUE                        VLKCS511
121000                 SET PS-ERROR      TO TRUE                        VLKCS511
121100             END-IF                                               VLKCS511
121200         END-IF                                                   VLKCS511
121300     END-IF.                                                      VLKCS511
121400                                                                  VLKCS511
121500******************************************************************VLKCS511
121600** IF BOTH A BEGINNING AND END OF RANGE HAVE BEEN SPECIFIED,    **VLKCS511
121700** MAKE SURE THAT THE BEGINNING IS BEFORE (LESS THAN) THE END.  **VLKCS511
121800******************************************************************VLKCS511
121900 3400-CHECK-RANGE-SEQUENCE.                                       VLKCS511
122000                                                                  VLKCS511
122100     IF  ASC-START-OF-SELECTED-RANGE > ZERO                       VLKCS511
122200       AND  ASC-END-OF-SELECTED-RANGE > ZERO                      VLKCS511
122300       AND  ASC-START-OF-SELECTED-RANGE >                         VLKCS511
122400                                         ASC-END-OF-SELECTED-RANGEVLKCS511
122500*        -- END-OF-RANGE BEFORE BEGINNING-OF-RANGE                VLKCS511
122600         MOVE PC-TSYMSG-00052 TO DP020-MSG-NUMBER                 VLKCS511
122700         SET DP020-MSG-FATAL TO TRUE                              VLKCS511
122800         SET PS-ERROR TO TRUE                                     VLKCS511
122900         PERFORM 3410-POSITION-AT-ERROR                           VLKCS511
123000     END-IF.                                                      VLKCS511
123100                                                                  VLKCS511
123200******************************************************************VLKCS511
123300** BECAUSE RANGES CAN SPAN ACROSS MULTIPLE PAGES, A SEPARATE    **VLKCS511
123400** PARAGRAPH (THIS ONE) IS NEEDED TO DETERMINE WHERE THE CURSOR **VLKCS511
123500** SHOULD BE POSITIONED ON A RANGE ERROR.                       **VLKCS511
123600******************************************************************VLKCS511
123700 3410-POSITION-AT-ERROR.                                          VLKCS511
123800                                                                  VLKCS511
123900     SET DP030-SET-CURSOR-APPL-1                                  VLKCS511
124000                                   TO TRUE.                       VLKCS511
124100     COMPUTE PV-SUB = ASC-START-OF-SELECTED-RANGE                 VLKCS511
124200                    - PV-TOP-ITEM + 1.                            VLKCS511
124300     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      VLKCS511
124400         CONTINUE                                                 VLKCS511
124500     ELSE                                                         VLKCS511
124600         MOVE -1                   TO MR-SELECTL (PV-SUB)         VLKCS511
124700         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         VLKCS511
124800         MOVE DP015-RED            TO MR-SELECTC (PV-SUB)         VLKCS511
124900     END-IF.                                                      VLKCS511
125000                                                                  VLKCS511
125100     COMPUTE PV-SUB = ASC-END-OF-SELECTED-RANGE                   VLKCS511
125200                    - PV-TOP-ITEM + 1.                            VLKCS511
125300     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      VLKCS511
125400         CONTINUE                                                 VLKCS511
125500     ELSE                                                         VLKCS511
125600         MOVE -1                   TO MR-SELECTL (PV-SUB)         VLKCS511
125700         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         VLKCS511
125800         MOVE DP015-RED            TO MR-SELECTC (PV-SUB)         VLKCS511
125900     END-IF.                                                      VLKCS511
126000                                                                  VLKCS511
126100*----------------------------------------------------------------*VLKCS511
126200*    WHENEVER THE USER SELECTS AN ITEM AS THE BEGINNING RANGE    *VLKCS511
126300*    AND ONE AS THE ENDING RANGE, MARK THESE ITEMS AS WELL AS    *VLKCS511
126400*    THOSE THAT FALL IN THE RANGE AS BEING SELECTED.             *VLKCS511
126500*----------------------------------------------------------------*VLKCS511
126600 3500-MARK-RANGE-AS-SELECTED.                                     VLKCS511
126700                                                                  VLKCS511
126800     MOVE +1                       TO  ASC-BLK-SUB.               VLKCS511
126900     PERFORM 3510-MARK-SELECTED-INDS                              VLKCS511
127000         VARYING ASC-ITEM-SUB                                     VLKCS511
127100         FROM 1 BY 1                                              VLKCS511
127200         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 VLKCS511
127300                                                                  VLKCS511
127400     ADD +1                        TO ASC-BLK-SUB.                VLKCS511
127500     PERFORM 3510-MARK-SELECTED-INDS                              VLKCS511
127600         VARYING ASC-ITEM-SUB                                     VLKCS511
127700         FROM 1 BY 1                                              VLKCS511
127800         UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL.                 VLKCS511
127900                                                                  VLKCS511
128000     MOVE ASC-LIST-ITEM-NUMBER(1 1)                               VLKCS511
128100                                   TO  PV-LIST-ITEM-NUMBER.       VLKCS511
128200     COMPUTE PV-FIRST-BLOCK-IN-ARRAY =                            VLKCS511
128300         1 + ((PV-LIST-ITEM-NUMBER - 1) /                         VLKCS511
128400               PC-ITEMS-PER-PANEL).                               VLKCS511
128500                                                                  VLKCS511
128600     MOVE ASC-START-OF-SELECTED-RANGE                             VLKCS511
128700                                   TO PV-START-OF-SELECTED-RANGE. VLKCS511
128800     COMPUTE PV-FIRST-BLOCK-IN-RANGE =                            VLKCS511
128900         1 + ((PV-START-OF-SELECTED-RANGE - 1) /                  VLKCS511
129000               PC-ITEMS-PER-PANEL).                               VLKCS511
129100                                                                  VLKCS511
129200     MOVE ASC-END-OF-SELECTED-RANGE                               VLKCS511
129300                                   TO  PV-END-OF-SELECTED-RANGE.  VLKCS511
129400     COMPUTE PV-LAST-BLOCK-IN-RANGE =                             VLKCS511
129500         1 + ((PV-END-OF-SELECTED-RANGE - 1) /                    VLKCS511
129600               PC-ITEMS-PER-PANEL).                               VLKCS511
129700     COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                             VLKCS511
129800         PV-FIRST-BLOCK-IN-ARRAY + 1.                             VLKCS511
129900                                                                  VLKCS511
130000     IF (PV-FIRST-BLOCK-IN-RANGE < PV-FIRST-BLOCK-IN-ARRAY) OR    VLKCS511
130100        (PV-LAST-BLOCK-IN-RANGE  > PV-NEXT-BLOCK-IN-ARRAY)        VLKCS511
130200         MOVE +1                   TO ASC-BLK-SUB                 VLKCS511
130300         PERFORM 5100-WRITE-TEMP-STORAGE                          VLKCS511
130400         COMPUTE PV-PREV-BLOCK-IN-ARRAY =                         VLKCS511
130500             PV-FIRST-BLOCK-IN-ARRAY - 1                          VLKCS511
130600                                                                  VLKCS511
130700         PERFORM                                                  VLKCS511
130800             UNTIL PV-FIRST-BLOCK-IN-RANGE >                      VLKCS511
130900                   PV-PREV-BLOCK-IN-ARRAY                         VLKCS511
131000             MOVE PV-FIRST-BLOCK-IN-RANGE                         VLKCS511
131100                                   TO PV-BLOCK-NUMBER             VLKCS511
131200             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
131300             PERFORM 3510-MARK-SELECTED-INDS                      VLKCS511
131400                 VARYING ASC-ITEM-SUB                             VLKCS511
131500                 FROM 1 BY 1                                      VLKCS511
131600                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          VLKCS511
131700             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
131800             ADD +1                TO PV-FIRST-BLOCK-IN-RANGE     VLKCS511
131900         END-PERFORM                                              VLKCS511
132000                                                                  VLKCS511
132100         COMPUTE PV-NEXT-BLOCK-IN-ARRAY =                         VLKCS511
132200             PV-FIRST-BLOCK-IN-ARRAY + PC-MAX-BLOCKS-IN-ARRAY     VLKCS511
132300         PERFORM                                                  VLKCS511
132400             UNTIL PV-NEXT-BLOCK-IN-ARRAY >                       VLKCS511
132500                   PV-LAST-BLOCK-IN-RANGE                         VLKCS511
132600             MOVE PV-NEXT-BLOCK-IN-ARRAY                          VLKCS511
132700                                   TO PV-BLOCK-NUMBER             VLKCS511
132800             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
132900             PERFORM 3510-MARK-SELECTED-INDS                      VLKCS511
133000                 VARYING ASC-ITEM-SUB                             VLKCS511
133100                 FROM 1 BY 1                                      VLKCS511
133200                 UNTIL ASC-ITEM-SUB > PC-ITEMS-PER-PANEL          VLKCS511
133300             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
133400             ADD +1                TO PV-NEXT-BLOCK-IN-ARRAY      VLKCS511
133500         END-PERFORM                                              VLKCS511
133600                                                                  VLKCS511
133700         MOVE PV-FIRST-BLOCK-IN-ARRAY                             VLKCS511
133800                                   TO PV-BLOCK-NUMBER             VLKCS511
133900         PERFORM 4410-READ-TEMP-STORAGE                           VLKCS511
134000     END-IF.                                                      VLKCS511
134100                                                                  VLKCS511
134200     MOVE +0                       TO ASC-START-OF-SELECTED-RANGE VLKCS511
134300                                      ASC-END-OF-SELECTED-RANGE.  VLKCS511
134400                                                                  VLKCS511
134500*----------------------------------------------------------------*VLKCS511
134600* SET THE SELECTION INDICATOR TO 'S' WITHIN THE RANGE.           *VLKCS511
134700*----------------------------------------------------------------*VLKCS511
134800 3510-MARK-SELECTED-INDS.                                         VLKCS511
134900                                                                  VLKCS511
135000     IF (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                         VLKCS511
135100                                ASC-ITEM-SUB) >                   VLKCS511
135200         ASC-START-OF-SELECTED-RANGE)                             VLKCS511
135300     OR (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                         VLKCS511
135400                                ASC-ITEM-SUB) =                   VLKCS511
135500         ASC-START-OF-SELECTED-RANGE)                             VLKCS511
135600                                                                  VLKCS511
135700         IF (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                     VLKCS511
135800                                    ASC-ITEM-SUB) <               VLKCS511
135900             ASC-END-OF-SELECTED-RANGE)                           VLKCS511
136000         OR (ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB                     VLKCS511
136100                                    ASC-ITEM-SUB) =               VLKCS511
136200             ASC-END-OF-SELECTED-RANGE)                           VLKCS511
136300                                                                  VLKCS511
136400             IF NOT ASC-SELECT(ASC-BLK-SUB ASC-ITEM-SUB)          VLKCS511
136500                 SET ASC-SELECT     (ASC-BLK-SUB  ASC-ITEM-SUB)   VLKCS511
136600                     ASC-TEMP-SELECT(ASC-BLK-SUB  ASC-ITEM-SUB)   VLKCS511
136700                               TO TRUE                            VLKCS511
136800                 SET ASC-BLOCK-MODIFIED(ASC-BLK-SUB)              VLKCS511
136900                               TO TRUE                            VLKCS511
137000                 ADD +1        TO ASC-NUMBER-OF-SELECTED-ITEMS    VLKCS511
137100             END-IF                                               VLKCS511
137200         END-IF                                                   VLKCS511
137300     END-IF.                                                      VLKCS511
137400                                                                  VLKCS511
137500*----------------------------------------------------------------*VLKCS511
137600*    INITIALIZE BOTH BLOCKS IN THE ARRAY.                        *VLKCS511
137700*    INITIALIZE ALL COUNTERS AND FLAGS.                          *VLKCS511
137800*    READ THE DATA BASE FOR THE 1ST TIME AND FILL UP THE ARRAY.  *VLKCS511
137900*    DISPLAY THE PANEL TO USER.                                  *VLKCS511
138000*----------------------------------------------------------------*VLKCS511
138100 4000-BUILD-INITIAL-PANEL.                                        VLKCS511
138200                                                                  VLKCS511
138300     INITIALIZE                  ASC-BLOCK-ENTRIES (1)            VLKCS511
138400                                 ASC-BLOCK-ENTRIES (2).           VLKCS511
138500     MOVE +1                 TO ASC-BLK-SUB.                      VLKCS511
138600     SET ASC-ITEMS-LEFT-ON-DB                                     VLKCS511
138700                             TO TRUE.                             VLKCS511
138800                                                                  VLKCS511
138900     MOVE +0                 TO ASC-ITEM-SUB                      VLKCS511
139000                                ASC-NUMBER-OF-ITEMS-READ          VLKCS511
139100*                               ASC-NUMBER-OF-SELECTED-ITEMS      VLKCS511
139200                                ASC-HIGHEST-BLOCK-WRITTEN         VLKCS511
139300                                ASC-START-OF-SELECTED-RANGE       VLKCS511
139400                                ASC-END-OF-SELECTED-RANGE         VLKCS511
139500                                ASC-ITEM-AT-TOP-OF-PANEL.         VLKCS511
139600                                                                  VLKCS511
139700*    PERFORM 4050-PREPARE-CURSOR-KEY                              VLKCS511
139800                                                                  VLKCS511
139900     PERFORM 4010-OPEN-CURSOR.                                    VLKCS511
140000                                                                  VLKCS511
140100     PERFORM 4200-READ-ITEMS-FROM-DB.                             VLKCS511
140200                                                                  VLKCS511
140300     PERFORM 4020-CLOSE-CURSOR.                                   VLKCS511
140400                                                                  VLKCS511
140500     MOVE +1                   TO  PV-TOP-ITEM.                   VLKCS511
140600*    IF  ASC-NUMBER-OF-ITEMS-READ = ZERO                          VLKCS511
140700*        SET DP020-NEXT-ACT-APPL-ERROR TO TRUE                    VLKCS511
140800*        SET DP020-MSG-FATAL   TO  TRUE                           VLKCS511
140900*        MOVE PC-TSYMSG-00050  TO  DP020-MSG-NUMBER               VLKCS511
141000*    ELSE                                                         VLKCS511
141100         MOVE -1               TO MR-SELECTL (1).                 VLKCS511
141200         SET DP030-SET-CURSOR-APPL-1                              VLKCS511
141300                               TO TRUE.                           VLKCS511
141400         PERFORM 4400-MOVE-COMMAREA-TO-SCREEN.                    VLKCS511
141500*    END-IF.                                                      VLKCS511
141600                                                                  VLKCS511
141700*----------------------------------------------------------------*VLKCS511
141800* PREPARE THE DB KEY BY REPLACING * WITH %                       *VLKCS511
141900*----------------------------------------------------------------*VLKCS511
142000*4050-PREPARE-CURSOR-KEY.                                         VLKCS511
142100*                                                                 VLKCS511
142200*    MOVE ASC-KEY-VEND-NAME    TO DK-VEND-NAME.                   VLKCS511
142300*    MOVE ASC-KEY-STATUS-CODE  TO DK-STATUS-CODE.                 VLKCS511
142400*    IF DK-VEND-NAME > SPACES                                     VLKCS511
142500*        IF DK-VEND-NAME-BYTE (1) = '*'                           VLKCS511
142600*            MOVE PC-PERCENT   TO DK-VEND-NAME-BYTE (1)           VLKCS511
142700*            INSPECT DK-VEND-NAME                                 VLKCS511
142800*                REPLACING FIRST '*' BY PC-PERCENT                VLKCS511
142900*        END-IF                                                   VLKCS511
143000*        SET PS-NOT-DONE TO TRUE                                  VLKCS511
143100*        PERFORM VARYING PV-SUB                                   VLKCS511
143200*            FROM LENGTH OF DK-VEND-NAME BY -1                    VLKCS511
143300*            UNTIL PV-SUB = 1                                     VLKCS511
143400*               OR PS-DONE                                        VLKCS511
143500*                IF DK-VEND-NAME-BYTE (PV-SUB) = '*'              VLKCS511
143600*                    MOVE PC-PERCENT TO DK-VEND-NAME-BYTE (PV-SUB)VLKCS511
143700*                    SET PS-DONE TO TRUE                          VLKCS511
143800*                END-IF                                           VLKCS511
143900**               IF DK-VEND-NAME-BYTE (PV-SUB) > SPACES           VLKCS511
144000*                    SET PS-DONE TO TRUE                          VLKCS511
144100*                ELSE                                             VLKCS511
144200*                    MOVE PC-PERCENT TO DK-VEND-NAME-BYTE (PV-SUB)VLKCS511
144300*                END-IF                                           VLKCS511
144400*        END-PERFORM                                              VLKCS511
144500*    ELSE                                                         VLKCS511
144600*        MOVE ALL '%' TO DK-VEND-NAME.                            VLKCS511
144700                                                                  VLKCS511
144800*----------------------------------------------------------------*VLKCS511
144900* OPEN  THE VENDOR   CURSOR.                                     *VLKCS511
145000*----------------------------------------------------------------*VLKCS511
145100 4010-OPEN-CURSOR.                                                VLKCS511
145200                                                                  VLKCS511
145300     PERFORM                                                      VLKCS511
145400         WITH TEST AFTER                                          VLKCS511
145500         VARYING PV-RETRY-COUNTER                                 VLKCS511
145600         FROM 1 BY 1                                              VLKCS511
145700         UNTIL ((PV-RETRY-COUNTER > PC-MAX-RETRIES)               VLKCS511
145800                   OR (SQLCODE = ZERO))                           VLKCS511
145900             MOVE 'CURSOR:  RSNDSC_CSR'                                 88
146000                               TO DP013-MESSAGE-TEXT (2)          VLKCS511
146100             EXEC SQL                                             VLKCS511
146200                  OPEN RSNDSC_CSR                                       88
146300             END-EXEC                                             VLKCS511
146400                                                                  VLKCS511
146500         EVALUATE TRUE                                            VLKCS511
146600             WHEN SQLCODE = ZERO                                  VLKCS511
146700             WHEN SQLCODE = -904                                  VLKCS511
146800             WHEN SQLCODE = -913                                  VLKCS511
146900                 CONTINUE                                         VLKCS511
147000             WHEN SQLWARN0 NOT = SPACES                           VLKCS511
147100             WHEN SQLCODE < ZERO                                  VLKCS511
147200             WHEN SQLCODE > ZERO                                  VLKCS511
147300                 MOVE '4010-OPEN-CURSOR'                          VLKCS511
147400                                   TO DP013-PARAGRAPH             VLKCS511
147500                 MOVE 'OPEN VENDOR CURSOR - '                     VLKCS511
147600                                   TO DP013-MESSAGE-TEXT (1)      VLKCS511
147700                 MOVE SQLCA        TO DP013-SQLCA                 VLKCS511
147800                 MOVE 'TSYMSG  '   TO DP013-DB2-TABLE-NAME (1)    VLKCS511
147900                 SET DP013-DB2-ABEND                              VLKCS511
148000                     DP013-XCTL-DISPLAY-RESTART TO TRUE           VLKCS511
148100                 PERFORM DP013-0000-PROCESS-ABEND                 VLKCS511
148200         END-EVALUATE                                             VLKCS511
148300     END-PERFORM.                                                 VLKCS511
148400                                                                  VLKCS511
148500     IF  PV-RETRY-COUNTER > PC-MAX-RETRIES                        VLKCS511
148600         MOVE '4010-OPEN-CURSOR'   TO DP013-PARAGRAPH             VLKCS511
148700         MOVE 'MAXIMUM RETRIES EXCEEDED ATTEMPTING TO OPEN CSR'   VLKCS511
148800                                   TO DP013-MESSAGE-TEXT (1)      VLKCS511
148900         MOVE SQLCA                TO DP013-SQLCA                 VLKCS511
149000         MOVE 'TSYMSG  '           TO DP013-DB2-TABLE-NAME (1)    VLKCS511
149100         SET DP013-DB2-ABEND                                      VLKCS511
149200             DP013-XCTL-DISPLAY-RESTART                           VLKCS511
149300                                   TO TRUE                        VLKCS511
149400         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
149500     END-IF.                                                      VLKCS511
149600                                                                  VLKCS511
149700*----------------------------------------------------------------*VLKCS511
149800*    READ THE ITEMS FROM THE DATA BASE AND MOVE THEM INTO THE    *VLKCS511
149900*    BLOCKS IN THE ARRAY.  WHENEVER BOTH BLOCKS BECOME FULL,     *VLKCS511
150000*    WRITE OUT THE 1ST BLOCK TO TEMPORARY STORAGE, MOVE THE 2ND  *VLKCS511
150100*    BLOCK IN THE ARRAY TO THE 1ST BLOCK, AND INITIALIZE THE     *VLKCS511
150200*    2ND BLOCK MAKING IT AVAILABLE TO BE USED.                   *VLKCS511
150300*----------------------------------------------------------------*VLKCS511
150400 4200-READ-ITEMS-FROM-DB.                                         VLKCS511
150500                                                                  VLKCS511
150600     PERFORM VARYING PV-READ-COUNT  FROM 1 BY 1                      CL**3
150700             UNTIL   PV-READ-COUNT > PC-MAX-ITEMS OR                 CL**3
150800                     ASC-NO-ITEMS-LEFT-ON-DB                         CL**3
150900                                                                  VLKCS511
151000             PERFORM 4210-FETCH-CURSOR                               CL**3
151100                                                                  VLKCS511
151200             IF ASC-ITEMS-LEFT-ON-DB                                 CL**3
151300                IF ASC-ITEM-SUB < PC-ITEMS-PER-PANEL                 CL**3
151400                    CONTINUE                                         CL*10
151500                ELSE                                                 CL**3
151600                    ADD  +1 TO ASC-BLK-SUB                           CL**3
151700                    MOVE +0 TO ASC-ITEM-SUB                          CL**9
151800                    IF ASC-BLK-SUB > PC-MAX-BLOCKS-IN-ARRAY          CL**3
151900                        MOVE +1 TO ASC-BLK-SUB                       CL**3
152000                        SET ASC-BLOCK-MODIFIED (1) TO TRUE           CL**3
152100                                                                     CL**3
152200                        PERFORM 5100-WRITE-TEMP-STORAGE              CL**3
152300                                                                     CL**3
152400                        MOVE ASC-BLOCK-ENTRIES                       CL**3
152500                                          (PC-MAX-BLOCKS-IN-ARRAY)   CL**3
152600                                TO ASC-BLOCK-ENTRIES (ASC-BLK-SUB)   CL**3
152700                        ADD +1 TO ASC-BLK-SUB                        CL**3
152800                        INITIALIZE ASC-BLOCK-ENTRIES (ASC-BLK-SUB)   CL**3
152900                        SET ASC-BLOCK-NOT-MODIFIED   (ASC-BLK-SUB)   CL**3
153000                                                           TO TRUE   CL**3
153100                    END-IF                                           CL**3
153200                END-IF                                               CL**3
153300                PERFORM 4220-MOVE-DB-ITEMS THRU 4220-EXIT               10
153400             END-IF                                                  CL**3
153500     END-PERFORM.                                                 VLKCS511
153600                                                                  VLKCS511
153700     IF ASC-NUMBER-OF-ITEMS-READ > ZERO                              CL**3
153800         MOVE +1 TO ASC-BLK-SUB                                      CL**3
153900                                                                     CL**3
154000         PERFORM 5100-WRITE-TEMP-STORAGE                          VLKCS511
154100                                                                     CL**3
154200         ADD  +1 TO ASC-BLK-SUB                                      CL**3
154300                                                                     CL**8
154400         PERFORM 5100-WRITE-TEMP-STORAGE                          VLKCS511
154500                                                                  VLKCS511
154600         MOVE 1  TO ASC-BLK-SUB                                      CL**3
154700                    PV-BLOCK-NUMBER                                  CL**3
154800                                                                     CL**3
154900         PERFORM 4410-READ-TEMP-STORAGE                           VLKCS511
155000                                                                     CL**3
155100         IF ASC-HIGHEST-BLOCK-WRITTEN > 1                            CL**3
155200             MOVE 2 TO ASC-BLK-SUB                                   CL**3
155300                       PV-BLOCK-NUMBER                               CL**3
155400                                                                     CL**3
155500             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
155600         END-IF                                                   VLKCS511
155700     END-IF.                                                      VLKCS511
155800                                                                  VLKCS511
155900 4210-FETCH-CURSOR.                                               VLKCS511
156000                                                                  VLKCS511
156100     EXEC SQL                                                     VLKCS511
156210          FETCH RSNDSC_CSR                                              88
156300          INTO  :PTRDSC-REQ-RSN-CDE                                     *3
156400               ,:PTRDSC-REQ-RSN-DESC                                    *3
156900     END-EXEC                                                     VLKCS511
157000                                                                  VLKCS511
157100     EVALUATE TRUE                                                VLKCS511
157200         WHEN SQLCODE = ZERO                                      VLKCS511
157300         WHEN SQLCODE = +100                                      VLKCS511
157400              CONTINUE                                            VLKCS511
157500         WHEN SQLWARN0 NOT = SPACE                                VLKCS511
157600         WHEN SQLCODE NOT = ZERO                                  VLKCS511
157700              MOVE '4210-FETCH-CURSOR'                            VLKCS511
157800                               TO DP013-PARAGRAPH                 VLKCS511
157900              MOVE 'FETCH VENDOR CURSOR'                          VLKCS511
158000                               TO DP013-MESSAGE-TEXT (1)          VLKCS511
158100              MOVE SQLCA       TO DP013-SQLCA                     VLKCS511
158200              SET DP013-DB2-ABEND                                 VLKCS511
158300                               TO TRUE                            VLKCS511
158400              PERFORM DP013-0000-PROCESS-ABEND                    VLKCS511
158500     END-EVALUATE.                                                VLKCS511
158600                                                                  VLKCS511
158700     IF  SQLCODE EQUAL +100                                       VLKCS511
158800         SET ASC-NO-ITEMS-LEFT-ON-DB                              VLKCS511
158900                                   TO TRUE                        VLKCS511
159000     END-IF.                                                      VLKCS511
159100                                                                  VLKCS511
159200 4220-MOVE-DB-ITEMS.                                                    10
162100                                                                     CL**3
162200     ADD +1 TO ASC-ITEM-SUB                                          CL**7
162300               ASC-NUMBER-OF-ITEMS-READ.                             CL**7
162400     MOVE ASC-NUMBER-OF-ITEMS-READ TO ASC-LIST-ITEM-NUMBER           CL**3
162500                                       (ASC-BLK-SUB ASC-ITEM-SUB).   CL**3
163020     MOVE PTRDSC-REQ-RSN-CDE   TO ASC-REQ-RSN-CDE                       *2
163100                                       (ASC-BLK-SUB ASC-ITEM-SUB).   CL**3
163200     MOVE PTRDSC-REQ-RSN-DESC  TO ASC-REQ-RSN-DESC                      *2
163300                                       (ASC-BLK-SUB ASC-ITEM-SUB).   CL**3
163800 4220-EXIT.                                                          CL**3
163900     EXIT.                                                           CL**3
167400                                                                  VLKCS511
167500*----------------------------------------------------------------*VLKCS511
167600* CLOSE THE VENDOR   CURSOR.                                     *VLKCS511
167700*----------------------------------------------------------------*VLKCS511
167800 4020-CLOSE-CURSOR.                                               VLKCS511
167900                                                                  VLKCS511
168000     EXEC SQL                                                     VLKCS511
168100         CLOSE RSNDSC_CSR                                               88
168200     END-EXEC                                                     VLKCS511
168300                                                                  VLKCS511
168400     EVALUATE TRUE                                                VLKCS511
168500         WHEN SQLCODE = ZERO                                      VLKCS511
168600             CONTINUE                                             VLKCS511
168700         WHEN SQLWARN0 NOT = SPACES                               VLKCS511
168800         WHEN SQLCODE < ZERO                                      VLKCS511
168900         WHEN SQLCODE > ZERO                                      VLKCS511
169000             MOVE '4020-CLOSE-CURSOR'                             VLKCS511
169100                               TO DP013-PARAGRAPH                 VLKCS511
169200             MOVE 'CLOSE VENDOR CURSOR '                          VLKCS511
169300                               TO DP013-MESSAGE-TEXT (1)          VLKCS511
169400             MOVE SQLCA        TO DP013-SQLCA                     VLKCS511
169500             MOVE 'TSYMSG  '   TO DP013-DB2-TABLE-NAME (1)        VLKCS511
169600             SET DP013-DB2-ABEND                                  VLKCS511
169700                 DP013-XCTL-DISPLAY-RESTART TO TRUE               VLKCS511
169800             PERFORM DP013-0000-PROCESS-ABEND                     VLKCS511
169900     END-EVALUATE.                                                VLKCS511
170000                                                                  VLKCS511
170100*----------------------------------------------------------------*VLKCS511
170200* MOVE THE DISPLAYED FIELDS FROM THE COMMAREA TO THE SCREEN.     *VLKCS511
170300*----------------------------------------------------------------*VLKCS511
170400 4400-MOVE-COMMAREA-TO-SCREEN.                                    VLKCS511
170500                                                                  VLKCS511
170600     IF  (((PV-TOP-ITEM > ASC-LIST-ITEM-NUMBER (1 1))             VLKCS511
170700         AND (PV-TOP-ITEM > ASC-LIST-ITEM-NUMBER (2 1)))          VLKCS511
170800         OR  (PV-TOP-ITEM < ASC-LIST-ITEM-NUMBER (1 1)))          VLKCS511
170900             MOVE +1    TO ASC-BLK-SUB                            VLKCS511
171000             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
171100             ADD +1     TO ASC-BLK-SUB                            VLKCS511
171200             PERFORM 5100-WRITE-TEMP-STORAGE                      VLKCS511
171300             DIVIDE PV-TOP-ITEM BY PC-ITEMS-PER-PANEL             VLKCS511
171400                 GIVING PV-BLOCK-NUMBER                           VLKCS511
171500                 REMAINDER PV-REMAINDER                           VLKCS511
171600             IF  PV-REMAINDER > ZERO                              VLKCS511
171700                 ADD +1 TO PV-BLOCK-NUMBER                        VLKCS511
171800             END-IF                                               VLKCS511
171900             MOVE +1    TO ASC-BLK-SUB                            VLKCS511
172000             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
172100             ADD +1     TO ASC-BLK-SUB                            VLKCS511
172200                           PV-BLOCK-NUMBER                        VLKCS511
172300             PERFORM 4410-READ-TEMP-STORAGE                       VLKCS511
172400     END-IF.                                                      VLKCS511
172500     MOVE +1            TO ASC-BLK-SUB.                           VLKCS511
172600     COMPUTE ASC-ITEM-SUB =                                       VLKCS511
172700         ((PV-TOP-ITEM - ASC-LIST-ITEM-NUMBER (1 1))              VLKCS511
172800         + PC-ITEMS-PER-PANEL).                                   VLKCS511
172900                                                                  VLKCS511
173000     IF  ASC-ITEM-SUB > PC-ITEMS-PER-PANEL                        VLKCS511
173100         ADD +1         TO ASC-BLK-SUB                            VLKCS511
173200         SUBTRACT PC-ITEMS-PER-PANEL FROM ASC-ITEM-SUB            VLKCS511
173300     END-IF.                                                      VLKCS511
173400                                                                  VLKCS511
173500     COMPUTE ASC-ITEM-AT-BOT-OF-PANEL =                           VLKCS511
173600         ((PV-TOP-ITEM + PC-ITEMS-PER-PANEL) - 1).                VLKCS511
173700     PERFORM 4430-CHECK-FOR-BEGIN-AND-END.                        VLKCS511
173800     PERFORM 4420-FORMAT-LIST-LINES                               VLKCS511
173900         VARYING PV-SUB                                           VLKCS511
174000         FROM PC-ITEMS-PER-PANEL BY -1                            VLKCS511
174100         UNTIL PV-SUB < +1.                                       VLKCS511
174200                                                                  VLKCS511
174300     COMPUTE ASC-ITEMS-DISPLAYED =                                VLKCS511
174400         ((ASC-ITEM-AT-BOT-OF-PANEL - PV-TOP-ITEM) + 1).          VLKCS511
174500     MOVE PV-TOP-ITEM              TO ASC-ITEM-AT-TOP-OF-PANEL    VLKCS511
174600                                      ASTRTITO.                   VLKCS511
174700     MOVE ASC-ITEM-AT-BOT-OF-PANEL TO AENDITO.                    VLKCS511
174800     MOVE ASC-NUMBER-OF-ITEMS-READ TO ATOTITO.                    VLKCS511
174900     MOVE ASC-NUMBER-OF-SELECTED-ITEMS                            VLKCS511
175000                                   TO ASELITO.                    VLKCS511
175100                                                                  VLKCS511
175200     IF  DP020-MSG-NUMBER-X = SPACE                               VLKCS511
175300         IF  ASC-ITEM-AT-BOT-OF-PANEL < ASC-NUMBER-OF-ITEMS-READ  VLKCS511
175400*            --- MORE ITEMS TO DISPLAY ----                       VLKCS511
175500             MOVE PC-TSYMSG-00279  TO DP020-MSG-NUMBER            VLKCS511
175600             SET DP020-MSG-INFORMATIONAL TO TRUE                  VLKCS511
175700         END-IF                                                   VLKCS511
175800     END-IF.                                                      VLKCS511
175900                                                                  VLKCS511
176000*----------------------------------------------------------------*VLKCS511
176100*    READ A BLOCK FROM TEMPORARY STORAGE INTO THE ARRAY.         *VLKCS511
176200*----------------------------------------------------------------*VLKCS511
176300 4410-READ-TEMP-STORAGE.                                          VLKCS511
176400                                                                  VLKCS511
176500     EXEC CICS                                                    VLKCS511
176600         READQ TS                                                 VLKCS511
176700             QUEUE (ASC-LIST-QUEUE-NAME)                          VLKCS511
176800             INTO  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               VLKCS511
176900             ITEM  (PV-BLOCK-NUMBER)                              VLKCS511
177000             RESP  (PV-CICS-RESP)                                 VLKCS511
177100     END-EXEC.                                                    VLKCS511
177200                                                                  VLKCS511
177300     IF  ((PV-CICS-RESP = DFHRESP (NORMAL))                       VLKCS511
177400       OR (PV-CICS-RESP = DFHRESP (ITEMERR)))                     VLKCS511
177500         CONTINUE                                                 VLKCS511
177600     ELSE                                                         VLKCS511
177700         SET DP013-CICS-ABEND     TO TRUE                         VLKCS511
177800         SET DP013-NO-ROLLBACK    TO TRUE                         VLKCS511
177900         MOVE '4410-READ-TEMP-STORAGE'                            VLKCS511
178000                                  TO DP013-PARAGRAPH              VLKCS511
178100         MOVE 'ERROR TRYING TO READ FROM TEMP STORAGE QUEUE'      VLKCS511
178200                                  TO DP013-MESSAGE-TEXT(1)        VLKCS511
178300         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
178400     END-IF.                                                      VLKCS511
178500                                                                  VLKCS511
178600     SET ASC-BLOCK-NOT-MODIFIED(ASC-BLK-SUB) TO TRUE.             VLKCS511
178700                                                                  VLKCS511
178800     IF  PV-CICS-RESP = DFHRESP (ITEMERR)                         VLKCS511
178900         INITIALIZE ASC-BLOCK-ENTRIES (ASC-BLK-SUB)               VLKCS511
179000     END-IF.                                                      VLKCS511
179100                                                                  VLKCS511
179200*----------------------------------------------------------------*VLKCS511
179300*    PROCESS THE ITEMS IN THE ARRAY AND MOVE THEM TO THE MAP.    *VLKCS511
179400*----------------------------------------------------------------*VLKCS511
179500 4420-FORMAT-LIST-LINES.                                          VLKCS511
179600                                                                  VLKCS511
179700     IF ASC-ITEM-AT-BOT-OF-PANEL > ASC-NUMBER-OF-ITEMS-READ          CL**6
179800         SUBTRACT +1 FROM ASC-ITEM-AT-BOT-OF-PANEL                VLKCS511
179900         MOVE DP015-ASK-DRK-OFF  TO MR-SELECTA   (PV-SUB)            CL**6
180000         MOVE SPACES             TO MR-SELECTI   (PV-SUB)            CL**6
180200                                    MR-ACTION    (PV-SUB)            CL**6
180300                                    MR-DESC      (PV-SUB)         VLKCS511
180600     ELSE                                                         VLKCS511
180700         IF ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)          CL**6
180800                                                           > SPACE   CL**6
180900             MOVE ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB) VLKCS511
181000                                           TO MR-SELECTI (PV-SUB)    CL**6
181100         ELSE                                                     VLKCS511
181200             MOVE ASC-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)      VLKCS511
181300                                           TO MR-SELECTI (PV-SUB)    CL**6
181400         END-IF                                                   VLKCS511
181500                                                                  VLKCS511
181600         IF DP030-SET-CURSOR-TRAILER                                 CL**6
181700             IF ASC-TEMP-SELECTED-SW (ASC-BLK-SUB ASC-ITEM-SUB)      CL**6
181800                                                           > SPACE   CL**6
181900                OR PV-SUB = 1                                        CL**6
182000                 SET DP030-SET-CURSOR-APPL-1 TO TRUE                 CL**6
182100                 MOVE -1 TO MR-SELECTL (PV-SUB)                      CL**6
182200             END-IF                                               VLKCS511
182300         END-IF                                                   VLKCS511
182400                                                                  VLKCS511
182500         IF PV-TOP-ITEM NOT = ASC-ITEM-AT-TOP-OF-PANEL               CL**6
182800             IF ASC-REQ-RSN-CDE   (ASC-BLK-SUB ASC-ITEM-SUB) =          *5
182803                 VL005-PTRDSC-REQ-RSN-CDE                                 
182804                     MOVE 'ADD' TO MR-ACTION (PV-SUB)                     
182805             ELSE                                                         
182806                 MOVE ASC-ACTION    (ASC-BLK-SUB ASC-ITEM-SUB)          *6
182807                                             TO MR-ACTION (PV-SUB)   CL**6
182808             END-IF                                                       
183000             MOVE ASC-REQ-RSN-DESC (ASC-BLK-SUB ASC-ITEM-SUB)           *5
183100                                          TO MR-DESC (PV-SUB)           *6
184400                                                                        84
184500     END-IF.                                                      VLKCS511
184600                                                                     CL**6
184700     SUBTRACT +1 FROM ASC-ITEM-SUB.                                  CL**6
184800                                                                     CL**6
184900     IF ASC-ITEM-SUB < + 1                                           CL**6
185000         MOVE PC-ITEMS-PER-PANEL TO ASC-ITEM-SUB                  VLKCS511
185100         MOVE +1                 TO ASC-BLK-SUB                   VLKCS511
185200     END-IF.                                                      VLKCS511
185300                                                                  VLKCS511
185400******************************************************************VLKCS511
185500** IF A BEGINNING OF RANGE WAS SPECIFIED, MAKE SURE AN END OF   **VLKCS511
185600** RANGE WAS SPECIFIED AND VICE-VERSA.  IF ONE IS MISSING,      **VLKCS511
185700** ISSUE A WARNING.                                             **VLKCS511
185800******************************************************************VLKCS511
185900 4430-CHECK-FOR-BEGIN-AND-END.                                    VLKCS511
186000                                                                  VLKCS511
186100     IF  ASC-START-OF-SELECTED-RANGE > ZERO                       VLKCS511
186200         IF  ASC-END-OF-SELECTED-RANGE = ZERO                     VLKCS511
186300*            -- NO END-OF-RANGE SPECFIED ---                      VLKCS511
186400             MOVE PC-TSYMSG-00051  TO DP020-MSG-NUMBER            VLKCS511
186500             SET DP020-MSG-WARNING TO TRUE                        VLKCS511
186600             PERFORM 4431-POSITION-AT-WARNING                     VLKCS511
186700         END-IF                                                   VLKCS511
186800     ELSE                                                         VLKCS511
186900         IF  ASC-END-OF-SELECTED-RANGE > ZERO                     VLKCS511
187000*            -- NO BEGINNING-OF-RANGE SPECFIED ---                VLKCS511
187100             MOVE PC-TSYMSG-00053  TO DP020-MSG-NUMBER            VLKCS511
187200             SET DP020-MSG-WARNING TO TRUE                        VLKCS511
187300             PERFORM 4431-POSITION-AT-WARNING                     VLKCS511
187400         END-IF                                                   VLKCS511
187500     END-IF.                                                      VLKCS511
187600                                                                  VLKCS511
187700******************************************************************VLKCS511
187800** ONCE IT HAS BEEN DETERMINED THAT A WARNING IS TO BE ISSUED,  **VLKCS511
187900** DETERMINE IF EITHER THE BEGINNING OF RANGE OR END OF RANGE   **VLKCS511
188000** IS ON THE CURRENT SCREEN.  IF IT IS, HIGHLIGHT IT AND        **VLKCS511
188100** POSITION THE CURSOR THERE.                                   **VLKCS511
188200******************************************************************VLKCS511
188300 4431-POSITION-AT-WARNING.                                        VLKCS511
188400                                                                  VLKCS511
188500     COMPUTE PV-SUB = ASC-START-OF-SELECTED-RANGE                 VLKCS511
188600                    - PV-TOP-ITEM + 1.                            VLKCS511
188700     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      VLKCS511
188800         CONTINUE                                                 VLKCS511
188900     ELSE                                                         VLKCS511
189000         SET DP030-SET-CURSOR-APPL-1                              VLKCS511
189100                                   TO TRUE                        VLKCS511
189200         MOVE -1                   TO MR-SELECTL (PV-SUB)         VLKCS511
189300         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         VLKCS511
189400         MOVE DP015-YELLOW         TO MR-SELECTC (PV-SUB)         VLKCS511
189500     END-IF.                                                      VLKCS511
189600                                                                  VLKCS511
189700     COMPUTE PV-SUB = ASC-END-OF-SELECTED-RANGE                   VLKCS511
189800                    - PV-TOP-ITEM + 1.                            VLKCS511
189900     IF  PV-SUB < +1 OR > PC-ITEMS-PER-PANEL                      VLKCS511
190000         CONTINUE                                                 VLKCS511
190100     ELSE                                                         VLKCS511
190200         SET DP030-SET-CURSOR-APPL-1                              VLKCS511
190300                                   TO TRUE                        VLKCS511
190400         MOVE -1                   TO MR-SELECTL (PV-SUB)         VLKCS511
190500         MOVE DP015-REVERSE        TO MR-SELECTH (PV-SUB)         VLKCS511
190600         MOVE DP015-YELLOW         TO MR-SELECTC (PV-SUB)         VLKCS511
190700     END-IF.                                                      VLKCS511
190800                                                                  VLKCS511
190900*----------------------------------------------------------------*VLKCS511
191000* PREPARE THE SELECTED ITEMS TEMP STORAGE QUEUE.  MOVE ALL SEL-  *VLKCS511
191100* ECTED ITEMS FROM THE LIST TEMP STORAGE QUEUE TO THE LAYOUT     *VLKCS511
191200* FOR THE SELECTED ITEMS QUEUE.                                  *VLKCS511
191300*                                                                *VLKCS511
191400* FIRST, DELETE THE SELECTION QUEUE, NEXT LOAD THE SELECTION     *VLKCS511
191500* QUEUE RECORD.  FINALLY, WRITE THE SELECTION QUEUE ITEM WHEN    *VLKCS511
191600* THE ARRAY IS FULL.                                             *VLKCS511
191700*----------------------------------------------------------------*VLKCS511
191800 5000-PREPARE-SEL-QUEUE.                                          VLKCS511
191900                                                                  VLKCS511
192000     MOVE +1                   TO  ASC-BLK-SUB.                   VLKCS511
192100     PERFORM 5100-WRITE-TEMP-STORAGE.                             VLKCS511
192200     ADD +1                    TO  ASC-BLK-SUB.                   VLKCS511
192300     PERFORM 5100-WRITE-TEMP-STORAGE.                             VLKCS511
192400                                                                  VLKCS511
192500     MOVE ASC-SEL-QUEUE-NAME   TO  VL005-SEL-QUEUE-NAME.          VLKCS511
192600     PERFORM 6010-DELETE-SEL-QUEUE.                               VLKCS511
192700                                                                  VLKCS511
192800     SET ASC-UPDATE-TSQ        TO  TRUE.                          VLKCS511
192900                                                                  VLKCS511
193000     SET VL006-IDX             TO  1.                             VLKCS511
193100     MOVE ZERO                 TO VL005-NUMBER-OF-TS-ITEMS.       VLKCS511
193200     INITIALIZE VL006-SELECTED-ITEM-ARRAY.                        VLKCS511
193300                                                                  VLKCS511
193400     PERFORM 5200-FILL-SEL-QUEUE-RECORD                           VLKCS511
193500             VARYING PV-ITEM                                      VLKCS511
193600             FROM 1 BY 1                                          VLKCS511
193700             UNTIL PV-ITEM GREATER ASC-HIGHEST-BLOCK-WRITTEN.     VLKCS511
193800                                                                  VLKCS511
193900     IF  VL006-IDX > 1                                            VLKCS511
194000         PERFORM 5205-WRITE-SEL-QUEUE                             VLKCS511
194100         ADD +1                TO VL005-NUMBER-OF-TS-ITEMS        VLKCS511
194200     END-IF.                                                      VLKCS511
194300                                                                  VLKCS511
194400*----------------------------------------------------------------*VLKCS511
194500*    WRITE A NEW BLOCK FROM THE ARRAY TO TEMPORARY STORAGE.      *VLKCS511
194600*    REWRITE AN EXISITING BLOCK ONLY IF IT HAS BEEN MODIFIED.    *VLKCS511
194700*----------------------------------------------------------------*VLKCS511
194800 5100-WRITE-TEMP-STORAGE.                                         VLKCS511
194900                                                                  VLKCS511
195000     MOVE ASC-LIST-ITEM-NUMBER(ASC-BLK-SUB 1)                     VLKCS511
195100                                   TO PV-LIST-ITEM-NUMBER.        VLKCS511
195200     COMPUTE PV-BLOCK-NUMBER =                                    VLKCS511
195300         1 + ((PV-LIST-ITEM-NUMBER - 1) / PC-ITEMS-PER-PANEL).    VLKCS511
195400                                                                  VLKCS511
195500     IF (PV-BLOCK-NUMBER < ASC-HIGHEST-BLOCK-WRITTEN)             VLKCS511
195600     OR (PV-BLOCK-NUMBER = ASC-HIGHEST-BLOCK-WRITTEN)             VLKCS511
195700         IF  ASC-BLOCK-MODIFIED(ASC-BLK-SUB)                      VLKCS511
195800             PERFORM 5105-REWRITE-ASC-LISTQ                       VLKCS511
195900         END-IF                                                   VLKCS511
196000     ELSE                                                         VLKCS511
196100         COMPUTE PV-HIGHEST-BLOCK-WRITTEN =                       VLKCS511
196200         ASC-HIGHEST-BLOCK-WRITTEN + 1                            VLKCS511
196300         PERFORM 5110-WRITE-ASC-LISTQ                             VLKCS511
196400         ADD +1                    TO ASC-HIGHEST-BLOCK-WRITTEN   VLKCS511
196500     END-IF.                                                      VLKCS511
196600                                                                  VLKCS511
196700     SET ASC-BLOCK-NOT-MODIFIED(ASC-BLK-SUB) TO TRUE.             VLKCS511
196800******************************************************************VLKCS511
196900** REWRITE THE LIST TEMP STORAGE QUEUE FROM THE APPLICATION-    **VLKCS511
197000** SPECIFIC COMMAREA.                                           **VLKCS511
197100******************************************************************VLKCS511
197200 5105-REWRITE-ASC-LISTQ.                                          VLKCS511
197300                                                                  VLKCS511
197400     EXEC CICS                                                    VLKCS511
197500         WRITEQ TS                                                VLKCS511
197600             QUEUE (ASC-LIST-QUEUE-NAME)                          VLKCS511
197700             FROM  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               VLKCS511
197800             ITEM  (PV-BLOCK-NUMBER)                              VLKCS511
197900             REWRITE                                              VLKCS511
198000             RESP  (PV-CICS-RESP)                                 VLKCS511
198100     END-EXEC.                                                    VLKCS511
198200                                                                  VLKCS511
198300     IF  PV-CICS-RESP = DFHRESP(NORMAL)                           VLKCS511
198400         CONTINUE                                                 VLKCS511
198500     ELSE                                                         VLKCS511
198600         SET DP013-CICS-ABEND            TO TRUE                  VLKCS511
198700         SET DP013-NO-ROLLBACK           TO TRUE                  VLKCS511
198800         MOVE '5105-REWRITE-ASC-LISTQ'   TO DP013-PARAGRAPH       VLKCS511
198900         MOVE 'ATTEMPTING TO REWRITE LIST TEMP STORAGE QUEUE'     VLKCS511
199000                                         TO DP013-MESSAGE-TEXT(1) VLKCS511
199100         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
199200     END-IF.                                                      VLKCS511
199300                                                                  VLKCS511
199400******************************************************************VLKCS511
199500** WRITE THE LIST TEMP STORAGE QUEUE FROM THE APPLICATION-      **VLKCS511
199600** SPECIFIC COMMAREA.                                           **VLKCS511
199700******************************************************************VLKCS511
199800 5110-WRITE-ASC-LISTQ.                                            VLKCS511
199900                                                                  VLKCS511
200000     EXEC CICS                                                    VLKCS511
200100         WRITEQ TS                                                VLKCS511
200200             QUEUE (ASC-LIST-QUEUE-NAME)                          VLKCS511
200300             FROM  (ASC-BLOCK-ENTRIES(ASC-BLK-SUB))               VLKCS511
200400             ITEM  (PV-BLOCK-NUMBER)                              VLKCS511
200500             RESP  (PV-CICS-RESP)                                 VLKCS511
200600     END-EXEC.                                                    VLKCS511
200700     IF  PV-CICS-RESP NOT = DFHRESP (NORMAL)                      VLKCS511
200800         SET DP013-CICS-ABEND      TO TRUE                        VLKCS511
200900         SET DP013-NO-ROLLBACK     TO TRUE                        VLKCS511
201000         MOVE '5110-WRITE-ASC-LISTQ'                              VLKCS511
201100                                   TO DP013-PARAGRAPH             VLKCS511
201200         MOVE 'ATTEMPTING TO DELETE TEMP STORAGE QUEUE'           VLKCS511
201300                                   TO DP013-MESSAGE-TEXT(1)       VLKCS511
201400         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
201500     END-IF.                                                      VLKCS511
201600                                                                  VLKCS511
201700*----------------------------------------------------------------*VLKCS511
201800* READ A LIST QUEUE RECORD AND MOVE THE KEYS OF SELECTED OBJECTS *VLKCS511
201900* TO THE SELECTED ITEMS TEMP STORAGE QUEUE RECORD.               *VLKCS511
202000*----------------------------------------------------------------*VLKCS511
202100 5200-FILL-SEL-QUEUE-RECORD.                                      VLKCS511
202200                                                                  VLKCS511
202300     PERFORM 6112-READ-LIST-QUEUE.                                VLKCS511
202400                                                                  VLKCS511
202500     IF  PV-CICS-RESP EQUAL DFHRESP(NORMAL)                       VLKCS511
202600         PERFORM                                                  VLKCS511
202700         VARYING LQW-IDX                                          VLKCS511
202800         FROM 1 BY 1                                              VLKCS511
202900         UNTIL LQW-IDX GREATER THAN PC-ITEMS-PER-PANEL            VLKCS511
203000           OR  LQW-LIST-ITEM-NUMBER (LQW-IDX) EQUAL ZERO          VLKCS511
203100                                                                  VLKCS511
203200             IF  LQW-SELECT (LQW-IDX)                             VLKCS511
203300                 MOVE LQW-LIST-ITEM-NUMBER (LQW-IDX)              VLKCS511
203400                                   TO VL006-ITEM (VL006-IDX)      VLKCS511
203600                 MOVE LQW-REQ-RSN-CDE       (LQW-IDX)                   84
203700                           TO VL006-REQ-RSN-CDE  (VL006-IDX)            84
203701                              VL005-PTRDSC-REQ-RSN-CDE                  *8
203800                 MOVE SPACE        TO VL006-ACTION-SW (VL006-IDX) VLKCS511
203900                 SET VL006-IDX UP BY 1                            VLKCS511
204000                 IF  VL006-IDX > VL006-MAX-ITEMS                  VLKCS511
204100                     PERFORM 5205-WRITE-SEL-QUEUE                 VLKCS511
204200                     ADD +1        TO VL005-NUMBER-OF-TS-ITEMS    VLKCS511
204300                     INITIALIZE VL006-SELECTED-ITEM-ARRAY         VLKCS511
204400                     SET VL006-IDX TO  1                          VLKCS511
204500                 END-IF                                           VLKCS511
204600             END-IF                                               VLKCS511
204700         END-PERFORM                                              VLKCS511
204800     END-IF.                                                      VLKCS511
204900                                                                  VLKCS511
205000*----------------------------------------------------------------*VLKCS511
205100*    WRITE THE SELECTED ITEMS TEMP STORAGE QUEUE.                *VLKCS511
205200*----------------------------------------------------------------*VLKCS511
205300 5205-WRITE-SEL-QUEUE.                                            VLKCS511
205400                                                                  VLKCS511
205500     MOVE ASC-NUMBER-OF-SELECTED-ITEMS                            VLKCS511
205600                                   TO VL006-SELECTED-ITEMS.       VLKCS511
205700                                                                  VLKCS511
205800     EXEC CICS                                                    VLKCS511
205900          WRITEQ TS                                               VLKCS511
206000              QUEUE (ASC-SEL-QUEUE-NAME)                          VLKCS511
206100              FROM  (VL006-LINE-SEL-REC)                                84
206200              ITEM  (PV-SEL-QUEUE-ITEM)                           VLKCS511
206300              RESP  (PV-CICS-RESP)                                VLKCS511
206400     END-EXEC.                                                    VLKCS511
206500                                                                  VLKCS511
206600     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          VLKCS511
206700         CONTINUE                                                 VLKCS511
206800     ELSE                                                         VLKCS511
206900         SET DP013-CICS-ABEND      TO TRUE                        VLKCS511
207000         SET DP013-NO-ROLLBACK     TO TRUE                        VLKCS511
207100         MOVE '5205-WRITE-SEL-QUEUE'                              VLKCS511
207200                                   TO DP013-PARAGRAPH             VLKCS511
207300         MOVE 'ATTEMPTING TO WRITE SELECTED ITEMS QUEUE'          VLKCS511
207400                                   TO DP013-MESSAGE-TEXT(1)       VLKCS511
207500         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
207600     END-IF.                                                      VLKCS511
207700                                                                  VLKCS511
207800******************************************************************VLKCS511
207900** WHEN RETURNING TO THIS TRANSACTION FROM ANOTHER TRANSACTION, **VLKCS511
208000** SETUP THE ARRAY AS IT WAS WHEN WE HAD LEFT PREVIOUSLY.  EDIT **VLKCS511
208100** THE SELECTIONS MADE AT THAT TIME AND DISPLAY THE PANEL TO    **VLKCS511
208200** THE USER.                                                    **VLKCS511
208300******************************************************************VLKCS511
208400 6000-REFRESH-PANEL-FROM-TEMP.                                    VLKCS511
208500                                                                  VLKCS511
208600     IF  ASC-UPDATE-TSQ                                           VLKCS511
208700         SET ASC-NO-TSQ-UPDATE TO TRUE                            VLKCS511
208800         MOVE ZERO                 TO PV-SAVE-ITEM                VLKCS511
208900                                      PV-SEL-QUEUE-ITEM           VLKCS511
209000*        MOVE ASC-NUMBER-OF-SELECTED-ITEMS                        VLKCS511
209100*                                  TO PV-HOLD-SELECTED-ITEMS      VLKCS511
209200         PERFORM 6100-UPDATE-TSQ                                  VLKCS511
209300             UNTIL PV-ITEMS-PROCESSED >                           VLKCS511
209400                                     ASC-NUMBER-OF-SELECTED-ITEMS VLKCS511
209500         PERFORM 6010-DELETE-SEL-QUEUE                            VLKCS511
209600         INITIALIZE ASC-BLOCK-ENTRIES (1)                         VLKCS511
209700                    ASC-BLOCK-ENTRIES (2)                         VLKCS511
209701******ADDED                                                               
209702         DIVIDE PV-TOP-ITEM BY PC-ITEMS-PER-PANEL                 RCK00050
209703                GIVING PV-BLOCK-NUMBER                            RCK00050
209704                REMAINDER PV-REMAINDER                            RCK00050
209705         IF  PV-REMAINDER > ZERO                                  RCK00050
209706             ADD +1     TO PV-BLOCK-NUMBER                        RCK00050
209707         END-IF                                                   RCK00050
209708         MOVE +1        TO ASC-BLK-SUB                            RCK00050
209709         PERFORM 4410-READ-TEMP-STORAGE                           RCK00050
209710         ADD +1         TO ASC-BLK-SUB                            RCK00050
209711                           PV-BLOCK-NUMBER                        RCK00050
209712         PERFORM 4410-READ-TEMP-STORAGE                           RCK00050
209713                                                                  RCK00050
209720     END-IF.                                                      RCK00050
209800                                                                        84
209810******ADDED                                                               
209900                                                                  VLKCS511
210000*----------------------------------------------------------------*VLKCS511
210100*    DELETE THE SELECTED ITEMS TEMP STORAGE QUEUE.               *VLKCS511
210200*----------------------------------------------------------------*VLKCS511
210300 6010-DELETE-SEL-QUEUE.                                           VLKCS511
210400                                                                  VLKCS511
210500     EXEC CICS                                                    VLKCS511
210600         DELETEQ TS                                               VLKCS511
210700             QUEUE (ASC-SEL-QUEUE-NAME)                           VLKCS511
210800             RESP  (PV-CICS-RESP)                                 VLKCS511
210900     END-EXEC.                                                    VLKCS511
211000                                                                  VLKCS511
211100     IF ((PV-CICS-RESP = DFHRESP(NORMAL)) OR                      VLKCS511
211200        (PV-CICS-RESP = DFHRESP(QIDERR)))                         VLKCS511
211300         CONTINUE                                                 VLKCS511
211400     ELSE                                                         VLKCS511
211500         SET DP013-CICS-ABEND TO TRUE                             VLKCS511
211600         SET DP013-NO-ROLLBACK TO TRUE                            VLKCS511
211700         MOVE '6010-DELETE-SEL-QUEUE'                             VLKCS511
211800                        TO DP013-PARAGRAPH                        VLKCS511
211900         MOVE 'ERROR TRYING TO DELETE SELECTION TS QUEUE'         VLKCS511
212000                        TO DP013-MESSAGE-TEXT (1)                 VLKCS511
212100         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
212200     END-IF.                                                      VLKCS511
212300                                                                  VLKCS511
212400*----------------------------------------------------------------*VLKCS511
212500*    INCREMENT THE TSQ ITEM NUMBER AND READ THE LIST QUEUE.      *VLKCS511
212600*    LOOP THROUGH THE LIST QUEUE TO OBTAIN THE LINE ITEM NUMBER  *VLKCS511
212700*    TO BE USED TO UPDATE (DESELECT) THE CORRECT LINE ITEM IN    *VLKCS511
212800*    THE TEMP QUEUE.                                             *VLKCS511
212900*----------------------------------------------------------------*VLKCS511
213000 6100-UPDATE-TSQ.                                                 VLKCS511
213100                                                                  VLKCS511
213200     ADD 1                     TO  PV-SEL-QUEUE-ITEM.             VLKCS511
213300     PERFORM 6105-READ-SEL-QUEUE.                                 VLKCS511
213400     PERFORM                                                      VLKCS511
213500         VARYING VL006-IDX                                        VLKCS511
213600         FROM 1 BY 1                                              VLKCS511
213700         UNTIL ((PV-ITEMS-PROCESSED >                             VLKCS511
213800                              PV-HOLD-SELECTED-ITEMS)             VLKCS511
213900         OR (VL006-IDX GREATER THAN VL006-MAX-ITEMS))             VLKCS511
214000         IF  VL006-ACTION-SW (VL006-IDX) > SPACE                  VLKCS511
214100             PERFORM 6110-PROCESS-ITEMS                           VLKCS511
214200         END-IF                                                   VLKCS511
214300         ADD +1                TO PV-ITEMS-PROCESSED              VLKCS511
214400     END-PERFORM.                                                 VLKCS511
214500                                                                  VLKCS511
214600     PERFORM 6111-WRITE-LIST-QUEUE.                               VLKCS511
214700                                                                  VLKCS511
214800*----------------------------------------------------------------*VLKCS511
214900*    READ THE LIST QUEUE RECORD.                                 *VLKCS511
215000*----------------------------------------------------------------*VLKCS511
215100 6105-READ-SEL-QUEUE.                                             VLKCS511
215200                                                                  VLKCS511
215300     EXEC CICS                                                    VLKCS511
215400          READQ TS                                                VLKCS511
215500              QUEUE (ASC-SEL-QUEUE-NAME)                          VLKCS511
215600              INTO  (VL006-LINE-SEL-REC)                                84
215700              ITEM  (PV-SEL-QUEUE-ITEM)                           VLKCS511
215800              RESP  (PV-CICS-RESP)                                VLKCS511
215900     END-EXEC.                                                    VLKCS511
216000                                                                  VLKCS511
216100     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          VLKCS511
216200         CONTINUE                                                 VLKCS511
216300     ELSE                                                         VLKCS511
216400         SET DP013-CICS-ABEND      TO  TRUE                       VLKCS511
216500         SET DP013-NO-ROLLBACK     TO  TRUE                       VLKCS511
216600         MOVE '6105-READ-SEL-QUEUE'                               VLKCS511
216700                                   TO  DP013-PARAGRAPH            VLKCS511
216800         MOVE 'ATTEMPTING TO READ SELECTED ITEMS QUEUE'           VLKCS511
216900                                   TO  DP013-MESSAGE-TEXT(1)      VLKCS511
217000         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
217100     END-IF.                                                      VLKCS511
217200                                                                  VLKCS511
217300*----------------------------------------------------------------*VLKCS511
217400*    CALCULATE THE TEMP QUEUE ITEM THAT MUST BE READ AND READ IT.*VLKCS511
217500*    REWRITE THE CURRENT TEMP QUEUE ITEM IF NECESSARY.  CALCULATE*VLKCS511
217600*    THE LINE ITEM OCCURENCE AND UPDATE (DESELECT) IT.           *VLKCS511
217700*----------------------------------------------------------------*VLKCS511
217800 6110-PROCESS-ITEMS.                                              VLKCS511
217900                                                                  VLKCS511
218000     COMPUTE PV-ITEM = 1 + ((VL006-ITEM (VL006-IDX) - 1)          VLKCS511
218100                     / PC-ITEMS-PER-PANEL).                       VLKCS511
218200                                                                  VLKCS511
218300     IF  PV-ITEM NOT EQUAL PV-SAVE-ITEM                           VLKCS511
218400         IF  PV-SAVE-ITEM NOT EQUAL ZERO                          VLKCS511
218500             PERFORM 6111-WRITE-LIST-QUEUE                        VLKCS511
218600         END-IF                                                   VLKCS511
218700         MOVE PV-ITEM          TO PV-SAVE-ITEM                    VLKCS511
218800                                                                  VLKCS511
218900         PERFORM 6112-READ-LIST-QUEUE                             VLKCS511
219000         IF  PV-CICS-RESP NOT EQUAL DFHRESP(NORMAL)               VLKCS511
219100             CONTINUE                                             VLKCS511
219200         END-IF                                                   VLKCS511
219300     END-IF.                                                      VLKCS511
219400                                                                  VLKCS511
219500     COMPUTE PV-SUB = (VL006-ITEM (VL006-IDX)                     VLKCS511
219600                    - LQW-LIST-ITEM-NUMBER (1)) + 1.              VLKCS511
219700     SET LQW-DESELECT (PV-SUB) TO    TRUE                         VLKCS511
219800     MOVE LQW-SELECTED-SW (PV-SUB)                                VLKCS511
219900                               TO LQW-TEMP-SELECTED-SW (PV-SUB).  VLKCS511
220000     EVALUATE TRUE                                                VLKCS511
220100         WHEN VL006-INQ (VL006-IDX)                               VLKCS511
220200              MOVE PC-INQ      TO LQW-ACTION (PV-SUB)             VLKCS511
220300                                                                  VLKCS511
220400         WHEN VL006-UPD (VL006-IDX)                               VLKCS511
220500              MOVE PC-UPD      TO LQW-ACTION (PV-SUB)             VLKCS511
220600                                                                  VLKCS511
220700         WHEN VL006-DEL (VL006-IDX)                               VLKCS511
220800              MOVE PC-DEL      TO LQW-ACTION (PV-SUB)             VLKCS511
220900                                                                  VLKCS511
221000         WHEN VL006-ERR (VL006-IDX)                               VLKCS511
221100              MOVE PC-ERR      TO LQW-ACTION (PV-SUB)             VLKCS511
221200     END-EVALUATE.                                                VLKCS511
221300                                                                  VLKCS511
221400     SUBTRACT 1 FROM ASC-NUMBER-OF-SELECTED-ITEMS.                VLKCS511
221500                                                                  VLKCS511
221600*----------------------------------------------------------------*VLKCS511
221700*    WRITE THE TS QUEUE RECORD JUST UPDATED IN C600.             *VLKCS511
221800*----------------------------------------------------------------*VLKCS511
221900 6111-WRITE-LIST-QUEUE.                                           VLKCS511
222000                                                                  VLKCS511
222100     EXEC CICS                                                    VLKCS511
222200         WRITEQ TS                                                VLKCS511
222300             QUEUE (ASC-LIST-QUEUE-NAME)                          VLKCS511
222400             FROM  (LQW-LIST-QUEUE-WORK-AREA)                     VLKCS511
222500             ITEM  (PV-SAVE-ITEM)                                 VLKCS511
222600             REWRITE                                              VLKCS511
222700             RESP  (PV-CICS-RESP)                                 VLKCS511
222800     END-EXEC.                                                    VLKCS511
222900                                                                  VLKCS511
223000     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          VLKCS511
223100         CONTINUE                                                 VLKCS511
223200     ELSE                                                         VLKCS511
223300         SET DP013-CICS-ABEND  TO  TRUE                           VLKCS511
223400         SET DP013-NO-ROLLBACK TO  TRUE                           VLKCS511
223500         MOVE '6111-WRITE-LIST-QUEUE'                             VLKCS511
223600                               TO  DP013-PARAGRAPH                VLKCS511
223700         MOVE 'ATTEMPTING TO REWRITE LIST QUEUE'                  VLKCS511
223800                               TO  DP013-MESSAGE-TEXT(1)          VLKCS511
223900         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
224000     END-IF.                                                      VLKCS511
224100                                                                  VLKCS511
224200*----------------------------------------------------------------*VLKCS511
224300*    READ THE TEMPORARY STORAGE QUEUE INTO A TEMPORARY WORK AREA.*VLKCS511
224400*----------------------------------------------------------------*VLKCS511
224500 6112-READ-LIST-QUEUE.                                            VLKCS511
224600                                                                  VLKCS511
224700     EXEC CICS                                                    VLKCS511
224800         READQ TS                                                 VLKCS511
224900             QUEUE (ASC-LIST-QUEUE-NAME)                          VLKCS511
225000             INTO  (LQW-LIST-QUEUE-WORK-AREA)                     VLKCS511
225100             ITEM  (PV-ITEM)                                      VLKCS511
225200             RESP  (PV-CICS-RESP)                                 VLKCS511
225300     END-EXEC.                                                    VLKCS511
225400                                                                  VLKCS511
225500     IF  PV-CICS-RESP = DFHRESP (NORMAL)                          VLKCS511
225600         CONTINUE                                                 VLKCS511
225700     ELSE                                                         VLKCS511
225800         SET DP013-CICS-ABEND        TO TRUE                      VLKCS511
225900         SET DP013-NO-ROLLBACK       TO TRUE                      VLKCS511
226000         MOVE '6112-READ-LIST-QUEUE' TO DP013-PARAGRAPH           VLKCS511
226100         MOVE 'ATTEMPTING TO READQ LIST QUEUE'                    VLKCS511
226200                                     TO DP013-MESSAGE-TEXT(1)     VLKCS511
226300         PERFORM DP013-0000-PROCESS-ABEND                         VLKCS511
226400     END-IF.                                                      VLKCS511
226500                                                                  VLKCS511
226600*----------------------------------------------------------------*VLKCS511
226700*    ABEND PROCESSOR MODULE                                      *VLKCS511
226800*----------------------------------------------------------------*VLKCS511
226900     COPY DPPD013.                                                VLKCS511
