        PRINT NOGEN                                                     00010000
VLKM507 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL507A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(01,45),                                            X00120000
               LENGTH=06,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='ITEMS:'                                         00150000
*                                                                       00150100
ASTRTIT DFHMDF POS=(01,53),                                            X00150200
               LENGTH=05,                                              X00150300
               ATTRB=UNPROT,                                           X00150400
               HILIGHT=UNDERLINE,                                      X00150500
               PICOUT='ZZZZZ'                                           00150600
*                                                                       00150700
        DFHMDF POS=(01,59),                                            X00150800
               LENGTH=02,                                              X00150900
               ATTRB=(ASKIP,BRT),                                      X00151000
               INITIAL='TO'                                             00151100
*                                                                       00151200
AENDIT  DFHMDF POS=(01,64),                                            X00151300
               LENGTH=05,                                              X00151400
               ATTRB=(ASKIP,BRT),                                      X00151500
               PICOUT='ZZZZZ'                                           00151600
*                                                                       00151700
        DFHMDF POS=(01,70),                                            X00151800
               LENGTH=02,                                              X00151900
               ATTRB=(ASKIP,BRT),                                      X00152000
               INITIAL='0F'                                             00152100
*                                                                       00152200
ATOTIT  DFHMDF POS=(01,74),                                            X00152300
               LENGTH=05,                                              X00152400
               ATTRB=(ASKIP,BRT),                                      X00152500
               PICOUT='ZZZZZ'                                           00152600
*********************************************************************** 00152700
        DFHMDF POS=(02,11),                                            X00152800
               LENGTH=09,                                              X00152900
               ATTRB=(ASKIP,BRT),                                      X00153000
               INITIAL='PO NUMBER'                                      00154000
*                                                                       00154100
        DFHMDF POS=(02,25),                                            X00154200
               LENGTH=12,                                              X00154300
               ATTRB=(ASKIP,BRT),                                      X00154400
               INITIAL='REQUEST DATE'                                   00154500
*                                                                       00154600
        DFHMDF POS=(02,43),                                            X00154700
               LENGTH=10,                                              X00154800
               ATTRB=(ASKIP,BRT),                                      X00154900
               INITIAL='PRINT DATE'                                     00155000
*                                                                       00155100
        DFHMDF POS=(02,60),                                            X00155200
               LENGTH=12,                                              X00155300
               ATTRB=(ASKIP,BRT),                                      X00155400
               INITIAL='VND DUE DATE'                                   00155500
*********************************************************************** 00155600
APONBR1 DFHMDF POS=(03,12),                                            X00155700
               LENGTH=08,                                              X00155800
               ATTRB=(ASKIP,BRT),                                      X00155900
               COLOR=BLUE,                                             X00156000
               PICOUT='99999999'                                        00157000
*                                                                       00157100
ARDATE1 DFHMDF POS=(03,25),                                            X00157200
               LENGTH=10,                                              X00157300
               ATTRB=(ASKIP,BRT),                                      X00157400
               COLOR=BLUE,                                             X00157500
               PICOUT='XXXXXXXXXX'                                      00157600
*                                                                       00157700
APDATE1 DFHMDF POS=(03,43),                                            X00157800
               LENGTH=10,                                              X00157900
               ATTRB=(ASKIP,BRT),                                      X00158000
               COLOR=BLUE,                                             X00158100
               PICOUT='XXXXXXXXXX'                                      00158200
*                                                                       00158300
AVDDTE1 DFHMDF POS=(03,61),                                            X00158400
               LENGTH=10,                                              X00158500
               ATTRB=(ASKIP,BRT),                                      X00158600
               COLOR=BLUE,                                             X00158700
               PICOUT='XXXXXXXXXX'                                      00158800
*********************************************************************** 00158900
APONBR2 DFHMDF POS=(04,12),                                            X00159000
               LENGTH=08,                                              X00160000
               ATTRB=(ASKIP,BRT),                                      X00161000
               COLOR=BLUE,                                             X00161100
               PICOUT='99999999'                                        00161200
*                                                                       00161300
ARDATE2 DFHMDF POS=(04,25),                                            X00161400
               LENGTH=10,                                              X00161500
               ATTRB=(ASKIP,BRT),                                      X00161600
               COLOR=BLUE,                                             X00161700
               PICOUT='XXXXXXXXXX'                                      00161800
*                                                                       00161900
APDATE2 DFHMDF POS=(04,43),                                            X00162000
               LENGTH=10,                                              X00162100
               ATTRB=(ASKIP,BRT),                                      X00162200
               COLOR=BLUE,                                             X00162300
               PICOUT='XXXXXXXXXX'                                      00162400
*                                                                       00162500
AVDDTE2 DFHMDF POS=(04,61),                                            X00162600
               LENGTH=10,                                              X00162700
               ATTRB=(ASKIP,BRT),                                      X00162800
               COLOR=BLUE,                                             X00162900
               PICOUT='XXXXXXXXXX'                                      00163000
*********************************************************************** 00164000
APONBR3 DFHMDF POS=(05,12),                                            X00164100
               LENGTH=08,                                              X00164200
               ATTRB=(ASKIP,BRT),                                      X00164300
               COLOR=BLUE,                                             X00164400
               PICOUT='99999999'                                        00164500
*                                                                       00164600
ARDATE3 DFHMDF POS=(05,25),                                            X00164700
               LENGTH=10,                                              X00164800
               ATTRB=(ASKIP,BRT),                                      X00164900
               COLOR=BLUE,                                             X00165000
               PICOUT='XXXXXXXXXX'                                      00165100
*                                                                       00165200
APDATE3 DFHMDF POS=(05,43),                                            X00165300
               LENGTH=10,                                              X00165400
               ATTRB=(ASKIP,BRT),                                      X00165500
               COLOR=BLUE,                                             X00165600
               PICOUT='XXXXXXXXXX'                                      00165700
*                                                                       00165800
AVDDTE3 DFHMDF POS=(05,61),                                            X00165900
               LENGTH=10,                                              X00166000
               ATTRB=(ASKIP,BRT),                                      X00166100
               COLOR=BLUE,                                             X00166200
               PICOUT='XXXXXXXXXX'                                      00166300
*********************************************************************** 00166400
APONBR4 DFHMDF POS=(06,12),                                            X00166500
               LENGTH=08,                                              X00166600
               ATTRB=(ASKIP,BRT),                                      X00166700
               COLOR=BLUE,                                             X00166800
               PICOUT='99999999'                                        00166900
*                                                                       00167000
ARDATE4 DFHMDF POS=(06,25),                                            X00168000
               LENGTH=10,                                              X00168100
               ATTRB=(ASKIP,BRT),                                      X00168200
               COLOR=BLUE,                                             X00168300
               PICOUT='XXXXXXXXXX'                                      00168400
*                                                                       00168500
APDATE4 DFHMDF POS=(06,43),                                            X00168600
               LENGTH=10,                                              X00168700
               ATTRB=(ASKIP,BRT),                                      X00168800
               COLOR=BLUE,                                             X00168900
               PICOUT='XXXXXXXXXX'                                      00169000
*                                                                       00169100
AVDDTE4 DFHMDF POS=(06,61),                                            X00169200
               LENGTH=10,                                              X00169300
               ATTRB=(ASKIP,BRT),                                      X00169400
               COLOR=BLUE,                                             X00169500
               PICOUT='XXXXXXXXXX'                                      00169600
*********************************************************************** 00169700
        DFHMDF POS=(08,05),                                            X00169800
               LENGTH=19,                                              X00169900
               ATTRB=(ASKIP,BRT),                                      X00170000
               INITIAL='CARRIER NAME .....:'                            00171000
ASCAC   DFHMDF POS=(08,25),                                            X00172000
               LENGTH=04,                                              X00173000
               ATTRB=UNPROT,                                           X00174000
               HILIGHT=UNDERLINE,                                      X00174100
               PICOUT='XXXX'                                            00174200
        DFHMDF POS=(08,30),                                            X00174300
               LENGTH=01,                                              X00174400
               ATTRB=ASKIP                                              00174500
*                                                                       00174600
        DFHMDF POS=(08,39),                                            X00174700
               LENGTH=30,                                              X00174800
               ATTRB=(ASKIP,BRT),                                      X00174900
               INITIAL='SINGLE SHIPPING NUMBER FIELDS:'                 00175000
*********************************************************************** 00176000
        DFHMDF POS=(09,05),                                            X00176100
               LENGTH=19,                                              X00176200
               ATTRB=(ASKIP,BRT),                                      X00176300
               INITIAL='SHIPPED DATE .....:'                            00176400
ASDATE  DFHMDF POS=(09,25),                                            X00176500
               LENGTH=10,                                              X00176600
               ATTRB=UNPROT,                                           X00176700
               HILIGHT=UNDERLINE,                                      X00176800
               PICOUT='XXXXXXXXXX'                                      00176900
        DFHMDF POS=(09,36),                                            X00177000
               LENGTH=01,                                              X00177100
               ATTRB=ASKIP                                              00177200
*                                                                       00177300
        DFHMDF POS=(09,43),                                            X00177400
               LENGTH=17,                                              X00177500
               ATTRB=(ASKIP,BRT),                                      X00177600
               INITIAL='CARRIER SHIP NBR:'                              00177700
ACSNBR  DFHMDF POS=(09,61),                                            X00177800
               LENGTH=18,                                              X00177900
               ATTRB=UNPROT,                                           X00178000
               HILIGHT=UNDERLINE,                                      X00178100
               PICOUT='XXXXXXXXXXXXXXXXXX'                              00178200
        DFHMDF POS=(09,80),                                            X00178300
               LENGTH=00,                                              X00178400
               ATTRB=ASKIP                                              00178500
*********************************************************************** 00178600
        DFHMDF POS=(10,05),                                            X00178700
               LENGTH=19,                                              X00178800
               ATTRB=(ASKIP,BRT),                                      X00178900
               INITIAL='SHIPPING METHOD ..:'                            00179000
ASMETH  DFHMDF POS=(10,25),                                            X00179100
               LENGTH=10,                                              X00179200
               ATTRB=UNPROT,                                           X00179300
               HILIGHT=UNDERLINE,                                      X00179400
               PICOUT='XXXXXXXXXX'                                      00179500
        DFHMDF POS=(10,36),                                            X00179600
               LENGTH=01,                                              X00179700
               ATTRB=ASKIP                                              00179800
*                                                                       00179900
        DFHMDF POS=(10,43),                                            X00180000
               LENGTH=17,                                              X00180100
               ATTRB=(ASKIP,BRT),                                      X00180200
               INITIAL='PACKAGE COUNT ..:'                              00180300
APACKS  DFHMDF POS=(10,61),                                            X00180400
               LENGTH=03,                                              X00180500
               ATTRB=UNPROT,                                           X00180600
               HILIGHT=UNDERLINE,                                      X00180700
               PICOUT='ZZ9'                                             00180800
        DFHMDF POS=(10,65),                                            X00180900
               LENGTH=01,                                              X00181000
               ATTRB=ASKIP                                              00181100
*********************************************************************** 00181200
        DFHMDF POS=(11,05),                                            X00181300
               LENGTH=19,                                              X00181400
               ATTRB=(ASKIP,BRT),                                      X00181500
               INITIAL='VENDOR NAME ......:'                            00181600
AVNAME  DFHMDF POS=(11,25),                                            X00181700
               LENGTH=40,                                              X00181800
               ATTRB=(ASKIP,BRT),                                      X00181900
               COLOR=BLUE                                               00182000
*********************************************************************** 00183000
AADDR1  DFHMDF POS=(12,25),                                            X00184000
               LENGTH=40,                                              X00184100
               ATTRB=(ASKIP,BRT),                                      X00184200
               COLOR=BLUE                                               00184300
*********************************************************************** 00184400
AADDR2  DFHMDF POS=(13,25),                                            X00184500
               LENGTH=40,                                              X00184600
               ATTRB=(ASKIP,BRT),                                      X00184700
               COLOR=BLUE                                               00184800
*********************************************************************** 00184900
AADDR3  DFHMDF POS=(14,25),                                            X00185000
               LENGTH=40,                                              X00186000
               ATTRB=(ASKIP,BRT),                                      X00187000
               COLOR=BLUE                                               00188000
*********************************************************************** 00189000
AADDR4  DFHMDF POS=(15,25),                                            X00190000
               LENGTH=40,                                              X00191000
               ATTRB=(ASKIP,BRT),                                      X00192000
               COLOR=BLUE                                               00193000
*********************************************************************** 00193100
AADDR5  DFHMDF POS=(16,25),                                            X00193200
               LENGTH=40,                                              X00193300
               ATTRB=(ASKIP,BRT),                                      X00193400
               COLOR=BLUE                                               00193500
*********************************************************************** 00193600
AADDR6  DFHMDF POS=(17,25),                                            X00193700
               LENGTH=40,                                              X00193800
               ATTRB=(ASKIP,BRT),                                      X00193900
               COLOR=BLUE                                               00194000
*********************************************************************** 00195000
AADDR7  DFHMDF POS=(18,25),                                            X00195100
               LENGTH=40,                                              X00195200
               ATTRB=(ASKIP,BRT),                                      X00195300
               COLOR=BLUE                                               00195400
*********************************************************************** 00195500
AADDR8  DFHMDF POS=(19,25),                                            X00195600
               LENGTH=40,                                              X00195700
               ATTRB=(ASKIP,BRT),                                      X00195800
               COLOR=BLUE                                               00195900
*********************************************************************** 00196000
        DFHMSD TYPE=FINAL                                               00197000
        PRINT NOGEN                                                     00198000
        END                                                             00199000
