        PRINT NOGEN                                                     00010000
VLKM504 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL504A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(02,44),                                            X00120000
               LENGTH=06,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='ITEMS:'                                         00150000
*                                                                       00160000
ASTRTIT DFHMDF POS=(02,53),                                            X00170000
               LENGTH=05,                                              X00180000
               ATTRB=UNPROT,                                           X00190000
               HILIGHT=UNDERLINE,                                      X00200000
               PICOUT='ZZZZ9'                                           00210000
*                                                                       00220000
        DFHMDF POS=(02,59),                                            X00230000
               LENGTH=02,                                              X00240000
               ATTRB=(ASKIP,BRT),                                      X00250000
               INITIAL='TO'                                             00260000
*                                                                       00270000
AENDIT  DFHMDF POS=(02,64),                                            X00280000
               LENGTH=05,                                              X00290000
               ATTRB=(ASKIP,BRT),                                      X00300000
               PICOUT='ZZZZZ'                                           00310000
*                                                                       00320000
        DFHMDF POS=(02,70),                                            X00330000
               LENGTH=02,                                              X00340000
               ATTRB=(ASKIP,BRT),                                      X00350000
               INITIAL='OF'                                             00360000
*                                                                       00370000
ATOTIT  DFHMDF POS=(02,74),                                            X00380000
               LENGTH=05,                                              X00390000
               ATTRB=(ASKIP,BRT),                                      X00400000
               PICOUT='ZZZZZ'                                           00410000
*                                                                       00420000
*********************************************************************** 00430000
        DFHMDF POS=(03,59),                                            X00440000
               LENGTH=03,                                              X00450000
               ATTRB=(ASKIP,BRT),                                      X00460000
               INITIAL='VND'                                            00470000
*                                                                       00480000
        DFHMDF POS=(03,65),                                            X00490000
               LENGTH=05,                                              X00500000
               ATTRB=(ASKIP,BRT),                                      X00510000
               INITIAL='PRINT'                                          00520000
*********************************************************************** 00530000
        DFHMDF POS=(04,11),                                            X00540000
               LENGTH=02,                                              X00550000
               ATTRB=(ASKIP,BRT),                                      X00560000
               INITIAL='PO'                                             00570000
*                                                                       00580000
        DFHMDF POS=(04,18),                                            X00590000
               LENGTH=04,                                              X00600000
               ATTRB=(ASKIP,BRT),                                      X00610000
               INITIAL='RQST'                                           00620000
*                                                                       00630000
        DFHMDF POS=(04,26),                                            X00640000
               LENGTH=03,                                              X00650000
               ATTRB=(ASKIP,BRT),                                      X00660000
               INITIAL='NUM'                                            00670000
*                                                                       00680000
        DFHMDF POS=(04,51),                                            X00690000
               LENGTH=04,                                              X00700000
               ATTRB=(ASKIP,BRT),                                      X00710000
               INITIAL='RQST'                                           00720000
*                                                                       00730000
        DFHMDF POS=(04,59),                                            X00740000
               LENGTH=03,                                              X00750000
               ATTRB=(ASKIP,BRT),                                      X00760000
               INITIAL='DUE'                                            00770000
*                                                                       00780000
        DFHMDF POS=(04,66),                                            X00790000
               LENGTH=03,                                              X00800000
               ATTRB=(ASKIP,BRT),                                      X00810000
               INITIAL='DUE'                                            00820000
*                                                                       00830000
        DFHMDF POS=(04,76),                                            X00840000
               LENGTH=03,                                              X00850000
               ATTRB=(ASKIP,BRT),                                      X00860000
               INITIAL='NUM'                                            00870000
*********************************************************************** 00880000
        DFHMDF POS=(05,01),                                            X00890000
               LENGTH=03,                                              X00900000
               ATTRB=(ASKIP,BRT),                                      X00910000
               INITIAL='SEL'                                            00920000
*                                                                       00930000
        DFHMDF POS=(05,05),                                            X00940000
               LENGTH=03,                                              X00950000
               ATTRB=(ASKIP,BRT),                                      X00960000
               INITIAL='ACT'                                            00970000
*                                                                       00980000
        DFHMDF POS=(05,09),                                            X00990000
               LENGTH=06,                                              X01000000
               ATTRB=(ASKIP,BRT),                                      X01010000
               INITIAL='NUMBER'                                         01020000
*                                                                       01030000
        DFHMDF POS=(05,17),                                            X01040000
               LENGTH=06,                                              X01050000
               ATTRB=(ASKIP,BRT),                                      X01060000
               INITIAL='TYP/ST'                                         01070000
*                                                                       01080000
        DFHMDF POS=(05,24),                                            X01090000
               LENGTH=07,                                              X01100000
               ATTRB=(ASKIP,BRT),                                      X01110000
               INITIAL='TICKETS'                                        01120000
*                                                                       01130000
        DFHMDF POS=(05,34),                                            X01140000
               LENGTH=07,                                              X01150000
               ATTRB=(ASKIP,BRT),                                      X01160000
               INITIAL='VENDOR NAME'                                    01170000
*                                                                       01180000
        DFHMDF POS=(05,51),                                            X01190000
               LENGTH=04,                                              X01200000
               ATTRB=(ASKIP,BRT),                                      X01210000
               INITIAL='DATE'                                           01220000
*                                                                       01230000
        DFHMDF POS=(05,58),                                            X01240000
               LENGTH=04,                                              X01250000
               ATTRB=(ASKIP,BRT),                                      X01260000
               INITIAL='DATE'                                           01270000
*                                                                       01280000
        DFHMDF POS=(05,65),                                            X01290000
               LENGTH=04,                                              X01300000
               ATTRB=(ASKIP,BRT),                                      X01310000
               INITIAL='DATE'                                           01320000
*                                                                       01330000
        DFHMDF POS=(05,71),                                            X01340000
               LENGTH=04,                                              X01350000
               ATTRB=(ASKIP,BRT),                                      X01360000
               INITIAL='PRTY'                                           01370000
*                                                                       01380000
        DFHMDF POS=(05,76),                                            X01390000
               LENGTH=03,                                              X01400000
               ATTRB=(ASKIP,BRT),                                      X01410000
               INITIAL='LNS'                                            01420000
*********************************************************************** 01430000
ASEL01  DFHMDF POS=(06,02),                                            X01440000
               LENGTH=01,                                              X01450000
               ATTRB=UNPROT,                                           X01460000
               HILIGHT=UNDERLINE,                                      X01480000
               PICOUT='X'                                               01490000
*                                                                       01500000
        DFHMDF POS=(06,04),                                            X01510000
               LENGTH=00,                                              X01520000
               ATTRB=(ASKIP,BRT)                                        01540000
*                                                                       01550000
AACT01  DFHMDF POS=(06,05),                                            X01560000
               LENGTH=03,                                              X01570000
               ATTRB=(ASKIP,BRT)                                        01590000
*                                                                       01600000
APO01   DFHMDF POS=(06,09),                                            X01610000
               LENGTH=08,                                              X01620000
               COLOR=BLUE,                                             X01630000
               ATTRB=(ASKIP,BRT),                                      X01640000
               PICOUT='99999999'                                        01650000
*                                                                       01660000
ATYP01  DFHMDF POS=(06,18),                                            X01670000
               LENGTH=01,                                              X01680000
               COLOR=BLUE,                                             X01690000
               ATTRB=(ASKIP,BRT),                                      X01700000
               PICOUT='X'                                               01710000
*                                                                       01720000
ASTAT01 DFHMDF POS=(06,21),                                            X01730000
               LENGTH=01,                                              X01740000
               COLOR=BLUE,                                             X01750000
               ATTRB=(ASKIP,BRT),                                      X01760000
               PICOUT='X'                                               01770000
*                                                                       01780000
ANTIX01 DFHMDF POS=(06,23),                                            X01790000
               COLOR=BLUE,                                             X01800000
               LENGTH=08,                                              X01810000
               ATTRB=(ASKIP,BRT),                                      X01820000
               PICOUT='9999,999'                                        01830000
*                                                                       01840000
AVNME01 DFHMDF POS=(06,33),                                            X01850000
               COLOR=BLUE,                                             X01860000
               LENGTH=16,                                              X01870000
               ATTRB=(ASKIP,BRT),                                      X01880000
               PICOUT='XXXXXXXXXXXXXXXX'                                01890000
*                                                                       01900000
ARDTE01 DFHMDF POS=(06,51),                                            X01910000
               COLOR=BLUE,                                             X01920000
               LENGTH=05,                                              X01930000
               ATTRB=(ASKIP,BRT),                                      X01940000
               PICOUT='XXXXX'                                           01950000
*                                                                       01960000
AVDDT01 DFHMDF POS=(06,58),                                            X01970000
               COLOR=BLUE,                                             X01980000
               LENGTH=05,                                              X01990000
               ATTRB=(ASKIP,BRT),                                      X02000000
               PICOUT='XXXXX'                                           02010000
*                                                                       02020000
APDDT01 DFHMDF POS=(06,65),                                            X02030000
               COLOR=BLUE,                                             X02040000
               LENGTH=05,                                              X02050000
               ATTRB=(ASKIP,BRT),                                      X02060000
               PICOUT='XXXXX'                                           02070000
*                                                                       02080000
APRTY01 DFHMDF POS=(06,72),                                            X02090000
               COLOR=BLUE,                                             X02100000
               LENGTH=02,                                              X02110000
               ATTRB=(ASKIP,BRT),                                      X02120000
               PICOUT='99'                                              02130000
*                                                                       02140000
ALNES01 DFHMDF POS=(06,75),                                            X02150000
               COLOR=BLUE,                                             X02160000
               LENGTH=04,                                              X02170000
               ATTRB=(ASKIP,BRT),                                      X02180000
               PICOUT='ZZZ9'                                            02190000
*                                                                       02191000
        DFHMDF POS=(06,80),                                            X02192000
               LENGTH=00,                                              X02193000
               ATTRB=(ASKIP,BRT)                                        02194000
*                                                                       02200000
*********************************************************************** 02210000
ASEL02  DFHMDF POS=(07,02),                                            X02220000
               LENGTH=01,                                              X02240000
               ATTRB=UNPROT,                                           X02250000
               HILIGHT=UNDERLINE,                                      X02260000
               PICOUT='X'                                               02270000
*                                                                       02280000
        DFHMDF POS=(07,04),                                            X02290000
               LENGTH=00,                                              X02310000
               ATTRB=(ASKIP,BRT)                                        02320000
*                                                                       02330000
AACT02  DFHMDF POS=(07,05),                                            X02340000
               LENGTH=03,                                              X02360000
               ATTRB=(ASKIP,BRT)                                        02370000
*                                                                       02380000
APO02   DFHMDF POS=(07,09),                                            X02390000
               COLOR=BLUE,                                             X02400000
               LENGTH=08,                                              X02410000
               ATTRB=(ASKIP,BRT),                                      X02420000
               PICOUT='99999999'                                        02430000
*                                                                       02440000
ATYP02  DFHMDF POS=(07,18),                                            X02450000
               COLOR=BLUE,                                             X02460000
               LENGTH=01,                                              X02470000
               ATTRB=(ASKIP,BRT),                                      X02480000
               PICOUT='X'                                               02490000
*                                                                       02500000
ASTAT02 DFHMDF POS=(07,21),                                            X02510000
               COLOR=BLUE,                                             X02520000
               LENGTH=01,                                              X02530000
               ATTRB=(ASKIP,BRT),                                      X02540000
               PICOUT='X'                                               02550000
*                                                                       02560000
ANTIX02 DFHMDF POS=(07,23),                                            X02570000
               COLOR=BLUE,                                             X02580000
               LENGTH=08,                                              X02590000
               ATTRB=(ASKIP,BRT),                                      X02600000
               PICOUT='9999,999'                                        02610000
*                                                                       02620000
AVNME02 DFHMDF POS=(07,33),                                            X02630000
               COLOR=BLUE,                                             X02640000
               LENGTH=16,                                              X02650000
               ATTRB=(ASKIP,BRT),                                      X02660000
               PICOUT='XXXXXXXXXXXXXXXX'                                02670000
*                                                                       02680000
ARDTE02 DFHMDF POS=(07,51),                                            X02690000
               COLOR=BLUE,                                             X02700000
               LENGTH=05,                                              X02710000
               ATTRB=(ASKIP,BRT),                                      X02720000
               PICOUT='XXXXX'                                           02730000
*                                                                       02740000
AVDDT02 DFHMDF POS=(07,58),                                            X02750000
               COLOR=BLUE,                                             X02760000
               LENGTH=05,                                              X02770000
               ATTRB=(ASKIP,BRT),                                      X02780000
               PICOUT='XXXXX'                                           02790000
*                                                                       02800000
APDDT02 DFHMDF POS=(07,65),                                            X02810000
               COLOR=BLUE,                                             X02820000
               LENGTH=05,                                              X02830000
               ATTRB=(ASKIP,BRT),                                      X02840000
               PICOUT='XXXXX'                                           02850000
*                                                                       02860000
APRTY02 DFHMDF POS=(07,72),                                            X02870000
               COLOR=BLUE,                                             X02880000
               LENGTH=02,                                              X02890000
               ATTRB=(ASKIP,BRT),                                      X02900000
               PICOUT='99'                                              02910000
*                                                                       02920000
ALNES02 DFHMDF POS=(07,75),                                            X02930000
               COLOR=BLUE,                                             X02940000
               LENGTH=04,                                              X02950000
               ATTRB=(ASKIP,BRT),                                      X02960000
               PICOUT='ZZZ9'                                            02970000
*                                                                       02971000
        DFHMDF POS=(07,80),                                            X02972000
               LENGTH=00,                                              X02973000
               ATTRB=(ASKIP,BRT)                                        02974000
*                                                                       02980000
*********************************************************************** 02990000
ASEL03  DFHMDF POS=(08,02),                                            X03000000
               LENGTH=01,                                              X03020000
               ATTRB=UNPROT,                                           X03030000
               HILIGHT=UNDERLINE,                                      X03040000
               PICOUT='X'                                               03050000
*                                                                       03060000
        DFHMDF POS=(08,04),                                            X03070000
               LENGTH=00,                                              X03090000
               ATTRB=(ASKIP,BRT)                                        03100000
*                                                                       03110000
AACT03  DFHMDF POS=(08,05),                                            X03120000
               LENGTH=03,                                              X03140000
               ATTRB=(ASKIP,BRT)                                        03150000
*                                                                       03160000
APO03   DFHMDF POS=(08,09),                                            X03170000
               COLOR=BLUE,                                             X03180000
               LENGTH=08,                                              X03190000
               ATTRB=(ASKIP,BRT),                                      X03200000
               PICOUT='99999999'                                        03210000
*                                                                       03220000
ATYP03  DFHMDF POS=(08,18),                                            X03230000
               COLOR=BLUE,                                             X03240000
               LENGTH=01,                                              X03250000
               ATTRB=(ASKIP,BRT),                                      X03260000
               PICOUT='X'                                               03270000
*                                                                       03280000
ASTAT03 DFHMDF POS=(08,21),                                            X03290000
               COLOR=BLUE,                                             X03300000
               LENGTH=01,                                              X03310000
               ATTRB=(ASKIP,BRT),                                      X03320000
               PICOUT='X'                                               03330000
*                                                                       03340000
ANTIX03 DFHMDF POS=(08,23),                                            X03350000
               COLOR=BLUE,                                             X03360000
               LENGTH=08,                                              X03370000
               ATTRB=(ASKIP,BRT),                                      X03380000
               PICOUT='9999,999'                                        03390000
*                                                                       03400000
AVNME03 DFHMDF POS=(08,33),                                            X03410000
               COLOR=BLUE,                                             X03420000
               LENGTH=16,                                              X03430000
               ATTRB=(ASKIP,BRT),                                      X03440000
               PICOUT='XXXXXXXXXXXXXXXX'                                03450000
*                                                                       03460000
ARDTE03 DFHMDF POS=(08,51),                                            X03470000
               COLOR=BLUE,                                             X03480000
               LENGTH=05,                                              X03490000
               ATTRB=(ASKIP,BRT),                                      X03500000
               PICOUT='XXXXX'                                           03510000
*                                                                       03520000
AVDDT03 DFHMDF POS=(08,58),                                            X03530000
               COLOR=BLUE,                                             X03540000
               LENGTH=05,                                              X03550000
               ATTRB=(ASKIP,BRT),                                      X03560000
               PICOUT='XXXXX'                                           03570000
*                                                                       03580000
APDDT03 DFHMDF POS=(08,65),                                            X03590000
               COLOR=BLUE,                                             X03600000
               LENGTH=05,                                              X03610000
               ATTRB=(ASKIP,BRT),                                      X03620000
               PICOUT='XXXXX'                                           03630000
*                                                                       03640000
APRTY03 DFHMDF POS=(08,72),                                            X03650000
               COLOR=BLUE,                                             X03660000
               LENGTH=02,                                              X03670000
               ATTRB=(ASKIP,BRT),                                      X03680000
               PICOUT='99'                                              03690000
*                                                                       03700000
ALNES03 DFHMDF POS=(08,75),                                            X03710000
               COLOR=BLUE,                                             X03720000
               LENGTH=04,                                              X03730000
               ATTRB=(ASKIP,BRT),                                      X03740000
               PICOUT='ZZZ9'                                            03750000
*                                                                       03751000
        DFHMDF POS=(08,80),                                            X03752000
               LENGTH=00,                                              X03753000
               ATTRB=(ASKIP,BRT)                                        03754000
*                                                                       03760000
*********************************************************************** 03770000
ASEL04  DFHMDF POS=(09,02),                                            X03780000
               LENGTH=01,                                              X03800000
               ATTRB=UNPROT,                                           X03810000
               HILIGHT=UNDERLINE,                                      X03820000
               PICOUT='X'                                               03830000
*                                                                       03840000
        DFHMDF POS=(09,04),                                            X03850000
               LENGTH=00,                                              X03870000
               ATTRB=(ASKIP,BRT)                                        03880000
*                                                                       03890000
AACT04  DFHMDF POS=(09,05),                                            X03900000
               LENGTH=03,                                              X03920000
               ATTRB=(ASKIP,BRT)                                        03930000
*                                                                       03940000
APO04   DFHMDF POS=(09,09),                                            X03950000
               COLOR=BLUE,                                             X03960000
               LENGTH=08,                                              X03970000
               ATTRB=(ASKIP,BRT),                                      X03980000
               PICOUT='99999999'                                        03990000
*                                                                       04000000
ATYP04  DFHMDF POS=(09,18),                                            X04010000
               COLOR=BLUE,                                             X04020000
               LENGTH=01,                                              X04030000
               ATTRB=(ASKIP,BRT),                                      X04040000
               PICOUT='X'                                               04050000
*                                                                       04060000
ASTAT04 DFHMDF POS=(09,21),                                            X04070000
               COLOR=BLUE,                                             X04080000
               LENGTH=01,                                              X04090000
               ATTRB=(ASKIP,BRT),                                      X04100000
               PICOUT='X'                                               04110000
*                                                                       04120000
ANTIX04 DFHMDF POS=(09,23),                                            X04130000
               COLOR=BLUE,                                             X04140000
               LENGTH=08,                                              X04150000
               ATTRB=(ASKIP,BRT),                                      X04160000
               PICOUT='9999,999'                                        04170000
*                                                                       04180000
AVNME04 DFHMDF POS=(09,33),                                            X04190000
               COLOR=BLUE,                                             X04200000
               LENGTH=16,                                              X04210000
               ATTRB=(ASKIP,BRT),                                      X04220000
               PICOUT='XXXXXXXXXXXXXXXX'                                04230000
*                                                                       04240000
ARDTE04 DFHMDF POS=(09,51),                                            X04250000
               COLOR=BLUE,                                             X04260000
               LENGTH=05,                                              X04270000
               ATTRB=(ASKIP,BRT),                                      X04280000
               PICOUT='XXXXX'                                           04290000
*                                                                       04300000
AVDDT04 DFHMDF POS=(09,58),                                            X04310000
               COLOR=BLUE,                                             X04320000
               LENGTH=05,                                              X04330000
               ATTRB=(ASKIP,BRT),                                      X04340000
               PICOUT='XXXXX'                                           04350000
*                                                                       04360000
APDDT04 DFHMDF POS=(09,65),                                            X04370000
               COLOR=BLUE,                                             X04380000
               LENGTH=05,                                              X04390000
               ATTRB=(ASKIP,BRT),                                      X04400000
               PICOUT='XXXXX'                                           04410000
*                                                                       04420000
APRTY04 DFHMDF POS=(09,72),                                            X04430000
               COLOR=BLUE,                                             X04440000
               LENGTH=02,                                              X04450000
               ATTRB=(ASKIP,BRT),                                      X04460000
               PICOUT='99'                                              04470000
*                                                                       04480000
ALNES04 DFHMDF POS=(09,75),                                            X04490000
               COLOR=BLUE,                                             X04500000
               LENGTH=04,                                              X04510000
               ATTRB=(ASKIP,BRT),                                      X04520000
               PICOUT='ZZZ9'                                            04530000
*                                                                       04531000
        DFHMDF POS=(09,80),                                            X04532000
               LENGTH=00,                                              X04533000
               ATTRB=(ASKIP,BRT)                                        04534000
*                                                                       04540000
*********************************************************************** 04550000
ASEL05  DFHMDF POS=(10,02),                                            X04560000
               LENGTH=01,                                              X04570000
               ATTRB=UNPROT,                                           X04580000
               HILIGHT=UNDERLINE,                                      X04590000
               PICOUT='X'                                               04600000
*                                                                       04610000
        DFHMDF POS=(10,04),                                            X04620000
               LENGTH=00,                                              X04630000
               ATTRB=(ASKIP,BRT)                                        04640000
*                                                                       04650000
AACT05  DFHMDF POS=(10,05),                                            X04660000
               LENGTH=03,                                              X04680000
               ATTRB=(ASKIP,BRT)                                        04690000
*                                                                       04700000
APO05   DFHMDF POS=(10,09),                                            X04710000
               COLOR=BLUE,                                             X04720000
               LENGTH=08,                                              X04730000
               ATTRB=(ASKIP,BRT),                                      X04740000
               PICOUT='99999999'                                        04750000
*                                                                       04760000
ATYP05  DFHMDF POS=(10,18),                                            X04770000
               COLOR=BLUE,                                             X04780000
               LENGTH=01,                                              X04790000
               ATTRB=(ASKIP,BRT),                                      X04800000
               PICOUT='X'                                               04810000
*                                                                       04820000
ASTAT05 DFHMDF POS=(10,21),                                            X04830000
               COLOR=BLUE,                                             X04840000
               LENGTH=01,                                              X04850000
               ATTRB=(ASKIP,BRT),                                      X04860000
               PICOUT='X'                                               04870000
*                                                                       04880000
ANTIX05 DFHMDF POS=(10,23),                                            X04890000
               COLOR=BLUE,                                             X04900000
               LENGTH=08,                                              X04910000
               ATTRB=(ASKIP,BRT),                                      X04920000
               PICOUT='9999,999'                                        04930000
*                                                                       04940000
AVNME05 DFHMDF POS=(10,33),                                            X04950000
               COLOR=BLUE,                                             X04960000
               LENGTH=16,                                              X04970000
               ATTRB=(ASKIP,BRT),                                      X04980000
               PICOUT='XXXXXXXXXXXXXXXX'                                04990000
*                                                                       05000000
ARDTE05 DFHMDF POS=(10,51),                                            X05010000
               COLOR=BLUE,                                             X05020000
               LENGTH=05,                                              X05030000
               ATTRB=(ASKIP,BRT),                                      X05040000
               PICOUT='XXXXX'                                           05050000
*                                                                       05060000
AVDDT05 DFHMDF POS=(10,58),                                            X05070000
               COLOR=BLUE,                                             X05080000
               LENGTH=05,                                              X05090000
               ATTRB=(ASKIP,BRT),                                      X05100000
               PICOUT='XXXXX'                                           05110000
*                                                                       05120000
APDDT05 DFHMDF POS=(10,65),                                            X05130000
               COLOR=BLUE,                                             X05140000
               LENGTH=05,                                              X05150000
               ATTRB=(ASKIP,BRT),                                      X05160000
               PICOUT='XXXXX'                                           05170000
*                                                                       05180000
APRTY05 DFHMDF POS=(10,72),                                            X05190000
               COLOR=BLUE,                                             X05200000
               LENGTH=02,                                              X05210000
               ATTRB=(ASKIP,BRT),                                      X05220000
               PICOUT='99'                                              05230000
*                                                                       05240000
ALNES05 DFHMDF POS=(10,75),                                            X05250000
               COLOR=BLUE,                                             X05260000
               LENGTH=04,                                              X05270000
               ATTRB=(ASKIP,BRT),                                      X05280000
               PICOUT='ZZZ9'                                            05290000
*                                                                       05291000
        DFHMDF POS=(10,80),                                            X05292000
               LENGTH=00,                                              X05293000
               ATTRB=(ASKIP,BRT)                                        05294000
*                                                                       05300000
*********************************************************************** 05310000
ASEL06  DFHMDF POS=(11,02),                                            X05320000
               LENGTH=01,                                              X05340000
               ATTRB=UNPROT,                                           X05350000
               HILIGHT=UNDERLINE,                                      X05360000
               PICOUT='X'                                               05370000
*                                                                       05380000
        DFHMDF POS=(11,04),                                            X05390000
               LENGTH=00,                                              X05400000
               ATTRB=(ASKIP,BRT)                                        05410000
*                                                                       05420000
AACT06  DFHMDF POS=(11,05),                                            X05430000
               LENGTH=03,                                              X05450000
               ATTRB=(ASKIP,BRT)                                        05460000
*                                                                       05470000
APO06   DFHMDF POS=(11,09),                                            X05480000
               COLOR=BLUE,                                             X05481000
               LENGTH=08,                                              X05490000
               ATTRB=(ASKIP,BRT),                                      X05500000
               PICOUT='99999999'                                        05510000
*                                                                       05520000
ATYP06  DFHMDF POS=(11,18),                                            X05530000
               COLOR=BLUE,                                             X05531000
               LENGTH=01,                                              X05540000
               ATTRB=(ASKIP,BRT),                                      X05550000
               PICOUT='X'                                               05560000
*                                                                       05570000
ASTAT06 DFHMDF POS=(11,21),                                            X05580000
               COLOR=BLUE,                                             X05581000
               LENGTH=01,                                              X05590000
               ATTRB=(ASKIP,BRT),                                      X05600000
               PICOUT='X'                                               05610000
*                                                                       05620000
ANTIX06 DFHMDF POS=(11,23),                                            X05630000
               COLOR=BLUE,                                             X05631000
               LENGTH=08,                                              X05640000
               ATTRB=(ASKIP,BRT),                                      X05650000
               PICOUT='9999,999'                                        05660000
*                                                                       05670000
AVNME06 DFHMDF POS=(11,33),                                            X05680000
               COLOR=BLUE,                                             X05681000
               LENGTH=16,                                              X05690000
               ATTRB=(ASKIP,BRT),                                      X05700000
               PICOUT='XXXXXXXXXXXXXXXX'                                05710000
*                                                                       05720000
ARDTE06 DFHMDF POS=(11,51),                                            X05730000
               COLOR=BLUE,                                             X05731000
               LENGTH=05,                                              X05740000
               ATTRB=(ASKIP,BRT),                                      X05750000
               PICOUT='XXXXX'                                           05760000
*                                                                       05770000
AVDDT06 DFHMDF POS=(11,58),                                            X05780000
               COLOR=BLUE,                                             X05781000
               LENGTH=05,                                              X05790000
               ATTRB=(ASKIP,BRT),                                      X05800000
               PICOUT='XXXXX'                                           05810000
*                                                                       05820000
APDDT06 DFHMDF POS=(11,65),                                            X05830000
               COLOR=BLUE,                                             X05831000
               LENGTH=05,                                              X05840000
               ATTRB=(ASKIP,BRT),                                      X05850000
               PICOUT='XXXXX'                                           05860000
*                                                                       05870000
APRTY06 DFHMDF POS=(11,72),                                            X05880000
               COLOR=BLUE,                                             X05881000
               LENGTH=02,                                              X05890000
               ATTRB=(ASKIP,BRT),                                      X05900000
               PICOUT='99'                                              05910000
*                                                                       05920000
ALNES06 DFHMDF POS=(11,75),                                            X05930000
               COLOR=BLUE,                                             X05931000
               LENGTH=04,                                              X05940000
               ATTRB=(ASKIP,BRT),                                      X05950000
               PICOUT='ZZZ9'                                            05960000
*                                                                       05961000
        DFHMDF POS=(11,80),                                            X05962000
               LENGTH=00,                                              X05963000
               ATTRB=(ASKIP,BRT)                                        05964000
*                                                                       05970000
*********************************************************************** 05980000
ASEL07  DFHMDF POS=(12,02),                                            X05990000
               LENGTH=01,                                              X06000000
               ATTRB=UNPROT,                                           X06010000
               HILIGHT=UNDERLINE,                                      X06020000
               PICOUT='X'                                               06030000
*                                                                       06040000
        DFHMDF POS=(12,04),                                            X06050000
               LENGTH=00,                                              X06060000
               ATTRB=(ASKIP,BRT)                                        06070000
*                                                                       06080000
AACT07  DFHMDF POS=(12,05),                                            X06090000
               LENGTH=03,                                              X06100000
               ATTRB=(ASKIP,BRT)                                        06110000
*                                                                       06120000
APO07   DFHMDF POS=(12,09),                                            X06130000
               COLOR=BLUE,                                             X06131000
               LENGTH=08,                                              X06140000
               ATTRB=(ASKIP,BRT),                                      X06150000
               PICOUT='99999999'                                        06160000
*                                                                       06170000
ATYP07  DFHMDF POS=(12,18),                                            X06180000
               COLOR=BLUE,                                             X06181000
               LENGTH=01,                                              X06190000
               ATTRB=(ASKIP,BRT),                                      X06200000
               PICOUT='X'                                               06210000
*                                                                       06220000
ASTAT07 DFHMDF POS=(12,21),                                            X06230000
               COLOR=BLUE,                                             X06231000
               LENGTH=01,                                              X06240000
               ATTRB=(ASKIP,BRT),                                      X06250000
               PICOUT='X'                                               06260000
*                                                                       06270000
ANTIX07 DFHMDF POS=(12,23),                                            X06280000
               COLOR=BLUE,                                             X06281000
               LENGTH=08,                                              X06290000
               ATTRB=(ASKIP,BRT),                                      X06300000
               PICOUT='9999,999'                                        06310000
*                                                                       06320000
AVNME07 DFHMDF POS=(12,33),                                            X06330000
               COLOR=BLUE,                                             X06331000
               LENGTH=16,                                              X06340000
               ATTRB=(ASKIP,BRT),                                      X06350000
               PICOUT='XXXXXXXXXXXXXXXX'                                06360000
*                                                                       06370000
ARDTE07 DFHMDF POS=(12,51),                                            X06380000
               COLOR=BLUE,                                             X06381000
               LENGTH=05,                                              X06390000
               ATTRB=(ASKIP,BRT),                                      X06400000
               PICOUT='XXXXX'                                           06410000
*                                                                       06420000
AVDDT07 DFHMDF POS=(12,58),                                            X06430000
               COLOR=BLUE,                                             X06431000
               LENGTH=05,                                              X06440000
               ATTRB=(ASKIP,BRT),                                      X06450000
               PICOUT='XXXXX'                                           06460000
*                                                                       06470000
APDDT07 DFHMDF POS=(12,65),                                            X06480000
               COLOR=BLUE,                                             X06481000
               LENGTH=05,                                              X06490000
               ATTRB=(ASKIP,BRT),                                      X06500000
               PICOUT='XXXXX'                                           06510000
*                                                                       06520000
APRTY07 DFHMDF POS=(12,72),                                            X06530000
               COLOR=BLUE,                                             X06531000
               LENGTH=02,                                              X06540000
               ATTRB=(ASKIP,BRT),                                      X06550000
               PICOUT='99'                                              06560000
*                                                                       06570000
ALNES07 DFHMDF POS=(12,75),                                            X06580000
               COLOR=BLUE,                                             X06581000
               LENGTH=04,                                              X06590000
               ATTRB=(ASKIP,BRT),                                      X06600000
               PICOUT='ZZZ9'                                            06610000
*                                                                       06611000
        DFHMDF POS=(12,80),                                            X06612000
               LENGTH=00,                                              X06613000
               ATTRB=(ASKIP,BRT)                                        06614000
*                                                                       06620000
*********************************************************************** 06630000
ASEL08  DFHMDF POS=(13,02),                                            X06640000
               LENGTH=01,                                              X06650000
               ATTRB=UNPROT,                                           X06660000
               HILIGHT=UNDERLINE,                                      X06670000
               PICOUT='X'                                               06680000
*                                                                       06690000
        DFHMDF POS=(13,04),                                            X06700000
               LENGTH=00,                                              X06710000
               ATTRB=(ASKIP,BRT)                                        06720000
*                                                                       06730000
AACT08  DFHMDF POS=(13,05),                                            X06740000
               LENGTH=03,                                              X06750000
               ATTRB=(ASKIP,BRT)                                        06760000
*                                                                       06770000
APO08   DFHMDF POS=(13,09),                                            X06780000
               COLOR=BLUE,                                             X06781000
               LENGTH=08,                                              X06790000
               ATTRB=(ASKIP,BRT),                                      X06800000
               PICOUT='99999999'                                        06810000
*                                                                       06820000
ATYP08  DFHMDF POS=(13,18),                                            X06830000
               COLOR=BLUE,                                             X06831000
               LENGTH=01,                                              X06840000
               ATTRB=(ASKIP,BRT),                                      X06850000
               PICOUT='X'                                               06860000
*                                                                       06870000
ASTAT08 DFHMDF POS=(13,21),                                            X06880000
               COLOR=BLUE,                                             X06881000
               LENGTH=01,                                              X06890000
               ATTRB=(ASKIP,BRT),                                      X06900000
               PICOUT='X'                                               06910000
*                                                                       06920000
ANTIX08 DFHMDF POS=(13,23),                                            X06930000
               COLOR=BLUE,                                             X06931000
               LENGTH=08,                                              X06940000
               ATTRB=(ASKIP,BRT),                                      X06950000
               PICOUT='9999,999'                                        06960000
*                                                                       06970000
AVNME08 DFHMDF POS=(13,33),                                            X06980000
               COLOR=BLUE,                                             X06981000
               LENGTH=16,                                              X06990000
               ATTRB=(ASKIP,BRT),                                      X07000000
               PICOUT='XXXXXXXXXXXXXXXX'                                07010000
*                                                                       07020000
ARDTE08 DFHMDF POS=(13,51),                                            X07030000
               COLOR=BLUE,                                             X07031000
               LENGTH=05,                                              X07040000
               ATTRB=(ASKIP,BRT),                                      X07050000
               PICOUT='XXXXX'                                           07060000
*                                                                       07070000
AVDDT08 DFHMDF POS=(13,58),                                            X07080000
               COLOR=BLUE,                                             X07081000
               LENGTH=05,                                              X07090000
               ATTRB=(ASKIP,BRT),                                      X07100000
               PICOUT='XXXXX'                                           07110000
*                                                                       07120000
APDDT08 DFHMDF POS=(13,65),                                            X07130000
               COLOR=BLUE,                                             X07131000
               LENGTH=05,                                              X07140000
               ATTRB=(ASKIP,BRT),                                      X07150000
               PICOUT='XXXXX'                                           07160000
*                                                                       07170000
APRTY08 DFHMDF POS=(13,72),                                            X07180000
               COLOR=BLUE,                                             X07181000
               LENGTH=02,                                              X07190000
               ATTRB=(ASKIP,BRT),                                      X07200000
               PICOUT='99'                                              07210000
*                                                                       07220000
ALNES08 DFHMDF POS=(13,75),                                            X07230000
               COLOR=BLUE,                                             X07231000
               LENGTH=04,                                              X07240000
               ATTRB=(ASKIP,BRT),                                      X07250000
               PICOUT='ZZZ9'                                            07260000
*                                                                       07261000
        DFHMDF POS=(13,80),                                            X07262000
               LENGTH=00,                                              X07263000
               ATTRB=(ASKIP,BRT)                                        07264000
*                                                                       07270000
*********************************************************************** 07280000
ASEL09  DFHMDF POS=(14,02),                                            X07290000
               LENGTH=01,                                              X07300000
               ATTRB=UNPROT,                                           X07310000
               HILIGHT=UNDERLINE,                                      X07320000
               PICOUT='X'                                               07330000
*                                                                       07340000
        DFHMDF POS=(14,04),                                            X07350000
               LENGTH=00,                                              X07360000
               ATTRB=(ASKIP,BRT)                                        07370000
*                                                                       07380000
AACT09  DFHMDF POS=(14,05),                                            X07390000
               LENGTH=03,                                              X07400000
               ATTRB=(ASKIP,BRT)                                        07410000
*                                                                       07420000
APO09   DFHMDF POS=(14,09),                                            X07430000
               COLOR=BLUE,                                             X07431000
               LENGTH=08,                                              X07440000
               ATTRB=(ASKIP,BRT),                                      X07450000
               PICOUT='99999999'                                        07460000
*                                                                       07470000
ATYP09  DFHMDF POS=(14,18),                                            X07480000
               COLOR=BLUE,                                             X07481000
               LENGTH=01,                                              X07490000
               ATTRB=(ASKIP,BRT),                                      X07500000
               PICOUT='X'                                               07510000
*                                                                       07520000
ASTAT09 DFHMDF POS=(14,21),                                            X07530000
               COLOR=BLUE,                                             X07531000
               LENGTH=01,                                              X07540000
               ATTRB=(ASKIP,BRT),                                      X07550000
               PICOUT='X'                                               07560000
*                                                                       07570000
ANTIX09 DFHMDF POS=(14,23),                                            X07580000
               COLOR=BLUE,                                             X07581000
               LENGTH=08,                                              X07590000
               ATTRB=(ASKIP,BRT),                                      X07600000
               PICOUT='9999,999'                                        07610000
*                                                                       07620000
AVNME09 DFHMDF POS=(14,33),                                            X07630000
               COLOR=BLUE,                                             X07631000
               LENGTH=16,                                              X07640000
               ATTRB=(ASKIP,BRT),                                      X07650000
               PICOUT='XXXXXXXXXXXXXXXX'                                07660000
*                                                                       07670000
ARDTE09 DFHMDF POS=(14,51),                                            X07680000
               COLOR=BLUE,                                             X07681000
               LENGTH=05,                                              X07690000
               ATTRB=(ASKIP,BRT),                                      X07700000
               PICOUT='XXXXX'                                           07710000
*                                                                       07720000
AVDDT09 DFHMDF POS=(14,58),                                            X07730000
               COLOR=BLUE,                                             X07731000
               LENGTH=05,                                              X07740000
               ATTRB=(ASKIP,BRT),                                      X07750000
               PICOUT='XXXXX'                                           07760000
*                                                                       07770000
APDDT09 DFHMDF POS=(14,65),                                            X07780000
               COLOR=BLUE,                                             X07781000
               LENGTH=05,                                              X07790000
               ATTRB=(ASKIP,BRT),                                      X07800000
               PICOUT='XXXXX'                                           07810000
*                                                                       07820000
APRTY09 DFHMDF POS=(14,72),                                            X07830000
               COLOR=BLUE,                                             X07831000
               LENGTH=02,                                              X07840000
               ATTRB=(ASKIP,BRT),                                      X07850000
               PICOUT='99'                                              07860000
*                                                                       07870000
ALNES09 DFHMDF POS=(14,75),                                            X07880000
               COLOR=BLUE,                                             X07881000
               LENGTH=04,                                              X07890000
               ATTRB=(ASKIP,BRT),                                      X07900000
               PICOUT='ZZZ9'                                            07910000
*                                                                       07911000
        DFHMDF POS=(14,80),                                            X07912000
               LENGTH=00,                                              X07913000
               ATTRB=(ASKIP,BRT)                                        07914000
*                                                                       07920000
*********************************************************************** 07930000
ASEL10  DFHMDF POS=(15,02),                                            X07940000
               LENGTH=01,                                              X07950000
               ATTRB=UNPROT,                                           X07960000
               HILIGHT=UNDERLINE,                                      X07970000
               PICOUT='X'                                               07980000
*                                                                       07990000
        DFHMDF POS=(15,04),                                            X08000000
               LENGTH=00,                                              X08010000
               ATTRB=(ASKIP,BRT)                                        08020000
*                                                                       08030000
AACT10  DFHMDF POS=(15,05),                                            X08040000
               LENGTH=03,                                              X08050000
               ATTRB=(ASKIP,BRT)                                        08060000
*                                                                       08070000
APO10   DFHMDF POS=(15,09),                                            X08080000
               COLOR=BLUE,                                             X08081000
               LENGTH=08,                                              X08090000
               ATTRB=(ASKIP,BRT),                                      X08100000
               PICOUT='99999999'                                        08110000
*                                                                       08120000
ATYP10  DFHMDF POS=(15,18),                                            X08130000
               COLOR=BLUE,                                             X08131000
               LENGTH=01,                                              X08140000
               ATTRB=(ASKIP,BRT),                                      X08150000
               PICOUT='X'                                               08160000
*                                                                       08170000
ASTAT10 DFHMDF POS=(15,21),                                            X08180000
               COLOR=BLUE,                                             X08181000
               LENGTH=01,                                              X08190000
               ATTRB=(ASKIP,BRT),                                      X08200000
               PICOUT='X'                                               08210000
*                                                                       08220000
ANTIX10 DFHMDF POS=(15,23),                                            X08230000
               COLOR=BLUE,                                             X08231000
               LENGTH=08,                                              X08240000
               ATTRB=(ASKIP,BRT),                                      X08250000
               PICOUT='9999,999'                                        08260000
*                                                                       08270000
AVNME10 DFHMDF POS=(15,33),                                            X08280000
               COLOR=BLUE,                                             X08281000
               LENGTH=16,                                              X08290000
               ATTRB=(ASKIP,BRT),                                      X08300000
               PICOUT='XXXXXXXXXXXXXXXX'                                08310000
*                                                                       08320000
ARDTE10 DFHMDF POS=(15,51),                                            X08330000
               COLOR=BLUE,                                             X08331000
               LENGTH=05,                                              X08340000
               ATTRB=(ASKIP,BRT),                                      X08350000
               PICOUT='XXXXX'                                           08360000
*                                                                       08370000
AVDDT10 DFHMDF POS=(15,58),                                            X08380000
               COLOR=BLUE,                                             X08381000
               LENGTH=05,                                              X08390000
               ATTRB=(ASKIP,BRT),                                      X08400000
               PICOUT='XXXXX'                                           08410000
*                                                                       08420000
APDDT10 DFHMDF POS=(15,65),                                            X08430000
               COLOR=BLUE,                                             X08431000
               LENGTH=05,                                              X08440000
               ATTRB=(ASKIP,BRT),                                      X08450000
               PICOUT='XXXXX'                                           08460000
*                                                                       08470000
APRTY10 DFHMDF POS=(15,72),                                            X08480000
               COLOR=BLUE,                                             X08481000
               LENGTH=02,                                              X08490000
               ATTRB=(ASKIP,BRT),                                      X08500000
               PICOUT='99'                                              08510000
*                                                                       08520000
ALNES10 DFHMDF POS=(15,75),                                            X08530000
               COLOR=BLUE,                                             X08531000
               LENGTH=04,                                              X08540000
               ATTRB=(ASKIP,BRT),                                      X08550000
               PICOUT='ZZZ9'                                            08560000
*                                                                       08561000
        DFHMDF POS=(15,80),                                            X08562000
               LENGTH=00,                                              X08563000
               ATTRB=(ASKIP,BRT)                                        08564000
*                                                                       08570000
*********************************************************************** 08580000
ASEL11  DFHMDF POS=(16,02),                                            X08590000
               LENGTH=01,                                              X08600000
               ATTRB=UNPROT,                                           X08610000
               HILIGHT=UNDERLINE,                                      X08620000
               PICOUT='X'                                               08630000
*                                                                       08640000
        DFHMDF POS=(16,04),                                            X08650000
               LENGTH=00,                                              X08660000
               ATTRB=(ASKIP,BRT)                                        08670000
*                                                                       08680000
AACT11  DFHMDF POS=(16,05),                                            X08690000
               LENGTH=03,                                              X08700000
               ATTRB=(ASKIP,BRT)                                        08710000
*                                                                       08720000
APO11   DFHMDF POS=(16,09),                                            X08730000
               COLOR=BLUE,                                             X08731000
               LENGTH=08,                                              X08740000
               ATTRB=(ASKIP,BRT),                                      X08750000
               PICOUT='99999999'                                        08760000
*                                                                       08770000
ATYP11  DFHMDF POS=(16,18),                                            X08780000
               COLOR=BLUE,                                             X08781000
               LENGTH=01,                                              X08790000
               ATTRB=(ASKIP,BRT),                                      X08800000
               PICOUT='X'                                               08810000
*                                                                       08820000
ASTAT11 DFHMDF POS=(16,21),                                            X08830000
               COLOR=BLUE,                                             X08831000
               LENGTH=01,                                              X08840000
               ATTRB=(ASKIP,BRT),                                      X08850000
               PICOUT='X'                                               08860000
*                                                                       08870000
ANTIX11 DFHMDF POS=(16,23),                                            X08880000
               COLOR=BLUE,                                             X08881000
               LENGTH=08,                                              X08890000
               ATTRB=(ASKIP,BRT),                                      X08900000
               PICOUT='9999,999'                                        08910000
*                                                                       08920000
AVNME11 DFHMDF POS=(16,33),                                            X08930000
               COLOR=BLUE,                                             X08931000
               LENGTH=16,                                              X08940000
               ATTRB=(ASKIP,BRT),                                      X08950000
               PICOUT='XXXXXXXXXXXXXXXX'                                08960000
*                                                                       08970000
ARDTE11 DFHMDF POS=(16,51),                                            X08980000
               COLOR=BLUE,                                             X08981000
               LENGTH=05,                                              X08990000
               ATTRB=(ASKIP,BRT),                                      X09000000
               PICOUT='XXXXX'                                           09010000
*                                                                       09020000
AVDDT11 DFHMDF POS=(16,58),                                            X09030000
               COLOR=BLUE,                                             X09031000
               LENGTH=05,                                              X09040000
               ATTRB=(ASKIP,BRT),                                      X09050000
               PICOUT='XXXXX'                                           09060000
*                                                                       09070000
APDDT11 DFHMDF POS=(16,65),                                            X09080000
               COLOR=BLUE,                                             X09081000
               LENGTH=05,                                              X09090000
               ATTRB=(ASKIP,BRT),                                      X09100000
               PICOUT='XXXXX'                                           09110000
*                                                                       09120000
APRTY11 DFHMDF POS=(16,72),                                            X09130000
               COLOR=BLUE,                                             X09131000
               LENGTH=02,                                              X09140000
               ATTRB=(ASKIP,BRT),                                      X09150000
               PICOUT='99'                                              09160000
*                                                                       09170000
ALNES11 DFHMDF POS=(16,75),                                            X09180000
               COLOR=BLUE,                                             X09181000
               LENGTH=04,                                              X09190000
               ATTRB=(ASKIP,BRT),                                      X09200000
               PICOUT='ZZZ9'                                            09210000
*                                                                       09211000
        DFHMDF POS=(16,80),                                            X09212000
               LENGTH=00,                                              X09213000
               ATTRB=(ASKIP,BRT)                                        09214000
*                                                                       09220000
*********************************************************************** 09230000
ASEL12  DFHMDF POS=(17,02),                                            X09240000
               LENGTH=01,                                              X09250000
               ATTRB=UNPROT,                                           X09260000
               HILIGHT=UNDERLINE,                                      X09270000
               PICOUT='X'                                               09280000
*                                                                       09290000
        DFHMDF POS=(17,04),                                            X09300000
               LENGTH=00,                                              X09310000
               ATTRB=(ASKIP,BRT)                                        09320000
*                                                                       09330000
AACT12  DFHMDF POS=(17,05),                                            X09340000
               LENGTH=03,                                              X09350000
               ATTRB=(ASKIP,BRT)                                        09360000
*                                                                       09370000
APO12   DFHMDF POS=(17,09),                                            X09380000
               COLOR=BLUE,                                             X09381000
               LENGTH=08,                                              X09390000
               ATTRB=(ASKIP,BRT),                                      X09400000
               PICOUT='99999999'                                        09410000
*                                                                       09420000
ATYP12  DFHMDF POS=(17,18),                                            X09430000
               COLOR=BLUE,                                             X09431000
               LENGTH=01,                                              X09440000
               ATTRB=(ASKIP,BRT),                                      X09450000
               PICOUT='X'                                               09460000
*                                                                       09470000
ASTAT12 DFHMDF POS=(17,21),                                            X09480000
               COLOR=BLUE,                                             X09481000
               LENGTH=01,                                              X09490000
               ATTRB=(ASKIP,BRT),                                      X09500000
               PICOUT='X'                                               09510000
*                                                                       09520000
ANTIX12 DFHMDF POS=(17,23),                                            X09530000
               COLOR=BLUE,                                             X09531000
               LENGTH=08,                                              X09540000
               ATTRB=(ASKIP,BRT),                                      X09550000
               PICOUT='9999,999'                                        09560000
*                                                                       09570000
AVNME12 DFHMDF POS=(17,33),                                            X09580000
               COLOR=BLUE,                                             X09581000
               LENGTH=16,                                              X09590000
               ATTRB=(ASKIP,BRT),                                      X09600000
               PICOUT='XXXXXXXXXXXXXXXX'                                09610000
*                                                                       09620000
ARDTE12 DFHMDF POS=(17,51),                                            X09630000
               COLOR=BLUE,                                             X09631000
               LENGTH=05,                                              X09640000
               ATTRB=(ASKIP,BRT),                                      X09650000
               PICOUT='XXXXX'                                           09660000
*                                                                       09670000
AVDDT12 DFHMDF POS=(17,58),                                            X09680000
               COLOR=BLUE,                                             X09681000
               LENGTH=05,                                              X09690000
               ATTRB=(ASKIP,BRT),                                      X09700000
               PICOUT='XXXXX'                                           09710000
*                                                                       09720000
APDDT12 DFHMDF POS=(17,65),                                            X09730000
               COLOR=BLUE,                                             X09731000
               LENGTH=05,                                              X09740000
               ATTRB=(ASKIP,BRT),                                      X09750000
               PICOUT='XXXXX'                                           09760000
*                                                                       09770000
APRTY12 DFHMDF POS=(17,72),                                            X09780000
               COLOR=BLUE,                                             X09781000
               LENGTH=02,                                              X09790000
               ATTRB=(ASKIP,BRT),                                      X09800000
               PICOUT='99'                                              09810000
*                                                                       09820000
ALNES12 DFHMDF POS=(17,75),                                            X09830000
               COLOR=BLUE,                                             X09831000
               LENGTH=04,                                              X09840000
               ATTRB=(ASKIP,BRT),                                      X09850000
               PICOUT='ZZZ9'                                            09860000
*                                                                       09861000
        DFHMDF POS=(17,80),                                            X09862000
               LENGTH=00,                                              X09863000
               ATTRB=(ASKIP,BRT)                                        09864000
*                                                                       09870000
*********************************************************************** 09880000
ASEL13  DFHMDF POS=(18,02),                                            X09890000
               LENGTH=01,                                              X09900000
               ATTRB=UNPROT,                                           X09910000
               HILIGHT=UNDERLINE,                                      X09920000
               PICOUT='X'                                               09930000
*                                                                       09940000
        DFHMDF POS=(18,04),                                            X09950000
               LENGTH=00,                                              X09960000
               ATTRB=(ASKIP,BRT)                                        09970000
*                                                                       09980000
AACT13  DFHMDF POS=(18,05),                                            X09990000
               LENGTH=03,                                              X10000000
               ATTRB=(ASKIP,BRT)                                        10010000
*                                                                       10020000
APO13   DFHMDF POS=(18,09),                                            X10030000
               COLOR=BLUE,                                             X10031000
               LENGTH=08,                                              X10040000
               ATTRB=(ASKIP,BRT),                                      X10050000
               PICOUT='99999999'                                        10060000
*                                                                       10070000
ATYP13  DFHMDF POS=(18,18),                                            X10080000
               COLOR=BLUE,                                             X10081000
               LENGTH=01,                                              X10090000
               ATTRB=(ASKIP,BRT),                                      X10100000
               PICOUT='X'                                               10110000
*                                                                       10120000
ASTAT13 DFHMDF POS=(18,21),                                            X10130000
               COLOR=BLUE,                                             X10131000
               LENGTH=01,                                              X10140000
               ATTRB=(ASKIP,BRT),                                      X10150000
               PICOUT='X'                                               10160000
*                                                                       10170000
ANTIX13 DFHMDF POS=(18,23),                                            X10180000
               COLOR=BLUE,                                             X10181000
               LENGTH=08,                                              X10190000
               ATTRB=(ASKIP,BRT),                                      X10200000
               PICOUT='9999,999'                                        10210000
*                                                                       10220000
AVNME13 DFHMDF POS=(18,33),                                            X10230000
               COLOR=BLUE,                                             X10231000
               LENGTH=16,                                              X10240000
               ATTRB=(ASKIP,BRT),                                      X10250000
               PICOUT='XXXXXXXXXXXXXXXX'                                10260000
*                                                                       10270000
ARDTE13 DFHMDF POS=(18,51),                                            X10280000
               COLOR=BLUE,                                             X10281000
               LENGTH=05,                                              X10290000
               ATTRB=(ASKIP,BRT),                                      X10300000
               PICOUT='XXXXX'                                           10310000
*                                                                       10320000
AVDDT13 DFHMDF POS=(18,58),                                            X10330000
               COLOR=BLUE,                                             X10331000
               LENGTH=05,                                              X10340000
               ATTRB=(ASKIP,BRT),                                      X10350000
               PICOUT='XXXXX'                                           10360000
*                                                                       10370000
APDDT13 DFHMDF POS=(18,65),                                            X10380000
               COLOR=BLUE,                                             X10381000
               LENGTH=05,                                              X10390000
               ATTRB=(ASKIP,BRT),                                      X10400000
               PICOUT='XXXXX'                                           10410000
*                                                                       10420000
APRTY13 DFHMDF POS=(18,72),                                            X10430000
               COLOR=BLUE,                                             X10431000
               LENGTH=02,                                              X10440000
               ATTRB=(ASKIP,BRT),                                      X10450000
               PICOUT='99'                                              10460000
*                                                                       10470000
ALNES13 DFHMDF POS=(18,75),                                            X10480000
               COLOR=BLUE,                                             X10481000
               LENGTH=04,                                              X10490000
               ATTRB=(ASKIP,BRT),                                      X10500000
               PICOUT='ZZZ9'                                            10510000
*                                                                       10511000
        DFHMDF POS=(18,80),                                            X10512000
               LENGTH=00,                                              X10513000
               ATTRB=(ASKIP,BRT)                                        10514000
*                                                                       10520000
*********************************************************************** 10530000
        DFHMDF POS=(19,44),                                            X10540000
               LENGTH=25,                                              X10550000
               ATTRB=(ASKIP,BRT),                                      X10560000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      10570000
*                                                                       10580000
ASELIT  DFHMDF POS=(19,74),                                            X10590000
               LENGTH=05,                                              X10600000
               ATTRB=(ASKIP,BRT),                                      X10610000
               PICOUT='99999'                                           10620000
*********************************************************************** 10630000
        DFHMSD TYPE=FINAL                                               10640000
        PRINT NOGEN                                                     10650000
        END                                                             10660000
