        PRINT NOGEN                                                     00010001
VLKM587 DFHMSD TYPE=MAP,                                               X00020007
               MODE=INOUT,                                             X00030001
               LANG=COBOL,                                             X00040001
               TIOAPFX=YES                                              00050001
VL587A  DFHMDI SIZE=(19,80),                                           X00060007
               CTRL=(FREEKB,FRSET),                                    X00070001
               LINE=2,COLUMN=1,                                        X00080001
               MAPATTS=(COLOR,HILIGHT),                                X00090001
               DSATTS=(COLOR,HILIGHT)                                   00100001
*********************************************************************** 00110001
        DFHMDF POS=(01,02),                                            X00120005
               LENGTH=18,                                              X00130001
               ATTRB=(ASKIP,BRT),                                      X00140001
               INITIAL='PURCHASE ORDER ..:'                             00150001
*                                                                       00150101
APONBR  DFHMDF POS=(01,21),                                            X00150205
               LENGTH=09,                                              X00150301
               ATTRB=ASKIP,                                            X00150401
               PICOUT='999999999'                                       00150601
*                                                                       00151001
        DFHMDF POS=(01,42),                                            X00151105
               LENGTH=20,                                              X00151201
               ATTRB=(ASKIP,BRT),                                      X00151301
               INITIAL='REQUEST STATUS ....:'                           00151401
ARSTAT  DFHMDF POS=(01,63),                                            X00151605
               LENGTH=01,                                              X00151701
               ATTRB=ASKIP,                                            X00151801
               PICOUT='X'                                               00151901
ARSDESC DFHMDF POS=(01,65),                                            X00152005
               LENGTH=10,                                              X00152103
               ATTRB=ASKIP,                                            X00152203
               PICOUT='XXXXXXXXXX'                                      00152303
*********************************************************************** 00152401
        DFHMDF POS=(02,02),                                            X00152505
               LENGTH=18,                                              X00152601
               ATTRB=(ASKIP,BRT),                                      X00152701
               INITIAL='REQUEST DATE ....:'                             00152801
ARDATE  DFHMDF POS=(02,21),                                            X00152905
               LENGTH=10,                                              X00153001
               ATTRB=ASKIP,                                            X00153101
               PICOUT='XXXXXXXXXX'                                      00153201
*                                                                       00153301
        DFHMDF POS=(02,42),                                            X00153405
               LENGTH=20,                                              X00153501
               ATTRB=(ASKIP,BRT),                                      X00153601
               INITIAL='PRINT DATE ........:'                           00153703
APDATE  DFHMDF POS=(02,63),                                            X00153805
               LENGTH=10,                                              X00153901
               ATTRB=ASKIP,                                            X00154001
               PICOUT='XXXXXXXXXX'                                      00154101
*********************************************************************** 00154201
        DFHMDF POS=(03,02),                                            X00154305
               LENGTH=18,                                              X00154401
               ATTRB=(ASKIP,BRT),                                      X00154501
               INITIAL='VENDOR DUE DATE .:'                             00154603
AVDDATE DFHMDF POS=(03,21),                                            X00154705
               LENGTH=10,                                              X00154801
               ATTRB=ASKIP,                                            X00154901
               PICOUT='XXXXXXXXXX'                                      00155001
*                                                                       00155103
        DFHMDF POS=(03,42),                                            X00155205
               LENGTH=20,                                              X00155303
               ATTRB=(ASKIP,BRT),                                      X00155403
               INITIAL='REQUESTED TICKETS .:'                           00155503
ARQTIX  DFHMDF POS=(03,63),                                            X00155605
               LENGTH=09,                                              X00155703
               ATTRB=ASKIP,                                            X00155803
               PICOUT='ZZZZZZZZ9'                                       00155906
*********************************************************************** 00156801
        DFHMDF POS=(04,02),                                            X00156905
               LENGTH=18,                                              X00157001
               ATTRB=(ASKIP,BRT),                                      X00157101
               INITIAL='VENDOR NAME .....:'                             00157205
AVNDNME DFHMDF POS=(04,21),                                            X00157305
               LENGTH=40,                                              X00157401
               ATTRB=ASKIP                                              00157501
*********************************************************************** 00157605
        DFHMDF POS=(05,02),                                            X00157705
               LENGTH=18,                                              X00157805
               ATTRB=(ASKIP,BRT),                                      X00157905
               INITIAL='SHIPPING ADDRESS.:'                             00158005
AADDR1  DFHMDF POS=(05,21),                                            X00158105
               LENGTH=40,                                              X00158205
               ATTRB=ASKIP                                              00158305
*********************************************************************** 00158401
AADDR2  DFHMDF POS=(06,21),                                            X00158505
               LENGTH=40,                                              X00158601
               ATTRB=ASKIP                                              00158701
*********************************************************************** 00158801
AADDR3  DFHMDF POS=(07,21),                                            X00158905
               LENGTH=40,                                              X00159001
               ATTRB=ASKIP                                              00159101
*********************************************************************** 00159201
AADDR4  DFHMDF POS=(08,21),                                            X00159305
               LENGTH=40,                                              X00159401
               ATTRB=ASKIP                                              00159501
*********************************************************************** 00159601
AADDR5  DFHMDF POS=(09,21),                                            X00159705
               LENGTH=40,                                              X00159801
               ATTRB=ASKIP                                              00159901
*********************************************************************** 00160003
AADDR6  DFHMDF POS=(10,21),                                            X00160105
               LENGTH=40,                                              X00160203
               ATTRB=ASKIP                                              00160303
*********************************************************************** 00160403
AADDR7  DFHMDF POS=(11,21),                                            X00160505
               LENGTH=40,                                              X00160603
               ATTRB=ASKIP                                              00160703
*********************************************************************** 00160805
AADDR8  DFHMDF POS=(12,21),                                            X00160905
               LENGTH=40,                                              X00161005
               ATTRB=ASKIP                                              00161105
*********************************************************************** 00161201
        DFHMDF POS=(13,02),                                            X00161303
               LENGTH=19,                                              X00161403
               ATTRB=(ASKIP,BRT),                                      X00161501
               INITIAL='SHIPPING INFO.....:'                            00161603
*                                                                       00161701
        DFHMDF POS=(13,41),                                            X00161803
               LENGTH=10,                                              X00161903
               ATTRB=(ASKIP,BRT),                                      X00162003
               INITIAL='SHIPMENTS:'                                     00162103
*                                                                       00162203
ASTRTIT DFHMDF POS=(13,53),                                            X00162303
               LENGTH=05,                                              X00162403
               ATTRB=UNPROT,                                           X00162503
               HILIGHT=UNDERLINE,                                      X00162603
               PICOUT='ZZZZ9'                                           00162703
        DFHMDF POS=(13,59),                                            X00162803
               LENGTH=01,                                              X00162903
               ATTRB=ASKIP                                              00163003
*                                                                       00163103
        DFHMDF POS=(13,61),                                            X00163203
               LENGTH=02,                                              X00163303
               ATTRB=(ASKIP,BRT),                                      X00163403
               INITIAL='TO'                                             00163503
*                                                                       00163603
AENDIT  DFHMDF POS=(13,64),                                            X00163703
               LENGTH=05,                                              X00163803
               ATTRB=(ASKIP,BRT),                                      X00163903
               PICOUT='ZZZZ9'                                           00164003
*                                                                       00164103
        DFHMDF POS=(13,70),                                            X00164203
               LENGTH=02,                                              X00164303
               ATTRB=(ASKIP,BRT),                                      X00164403
               INITIAL='OF'                                             00164503
*                                                                       00164603
ATOTIT  DFHMDF POS=(13,75),                                            X00164703
               LENGTH=05,                                              X00164803
               ATTRB=(ASKIP,BRT),                                      X00164903
               PICOUT='ZZZZ9'                                           00165003
*********************************************************************** 00165103
        DFHMDF POS=(14,08),                                            X00165203
               LENGTH=07,                                              X00165301
               ATTRB=(ASKIP,BRT),                                      X00165401
               INITIAL='CARRIER'                                        00165501
*                                                                       00165603
        DFHMDF POS=(14,23),                                            X00165703
               LENGTH=12,                                              X00165803
               ATTRB=(ASKIP,BRT),                                      X00165903
               INITIAL='DATE SHIPPED'                                   00166003
*                                                                       00166103
        DFHMDF POS=(14,39),                                            X00166203
               LENGTH=06,                                              X00166303
               ATTRB=(ASKIP,BRT),                                      X00166401
               INITIAL='METHOD'                                         00166503
*                                                                       00166601
        DFHMDF POS=(14,49),                                            X00166703
               LENGTH=23,                                              X00166803
               ATTRB=(ASKIP,BRT),                                      X00166901
               INITIAL='CARRIER SHIPPING NUMBER'                        00167003
*********************************************************************** 00168001
ACARNM1 DFHMDF POS=(15,02),                                            X00172303
               LENGTH=20,                                              X00172403
               ATTRB=ASKIP                                              00172501
*                                                                       00172601
ASDATE1 DFHMDF POS=(15,24),                                            X01791003
               LENGTH=10,                                              X01792003
               ATTRB=ASKIP                                              01793001
*                                                                       01793101
AMTHOD1 DFHMDF POS=(15,37),                                            X01793203
               LENGTH=10,                                              X01793301
               ATTRB=ASKIP                                              01793401
*                                                                       01793501
ASNBR1  DFHMDF POS=(15,51),                                            X01793603
               LENGTH=19,                                              X01793703
               ATTRB=ASKIP                                              01793801
*                                                                       01794001
*********************************************************************** 01795001
ACARNM2 DFHMDF POS=(16,02),                                            X01795103
               LENGTH=20,                                              X01795203
               ATTRB=ASKIP                                              01795303
*                                                                       01795403
ASDATE2 DFHMDF POS=(16,24),                                            X01795503
               LENGTH=10,                                              X01795603
               ATTRB=ASKIP                                              01795703
*                                                                       01795803
AMTHOD2 DFHMDF POS=(16,37),                                            X01795903
               LENGTH=10,                                              X01796003
               ATTRB=ASKIP                                              01796103
*                                                                       01796203
ASNBR2  DFHMDF POS=(16,51),                                            X01796303
               LENGTH=19,                                              X01796403
               ATTRB=ASKIP                                              01796503
*                                                                       01796603
*********************************************************************** 01796703
ACARNM3 DFHMDF POS=(17,02),                                            X01796803
               LENGTH=20,                                              X01796903
               ATTRB=ASKIP                                              01797003
*                                                                       01797103
ASDATE3 DFHMDF POS=(17,24),                                            X01797203
               LENGTH=10,                                              X01797303
               ATTRB=ASKIP                                              01797403
*                                                                       01797503
AMTHOD3 DFHMDF POS=(17,37),                                            X01797603
               LENGTH=10,                                              X01797703
               ATTRB=ASKIP                                              01797803
*                                                                       01797903
ASNBR3  DFHMDF POS=(17,51),                                            X01798003
               LENGTH=19,                                              X01798103
               ATTRB=ASKIP                                              01798203
*                                                                       01798303
*********************************************************************** 01798403
ACARNM4 DFHMDF POS=(18,02),                                            X01798503
               LENGTH=20,                                              X01798603
               ATTRB=ASKIP                                              01798703
*                                                                       01798803
ASDATE4 DFHMDF POS=(18,24),                                            X01798903
               LENGTH=10,                                              X01799003
               ATTRB=ASKIP                                              01799103
*                                                                       01799203
AMTHOD4 DFHMDF POS=(18,37),                                            X01799303
               LENGTH=10,                                              X01799403
               ATTRB=ASKIP                                              01799503
*                                                                       01799603
ASNBR4  DFHMDF POS=(18,51),                                            X01799703
               LENGTH=19,                                              X01799803
               ATTRB=ASKIP                                              01799903
*********************************************************************** 01808001
ACARNM5 DFHMDF POS=(19,02),                                            X01809003
               LENGTH=20,                                              X01809103
               ATTRB=ASKIP                                              01809203
*                                                                       01809303
ASDATE5 DFHMDF POS=(19,24),                                            X01809403
               LENGTH=10,                                              X01809503
               ATTRB=ASKIP                                              01809603
*                                                                       01809703
AMTHOD5 DFHMDF POS=(19,37),                                            X01809803
               LENGTH=10,                                              X01809903
               ATTRB=ASKIP                                              01810003
*                                                                       01810103
ASNBR5  DFHMDF POS=(19,51),                                            X01810203
               LENGTH=19,                                              X01810303
               ATTRB=ASKIP                                              01810403
*                                                                       01810503
*********************************************************************** 01810603
        DFHMSD TYPE=FINAL                                               01811001
        PRINT NOGEN                                                     01820001
        END                                                             01830001
