        PRINT NOGEN                                                     00010000
VLKM586 DFHMSD TYPE=MAP,                                               X00020016
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL586A  DFHMDI SIZE=(19,80),                                           X00060016
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(03,44),                                            X00120001
               LENGTH=06,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='ITEMS:'                                         00150001
*                                                                       00150101
ASTRTIT DFHMDF POS=(03,53),                                            X00150201
               LENGTH=05,                                              X00150301
               ATTRB=UNPROT,                                           X00150401
               HILIGHT=UNDERLINE,                                      X00150503
               PICOUT='ZZZZZ'                                           00150617
        DFHMDF POS=(03,59),                                            X00150705
               LENGTH=01,                                              X00150805
               ATTRB=ASKIP                                              00150905
*                                                                       00151101
        DFHMDF POS=(03,61),                                            X00151218
               LENGTH=02,                                              X00151301
               ATTRB=(ASKIP,BRT),                                      X00151401
               INITIAL='TO'                                             00151501
*                                                                       00151601
AENDIT  DFHMDF POS=(03,64),                                            X00151701
               LENGTH=05,                                              X00151801
               ATTRB=(ASKIP,BRT),                                      X00151901
               PICOUT='ZZZZZ'                                           00152017
*                                                                       00152101
        DFHMDF POS=(03,70),                                            X00152201
               LENGTH=02,                                              X00152301
               ATTRB=(ASKIP,BRT),                                      X00152401
               INITIAL='OF'                                             00152501
*                                                                       00152601
ATOTIT  DFHMDF POS=(03,75),                                            X00152703
               LENGTH=05,                                              X00152801
               ATTRB=(ASKIP,BRT),                                      X00152901
               PICOUT='ZZZZZ'                                           00153217
*********************************************************************** 00153301
        DFHMDF POS=(04,13),                                            X00153407
               LENGTH=02,                                              X00153501
               ATTRB=(ASKIP,BRT),                                      X00153601
               INITIAL='PO'                                             00153701
*                                                                       00153801
        DFHMDF POS=(04,18),                                            X00153907
               LENGTH=07,                                              X00154001
               ATTRB=(ASKIP,BRT),                                      X00154101
               INITIAL='REQUEST'                                        00154201
*                                                                       00154301
        DFHMDF POS=(04,28),                                            X00154407
               LENGTH=06,                                              X00154501
               ATTRB=(ASKIP,BRT),                                      X00154601
               INITIAL='VENDOR'                                         00154701
*                                                                       00154801
        DFHMDF POS=(04,49),                                            X00154907
               LENGTH=04,                                              X00155007
               ATTRB=(ASKIP,BRT),                                      X00155101
               INITIAL='RQST'                                           00155207
*                                                                       00155301
        DFHMDF POS=(04,56),                                            X00155407
               LENGTH=05,                                              X00155501
               ATTRB=(ASKIP,BRT),                                      X00155601
               INITIAL='PRINT'                                          00155701
*                                                                       00155801
        DFHMDF POS=(04,63),                                            X00155907
               LENGTH=04,                                              X00156007
               ATTRB=(ASKIP,BRT),                                      X00156101
               INITIAL='SHIP'                                           00156307
*                                                                       00156401
        DFHMDF POS=(04,70),                                            X00156507
               LENGTH=09,                                              X00156601
               ATTRB=(ASKIP,BRT),                                      X00156701
               INITIAL='REQUESTED'                                      00156801
*********************************************************************** 00156901
        DFHMDF POS=(05,01),                                            X00157101
               LENGTH=03,                                              X00157207
               ATTRB=(ASKIP,BRT),                                      X00157301
               INITIAL='SEL'                                            00157401
*                                                                       00157501
        DFHMDF POS=(05,05),                                            X00157607
               LENGTH=03,                                              X00157707
               ATTRB=(ASKIP,BRT),                                      X00157807
               INITIAL='ACT'                                            00157907
*                                                                       00158007
        DFHMDF POS=(05,11),                                            X00158107
               LENGTH=06,                                              X00158201
               ATTRB=(ASKIP,BRT),                                      X00158301
               INITIAL='NUMBER'                                         00158401
*                                                                       00158501
        DFHMDF POS=(05,18),                                            X00158607
               LENGTH=06,                                              X00158701
               ATTRB=(ASKIP,BRT),                                      X00158801
               INITIAL='TYP ST'                                         00158901
*                                                                       00159001
        DFHMDF POS=(05,28),                                            X00159107
               LENGTH=11,                                              X00159207
               ATTRB=(ASKIP,BRT),                                      X00159301
               INITIAL='VENDOR NAME'                                    00159407
*                                                                       00159507
        DFHMDF POS=(05,43),                                            X00159607
               LENGTH=03,                                              X00159707
               ATTRB=(ASKIP,BRT),                                      X00159807
               INITIAL='DPT'                                            00159907
*                                                                       00160001
        DFHMDF POS=(05,49),                                            X00160107
               LENGTH=04,                                              X00160201
               ATTRB=(ASKIP,BRT),                                      X00160301
               INITIAL='DATE'                                           00160401
*                                                                       00160501
        DFHMDF POS=(05,56),                                            X00160607
               LENGTH=04,                                              X00160701
               ATTRB=(ASKIP,BRT),                                      X00160801
               INITIAL='DATE'                                           00160901
*                                                                       00161001
        DFHMDF POS=(05,63),                                            X00161107
               LENGTH=04,                                              X00161201
               ATTRB=(ASKIP,BRT),                                      X00161301
               INITIAL='DATE'                                           00161401
*                                                                       00161501
        DFHMDF POS=(05,71),                                            X00161607
               LENGTH=07,                                              X00161701
               ATTRB=(ASKIP,BRT),                                      X00161801
               INITIAL='TICKETS'                                        00161901
*********************************************************************** 00163001
ASEL01  DFHMDF POS=(06,02),                                            X00163607
               LENGTH=01,                                              X00163700
               ATTRB=UNPROT,                                           X00163800
               HILIGHT=UNDERLINE,                                      X00163900
               PICOUT='X'                                               00164000
        DFHMDF POS=(06,04),                                            X00164208
               LENGTH=00,                                              X00164318
               ATTRB=ASKIP                                              00164406
*                                                                       00164506
AACT01  DFHMDF POS=(06,05),                                            X00164607
               LENGTH=03,                                              X00164707
               ATTRB=(ASKIP,BRT)                                        00164806
*                                                                       00164907
APO01   DFHMDF POS=(06,10),                                            X00165007
               LENGTH=08,                                              X00165120
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00165212
*                                                                       00165301
ARTYP01 DFHMDF POS=(06,19),                                            X00165407
               LENGTH=01,                                              X00165501
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00165612
*                                                                       00165701
ARST01  DFHMDF POS=(06,22),                                            X00165807
               LENGTH=01,                                              X00165901
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00166012
        DFHMDF POS=(06,24),                                            X00166114
               LENGTH=01,                                              X00166214
               ATTRB=(ASKIP,BRT)                                        00166314
*                                                                       00166401
AVNME01 DFHMDF POS=(06,26),                                            X00166507
               LENGTH=15,                                              X00166607
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00166712
*                                                                       00166807
ADEPT01 DFHMDF POS=(06,43),                                            X00166907
               LENGTH=03,                                              X00167007
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00167112
*                                                                       00167201
ARQDT01 DFHMDF POS=(06,49),                                            X00168007
               LENGTH=05,                                              X00169007
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00169112
*                                                                       00191001
APRDT01 DFHMDF POS=(06,56),                                            X00192007
               LENGTH=05,                                              X00193010
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00193112
*                                                                       00197001
ASHDT01 DFHMDF POS=(06,63),                                            X00198007
               LENGTH=05,                                              X00199010
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00199112
*                                                                       00199501
ARTIX01 DFHMDF POS=(06,70),                                            X00199613
               LENGTH=09,                                              X00199713
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00199812
*********************************************************************** 00199907
ASEL02  DFHMDF POS=(07,02),                                            X00200007
               LENGTH=01,                                              X00201007
               ATTRB=UNPROT,                                           X00202007
               HILIGHT=UNDERLINE,                                      X00202107
               PICOUT='X'                                               00202207
        DFHMDF POS=(07,04),                                            X00202307
               LENGTH=00,                                              X00202418
               ATTRB=ASKIP                                              00202507
*                                                                       00202607
AACT02  DFHMDF POS=(07,05),                                            X00202707
               LENGTH=03,                                              X00202807
               ATTRB=(ASKIP,BRT)                                        00202907
*                                                                       00203007
APO02   DFHMDF POS=(07,10),                                            X00203107
               LENGTH=08,                                              X00203220
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00203312
*                                                                       00203407
ARTYP02 DFHMDF POS=(07,19),                                            X00203507
               LENGTH=01,                                              X00203607
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00203712
*                                                                       00203807
ARST02  DFHMDF POS=(07,22),                                            X00203907
               LENGTH=01,                                              X00204007
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00204112
        DFHMDF POS=(07,24),                                            X00204214
               LENGTH=01,                                              X00204314
               ATTRB=(ASKIP,BRT)                                        00204414
*                                                                       00204507
AVNME02 DFHMDF POS=(07,26),                                            X00204607
               LENGTH=15,                                              X00204707
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00204812
*                                                                       00204907
ADEPT02 DFHMDF POS=(07,43),                                            X00205007
               LENGTH=03,                                              X00205107
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00205212
*                                                                       00205307
ARQDT02 DFHMDF POS=(07,49),                                            X00205407
               LENGTH=05,                                              X00205507
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00205612
*                                                                       00205707
APRDT02 DFHMDF POS=(07,56),                                            X00205807
               LENGTH=05,                                              X00205911
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00206012
*                                                                       00206107
ASHDT02 DFHMDF POS=(07,63),                                            X00206207
               LENGTH=05,                                              X00206311
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00206412
*                                                                       00206507
ARTIX02 DFHMDF POS=(07,70),                                            X00206613
               LENGTH=09,                                              X00206713
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00206812
*********************************************************************** 00206907
ASEL03  DFHMDF POS=(08,02),                                            X00207007
               LENGTH=01,                                              X00207107
               ATTRB=UNPROT,                                           X00207207
               HILIGHT=UNDERLINE,                                      X00207307
               PICOUT='X'                                               00207407
        DFHMDF POS=(08,04),                                            X00207507
               LENGTH=00,                                              X00207618
               ATTRB=ASKIP                                              00207707
*                                                                       00207807
AACT03  DFHMDF POS=(08,05),                                            X00207907
               LENGTH=03,                                              X00208007
               ATTRB=(ASKIP,BRT)                                        00208107
*                                                                       00208207
APO03   DFHMDF POS=(08,10),                                            X00208307
               LENGTH=08,                                              X00208420
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00208512
*                                                                       00208607
ARTYP03 DFHMDF POS=(08,19),                                            X00208707
               LENGTH=01,                                              X00208807
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00208912
*                                                                       00209007
ARST03  DFHMDF POS=(08,22),                                            X00209107
               LENGTH=01,                                              X00209207
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00209312
        DFHMDF POS=(08,24),                                            X00209414
               LENGTH=01,                                              X00209514
               ATTRB=(ASKIP,BRT)                                        00209614
*                                                                       00209707
AVNME03 DFHMDF POS=(08,26),                                            X00209807
               LENGTH=15,                                              X00209907
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00210012
*                                                                       00210107
ADEPT03 DFHMDF POS=(08,43),                                            X00210207
               LENGTH=03,                                              X00210307
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00210412
*                                                                       00210507
ARQDT03 DFHMDF POS=(08,49),                                            X00210607
               LENGTH=05,                                              X00210707
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00210812
*                                                                       00210907
APRDT03 DFHMDF POS=(08,56),                                            X00211007
               LENGTH=05,                                              X00211111
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00211212
*                                                                       00211307
ASHDT03 DFHMDF POS=(08,63),                                            X00211407
               LENGTH=05,                                              X00211511
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00211612
*                                                                       00211707
ARTIX03 DFHMDF POS=(08,70),                                            X00211813
               LENGTH=09,                                              X00211913
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00212012
*********************************************************************** 00212107
ASEL04  DFHMDF POS=(09,02),                                            X00212207
               LENGTH=01,                                              X00212307
               ATTRB=UNPROT,                                           X00212407
               HILIGHT=UNDERLINE,                                      X00212507
               PICOUT='X'                                               00212607
        DFHMDF POS=(09,04),                                            X00212707
               LENGTH=00,                                              X00212818
               ATTRB=ASKIP                                              00212907
*                                                                       00213007
AACT04  DFHMDF POS=(09,05),                                            X00213107
               LENGTH=03,                                              X00213207
               ATTRB=(ASKIP,BRT)                                        00213307
*                                                                       00213407
APO04   DFHMDF POS=(09,10),                                            X00213507
               LENGTH=08,                                              X00213620
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00213712
*                                                                       00213807
ARTYP04 DFHMDF POS=(09,19),                                            X00213907
               LENGTH=01,                                              X00214007
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00214112
*                                                                       00214207
ARST04  DFHMDF POS=(09,22),                                            X00214307
               LENGTH=01,                                              X00214407
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00214512
        DFHMDF POS=(09,24),                                            X00214614
               LENGTH=01,                                              X00214714
               ATTRB=(ASKIP,BRT)                                        00214814
*                                                                       00214907
AVNME04 DFHMDF POS=(09,26),                                            X00215007
               LENGTH=15,                                              X00215107
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00215212
*                                                                       00215307
ADEPT04 DFHMDF POS=(09,43),                                            X00215407
               LENGTH=03,                                              X00215507
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00215612
*                                                                       00215707
ARQDT04 DFHMDF POS=(09,49),                                            X00215807
               LENGTH=05,                                              X00215907
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00216012
*                                                                       00216107
APRDT04 DFHMDF POS=(09,56),                                            X00216207
               LENGTH=05,                                              X00216311
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00216412
*                                                                       00216507
ASHDT04 DFHMDF POS=(09,63),                                            X00216607
               LENGTH=05,                                              X00216711
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00216812
*                                                                       00216907
ARTIX04 DFHMDF POS=(09,70),                                            X00217013
               LENGTH=09,                                              X00217113
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00217212
*********************************************************************** 00217307
ASEL05  DFHMDF POS=(10,02),                                            X00217407
               LENGTH=01,                                              X00217507
               ATTRB=UNPROT,                                           X00217607
               HILIGHT=UNDERLINE,                                      X00217707
               PICOUT='X'                                               00217807
        DFHMDF POS=(10,04),                                            X00217907
               LENGTH=00,                                              X00218018
               ATTRB=ASKIP                                              00218107
*                                                                       00218207
AACT05  DFHMDF POS=(10,05),                                            X00218307
               LENGTH=03,                                              X00218407
               ATTRB=(ASKIP,BRT)                                        00218512
*                                                                       00218607
APO05   DFHMDF POS=(10,10),                                            X00218707
               LENGTH=08,                                              X00218820
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00218912
*                                                                       00219007
ARTYP05 DFHMDF POS=(10,19),                                            X00219107
               LENGTH=01,                                              X00219207
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00219312
*                                                                       00219407
ARST05  DFHMDF POS=(10,22),                                            X00219507
               LENGTH=01,                                              X00219607
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00219712
        DFHMDF POS=(10,24),                                            X00219814
               LENGTH=01,                                              X00219914
               ATTRB=(ASKIP,BRT)                                        00220014
*                                                                       00220107
AVNME05 DFHMDF POS=(10,26),                                            X00220207
               LENGTH=15,                                              X00220307
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00220412
*                                                                       00220507
ADEPT05 DFHMDF POS=(10,43),                                            X00220607
               LENGTH=03,                                              X00220707
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00220812
*                                                                       00220907
ARQDT05 DFHMDF POS=(10,49),                                            X00221007
               LENGTH=05,                                              X00221107
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00221212
*                                                                       00221307
APRDT05 DFHMDF POS=(10,56),                                            X00221407
               LENGTH=05,                                              X00221511
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00221612
*                                                                       00221707
ASHDT05 DFHMDF POS=(10,63),                                            X00221807
               LENGTH=05,                                              X00221911
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00222012
*                                                                       00222107
ARTIX05 DFHMDF POS=(10,70),                                            X00222213
               LENGTH=09,                                              X00222313
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00222412
*********************************************************************** 00222507
ASEL06  DFHMDF POS=(11,02),                                            X00222607
               LENGTH=01,                                              X00222707
               ATTRB=UNPROT,                                           X00222807
               HILIGHT=UNDERLINE,                                      X00222907
               PICOUT='X'                                               00223007
        DFHMDF POS=(11,04),                                            X00223107
               LENGTH=00,                                              X00223218
               ATTRB=ASKIP                                              00223307
*                                                                       00223407
AACT06  DFHMDF POS=(11,05),                                            X00223507
               LENGTH=03,                                              X00223607
               ATTRB=(ASKIP,BRT)                                        00223707
*                                                                       00223807
APO06   DFHMDF POS=(11,10),                                            X00223907
               LENGTH=08,                                              X00224020
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00224112
*                                                                       00224207
ARTYP06 DFHMDF POS=(11,19),                                            X00224307
               LENGTH=01,                                              X00224407
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00224512
*                                                                       00224607
ARST06  DFHMDF POS=(11,22),                                            X00224707
               LENGTH=01,                                              X00224807
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00224912
        DFHMDF POS=(11,24),                                            X00225014
               LENGTH=01,                                              X00225114
               ATTRB=(ASKIP,BRT)                                        00225214
*                                                                       00225307
AVNME06 DFHMDF POS=(11,26),                                            X00225407
               LENGTH=15,                                              X00225507
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00225612
*                                                                       00225707
ADEPT06 DFHMDF POS=(11,43),                                            X00225807
               LENGTH=03,                                              X00225907
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00226012
*                                                                       00226107
ARQDT06 DFHMDF POS=(11,49),                                            X00226207
               LENGTH=05,                                              X00226307
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00226412
*                                                                       00226507
APRDT06 DFHMDF POS=(11,56),                                            X00226607
               LENGTH=05,                                              X00226711
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00226812
*                                                                       00226907
ASHDT06 DFHMDF POS=(11,63),                                            X00227007
               LENGTH=05,                                              X00227111
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00227212
*                                                                       00227307
ARTIX06 DFHMDF POS=(11,70),                                            X00227413
               LENGTH=09,                                              X00227513
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00227612
*********************************************************************** 00227707
ASEL07  DFHMDF POS=(12,02),                                            X00227807
               LENGTH=01,                                              X00227907
               ATTRB=UNPROT,                                           X00228007
               HILIGHT=UNDERLINE,                                      X00228107
               PICOUT='X'                                               00228207
        DFHMDF POS=(12,04),                                            X00228307
               LENGTH=00,                                              X00228418
               ATTRB=ASKIP                                              00228507
*                                                                       00228607
AACT07  DFHMDF POS=(12,05),                                            X00228707
               LENGTH=03,                                              X00228807
               ATTRB=(ASKIP,BRT)                                        00228907
*                                                                       00229007
APO07   DFHMDF POS=(12,10),                                            X00229107
               LENGTH=08,                                              X00229220
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00229312
*                                                                       00229407
ARTYP07 DFHMDF POS=(12,19),                                            X00229507
               LENGTH=01,                                              X00229607
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00229712
*                                                                       00229807
ARST07  DFHMDF POS=(12,22),                                            X00229907
               LENGTH=01,                                              X00230007
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00230112
        DFHMDF POS=(12,24),                                            X00230214
               LENGTH=01,                                              X00230314
               ATTRB=(ASKIP,BRT)                                        00230414
*                                                                       00230507
AVNME07 DFHMDF POS=(12,26),                                            X00230607
               LENGTH=15,                                              X00230707
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00230812
*                                                                       00230907
ADEPT07 DFHMDF POS=(12,43),                                            X00231007
               LENGTH=03,                                              X00231107
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00231212
*                                                                       00231307
ARQDT07 DFHMDF POS=(12,49),                                            X00231407
               LENGTH=05,                                              X00231507
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00231612
*                                                                       00231707
APRDT07 DFHMDF POS=(12,56),                                            X00231807
               LENGTH=05,                                              X00231911
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00232012
*                                                                       00232107
ASHDT07 DFHMDF POS=(12,63),                                            X00232207
               LENGTH=05,                                              X00232311
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00232412
*                                                                       00232507
ARTIX07 DFHMDF POS=(12,70),                                            X00232613
               LENGTH=09,                                              X00232713
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00232812
*********************************************************************** 00232907
ASEL08  DFHMDF POS=(13,02),                                            X00233007
               LENGTH=01,                                              X00233107
               ATTRB=UNPROT,                                           X00233207
               HILIGHT=UNDERLINE,                                      X00233307
               PICOUT='X'                                               00233407
        DFHMDF POS=(13,04),                                            X00233507
               LENGTH=00,                                              X00233618
               ATTRB=ASKIP                                              00233707
*                                                                       00233807
AACT08  DFHMDF POS=(13,05),                                            X00233907
               LENGTH=03,                                              X00234007
               ATTRB=(ASKIP,BRT)                                        00234107
*                                                                       00234207
APO08   DFHMDF POS=(13,10),                                            X00234307
               LENGTH=08,                                              X00234420
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00234512
*                                                                       00234607
ARTYP08 DFHMDF POS=(13,19),                                            X00234707
               LENGTH=01,                                              X00234807
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00234912
*                                                                       00235007
ARST08  DFHMDF POS=(13,22),                                            X00235107
               LENGTH=01,                                              X00235207
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00235312
        DFHMDF POS=(13,24),                                            X00235414
               LENGTH=01,                                              X00235514
               ATTRB=(ASKIP,BRT)                                        00235614
*                                                                       00235707
AVNME08 DFHMDF POS=(13,26),                                            X00235807
               LENGTH=15,                                              X00235907
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00236012
*                                                                       00236107
ADEPT08 DFHMDF POS=(13,43),                                            X00236207
               LENGTH=03,                                              X00236307
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00236412
*                                                                       00236507
ARQDT08 DFHMDF POS=(13,49),                                            X00236607
               LENGTH=05,                                              X00236707
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00236812
*                                                                       00236907
APRDT08 DFHMDF POS=(13,56),                                            X00237007
               LENGTH=05,                                              X00237111
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00237212
*                                                                       00237307
ASHDT08 DFHMDF POS=(13,63),                                            X00237407
               LENGTH=05,                                              X00237511
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00237612
*                                                                       00237707
ARTIX08 DFHMDF POS=(13,70),                                            X00237813
               LENGTH=09,                                              X00237913
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00238012
*********************************************************************** 00238107
ASEL09  DFHMDF POS=(14,02),                                            X00238207
               LENGTH=01,                                              X00238307
               ATTRB=UNPROT,                                           X00238412
               HILIGHT=UNDERLINE,                                      X00238507
               PICOUT='X'                                               00238607
        DFHMDF POS=(14,04),                                            X00238707
               LENGTH=00,                                              X00238818
               ATTRB=ASKIP                                              00238907
*                                                                       00239007
AACT09  DFHMDF POS=(14,05),                                            X00239107
               LENGTH=03,                                              X00239207
               ATTRB=(ASKIP,BRT)                                        00239307
*                                                                       00239407
APO09   DFHMDF POS=(14,10),                                            X00239507
               LENGTH=08,                                              X00239620
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00239715
*                                                                       00239907
ARTYP09 DFHMDF POS=(14,19),                                            X00240007
               LENGTH=01,                                              X00240107
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00240212
*                                                                       00240307
ARST09  DFHMDF POS=(14,22),                                            X00240407
               LENGTH=01,                                              X00240507
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00240612
        DFHMDF POS=(14,24),                                            X00240714
               LENGTH=01,                                              X00240814
               ATTRB=(ASKIP,BRT)                                        00240914
*                                                                       00241007
AVNME09 DFHMDF POS=(14,26),                                            X00241107
               LENGTH=15,                                              X00241207
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00241312
*                                                                       00241407
ADEPT09 DFHMDF POS=(14,43),                                            X00241507
               LENGTH=03,                                              X00241607
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00241712
*                                                                       00241807
ARQDT09 DFHMDF POS=(14,49),                                            X00241907
               LENGTH=05,                                              X00242007
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00242112
*                                                                       00242207
APRDT09 DFHMDF POS=(14,56),                                            X00242307
               LENGTH=05,                                              X00242411
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00242512
*                                                                       00242607
ASHDT09 DFHMDF POS=(14,63),                                            X00242707
               LENGTH=05,                                              X00242811
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00242912
*                                                                       00243007
ARTIX09 DFHMDF POS=(14,70),                                            X00243113
               LENGTH=09,                                              X00243213
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00243312
*********************************************************************** 00243407
ASEL10  DFHMDF POS=(15,02),                                            X00243507
               LENGTH=01,                                              X00243607
               ATTRB=UNPROT,                                           X00243712
               HILIGHT=UNDERLINE,                                      X00243807
               PICOUT='X'                                               00243907
        DFHMDF POS=(15,04),                                            X00244007
               LENGTH=00,                                              X00244118
               ATTRB=ASKIP                                              00244207
*                                                                       00244307
AACT10  DFHMDF POS=(15,05),                                            X00244407
               LENGTH=03,                                              X00244507
               ATTRB=(ASKIP,BRT)                                        00244607
*                                                                       00244707
APO10   DFHMDF POS=(15,10),                                            X00244807
               LENGTH=08,                                              X00244920
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00245015
*                                                                       00245207
ARTYP10 DFHMDF POS=(15,19),                                            X00245307
               LENGTH=01,                                              X00245407
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00245512
*                                                                       00245607
ARST10  DFHMDF POS=(15,22),                                            X00245707
               LENGTH=01,                                              X00245807
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00245912
        DFHMDF POS=(15,24),                                            X00246014
               LENGTH=01,                                              X00246114
               ATTRB=(ASKIP,BRT)                                        00246214
*                                                                       00246307
AVNME10 DFHMDF POS=(15,26),                                            X00246407
               LENGTH=15,                                              X00246507
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00246612
*                                                                       00246707
ADEPT10 DFHMDF POS=(15,43),                                            X00246807
               LENGTH=03,                                              X00246907
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00247012
*                                                                       00247107
ARQDT10 DFHMDF POS=(15,49),                                            X00247207
               LENGTH=05,                                              X00247307
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00247412
*                                                                       00247507
APRDT10 DFHMDF POS=(15,56),                                            X00247607
               LENGTH=05,                                              X00247711
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00247812
*                                                                       00247907
ASHDT10 DFHMDF POS=(15,63),                                            X00248007
               LENGTH=05,                                              X00248111
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00248212
*                                                                       00248307
ARTIX10 DFHMDF POS=(15,70),                                            X00248413
               LENGTH=09,                                              X00248513
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00248612
*********************************************************************** 00248707
ASEL11  DFHMDF POS=(16,02),                                            X00248807
               LENGTH=01,                                              X00248907
               ATTRB=UNPROT,                                           X00249019
               HILIGHT=UNDERLINE,                                      X00249107
               PICOUT='X'                                               00249207
        DFHMDF POS=(16,04),                                            X00249307
               LENGTH=00,                                              X00249418
               ATTRB=ASKIP                                              00249507
*                                                                       00249607
AACT11  DFHMDF POS=(16,05),                                            X00249707
               LENGTH=03,                                              X00249807
               ATTRB=(ASKIP,BRT)                                        00249907
*                                                                       00250007
APO11   DFHMDF POS=(16,10),                                            X00250107
               LENGTH=08,                                              X00250220
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00250315
*                                                                       00250507
ARTYP11 DFHMDF POS=(16,19),                                            X00250607
               LENGTH=01,                                              X00250707
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00250812
*                                                                       00250907
ARST11  DFHMDF POS=(16,22),                                            X00251007
               LENGTH=01,                                              X00251107
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00251212
        DFHMDF POS=(16,24),                                            X00251314
               LENGTH=01,                                              X00251414
               ATTRB=(ASKIP,BRT)                                        00251514
*                                                                       00251607
AVNME11 DFHMDF POS=(16,26),                                            X00251707
               LENGTH=15,                                              X00251807
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00251912
*                                                                       00252007
ADEPT11 DFHMDF POS=(16,43),                                            X00252107
               LENGTH=03,                                              X00252207
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00252312
*                                                                       00252407
ARQDT11 DFHMDF POS=(16,49),                                            X00252507
               LENGTH=05,                                              X00252607
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00252712
*                                                                       00252807
APRDT11 DFHMDF POS=(16,56),                                            X00252907
               LENGTH=05,                                              X00253011
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00253112
*                                                                       00253207
ASHDT11 DFHMDF POS=(16,63),                                            X00253307
               LENGTH=05,                                              X00253411
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00253512
*                                                                       00253607
ARTIX11 DFHMDF POS=(16,70),                                            X00253713
               LENGTH=09,                                              X00253813
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00253912
*********************************************************************** 00254007
ASEL12  DFHMDF POS=(17,02),                                            X00254107
               LENGTH=01,                                              X00254207
               ATTRB=UNPROT,                                           X00254312
               HILIGHT=UNDERLINE,                                      X00254407
               PICOUT='X'                                               00254507
        DFHMDF POS=(17,04),                                            X00254607
               LENGTH=00,                                              X00254718
               ATTRB=ASKIP                                              00254807
*                                                                       00254907
AACT12  DFHMDF POS=(17,05),                                            X00255007
               LENGTH=03,                                              X00255107
               ATTRB=(ASKIP,BRT)                                        00255207
*                                                                       00255307
APO12   DFHMDF POS=(17,10),                                            X00255407
               LENGTH=08,                                              X00255520
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00255615
*                                                                       00255807
ARTYP12 DFHMDF POS=(17,19),                                            X00255907
               LENGTH=01,                                              X00256007
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00256112
*                                                                       00256207
ARST12  DFHMDF POS=(17,22),                                            X00256307
               LENGTH=01,                                              X00256407
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00256512
        DFHMDF POS=(17,24),                                            X00256614
               LENGTH=01,                                              X00256714
               ATTRB=(ASKIP,BRT)                                        00256814
*                                                                       00256907
AVNME12 DFHMDF POS=(17,26),                                            X00257007
               LENGTH=15,                                              X00257107
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00257212
*                                                                       00257307
ADEPT12 DFHMDF POS=(17,43),                                            X00257407
               LENGTH=03,                                              X00257507
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00257612
*                                                                       00257707
ARQDT12 DFHMDF POS=(17,49),                                            X00257807
               LENGTH=05,                                              X00257907
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00258012
*                                                                       00258107
APRDT12 DFHMDF POS=(17,56),                                            X00258207
               LENGTH=05,                                              X00258311
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00258412
*                                                                       00258507
ASHDT12 DFHMDF POS=(17,63),                                            X00258607
               LENGTH=05,                                              X00258711
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00258812
*                                                                       00258907
ARTIX12 DFHMDF POS=(17,70),                                            X00259013
               LENGTH=09,                                              X00259113
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00259212
*********************************************************************** 00259307
ASEL13  DFHMDF POS=(18,02),                                            X00259407
               LENGTH=01,                                              X00259507
               ATTRB=UNPROT,                                           X00259612
               HILIGHT=UNDERLINE,                                      X00259707
               PICOUT='X'                                               00259807
        DFHMDF POS=(18,04),                                            X00259907
               LENGTH=00,                                              X00260018
               ATTRB=ASKIP                                              00260107
*                                                                       00260207
AACT13  DFHMDF POS=(18,05),                                            X00260307
               LENGTH=03,                                              X00260407
               ATTRB=(ASKIP,BRT)                                        00260507
*                                                                       00260607
APO13   DFHMDF POS=(18,10),                                            X00260707
               LENGTH=08,                                              X00260820
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00260915
*                                                                       00261107
ARTYP13 DFHMDF POS=(18,19),                                            X00261207
               LENGTH=01,                                              X00261307
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00261412
*                                                                       00261507
ARST13  DFHMDF POS=(18,22),                                            X00261607
               LENGTH=01,                                              X00261707
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00261812
        DFHMDF POS=(18,24),                                            X00261914
               LENGTH=01,                                              X00262014
               ATTRB=(ASKIP,BRT)                                        00262114
*                                                                       00262207
AVNME13 DFHMDF POS=(18,26),                                            X00262307
               LENGTH=15,                                              X00262407
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00262512
*                                                                       00262607
ADEPT13 DFHMDF POS=(18,43),                                            X00262707
               LENGTH=03,                                              X00262807
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00262912
*                                                                       00263007
ARQDT13 DFHMDF POS=(18,49),                                            X00263107
               LENGTH=05,                                              X00263207
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00263312
*                                                                       00263407
APRDT13 DFHMDF POS=(18,56),                                            X00263507
               LENGTH=05,                                              X00263611
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00263712
*                                                                       00263807
ASHDT13 DFHMDF POS=(18,63),                                            X00263907
               LENGTH=05,                                              X00264011
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00264112
*                                                                       00264207
ARTIX13 DFHMDF POS=(18,70),                                            X00264313
               LENGTH=09,                                              X00264413
               COLOR=BLUE,ATTRB=(ASKIP,BRT)                             00265012
*********************************************************************** 00492002
*                                                                       00499302
        DFHMDF POS=(19,44),                                            X00499402
               LENGTH=25,                                              X00499501
               ATTRB=(ASKIP,BRT),                                      X00500012
               INITIAL='NUMBER OF SELECTED ITEMS:'                      00510001
*                                                                       00520001
ASELIT  DFHMDF POS=(19,70),                                            X00530009
               LENGTH=05,                                              X00540003
               ATTRB=(ASKIP,BRT),                                      X00550001
               PICOUT='99999'                                           00570001
*                                                                       00580001
*                                                                       01790000
*********************************************************************** 01800000
        DFHMSD TYPE=FINAL                                               01810000
        PRINT NOGEN                                                     01820000
        END                                                             01830000
