        PRINT NOGEN                                                     00010000
VLKM585 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL585A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(05,06),                                            X00120000
               LENGTH=42,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='PLEASE ENTER ONE OR MORE OF THE FOLLOWING:'     00150000
*********************************************************************** 00150200
        DFHMDF POS=(07,10),                                            X00150400
               LENGTH=22,                                              X00150500
               ATTRB=(ASKIP,BRT),                                      X00150600
               INITIAL='PURCHASE ORDER NUMBER:'                         00150700
*                                                                       00150800
APONMBR DFHMDF POS=(07,33),                                            X00150900
               LENGTH=09,                                              X00151000
               ATTRB=UNPROT,                                           X00151100
               PICOUT='ZZZZZZZZZ',                                     X00151200
               HILIGHT=UNDERLINE                                        00151300
        DFHMDF POS=(07,43),                                            X00151400
               LENGTH=1,                                               X00151500
               ATTRB=ASKIP                                              00151600
*********************************************************************** 00151700
        DFHMDF POS=(09,10),                                            X00151800
               LENGTH=22,                                              X00151900
               ATTRB=(ASKIP,BRT),                                      X00152000
               INITIAL='DEPARTMENT NUMBER ...:'                         00152100
*                                                                       00152200
ADEPT   DFHMDF POS=(09,33),                                            X00152300
               LENGTH=03,                                              X00152400
               ATTRB=UNPROT,                                           X00152500
               PICOUT='ZZZ',                                           X00152600
               HILIGHT=UNDERLINE                                        00152700
        DFHMDF POS=(09,37),                                            X00152800
               LENGTH=1,                                               X00152900
               ATTRB=ASKIP                                              00153000
*********************************************************************** 00153100
        DFHMDF POS=(11,10),                                            X00153200
               LENGTH=22,                                              X00153300
               ATTRB=(ASKIP,BRT),                                      X00153400
               INITIAL='VENDOR NAME .........:'                         00153500
*                                                                       00153600
AVNDNME DFHMDF POS=(11,33),                                            X00154000
               LENGTH=33,                                              X00155000
               ATTRB=UNPROT,                                           X00156000
               HILIGHT=UNDERLINE                                        00157000
        DFHMDF POS=(11,67),                                            X00157100
               LENGTH=1,                                               X00157200
               ATTRB=ASKIP                                              00157300
*********************************************************************** 00157401
        DFHMDF POS=(13,10),                                            X00157501
               LENGTH=22,                                              X00157601
               ATTRB=(ASKIP,BRT),                                      X00157701
               INITIAL='DATE LIMIT ..........:'                         00157801
*                                                                       00157901
ADTELMT DFHMDF POS=(13,33),                                            X00158001
               LENGTH=10,                                              X00159001
               ATTRB=UNPROT,                                           X00159101
               HILIGHT=UNDERLINE                                        00159201
        DFHMDF POS=(13,44),                                            X00159301
               LENGTH=1,                                               X00159401
               ATTRB=ASKIP                                              00159501
*********************************************************************** 00160000
*                                                                       01790000
*********************************************************************** 01800000
        DFHMSD TYPE=FINAL                                               01810000
        PRINT NOGEN                                                     01820000
        END                                                             01830000
