*          DATA SET VLKM589    AT LEVEL 001 AS OF 08/14/96              00001002
  PRINT  NOGEN                                                          00010100
*******************************************************************-*   00010200
*                                                                   *   00010300
*        MAPSET  VLKM589                                            *   00010402
*        MAP     VL589A                                             *   00010502
*        PROGRAM VLKCS589                                           *   00010602
*        TRANSID V589 -                                             *   00010702
*        SYSTEM  CICS ARCHITECTURE                                  *   00010800
*                                                                   *   00010900
*******************************************************************-*   00011000
VLKM589 DFHMSD TYPE=MAP,                                               X00020002
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL589A  DFHMDI SIZE=(19,80),                                           X00060002
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(02,08),                                            X00120000
               LENGTH=10,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='PO NUMBER :'                                    00150000
APONBR  DFHMDF ATTRB=(ASKIP),                                          X00150100
               LENGTH=8,                                               X00150200
               PICOUT='99999999',                                      X00150300
               COLOR=BLUE,                                             X00150400
               POS=(02,19)                                              00150500
*                                                                       00150600
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00156600
               JUSTIFY=(LEFT,BLANK),                                   X00156700
               COLOR=GREEN,                                            X00156800
               HILIGHT=UNDERLINE,                                      X00156900
               PICOUT='ZZZZZ',                                         X00157000
               LENGTH=5,                                               X00157100
               POS=(04,47)                                              00157201
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00157300
               INITIAL='TO',                                           X00157400
               COLOR=NEUTRAL,                                          X00157500
               LENGTH=2,                                               X00157600
               POS=(04,53)                                              00157701
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00157800
               JUSTIFY=(LEFT,BLANK),                                   X00157900
               COLOR=BLUE,                                             X00158000
               PICOUT='ZZZZZ',                                         X00158100
               LENGTH=5,                                               X00158200
               POS=(04,56)                                              00158301
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00158400
               INITIAL='OF',                                           X00158500
               COLOR=NEUTRAL,                                          X00158600
               LENGTH=2,                                               X00158700
               POS=(04,62)                                              00158801
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00158900
               JUSTIFY=(LEFT,BLANK),                                   X00159000
               COLOR=BLUE,                                             X00159100
               PICOUT='ZZZZZ',                                         X00159200
               LENGTH=5,                                               X00159300
               POS=(04,65)                                              00159401
*                                                                       00159500
        DFHMDF POS=(05,22),                                            X00160601
               LENGTH=18,                                              X00160700
               ATTRB=(ASKIP,BRT),                                      X00160800
               INITIAL='REASON DESCRIPTION'                             00160900
*********************************************************************** 00161000
*                                                                       00212000
ADES1   DFHMDF POS=(06,18),                                            X00220001
               COLOR=BLUE,                                             X00221000
               LENGTH=50,                                              X00222000
               ATTRB=(ASKIP,NORM)                                       00223000
*                                                                       00330000
ADES2   DFHMDF POS=(07,18),                                            X00500001
               COLOR=BLUE,                                             X00510000
               LENGTH=50,                                              X00520000
               ATTRB=(ASKIP,NORM)                                       00530000
*                                                                       00539800
ADES3   DFHMDF POS=(08,18),                                            X00539901
               COLOR=BLUE,                                             X00540000
               LENGTH=50,                                              X00541000
               ATTRB=(ASKIP,NORM)                                       00542000
*                                                                       00550000
ADES4   DFHMDF POS=(09,18),                                            X00551001
               COLOR=BLUE,                                             X00552000
               LENGTH=50,                                              X00553000
               ATTRB=(ASKIP,NORM)                                       00554000
*                                                                       00720000
ADES5   DFHMDF POS=(10,18),                                            X00730001
               COLOR=BLUE,                                             X00740000
               LENGTH=50,                                              X00750000
               ATTRB=(ASKIP,NORM)                                       00760000
*                                                                       00769800
ADES6   DFHMDF POS=(11,18),                                            X00769901
               COLOR=BLUE,                                             X00770000
               LENGTH=50,                                              X00771000
               ATTRB=(ASKIP,NORM)                                       00772000
*                                                                       00773000
ADES7   DFHMDF POS=(12,18),                                            X00781001
               COLOR=BLUE,                                             X00782000
               LENGTH=50,                                              X00783000
               ATTRB=(ASKIP,NORM)                                       00784000
*                                                                       00792000
ADES8   DFHMDF POS=(13,18),                                            X00793001
               COLOR=BLUE,                                             X00794000
               LENGTH=50,                                              X00795000
               ATTRB=(ASKIP,NORM)                                       00796000
*                                                                       00797000
ADES9   DFHMDF POS=(14,18),                                            X00805001
               COLOR=BLUE,                                             X00806000
               LENGTH=50,                                              X00807000
               ATTRB=(ASKIP,NORM)                                       00808000
*                                                                       00816000
ADES10  DFHMDF POS=(15,18),                                            X00817001
               COLOR=BLUE,                                             X00818000
               LENGTH=50,                                              X00819000
               ATTRB=(ASKIP,NORM)                                       00819100
*                                                                       00819200
ADES11  DFHMDF POS=(16,18),                                            X00829001
               COLOR=BLUE,                                             X00829100
               LENGTH=50,                                              X00829200
               ATTRB=(ASKIP,NORM)                                       00829300
*                                                                       00839100
ADES12  DFHMDF POS=(17,18),                                            X00839201
               COLOR=BLUE,                                             X00839300
               LENGTH=50,                                              X00839400
               ATTRB=(ASKIP,NORM)                                       00839500
*                                                                       00840000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00840100
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00840200
               COLOR=NEUTRAL,                                          X00840300
               LENGTH=25,                                              X00840400
               POS=(19,39)                                              00840500
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00840600
               JUSTIFY=(LEFT,BLANK),                                   X00840700
               COLOR=BLUE,                                             X00840800
               PICOUT='ZZZZZZZ',                                       X00840900
               LENGTH=7,                                               X00841000
               POS=(19,66)                                              00850000
*                                                                       02334100
*********************************************************************** 02334200
        DFHMSD TYPE=FINAL                                               02335000
        PRINT NOGEN                                                     02340000
        END                                                             02350000
