        PRINT NOGEN                                                     00010000
VLKM591 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL591A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(01,04),                                            X00120000
               LENGTH=11,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='DATE LIMIT:'                                    00150000
ADATE   DFHMDF POS=(01,16),                                            X00150100
               LENGTH=10,                                              X00150200
               ATTRB=UNPROT,                                           X00150416
               HILIGHT=UNDERLINE                                        00150517
        DFHMDF POS=(01,27),                                            X00150618
               LENGTH=1,                                               X00150718
               ATTRB=ASKIP                                              00150818
*                                                                       00151800
        DFHMDF POS=(01,43),                                            X00151900
               LENGTH=05,                                              X00152000
               ATTRB=(ASKIP,BRT),                                      X00152100
               INITIAL='ITEMS'                                          00152200
*                                                                       00152300
ASTRTIT DFHMDF POS=(01,49),                                            X00152400
               LENGTH=05,                                              X00152500
               HILIGHT=UNDERLINE,                                      X00152600
               ATTRB=UNPROT,                                           X00152700
               PICOUT='ZZZZ9'                                           00152900
*                                                                       00153000
        DFHMDF POS=(01,55),                                            X00153100
               LENGTH=02,                                              X00153200
               ATTRB=(ASKIP,BRT),                                      X00153300
               INITIAL='TO'                                             00153400
*                                                                       00153500
AENDIT  DFHMDF POS=(01,58),                                            X00153600
               LENGTH=05,                                              X00153700
               ATTRB=(ASKIP,BRT),                                      X00153900
               PICOUT='ZZZZ9'                                           00154000
*                                                                       00154100
        DFHMDF POS=(01,64),                                            X00154200
               LENGTH=02,                                              X00154300
               ATTRB=(ASKIP,BRT),                                      X00154400
               INITIAL='OF'                                             00154500
*                                                                       00154600
ATOTIT  DFHMDF POS=(01,67),                                            X00154700
               LENGTH=05,                                              X00154800
               ATTRB=(ASKIP,BRT),                                      X00154900
               PICOUT='ZZZZ9'                                           00155000
*********************************************************************** 00155100
        DFHMDF POS=(02,11),                                            X00155218
               LENGTH=2,                                               X00155300
               ATTRB=(ASKIP,BRT),                                      X00155400
               INITIAL='PO'                                             00155500
*                                                                       00155600
        DFHMDF POS=(02,21),                                            X00155713
               LENGTH=1,                                               X00155806
               ATTRB=(ASKIP,BRT),                                      X00155900
               INITIAL='S'                                              00156006
*                                                                       00156100
        DFHMDF POS=(02,23),                                            X00156212
               LENGTH=7,                                               X00156306
               ATTRB=(ASKIP,BRT),                                      X00156400
               INITIAL='REQUEST'                                        00156506
*                                                                       00156606
        DFHMDF POS=(02,32),                                            X00156712
               LENGTH=5,                                               X00156806
               ATTRB=(ASKIP,BRT),                                      X00156906
               INITIAL='PRINT'                                          00157006
*                                                                       00157106
        DFHMDF POS=(02,41),                                            X00157212
               LENGTH=6,                                               X00157306
               ATTRB=(ASKIP,BRT),                                      X00157406
               INITIAL='ACTUAL'                                         00157506
*                                                                       00157606
        DFHMDF POS=(02,51),                                            X00157714
               LENGTH=3,                                               X00157806
               ATTRB=(ASKIP,BRT),                                      X00157906
               INITIAL='NUM'                                            00158006
*                                                                       00158106
        DFHMDF POS=(02,59),                                            X00158212
               LENGTH=3,                                               X00158306
               ATTRB=(ASKIP,BRT),                                      X00158406
               INITIAL='NUM'                                            00158506
*                                                                       00158606
        DFHMDF POS=(02,65),                                            X00158712
               LENGTH=6,                                               X00158806
               ATTRB=(ASKIP,BRT),                                      X00158906
               INITIAL='TICKET'                                         00159006
*********************************************************************** 00159106
        DFHMDF POS=(03,02),                                            X00159711
               LENGTH=6,                                               X00159806
               ATTRB=(ASKIP,BRT),                                      X00159906
               INITIAL='USERID'                                         00160006
*                                                                       00160106
        DFHMDF POS=(03,11),                                            X00160218
               LENGTH=6,                                               X00160306
               ATTRB=(ASKIP,BRT),                                      X00160406
               INITIAL='NUMBER'                                         00160506
*                                                                       00160606
        DFHMDF POS=(03,21),                                            X00160712
               LENGTH=1,                                               X00160806
               ATTRB=(ASKIP,BRT),                                      X00160906
               INITIAL='T'                                              00161006
*                                                                       00161106
        DFHMDF POS=(03,25),                                            X00161212
               LENGTH=4,                                               X00161306
               ATTRB=(ASKIP,BRT),                                      X00161406
               INITIAL='DATE'                                           00161506
*                                                                       00161606
        DFHMDF POS=(03,32),                                            X00161713
               LENGTH=8,                                               X00161806
               ATTRB=(ASKIP,BRT),                                      X00161906
               INITIAL='DUE DATE'                                       00162006
*                                                                       00162106
        DFHMDF POS=(03,41),                                            X00162213
               LENGTH=8,                                               X00162306
               ATTRB=(ASKIP,BRT),                                      X00162406
               INITIAL='PRT DATE'                                       00162506
*                                                                       00162606
        DFHMDF POS=(03,51),                                            X00162714
               LENGTH=07,                                              X00162806
               ATTRB=(ASKIP,BRT),                                      X00162906
               INITIAL='TICKETS'                                        00163006
*                                                                       00163106
        DFHMDF POS=(03,59),                                            X00163213
               LENGTH=05,                                              X00163306
               ATTRB=(ASKIP,BRT),                                      X00163406
               INITIAL='LINES'                                          00163506
*                                                                       00163606
        DFHMDF POS=(03,66),                                            X00163712
               LENGTH=04,                                              X00163806
               ATTRB=(ASKIP,BRT),                                      X00163906
               INITIAL='TYPE'                                           00164006
*                                                                       00164106
        DFHMDF POS=(03,74),                                            X00164219
               LENGTH=04,                                              X00164306
               ATTRB=(ASKIP,BRT),                                      X00164406
               INITIAL='PRTY'                                           00164506
*********************************************************************** 00165006
*                                                                       00175700
AUSR01  DFHMDF POS=(05,02),                                            X00175822
               LENGTH=08,                                              X00175901
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00176000
               PICOUT='XXXXXXXX'                                        00176101
*                                                                       00176200
APO01   DFHMDF POS=(05,11),                                            X00176322
               LENGTH=08,                                              X00176415
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00176600
               PICOUT='99999999'                                        00176715
*                                                                       00176800
ASTAT01 DFHMDF POS=(05,21),                                            X00176922
               LENGTH=01,                                              X00177004
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00177100
               PICOUT='X'                                               00177204
*                                                                       00177301
ARDTE01 DFHMDF POS=(05,23),                                            X00177422
               LENGTH=08,                                              X00177506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00177601
               PICOUT='XXXXXXXX'                                        00177701
*                                                                       00177801
APDTE01 DFHMDF POS=(05,32),                                            X00177922
               LENGTH=08,                                              X00178001
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00178101
               PICOUT='XXXXXXXX'                                        00178201
*                                                                       00178306
AADTE01 DFHMDF POS=(05,41),                                            X00178422
               LENGTH=08,                                              X00178506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00178606
               PICOUT='XXXXXXXX'                                        00178706
*                                                                       00178801
ATIX01  DFHMDF POS=(05,50),                                            X00178922
               LENGTH=08,                                              X00179001
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00179101
               PICOUT='ZZZZ,ZZ9'                                        00179201
*                                                                       00179301
ALNS01  DFHMDF POS=(05,59),                                            X00179422
               LENGTH=05,                                              X00179501
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00179601
               PICOUT='Z,ZZ9'                                           00179701
*                                                                       00179801
ATYPE01 DFHMDF POS=(05,65),                                            X00179922
               LENGTH=09,                                              X00180001
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00180101
               PICOUT='XXXXXXXXX'                                       00180201
*                                                                       00180301
APRTY01 DFHMDF POS=(05,75),                                            X00180422
               LENGTH=02,                                              X00180501
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00180601
               PICOUT='XX'                                              00180701
*********************************************************************** 00180801
AUSR02  DFHMDF POS=(06,02),                                            X00181822
               LENGTH=08,                                              X00181901
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00182001
               PICOUT='XXXXXXXX'                                        00182101
*                                                                       00182201
APO02   DFHMDF POS=(06,11),                                            X00182322
               LENGTH=08,                                              X00182415
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00182501
               PICOUT='99999999'                                        00182615
*                                                                       00182701
ASTAT02 DFHMDF POS=(06,21),                                            X00182822
               LENGTH=01,                                              X00182904
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00183001
               PICOUT='X'                                               00183105
*                                                                       00183201
ARDTE02 DFHMDF POS=(06,23),                                            X00183322
               LENGTH=08,                                              X00183401
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00183501
               PICOUT='XXXXXXXX'                                        00183601
*                                                                       00183706
APDTE02 DFHMDF POS=(06,32),                                            X00183822
               LENGTH=08,                                              X00183906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00184006
               PICOUT='XXXXXXXX'                                        00184106
*                                                                       00184206
AADTE02 DFHMDF POS=(06,41),                                            X00184322
               LENGTH=08,                                              X00184406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00184506
               PICOUT='XXXXXXXX'                                        00184606
*                                                                       00184706
ATIX02  DFHMDF POS=(06,50),                                            X00184822
               LENGTH=08,                                              X00184906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00185006
               PICOUT='ZZZZ,ZZ9'                                        00185106
*                                                                       00185206
ALNS02  DFHMDF POS=(06,59),                                            X00185322
               LENGTH=05,                                              X00185406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00185506
               PICOUT='Z,ZZ9'                                           00185606
*                                                                       00185706
ATYPE02 DFHMDF POS=(06,65),                                            X00185822
               LENGTH=09,                                              X00185906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00186006
               PICOUT='XXXXXXXXX'                                       00186106
*                                                                       00186206
APRTY02 DFHMDF POS=(06,75),                                            X00186322
               LENGTH=02,                                              X00186406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00186506
               PICOUT='XX'                                              00186606
*********************************************************************** 00186706
AUSR03  DFHMDF POS=(07,02),                                            X00187722
               LENGTH=08,                                              X00187806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00187906
               PICOUT='XXXXXXXX'                                        00188006
*                                                                       00188106
APO03   DFHMDF POS=(07,11),                                            X00188222
               LENGTH=08,                                              X00188315
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00188406
               PICOUT='99999999'                                        00188515
*                                                                       00188606
ASTAT03 DFHMDF POS=(07,21),                                            X00188722
               LENGTH=01,                                              X00188806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00188906
               PICOUT='X'                                               00189006
*                                                                       00189106
ARDTE03 DFHMDF POS=(07,23),                                            X00189222
               LENGTH=08,                                              X00189306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00189406
               PICOUT='XXXXXXXX'                                        00189506
*                                                                       00189606
APDTE03 DFHMDF POS=(07,32),                                            X00189722
               LENGTH=08,                                              X00189806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00189906
               PICOUT='XXXXXXXX'                                        00190006
*                                                                       00190106
AADTE03 DFHMDF POS=(07,41),                                            X00190222
               LENGTH=08,                                              X00190306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00190406
               PICOUT='XXXXXXXX'                                        00190506
*                                                                       00190606
ATIX03  DFHMDF POS=(07,50),                                            X00190722
               LENGTH=08,                                              X00190806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00190906
               PICOUT='ZZZZ,ZZ9'                                        00191006
*                                                                       00191106
ALNS03  DFHMDF POS=(07,59),                                            X00191222
               LENGTH=05,                                              X00191306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00191406
               PICOUT='Z,ZZ9'                                           00191506
*                                                                       00191606
ATYPE03 DFHMDF POS=(07,65),                                            X00191722
               LENGTH=09,                                              X00191806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00191906
               PICOUT='XXXXXXXXX'                                       00192006
*                                                                       00192106
APRTY03 DFHMDF POS=(07,75),                                            X00192222
               LENGTH=02,                                              X00192306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00192406
               PICOUT='XX'                                              00192506
*********************************************************************** 00192606
AUSR04  DFHMDF POS=(08,02),                                            X00193622
               LENGTH=08,                                              X00193706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00193806
               PICOUT='XXXXXXXX'                                        00193906
*                                                                       00194006
APO04   DFHMDF POS=(08,11),                                            X00194122
               LENGTH=08,                                              X00194215
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00194306
               PICOUT='99999999'                                        00194415
*                                                                       00194506
ASTAT04 DFHMDF POS=(08,21),                                            X00194622
               LENGTH=01,                                              X00194706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00194806
               PICOUT='X'                                               00194906
*                                                                       00195006
ARDTE04 DFHMDF POS=(08,23),                                            X00195122
               LENGTH=08,                                              X00195206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00195306
               PICOUT='XXXXXXXX'                                        00195406
*                                                                       00195506
APDTE04 DFHMDF POS=(08,32),                                            X00195622
               LENGTH=08,                                              X00195706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00195806
               PICOUT='XXXXXXXX'                                        00195906
*                                                                       00196006
AADTE04 DFHMDF POS=(08,41),                                            X00196122
               LENGTH=08,                                              X00196206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00196306
               PICOUT='XXXXXXXX'                                        00196406
*                                                                       00196506
ATIX04  DFHMDF POS=(08,50),                                            X00196622
               LENGTH=08,                                              X00196706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00196806
               PICOUT='ZZZZ,ZZ9'                                        00196906
*                                                                       00197006
ALNS04  DFHMDF POS=(08,59),                                            X00197122
               LENGTH=05,                                              X00197206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00197306
               PICOUT='Z,ZZ9'                                           00197406
*                                                                       00197506
ATYPE04 DFHMDF POS=(08,65),                                            X00197622
               LENGTH=09,                                              X00197706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00197806
               PICOUT='XXXXXXXXX'                                       00197906
*                                                                       00198006
APRTY04 DFHMDF POS=(08,75),                                            X00198122
               LENGTH=02,                                              X00198206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00198306
               PICOUT='XX'                                              00198406
*********************************************************************** 00198506
AUSR05  DFHMDF POS=(09,02),                                            X00199522
               LENGTH=08,                                              X00199606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00199706
               PICOUT='XXXXXXXX'                                        00199806
*                                                                       00199906
APO05   DFHMDF POS=(09,11),                                            X00200022
               LENGTH=08,                                              X00200115
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00200206
               PICOUT='99999999'                                        00200315
*                                                                       00200406
ASTAT05 DFHMDF POS=(09,21),                                            X00200522
               LENGTH=01,                                              X00200606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00200706
               PICOUT='X'                                               00200806
*                                                                       00200906
ARDTE05 DFHMDF POS=(09,23),                                            X00201022
               LENGTH=08,                                              X00201106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00201206
               PICOUT='XXXXXXXX'                                        00201306
*                                                                       00201406
APDTE05 DFHMDF POS=(09,32),                                            X00201522
               LENGTH=08,                                              X00201606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00201706
               PICOUT='XXXXXXXX'                                        00201806
*                                                                       00201906
AADTE05 DFHMDF POS=(09,41),                                            X00202022
               LENGTH=08,                                              X00202106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00202206
               PICOUT='XXXXXXXX'                                        00202306
*                                                                       00202406
ATIX05  DFHMDF POS=(09,50),                                            X00202522
               LENGTH=08,                                              X00202606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00202706
               PICOUT='ZZZZ,ZZ9'                                        00202806
*                                                                       00202906
ALNS05  DFHMDF POS=(09,59),                                            X00203022
               LENGTH=05,                                              X00203106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00203206
               PICOUT='Z,ZZ9'                                           00203306
*                                                                       00203406
ATYPE05 DFHMDF POS=(09,65),                                            X00203522
               LENGTH=09,                                              X00203606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00203706
               PICOUT='XXXXXXXXX'                                       00203806
*                                                                       00203906
APRTY05 DFHMDF POS=(09,75),                                            X00204022
               LENGTH=02,                                              X00204106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00204206
               PICOUT='XX'                                              00204306
*********************************************************************** 00204406
AUSR06  DFHMDF POS=(10,02),                                            X00205422
               LENGTH=08,                                              X00205506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00205606
               PICOUT='XXXXXXXX'                                        00205706
*                                                                       00205806
APO06   DFHMDF POS=(10,11),                                            X00205922
               LENGTH=08,                                              X00206015
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00206106
               PICOUT='99999999'                                        00206215
*                                                                       00206306
ASTAT06 DFHMDF POS=(10,21),                                            X00206422
               LENGTH=01,                                              X00206506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00206606
               PICOUT='X'                                               00206706
*                                                                       00206806
A4DTE06 DFHMDF POS=(10,23),                                            X00206922
               LENGTH=08,                                              X00207006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00207106
               PICOUT='XXXXXXXX'                                        00207206
*                                                                       00207306
APDTE06 DFHMDF POS=(10,32),                                            X00207422
               LENGTH=08,                                              X00207506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00207606
               PICOUT='XXXXXXXX'                                        00207706
*                                                                       00207806
AADTE06 DFHMDF POS=(10,41),                                            X00207922
               LENGTH=08,                                              X00208006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00208106
               PICOUT='XXXXXXXX'                                        00208206
*                                                                       00208306
ATIX06  DFHMDF POS=(10,50),                                            X00208422
               LENGTH=08,                                              X00208506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00208606
               PICOUT='ZZZZ,ZZ9'                                        00208706
*                                                                       00208806
ALNS06  DFHMDF POS=(10,59),                                            X00208922
               LENGTH=05,                                              X00209006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00209106
               PICOUT='Z,ZZ9'                                           00209206
*                                                                       00209306
ATYPE06 DFHMDF POS=(10,65),                                            X00209422
               LENGTH=09,                                              X00209506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00209606
               PICOUT='XXXXXXXXX'                                       00209706
*                                                                       00209806
APRTY06 DFHMDF POS=(10,75),                                            X00209922
               LENGTH=02,                                              X00210006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00210106
               PICOUT='XX'                                              00210206
*********************************************************************** 00210306
AUSR07  DFHMDF POS=(11,02),                                            X00211322
               LENGTH=08,                                              X00211406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00211506
               PICOUT='XXXXXXXX'                                        00211606
*                                                                       00211706
APO07   DFHMDF POS=(11,11),                                            X00211822
               LENGTH=08,                                              X00211915
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00212006
               PICOUT='99999999'                                        00212115
*                                                                       00212206
ASTAT07 DFHMDF POS=(11,21),                                            X00212322
               LENGTH=01,                                              X00212406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00212506
               PICOUT='X'                                               00212606
*                                                                       00212706
ARDTE07 DFHMDF POS=(11,23),                                            X00212822
               LENGTH=08,                                              X00212906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00213006
               PICOUT='XXXXXXXX'                                        00213106
*                                                                       00213206
APDTE07 DFHMDF POS=(11,32),                                            X00213322
               LENGTH=08,                                              X00213406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00213506
               PICOUT='XXXXXXXX'                                        00213606
*                                                                       00213706
AADTE07 DFHMDF POS=(11,41),                                            X00213822
               LENGTH=08,                                              X00213906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00214006
               PICOUT='XXXXXXXX'                                        00214106
*                                                                       00214206
ATIX07  DFHMDF POS=(11,50),                                            X00214322
               LENGTH=08,                                              X00214406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00214506
               PICOUT='ZZZZ,ZZ9'                                        00214606
*                                                                       00214706
ALNS07  DFHMDF POS=(11,59),                                            X00214822
               LENGTH=05,                                              X00214906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00215006
               PICOUT='Z,ZZ9'                                           00215106
*                                                                       00215206
ATYPE07 DFHMDF POS=(11,65),                                            X00215322
               LENGTH=09,                                              X00215406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00215506
               PICOUT='XXXXXXXXX'                                       00215606
*                                                                       00215706
APRTY07 DFHMDF POS=(11,75),                                            X00215822
               LENGTH=02,                                              X00215906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00216006
               PICOUT='XX'                                              00216106
*********************************************************************** 00216206
AUSR08  DFHMDF POS=(12,02),                                            X00217222
               LENGTH=08,                                              X00217306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00217406
               PICOUT='XXXXXXXX'                                        00217506
*                                                                       00217606
APO08   DFHMDF POS=(12,11),                                            X00217722
               LENGTH=08,                                              X00217815
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00217906
               PICOUT='99999999'                                        00218015
*                                                                       00218106
ASTAT08 DFHMDF POS=(12,21),                                            X00218222
               LENGTH=01,                                              X00218306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00218406
               PICOUT='X'                                               00218506
*                                                                       00218606
ARDTE08 DFHMDF POS=(12,23),                                            X00218722
               LENGTH=08,                                              X00218806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00218906
               PICOUT='XXXXXXXX'                                        00219006
*                                                                       00219106
APDTE08 DFHMDF POS=(12,32),                                            X00219222
               LENGTH=08,                                              X00219306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00219406
               PICOUT='XXXXXXXX'                                        00219506
*                                                                       00219606
AADTE08 DFHMDF POS=(12,41),                                            X00219722
               LENGTH=08,                                              X00219806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00219906
               PICOUT='XXXXXXXX'                                        00220006
*                                                                       00220106
ATIX08  DFHMDF POS=(12,50),                                            X00220222
               LENGTH=08,                                              X00220306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00220406
               PICOUT='ZZZZ,ZZ9'                                        00220506
*                                                                       00220606
ALNS08  DFHMDF POS=(12,59),                                            X00220722
               LENGTH=05,                                              X00220806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00220906
               PICOUT='Z,ZZ9'                                           00221006
*                                                                       00221106
ATYPE08 DFHMDF POS=(12,65),                                            X00221222
               LENGTH=09,                                              X00221306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00221406
               PICOUT='XXXXXXXXX'                                       00221506
*                                                                       00221606
APRTY08 DFHMDF POS=(12,75),                                            X00221722
               LENGTH=02,                                              X00221806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00221906
               PICOUT='XX'                                              00222006
*********************************************************************** 00222106
AUSR09  DFHMDF POS=(13,02),                                            X00223122
               LENGTH=08,                                              X00223206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00223306
               PICOUT='XXXXXXXX'                                        00223406
*                                                                       00223506
APO09   DFHMDF POS=(13,11),                                            X00223622
               LENGTH=08,                                              X00223715
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00223806
               PICOUT='99999999'                                        00223915
*                                                                       00224006
ASTAT09 DFHMDF POS=(13,21),                                            X00224122
               LENGTH=01,                                              X00224206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00224306
               PICOUT='X'                                               00224406
*                                                                       00224506
ARDTE09 DFHMDF POS=(13,23),                                            X00224622
               LENGTH=08,                                              X00224706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00224806
               PICOUT='XXXXXXXX'                                        00224906
*                                                                       00225006
APDTE09 DFHMDF POS=(13,32),                                            X00225122
               LENGTH=08,                                              X00225206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00225306
               PICOUT='XXXXXXXX'                                        00225406
*                                                                       00225506
AADTE09 DFHMDF POS=(13,41),                                            X00225622
               LENGTH=08,                                              X00225706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00225806
               PICOUT='XXXXXXXX'                                        00225906
*                                                                       00226006
ATIX09  DFHMDF POS=(13,50),                                            X00226122
               LENGTH=08,                                              X00226206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00226306
               PICOUT='ZZZZ,ZZ9'                                        00226406
*                                                                       00226506
ALNS09  DFHMDF POS=(13,59),                                            X00226622
               LENGTH=05,                                              X00226706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00226806
               PICOUT='Z,ZZ9'                                           00226906
*                                                                       00227006
ATYPE09 DFHMDF POS=(13,65),                                            X00227122
               LENGTH=09,                                              X00227206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00227306
               PICOUT='XXXXXXXXX'                                       00227406
*                                                                       00227506
APRTY09 DFHMDF POS=(13,75),                                            X00227622
               LENGTH=02,                                              X00227706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00227806
               PICOUT='XX'                                              00227906
*********************************************************************** 00228006
AUSR10  DFHMDF POS=(14,02),                                            X00229022
               LENGTH=08,                                              X00229106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00229206
               PICOUT='XXXXXXXX'                                        00229306
*                                                                       00229406
APO10   DFHMDF POS=(14,11),                                            X00229522
               LENGTH=08,                                              X00229615
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00229706
               PICOUT='99999999'                                        00229815
*                                                                       00229906
ASTAT10 DFHMDF POS=(14,21),                                            X00230022
               LENGTH=01,                                              X00230106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00230206
               PICOUT='X'                                               00230306
*                                                                       00230406
ARDTE10 DFHMDF POS=(14,23),                                            X00230522
               LENGTH=08,                                              X00230606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00230706
               PICOUT='XXXXXXXX'                                        00230806
*                                                                       00230906
APDTE10 DFHMDF POS=(14,32),                                            X00231022
               LENGTH=08,                                              X00231106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00231206
               PICOUT='XXXXXXXX'                                        00231306
*                                                                       00231406
AADTE10 DFHMDF POS=(14,41),                                            X00231522
               LENGTH=08,                                              X00231606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00231706
               PICOUT='XXXXXXXX'                                        00231806
*                                                                       00231906
ATIX10  DFHMDF POS=(14,50),                                            X00232022
               LENGTH=08,                                              X00232106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00232206
               PICOUT='ZZZZ,ZZ9'                                        00232306
*                                                                       00232406
ALNS10  DFHMDF POS=(14,59),                                            X00232522
               LENGTH=05,                                              X00232606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00232706
               PICOUT='Z,ZZ9'                                           00232806
*                                                                       00232906
ATYPE10 DFHMDF POS=(14,65),                                            X00233022
               LENGTH=09,                                              X00233106
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00233206
               PICOUT='XXXXXXXXX'                                       00233306
*                                                                       00233406
APRTY10 DFHMDF POS=(14,75),                                            X00233522
               LENGTH=02,                                              X00233606
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00233706
               PICOUT='XX'                                              00233806
*********************************************************************** 00233906
AUSR11  DFHMDF POS=(15,02),                                            X00234922
               LENGTH=08,                                              X00235006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00235106
               PICOUT='XXXXXXXX'                                        00235206
*                                                                       00235306
APO11   DFHMDF POS=(15,11),                                            X00235422
               LENGTH=08,                                              X00235515
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00235606
               PICOUT='99999999'                                        00235715
*                                                                       00235806
ASTAT11 DFHMDF POS=(15,21),                                            X00235922
               LENGTH=01,                                              X00236006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00236106
               PICOUT='X'                                               00236206
*                                                                       00236306
ARDTE11 DFHMDF POS=(15,23),                                            X00236422
               LENGTH=08,                                              X00236506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00236606
               PICOUT='XXXXXXXX'                                        00236706
*                                                                       00236806
APDTE11 DFHMDF POS=(15,32),                                            X00236922
               LENGTH=08,                                              X00237006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00237106
               PICOUT='XXXXXXXX'                                        00237206
*                                                                       00237306
AADTE11 DFHMDF POS=(15,41),                                            X00237422
               LENGTH=08,                                              X00237506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00237606
               PICOUT='XXXXXXXX'                                        00237706
*                                                                       00237806
ATIX11  DFHMDF POS=(15,50),                                            X00237922
               LENGTH=08,                                              X00238006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00238106
               PICOUT='ZZZZ,ZZ9'                                        00238206
*                                                                       00238306
ALNS11  DFHMDF POS=(15,59),                                            X00238422
               LENGTH=05,                                              X00238506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00238606
               PICOUT='Z,ZZ9'                                           00238706
*                                                                       00238806
ATYPE11 DFHMDF POS=(15,65),                                            X00238922
               LENGTH=09,                                              X00239006
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00239106
               PICOUT='XXXXXXXXX'                                       00239206
*                                                                       00239306
APRTY11 DFHMDF POS=(15,75),                                            X00239422
               LENGTH=02,                                              X00239506
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00239606
               PICOUT='XX'                                              00239706
*********************************************************************** 00239806
AUSR12  DFHMDF POS=(16,02),                                            X00240822
               LENGTH=08,                                              X00240906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00241006
               PICOUT='XXXXXXXX'                                        00241106
*                                                                       00241206
APO12   DFHMDF POS=(16,11),                                            X00241322
               LENGTH=08,                                              X00241415
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00241506
               PICOUT='99999999'                                        00241615
*                                                                       00241706
ASTAT12 DFHMDF POS=(16,21),                                            X00241822
               LENGTH=01,                                              X00241906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00242006
               PICOUT='X'                                               00242106
*                                                                       00242206
ARDTE12 DFHMDF POS=(16,23),                                            X00242322
               LENGTH=08,                                              X00242406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00242506
               PICOUT='XXXXXXXX'                                        00242606
*                                                                       00242706
APDTE12 DFHMDF POS=(16,32),                                            X00242822
               LENGTH=08,                                              X00242906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00243006
               PICOUT='XXXXXXXX'                                        00243106
*                                                                       00243206
AADTE12 DFHMDF POS=(16,41),                                            X00243322
               LENGTH=08,                                              X00243406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00243506
               PICOUT='XXXXXXXX'                                        00243606
*                                                                       00243706
ATIX12  DFHMDF POS=(16,50),                                            X00243822
               LENGTH=08,                                              X00243906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00244006
               PICOUT='ZZZZ,ZZ9'                                        00244106
*                                                                       00244206
ALNS12  DFHMDF POS=(16,59),                                            X00244322
               LENGTH=05,                                              X00244406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00244506
               PICOUT='Z,ZZ9'                                           00244606
*                                                                       00244706
ATYPE12 DFHMDF POS=(16,65),                                            X00244822
               LENGTH=09,                                              X00244906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00245006
               PICOUT='XXXXXXXXX'                                       00245106
*                                                                       00245206
APRTY12 DFHMDF POS=(16,75),                                            X00245322
               LENGTH=02,                                              X00245406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00245506
               PICOUT='XX'                                              00245606
*                                                                       00245706
*********************************************************************** 00245806
AUSR13  DFHMDF POS=(17,02),                                            X00249322
               LENGTH=08,                                              X00249401
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00249501
               PICOUT='XXXXXXXX'                                        00249601
*                                                                       00249701
APO13   DFHMDF POS=(17,11),                                            X00249822
               LENGTH=08,                                              X00249915
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00250001
               PICOUT='99999999'                                        00250115
*                                                                       00250201
ASTAT13 DFHMDF POS=(17,21),                                            X00250322
               LENGTH=01,                                              X00250404
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00250501
               PICOUT='X'                                               00250604
*                                                                       00250701
ARDTE13 DFHMDF POS=(17,23),                                            X00250822
               LENGTH=08,                                              X00250901
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00251001
               PICOUT='XXXXXXXX'                                        00251101
*                                                                       00251201
APDTE13 DFHMDF POS=(17,32),                                            X00251322
               LENGTH=08,                                              X00251406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00251506
               PICOUT='XXXXXXXX'                                        00251606
*                                                                       00251706
AADTE13 DFHMDF POS=(17,41),                                            X00251822
               LENGTH=08,                                              X00251906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00252006
               PICOUT='XXXXXXXX'                                        00252106
*                                                                       00252206
ATIX13  DFHMDF POS=(17,50),                                            X00252322
               LENGTH=08,                                              X00252406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00252506
               PICOUT='ZZZZ,ZZ9'                                        00252606
*                                                                       00252706
ALNS13  DFHMDF POS=(17,59),                                            X00252822
               LENGTH=05,                                              X00252906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00253006
               PICOUT='Z,ZZ9'                                           00253106
*                                                                       00253206
ATYPE13 DFHMDF POS=(17,65),                                            X00253322
               LENGTH=09,                                              X00253406
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00253506
               PICOUT='XXXXXXXXX'                                       00253606
*                                                                       00253706
APRTY13 DFHMDF POS=(17,75),                                            X00253822
               LENGTH=02,                                              X00253906
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00254006
               PICOUT='XX'                                              00254106
*********************************************************************** 00254206
AUSR14  DFHMDF POS=(18,02),                                            X00255222
               LENGTH=08,                                              X00255306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00255406
               PICOUT='XXXXXXXX'                                        00255506
*                                                                       00255606
APO14   DFHMDF POS=(18,11),                                            X00255722
               LENGTH=08,                                              X00255815
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00255906
               PICOUT='99999999'                                        00256015
*                                                                       00256106
ASTAT14 DFHMDF POS=(18,21),                                            X00256222
               LENGTH=01,                                              X00256306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00256406
               PICOUT='X'                                               00256506
*                                                                       00256606
ARDTE14 DFHMDF POS=(18,23),                                            X00256722
               LENGTH=08,                                              X00256806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00256906
               PICOUT='XXXXXXXX'                                        00257006
*                                                                       00257106
APDTE14 DFHMDF POS=(18,32),                                            X00257222
               LENGTH=08,                                              X00257306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00257406
               PICOUT='XXXXXXXX'                                        00257506
*                                                                       00257606
AADTE14 DFHMDF POS=(18,41),                                            X00257722
               LENGTH=08,                                              X00257806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00257906
               PICOUT='XXXXXXXX'                                        00258006
*                                                                       00258106
ATIX14  DFHMDF POS=(18,50),                                            X00258222
               LENGTH=08,                                              X00258306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00258406
               PICOUT='ZZZZ,ZZ9'                                        00258506
*                                                                       00258606
ALNS14  DFHMDF POS=(18,59),                                            X00258722
               LENGTH=05,                                              X00258806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00258906
               PICOUT='Z,ZZ9'                                           00259006
*                                                                       00259106
ATYPE14 DFHMDF POS=(18,65),                                            X00259222
               LENGTH=09,                                              X00259306
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00259406
               PICOUT='XXXXXXXXX'                                       00259506
*                                                                       00259606
APRTY14 DFHMDF POS=(18,75),                                            X00259722
               LENGTH=02,                                              X00259806
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00259906
               PICOUT='XX'                                              00260006
*********************************************************************** 00260106
AUSR15  DFHMDF POS=(19,02),                                            X00261122
               LENGTH=08,                                              X00261206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00261306
               PICOUT='XXXXXXXX'                                        00261406
*                                                                       00261506
APO15   DFHMDF POS=(19,11),                                            X00261622
               LENGTH=08,                                              X00261715
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00261806
               PICOUT='99999999'                                        00261915
*                                                                       00262006
ASTAT15 DFHMDF POS=(19,21),                                            X00262122
               LENGTH=01,                                              X00262206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00262306
               PICOUT='X'                                               00262406
*                                                                       00262506
ARDTE15 DFHMDF POS=(19,23),                                            X00262622
               LENGTH=08,                                              X00262706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00262806
               PICOUT='XXXXXXXX'                                        00262906
*                                                                       00263006
APDTE15 DFHMDF POS=(19,32),                                            X00263122
               LENGTH=08,                                              X00263206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00263306
               PICOUT='XXXXXXXX'                                        00263406
*                                                                       00263506
AADTE15 DFHMDF POS=(19,41),                                            X00263622
               LENGTH=08,                                              X00263706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00263806
               PICOUT='XXXXXXXX'                                        00263906
*                                                                       00264006
ATIX15  DFHMDF POS=(19,50),                                            X00264122
               LENGTH=08,                                              X00264206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00264306
               PICOUT='ZZZZ,ZZ9'                                        00264406
*                                                                       00264506
ALNS15  DFHMDF POS=(19,59),                                            X00264622
               LENGTH=05,                                              X00264706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00264806
               PICOUT='Z,ZZ9'                                           00264906
*                                                                       00265006
ATYPE15 DFHMDF POS=(19,65),                                            X00265122
               LENGTH=09,                                              X00265206
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00265306
               PICOUT='XXXXXXXXX'                                       00265406
*                                                                       00265506
APRTY15 DFHMDF POS=(19,75),                                            X00265622
               LENGTH=02,                                              X00265706
               ATTRB=(ASKIP,BRT),COLOR=BLUE,                           X00265806
               PICOUT='XX'                                              00265906
*                                                                       00266021
        DFHMSD TYPE=FINAL                                               00304500
        PRINT NOGEN                                                     00305000
        END                                                             00310000
