        PRINT NOGEN                                                     00010000
VLKM521 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL521A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(01,46),                                            X00120000
               LENGTH=06,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='ITEMS:'                                         00150000
ASTRTIT DFHMDF POS=(01,54),                                            X00160000
               ATTRB=UNPROT,                                           X00170000
               HILIGHT=UNDERLINE,                                      X00180000
               LENGTH=05,                                              X00190000
               PICOUT='ZZZZZ'                                           00200000
*                                                                       00210000
        DFHMDF POS=(01,60),                                            X00220000
               LENGTH=02,                                              X00230000
               ATTRB=(ASKIP,BRT),                                      X00240000
               INITIAL='TO'                                             00250000
AENDIT  DFHMDF POS=(01,63),                                            X00260000
               COLOR=BLUE,                                             X00260100
               ATTRB=(ASKIP,BRT),                                      X00261000
               LENGTH=05,                                              X00290000
               PICOUT='ZZZZZ'                                           00300000
*                                                                       00310000
        DFHMDF POS=(01,69),                                            X00320000
               LENGTH=02,                                              X00330000
               ATTRB=(ASKIP,BRT),                                      X00340000
               INITIAL='OF'                                             00350000
ATOTIT  DFHMDF POS=(01,72),                                            X00360000
               COLOR=BLUE,                                             X00361000
               ATTRB=(ASKIP,BRT),                                      X00362000
               LENGTH=05,                                              X00390000
               PICOUT='ZZZZZ'                                           00400000
*                                                                       00410000
*********************************************************************** 00420000
        DFHMDF POS=(02,10),                                            X00430001
               LENGTH=06,                                              X00440001
               ATTRB=(ASKIP,BRT),                                      X00450000
               INITIAL='TICKET'                                         00460001
*                                                                       00461001
        DFHMDF POS=(02,20),                                            X00462001
               LENGTH=04,                                              X00463001
               ATTRB=(ASKIP,BRT),                                      X00464001
               INITIAL='OPER'                                           00465001
*                                                                       00470000
        DFHMDF POS=(02,26),                                            X00480001
               LENGTH=05,                                              X00490000
               ATTRB=(ASKIP,BRT),                                      X00500000
               INITIAL='FCLTY'                                          00510000
*                                                                       00520000
        DFHMDF POS=(02,33),                                            X00530001
               LENGTH=06,                                              X00540000
               ATTRB=(ASKIP,BRT),                                      X00550000
               INITIAL='TICKET OFFICE'                                  00560000
*                                                                       00570000
*********************************************************************** 00670000
        DFHMDF POS=(03,01),                                            X00680000
               LENGTH=03,                                              X00690000
               ATTRB=(ASKIP,BRT),                                      X00700000
               INITIAL='SEL'                                            00710000
*                                                                       00720000
        DFHMDF POS=(03,05),                                            X00730000
               LENGTH=03,                                              X00740000
               ATTRB=(ASKIP,BRT),                                      X00750000
               INITIAL='ACT'                                            00760000
*                                                                       00770000
        DFHMDF POS=(03,10),                                            X00780000
               LENGTH=06,                                              X00790000
               ATTRB=(ASKIP,BRT),                                      X00800000
               INITIAL='OFFICE'                                         00810001
*                                                                       00811001
        DFHMDF POS=(03,18),                                            X00812001
               LENGTH=06,                                              X00813001
               ATTRB=(ASKIP,BRT),                                      X00814001
               INITIAL='UNT ID'                                         00815001
*                                                                       00820000
        DFHMDF POS=(03,27),                                            X00830001
               LENGTH=02,                                              X00840000
               ATTRB=(ASKIP,BRT),                                      X00850000
               INITIAL='ID'                                             00860000
*                                                                       00870000
        DFHMDF POS=(03,33),                                            X00880001
               LENGTH=10,                                              X00890000
               ATTRB=(ASKIP,BRT),                                      X00900000
               INITIAL='ADDRESS ID'                                     00910000
*********************************************************************** 01080000
ASEL01  DFHMDF POS=(04,02),                                            X01090000
               LENGTH=01,                                              X01100000
               ATTRB=UNPROT,                                           X01110000
               HILIGHT=UNDERLINE,                                      X01120000
               PICOUT='X'                                               01130000
        DFHMDF POS=(04,04),                                            X01131000
               LENGTH=00,                                              X01132000
               ATTRB=(ASKIP,BRT)                                        01133000
*                                                                       01140000
AACT01  DFHMDF POS=(04,05),                                            X01172000
               LENGTH=03,                                              X01173000
               ATTRB=(ASKIP,BRT)                                        01174000
*                                                                       01180000
ATOFF01 DFHMDF POS=(04,10),                                            X01181003
               COLOR=BLUE,                                             X01181100
               LENGTH=06,                                              X01182003
               ATTRB=(ASKIP,BRT)                                        01183000
*                                                                       01183101
AOPER01 DFHMDF POS=(04,19),                                            X01183201
               COLOR=BLUE,                                             X01183301
               LENGTH=04,                                              X01183401
               ATTRB=(ASKIP,BRT)                                        01183501
*                                                                       01184000
ASLSH01 DFHMDF POS=(04,24),                                            X01190004
               COLOR=BLUE,                                             X01191000
               LENGTH=01,                                              X01200001
               INITIAL='/',                                            X01201001
               ATTRB=(ASKIP,BRT)                                        01210000
*                                                                       01211001
AFCLT01 DFHMDF POS=(04,26),                                            X01212001
               COLOR=BLUE,                                             X01213001
               LENGTH=04,                                              X01214001
               ATTRB=(ASKIP,BRT)                                        01215001
*                                                                       01220000
ADEST01 DFHMDF POS=(04,34),                                            X01230001
               COLOR=BLUE,                                             X01240000
               LENGTH=08,                                              X01250000
               ATTRB=(ASKIP,BRT)                                        01260000
*********************************************************************** 01270000
ASEL02  DFHMDF POS=(05,02),                                            X01271001
               LENGTH=01,                                              X01272001
               ATTRB=UNPROT,                                           X01273001
               HILIGHT=UNDERLINE,                                      X01274001
               PICOUT='X'                                               01275001
        DFHMDF POS=(05,04),                                            X01276001
               LENGTH=00,                                              X01277001
               ATTRB=(ASKIP,BRT)                                        01278001
*                                                                       01279001
AACT02  DFHMDF POS=(05,05),                                            X01279101
               LENGTH=03,                                              X01279201
               ATTRB=(ASKIP,BRT)                                        01279301
*                                                                       01279401
ATOFF02 DFHMDF POS=(05,10),                                            X01279503
               COLOR=BLUE,                                             X01279601
               LENGTH=06,                                              X01279703
               ATTRB=(ASKIP,BRT)                                        01279801
*                                                                       01279901
AOPER02 DFHMDF POS=(05,19),                                            X01280001
               COLOR=BLUE,                                             X01280101
               LENGTH=04,                                              X01280201
               ATTRB=(ASKIP,BRT)                                        01280301
*                                                                       01280401
ASLSH02 DFHMDF POS=(05,24),                                            X01280504
               COLOR=BLUE,                                             X01280601
               LENGTH=01,                                              X01280701
               INITIAL='/',                                            X01280801
               ATTRB=(ASKIP,BRT)                                        01280901
*                                                                       01281001
AFCLT02 DFHMDF POS=(05,26),                                            X01281101
               COLOR=BLUE,                                             X01281201
               LENGTH=04,                                              X01281301
               ATTRB=(ASKIP,BRT)                                        01281401
*                                                                       01281501
ADEST02 DFHMDF POS=(05,34),                                            X01281601
               COLOR=BLUE,                                             X01281701
               LENGTH=08,                                              X01281801
               ATTRB=(ASKIP,BRT)                                        01281901
*********************************************************************** 01282001
ASEL03  DFHMDF POS=(06,02),                                            X01282101
               LENGTH=01,                                              X01282201
               ATTRB=UNPROT,                                           X01282301
               HILIGHT=UNDERLINE,                                      X01282401
               PICOUT='X'                                               01282501
        DFHMDF POS=(06,04),                                            X01282601
               LENGTH=00,                                              X01282701
               ATTRB=(ASKIP,BRT)                                        01282801
*                                                                       01282901
AACT03  DFHMDF POS=(06,05),                                            X01283001
               LENGTH=03,                                              X01283101
               ATTRB=(ASKIP,BRT)                                        01283201
*                                                                       01283301
ATOFF03 DFHMDF POS=(06,10),                                            X01283403
               COLOR=BLUE,                                             X01283501
               LENGTH=06,                                              X01283603
               ATTRB=(ASKIP,BRT)                                        01283701
*                                                                       01283801
AOPER03 DFHMDF POS=(06,19),                                            X01283901
               COLOR=BLUE,                                             X01284001
               LENGTH=04,                                              X01284101
               ATTRB=(ASKIP,BRT)                                        01284201
*                                                                       01284301
ASLSH03 DFHMDF POS=(06,24),                                            X01284404
               COLOR=BLUE,                                             X01284501
               LENGTH=01,                                              X01284601
               INITIAL='/',                                            X01284701
               ATTRB=(ASKIP,BRT)                                        01284801
*                                                                       01284901
AFCLT03 DFHMDF POS=(06,26),                                            X01285001
               COLOR=BLUE,                                             X01285101
               LENGTH=04,                                              X01285201
               ATTRB=(ASKIP,BRT)                                        01285301
*                                                                       01285401
ADEST03 DFHMDF POS=(06,34),                                            X01285501
               COLOR=BLUE,                                             X01285601
               LENGTH=08,                                              X01285701
               ATTRB=(ASKIP,BRT)                                        01285801
*********************************************************************** 01285901
ASEL04  DFHMDF POS=(07,02),                                            X01286001
               LENGTH=01,                                              X01286101
               ATTRB=UNPROT,                                           X01286201
               HILIGHT=UNDERLINE,                                      X01286301
               PICOUT='X'                                               01286401
        DFHMDF POS=(07,04),                                            X01286501
               LENGTH=00,                                              X01286601
               ATTRB=(ASKIP,BRT)                                        01286701
*                                                                       01286801
AACT04  DFHMDF POS=(07,05),                                            X01286901
               LENGTH=03,                                              X01287001
               ATTRB=(ASKIP,BRT)                                        01287101
*                                                                       01287201
ATOFF04 DFHMDF POS=(07,10),                                            X01287303
               COLOR=BLUE,                                             X01287401
               LENGTH=06,                                              X01287503
               ATTRB=(ASKIP,BRT)                                        01287601
*                                                                       01287701
AOPER04 DFHMDF POS=(07,19),                                            X01287801
               COLOR=BLUE,                                             X01287901
               LENGTH=04,                                              X01288001
               ATTRB=(ASKIP,BRT)                                        01288101
*                                                                       01288201
ASLSH04 DFHMDF POS=(07,24),                                            X01288304
               COLOR=BLUE,                                             X01288401
               LENGTH=01,                                              X01288501
               INITIAL='/',                                            X01288601
               ATTRB=(ASKIP,BRT)                                        01288701
*                                                                       01288801
AFCLT04 DFHMDF POS=(07,26),                                            X01288901
               COLOR=BLUE,                                             X01289001
               LENGTH=04,                                              X01289101
               ATTRB=(ASKIP,BRT)                                        01289201
*                                                                       01289301
ADEST04 DFHMDF POS=(07,34),                                            X01289401
               COLOR=BLUE,                                             X01289501
               LENGTH=08,                                              X01289601
               ATTRB=(ASKIP,BRT)                                        01289701
*********************************************************************** 01289801
ASEL05  DFHMDF POS=(08,02),                                            X01289901
               LENGTH=01,                                              X01290001
               ATTRB=UNPROT,                                           X01290101
               HILIGHT=UNDERLINE,                                      X01290201
               PICOUT='X'                                               01290301
        DFHMDF POS=(08,04),                                            X01290401
               LENGTH=00,                                              X01290501
               ATTRB=(ASKIP,BRT)                                        01290601
*                                                                       01290701
AACT05  DFHMDF POS=(08,05),                                            X01290801
               LENGTH=03,                                              X01290901
               ATTRB=(ASKIP,BRT)                                        01291001
*                                                                       01291101
ATOFF05 DFHMDF POS=(08,10),                                            X01291203
               COLOR=BLUE,                                             X01291301
               LENGTH=06,                                              X01291403
               ATTRB=(ASKIP,BRT)                                        01291501
*                                                                       01291601
AOPER05 DFHMDF POS=(08,19),                                            X01291701
               COLOR=BLUE,                                             X01291801
               LENGTH=04,                                              X01291901
               ATTRB=(ASKIP,BRT)                                        01292001
*                                                                       01292101
ASLSH05 DFHMDF POS=(08,24),                                            X01292204
               COLOR=BLUE,                                             X01292301
               LENGTH=01,                                              X01292401
               INITIAL='/',                                            X01292501
               ATTRB=(ASKIP,BRT)                                        01292601
*                                                                       01292701
AFCLT05 DFHMDF POS=(08,26),                                            X01292801
               COLOR=BLUE,                                             X01292901
               LENGTH=04,                                              X01293001
               ATTRB=(ASKIP,BRT)                                        01293101
*                                                                       01293201
ADEST05 DFHMDF POS=(08,34),                                            X01293301
               COLOR=BLUE,                                             X01293401
               LENGTH=08,                                              X01293501
               ATTRB=(ASKIP,BRT)                                        01293601
*********************************************************************** 01293701
ASEL06  DFHMDF POS=(09,02),                                            X01293801
               LENGTH=01,                                              X01293901
               ATTRB=UNPROT,                                           X01294001
               HILIGHT=UNDERLINE,                                      X01294101
               PICOUT='X'                                               01294201
        DFHMDF POS=(09,04),                                            X01294301
               LENGTH=00,                                              X01294401
               ATTRB=(ASKIP,BRT)                                        01294501
*                                                                       01294601
AACT06  DFHMDF POS=(09,05),                                            X01294701
               LENGTH=03,                                              X01294801
               ATTRB=(ASKIP,BRT)                                        01294901
*                                                                       01295001
ATOFF06 DFHMDF POS=(09,10),                                            X01295103
               COLOR=BLUE,                                             X01295201
               LENGTH=06,                                              X01295303
               ATTRB=(ASKIP,BRT)                                        01295401
*                                                                       01295501
AOPER06 DFHMDF POS=(09,19),                                            X01295601
               COLOR=BLUE,                                             X01295701
               LENGTH=04,                                              X01295801
               ATTRB=(ASKIP,BRT)                                        01295901
*                                                                       01296001
ASLSH06 DFHMDF POS=(09,24),                                            X01296104
               COLOR=BLUE,                                             X01296201
               LENGTH=01,                                              X01296301
               INITIAL='/',                                            X01296401
               ATTRB=(ASKIP,BRT)                                        01296501
*                                                                       01296601
AFCLT06 DFHMDF POS=(09,26),                                            X01296701
               COLOR=BLUE,                                             X01296801
               LENGTH=04,                                              X01296901
               ATTRB=(ASKIP,BRT)                                        01297001
*                                                                       01297101
ADEST06 DFHMDF POS=(09,34),                                            X01297201
               COLOR=BLUE,                                             X01297301
               LENGTH=08,                                              X01297401
               ATTRB=(ASKIP,BRT)                                        01297501
*********************************************************************** 01297601
ASEL07  DFHMDF POS=(10,02),                                            X01297701
               LENGTH=01,                                              X01297801
               ATTRB=UNPROT,                                           X01297901
               HILIGHT=UNDERLINE,                                      X01298001
               PICOUT='X'                                               01298101
        DFHMDF POS=(10,04),                                            X01298201
               LENGTH=00,                                              X01298301
               ATTRB=(ASKIP,BRT)                                        01298401
*                                                                       01298501
AACT07  DFHMDF POS=(10,05),                                            X01298601
               LENGTH=03,                                              X01298701
               ATTRB=(ASKIP,BRT)                                        01298801
*                                                                       01298901
ATOFF07 DFHMDF POS=(10,10),                                            X01299003
               COLOR=BLUE,                                             X01299101
               LENGTH=06,                                              X01299203
               ATTRB=(ASKIP,BRT)                                        01299301
*                                                                       01299401
AOPER07 DFHMDF POS=(10,19),                                            X01299501
               COLOR=BLUE,                                             X01299601
               LENGTH=04,                                              X01299701
               ATTRB=(ASKIP,BRT)                                        01299801
*                                                                       01299901
ASLSH07 DFHMDF POS=(10,24),                                            X01300004
               COLOR=BLUE,                                             X01300101
               LENGTH=01,                                              X01300201
               INITIAL='/',                                            X01300301
               ATTRB=(ASKIP,BRT)                                        01300401
*                                                                       01300501
AFCLT07 DFHMDF POS=(10,26),                                            X01300601
               COLOR=BLUE,                                             X01300701
               LENGTH=04,                                              X01300801
               ATTRB=(ASKIP,BRT)                                        01300901
*                                                                       01301001
ADEST07 DFHMDF POS=(10,34),                                            X01301101
               COLOR=BLUE,                                             X01301201
               LENGTH=08,                                              X01301301
               ATTRB=(ASKIP,BRT)                                        01301401
*********************************************************************** 01301501
ASEL08  DFHMDF POS=(11,02),                                            X01301601
               LENGTH=01,                                              X01301701
               ATTRB=UNPROT,                                           X01301801
               HILIGHT=UNDERLINE,                                      X01301901
               PICOUT='X'                                               01302001
        DFHMDF POS=(11,04),                                            X01302101
               LENGTH=00,                                              X01302201
               ATTRB=(ASKIP,BRT)                                        01302301
*                                                                       01302401
AACT08  DFHMDF POS=(11,05),                                            X01302501
               LENGTH=03,                                              X01302601
               ATTRB=(ASKIP,BRT)                                        01302701
*                                                                       01302801
ATOFF08 DFHMDF POS=(11,10),                                            X01302903
               COLOR=BLUE,                                             X01303001
               LENGTH=06,                                              X01303103
               ATTRB=(ASKIP,BRT)                                        01303201
*                                                                       01303301
AOPER08 DFHMDF POS=(11,19),                                            X01303401
               COLOR=BLUE,                                             X01303501
               LENGTH=04,                                              X01303601
               ATTRB=(ASKIP,BRT)                                        01303701
*                                                                       01303801
ASLSH08 DFHMDF POS=(11,24),                                            X01303904
               COLOR=BLUE,                                             X01304001
               LENGTH=01,                                              X01304101
               INITIAL='/',                                            X01304201
               ATTRB=(ASKIP,BRT)                                        01304301
*                                                                       01304401
AFCLT08 DFHMDF POS=(11,26),                                            X01304501
               COLOR=BLUE,                                             X01304601
               LENGTH=04,                                              X01304701
               ATTRB=(ASKIP,BRT)                                        01304801
*                                                                       01304901
ADEST08 DFHMDF POS=(11,34),                                            X01305001
               COLOR=BLUE,                                             X01305101
               LENGTH=08,                                              X01305201
               ATTRB=(ASKIP,BRT)                                        01305301
*********************************************************************** 01305401
ASEL09  DFHMDF POS=(12,02),                                            X01305501
               LENGTH=01,                                              X01305601
               ATTRB=UNPROT,                                           X01305701
               HILIGHT=UNDERLINE,                                      X01305801
               PICOUT='X'                                               01305901
        DFHMDF POS=(12,04),                                            X01306001
               LENGTH=00,                                              X01306101
               ATTRB=(ASKIP,BRT)                                        01306201
*                                                                       01306301
AACT09  DFHMDF POS=(12,05),                                            X01306401
               LENGTH=03,                                              X01306501
               ATTRB=(ASKIP,BRT)                                        01306601
*                                                                       01306701
ATOFF09 DFHMDF POS=(12,10),                                            X01306803
               COLOR=BLUE,                                             X01306901
               LENGTH=06,                                              X01307003
               ATTRB=(ASKIP,BRT)                                        01307101
*                                                                       01307201
AOPER09 DFHMDF POS=(12,19),                                            X01307301
               COLOR=BLUE,                                             X01307401
               LENGTH=04,                                              X01307501
               ATTRB=(ASKIP,BRT)                                        01307601
*                                                                       01307701
ASLSH09 DFHMDF POS=(12,24),                                            X01307804
               COLOR=BLUE,                                             X01307901
               LENGTH=01,                                              X01308001
               INITIAL='/',                                            X01308101
               ATTRB=(ASKIP,BRT)                                        01308201
*                                                                       01308301
AFCLT09 DFHMDF POS=(12,26),                                            X01308401
               COLOR=BLUE,                                             X01308501
               LENGTH=04,                                              X01308601
               ATTRB=(ASKIP,BRT)                                        01308701
*                                                                       01308801
ADEST09 DFHMDF POS=(12,34),                                            X01308901
               COLOR=BLUE,                                             X01309001
               LENGTH=08,                                              X01309101
               ATTRB=(ASKIP,BRT)                                        01309201
*********************************************************************** 01309301
ASEL10  DFHMDF POS=(13,02),                                            X01309401
               LENGTH=01,                                              X01309501
               ATTRB=UNPROT,                                           X01309601
               HILIGHT=UNDERLINE,                                      X01309701
               PICOUT='X'                                               01309801
        DFHMDF POS=(13,04),                                            X01309901
               LENGTH=00,                                              X01310001
               ATTRB=(ASKIP,BRT)                                        01310101
*                                                                       01310201
AACT10  DFHMDF POS=(13,05),                                            X01310301
               LENGTH=03,                                              X01310401
               ATTRB=(ASKIP,BRT)                                        01310501
*                                                                       01310601
ATOFF10 DFHMDF POS=(13,10),                                            X01310703
               COLOR=BLUE,                                             X01310801
               LENGTH=06,                                              X01310903
               ATTRB=(ASKIP,BRT)                                        01311001
*                                                                       01311101
AOPER10 DFHMDF POS=(13,19),                                            X01311201
               COLOR=BLUE,                                             X01311301
               LENGTH=04,                                              X01311401
               ATTRB=(ASKIP,BRT)                                        01311501
*                                                                       01311601
ASLSH10 DFHMDF POS=(13,24),                                            X01311704
               COLOR=BLUE,                                             X01311801
               LENGTH=01,                                              X01311901
               INITIAL='/',                                            X01312001
               ATTRB=(ASKIP,BRT)                                        01312101
*                                                                       01312201
AFCLT10 DFHMDF POS=(13,26),                                            X01312301
               COLOR=BLUE,                                             X01312401
               LENGTH=04,                                              X01312501
               ATTRB=(ASKIP,BRT)                                        01312601
*                                                                       01312701
ADEST10 DFHMDF POS=(13,34),                                            X01312801
               COLOR=BLUE,                                             X01312901
               LENGTH=08,                                              X01313001
               ATTRB=(ASKIP,BRT)                                        01313101
*********************************************************************** 01313201
ASEL11  DFHMDF POS=(14,02),                                            X01313301
               LENGTH=01,                                              X01313401
               ATTRB=UNPROT,                                           X01313501
               HILIGHT=UNDERLINE,                                      X01313601
               PICOUT='X'                                               01313701
        DFHMDF POS=(14,04),                                            X01313801
               LENGTH=00,                                              X01313901
               ATTRB=(ASKIP,BRT)                                        01314001
*                                                                       01314101
AACT11  DFHMDF POS=(14,05),                                            X01314201
               LENGTH=03,                                              X01314301
               ATTRB=(ASKIP,BRT)                                        01314401
*                                                                       01314501
ATOFF11 DFHMDF POS=(14,10),                                            X01314603
               COLOR=BLUE,                                             X01314701
               LENGTH=06,                                              X01314803
               ATTRB=(ASKIP,BRT)                                        01314901
*                                                                       01315001
AOPER11 DFHMDF POS=(14,19),                                            X01315101
               COLOR=BLUE,                                             X01315201
               LENGTH=04,                                              X01315301
               ATTRB=(ASKIP,BRT)                                        01315401
*                                                                       01315501
ASLSH11 DFHMDF POS=(14,24),                                            X01315604
               COLOR=BLUE,                                             X01315701
               LENGTH=01,                                              X01315801
               INITIAL='/',                                            X01315901
               ATTRB=(ASKIP,BRT)                                        01316001
*                                                                       01316101
AFCLT11 DFHMDF POS=(14,26),                                            X01316201
               COLOR=BLUE,                                             X01316301
               LENGTH=04,                                              X01316401
               ATTRB=(ASKIP,BRT)                                        01316501
*                                                                       01316601
ADEST11 DFHMDF POS=(14,34),                                            X01316701
               COLOR=BLUE,                                             X01316801
               LENGTH=08,                                              X01316901
               ATTRB=(ASKIP,BRT)                                        01317001
*********************************************************************** 01317101
ASEL12  DFHMDF POS=(15,02),                                            X01317201
               LENGTH=01,                                              X01317301
               ATTRB=UNPROT,                                           X01317401
               HILIGHT=UNDERLINE,                                      X01317501
               PICOUT='X'                                               01317601
        DFHMDF POS=(15,04),                                            X01317701
               LENGTH=00,                                              X01317801
               ATTRB=(ASKIP,BRT)                                        01317901
*                                                                       01318001
AACT12  DFHMDF POS=(15,05),                                            X01318101
               LENGTH=03,                                              X01318201
               ATTRB=(ASKIP,BRT)                                        01318301
*                                                                       01318401
ATOFF12 DFHMDF POS=(15,10),                                            X01318503
               COLOR=BLUE,                                             X01318601
               LENGTH=06,                                              X01318703
               ATTRB=(ASKIP,BRT)                                        01318801
*                                                                       01318901
AOPER12 DFHMDF POS=(15,19),                                            X01319001
               COLOR=BLUE,                                             X01319101
               LENGTH=04,                                              X01319201
               ATTRB=(ASKIP,BRT)                                        01319301
*                                                                       01319401
ASLSH12 DFHMDF POS=(15,24),                                            X01319504
               COLOR=BLUE,                                             X01319601
               LENGTH=01,                                              X01319701
               INITIAL='/',                                            X01319801
               ATTRB=(ASKIP,BRT)                                        01319901
*                                                                       01320001
AFCLT12 DFHMDF POS=(15,26),                                            X01320101
               COLOR=BLUE,                                             X01320201
               LENGTH=04,                                              X01320301
               ATTRB=(ASKIP,BRT)                                        01320401
*                                                                       01320501
ADEST12 DFHMDF POS=(15,34),                                            X01320601
               COLOR=BLUE,                                             X01320701
               LENGTH=08,                                              X01320801
               ATTRB=(ASKIP,BRT)                                        01320901
*********************************************************************** 01321001
ASEL13  DFHMDF POS=(16,02),                                            X01321101
               LENGTH=01,                                              X01321201
               ATTRB=UNPROT,                                           X01321301
               HILIGHT=UNDERLINE,                                      X01321401
               PICOUT='X'                                               01321501
        DFHMDF POS=(16,04),                                            X01321601
               LENGTH=00,                                              X01321701
               ATTRB=(ASKIP,BRT)                                        01321801
*                                                                       01321901
AACT13  DFHMDF POS=(16,05),                                            X01322001
               LENGTH=03,                                              X01322101
               ATTRB=(ASKIP,BRT)                                        01322201
*                                                                       01322301
ATOFF13 DFHMDF POS=(16,10),                                            X01322403
               COLOR=BLUE,                                             X01322501
               LENGTH=06,                                              X01322603
               ATTRB=(ASKIP,BRT)                                        01322701
*                                                                       01322801
AOPER13 DFHMDF POS=(16,19),                                            X01322901
               COLOR=BLUE,                                             X01323001
               LENGTH=04,                                              X01323101
               ATTRB=(ASKIP,BRT)                                        01323201
*                                                                       01323301
ASLSH13 DFHMDF POS=(16,24),                                            X01323404
               COLOR=BLUE,                                             X01323501
               LENGTH=01,                                              X01323601
               INITIAL='/',                                            X01323701
               ATTRB=(ASKIP,BRT)                                        01323801
*                                                                       01323901
AFCLT13 DFHMDF POS=(16,26),                                            X01324001
               COLOR=BLUE,                                             X01324101
               LENGTH=04,                                              X01324201
               ATTRB=(ASKIP,BRT)                                        01324301
*                                                                       01324401
ADEST13 DFHMDF POS=(16,34),                                            X01324501
               COLOR=BLUE,                                             X01324601
               LENGTH=08,                                              X01324701
               ATTRB=(ASKIP,BRT)                                        01324801
*********************************************************************** 01324901
ASEL14  DFHMDF POS=(17,02),                                            X01325001
               LENGTH=01,                                              X01325101
               ATTRB=UNPROT,                                           X01325201
               HILIGHT=UNDERLINE,                                      X01325301
               PICOUT='X'                                               01325401
        DFHMDF POS=(17,04),                                            X01325502
               LENGTH=00,                                              X01325601
               ATTRB=(ASKIP,BRT)                                        01325701
*                                                                       01325801
AACT14  DFHMDF POS=(17,05),                                            X01325901
               LENGTH=03,                                              X01326001
               ATTRB=(ASKIP,BRT)                                        01326101
*                                                                       01326201
ATOFF14 DFHMDF POS=(17,10),                                            X01326303
               COLOR=BLUE,                                             X01326401
               LENGTH=06,                                              X01326503
               ATTRB=(ASKIP,BRT)                                        01326601
*                                                                       01326701
AOPER14 DFHMDF POS=(17,19),                                            X01326801
               COLOR=BLUE,                                             X01326901
               LENGTH=04,                                              X01327001
               ATTRB=(ASKIP,BRT)                                        01327101
*                                                                       01327201
ASLSH14 DFHMDF POS=(17,24),                                            X01327304
               COLOR=BLUE,                                             X01327401
               LENGTH=01,                                              X01327501
               INITIAL='/',                                            X01327601
               ATTRB=(ASKIP,BRT)                                        01327701
*                                                                       01327801
AFCLT14 DFHMDF POS=(17,26),                                            X01327901
               COLOR=BLUE,                                             X01328001
               LENGTH=04,                                              X01328101
               ATTRB=(ASKIP,BRT)                                        01328201
*                                                                       01328301
ADEST14 DFHMDF POS=(17,34),                                            X01328401
               COLOR=BLUE,                                             X01328501
               LENGTH=08,                                              X01328601
               ATTRB=(ASKIP,BRT)                                        01328701
*********************************************************************** 01328801
ASEL15  DFHMDF POS=(18,02),                                            X01328901
               LENGTH=01,                                              X01329001
               ATTRB=UNPROT,                                           X01329101
               HILIGHT=UNDERLINE,                                      X01329201
               PICOUT='X'                                               01329301
        DFHMDF POS=(18,04),                                            X01329401
               LENGTH=00,                                              X01329501
               ATTRB=(ASKIP,BRT)                                        01329601
*                                                                       01329701
AACT15  DFHMDF POS=(18,05),                                            X01329801
               LENGTH=03,                                              X01329901
               ATTRB=(ASKIP,BRT)                                        01330001
*                                                                       01330101
ATOFF15 DFHMDF POS=(18,10),                                            X01330203
               COLOR=BLUE,                                             X01330301
               LENGTH=06,                                              X01330403
               ATTRB=(ASKIP,BRT)                                        01330501
*                                                                       01330601
AOPER15 DFHMDF POS=(18,19),                                            X01330701
               COLOR=BLUE,                                             X01330801
               LENGTH=04,                                              X01330901
               ATTRB=(ASKIP,BRT)                                        01331001
*                                                                       01331101
ASLSH15 DFHMDF POS=(18,24),                                            X01331204
               COLOR=BLUE,                                             X01331301
               LENGTH=01,                                              X01331401
               INITIAL='/',                                            X01331501
               ATTRB=(ASKIP,BRT)                                        01331601
*                                                                       01331701
AFCLT15 DFHMDF POS=(18,26),                                            X01331801
               COLOR=BLUE,                                             X01331901
               LENGTH=04,                                              X01332001
               ATTRB=(ASKIP,BRT)                                        01332101
*                                                                       01332201
ADEST15 DFHMDF POS=(18,34),                                            X01332301
               COLOR=BLUE,                                             X01332401
               LENGTH=08,                                              X01332501
               ATTRB=(ASKIP,BRT)                                        01332601
*********************************************************************** 05420500
        DFHMDF POS=(19,45),                                            X05420600
               LENGTH=25,                                              X05420700
               ATTRB=(ASKIP,BRT),                                      X05420800
               INITIAL='NUMBER OF SELECTED ITEMS:'                      05420900
*                                                                       05421000
ATOTSEL DFHMDF POS=(19,72),                                            X05421100
               ATTRB=(ASKIP,BRT),                                      X05421200
               LENGTH=05,                                              X05421300
               PICOUT='99999'                                           05422000
*                                                                       05430000
*********************************************************************** 06500000
        DFHMSD TYPE=FINAL                                               06510000
        PRINT NOGEN                                                     06520000
        END                                                             06530000
