*          DATA SET VLKM511    AT LEVEL 001 AS OF 08/01/96              00001000
  PRINT  NOGEN                                                          00010100
*******************************************************************-*   00010200
*                                                                   *   00010300
*        MAPSET  VLKM511                                            *   00010402
*        MAP     VL511A                                             *   00010500
*        PROGRAM VLKCS511                                           *   00010600
*        TRANSID V511 -                                             *   00010700
*        SYSTEM  CICS ARCHITECTURE                                  *   00010800
*                                                                   *   00010900
*******************************************************************-*   00011000
VLKM511 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL511A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*                                                                       00110001
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00110102
               INITIAL='ITEMS',                                        X00110202
               COLOR=NEUTRAL,                                          X00110302
               LENGTH=5,                                               X00111002
               POS=(02,40)                                              00120003
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00156600
               JUSTIFY=(LEFT,BLANK),                                   X00156700
               COLOR=GREEN,                                            X00156800
               HILIGHT=UNDERLINE,                                      X00156900
               PICOUT='ZZZZZ',                                         X00157000
               LENGTH=5,                                               X00157100
               POS=(02,47)                                              00157203
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00157300
               INITIAL='TO',                                           X00157400
               COLOR=NEUTRAL,                                          X00157500
               LENGTH=2,                                               X00157600
               POS=(02,53)                                              00157703
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00157800
               JUSTIFY=(LEFT,BLANK),                                   X00157900
               COLOR=BLUE,                                             X00158000
               PICOUT='ZZZZZ',                                         X00158100
               LENGTH=5,                                               X00158200
               POS=(02,56)                                              00158303
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00158400
               INITIAL='OF',                                           X00158500
               COLOR=NEUTRAL,                                          X00158600
               LENGTH=2,                                               X00158700
               POS=(02,62)                                              00158803
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00158900
               JUSTIFY=(LEFT,BLANK),                                   X00159000
               COLOR=BLUE,                                             X00159100
               PICOUT='ZZZZZ',                                         X00159200
               LENGTH=5,                                               X00159300
               POS=(02,65)                                              00159403
*                                                                       00159500
        DFHMDF POS=(03,10),                                            X00159605
               LENGTH=03,                                              X00159700
               ATTRB=(ASKIP,BRT),                                      X00159800
               INITIAL='SEL'                                            00159900
*                                                                       00160000
        DFHMDF POS=(03,15),                                            X00160105
               LENGTH=03,                                              X00160201
               ATTRB=(ASKIP,BRT),                                      X00160300
               INITIAL='ACT'                                            00160401
*                                                                       00160500
        DFHMDF POS=(03,24),                                            X00160605
               LENGTH=18,                                              X00160700
               ATTRB=(ASKIP,BRT),                                      X00160800
               INITIAL='REASON DESCRIPTION'                             00160900
*********************************************************************** 00161000
ASEL1   DFHMDF POS=(04,11),                                            X00161104
               COLOR=GREEN,                                            X00162000
               LENGTH=01,                                              X00170000
               ATTRB=UNPROT,                                           X00180000
               HILIGHT=UNDERLINE,                                      X00190000
               PICOUT='X'                                               00200000
        DFHMDF POS=(04,13),                                            X00201004
               LENGTH=01,                                              X00202000
               ATTRB=ASKIP                                              00203000
*                                                                       00210100
AACT01  DFHMDF POS=(04,15),                                            X00211102
               LENGTH=03,                                              X00211202
               ATTRB=(ASKIP,BRT)                                        00211302
*                                                                       00212000
ADES1   DFHMDF POS=(04,21),                                            X00220002
               COLOR=BLUE,                                             X00221000
               LENGTH=50,                                              X00222000
               ATTRB=(ASKIP,NORM)                                       00223000
*                                                                       00330000
ASEL2   DFHMDF POS=(05,11),                                            X00340004
               COLOR=GREEN,                                            X00350000
               LENGTH=01,                                              X00360000
               ATTRB=UNPROT,                                           X00370000
               HILIGHT=UNDERLINE,                                      X00380000
               PICOUT='X'                                               00390000
        DFHMDF POS=(05,13),                                            X00400004
               LENGTH=01,                                              X00410000
               ATTRB=ASKIP                                              00420000
AACT02  DFHMDF POS=(05,15),                                            X00421002
               LENGTH=03,                                              X00422002
               ATTRB=(ASKIP,BRT)                                        00423002
*                                                                       00424002
ADES2   DFHMDF POS=(05,21),                                            X00500002
               COLOR=BLUE,                                             X00510000
               LENGTH=50,                                              X00520000
               ATTRB=(ASKIP,NORM)                                       00530000
*                                                                       00531000
ASEL3   DFHMDF POS=(06,11),                                            X00532004
               COLOR=GREEN,                                            X00533000
               LENGTH=01,                                              X00534000
               ATTRB=UNPROT,                                           X00535000
               HILIGHT=UNDERLINE,                                      X00536000
               PICOUT='X'                                               00537000
        DFHMDF POS=(06,13),                                            X00538004
               LENGTH=01,                                              X00539000
               ATTRB=ASKIP                                              00539100
AACT03  DFHMDF POS=(06,15),                                            X00539202
               LENGTH=03,                                              X00539302
               ATTRB=(ASKIP,BRT)                                        00539402
*                                                                       00539500
ADES3   DFHMDF POS=(06,21),                                            X00540202
               COLOR=BLUE,                                             X00540300
               LENGTH=50,                                              X00541000
               ATTRB=(ASKIP,NORM)                                       00542000
*                                                                       00543000
ASEL4   DFHMDF POS=(07,11),                                            X00544004
               COLOR=GREEN,                                            X00545000
               LENGTH=01,                                              X00546000
               ATTRB=UNPROT,                                           X00547000
               HILIGHT=UNDERLINE,                                      X00548000
               PICOUT='X'                                               00549000
        DFHMDF POS=(07,13),                                            X00549104
               LENGTH=01,                                              X00549200
               ATTRB=ASKIP                                              00549300
*                                                                       00549400
AACT04  DFHMDF POS=(07,15),                                            X00549502
               LENGTH=03,                                              X00549602
               ATTRB=(ASKIP,BRT)                                        00549702
*                                                                       00550300
ADES4   DFHMDF POS=(07,21),                                            X00551002
               COLOR=BLUE,                                             X00552000
               LENGTH=50,                                              X00553000
               ATTRB=(ASKIP,NORM)                                       00554000
*                                                                       00560000
ASEL5   DFHMDF POS=(08,11),                                            X00570004
               COLOR=GREEN,                                            X00580000
               LENGTH=01,                                              X00590000
               ATTRB=UNPROT,                                           X00600000
               HILIGHT=UNDERLINE,                                      X00610000
               PICOUT='X'                                               00620000
        DFHMDF POS=(08,13),                                            X00630004
               LENGTH=01,                                              X00640000
               ATTRB=ASKIP                                              00650000
AACT05  DFHMDF POS=(08,15),                                            X00651002
               LENGTH=03,                                              X00652002
               ATTRB=(ASKIP,BRT)                                        00653002
*                                                                       00660000
ADES5   DFHMDF POS=(08,21),                                            X00730002
               COLOR=BLUE,                                             X00740000
               LENGTH=50,                                              X00750000
               ATTRB=(ASKIP,NORM)                                       00760000
*                                                                       00761000
ASEL6   DFHMDF POS=(09,11),                                            X00762004
               COLOR=GREEN,                                            X00763000
               LENGTH=01,                                              X00764000
               ATTRB=UNPROT,                                           X00765000
               HILIGHT=UNDERLINE,                                      X00766000
               PICOUT='X'                                               00767000
        DFHMDF POS=(09,13),                                            X00768004
               LENGTH=01,                                              X00769000
               ATTRB=ASKIP                                              00769100
*                                                                       00769200
AACT06  DFHMDF POS=(09,15),                                            X00769302
               LENGTH=03,                                              X00769402
               ATTRB=(ASKIP,BRT)                                        00769502
*                                                                       00770100
ADES6   DFHMDF POS=(09,21),                                            X00770202
               COLOR=BLUE,                                             X00770300
               LENGTH=50,                                              X00771000
               ATTRB=(ASKIP,NORM)                                       00772000
*                                                                       00773000
ASEL7   DFHMDF POS=(10,11),                                            X00774004
               COLOR=GREEN,                                            X00775000
               LENGTH=01,                                              X00776000
               ATTRB=UNPROT,                                           X00777000
               HILIGHT=UNDERLINE,                                      X00778000
               PICOUT='X'                                               00779000
        DFHMDF POS=(10,13),                                            X00779104
               LENGTH=01,                                              X00779200
               ATTRB=ASKIP                                              00779300
AACT07  DFHMDF POS=(10,15),                                            X00779402
               LENGTH=03,                                              X00779502
               ATTRB=(ASKIP,BRT)                                        00779602
*                                                                       00779700
ADES7   DFHMDF POS=(10,21),                                            X00781002
               COLOR=BLUE,                                             X00782000
               LENGTH=50,                                              X00783000
               ATTRB=(ASKIP,NORM)                                       00784000
*                                                                       00785000
ASEL8   DFHMDF POS=(11,11),                                            X00786004
               COLOR=GREEN,                                            X00787000
               LENGTH=01,                                              X00788000
               ATTRB=UNPROT,                                           X00789000
               HILIGHT=UNDERLINE,                                      X00789100
               PICOUT='X'                                               00789200
        DFHMDF POS=(11,13),                                            X00789304
               LENGTH=01,                                              X00789400
               ATTRB=ASKIP                                              00789500
*                                                                       00789600
AACT08  DFHMDF POS=(11,15),                                            X00789702
               LENGTH=03,                                              X00789802
               ATTRB=(ASKIP,BRT)                                        00789902
*                                                                       00792000
ADES8   DFHMDF POS=(11,21),                                            X00793002
               COLOR=BLUE,                                             X00794000
               LENGTH=50,                                              X00795000
               ATTRB=(ASKIP,NORM)                                       00796000
*                                                                       00797000
ASEL9   DFHMDF POS=(12,11),                                            X00798004
               COLOR=GREEN,                                            X00799000
               LENGTH=01,                                              X00799100
               ATTRB=UNPROT,                                           X00799200
               HILIGHT=UNDERLINE,                                      X00799300
               PICOUT='X'                                               00799400
        DFHMDF POS=(12,13),                                            X00799504
               LENGTH=01,                                              X00799600
               ATTRB=ASKIP                                              00799700
AACT09  DFHMDF POS=(12,15),                                            X00799802
               LENGTH=03,                                              X00799902
               ATTRB=(ASKIP,BRT)                                        00800002
*                                                                       00800102
ADES9   DFHMDF POS=(12,21),                                            X00805002
               COLOR=BLUE,                                             X00806000
               LENGTH=50,                                              X00807000
               ATTRB=(ASKIP,NORM)                                       00808000
*                                                                       00809000
ASEL10  DFHMDF POS=(13,11),                                            X00809104
               COLOR=GREEN,                                            X00809200
               LENGTH=01,                                              X00809300
               ATTRB=UNPROT,                                           X00809400
               HILIGHT=UNDERLINE,                                      X00809500
               PICOUT='X'                                               00809600
        DFHMDF POS=(13,13),                                            X00809704
               LENGTH=01,                                              X00809800
               ATTRB=ASKIP                                              00809900
*                                                                       00810000
AACT10  DFHMDF POS=(13,15),                                            X00810102
               LENGTH=03,                                              X00810202
               ATTRB=(ASKIP,BRT)                                        00810302
*                                                                       00810402
ADES10  DFHMDF POS=(13,21),                                            X00817006
               COLOR=BLUE,                                             X00818000
               LENGTH=50,                                              X00819000
               ATTRB=(ASKIP,NORM)                                       00819100
*                                                                       00819200
ASEL11  DFHMDF POS=(14,11),                                            X00819304
               COLOR=GREEN,                                            X00819400
               LENGTH=01,                                              X00819500
               ATTRB=UNPROT,                                           X00819600
               HILIGHT=UNDERLINE,                                      X00819700
               PICOUT='X'                                               00819800
        DFHMDF POS=(14,13),                                            X00819904
               LENGTH=01,                                              X00820000
               ATTRB=ASKIP                                              00821000
AACT11  DFHMDF POS=(14,15),                                            X00821102
               LENGTH=03,                                              X00821202
               ATTRB=(ASKIP,BRT)                                        00821302
*                                                                       00822000
ADES11  DFHMDF POS=(14,21),                                            X00829002
               COLOR=BLUE,                                             X00829100
               LENGTH=50,                                              X00829200
               ATTRB=(ASKIP,NORM)                                       00829300
*                                                                       00829400
ASEL12  DFHMDF POS=(15,11),                                            X00829504
               COLOR=GREEN,                                            X00829600
               LENGTH=01,                                              X00829700
               ATTRB=UNPROT,                                           X00829800
               HILIGHT=UNDERLINE,                                      X00829900
               PICOUT='X'                                               00830000
        DFHMDF POS=(15,13),                                            X00831004
               LENGTH=01,                                              X00832000
               ATTRB=ASKIP                                              00833000
AACT12  DFHMDF POS=(15,15),                                            X00833102
               LENGTH=03,                                              X00833202
               ATTRB=(ASKIP,BRT)                                        00833302
*                                                                       00834000
ADES12  DFHMDF POS=(15,21),                                            X00839202
               COLOR=BLUE,                                             X00839300
               LENGTH=50,                                              X00839400
               ATTRB=(ASKIP,NORM)                                       00839500
*                                                                       00840000
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00840100
               INITIAL='NUMBER OF SELECTED ITEMS:',                    X00840200
               COLOR=NEUTRAL,                                          X00840300
               LENGTH=25,                                              X00840400
               POS=(19,39)                                              00840500
ASELIT   DFHMDF ATTRB=(ASKIP),                                         X00840600
               JUSTIFY=(LEFT,BLANK),                                   X00840700
               COLOR=BLUE,                                             X00840800
               PICOUT='ZZZZZZZ',                                       X00840900
               LENGTH=7,                                               X00841000
               POS=(19,66)                                              00850000
*                                                                       02334100
*********************************************************************** 02334200
        DFHMSD TYPE=FINAL                                               02335000
        PRINT NOGEN                                                     02340000
        END                                                             02350000
