        PRINT NOGEN                                                     00010000
VLKM509 DFHMSD TYPE=MAP,                                               X00020002
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL509A  DFHMDI SIZE=(19,80),                                           X00060002
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(03,10),                                            X00120004
               LENGTH=54,                                              X00130003
               ATTRB=(ASKIP,BRT),                                      X00140000
               COLOR=BLUE,                                             X00141005
               INITIAL='PLEASE ENTER THE TICKET PLACEMENT CODE AND DESCX00150003
               RIPTION'                                                 00150106
*                                                                       00153100
        DFHMDF POS=(04,10),                                            X00153204
               LENGTH=06,                                              X00153304
               ATTRB=(ASKIP,BRT),                                      X00153404
               COLOR=BLUE,                                             X00153505
               INITIAL='BELOW:'                                         00153604
        DFHMDF POS=(07,10),                                            X00153704
               LENGTH=12,                                              X00153804
               COLOR=BLUE,                                             X00153905
               ATTRB=(ASKIP,BRT),                                      X00154004
               INITIAL='CODE.......:'                                   00154104
*                                                                       00154204
ACODE   DFHMDF POS=(07,23),                                            X00154307
               LENGTH=04,                                              X00154400
               ATTRB=UNPROT,                                           X00154500
               PICOUT='XXXX',                                          X00154600
               HILIGHT=UNDERLINE                                        00154700
        DFHMDF POS=(07,28),                                            X00154807
               LENGTH=1,                                               X00154900
               ATTRB=ASKIP                                              00155000
*                                                                       00155100
        DFHMDF POS=(09,10),                                            X00155204
               LENGTH=12,                                              X00155304
               COLOR=BLUE,                                             X00155410
               ATTRB=(ASKIP,BRT),                                      X00155504
               INITIAL='DESCRIPTION:'                                   00155604
ADESC   DFHMDF POS=(09,23),                                            X00155707
               LENGTH=50,                                              X00155809
               COLOR=GREEN,                                            X00155910
               ATTRB=UNPROT,                                           X00156000
               HILIGHT=UNDERLINE                                        00156100
        DFHMDF POS=(09,74),                                            X00156209
               LENGTH=1,                                               X00156300
               ATTRB=ASKIP                                              00157000
*                                                                       01790000
*********************************************************************** 01800000
        DFHMSD TYPE=FINAL                                               01810000
        PRINT NOGEN                                                     01820000
        END                                                             01830000
