*          DATA SET VLKM502    AT LEVEL 005 AS OF 10/06/95                      
VLKM502  DFHMSD TYPE=MAP,                                              X00001**2
               CTRL=(FREEKB),                                          X00002**2
               DSATTS=(COLOR,HILIGHT),                                 X00003**2
               LANG=COBOL,                                             X00004**2
               MODE=INOUT,                                             X00005**2
               TIOAPFX=YES                                              00006**2
VL502A   DFHMDI SIZE=(19,080),                                         X00007**2
               MAPATTS=(COLOR,HILIGHT),                                X00008**2
               DSATTS=(COLOR,HILIGHT),                                 X00009**2
               LINE=02,                                                X00010**2
               COLUMN=01                                                00011**2
         DFHMDF POS=(02,003),                                          X00012**2
               COLOR=NEUTRAL,                                          X00013**2
               ATTRB=(ASKIP,NORM),                                     X00014**2
               LENGTH=011,                                             X00015**2
               INITIAL='DEPARTMENT:'                                    00016**2
ADPTNBR  DFHMDF POS=(02,015),                                          X00017**2
               COLOR=BLUE,                                             X00018**2
               ATTRB=(ASKIP,NORM),                                     X00019**2
               LENGTH=003                                               00020**2
         DFHMDF POS=(02,025),                                          X00021**2
               COLOR=NEUTRAL,                                          X00022**2
               ATTRB=(ASKIP,NORM),                                     X00023**2
               LENGTH=008,                                             X00024**2
               INITIAL='NAME...:'                                       00025**2
AVNAME   DFHMDF POS=(02,034),                                          X00026**2
               COLOR=BLUE,                                             X00027**2
               ATTRB=(ASKIP,NORM),                                     X00028**2
               LENGTH=029                                               00029**2
*                                                                               
         DFHMDF POS=(03,003),                                          X00030**2
               COLOR=NEUTRAL,                                          X00031**2
               ATTRB=(ASKIP,NORM),                                     X00032**2
               LENGTH=011,                                             X00033**2
               INITIAL='INHOUSE...:'                                    00034**2
AINHS    DFHMDF POS=(03,015),                                          X00035**2
               COLOR=BLUE,                                             X00036**2
               ATTRB=(ASKIP,NORM),                                     X00037**2
               LENGTH=003                                               00038**2
         DFHMDF POS=(03,025),                                          X00039**2
               COLOR=NEUTRAL,                                          X00040**2
               ATTRB=(ASKIP,NORM),                                     X00041**2
               LENGTH=008,                                             X00042**2
               INITIAL='DUNS NO:'                                       00043**2
ADUNS    DFHMDF POS=(03,034),                                          X00044**2
               COLOR=BLUE,                                             X00045**2
               ATTRB=(ASKIP,NORM),                                     X00046**2
               LENGTH=009                                               00047**2
*                                                                               
         DFHMDF POS=(05,003),                                          X00048**2
               COLOR=NEUTRAL,                                          X00049**2
               ATTRB=(ASKIP,NORM),                                     X00050**2
               LENGTH=019,                                             X00051**2
               INITIAL='PAYMENT TERMS.....:'                            00052**2
APAYTRM  DFHMDF POS=(05,023),                                          X00053**2
               COLOR=BLUE,                                             X00054**2
               ATTRB=(ASKIP,NUM,NORM),                                 X00055**2
               LENGTH=003                                               00056**2
APAYTXT  DFHMDF POS=(05,027),                                          X00057**2
               COLOR=BLUE,                                             X00058**2
               ATTRB=(PROT,NORM),                                      X00059**2
               LENGTH=028                                               00060**2
*                                                                               
         DFHMDF POS=(06,003),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019,                                             X        
               INITIAL='FREIGHT TERMS.....:'                                    
AFRTIDT  DFHMDF POS=(06,023),                                          X00057**2
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NUM,NORM),                                 X        
               LENGTH=03                                                        
APAYFRG  DFHMDF POS=(06,027),                                          X00132**2
               COLOR=BLUE,                                             X00133**2
               ATTRB=(ASKIP,NORM),                                     X00134**2
               LENGTH=001                                               00135**2
         DFHMDF POS=(06,029),                                          X00136**2
               COLOR=NEUTRAL,                                          X00137**2
               ATTRB=(ASKIP,NORM),                                     X00138**2
               LENGTH=007,                                             X00139**2
               INITIAL='(K/V/B)'                                        00140**2
AKFRGHT  DFHMDF POS=(06,038),                                          X00155**2
               COLOR=BLUE,                                             X00156**2
               ATTRB=(ASKIP,NORM),                                     X00157**2
               LENGTH=006                                               00158**2
         DFHMDF POS=(06,045),                                          X00159**2
               COLOR=NEUTRAL,                                          X00160**2
               ATTRB=(ASKIP,NUM,NORM),                                 X00161**2
               LENGTH=007,                                             X00162**2
               INITIAL='% KOHLS'                                        00163**2
AVFRGHT  DFHMDF POS=(06,055),                                          X00183**2
               COLOR=BLUE,                                             X00184**2
               ATTRB=(ASKIP,NORM),                                     X00185**2
               LENGTH=006                                               00186**2
         DFHMDF POS=(06,062),                                          X00187**2
               COLOR=NEUTRAL,                                          X00188**2
               ATTRB=(ASKIP,NORM),                                     X00189**2
               LENGTH=008,                                             X00190**2
               INITIAL='% VENDOR'                                       00191**2
*                                                                               
         DFHMDF POS=(08,008),                                          X00061**2
               COLOR=NEUTRAL,                                          X00062**2
               ATTRB=(ASKIP,NORM),                                     X00063**2
               LENGTH=014,                                             X00064**2
               INITIAL='SHIPPING TERMS'                                 00065**2
         DFHMDF POS=(08,050),                                          X00066**2
               COLOR=NEUTRAL,                                          X00067**2
               ATTRB=(ASKIP,NORM),                                     X00068**2
               LENGTH=016,                                             X00069**2
               INITIAL='RTV INSTRUCTIONS'                               00070**2
*                                                                               
         DFHMDF POS=(09,003),                                          X00071**2
               COLOR=NEUTRAL,                                          X00072**2
               ATTRB=(ASKIP,NORM),                                     X00073**2
               LENGTH=039,                                             X00074**2
               INITIAL='---------------------------------------'        00075**2
         DFHMDF POS=(09,045),                                          X00076**2
               COLOR=NEUTRAL,                                          X00077**2
               ATTRB=(ASKIP,NORM),                                     X00078**2
               LENGTH=027,                                             X00079**2
               INITIAL='---------------------------'                    00080**2
*                                                                               
         DFHMDF POS=(10,003),                                          X00081**2
               COLOR=NEUTRAL,                                          X00082**2
               ATTRB=(ASKIP,NORM),                                     X00083**2
               LENGTH=016,                                             X00084**2
               INITIAL='FOB POINT......:'                               00085**2
AFOBPNT  DFHMDF POS=(10,020),                                          X00086**2
               COLOR=BLUE,                                             X00087**2
               ATTRB=(ASKIP,NORM),                                     X00088**2
               LENGTH=020                                               00089**2
         DFHMDF POS=(10,045),                                          X00090**2
               COLOR=NEUTRAL,                                          X00091**2
               ATTRB=(ASKIP,NORM),                                     X00092**2
               LENGTH=021,                                             X00093**2
               INITIAL='RTV RA REQUIRED.....:'                          00094**2
ARTVRQD  DFHMDF POS=(10,067),                                          X00095**2
               ATTRB=UNPROT,                                           X00096**2
               HILIGHT=UNDERLINE,                                      X00097**2
               LENGTH=001,PICOUT='X'                                    00098**2
         DFHMDF POS=(10,069),                                          X00099**2
               COLOR=NEUTRAL,                                          X00100**5
               ATTRB=(ASKIP,NORM),                                     X00101**5
               LENGTH=005,                                             X00102**5
               INITIAL='(Y/N)'                                          00103**5
*                                                                               
         DFHMDF POS=(11,003),                                          X00104**2
               COLOR=NEUTRAL,                                          X00105**2
               ATTRB=(ASKIP,NORM),                                     X00106**2
               LENGTH=016,                                             X00107**2
               INITIAL='SHIPPING POINT.:'                               00108**2
ASHPPNT  DFHMDF POS=(11,020),                                          X00109**2
               COLOR=BLUE,                                             X00110**2
               ATTRB=(ASKIP,NORM),                                     X00111**2
               LENGTH=020                                               00112**2
         DFHMDF POS=(11,045),                                          X00113**2
               COLOR=NEUTRAL,                                          X00114**2
               ATTRB=(ASKIP,NORM),                                     X00115**2
               LENGTH=021,                                             X00116**2
               INITIAL='RTV NO RA REQUIRED..:'                          00117**2
ARTVNRQ  DFHMDF POS=(11,067),                                          X00118**2
               ATTRB=UNPROT,                                           X00119**2
               HILIGHT=UNDERLINE,                                      X00120**2
               LENGTH=001,PICOUT='X'                                    00121**2
         DFHMDF POS=(11,069),                                          X00122**2
               COLOR=NEUTRAL,                                          X00123**5
               ATTRB=(ASKIP,NORM),                                     X00124**5
               LENGTH=005,                                             X00125**5
               INITIAL='(Y/N)'                                          00126**5
*                                                                               
         DFHMDF POS=(12,045),                                          X00136**2
               COLOR=NEUTRAL,                                          X00137**2
               ATTRB=(ASKIP,NORM),                                     X00138**2
               LENGTH=021,                                             X00139**2
               INITIAL='DEBIT AND DESTROY...:'                          00140**2
ADBTDST  DFHMDF POS=(12,067),                                          X00141**2
               ATTRB=UNPROT,                                           X00142**2
               HILIGHT=UNDERLINE,                                      X00143**2
               LENGTH=001,PICOUT='X'                                    00144**2
         DFHMDF POS=(12,069),                                          X00145**2
               COLOR=NEUTRAL,                                          X00146**5
               ATTRB=(ASKIP,NORM),                                     X00147**5
               LENGTH=005,                                             X00148**5
               INITIAL='(Y/N)'                                          00149**5
*                                                                               
         DFHMDF POS=(13,045),                                          X00164**2
               COLOR=NEUTRAL,                                          X00165**2
               ATTRB=(ASKIP,NORM),                                     X00166**2
               LENGTH=021,                                             X00167**2
               INITIAL='MARKOUT.............:'                          00168**2
AMKOUT   DFHMDF POS=(13,067),                                          X00169**2
               ATTRB=UNPROT,                                           X00170**2
               HILIGHT=UNDERLINE,                                      X00171**2
               LENGTH=001,PICOUT='X'                                    00172**2
         DFHMDF POS=(13,069),                                          X00173**2
               COLOR=NEUTRAL,                                          X00174**5
               ATTRB=(ASKIP,NORM),                                     X00175**5
               LENGTH=005,                                             X00176**5
               INITIAL='(Y/N)'                                          00177**5
*                                                                               
         DFHMDF POS=(14,045),                                          X00325   
               COLOR=NEUTRAL,                                          X00326   
               ATTRB=(ASKIP,NORM),                                     X00327   
               LENGTH=019,                                             X00328   
               INITIAL='AUTHORIZATION ID..:'                            00329   
AAUTHID  DFHMDF POS=(14,067),                                          X00330   
               COLOR=GREEN,                                            X00331   
               ATTRB=(UNPROT,NORM),                                    X00332   
               HILIGHT=UNDERLINE,                                      X00333   
               LENGTH=010                                               00334   
         DFHMDF POS=(14,78),LENGTH=01,ATTRB=(ASKIP)                     00072**3
*                                                                               
         DFHMDF POS=(16,003),                                          X00206**2
               COLOR=NEUTRAL,                                          X00207**2
               ATTRB=(ASKIP,NORM),                                     X00208**2
               LENGTH=013,                                             X00209**2
               INITIAL='RTV COMMENTS:'                                  00210**2
ACMNT01  DFHMDF POS=(17,002),                                          X00211**4
               ATTRB=UNPROT,                                           X00212**2
               HILIGHT=UNDERLINE,                                      X00213**2
               LENGTH=075                                               00214**3
         DFHMDF POS=(17,078),                                          X00215**4
               ATTRB=(ASKIP,NORM),                                     X00216**2
               LENGTH=001                                               00217**2
ACMNT02  DFHMDF POS=(18,002),                                          X00218**4
               ATTRB=UNPROT,                                           X00219**2
               HILIGHT=UNDERLINE,                                      X00220**2
               LENGTH=075                                               00221**3
         DFHMDF POS=(18,078),                                          X00222**4
               ATTRB=(ASKIP,NORM),                                     X00223**2
               LENGTH=001                                               00224**2
ACMNT03  DFHMDF POS=(19,002),                                          X00225**4
               ATTRB=UNPROT,                                           X00226**2
               HILIGHT=UNDERLINE,                                      X00227**2
               LENGTH=075                                               00228**3
         DFHMDF POS=(19,078),                                          X00229**4
               ATTRB=(ASKIP,NORM),                                     X00230**2
               LENGTH=001                                               00231**2
         DFHMSD TYPE=FINAL                                              00232**2
         END                                                            00233**2
