        PRINT NOGEN                                                     00010000
VLKM510 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL510A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00150800
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00150900
               INITIAL='LINES',                                        X00151000
               COLOR=NEUTRAL,                                          X00151100
               LENGTH=5,                                               X00151200
               POS=(02,48)                                              00151300
*                                                                       00151400
ASTRTIT  DFHMDF ATTRB=(UNPROT,NUM),                                    X00151500
               JUSTIFY=(LEFT,BLANK),                                   X00151600
               COLOR=GREEN,                                            X00151700
               HILIGHT=UNDERLINE,                                      X00151800
               PICOUT='ZZZZZ',                                         X00151900
               LENGTH=5,                                               X00152000
               POS=(02,54)                                              00152100
*                                                                       00152200
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00152300
               INITIAL='TO',                                           X00152400
               COLOR=NEUTRAL,                                          X00152500
               LENGTH=2,                                               X00152600
               POS=(02,60)                                              00152703
AENDIT   DFHMDF ATTRB=(ASKIP),                                         X00152800
               JUSTIFY=(LEFT,BLANK),                                   X00152900
               COLOR=BLUE,                                             X00153000
               PICOUT='ZZZZZ',                                         X00153100
               LENGTH=5,                                               X00153200
               POS=(02,63)                                              00153300
*                                                                       00153400
         DFHMDF ATTRB=(ASKIP,BRT),                                     X00153500
               INITIAL='OF',                                           X00153600
               COLOR=NEUTRAL,                                          X00153700
               LENGTH=2,                                               X00153800
               POS=(02,69)                                              00153900
ATOTIT   DFHMDF ATTRB=(ASKIP),                                         X00154000
               JUSTIFY=(LEFT,BLANK),                                   X00154100
               COLOR=BLUE,                                             X00154200
               PICOUT='ZZZZZ',                                         X00154300
               LENGTH=5,                                               X00154400
               POS=(02,72)                                              00154500
*                                                                       00155500
        DFHMDF ATTRB=(ASKIP,BRT),                                      X00155600
               INITIAL='COMMENTS:',                                    X00155700
               LENGTH=9,                                               X00155800
               COLOR=NEUTRAL,                                          X00155900
               POS=(05,3)                                               00156000
*                                                                       00156100
ATEXT1  DFHMDF ATTRB=(ASKIP),                                          X00156204
               LENGTH=50,                                              X00156305
               COLOR=BLUE,                                             X00156401
               POS=(06,11)                                              00156600
        DFHMDF ATTRB=(ASKIP),                                          X00156700
               LENGTH=1,                                               X00156800
               COLOR=NEUTRAL,                                          X00156900
               POS=(06,77)                                              00157000
*                                                                       00157100
ATEXT2  DFHMDF ATTRB=(ASKIP),                                          X00157204
               LENGTH=50,                                              X00157301
               COLOR=BLUE,                                             X00157401
               POS=(07,11)                                              00157600
        DFHMDF ATTRB=(ASKIP),                                          X00157700
               LENGTH=1,                                               X00157800
               COLOR=NEUTRAL,                                          X00157900
               POS=(07,77)                                              00158000
*                                                                       00159000
ATEXT3  DFHMDF ATTRB=(ASKIP),                                          X00160004
               LENGTH=50,                                              X00170002
               COLOR=BLUE,                                             X00180001
               POS=(08,11)                                              00200000
        DFHMDF ATTRB=(ASKIP),                                          X00210000
               LENGTH=1,                                               X00220000
               COLOR=NEUTRAL,                                          X00230000
               POS=(08,77)                                              00240000
*                                                                       00250000
ATEXT4  DFHMDF ATTRB=(ASKIP),                                          X00260004
               LENGTH=50,                                              X00270002
               COLOR=BLUE,                                             X00280001
               POS=(09,11)                                              00300000
        DFHMDF ATTRB=(ASKIP),                                          X00310000
               LENGTH=1,                                               X00320000
               COLOR=NEUTRAL,                                          X00330000
               POS=(09,77)                                              00340000
*                                                                       00350000
ATEXT5  DFHMDF ATTRB=(ASKIP),                                          X00360004
               LENGTH=50,                                              X00370002
               COLOR=BLUE,                                             X00380001
               POS=(10,11)                                              00400000
        DFHMDF ATTRB=(ASKIP),                                          X00410000
               LENGTH=1,                                               X00420000
               COLOR=NEUTRAL,                                          X00430000
               POS=(10,77)                                              00440000
*                                                                       00450000
ATEXT6  DFHMDF ATTRB=(ASKIP),                                          X00460004
               LENGTH=50,                                              X00470002
               COLOR=BLUE,                                             X00480001
               POS=(11,11)                                              00500000
        DFHMDF ATTRB=(ASKIP),                                          X00510000
               LENGTH=1,                                               X00520000
               COLOR=NEUTRAL,                                          X00521000
               POS=(11,77)                                              00522000
*                                                                       00523000
ATEXT7  DFHMDF ATTRB=(ASKIP),                                          X00524004
               LENGTH=50,                                              X00525002
               COLOR=BLUE,                                             X00526001
               POS=(12,11)                                              00528000
        DFHMDF ATTRB=(ASKIP),                                          X00529000
               LENGTH=1,                                               X00529100
               COLOR=NEUTRAL,                                          X00529200
               POS=(12,77)                                              00529300
*                                                                       00529400
ATEXT8  DFHMDF ATTRB=(ASKIP),                                          X00529504
               LENGTH=50,                                              X00529602
               COLOR=BLUE,                                             X00529701
               POS=(13,11)                                              00529900
        DFHMDF ATTRB=(ASKIP),                                          X00530000
               LENGTH=1,                                               X00530100
               COLOR=NEUTRAL,                                          X00530200
               POS=(13,77)                                              00530300
*                                                                       00530400
ATEXT9  DFHMDF ATTRB=(ASKIP),                                          X00530504
               LENGTH=50,                                              X00530602
               COLOR=BLUE,                                             X00530701
               POS=(14,11)                                              00530900
        DFHMDF ATTRB=(ASKIP),                                          X00531000
               LENGTH=1,                                               X00531100
               COLOR=NEUTRAL,                                          X00531200
               POS=(14,77)                                              00531300
*                                                                       00531400
ATEXT10 DFHMDF ATTRB=(ASKIP),                                          X00531504
               LENGTH=50,                                              X00531602
               COLOR=BLUE,                                             X00531701
               POS=(15,11)                                              00531900
        DFHMDF ATTRB=(ASKIP),                                          X00532000
               LENGTH=1,                                               X00532100
               COLOR=NEUTRAL,                                          X00532200
               POS=(15,77)                                              00532300
*                                                                       00532400
ATEXT11 DFHMDF ATTRB=(ASKIP),                                          X00532504
               LENGTH=50,                                              X00532602
               COLOR=BLUE,                                             X00532701
               POS=(16,11)                                              00532900
        DFHMDF ATTRB=(ASKIP),                                          X00533000
               LENGTH=1,                                               X00533100
               COLOR=NEUTRAL,                                          X00533200
               POS=(16,77)                                              00533300
*                                                                       00533400
ATEXT12 DFHMDF ATTRB=(ASKIP),                                          X00533504
               LENGTH=50,                                              X00533602
               COLOR=BLUE,                                             X00533701
               POS=(17,11)                                              00533900
        DFHMDF ATTRB=(ASKIP),                                          X00534000
               LENGTH=1,                                               X00534100
               COLOR=NEUTRAL,                                          X00534200
               POS=(17,77)                                              00534300
*********************************************************************** 00534400
        DFHMSD TYPE=FINAL                                               00534500
        PRINT NOGEN                                                     00534600
        END                                                             00534700
