        PRINT NOGEN                                                     00010000
VLKM519 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL519A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(02,46),                                            X00120000
               LENGTH=06,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='ITEMS:'                                         00150000
ASTRTIT DFHMDF POS=(02,54),                                            X00160000
               ATTRB=UNPROT,                                           X00170000
               HILIGHT=UNDERLINE,                                      X00180000
               LENGTH=05,                                              X00190000
               PICOUT='ZZZZZ'                                           00200000
*                                                                       00210000
        DFHMDF POS=(02,60),                                            X00220000
               LENGTH=02,                                              X00230000
               ATTRB=(ASKIP,BRT),                                      X00240000
               INITIAL='TO'                                             00250000
AENDIT  DFHMDF POS=(02,63),                                            X00260000
               COLOR=BLUE,                                             X00260100
               ATTRB=(ASKIP,BRT),                                      X00260200
               LENGTH=05,                                              X00260300
               PICOUT='ZZZZZ'                                           00260400
*                                                                       00260500
        DFHMDF POS=(02,69),                                            X00260600
               LENGTH=02,                                              X00260700
               ATTRB=(ASKIP,BRT),                                      X00260800
               INITIAL='OF'                                             00260900
ATOTIT  DFHMDF POS=(02,72),                                            X00261000
               COLOR=BLUE,                                             X00262000
               ATTRB=(ASKIP,BRT),                                      X00263000
               LENGTH=05,                                              X00264000
               PICOUT='ZZZZZ'                                           00265000
*                                                                       00266000
*********************************************************************** 00267000
        DFHMDF POS=(03,06),                                            X00268000
               LENGTH=03,                                              X00269000
               ATTRB=(ASKIP,BRT),                                      X00270000
               INITIAL='TKT'                                            00280000
*                                                                       00290000
        DFHMDF POS=(03,13),                                            X00300000
               LENGTH=04,                                              X00310000
               ATTRB=(ASKIP,BRT),                                      X00320000
               INITIAL='OPER'                                           00330000
*                                                                       00340000
        DFHMDF POS=(03,26),                                            X00350000
               LENGTH=07,                                              X00360000
               ATTRB=(ASKIP,BRT),                                      X00370000
               INITIAL='TKT OFF'                                        00380000
* * *                                                                   00381000
        DFHMDF POS=(03,38),                                            X00390003
               LENGTH=01,                                              X00400000
               ATTRB=(ASKIP,BRT),                                      X00410000
               INITIAL='|'                                              00420000
* * *                                                                   00421000
        DFHMDF POS=(03,45),                                            X00422000
               LENGTH=03,                                              X00423000
               ATTRB=(ASKIP,BRT),                                      X00424000
               INITIAL='TKT'                                            00425000
*                                                                       00430000
        DFHMDF POS=(03,52),                                            X00430100
               LENGTH=04,                                              X00430200
               ATTRB=(ASKIP,BRT),                                      X00430300
               INITIAL='OPER'                                           00430400
*                                                                       00430500
        DFHMDF POS=(03,65),                                            X00430600
               LENGTH=07,                                              X00430700
               ATTRB=(ASKIP,BRT),                                      X00430800
               INITIAL='TKT OFF'                                        00430900
*********************************************************************** 00431000
        DFHMDF POS=(04,01),                                            X00432000
               LENGTH=03,                                              X00433000
               ATTRB=(ASKIP,BRT),                                      X00434000
               INITIAL='SEL'                                            00435000
*                                                                       00436000
        DFHMDF POS=(04,05),                                            X00437000
               LENGTH=06,                                              X00438000
               ATTRB=(ASKIP,BRT),                                      X00439000
               INITIAL='OFFICE'                                         00439100
*                                                                       00439200
        DFHMDF POS=(04,13),                                            X00439300
               LENGTH=04,                                              X00439400
               ATTRB=(ASKIP,BRT),                                      X00439500
               INITIAL='UNIT'                                           00439600
*                                                                       00439700
        DFHMDF POS=(04,19),                                            X00439800
               LENGTH=05,                                              X00439900
               ATTRB=(ASKIP,BRT),                                      X00440000
               INITIAL='FCLTY'                                          00440100
*                                                                       00440200
        DFHMDF POS=(04,26),                                            X00440300
               LENGTH=07,                                              X00440400
               ATTRB=(ASKIP,BRT),                                      X00440500
               INITIAL='ADDRESS'                                        00440600
* * *                                                                   00440700
        DFHMDF POS=(04,38),                                            X00440803
               LENGTH=01,                                              X00440900
               ATTRB=(ASKIP,BRT),                                      X00441000
               INITIAL='|'                                              00441100
* * *                                                                   00441200
        DFHMDF POS=(04,40),                                            X00441300
               LENGTH=03,                                              X00441400
               ATTRB=(ASKIP,BRT),                                      X00441500
               INITIAL='SEL'                                            00441600
*                                                                       00441700
        DFHMDF POS=(04,44),                                            X00441800
               LENGTH=06,                                              X00441900
               ATTRB=(ASKIP,BRT),                                      X00442000
               INITIAL='OFFICE'                                         00442100
*                                                                       00442200
        DFHMDF POS=(04,52),                                            X00442301
               LENGTH=04,                                              X00442400
               ATTRB=(ASKIP,BRT),                                      X00442500
               INITIAL='UNIT'                                           00442600
*                                                                       00442700
        DFHMDF POS=(04,58),                                            X00442801
               LENGTH=05,                                              X00442900
               ATTRB=(ASKIP,BRT),                                      X00443000
               INITIAL='FCLTY'                                          00443100
*                                                                       00443200
        DFHMDF POS=(04,65),                                            X00443301
               LENGTH=07,                                              X00443400
               ATTRB=(ASKIP,BRT),                                      X00443500
               INITIAL='ADDRESS'                                        00443600
*********************************************************************** 00445000
ASEL01  DFHMDF POS=(05,02),                                            X00450001
               LENGTH=01,                                              X00460000
               ATTRB=UNPROT,                                           X00470000
               HILIGHT=UNDERLINE,                                      X00480000
               PICOUT='X'                                               00490000
        DFHMDF POS=(05,04),                                            X00500001
               LENGTH=00,                                              X00510001
               ATTRB=(ASKIP,BRT)                                        00520000
*                                                                       00530000
ATOFF01 DFHMDF POS=(05,05),                                            X00540001
               LENGTH=06,                                              X00550000
               ATTRB=ASKIP,                                            X00551007
               COLOR=BLUE,                                             X00551107
               PICOUT='XXXXXX'                                          00553000
        DFHMDF POS=(05,12),                                            X00554001
               LENGTH=00,                                              X00555000
               ATTRB=(ASKIP,BRT)                                        00556000
*                                                                       00570000
AOPER01 DFHMDF POS=(05,13),                                            X00580001
               LENGTH=04,                                              X00600001
               ATTRB=ASKIP,                                            X00600107
               COLOR=BLUE,                                             X00600207
               PICOUT='9999'                                            00603001
        DFHMDF POS=(05,18),                                            X00604001
               LENGTH=01,                                              X00605001
               ATTRB=(ASKIP,BRT),                                      X00606001
               INITIAL='/'                                              00606101
*                                                                       00607001
AFCLT01 DFHMDF POS=(05,20),                                            X00608001
               LENGTH=04,                                              X00609001
               ATTRB=ASKIP,                                            X00609107
               COLOR=BLUE,                                             X00609207
               PICOUT='9999'                                            00612001
        DFHMDF POS=(05,25),                                            X00613001
               LENGTH=00,                                              X00614001
               ATTRB=(ASKIP,BRT)                                        00615001
*                                                                       00620000
AADDR01 DFHMDF POS=(05,26),                                            X00630001
               LENGTH=08,                                              X00650001
               ATTRB=ASKIP,                                            X00650107
               COLOR=BLUE,                                             X00650207
               PICOUT='XXXXXXXX'                                        00653001
        DFHMDF POS=(05,35),                                            X00654001
               LENGTH=00,                                              X00655001
               ATTRB=(ASKIP,BRT)                                        00656001
* * *                                                                   00661000
        DFHMDF POS=(05,38),                                            X00662003
               LENGTH=01,                                              X00663000
               ATTRB=(ASKIP,BRT),                                      X00664000
               INITIAL='|'                                              00665000
* * *                                                                   00666000
ASEL02  DFHMDF POS=(05,41),                                            X00667001
               LENGTH=01,                                              X00668001
               ATTRB=UNPROT,                                           X00669001
               HILIGHT=UNDERLINE,                                      X00669101
               PICOUT='X'                                               00669201
        DFHMDF POS=(05,43),                                            X00669301
               LENGTH=00,                                              X00669401
               ATTRB=(ASKIP,BRT)                                        00669501
*                                                                       00669601
ATOFF02 DFHMDF POS=(05,44),                                            X00669701
               LENGTH=06,                                              X00669801
               ATTRB=ASKIP,                                            X00669907
               COLOR=BLUE,                                             X00670007
               PICOUT='XXXXXX'                                          00670301
        DFHMDF POS=(05,51),                                            X00670401
               LENGTH=00,                                              X00670501
               ATTRB=(ASKIP,BRT)                                        00670601
*                                                                       00670701
AOPER02 DFHMDF POS=(05,52),                                            X00670801
               LENGTH=04,                                              X00670901
               ATTRB=ASKIP,                                            X00671007
               COLOR=BLUE,                                             X00671107
               PICOUT='9999'                                            00671401
        DFHMDF POS=(05,57),                                            X00671501
               LENGTH=01,                                              X00671601
               ATTRB=(ASKIP,BRT),                                      X00671701
               INITIAL='/'                                              00671801
*                                                                       00671901
AFCLT02 DFHMDF POS=(05,59),                                            X00672001
               LENGTH=04,                                              X00672101
               ATTRB=ASKIP,                                            X00672207
               COLOR=BLUE,                                             X00672307
               PICOUT='9999'                                            00672601
        DFHMDF POS=(05,64),                                            X00672701
               LENGTH=00,                                              X00672801
               ATTRB=(ASKIP,BRT)                                        00672901
*                                                                       00673001
AADDR02 DFHMDF POS=(05,65),                                            X00673101
               LENGTH=08,                                              X00673201
               ATTRB=ASKIP,                                            X00673307
               COLOR=BLUE,                                             X00673407
               PICOUT='XXXXXXXX'                                        00673701
        DFHMDF POS=(05,74),                                            X00673801
               LENGTH=00,                                              X00673901
               ATTRB=(ASKIP,BRT)                                        00674001
*********************************************************************** 00674101
ASEL03  DFHMDF POS=(06,02),                                            X00675001
               LENGTH=01,                                              X00676001
               ATTRB=UNPROT,                                           X00677001
               HILIGHT=UNDERLINE,                                      X00678001
               PICOUT='X'                                               00679001
        DFHMDF POS=(06,04),                                            X00679101
               LENGTH=00,                                              X00679201
               ATTRB=(ASKIP,BRT)                                        00679301
*                                                                       00679401
ATOFF03 DFHMDF POS=(06,05),                                            X00679501
               LENGTH=06,                                              X00679601
               ATTRB=ASKIP,                                            X00679707
               COLOR=BLUE,                                             X00679807
               PICOUT='XXXXXX'                                          00680101
        DFHMDF POS=(06,12),                                            X00680201
               LENGTH=00,                                              X00680301
               ATTRB=(ASKIP,BRT)                                        00680401
*                                                                       00680501
AOPER03 DFHMDF POS=(06,13),                                            X00680601
               LENGTH=04,                                              X00680701
               ATTRB=ASKIP,                                            X00680807
               COLOR=BLUE,                                             X00680907
               PICOUT='9999'                                            00681201
        DFHMDF POS=(06,18),                                            X00681301
               LENGTH=01,                                              X00681401
               ATTRB=(ASKIP,BRT),                                      X00681501
               INITIAL='/'                                              00681601
*                                                                       00681701
AFCLT03 DFHMDF POS=(06,20),                                            X00681801
               LENGTH=04,                                              X00681901
               ATTRB=ASKIP,                                            X00682007
               COLOR=BLUE,                                             X00682107
               PICOUT='9999'                                            00682401
        DFHMDF POS=(06,25),                                            X00682501
               LENGTH=00,                                              X00682601
               ATTRB=(ASKIP,BRT)                                        00682701
*                                                                       00682801
AADDR03 DFHMDF POS=(06,26),                                            X00682901
               LENGTH=08,                                              X00683001
               ATTRB=ASKIP,                                            X00683107
               COLOR=BLUE,                                             X00683207
               PICOUT='XXXXXXXX'                                        00683501
        DFHMDF POS=(06,35),                                            X00683601
               LENGTH=00,                                              X00683701
               ATTRB=(ASKIP,BRT)                                        00683801
* * *                                                                   00683901
        DFHMDF POS=(06,38),                                            X00684003
               LENGTH=01,                                              X00684101
               ATTRB=(ASKIP,BRT),                                      X00684201
               INITIAL='|'                                              00684301
* * *                                                                   00684401
ASEL04  DFHMDF POS=(06,41),                                            X00684501
               LENGTH=01,                                              X00684601
               ATTRB=UNPROT,                                           X00684701
               HILIGHT=UNDERLINE,                                      X00684801
               PICOUT='X'                                               00684901
        DFHMDF POS=(06,43),                                            X00685001
               LENGTH=00,                                              X00685101
               ATTRB=(ASKIP,BRT)                                        00685201
*                                                                       00685301
ATOFF04 DFHMDF POS=(06,44),                                            X00685401
               LENGTH=06,                                              X00685501
               ATTRB=ASKIP,                                            X00685607
               COLOR=BLUE,                                             X00685707
               PICOUT='XXXXXX'                                          00686001
        DFHMDF POS=(06,51),                                            X00686101
               LENGTH=00,                                              X00686201
               ATTRB=(ASKIP,BRT)                                        00686301
*                                                                       00686401
AOPER04 DFHMDF POS=(06,52),                                            X00686501
               LENGTH=04,                                              X00686601
               ATTRB=ASKIP,                                            X00686707
               COLOR=BLUE,                                             X00686807
               PICOUT='9999'                                            00687101
        DFHMDF POS=(06,57),                                            X00687201
               LENGTH=01,                                              X00687301
               ATTRB=(ASKIP,BRT),                                      X00687401
               INITIAL='/'                                              00687501
*                                                                       00687601
AFCLT04 DFHMDF POS=(06,59),                                            X00687701
               LENGTH=04,                                              X00687801
               ATTRB=ASKIP,                                            X00687907
               COLOR=BLUE,                                             X00688007
               PICOUT='9999'                                            00688301
        DFHMDF POS=(06,64),                                            X00688401
               LENGTH=00,                                              X00688501
               ATTRB=(ASKIP,BRT)                                        00688601
*                                                                       00688701
AADDR04 DFHMDF POS=(06,65),                                            X00688801
               LENGTH=08,                                              X00688901
               ATTRB=ASKIP,                                            X00689007
               COLOR=BLUE,                                             X00689107
               PICOUT='XXXXXXXX'                                        00689401
        DFHMDF POS=(06,74),                                            X00689501
               LENGTH=00,                                              X00689601
               ATTRB=(ASKIP,BRT)                                        00689701
*********************************************************************** 00689801
ASEL05  DFHMDF POS=(07,02),                                            X00689901
               LENGTH=01,                                              X00690001
               ATTRB=UNPROT,                                           X00690101
               HILIGHT=UNDERLINE,                                      X00690201
               PICOUT='X'                                               00690301
        DFHMDF POS=(07,04),                                            X00690401
               LENGTH=00,                                              X00690501
               ATTRB=(ASKIP,BRT)                                        00691001
*                                                                       00700001
ATOFF05 DFHMDF POS=(07,05),                                            X00710001
               LENGTH=06,                                              X00720001
               ATTRB=ASKIP,                                            X00721007
               COLOR=BLUE,                                             X00722007
               PICOUT='XXXXXX'                                          00750001
        DFHMDF POS=(07,12),                                            X00760001
               LENGTH=00,                                              X00770001
               ATTRB=(ASKIP,BRT)                                        00780001
*                                                                       00790001
AOPER05 DFHMDF POS=(07,13),                                            X00800001
               LENGTH=04,                                              X00810001
               ATTRB=ASKIP,                                            X00811007
               COLOR=BLUE,                                             X00812007
               PICOUT='9999'                                            00840001
        DFHMDF POS=(07,18),                                            X00850001
               LENGTH=01,                                              X00860001
               ATTRB=(ASKIP,BRT),                                      X00870001
               INITIAL='/'                                              00880001
*                                                                       00890001
AFCLT05 DFHMDF POS=(07,20),                                            X00900001
               LENGTH=04,                                              X00910001
               ATTRB=ASKIP,                                            X00911007
               COLOR=BLUE,                                             X00912007
               PICOUT='9999'                                            00940001
        DFHMDF POS=(07,25),                                            X00950001
               LENGTH=00,                                              X00960001
               ATTRB=(ASKIP,BRT)                                        00970001
*                                                                       00980001
AADDR05 DFHMDF POS=(07,26),                                            X00990001
               LENGTH=08,                                              X01000001
               ATTRB=ASKIP,                                            X01001007
               COLOR=BLUE,                                             X01002007
               PICOUT='XXXXXXXX'                                        01030001
        DFHMDF POS=(07,35),                                            X01040001
               LENGTH=00,                                              X01050001
               ATTRB=(ASKIP,BRT)                                        01060001
* * *                                                                   01070001
        DFHMDF POS=(07,38),                                            X01080003
               LENGTH=01,                                              X01090001
               ATTRB=(ASKIP,BRT),                                      X01100001
               INITIAL='|'                                              01110001
* * *                                                                   01120001
ASEL06  DFHMDF POS=(07,41),                                            X01130001
               LENGTH=01,                                              X01140001
               ATTRB=UNPROT,                                           X01150001
               HILIGHT=UNDERLINE,                                      X01160001
               PICOUT='X'                                               01170001
        DFHMDF POS=(07,43),                                            X01180001
               LENGTH=00,                                              X01190001
               ATTRB=(ASKIP,BRT)                                        01200001
*                                                                       01210001
ATOFF06 DFHMDF POS=(07,44),                                            X01220001
               LENGTH=06,                                              X01230001
               ATTRB=ASKIP,                                            X01231007
               COLOR=BLUE,                                             X01232007
               PICOUT='XXXXXX'                                          01260001
        DFHMDF POS=(07,51),                                            X01270001
               LENGTH=00,                                              X01280001
               ATTRB=(ASKIP,BRT)                                        01290001
*                                                                       01300001
AOPER06 DFHMDF POS=(07,52),                                            X01310001
               LENGTH=04,                                              X01320001
               ATTRB=ASKIP,                                            X01321007
               COLOR=BLUE,                                             X01322007
               PICOUT='9999'                                            01350001
        DFHMDF POS=(07,57),                                            X01360001
               LENGTH=01,                                              X01370001
               ATTRB=(ASKIP,BRT),                                      X01380001
               INITIAL='/'                                              01390001
*                                                                       01400001
AFCLT06 DFHMDF POS=(07,59),                                            X01410001
               LENGTH=04,                                              X01420001
               ATTRB=ASKIP,                                            X01421007
               COLOR=BLUE,                                             X01422007
               PICOUT='9999'                                            01450001
        DFHMDF POS=(07,64),                                            X01460001
               LENGTH=00,                                              X01470001
               ATTRB=(ASKIP,BRT)                                        01480001
*                                                                       01490001
AADDR06 DFHMDF POS=(07,65),                                            X01500001
               LENGTH=08,                                              X01510001
               ATTRB=ASKIP,                                            X01511007
               COLOR=BLUE,                                             X01512007
               PICOUT='XXXXXXXX'                                        01540001
        DFHMDF POS=(07,74),                                            X01550001
               LENGTH=00,                                              X01560001
               ATTRB=(ASKIP,BRT)                                        01570001
*********************************************************************** 01580001
ASEL07  DFHMDF POS=(08,02),                                            X01600001
               LENGTH=01,                                              X01610001
               ATTRB=UNPROT,                                           X01620001
               HILIGHT=UNDERLINE,                                      X01630001
               PICOUT='X'                                               01640001
        DFHMDF POS=(08,04),                                            X01650001
               LENGTH=00,                                              X01660001
               ATTRB=(ASKIP,BRT)                                        01670001
*                                                                       01680001
ATOFF07 DFHMDF POS=(08,05),                                            X01690001
               LENGTH=06,                                              X01700001
               ATTRB=ASKIP,                                            X01701007
               COLOR=BLUE,                                             X01702007
               PICOUT='XXXXXX'                                          01730001
        DFHMDF POS=(08,12),                                            X01740001
               LENGTH=00,                                              X01750001
               ATTRB=(ASKIP,BRT)                                        01760001
*                                                                       01770001
AOPER07 DFHMDF POS=(08,13),                                            X01780001
               LENGTH=04,                                              X01790001
               ATTRB=ASKIP,                                            X01791007
               COLOR=BLUE,                                             X01792007
               PICOUT='9999'                                            01820001
        DFHMDF POS=(08,18),                                            X01830001
               LENGTH=01,                                              X01840001
               ATTRB=(ASKIP,BRT),                                      X01850001
               INITIAL='/'                                              01860001
*                                                                       01870001
AFCLT07 DFHMDF POS=(08,20),                                            X01880001
               LENGTH=04,                                              X01890001
               ATTRB=ASKIP,                                            X01891007
               COLOR=BLUE,                                             X01892007
               PICOUT='9999'                                            01920001
        DFHMDF POS=(08,25),                                            X01930001
               LENGTH=00,                                              X01940001
               ATTRB=(ASKIP,BRT)                                        01950001
*                                                                       01960001
AADDR07 DFHMDF POS=(08,26),                                            X01970001
               LENGTH=08,                                              X01980001
               ATTRB=ASKIP,                                            X01981007
               COLOR=BLUE,                                             X01982007
               PICOUT='XXXXXXXX'                                        02010001
        DFHMDF POS=(08,35),                                            X02020001
               LENGTH=00,                                              X02030001
               ATTRB=(ASKIP,BRT)                                        02040001
* * *                                                                   02050001
        DFHMDF POS=(08,38),                                            X02060003
               LENGTH=01,                                              X02070001
               ATTRB=(ASKIP,BRT),                                      X02080001
               INITIAL='|'                                              02090001
* * *                                                                   02100001
ASEL08  DFHMDF POS=(08,41),                                            X02110001
               LENGTH=01,                                              X02120001
               ATTRB=UNPROT,                                           X02130001
               HILIGHT=UNDERLINE,                                      X02140001
               PICOUT='X'                                               02150001
        DFHMDF POS=(08,43),                                            X02160001
               LENGTH=00,                                              X02170001
               ATTRB=(ASKIP,BRT)                                        02180001
*                                                                       02190001
ATOFF08 DFHMDF POS=(08,44),                                            X02200001
               LENGTH=06,                                              X02210001
               ATTRB=ASKIP,                                            X02211007
               COLOR=BLUE,                                             X02212007
               PICOUT='XXXXXX'                                          02240001
        DFHMDF POS=(08,51),                                            X02250001
               LENGTH=00,                                              X02260001
               ATTRB=(ASKIP,BRT)                                        02270001
*                                                                       02280001
AOPER08 DFHMDF POS=(08,52),                                            X02290001
               LENGTH=04,                                              X02300001
               ATTRB=ASKIP,                                            X02301007
               COLOR=BLUE,                                             X02302007
               PICOUT='9999'                                            02330001
        DFHMDF POS=(08,57),                                            X02340001
               LENGTH=01,                                              X02350001
               ATTRB=(ASKIP,BRT),                                      X02360001
               INITIAL='/'                                              02370001
*                                                                       02380001
AFCLT08 DFHMDF POS=(08,59),                                            X02390001
               LENGTH=04,                                              X02400001
               ATTRB=ASKIP,                                            X02401007
               COLOR=BLUE,                                             X02402007
               PICOUT='9999'                                            02430001
        DFHMDF POS=(08,64),                                            X02440001
               LENGTH=00,                                              X02450001
               ATTRB=(ASKIP,BRT)                                        02460001
*                                                                       02470001
AADDR08 DFHMDF POS=(08,65),                                            X02480001
               LENGTH=08,                                              X02490001
               ATTRB=ASKIP,                                            X02491007
               COLOR=BLUE,                                             X02492007
               PICOUT='XXXXXXXX'                                        02520001
        DFHMDF POS=(08,74),                                            X02530001
               LENGTH=00,                                              X02540001
               ATTRB=(ASKIP,BRT)                                        02550001
*********************************************************************** 02560001
ASEL09  DFHMDF POS=(09,02),                                            X02580001
               LENGTH=01,                                              X02590001
               ATTRB=UNPROT,                                           X02600001
               HILIGHT=UNDERLINE,                                      X02610001
               PICOUT='X'                                               02620001
        DFHMDF POS=(09,04),                                            X02630002
               LENGTH=00,                                              X02640001
               ATTRB=(ASKIP,BRT)                                        02650001
*                                                                       02660001
ATOFF09 DFHMDF POS=(09,05),                                            X02670001
               LENGTH=06,                                              X02680001
               ATTRB=ASKIP,                                            X02681007
               COLOR=BLUE,                                             X02682007
               PICOUT='XXXXXX'                                          02710001
        DFHMDF POS=(09,12),                                            X02720001
               LENGTH=00,                                              X02730001
               ATTRB=(ASKIP,BRT)                                        02740001
*                                                                       02750001
AOPER09 DFHMDF POS=(09,13),                                            X02760001
               LENGTH=04,                                              X02770001
               ATTRB=ASKIP,                                            X02771007
               COLOR=BLUE,                                             X02772007
               PICOUT='9999'                                            02800001
        DFHMDF POS=(09,18),                                            X02810001
               LENGTH=01,                                              X02820001
               ATTRB=(ASKIP,BRT),                                      X02830001
               INITIAL='/'                                              02840001
*                                                                       02850001
AFCLT09 DFHMDF POS=(09,20),                                            X02860001
               LENGTH=04,                                              X02870001
               ATTRB=ASKIP,                                            X02871007
               COLOR=BLUE,                                             X02872007
               PICOUT='9999'                                            02900001
        DFHMDF POS=(09,25),                                            X02910001
               LENGTH=00,                                              X02920001
               ATTRB=(ASKIP,BRT)                                        02930001
*                                                                       02940001
AADDR09 DFHMDF POS=(09,26),                                            X02950001
               LENGTH=08,                                              X02960001
               ATTRB=ASKIP,                                            X02961007
               COLOR=BLUE,                                             X02962007
               PICOUT='XXXXXXXX'                                        02990001
        DFHMDF POS=(09,35),                                            X03000001
               LENGTH=00,                                              X03010001
               ATTRB=(ASKIP,BRT)                                        03020001
* * *                                                                   03030001
        DFHMDF POS=(09,38),                                            X03040003
               LENGTH=01,                                              X03050001
               ATTRB=(ASKIP,BRT),                                      X03060001
               INITIAL='|'                                              03070001
* * *                                                                   03080001
ASEL10  DFHMDF POS=(09,41),                                            X03090001
               LENGTH=01,                                              X03100001
               ATTRB=UNPROT,                                           X03110001
               HILIGHT=UNDERLINE,                                      X03120001
               PICOUT='X'                                               03130001
        DFHMDF POS=(09,43),                                            X03140001
               LENGTH=00,                                              X03150001
               ATTRB=(ASKIP,BRT)                                        03160001
*                                                                       03170001
ATOFF10 DFHMDF POS=(09,44),                                            X03180001
               LENGTH=06,                                              X03190001
               ATTRB=ASKIP,                                            X03191007
               COLOR=BLUE,                                             X03192007
               PICOUT='XXXXXX'                                          03220001
        DFHMDF POS=(09,51),                                            X03230001
               LENGTH=00,                                              X03240001
               ATTRB=(ASKIP,BRT)                                        03250001
*                                                                       03260001
AOPER10 DFHMDF POS=(09,52),                                            X03270001
               LENGTH=04,                                              X03280001
               ATTRB=ASKIP,                                            X03281007
               COLOR=BLUE,                                             X03282007
               PICOUT='9999'                                            03310001
        DFHMDF POS=(09,57),                                            X03320001
               LENGTH=01,                                              X03330001
               ATTRB=(ASKIP,BRT),                                      X03340001
               INITIAL='/'                                              03350001
*                                                                       03360001
AFCLT10 DFHMDF POS=(09,59),                                            X03370001
               LENGTH=04,                                              X03380001
               ATTRB=ASKIP,                                            X03381007
               COLOR=BLUE,                                             X03382007
               PICOUT='9999'                                            03410001
        DFHMDF POS=(09,64),                                            X03420001
               LENGTH=00,                                              X03430001
               ATTRB=(ASKIP,BRT)                                        03440001
*                                                                       03450001
AADDR10 DFHMDF POS=(09,65),                                            X03460001
               LENGTH=08,                                              X03470001
               ATTRB=ASKIP,                                            X03471007
               COLOR=BLUE,                                             X03472007
               PICOUT='XXXXXXXX'                                        03500001
        DFHMDF POS=(09,74),                                            X03510001
               LENGTH=00,                                              X03520001
               ATTRB=(ASKIP,BRT)                                        03530001
*********************************************************************** 03890000
        DFHMDF POS=(10,45),                                            X03900002
               LENGTH=25,                                              X03910000
               ATTRB=(ASKIP,BRT),                                      X03920000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      03930000
*                                                                       03940000
ATOTSEL DFHMDF POS=(10,72),                                            X03950002
               ATTRB=(ASKIP,BRT),                                      X03960000
               LENGTH=05,                                              X03970000
               PICOUT='99999'                                           03980000
*                                                                       03990000
*********************************************************************** 04000000
*********************************************************************** 04001002
        DFHMDF POS=(12,02),                                            X04002002
               LENGTH=41,                                              X04003002
               ATTRB=(ASKIP,BRT),                                      X04004002
               INITIAL='TICKET FORMAT ID (USED BY TICKET OFFICE):'      04005002
*                                                                       04006002
ATFID   DFHMDF POS=(12,44),                                            X04007002
               LENGTH=06,                                              X04009002
               ATTRB=UNPROT,                                           X04009202
               HILIGHT=UNDERLINE,                                      X04009302
               PICOUT='XXXXXX'                                          04009502
        DFHMDF POS=(12,51),                                            X04009602
               LENGTH=00,                                              X04009702
               ATTRB=(ASKIP,BRT)                                        04009802
*                                                                       04009902
*********************************************************************** 04010002
        DFHMDF POS=(13,02),                                            X04010102
               LENGTH=41,                                              X04010202
               ATTRB=(ASKIP,BRT),                                      X04010302
               INITIAL='TICKET FORMAT DESCRIPTION (USED BY VSM).:'      04010412
*                                                                       04010502
ATFDESC DFHMDF POS=(13,44),                                            X04010603
               LENGTH=20,                                              X04010711
               ATTRB=UNPROT,                                           X04010802
               HILIGHT=UNDERLINE,                                      X04010902
               PICOUT='XXXXXXXXXXXXXXXXXXXX'                            04011011
        DFHMDF POS=(13,65),                                            X04011111
               LENGTH=00,                                              X04011202
               ATTRB=(ASKIP,BRT)                                        04011302
*                                                                       04011402
*********************************************************************** 04011504
        DFHMDF POS=(14,02),                                            X04011604
               LENGTH=26,                                              X04011706
               ATTRB=(ASKIP,BRT),                                      X04011804
               INITIAL='PRETICKET FORMAT ........:'                     04011906
*                                                                       04012104
APTICK  DFHMDF POS=(14,29),                                            X04012206
               LENGTH=01,                                              X04012306
               ATTRB=UNPROT,                                           X04012404
               HILIGHT=UNDERLINE,                                      X04012504
               PICOUT='X'                                               04012606
        DFHMDF POS=(14,31),                                            X04012706
               LENGTH=05,                                              X04012806
               ATTRB=(ASKIP,BRT),                                      X04012906
               INITIAL='(Y/N)'                                          04013006
*                                                                       04014613
        DFHMDF POS=(14,38),                                            X04014814
               LENGTH=24,                                              X04014914
               ATTRB=(ASKIP,BRT),                                      X04015014
               INITIAL='TICKET FORMAT TYPE CODE:'                       04015114
*                                                                       04015214
AFTYCDE DFHMDF POS=(14,63),                                            X04015317
               LENGTH=1,                                               X04015414
               ATTRB=UNPROT,                                           X04015514
               HILIGHT=UNDERLINE,                                      X04015614
               PICOUT='X'                                               04015714
        DFHMDF POS=(14,65),                                            X04015814
               LENGTH=05,                                              X04015916
               ATTRB=(ASKIP,BRT),                                      X04016016
               INITIAL='(E/I)'                                          04016116
*                                                                       04016214
*********************************************************************** 04016304
        DFHMDF POS=(15,02),                                            X04016404
               LENGTH=26,                                              X04016504
               ATTRB=(ASKIP,BRT),                                      X04016604
               INITIAL='DISPLAY THE SIZE ........:'                     04016704
*                                                                       04016804
ASIZE   DFHMDF POS=(15,29),                                            X04016904
               LENGTH=1,                                               X04017004
               ATTRB=UNPROT,                                           X04017104
               HILIGHT=UNDERLINE,                                      X04017204
               PICOUT='X'                                               04017304
        DFHMDF POS=(15,31),                                            X04017404
               LENGTH=05,                                              X04017506
               ATTRB=(ASKIP,BRT),                                      X04017606
               INITIAL='(Y/N)'                                          04017706
*                                                                       04017814
        DFHMDF POS=(15,38),                                            X04017914
               LENGTH=24,                                              X04018014
               ATTRB=(ASKIP,BRT),                                      X04018114
               INITIAL='TICKET FORMAT NUMBER...:'                       04018217
*                                                                       04018314
AFMTNBR DFHMDF POS=(15,63),                                            X04018417
               LENGTH=15,                                              X04018514
               ATTRB=UNPROT,                                           X04018614
               HILIGHT=UNDERLINE,                                      X04018714
               PICOUT='XXXXXXXXXXXXXXX'                                 04018814
        DFHMDF POS=(15,79),                                            X04018914
               LENGTH=00,                                              X04019014
               ATTRB=(ASKIP,BRT)                                        04019114
*                                                                       04019204
*********************************************************************** 04019304
        DFHMDF POS=(16,02),                                            X04019404
               LENGTH=26,                                              X04019504
               ATTRB=(ASKIP,BRT),                                      X04019604
               INITIAL='DISPLAY THE COLOR .......:'                     04019704
*                                                                       04019804
ACOLOR  DFHMDF POS=(16,29),                                            X04019904
               LENGTH=1,                                               X04020004
               ATTRB=UNPROT,                                           X04020104
               HILIGHT=UNDERLINE,                                      X04020204
               PICOUT='X'                                               04020304
        DFHMDF POS=(16,31),                                            X04020404
               LENGTH=05,                                              X04020506
               ATTRB=(ASKIP,BRT),                                      X04020606
               INITIAL='(Y/N)'                                          04020706
*                                                                       04020815
        DFHMDF POS=(16,40),                                            X04020915
               LENGTH=36,                                              X04021015
               ATTRB=(ASKIP,BRT),                                      X04021115
               INITIAL='(REQUIRED FOR IMPORT TICKET FORMATS)'           04021215
*                                                                       04022004
*********************************************************************** 04022204
        DFHMDF POS=(17,02),                                            X04022304
               LENGTH=26,                                              X04022404
               ATTRB=(ASKIP,BRT),                                      X04022504
               INITIAL='DISPLAY OPT BLK (TAGS) ..:'                     04022610
*                                                                       04022704
AOPBLTG DFHMDF POS=(17,29),                                            X04022810
               LENGTH=1,                                               X04022904
               ATTRB=UNPROT,                                           X04023004
               HILIGHT=UNDERLINE,                                      X04023104
               PICOUT='X'                                               04023204
        DFHMDF POS=(17,31),                                            X04023304
               LENGTH=05,                                              X04023406
               ATTRB=(ASKIP,BRT),                                      X04023506
               INITIAL='(Y/N)'                                          04023606
*                                                                       04025114
        DFHMDF POS=(17,38),                                            X04025214
               LENGTH=24,                                              X04025314
               ATTRB=(ASKIP,BRT),                                      X04025414
               INITIAL='PAPER STOCK ID ........:'                       04025514
*                                                                       04025614
APAPER  DFHMDF POS=(17,63),                                            X04025714
               LENGTH=6,                                               X04025814
               ATTRB=UNPROT,                                           X04025914
               HILIGHT=UNDERLINE,                                      X04026014
               PICOUT='XXXXXX'                                          04026114
        DFHMDF POS=(17,70),                                            X04026214
               LENGTH=00,                                              X04026314
               ATTRB=(ASKIP,BRT)                                        04026414
*                                                                       04026504
*********************************************************************** 04026604
        DFHMDF POS=(18,02),                                            X04026710
               LENGTH=26,                                              X04026810
               ATTRB=(ASKIP,BRT),                                      X04026910
               INITIAL='DISPLAY OPT BLK (LABELS).:'                     04027010
*                                                                       04027110
AOPBLLB DFHMDF POS=(18,29),                                            X04027210
               LENGTH=1,                                               X04027310
               ATTRB=UNPROT,                                           X04027410
               HILIGHT=UNDERLINE,                                      X04027510
               PICOUT='X'                                               04027610
        DFHMDF POS=(18,31),                                            X04027710
               LENGTH=05,                                              X04027810
               ATTRB=(ASKIP,BRT),                                      X04027910
               INITIAL='(Y/N)'                                          04028010
*                                                                       04029514
        DFHMDF POS=(18,38),                                            X04029614
               LENGTH=24,                                              X04029714
               ATTRB=(ASKIP,BRT),                                      X04029814
               INITIAL='NUMBER OF EXTRA TICKETS:'                       04029914
*                                                                       04030014
AXTKTNB DFHMDF POS=(18,63),                                            X04030114
               LENGTH=4,                                               X04030214
               ATTRB=UNPROT,                                           X04030314
               HILIGHT=UNDERLINE,                                      X04030414
               PICOUT='ZZZZ'                                            04030514
        DFHMDF POS=(18,68),                                            X04030614
               LENGTH=00,                                              X04030714
               ATTRB=(ASKIP,BRT)                                        04030814
*                                                                       04030904
*********************************************************************** 04031004
        DFHMDF POS=(19,02),                                            X04031110
               LENGTH=26,                                              X04031210
               ATTRB=(ASKIP,BRT),                                      X04031310
               INITIAL='DISPLAY THE STICKER NBR..:'                     04031410
*                                                                       04031510
ASTRNBR DFHMDF POS=(19,29),                                            X04031610
               LENGTH=1,                                               X04031710
               ATTRB=UNPROT,                                           X04031810
               HILIGHT=UNDERLINE,                                      X04031910
               PICOUT='X'                                               04032010
        DFHMDF POS=(19,31),                                            X04032110
               LENGTH=05,                                              X04032210
               ATTRB=(ASKIP,BRT),                                      X04032310
               INITIAL='(Y/N)'                                          04032410
*                                                                       04032514
        DFHMDF POS=(19,38),                                            X04032614
               LENGTH=24,                                              X04032714
               ATTRB=(ASKIP,BRT),                                      X04032814
               INITIAL='-OR- % OF EXTRA TICKETS:'                       04032914
*                                                                       04033014
AXTKTPT DFHMDF POS=(19,63),                                            X04033114
               LENGTH=4,                                               X04033214
               ATTRB=UNPROT,                                           X04033314
               HILIGHT=UNDERLINE,                                      X04033414
               PICOUT='ZZZZ'                                            04033514
*                                                                       04033614
        DFHMDF POS=(19,68),                                            X04033714
               LENGTH=01,                                              X04033814
               ATTRB=(ASKIP,BRT),                                      X04033914
               INITIAL='%'                                              04034014
*                                                                       04034114
*********************************************************************** 04034510
*                                                                       04034610
        DFHMSD TYPE=FINAL                                               04034704
        PRINT NOGEN                                                     04035004
        END                                                             04040000
