        PRINT NOGEN                                                     00010000
VLKM517 DFHMSD TYPE=MAP,                                               X00020000
               MODE=INOUT,                                             X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES                                              00050000
VL517A  DFHMDI SIZE=(19,80),                                           X00060000
               CTRL=(FREEKB,FRSET),                                    X00070000
               LINE=2,COLUMN=1,                                        X00080000
               MAPATTS=(COLOR,HILIGHT),                                X00090000
               DSATTS=(COLOR,HILIGHT)                                   00100000
*********************************************************************** 00110000
        DFHMDF POS=(02,46),                                            X00120001
               LENGTH=06,                                              X00130000
               ATTRB=(ASKIP,BRT),                                      X00140000
               INITIAL='ITEMS:'                                         00150000
ASTRTIT DFHMDF POS=(02,54),                                            X00160001
               ATTRB=UNPROT,                                           X00170000
               HILIGHT=UNDERLINE,                                      X00180000
               LENGTH=05,                                              X00190000
               PICOUT='ZZZZZ'                                           00200000
*                                                                       00210000
        DFHMDF POS=(02,60),                                            X00220001
               LENGTH=02,                                              X00230000
               ATTRB=(ASKIP,BRT),                                      X00240000
               INITIAL='TO'                                             00250000
AENDIT  DFHMDF POS=(02,63),                                            X00260001
               COLOR=BLUE,                                             X00260100
               ATTRB=(ASKIP,BRT),                                      X00261000
               LENGTH=05,                                              X00290000
               PICOUT='ZZZZZ'                                           00300000
*                                                                       00310000
        DFHMDF POS=(02,69),                                            X00320001
               LENGTH=02,                                              X00330000
               ATTRB=(ASKIP,BRT),                                      X00340000
               INITIAL='OF'                                             00350000
ATOTIT  DFHMDF POS=(02,72),                                            X00360001
               COLOR=BLUE,                                             X00361000
               ATTRB=(ASKIP,BRT),                                      X00362000
               LENGTH=05,                                              X00390000
               PICOUT='ZZZZZ'                                           00400000
*                                                                       00410000
*********************************************************************** 00420000
        DFHMDF POS=(03,01),                                            X00430001
               LENGTH=03,                                              X00440001
               ATTRB=(ASKIP,BRT),                                      X00450000
               INITIAL='SEL'                                            00460001
*                                                                       00470000
        DFHMDF POS=(03,05),                                            X00480001
               LENGTH=03,                                              X00490000
               ATTRB=(ASKIP,BRT),                                      X00500000
               INITIAL='ACT'                                            00510001
*                                                                       00520000
        DFHMDF POS=(03,10),                                            X00530001
               LENGTH=04,                                              X00540001
               ATTRB=(ASKIP,BRT),                                      X00550000
               INITIAL='SCAC'                                           00560001
*                                                                       00570000
        DFHMDF POS=(03,18),                                            X00580001
               LENGTH=16,                                              X00590001
               ATTRB=(ASKIP,BRT),                                      X00600000
               INITIAL='SHIPPING NUMBER'                                00610001
*                                                                       00611000
        DFHMDF POS=(03,36),                                            X00612001
               LENGTH=09,                                              X00613001
               ATTRB=(ASKIP,BRT),                                      X00614000
               INITIAL='SHIP DATE'                                      00615001
*                                                                       00620000
        DFHMDF POS=(03,48),                                            X00630001
               LENGTH=09,                                              X00640001
               ATTRB=(ASKIP,BRT),                                      X00650000
               INITIAL='PO NUMBER'                                      00660001
*                                                                       00661001
        DFHMDF POS=(03,60),                                            X00662001
               LENGTH=11,                                              X00663001
               ATTRB=(ASKIP,BRT),                                      X00664001
               INITIAL='VENDOR NAME'                                    00665001
*********************************************************************** 01080000
ASEL01  DFHMDF POS=(04,02),                                            X01090001
               LENGTH=01,                                              X01100000
               ATTRB=UNPROT,                                           X01110000
               HILIGHT=UNDERLINE,                                      X01120000
               PICOUT='X'                                               01130000
        DFHMDF POS=(04,04),                                            X01131001
               LENGTH=01,                                              X01132000
               ATTRB=(ASKIP,BRT)                                        01133000
*                                                                       01140000
AACT01  DFHMDF POS=(04,06),                                            X01172002
               LENGTH=03,                                              X01173000
               ATTRB=(ASKIP,BRT)                                        01174000
*                                                                       01180000
ASCAC01 DFHMDF POS=(04,10),                                            X01181001
               COLOR=BLUE,                                             X01181100
               LENGTH=04,                                              X01182001
               ATTRB=(ASKIP,BRT)                                        01183000
*                                                                       01184000
ASNBR01 DFHMDF POS=(04,16),                                            X01190001
               COLOR=BLUE,                                             X01191000
               LENGTH=18,                                              X01200001
               ATTRB=(ASKIP,BRT)                                        01210000
*                                                                       01220000
ASDTE01 DFHMDF POS=(04,36),                                            X01230001
               LENGTH=10,                                              X01240001
               COLOR=BLUE,                                             X01241000
               ATTRB=(ASKIP,BRT)                                        01250001
*                                                                       01270000
APO01   DFHMDF POS=(04,48),                                            X01280001
               COLOR=BLUE,                                             X01281000
               LENGTH=08,                                              X01290001
               ATTRB=(ASKIP,NORM)                                       01300001
*                                                                       01320000
AVNME01 DFHMDF POS=(04,58),                                            X01330001
               COLOR=BLUE,                                             X01331000
               LENGTH=20,                                              X01340001
               ATTRB=(ASKIP,BRT)                                        01350001
*********************************************************************** 01360001
ASEL02  DFHMDF POS=(05,02),                                            X01370001
               LENGTH=01,                                              X01380001
               ATTRB=UNPROT,                                           X01390001
               HILIGHT=UNDERLINE,                                      X01400001
               PICOUT='X'                                               01410001
        DFHMDF POS=(05,04),                                            X01420001
               LENGTH=01,                                              X01430001
               ATTRB=(ASKIP,BRT)                                        01440001
*                                                                       01450001
AACT02  DFHMDF POS=(05,06),                                            X01460002
               LENGTH=03,                                              X01470001
               ATTRB=(ASKIP,BRT)                                        01480001
*                                                                       01490001
ASCAC02 DFHMDF POS=(05,10),                                            X01500001
               COLOR=BLUE,                                             X01510001
               LENGTH=04,                                              X01520001
               ATTRB=(ASKIP,BRT)                                        01530001
*                                                                       01540001
ASNBR02 DFHMDF POS=(05,16),                                            X01550001
               COLOR=BLUE,                                             X01560001
               LENGTH=18,                                              X01570001
               ATTRB=(ASKIP,BRT)                                        01580001
*                                                                       01590001
ASDTE02 DFHMDF POS=(05,36),                                            X01600001
               LENGTH=10,                                              X01610001
               COLOR=BLUE,                                             X01620001
               ATTRB=(ASKIP,BRT)                                        01630001
*                                                                       01640001
APO02   DFHMDF POS=(05,48),                                            X01650001
               COLOR=BLUE,                                             X01660001
               LENGTH=08,                                              X01670001
               ATTRB=(ASKIP,NORM)                                       01680001
*                                                                       01690001
AVNME02 DFHMDF POS=(05,58),                                            X01700001
               COLOR=BLUE,                                             X01710001
               LENGTH=20,                                              X01720001
               ATTRB=(ASKIP,BRT)                                        01730001
*********************************************************************** 01740001
ASEL03  DFHMDF POS=(06,02),                                            X01750001
               LENGTH=01,                                              X01760001
               ATTRB=UNPROT,                                           X01770001
               HILIGHT=UNDERLINE,                                      X01780001
               PICOUT='X'                                               01790001
        DFHMDF POS=(06,04),                                            X01800001
               LENGTH=01,                                              X01810001
               ATTRB=(ASKIP,BRT)                                        01820001
*                                                                       01830001
AACT03  DFHMDF POS=(06,06),                                            X01840002
               LENGTH=03,                                              X01850001
               ATTRB=(ASKIP,BRT)                                        01860001
*                                                                       01870001
ASCAC03 DFHMDF POS=(06,10),                                            X01880001
               COLOR=BLUE,                                             X01890001
               LENGTH=04,                                              X01900001
               ATTRB=(ASKIP,BRT)                                        01910001
*                                                                       01920001
ASNBR03 DFHMDF POS=(06,16),                                            X01930001
               COLOR=BLUE,                                             X01940001
               LENGTH=18,                                              X01950001
               ATTRB=(ASKIP,BRT)                                        01960001
*                                                                       01970001
ASDTE03 DFHMDF POS=(06,36),                                            X01980001
               LENGTH=10,                                              X01990001
               COLOR=BLUE,                                             X02000001
               ATTRB=(ASKIP,BRT)                                        02010001
*                                                                       02020001
APO03   DFHMDF POS=(06,48),                                            X02030001
               COLOR=BLUE,                                             X02040001
               LENGTH=08,                                              X02050001
               ATTRB=(ASKIP,NORM)                                       02060001
*                                                                       02070001
AVNME03 DFHMDF POS=(06,58),                                            X02080001
               COLOR=BLUE,                                             X02090001
               LENGTH=20,                                              X02100001
               ATTRB=(ASKIP,BRT)                                        02110001
*********************************************************************** 02120001
ASEL04  DFHMDF POS=(07,02),                                            X02130001
               LENGTH=01,                                              X02140001
               ATTRB=UNPROT,                                           X02150001
               HILIGHT=UNDERLINE,                                      X02160001
               PICOUT='X'                                               02170001
        DFHMDF POS=(07,04),                                            X02180001
               LENGTH=01,                                              X02190001
               ATTRB=(ASKIP,BRT)                                        02200001
*                                                                       02210001
AACT04  DFHMDF POS=(07,06),                                            X02220002
               LENGTH=03,                                              X02230001
               ATTRB=(ASKIP,BRT)                                        02240001
*                                                                       02250001
ASCAC04 DFHMDF POS=(07,10),                                            X02260001
               COLOR=BLUE,                                             X02270001
               LENGTH=04,                                              X02280001
               ATTRB=(ASKIP,BRT)                                        02290001
*                                                                       02300001
ASNBR04 DFHMDF POS=(07,16),                                            X02310001
               COLOR=BLUE,                                             X02320001
               LENGTH=18,                                              X02330001
               ATTRB=(ASKIP,BRT)                                        02340001
*                                                                       02350001
ASDTE04 DFHMDF POS=(07,36),                                            X02360001
               LENGTH=10,                                              X02370001
               COLOR=BLUE,                                             X02380001
               ATTRB=(ASKIP,BRT)                                        02390001
*                                                                       02400001
APO04   DFHMDF POS=(07,48),                                            X02410001
               COLOR=BLUE,                                             X02420001
               LENGTH=08,                                              X02430001
               ATTRB=(ASKIP,NORM)                                       02440001
*                                                                       02450001
AVNME04 DFHMDF POS=(07,58),                                            X02460001
               COLOR=BLUE,                                             X02470001
               LENGTH=20,                                              X02480001
               ATTRB=(ASKIP,BRT)                                        02490001
*********************************************************************** 02500001
ASEL05  DFHMDF POS=(08,02),                                            X02510001
               LENGTH=01,                                              X02520001
               ATTRB=UNPROT,                                           X02530001
               HILIGHT=UNDERLINE,                                      X02540001
               PICOUT='X'                                               02550001
        DFHMDF POS=(08,04),                                            X02560001
               LENGTH=01,                                              X02570001
               ATTRB=(ASKIP,BRT)                                        02580001
*                                                                       02590001
AACT05  DFHMDF POS=(08,06),                                            X02600002
               LENGTH=03,                                              X02610001
               ATTRB=(ASKIP,BRT)                                        02620001
*                                                                       02630001
ASCAC05 DFHMDF POS=(08,10),                                            X02640001
               COLOR=BLUE,                                             X02650001
               LENGTH=04,                                              X02660001
               ATTRB=(ASKIP,BRT)                                        02670001
*                                                                       02680001
ASNBR05 DFHMDF POS=(08,16),                                            X02690001
               COLOR=BLUE,                                             X02700001
               LENGTH=18,                                              X02710001
               ATTRB=(ASKIP,BRT)                                        02720001
*                                                                       02730001
ASDTE05 DFHMDF POS=(08,36),                                            X02740001
               LENGTH=10,                                              X02750001
               COLOR=BLUE,                                             X02760001
               ATTRB=(ASKIP,BRT)                                        02770001
*                                                                       02780001
APO05   DFHMDF POS=(08,48),                                            X02790001
               COLOR=BLUE,                                             X02800001
               LENGTH=08,                                              X02810001
               ATTRB=(ASKIP,NORM)                                       02820001
*                                                                       02830001
AVNME05 DFHMDF POS=(08,58),                                            X02840001
               COLOR=BLUE,                                             X02850001
               LENGTH=20,                                              X02860001
               ATTRB=(ASKIP,BRT)                                        02870001
*********************************************************************** 02880001
ASEL06  DFHMDF POS=(09,02),                                            X02890001
               LENGTH=01,                                              X02900001
               ATTRB=UNPROT,                                           X02910001
               HILIGHT=UNDERLINE,                                      X02920001
               PICOUT='X'                                               02930001
        DFHMDF POS=(09,04),                                            X02940001
               LENGTH=01,                                              X02950001
               ATTRB=(ASKIP,BRT)                                        02960001
*                                                                       02970001
AACT06  DFHMDF POS=(09,06),                                            X02980002
               LENGTH=03,                                              X02990001
               ATTRB=(ASKIP,BRT)                                        03000001
*                                                                       03010001
ASCAC06 DFHMDF POS=(09,10),                                            X03020001
               COLOR=BLUE,                                             X03030001
               LENGTH=04,                                              X03040001
               ATTRB=(ASKIP,BRT)                                        03050001
*                                                                       03060001
ASNBR06 DFHMDF POS=(09,16),                                            X03070001
               COLOR=BLUE,                                             X03080001
               LENGTH=18,                                              X03090001
               ATTRB=(ASKIP,BRT)                                        03100001
*                                                                       03110001
ASDTE06 DFHMDF POS=(09,36),                                            X03120001
               LENGTH=10,                                              X03130001
               COLOR=BLUE,                                             X03140001
               ATTRB=(ASKIP,BRT)                                        03150001
*                                                                       03160001
APO06   DFHMDF POS=(09,48),                                            X03170001
               COLOR=BLUE,                                             X03180001
               LENGTH=08,                                              X03190001
               ATTRB=(ASKIP,NORM)                                       03200001
*                                                                       03210001
AVNME06 DFHMDF POS=(09,58),                                            X03220001
               COLOR=BLUE,                                             X03230001
               LENGTH=20,                                              X03240001
               ATTRB=(ASKIP,BRT)                                        03250001
*********************************************************************** 03260001
ASEL07  DFHMDF POS=(10,02),                                            X03270001
               LENGTH=01,                                              X03280001
               ATTRB=UNPROT,                                           X03290001
               HILIGHT=UNDERLINE,                                      X03300001
               PICOUT='X'                                               03310001
        DFHMDF POS=(10,04),                                            X03320001
               LENGTH=01,                                              X03330001
               ATTRB=(ASKIP,BRT)                                        03340001
*                                                                       03350001
AACT07  DFHMDF POS=(10,06),                                            X03360002
               LENGTH=03,                                              X03370001
               ATTRB=(ASKIP,BRT)                                        03380001
*                                                                       03390001
ASCAC07 DFHMDF POS=(10,10),                                            X03400001
               COLOR=BLUE,                                             X03410001
               LENGTH=04,                                              X03420001
               ATTRB=(ASKIP,BRT)                                        03430001
*                                                                       03440001
ASNBR07 DFHMDF POS=(10,16),                                            X03450001
               COLOR=BLUE,                                             X03460001
               LENGTH=18,                                              X03470001
               ATTRB=(ASKIP,BRT)                                        03480001
*                                                                       03490001
ASDTE07 DFHMDF POS=(10,36),                                            X03500001
               LENGTH=10,                                              X03510001
               COLOR=BLUE,                                             X03520001
               ATTRB=(ASKIP,BRT)                                        03530001
*                                                                       03540001
APO07   DFHMDF POS=(10,48),                                            X03550001
               COLOR=BLUE,                                             X03560001
               LENGTH=08,                                              X03570001
               ATTRB=(ASKIP,NORM)                                       03580001
*                                                                       03590001
AVNME07 DFHMDF POS=(10,58),                                            X03600001
               COLOR=BLUE,                                             X03610001
               LENGTH=20,                                              X03620001
               ATTRB=(ASKIP,BRT)                                        03630001
*********************************************************************** 03640001
ASEL08  DFHMDF POS=(11,02),                                            X03650001
               LENGTH=01,                                              X03660001
               ATTRB=UNPROT,                                           X03670001
               HILIGHT=UNDERLINE,                                      X03680001
               PICOUT='X'                                               03690001
        DFHMDF POS=(11,04),                                            X03700001
               LENGTH=01,                                              X03710001
               ATTRB=(ASKIP,BRT)                                        03720001
*                                                                       03730001
AACT08  DFHMDF POS=(11,06),                                            X03740002
               LENGTH=03,                                              X03750001
               ATTRB=(ASKIP,BRT)                                        03760001
*                                                                       03770001
ASCAC08 DFHMDF POS=(11,10),                                            X03780001
               COLOR=BLUE,                                             X03790001
               LENGTH=04,                                              X03800001
               ATTRB=(ASKIP,BRT)                                        03810001
*                                                                       03820001
ASNBR08 DFHMDF POS=(11,16),                                            X03830001
               COLOR=BLUE,                                             X03840001
               LENGTH=18,                                              X03850001
               ATTRB=(ASKIP,BRT)                                        03860001
*                                                                       03870001
ASDTE08 DFHMDF POS=(11,36),                                            X03880001
               LENGTH=10,                                              X03890001
               COLOR=BLUE,                                             X03900001
               ATTRB=(ASKIP,BRT)                                        03910001
*                                                                       03920001
APO08   DFHMDF POS=(11,48),                                            X03930001
               COLOR=BLUE,                                             X03940001
               LENGTH=08,                                              X03950001
               ATTRB=(ASKIP,NORM)                                       03960001
*                                                                       03970001
AVNME08 DFHMDF POS=(11,58),                                            X03980001
               COLOR=BLUE,                                             X03990001
               LENGTH=20,                                              X04000001
               ATTRB=(ASKIP,BRT)                                        04010001
*********************************************************************** 04020001
ASEL09  DFHMDF POS=(12,02),                                            X04030001
               LENGTH=01,                                              X04040001
               ATTRB=UNPROT,                                           X04050001
               HILIGHT=UNDERLINE,                                      X04060001
               PICOUT='X'                                               04070001
        DFHMDF POS=(12,04),                                            X04080001
               LENGTH=01,                                              X04090001
               ATTRB=(ASKIP,BRT)                                        04100001
*                                                                       04110001
AACT09  DFHMDF POS=(12,06),                                            X04120002
               LENGTH=03,                                              X04130001
               ATTRB=(ASKIP,BRT)                                        04140001
*                                                                       04150001
ASCAC09 DFHMDF POS=(12,10),                                            X04160001
               COLOR=BLUE,                                             X04170001
               LENGTH=04,                                              X04180001
               ATTRB=(ASKIP,BRT)                                        04190001
*                                                                       04200001
ASNBR09 DFHMDF POS=(12,16),                                            X04210001
               COLOR=BLUE,                                             X04220001
               LENGTH=18,                                              X04230001
               ATTRB=(ASKIP,BRT)                                        04240001
*                                                                       04250001
ASDTE09 DFHMDF POS=(12,36),                                            X04260001
               LENGTH=10,                                              X04270001
               COLOR=BLUE,                                             X04280001
               ATTRB=(ASKIP,BRT)                                        04290001
*                                                                       04300001
APO09   DFHMDF POS=(12,48),                                            X04310001
               COLOR=BLUE,                                             X04320001
               LENGTH=08,                                              X04330001
               ATTRB=(ASKIP,NORM)                                       04340001
*                                                                       04350001
AVNME09 DFHMDF POS=(12,58),                                            X04360001
               COLOR=BLUE,                                             X04370001
               LENGTH=20,                                              X04380001
               ATTRB=(ASKIP,BRT)                                        04390001
*********************************************************************** 04400001
ASEL10  DFHMDF POS=(13,02),                                            X04410001
               LENGTH=01,                                              X04420001
               ATTRB=UNPROT,                                           X04430001
               HILIGHT=UNDERLINE,                                      X04440001
               PICOUT='X'                                               04450001
        DFHMDF POS=(13,04),                                            X04460001
               LENGTH=01,                                              X04470001
               ATTRB=(ASKIP,BRT)                                        04480001
*                                                                       04490001
AACT10  DFHMDF POS=(13,06),                                            X04500002
               LENGTH=03,                                              X04510001
               ATTRB=(ASKIP,BRT)                                        04520001
*                                                                       04530001
ASCAC10 DFHMDF POS=(13,10),                                            X04540001
               COLOR=BLUE,                                             X04550001
               LENGTH=04,                                              X04560001
               ATTRB=(ASKIP,BRT)                                        04570001
*                                                                       04580001
ASNBR10 DFHMDF POS=(13,16),                                            X04590001
               COLOR=BLUE,                                             X04600001
               LENGTH=18,                                              X04610001
               ATTRB=(ASKIP,BRT)                                        04620001
*                                                                       04630001
ASDTE10 DFHMDF POS=(13,36),                                            X04640001
               LENGTH=10,                                              X04650001
               COLOR=BLUE,                                             X04660001
               ATTRB=(ASKIP,BRT)                                        04670001
*                                                                       04680001
APO10   DFHMDF POS=(13,48),                                            X04690001
               COLOR=BLUE,                                             X04700001
               LENGTH=08,                                              X04710001
               ATTRB=(ASKIP,NORM)                                       04720001
*                                                                       04730001
AVNME10 DFHMDF POS=(13,58),                                            X04740001
               COLOR=BLUE,                                             X04750001
               LENGTH=20,                                              X04760001
               ATTRB=(ASKIP,BRT)                                        04770001
*********************************************************************** 04780001
ASEL11  DFHMDF POS=(14,02),                                            X04790001
               LENGTH=01,                                              X04800001
               ATTRB=UNPROT,                                           X04810001
               HILIGHT=UNDERLINE,                                      X04820001
               PICOUT='X'                                               04830001
        DFHMDF POS=(14,04),                                            X04840001
               LENGTH=01,                                              X04850001
               ATTRB=(ASKIP,BRT)                                        04860001
*                                                                       04870001
AACT11  DFHMDF POS=(14,06),                                            X04880002
               LENGTH=03,                                              X04890001
               ATTRB=(ASKIP,BRT)                                        04900001
*                                                                       04910001
ASCAC11 DFHMDF POS=(14,10),                                            X04920001
               COLOR=BLUE,                                             X04930001
               LENGTH=04,                                              X04940001
               ATTRB=(ASKIP,BRT)                                        04950001
*                                                                       04960001
ASNBR11 DFHMDF POS=(14,16),                                            X04970001
               COLOR=BLUE,                                             X04980001
               LENGTH=18,                                              X04990001
               ATTRB=(ASKIP,BRT)                                        05000001
*                                                                       05010001
ASDTE11 DFHMDF POS=(14,36),                                            X05020001
               LENGTH=10,                                              X05030001
               COLOR=BLUE,                                             X05040001
               ATTRB=(ASKIP,BRT)                                        05050001
*                                                                       05060001
APO11   DFHMDF POS=(14,48),                                            X05070001
               COLOR=BLUE,                                             X05080001
               LENGTH=08,                                              X05090001
               ATTRB=(ASKIP,NORM)                                       05100001
*                                                                       05110001
AVNME11 DFHMDF POS=(14,58),                                            X05120001
               COLOR=BLUE,                                             X05130001
               LENGTH=20,                                              X05140001
               ATTRB=(ASKIP,BRT)                                        05150001
*********************************************************************** 05160001
ASEL12  DFHMDF POS=(15,02),                                            X05170001
               LENGTH=01,                                              X05180001
               ATTRB=UNPROT,                                           X05190001
               HILIGHT=UNDERLINE,                                      X05200001
               PICOUT='X'                                               05210001
        DFHMDF POS=(15,04),                                            X05220001
               LENGTH=01,                                              X05230001
               ATTRB=(ASKIP,BRT)                                        05240001
*                                                                       05250001
AACT12  DFHMDF POS=(15,06),                                            X05260002
               LENGTH=03,                                              X05270001
               ATTRB=(ASKIP,BRT)                                        05280001
*                                                                       05290001
ASCAC12 DFHMDF POS=(15,10),                                            X05300001
               COLOR=BLUE,                                             X05310001
               LENGTH=04,                                              X05320001
               ATTRB=(ASKIP,BRT)                                        05330001
*                                                                       05340001
ASNBR12 DFHMDF POS=(15,16),                                            X05350001
               COLOR=BLUE,                                             X05360001
               LENGTH=18,                                              X05361001
               ATTRB=(ASKIP,BRT)                                        05362001
*                                                                       05363001
ASDTE12 DFHMDF POS=(15,36),                                            X05364001
               LENGTH=10,                                              X05365001
               COLOR=BLUE,                                             X05366001
               ATTRB=(ASKIP,BRT)                                        05367001
*                                                                       05368001
APO12   DFHMDF POS=(15,48),                                            X05369001
               COLOR=BLUE,                                             X05369101
               LENGTH=08,                                              X05369201
               ATTRB=(ASKIP,NORM)                                       05369301
*                                                                       05369401
AVNME12 DFHMDF POS=(15,58),                                            X05369501
               COLOR=BLUE,                                             X05369601
               LENGTH=20,                                              X05369701
               ATTRB=(ASKIP,BRT)                                        05369801
*********************************************************************** 05369901
ASEL13  DFHMDF POS=(16,02),                                            X05370001
               LENGTH=01,                                              X05370101
               ATTRB=UNPROT,                                           X05370201
               HILIGHT=UNDERLINE,                                      X05370301
               PICOUT='X'                                               05370401
        DFHMDF POS=(16,04),                                            X05370501
               LENGTH=01,                                              X05370601
               ATTRB=(ASKIP,BRT)                                        05370701
*                                                                       05370801
AACT13  DFHMDF POS=(16,06),                                            X05370902
               LENGTH=03,                                              X05371001
               ATTRB=(ASKIP,BRT)                                        05371101
*                                                                       05371201
ASCAC13 DFHMDF POS=(16,10),                                            X05371301
               COLOR=BLUE,                                             X05371401
               LENGTH=04,                                              X05371501
               ATTRB=(ASKIP,BRT)                                        05371601
*                                                                       05371701
ASNBR13 DFHMDF POS=(16,16),                                            X05371801
               COLOR=BLUE,                                             X05371901
               LENGTH=18,                                              X05372001
               ATTRB=(ASKIP,BRT)                                        05372101
*                                                                       05372201
ASDTE13 DFHMDF POS=(16,36),                                            X05372301
               LENGTH=10,                                              X05372401
               COLOR=BLUE,                                             X05372501
               ATTRB=(ASKIP,BRT)                                        05372601
*                                                                       05372701
APO13   DFHMDF POS=(16,48),                                            X05372801
               COLOR=BLUE,                                             X05372901
               LENGTH=08,                                              X05373001
               ATTRB=(ASKIP,NORM)                                       05373101
*                                                                       05373201
AVNME13 DFHMDF POS=(16,58),                                            X05373301
               COLOR=BLUE,                                             X05373401
               LENGTH=20,                                              X05373501
               ATTRB=(ASKIP,BRT)                                        05373601
*********************************************************************** 05373701
ASEL14  DFHMDF POS=(17,02),                                            X05373801
               LENGTH=01,                                              X05373901
               ATTRB=UNPROT,                                           X05374001
               HILIGHT=UNDERLINE,                                      X05374101
               PICOUT='X'                                               05374201
        DFHMDF POS=(17,04),                                            X05374301
               LENGTH=01,                                              X05374401
               ATTRB=(ASKIP,BRT)                                        05374501
*                                                                       05374601
AACT14  DFHMDF POS=(17,06),                                            X05374702
               LENGTH=03,                                              X05374801
               ATTRB=(ASKIP,BRT)                                        05374901
*                                                                       05375001
ASCAC14 DFHMDF POS=(17,10),                                            X05375101
               COLOR=BLUE,                                             X05375201
               LENGTH=04,                                              X05375301
               ATTRB=(ASKIP,BRT)                                        05375401
*                                                                       05375501
ASNBR14 DFHMDF POS=(17,16),                                            X05375601
               COLOR=BLUE,                                             X05375701
               LENGTH=18,                                              X05375801
               ATTRB=(ASKIP,BRT)                                        05375901
*                                                                       05376001
ASDTE14 DFHMDF POS=(17,36),                                            X05376101
               LENGTH=10,                                              X05376201
               COLOR=BLUE,                                             X05376301
               ATTRB=(ASKIP,BRT)                                        05376401
*                                                                       05376501
APO14   DFHMDF POS=(17,48),                                            X05376601
               COLOR=BLUE,                                             X05376701
               LENGTH=08,                                              X05376801
               ATTRB=(ASKIP,NORM)                                       05376901
*                                                                       05377001
AVNME14 DFHMDF POS=(17,58),                                            X05377101
               COLOR=BLUE,                                             X05377201
               LENGTH=20,                                              X05377301
               ATTRB=(ASKIP,BRT)                                        05377401
*********************************************************************** 05377501
ASEL15  DFHMDF POS=(18,02),                                            X05377601
               LENGTH=01,                                              X05377701
               ATTRB=UNPROT,                                           X05377801
               HILIGHT=UNDERLINE,                                      X05377901
               PICOUT='X'                                               05378001
        DFHMDF POS=(18,04),                                            X05378101
               LENGTH=01,                                              X05378201
               ATTRB=(ASKIP,BRT)                                        05378301
*                                                                       05378401
AACT15  DFHMDF POS=(18,06),                                            X05378502
               LENGTH=03,                                              X05378601
               ATTRB=(ASKIP,BRT)                                        05378701
*                                                                       05378801
ASCAC15 DFHMDF POS=(18,10),                                            X05378901
               COLOR=BLUE,                                             X05379001
               LENGTH=04,                                              X05379101
               ATTRB=(ASKIP,BRT)                                        05379201
*                                                                       05379301
ASNBR15 DFHMDF POS=(18,16),                                            X05379401
               COLOR=BLUE,                                             X05379501
               LENGTH=18,                                              X05379601
               ATTRB=(ASKIP,BRT)                                        05379701
*                                                                       05379801
ASDTE15 DFHMDF POS=(18,36),                                            X05379901
               LENGTH=10,                                              X05380001
               COLOR=BLUE,                                             X05380101
               ATTRB=(ASKIP,BRT)                                        05380201
*                                                                       05380301
APO15   DFHMDF POS=(18,48),                                            X05380401
               COLOR=BLUE,                                             X05380501
               LENGTH=08,                                              X05380601
               ATTRB=(ASKIP,NORM)                                       05380701
*                                                                       05380801
AVNME15 DFHMDF POS=(18,58),                                            X05380901
               COLOR=BLUE,                                             X05381001
               LENGTH=20,                                              X05381101
               ATTRB=(ASKIP,BRT)                                        05381201
*********************************************************************** 05381300
        DFHMDF POS=(19,45),                                            X05381400
               LENGTH=25,                                              X05381500
               ATTRB=(ASKIP,BRT),                                      X05381600
               INITIAL='NUMBER OF SELECTED ITEMS:'                      05381700
*                                                                       05381800
ATOTSEL DFHMDF POS=(19,72),                                            X05381900
               ATTRB=(ASKIP,BRT),                                      X05382000
               LENGTH=05,                                              X05382100
               PICOUT='99999'                                           05382200
*                                                                       05383000
*********************************************************************** 06500000
        DFHMSD TYPE=FINAL                                               06510000
        PRINT NOGEN                                                     06520000
        END                                                             06530000
