000001******************************************************************        
000002*                         VLRD039                                *        
000003*                                                                *        
000004*   THIS LAYOUT IS FOR THE AP INTERFACE FILE FOR COMPLIANCE      *        
000005*       MANAGEMENT SYSTEM CHARGES AND CREDITS                    *        
000006*                                                                *        
000007*   LENGTH: 650 BYTES                                            *        
000008******************************************************************        
000009 01  VL039-AP-INTERFACE-RECORD.                                           
000010     05  VL039-KEY-FIELDS.                                                
000011         10  VL039-KEY-DATA-FIELDS.                                       
000012             15  VL039-VND-NBR         PIC X(9).                          
000013             15  VL039-DOC-NBR         PIC X(16).                         
000014             15  VL039-DOC-DTE         PIC X(10).                         
000015             15  FILLER REDEFINES VL039-DOC-DTE.                          
000016                 20  VL039-DOC-CC      PIC X(2).                          
000017                 20  VL039-DOC-YY      PIC X(2).                          
000018                 20  FILLER            PIC X(1).                          
000019                 20  VL039-DOC-MM      PIC X(2).                          
000020                 20  FILLER            PIC X(1).                          
000021                 20  VL039-DOC-DD      PIC X(2).                          
000022             15  VL039-AP-TRN-CDE      PIC X(2).                          
000023                 88  VL039-CHARGE-6A       VALUE '6A'.                    
000024                 88  VL039-CREDIT-6B       VALUE '6B'.                    
000025         10  VL039-RECD-TYP-CDE        PIC X(1).                          
000026             88  VL039-HEADER-RECORD       VALUE '1'.                     
000027             88  VL039-DETAIL-RECORD       VALUE '2'.                     
000028             88  VL039-CONTROL-RECORD      VALUE '9'.                     
000029     05  VL039-COMMON-FIELDS.                                             
000030         10  VL039-PO-NBR              PIC X(9).                          
000031         10  VL039-DEPT-NBR            PIC X(3).                          
000032         10  VL039-GL-ACCT-NBR         PIC X(6).                          
000033         10  VL039-PSTG-TYP-CDE        PIC X(2).                          
000034             88  VL039-CREDIT              VALUE 'CR'.                    
000035             88  VL039-CHARGE              VALUE 'CH'.                    
000036         10  VL039-TRN-TYP-CDE         PIC X(3).                          
000037             88  VL039-MERCHANDISE         VALUE 'MDS'.                   
000038             88  VL039-EXPENSE             VALUE 'EXP'.                   
000039         10  VL039-ENTR-TMST.                                             
000040             15  VL039-ENTR-DTE        PIC X(10).                         
000041             15  VL039-ENTR-TME        PIC X(16).                         
000042         10  VL039-ENTR-ID             PIC X(8).                          
000043         10  VL039-ORGN-CDE            PIC X(1).                          
000044             88  VL039-ORGN-VALID          VALUE 'M'                      
000045                                                 'C'                      
000046                                                 'I'                      
000047                                                 'A'                      
000048                                                 'F'.                     
000049             88  VL039-ORGN-MDSE           VALUE 'M'.                     
000050             88  VL039-ORGN-CAPEX          VALUE 'C'.                     
000051             88  VL039-ORGN-IMPORT         VALUE 'I'.                     
000052             88  VL039-ORGN-ADJUST         VALUE 'A'.                     
000053             88  VL039-ORGN-FREIGHT        VALUE 'F'.                     
000054         10  VL039-INV-CUTOFF-DTE      PIC X(10).                         
000055         10  FILLER REDEFINES VL039-INV-CUTOFF-DTE.                       
000056             15  VL039-INV-CUTOFF-CC   PIC X(2).                          
000057             15  VL039-INV-CUTOFF-YY   PIC X(2).                          
000058             15  FILLER                PIC X(1).                          
000059             15  VL039-INV-CUTOFF-MM   PIC X(2).                          
000060             15  FILLER                PIC X(1).                          
000061             15  VL039-INV-CUTOFF-DD   PIC X(2).                          
000062         10  VL039-BAR-CDE             PIC X(9).                          
000063         10  VL039-PS-BTCH-NBR.                                           
000064             15  VL039-PS-BTCH-DTE     PIC X(10).                         
000065             15  VL039-PS-BTCH-SRC-CDE PIC X(3).                          
000066             15  VL039-PS-BTCH-SEQ-NBR PIC X(2).                          
000067         10  VL039-ENT-ID              PIC 9(9).                          
000068         10  VL039-ENT-NME-DESC        PIC X(30).                         
000069         10  VL039-RSN-TXT.                                               
000070             15  VL039-RSN-1ST-LNE-TXT PIC X(50).                         
000071             15  VL039-RSN-2ND-LNE-TXT PIC X(50).                         
000072         10  VL039-TERM-DISC-PCT       PIC S9V9999  COMP-3.               
000073         10  VL039-NW-STR-DISC-PCT     PIC S9V9999  COMP-3.               
000074         10  VL039-TRD-DISC-PCT        PIC S9V9999  COMP-3.               
000075         10  VL039-PSTG-FYR-NBR        PIC X(4).                          
000076         10  VL039-PSTG-FMN-NBR        PIC X(2).                          
000077         10  VL039-PSTG-FWK-NBR        PIC X(2).                          
000078         10  VL039-MOS-DISC-PCT        PIC S9V9999  COMP-3.               
000079         10  VL039-ADV-DISC-PCT        PIC S9V9999  COMP-3.               
000080         10  FILLER                    PIC X(03).                         
000081     05  VL039-HEADER-FIELDS.                                             
000082         10  VL039-HDR-STR-NBR         PIC 9(5).                          
000083         10  VL039-TOT-GRO-COST-AMT    PIC S9(9)V99 COMP-3.               
000084         10  VL039-TOT-RETL-AMT        PIC S9(9)V99 COMP-3.               
000085         10  VL039-TOT-FRGT-AMT        PIC S9(9)V99 COMP-3.               
000086         10  VL039-TOT-MISC-CHRG-AMT   PIC S9(9)V99 COMP-3.               
000087         10  VL039-TOT-NET-COST-AMT    PIC S9(9)V99 COMP-3.               
000088         10  VL039-TOT-TERM-DISC-AMT   PIC S9(9)V99 COMP-3.               
000089         10  VL039-TOT-NW-STR-DISC-AMT PIC S9(9)V99 COMP-3.               
000090         10  VL039-TOT-TRD-DISC-AMT    PIC S9(9)V99 COMP-3.               
000091         10  VL039-TOT-MOS-DISC-AMT    PIC S9(9)V99 COMP-3.               
000092         10  VL039-TOT-ADV-DISC-AMT    PIC S9(9)V99 COMP-3.               
000093         10  FILLER                    PIC X(07).                         
000094     05  VL039-DETAIL-FIELDS REDEFINES                                    
000095         VL039-HEADER-FIELDS.                                             
000096         10  VL039-STR-NBR             PIC 9(5).                          
000097         10  VL039-CL-NBR              PIC X(2).                          
000098         10  FILLER                    PIC X(3).                          
000099         10  VL039-GRO-COST-AMT        PIC S9(7)V99 COMP-3.               
000100         10  VL039-RETL-AMT            PIC S9(7)V99 COMP-3.               
000101         10  VL039-FRGT-AMT            PIC S9(7)V99 COMP-3.               
000102         10  VL039-MISC-CHRG-AMT       PIC S9(7)V99 COMP-3.               
000103         10  VL039-NET-COST-AMT        PIC S9(7)V99 COMP-3.               
000104         10  VL039-DTL-TERM-DISC-AMT   PIC S9(7)V99 COMP-3.               
000105         10  VL039-DTL-NW-STR-DISC-AMT PIC S9(7)V99 COMP-3.               
000106         10  VL039-DTL-TRD-DISC-AMT    PIC S9(7)V99 COMP-3.               
000107         10  VL039-DTL-MOS-DISC-AMT    PIC S9(7)V99 COMP-3.               
000108         10  VL039-SKU-NBR             PIC 9(8).                          
000109         10  FILLER                    PIC X(9).                          
000110     05  VL039-CONTROL-FIELDS REDEFINES                                   
000111         VL039-HEADER-FIELDS.                                             
000112         10  VL039-CTL-RECORD-COUNT    PIC S9(11)    COMP-3.              
000113         10  VL039-CTL-GRO-COST-AMT    PIC S9(11)V99 COMP-3.              
000114         10  VL039-CTL-RETL-AMT        PIC S9(11)V99 COMP-3.              
000115         10  VL039-CTL-FRGT-AMT        PIC S9(11)V99 COMP-3.              
000116         10  VL039-CTL-MISC-CHRG-AMT   PIC S9(11)V99 COMP-3.              
000117         10  VL039-CTL-NET-COST-AMT    PIC S9(11)V99 COMP-3.              
000118         10  VL039-CTL-TERM-DISC-AMT   PIC S9(11)V99 COMP-3.              
000119         10  VL039-CTL-NW-STR-DISC-AMT PIC S9(11)V99 COMP-3.              
000120         10  VL039-CTL-TRD-DISC-AMT    PIC S9(11)V99 COMP-3.              
000121         10  VL039-CTL-MOS-DISC-AMT    PIC S9(11)V99 COMP-3.              
000122         10  FILLER                    PIC X(03).                         
000123     05  VL039-PYMT-DUE-DTE            PIC X(10).                         
000124     05  FILLER REDEFINES VL039-PYMT-DUE-DTE.                             
000125         10  VL039-PYMT-DUE-CC         PIC X(2).                          
000126         10  VL039-PYMT-DUE-YY         PIC X(2).                          
000127         10  FILLER                    PIC X(1).                          
000128         10  VL039-PYMT-DUE-MM         PIC X(2).                          
000129         10  FILLER                    PIC X(1).                          
000130         10  VL039-PYMT-DUE-DD         PIC X(2).                          
000131     05  FILLER                        PIC X(1).                          
000132     05  VL039-AUTH-NBR                PIC X(10).                         
000133     05  VL039-AUTO-OTP-PSTG-IND       PIC X(1).                          
000134     05  VL039-AP-PSTG-IND             PIC X(1).                          
000135         88  VL039-POST-TO-PS-AP             VALUE 'Y'.                   
000136         88  VL039-DO-NOT-POST-TO-PS-AP      VALUE 'N'.                   
000137     05  VL039-SALES-TAX-AMT           PIC S9(9)V99 COMP-3.               
000138     05  VL039-DOC-HLD-CDE             PIC X(1).                          
000139         88  VL039-VND-HLD                   VALUE 'V'.                   
000140         88  VL039-DOC-HLD                   VALUE 'D'.                   
000141         88  VL039-NOT-ON-HLD                VALUE 'N'.                   
000142     05  FILLER                        PIC X(103).                        
000143     05  VL039-UNPACK-FIELDS.                                             
000144         10  VL039-GRO-COST-AMT-UNP-SIGN     PIC X(01).                   
000145         10  VL039-GRO-COST-AMT-UNP          PIC 9(07)V99.                
000146         10  VL039-NET-COST-AMT-UNP-SIGN     PIC X(01).                   
000147         10  VL039-NET-COST-AMT-UNP          PIC 9(07)V99.                
000148         10  VL039-CTL-RECORD-COUNT-UNP      PIC 9(11).                   
000149         10  VL039-CTL-GRO-COST-AMT-UNPSIGN  PIC X(01).                   
000150         10  VL039-CTL-GRO-COST-AMT-UNP      PIC 9(11)V99.                
000151         10  VL039-CTL-NET-COST-AMT-UNPSIGN  PIC X(01).                   
000152         10  VL039-CTL-NET-COST-AMT-UNP      PIC 9(11)V99.                
000153         10  VL039-REVERSAL-SEQ              PIC 9(04).                   
000154         10  FILLER                          PIC X(86).                   
000154         10  VL039-CRLF                      PIC X(01).                   
