000100******************************************************************00010001
000100*CHG0139557 - START                                               00011006
000200*                         VLRD067                                *00020005
000200*CHG0139557 - END                                                 00021006
000300*                                                                *00030001
000400*   RECORD LAYOUT FOR THE FILE PKMO.VL.CMS.POHDR.THIS FILE IS    *00040002
000500*   MODIFIED FOR THE EXTENDED CANCEL DATE AND WILL HAVE CHANGED  *00050002
000600*   RECORD LENGTH OF 482 BYTES.                                  *00060002
000700*                                                                *00070001
004700*CHG0139557 - START                                               00071006
004700*   TWO NEW FIELDS XFACTORY START AND END DATE IS ADDED TO THE   *00072005
004700*   FILE AND RECORD LENGTH IS CHANGED TO 498.                    *00073005
004700*                                                                *00074005
000800*   LENGTH: 498  BYTES                                           *00080004
004800*CHG0139557 - START                                               00081006
000900******************************************************************00090001
001000 01  VL067-CMS-POHDR-RECORD.                                      00100001
001100     05  VL067-ACD-IND                      PIC X(01).            00110001
001200     05  VL067-PO-NBR                       PIC X(20).            00120001
001300     05  VL067-MASTER-PO-NBR                PIC X(20).            00130001
001400     05  VL067-DEPT-NBR                     PIC X(10).            00140001
001500     05  VL067-VENDOR-NBR                   PIC X(10).            00150001
001600     05  VL067-SHIP-START-DATE              PIC X(08).            00160001
001700     05  VL067-SHIP-STOP-DATE               PIC X(08).            00170001
001800     05  VL067-PO-CREATE-DATE               PIC X(08).            00180001
001900     05  VL067-PO-APPROVAL-DATE             PIC X(08).            00190001
002000     05  VL067-CANCEL-DATE                  PIC X(08).            00200001
002100     05  VL067-OTB-DATE                     PIC X(08).            00210001
002200     05  VL067-XREF-PO-NBR                  PIC X(20).            00220001
002300     05  VL067-ORDER-TYPE                   PIC X(30).            00230001
002400     05  VL067-PACK-BY-STORE                PIC X(01).            00240001
002500     05  VL067-EDI-SENT-DATE                PIC X(08).            00250001
002600     05  VL067-NEW-STORE                    PIC X(01).            00260001
002700     05  VL067-ADVERT-DATE                  PIC X(08).            00270001
002800     05  VL067-FOB                          PIC X(50).            00280001
002900     05  VL067-SHIP-TO-NUMBER               PIC X(10).            00290001
003000     05  VL067-ORDER-STATUS                 PIC X(20).            00300001
003100     05  VL067-DIST-METHOD                  PIC X(10).            00310001
003200     05  VL067-BILL-TYPE                    PIC X(01).            00320001
003300     05  VL067-REPL-FLAG                    PIC X(01).            00330001
003400     05  VL067-SPL-ORDER-IND                PIC X(01).            00340001
003500     05  VL067-TOTAL-UNIT-SIGN              PIC X(01).            00350001
003600     05  VL067-TOTAL-UNITS                  PIC X(13).            00360001
003700     05  VL067-BUYER-NUMBER                 PIC X(10).            00370001
003800     05  VL067-ORIG-ORDER-QTY-SIGN          PIC X(01).            00380001
003900     05  VL067-ORIG-ORDER-QTY               PIC X(13).            00390001
004000     05  VL067-AD-EVENT                     PIC X(03).            00400001
004100     05  VL067-SECOND-EVENT                 PIC X(03).            00410001
004200     05  VL067-TERMS                        PIC X(50).            00420001
004300     05  VL067-PO-RELEASE-DATE              PIC X(08).            00430001
004400     05  VL067-PARENT-COMPANY               PIC X(50).            00440001
004500     05  VL067-FACTORY                      PIC X(50).            00450001
004600     05  VL067-DIRECT-STORE-IND             PIC X(01).            00460001
004700     05  VL067-XTEND-CANCEL-DATE            PIC X(08).            00470001
004600*CHG0139557 - START                                               00471006
004600     05  VL067-XFACT-START-DATE             PIC X(08).            00472003
004600     05  VL067-XFACT-END-DATE               PIC X(08).            00473003
004600*CHG0139557 - END                                                 00474006
004800     05  VL067-ANCHOR-CONSTANT              PIC X(01).            00480001
