000100******************************************************************        
000200*                         VLRD048                                *        
000300*                                                                *        
000400*   THIS LAYOUT IS FOR THE FREIGHT COMPLIANCE CHARGEBACK EXTRACT *        
000500*             OUTPUT FREIGHT AUDIT ERROR SPREDSHEET FILE         *        
000600*        FOR THE RETAIL COMPLIANCE MANAGEMENT SYSTEM (RCMS)      *        
000700*                                                                *        
000800*   LENGTH: 4104 BYTES                                           *        
000900******************************************************************        
001000 01  VL048-FRGT-AUDTERR-RECORD.                                           
001100     05  VL048-DATA-FIELDS.                                               
001200         10  VL048-ERROR-MSG                 PIC X(19).                   
001300         10  VL048-COMM-1                    PIC X(01).                   
001300         10  VL048-INPUT-FIELDS.                                          
001310             15  VL048-INPUT-REC             PIC X(4069).                 
001320             15  VL048-EXTRA-SPACE           PIC X(15).                   
001300         10  VL048-OUTPUT-FIELDS REDEFINES VL048-INPUT-FIELDS.            
001310             15  VL048-RULE-NBR              PIC X(05).                   
001320             15  VL048-COMM-2                PIC X(01).                   
001400             15  VL048-RULE-DESC             PIC X(100).                  
001500             15  VL048-COMM-3                PIC X(01).                   
001600             15  VL048-FREIGHT-CHRG          PIC X(12).                   
001700             15  VL048-COMM-4                PIC X(01).                   
001800             15  VL048-PO-NBR-X.                                          
001800                 20  VL048-PO-NBR            PIC 9(08).                   
001900             15  VL048-COMM-5                PIC X(01).                   
002000             15  VL048-CARRIER-AUTH-NBR      PIC X(10).                   
002100             15  VL048-COMM-6                PIC X(01).                   
002200             15  VL048-DELIVERY-ORDER-NBR    PIC X(10).                   
002300             15  VL048-COMM-7                PIC X(01).                   
002400             15  VL048-DC-X.                                              
002400                 20  VL048-DC                PIC 9(04).                   
002500             15  VL048-COMM-8                PIC X(01).                   
002600             15  VL048-FAX-AUTH-NBR          PIC X(20).                   
002700             15  VL048-COMM-9                PIC X(01).                   
002800             15  VL048-SCAC                  PIC X(04).                   
002900             15  VL048-COMM-10               PIC X(01).                   
003000             15  VL048-FREIGHT-BILL          PIC X(10).                   
003100             15  VL048-COMM-11               PIC X(01).                   
003200             15  VL048-PRO-NBR               PIC X(10).                   
003300             15  VL048-COMM-12               PIC X(01).                   
003400             15  VL048-INVOICE-NBR           PIC X(10).                   
003500             15  VL048-COMM-13               PIC X(01).                   
003600             15  VL048-CARTON-CNT-X.                                      
003600                 20  VL048-CARTON-CNT        PIC 9(10).                   
003700             15  VL048-COMM-14               PIC X(01).                   
003800             15  VL048-WEIGHT-X.                                          
003800                 20  VL048-WEIGHT            PIC 9(10).                   
003900             15  VL048-COMM-15               PIC X(01).                   
004000             15  VL048-CUBES-X.                                           
004000                 20  VL048-CUBES             PIC 9(10).                   
004100             15  VL048-COMM-16               PIC X(01).                   
004200             15  VL048-COMMENTS              PIC X(3836).                 
004500     05  VL048-TOTAL-FIELDS REDEFINES VL048-DATA-FIELDS.                  
004600         10  VL048-TOT-LEGEND                PIC X(19).                   
004100         10  VL048-COMM-17                   PIC X(01).                   
004700         10  VL048-TOT-COUNT                 PIC X(12).                   
004100         10  VL048-COMM-18                   PIC X(01).                   
004800         10  VL048-TOT-AMOUNT                PIC X(16).                   
004100         10  VL048-COMM-19                   PIC X(01).                   
004900         10  FILLER                          PIC X(4054).                 
