000001******************************************************************        
000002*    COPY MEMBER:  VLRD038                       LRECL = 50      *        
000003*                                                                *        
000004*    THIS MEMBER IS USED AS THE FEEDER FILE LAYOUT FOR THE       *        
000005*    COMPLIANCE MANAGEMENT SYSTEM RECEIVER DETAIL FILE.          *        
000006*                                                                *        
000007******************************************************************        
000008 01  VL038-RECEIVER-FEEDER-RECORD.                                        
000009     05  VL038-PO-NBR               PIC  9(08)    VALUE ZEROS.            
000017     05  VL038-REC-SEQ-NBR          PIC  9(09)    VALUE ZEROS.            
000019     05  FILLER                     PIC  X(33)    VALUE SPACES.           
