000001******************************************************************10/18/95
000002*                         VLRD034                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE COMPLIANCE MANAGEMENT SYSTEM MERCHANT *RVWS010 
000005*       EXTRACT FILE                                             *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH:  92 BYTES                                            *RVWS010 
000008******************************************************************RVWS010 
000009 01  VL034-MERCHANT-RECORD.                                               
000010     05  VL034-ACD-INDICATOR                 PIC  X(01).                  
000011     05  VL034-MERCHANT-NUMBER               PIC  X(10).                  
000012     05  VL034-MERCHANT-NAME                 PIC  X(30).                  
000013     05  VL034-MERCHANT-DESIGNATOR           PIC  X(10).                  
000014     05  VL034-BUYER-NUMBER                  PIC  X(10).                  
000015     05  VL034-REPORT-TO-NUM                 PIC  X(10).                  
000016     05  VL034-REPORT-TO-DESIGNATOR          PIC  X(10).                  
000017     05  VL034-DEPARTMENT                    PIC  X(10).                  
000018     05  VL034-ANCHOR-CONSTANT               PIC  X(01).                  
