000001******************************************************************        
000002*    COPY MEMBER:  VLRD036                       LRECL = 239     *        
000003*                                                                *        
000004*    THIS MEMBER IS USED AS THE FILE LAYOUT FOR THE              *        
000005*    COMPLIANCE MANAGEMENT SYSTEM RECEIVER DETAIL FILE.          *        
000006*                                                                *        
000007******************************************************************        
000008 01  VL036-RECEIVER-DETAIL-RECORD.                                        
000009     05  VL036-ACD-INDICATOR        PIC  X(01).                           
000010         88  VL036-ACD-ADD                        VALUE 'A'.              
000017     05  VL036-RECEIVER-NBR         PIC  X(20)    VALUE SPACES.           
000018     05  VL036-PO-NBR               PIC  X(20)    VALUE SPACES.           
000019     05  VL036-UNIQUE-ADDENDA       PIC  X(20)    VALUE SPACES.           
000020     05  VL036-SKU                  PIC  X(10)    VALUE SPACES.           
000021     05  VL036-UPC                  PIC  X(15)    VALUE SPACES.           
000022     05  VL036-LINE-NBR             PIC  X(10)    VALUE SPACES.           
000061     05  VL036-ITEM-COST-SIGN       PIC  X(01)    VALUE SPACES.           
000070     05  VL036-ITEM-COST            PIC  9(09)V9(04) VALUE ZERO.          
000071     05  VL036-ITEM-RETAIL-SIGN     PIC  X(01)    VALUE SPACES.           
000072     05  VL036-ITEM-RETAIL          PIC  9(09)V9(04) VALUE ZERO.          
000080     05  VL036-STORE-NBR            PIC  X(10)    VALUE SPACES.           
000400     05  VL036-STORE-COST-SIGN      PIC  X(01)    VALUE SPACES.           
000500     05  VL036-STORE-COST           PIC  9(13)    VALUE ZERO.             
000600     05  VL036-STORE-RETAIL-SIGN    PIC  X(01)    VALUE SPACES.           
000700     05  VL036-STORE-RETAIL         PIC  9(13)    VALUE ZERO.             
000710     05  VL036-STORE-RCV-UNITS-SIGN PIC  X(01)    VALUE SPACES.           
000720     05  VL036-STORE-RCV-UNITS      PIC  9(13)    VALUE ZERO.             
000900     05  VL036-RCV-CREATE-DATE.                                           
001000         10  VL036-RCV-CREATE-CC    PIC  X(02).                           
001010         10  VL036-RCV-CREATE-YY    PIC  X(02).                           
001100         10  VL036-RCV-CREATE-MM    PIC  X(02).                           
001200         10  VL036-RCV-CREATE-DD    PIC  X(02).                           
001210     05  VL036-CASE-PACK-SIGN       PIC  X(01)    VALUE SPACES.           
001220     05  VL036-CASE-PACK            PIC  9(13)    VALUE ZERO.             
001230     05  VL036-DETAIL-STATUS        PIC  X(20)    VALUE SPACES.           
001610     05  VL036-PO-UNIQUE-ADDENDA    PIC  X(20)    VALUE SPACES.           
003100     05  VL036-ANCHOR-CONSTANT      PIC  X(01)    VALUE SPACES.           
