000100******************************************************************        
000200* VLRD068 - RECORD LENGTH 206                                    *        
000300******************************************************************        
000510*  RECORD LAYOUT FOR MONTHLY CN AUDIT FAILURE ANALYSIS EXTRACT            
000600******************************************************************        
000700 01  VL068-RECORD.                                                        
000810     05  VL068-WEEK-END-DATE             PIC X(06).                       
000900     05  VL068-WEEK-END-DATE-R REDEFINES VL068-WEEK-END-DATE.             
001000         10  VL068-DATE-CCYY             PIC 9(04).                       
001200         10  VL068-DATE-MM               PIC 9(02).                       
001900     05  VL068-VENDOR-ID                 PIC X(10)  VALUE SPACE.          
001902     05  VL068-PO-NBR                    PIC 9(09)  VALUE ZERO.           
001903     05  FILLER                          PIC X(11)  VALUE SPACE.          
001904     05  VL068-DEPT-NBR                  PIC X(10)  VALUE SPACE.          
001906     05  VL068-RCVR-SEQ-NBR              PIC X(10)  VALUE SPACE.          
001908     05  VL068-PO-TYP-CDE                PIC X(02)  VALUE SPACE.          
001909     05  FILLER                          PIC X(08)  VALUE SPACE.          
001910     05  VL068-PKGNG-TYPE                PIC X(02)  VALUE SPACE.          
001920         88  VL068-BULK-CASE                        VALUE 'BC'.           
001930         88  VL068-PREPACK                          VALUE 'PP'.           
001940         88  VL068-PBS                              VALUE 'PS'.           
001940         88  VL068-RFID                             VALUE 'RF'.           
001950     05  FILLER                          PIC X(08)  VALUE SPACE.          
002100     05  VL068-VENDOR-AUDIT-RANK         PIC X(06)  VALUE SPACE.          
002101     05  FILLER                          PIC X(04)  VALUE SPACE.          
002102     05  VL068-AUD-CNTL-NBR              PIC 9(13)  VALUE ZERO.           
003510     05  VL068-CRTNS-AUDITED             PIC 9(13)  VALUE ZERO.           
003610     05  VL068-CRTNS-W-PICK-ERR          PIC 9(13)  VALUE ZERO.           
003710     05  VL068-UNITS-AUDITED             PIC 9(13)  VALUE ZERO.           
003900     05  VL068-UNITS-PICK-ERR            PIC 9(13)  VALUE ZERO.           
003920     05  VL068-UNITS-PACK-ERR            PIC 9(13)  VALUE ZERO.           
004010     05  VL068-PACKS-AUDITED             PIC 9(13)  VALUE ZERO.           
004110     05  VL068-PACKS-W-PACK-ERR          PIC 9(13)  VALUE ZERO.           
004300     05  VL068-FAILURE-ERROR-SW          PIC X(01)  VALUE SPACE.          
004400         88  VL068-FAILURE-ERROR-YES                 VALUE 'Y'.           
004500         88  VL068-FAILURE-ERROR-NO                  VALUE 'N'.           
004700     05  VL068-AUD-STAT-CDE              PIC X(01)  VALUE SPACE.          
004800         88  VL068-COMPLETE                          VALUE 'P',           
004810                                                           'F'.           
004900         88  VL068-PASS                              VALUE 'P'.           
005000         88  VL068-FAIL                              VALUE 'F'.           
005100         88  VL068-NOT-NEED                          VALUE 'N'.           
005200         88  VL068-IN-PROCESS                        VALUE 'I'.           
005210     05  VL068-UNITS-TICK-ERR            PIC 9(13)  VALUE ZERO.           
005300     05  VL068-ANCHOR-CONSTANT           PIC X(01)  VALUE  'X'.           
