000001******************************************************************        
000002*                         VLRD047                                *        
000003*                                                                *        
000004*   THIS LAYOUT IS FOR THE COMPLIANCE MANAGEMENT SYSTEM AUDIT    *        
000005*       LOADER MARKER FILE                                       *        
000006*   LENGTH: 91  BYTES                                            *        
000007******************************************************************        
000008 01  VL047-MARKER-RECORD.                                                 
000009     05  VL047-FILE-NAME                     PIC  X(50).                  
000010     05  VL047-TRAN-COUNT                    PIC  9(13).                  
000010     05  VL047-TRAN-AMT                      PIC  9(09)V9999.             
000011*****  BUILD DATE YYYYMMDD *****                                          
000012     05  VL047-BUILD-DATE                    PIC  X(08).                  
000013*****  BUILD TIME HHMMSS   *****                                          
000014     05  VL047-BUILD-TIME                    PIC  X(06).                  
000015     05  VL047-ANCHOR-CONSTANT               PIC  X(01).                  
