000001******************************************************************10/18/95
000002*                         VLRD040                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE COMPLIANCE MANAGEMENT SYSTEM ASN      *RVWS010 
000005*       HEADER EXTRACT FILE                                      *RVWS010 
000006*                                                                *RVWS010 
210723*   LENGTH: 243 BYTES                                            *RVWS010 
000007*                                                                *RVWS010 
210723* CHG0210723 EXPANDED COPYBOOK FROM 223 TO 243 TO ACCOMMODATE    *RVWS010 
210723*            NEW FIELD VL040-CARR-AUTH-ID.                       *RVWS010 
000008******************************************************************RVWS010 
000009 01  VL040-ASN-HDR-RECORD.                                                
000010     05  VL040-ACD-INDICATOR                 PIC  X(01).                  
000011     05  VL040-PO-NBR                        PIC  X(20).                  
000012     05  VL040-SEQ-NBR                       PIC  X(30).                  
000012     05  VL040-ENT-ID                        PIC  X(10).                  
000013     05  VL040-RECEIVED-DATE                 PIC  X(15).                  
000013     05  VL040-BOL-NBR                       PIC  X(50).                  
000013     05  VL040-FREIGHT-BILL-NBR              PIC  X(20).                  
000013     05  VL040-SCAC                          PIC  X(04).                  
000013     05  VL040-PICKUP-DATE                   PIC  X(08).                  
000014     05  VL040-CART-CNT-SIGN                 PIC  X(01).                  
000014     05  VL040-CART-CNT                      PIC  9(09)V9999.             
000014     05  VL040-ORIGIN-ZIP-CDE                PIC  X(10).                  
000014     05  VL040-PO-UNIQUE-ADDENDA             PIC  X(20).                  
000014     05  VL040-DESTINATION-NBR               PIC  X(10).                  
000014     05  VL040-DROP-LOC                      PIC  X(10).                  
210723     05  VL040-CARR-AUTH-ID                  PIC  X(20).                  
000015     05  VL040-ANCHOR-CONSTANT               PIC  X(01).                  
