000001******************************************************************10/18/95
000002*                         VLRD030                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE COMPLIANCE MANAGEMENT SYSTEM SITE     *RVWS010 
000005*   (LOCATION) EXTRACT FILE                                      *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH: 311 BYTES                                            *RVWS010 
000008******************************************************************RVWS010 
000009 01  VL030-SITE-RECORD.                                                   
000010     05  VL030-ACD-INDICATOR                 PIC  X(01).                  
000011     05  VL030-LOCATION-NBR                  PIC  X(10).                  
000012     05  VL030-LOCATION-NAME                 PIC  X(30).                  
000014     05  VL030-ADDRESS-LINE-1                PIC  X(40).                  
000014     05  VL030-ADDRESS-LINE-2                PIC  X(40).                  
000014     05  VL030-ADDRESS-LINE-3                PIC  X(40).                  
000014     05  VL030-CITY                          PIC  X(30).                  
000014     05  VL030-STATE                         PIC  X(02).                  
000014     05  VL030-ZIP-CODE                      PIC  X(10).                  
000014     05  VL030-PHONE-NBR                     PIC  X(13).                  
000014     05  VL030-FAX-NBR                       PIC  X(13).                  
000014     05  VL030-DISTRICT-NBR                  PIC  X(03).                  
000014     05  VL030-REGION-NBR                    PIC  X(03).                  
000014     05  VL030-COMPANY-NAME                  PIC  X(30).                  
000014     05  VL030-SITE-OPEN-DATE                PIC  X(08).                  
000014     05  VL030-SITE-CLOSE-DATE               PIC  X(08).                  
000014     05  VL030-SITE-SHIP-START-DATE          PIC  X(08).                  
000014     05  VL030-SITE-SHIP-STOP-DATE           PIC  X(08).                  
000016     05  VL030-BUSINESS-UNIT                 PIC  X(03).                  
000016     05  VL030-DROP-LOCATION                 PIC  X(10).                  
000017     05  VL030-ANCHOR-CONSTANT               PIC  X(01).                  
