000001******************************************************************10/18/95
000002*                         VLRD041                                *RVWS010 
000003*                                                                *   LV001
000004*   THIS LAYOUT IS FOR THE COMPLIANCE MANAGEMENT SYSTEM ASN      *RVWS010 
000005*       DETAIL EXTRACT FILE                                      *RVWS010 
000006*                                                                *RVWS010 
000007*   LENGTH: 205 BYTES                                            *RVWS010 
000008******************************************************************RVWS010 
000009 01  VL041-ASN-DTL-RECORD.                                                
000010     05  VL041-ACD-INDICATOR                 PIC  X(01).                  
000011     05  VL041-PO-NBR                        PIC  X(20).                  
000012     05  VL041-SEQ-NBR                       PIC  X(30).                  
000012     05  VL041-ENT-ID                        PIC  X(10).                  
000013     05  VL041-SKU-NBR                       PIC  X(10).                  
000013     05  VL041-UCC128-CART-NBR               PIC  X(30).                  
000013     05  VL041-STORE-NBR                     PIC  X(10).                  
000013     05  VL041-UPC-NBR                       PIC  X(15).                  
000014     05  VL041-CART-QTY-SIGN                 PIC  X(01).                  
000014     05  VL041-CART-QTY                      PIC  9(09)V9999.             
000014     05  VL041-UNIT-COST-SIGN                PIC  X(01).                  
000014     05  VL041-UNIT-COST                     PIC  9(09)V9999.             
000014     05  VL041-UNIT-RTL-SIGN                 PIC  X(01).                  
000014     05  VL041-UNIT-RTL                      PIC  9(09)V9999.             
000014     05  VL041-UNIT-MEASURE                  PIC  X(02).                  
000014     05  VL041-PACK-SIZE-SIGN                PIC  X(01).                  
000014     05  VL041-PACK-SIZE                     PIC  9(09)V9999.             
000014     05  VL041-PO-UNIQUE-ADDENDA             PIC  X(20).                  
000015     05  VL041-ANCHOR-CONSTANT               PIC  X(01).                  
