000100*----------------------------------------------------------------*02/17/93
000200*                         VLWS006                                *DPWS057 
000300*                                                                *   LV007
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE PRETICKET REQUEST *DPWS057 
000500*   PROGRAMS TO PASS THE SELECTED LINE NUMBERS ON THE REQUEST.   *DPWS057 
000600*                                                                *DPWS057 
000700*----------------------------------------------------------------*DPWS057 
000800                                                                  DPWS057 
000900 01  VL006-LINE-SEL-REC.                                             CL**4
001000       05  VL006-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
001100                                                    VALUE ZERO.      CL**2
001200       05  VL006-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
001300       05  VL006-SELECTED-ITEM-ARRAY.                                CL**6
001400           10  FILLER                   OCCURS 20 TIMES              CL**6
001500                                        INDEXED BY VL006-IDX.        CL**2
001600               15  VL006-ITEM           PIC S9(09)  COMP-3.          CL**7
001700               15  VL006-ACTION-SW      PIC  X(01).                  CL**6
001800                   88  VL006-INQ                    VALUE 'I'.       CL**6
001900                   88  VL006-UPD                    VALUE 'U'.       CL**6
002000                   88  VL006-DEL                    VALUE 'D'.       CL**6
002100                   88  VL006-ERR                    VALUE 'E'.       CL**6
002200               15  VL006-KEY-DATA.                                   CL**6
002300                   20  VL006-PO-REQ-NBR                              CL**6
002400                                             PIC S9(09) COMP.        CL**6
002500                   20  VL006-PO-LINE-NBR                             CL**6
002600                                             PIC S9(09) COMP.        CL**6
002601                   20  VL006-PO-NUMBER       PIC S9(09) COMP.        CL**8
002602                   20  VL006-ENT-ID          PIC S9(09) COMP.        CL**8
002603                   20  VL006-DEPT-NBR        PIC  X(03).             CL**8
002604                   20  VL006-VENDOR-NAME     PIC  X(30).             CL**8
002700                   20  VL006-TKT-PLCMNT-CDE  PIC X(4).                  *6
002800                   20  VL006-REQ-RSN-CDE     PIC X(1).                  *6
002801                   20  VL006-REQUEST-DATE    PIC X(10).                 *6
002802                   20  VL006-PRINT-DATE      PIC X(10).                 *6
002803                   20  VL006-VND-DUE-DATE    PIC X(10).                 *6
