000100*----------------------------------------------------------------*02/17/93
000200*                         VLWS003                                *DPWS057 
000300*                                                                *   LV007
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE PRETICKET REQUEST *DPWS057 
000500*   PROGRAMS TO PASS THE SELECTED PRINTED REQUESTS FROM THE      *DPWS057 
000500*   PRINTED REQUEST LIST TO THE SHIPPING MAINTENANCE SCREEN.     *DPWS057 
000600*                                                                *DPWS057 
000700*----------------------------------------------------------------*DPWS057 
000800                                                                  DPWS057 
000900 01  VL003-REQUEST-SEL-REC.                                          CL**4
001000       05  VL003-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
001100                                                    VALUE ZERO.      CL**2
001200       05  VL003-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
001300       05  VL003-SELECTED-ITEM-ARRAY.                                CL**6
001400           10  FILLER                   OCCURS 20 TIMES              CL**6
001500                                        INDEXED BY VL003-IDX.        CL**2
001600               15  VL003-ITEM           PIC S9(09)  COMP-3.          CL**7
001700               15  VL003-ACTION-SW      PIC  X(01).                  CL**6
001800                   88  VL003-INQ                    VALUE 'I'.       CL**6
001900                   88  VL003-UPD                    VALUE 'U'.       CL**6
002000                   88  VL003-DEL                    VALUE 'D'.       CL**6
002100                   88  VL003-ERR                    VALUE 'E'.       CL**6
002100                   88  VL003-SHP                    VALUE 'S'.       CL**6
002200               15  VL003-KEY-DATA.                                   CL**6
002300                   20  VL003-PO-REQ-NBR                              CL**6
002400                                             PIC S9(09) COMP.        CL**6
002601                   20  VL003-PO-NUMBER       PIC S9(09) COMP.        CL**8
002801                   20  VL003-REQUEST-DATE    PIC X(10).                 *6
002802                   20  VL003-PRINT-DATE      PIC X(10).                 *6
002803                   20  VL003-VND-DUE-DATE    PIC X(10).                 *6
