00001 *----------------------------------------------------------------*02/17/93
00002 *                         DPWS057                                *DPWS057 
00003 *                                                                *   LV007
00004 *   THIS IS TS QUEUE RECORD LAYOUT USED IN THE SHIPPING          *DPWS057 
00005 *   MAINTENANCE PROGRAMS TO PASS THE SHIPMENTS BETWEEN THE LIST  *DPWS057 
00005 *   AND THE UPDATE PROGRAM                                       *DPWS057 
00006 *                                                                *DPWS057 
00007 *----------------------------------------------------------------*DPWS057 
00008                                                                   DPWS057 
00009  01  VL012-SHIPMENT-SEL-REC.                                         CL**4
00010        05  VL012-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
00011                                                     VALUE ZERO.      CL**2
00012        05  VL012-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
00013        05  VL012-SELECTED-ITEM-ARRAY.                                CL**6
00014            10  FILLER                   OCCURS 20 TIMES              CL**6
00015                                         INDEXED BY VL012-IDX.        CL**2
00016                15  VL012-ITEM           PIC S9(09)  COMP-3.          CL**7
00017                15  VL012-ACTION         PIC  X(01).                  CL**6
00018                    88  VL012-INQ                    VALUE 'I'.       CL**6
00019                    88  VL012-UPD                    VALUE 'U'.       CL**6
00020                    88  VL012-DEL                    VALUE 'D'.       CL**6
00021                    88  VL012-ERR                    VALUE 'E'.       CL**6
00022                15  VL012-KEY-DATA.                                   CL**6
00023                    20  VL012-SHIPT-GRP-ID                            CL**6
00024                                     PIC S9(09)  COMP.                CL**6
