000001******************************************************************07/11/95
000002**                        VLWS011                               **VLWS009 
000003**                                                              **   LV001
000004**  THIS IS THE INTER-APPLICATION COMMAREA LAYOUT FROM PRE-TICKET*VLWS009 
000005**  SHIPPING MAINTENANCE CRIT SPEC SCREEN TO THE SHIPPING LIST  **VLWS009 
000006**  SCREEN                                                      **VLWS009 
000007**  LENGTH:   35 BYTES                                          **VLWS009 
000008******************************************************************VLWS009 
000009         10  VL011-INTER-APPL-COMMAREA  REDEFINES                 VLWS009 
000010             INTER-APPL-COMM-AREA.                                VLWS009 
000011             15  FILLER                         PIC X(01).        VLWS009 
000012             15  VL011-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
000013                                                    COMP-3.       DPWS056 
000014             15  VL011-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
000015                                                    COMP-3.          CL**8
000016             15  VL011-SEL-QUEUE-NAME           PIC X(8).            CL**8
000017             15  VL011-DATE-LIMIT               PIC X(10).        VLWS009 
000018             15  VL011-SCAC-CODE                PIC X(04).        VLWS009 
000019             15  VL011-SHIPT-GRP-ID             PIC S9(09) COMP.  VLWS009 
