000100******************************************************************09/22/93
000200*    INTER-APPLICATION COMMUNICATION AREA BETWEEN THE PRETICKET   POWS011 
000300*    SHIPPING MAINTENANCE LIST SCREEN, AND THE ACTUAL MAINTENANCE    LV013
000310*    SCREEN                                                          LV013
000400*    LENGTH = 200 BYTES                                              CL**2
000500******************************************************************POWS011 
000600         10  VL002-INTER-APPL-COMMAREA  REDEFINES                    CL**5
000700                                        INTER-APPL-COMM-AREA.     POWS011 
000800             15  FILLER                         PIC  X(01).          CL**8
000900                                                                          
001000* COUNT FIELDS AND NAME OF THE SELECTION QUEUE (REQEUSTS THAT             
001100* HAVE BEEN SELECTED IN VLKCS506)                                         
002200             15  VL002-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
002300                                                    COMP-3.       DPWS056 
002400             15  VL002-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
002500                                                    COMP-3.          CL**8
002600             15  VL002-SEL-QUEUE-NAME           PIC X(8).            CL**8
002700                                                                          
002800* COUNT FIELDS AND NAME OF THE SHIPMENT QUEUE (QUEUE THAT HAS             
002801* THE SHIPPING INFORMATION NEEDED FOR VLKCS507)                           
002802             15  VL002-NUMBER-OF-SHIP-RECS      PIC S9(09)           CL**2
002803                                                    COMP-3.       DPWS056 
002804             15  VL002-NUMBER-OF-SHIP-TS-ITEMS  PIC S9(05)           CL**8
002805                                                    COMP-3.          CL**8
002806             15  VL002-SHIP-QUEUE-NAME          PIC X(8).            CL**8
002807                                                                          
002808* COUNT FIELDS AND NAME OF THE COMMENT QUEUE (QUEUE THAT HAS              
002809* THE COMMENTS LINES NEEDED FOR VLKCS507)                                 
002810             15  VL002-NUMBER-OF-COMM-RECS      PIC S9(09)           CL**2
002811                                                    COMP-3.       DPWS056 
002812             15  VL002-NUMBER-OF-COMM-TS-ITEMS                          *8
002813                                                PIC S9(05)           CL**8
002814                                                    COMP-3.          CL**8
002815             15  VL002-COMMENT-QUEUE-NAME       PIC X(8).            CL**8
002816                                                                          
002817* FIELDS COMMON TO ALL REQUESTS SELECTED IN VLKCS506                      
002818             15  VL002-ADDR-SEQ-NBR             PIC S9(04)           CL**8
002819                                                    COMP-3.          CL**8
002820             15  VL002-ENT-ID                   PIC S9(09) COMP.     CL**8
002830             15  VL002-VENDOR-NAME              PIC  X(30).          CL**8
