000100*----------------------------------------------------------------*02/17/93
000200*                         VLWS008                                *DPWS057 
000300*                                                                *   LV007
000400*   THIS IS TS QUEUE RECORD LAYOUT USED IN THE PRETICKET REQUEST *DPWS057 
000500*   SYSTEM.  THIS IS THE LAYOUT OF THE RESUBMIT REASON CODE TEMP *DPWS057 
000600*   STORAGE QUEUE.  THIS QUEUE WILL BE CREATED IN POKCS088, AND  *DPWS057 
000610*   USED IN POKCS083 TO ASSOCIATE RESUBMIT REASONS TO REQUESTS.  *DPWS057 
000700*----------------------------------------------------------------*DPWS057 
000800                                                                  DPWS057 
000900 01  VL008-REASON-SEL-REC.                                           CL**4
001000       05  VL008-SELECTED-ITEMS         PIC S9(05)  COMP-3           CL**2
001100                                                    VALUE ZERO.      CL**2
001200       05  VL008-MAX-ITEMS              PIC  9(02)  VALUE 20.        CL**2
001300       05  VL008-SELECTED-ITEM-ARRAY.                                CL**6
001400           10  FILLER                   OCCURS 20 TIMES              CL**6
001500                                        INDEXED BY VL008-IDX.        CL**2
001600               15  VL008-ITEM           PIC S9(09)  COMP-3.          CL**7
002200               15  VL008-KEY-DATA.                                   CL**6
002300                   20  VL008-REQ-RSN-CDE     PIC  X(01).             CL**6
