000100******************************************************************09/22/93
000200*    INTER-APPLICATION COMMUNICATION AREA BETWEEN THE APPLICATIONSPOWS011 
000300*    IN THE PRETICKETING SYSTEM.                                     LV013
000400*    LENGTH = 200 BYTES                                              CL**2
000500******************************************************************POWS011 
000600         10  VL005-INTER-APPL-COMMAREA  REDEFINES                    CL**5
000700                                        INTER-APPL-COMM-AREA.     POWS011 
000800             15  FILLER                         PIC  X(01).          CL**8
000900             15  VL005-PO-NUMBER                PIC S9(09) COMP.     CL**8
001000             15  VL005-PO-REQ-NBR               PIC S9(09) COMP.     CL**8
001100             15  VL005-ENT-ID                   PIC S9(09) COMP.     CL**8
001200             15  VL005-DEPT-NBR                 PIC  X(03).          CL**8
001300             15  VL005-VENDOR-NAME              PIC  X(30).          CL**8
001400             15  VL005-SHIP-BY-DATE.                                 CL**8
001500                 20 VL005-SHIP-BY-CC            PIC  X(02).          CL**8
001600                 20 VL005-SHIP-BY-YY            PIC  X(02).          CL**8
001700                 20 FILLER                      PIC  X(01).          CL**8
001800                 20 VL005-SHIP-BY-MM            PIC  X(02).          CL**8
001900                 20 FILLER                      PIC  X(01).          CL**8
002000                 20 VL005-SHIP-BY-DD            PIC  X(02).          CL**8
002100             15  VL005-TIC-PLACE-CDE            PIC X(04).           CL**8
002200             15  VL005-NUMBER-OF-SELECTED-ITEMS PIC S9(09)           CL**2
002300                                                    COMP-3.       DPWS056 
002400             15  VL005-NUMBER-OF-TS-ITEMS       PIC S9(05)           CL**8
002500                                                    COMP-3.          CL**8
002600             15  VL005-SEL-QUEUE-NAME           PIC X(8).            CL**8
002610             15  VL005-TKT-PLCMNT-CDE           PIC X(4).               *6
002611             15  VL005-ACTION-SW                PIC X(01).              *6
002612                   88  VL005-INQ                VALUE 'I'.              *6
002613                   88  VL005-UPD                VALUE 'U'.              *6
002614                   88  VL005-DEL                VALUE 'D'.              *6
002620                   88  VL005-ERR                VALUE 'E'.              *6
002630                   88  VL005-ADD                VALUE 'A'.              *6
002640             15  VL005-PRETKT-REQ-DATE.                              CL**8
002651                 20 VL005-PRETKT-REQ-CC         PIC  X(02).          CL**8
002652                 20 VL005-PRETKT-REQ-YY         PIC  X(02).          CL**8
002653                 20 VL005-PRETKT-REQ-MM         PIC  X(02).          CL**8
002654                 20 VL005-PRETKT-REQ-DD         PIC  X(02).          CL**8
002655             15  VL005-PRETKT-REQ-TYPE          PIC  X(01).          CL**8
002656             15  VL005-PRETKT-REQ-TYPE-DESC     PIC  X(10).          CL**8
002657             15  VL005-PRETKT-REQ-STAT          PIC  X(01).          CL**8
002658             15  VL005-PRETKT-REQ-STAT-DESC     PIC  X(10).          CL**8
002659             15  VL005-REQ-ACTION-TYPE-SW       PIC  X(01).          CL**8
002660                 88  VL005-ADD-NEW-REQ          VALUE 'A'.           CL**8
002661                 88  VL005-RESUBMIT-REQ         VALUE 'R'.           CL**8
002662                 88  VL005-UPDATE-REG           VALUE 'U'.           CL**8
002663                 88  VL005-UPDATE-RESUB         VALUE 'F'.           CL**8
002670             15  VL005-PTRDSC-REQ-RSN-CDE       PIC  X(01).          CL**8
002671             15  VL005-NUMBER-OF-RSN-CODES      PIC S9(09)           CL**2
002672                                                    COMP-3.       DPWS056 
002673             15  VL005-NUMBER-OF-RSN-TS-ITEMS   PIC S9(05)           CL**8
002674                                                    COMP-3.          CL**8
002675             15  VL005-RSN-QUEUE-NAME           PIC X(8).            CL**8
002676             15  VL005-ADDR-SEQ-NBR             PIC S9(04)           CL**8
002677                                                    COMP.            CL**8
002678             15  VL005-TKT-FMT-ID               PIC X(6).            CL**8
002679             15  VL005-TKT-FMT-DESC             PIC X(20).           CL**8
002700             15  FILLER                         PIC X(43).              *5
