*          DATA SET VNKM002    AT LEVEL 019 AS OF 08/14/95                      
*          DATA SET VNKM002    AT LEVEL 006 AS OF 08/12/94              00001*12
  PRINT  NOGEN                                                          00002*12
*******************************************************************-*   00003*12
*                                                                   *   00004*12
*        MAPSET  VNKM002                                            *   00005*12
*        MAP     VN002A                                             *   00006*12
*        PROGRAM VNKCS002                                           *   00007*12
*        TRANSID V002 - DEPARTMENT VENDOR LIST                      *   00008*12
*        SYSTEM  CICS ARCHITECTURE                                  *   00009*12
*                                                                   *   00010*12
*******************************************************************-*   00011*12
VNKM002  DFHMSD TYPE=MAP,                                              X00012*12
               CTRL=(FREEKB),                                          X00013*12
               LANG=COBOL,                                             X00014*12
               MODE=INOUT,                                             X00015*12
               TIOAPFX=YES                                              00016*12
VN002A   DFHMDI SIZE=(19,080),                                         X00017*12
               MAPATTS=(COLOR,HILIGHT),                                X00018*12
               DSATTS=(COLOR,HILIGHT),                                 X00019*12
               LINE=02,                                                X00020*12
               COLUMN=01                                                00021*12
         DFHMDF POS=(02,001),                                          X00022*12
               COLOR=NEUTRAL,                                          X00023*12
               ATTRB=(ASKIP,NORM),                                     X00024*12
               HILIGHT=OFF,                                            X00025*12
               LENGTH=005,                                             X00026*12
               INITIAL='DEPT:'                                          00027*12
ADPTNBR  DFHMDF POS=(02,007),                                          X00028*12
               COLOR=BLUE,                                             X00029*12
               ATTRB=(ASKIP,NORM),                                     X00030*12
               HILIGHT=OFF,                                            X00031*12
               LENGTH=003                                               00032*12
ADPTNAM  DFHMDF POS=(02,011),                                          X00033*12
               COLOR=BLUE,                                             X00034*12
               ATTRB=(ASKIP,NORM),                                     X00035*12
               HILIGHT=OFF,                                            X00036*12
               LENGTH=025                                               00037*12
         DFHMDF POS=(02,044),                                          X00038*12
               COLOR=NEUTRAL,                                          X00039*12
               ATTRB=(ASKIP,NORM),                                     X00040*12
               LENGTH=005,                                             X00041*12
               INITIAL='ITEMS'                                          00042*12
ASTRTIT  DFHMDF POS=(02,050),                                          X00043*12
               COLOR=GREEN,                                            X00044*12
               ATTRB=(UNPROT,NUM,NORM),                                X00045*12
               HILIGHT=UNDERLINE,                                      X00046*12
               LENGTH=007,                                             X00047*12
               PICOUT='ZZZ,ZZ9'                                         00048*12
         DFHMDF POS=(02,058),                                          X00049*12
               COLOR=NEUTRAL,                                          X00050*12
               ATTRB=(ASKIP,NORM),                                     X00051*12
               HILIGHT=OFF,                                            X00052*12
               LENGTH=002,                                             X00053*12
               INITIAL='TO'                                             00054*12
AENDIT   DFHMDF POS=(02,061),                                          X00055*12
               COLOR=BLUE,                                             X00056*12
               ATTRB=(ASKIP,NORM),                                     X00057*12
               HILIGHT=OFF,                                            X00058*12
               LENGTH=007,                                             X00059*12
               PICOUT='ZZZ,ZZ9'                                         00060*12
         DFHMDF POS=(02,069),                                          X00061*12
               COLOR=NEUTRAL,                                          X00062*12
               ATTRB=(ASKIP,NORM),                                     X00063*12
               LENGTH=002,                                             X00064*12
               INITIAL='OF'                                             00065*12
ATOTIT   DFHMDF POS=(02,072),                                          X00066*12
               COLOR=BLUE,                                             X00067*12
               ATTRB=(ASKIP,NORM),                                     X00068*12
               HILIGHT=OFF,                                            X00069*12
               LENGTH=007,                                             X00070*12
               PICOUT='ZZZ,ZZ9'                                         00071*12
         DFHMDF POS=(03,71),                                           X00102*19
               COLOR=NEUTRAL,                                          X00103*12
               ATTRB=(ASKIP,NORM),                                     X00104*12
               LENGTH=03,                                              X00105*12
               INITIAL='UPC'                                            00106*12
         DFHMDF POS=(04,01),                                           X00072*12
               COLOR=NEUTRAL,                                          X00073*12
               ATTRB=(ASKIP,NORM),                                     X00074*12
               LENGTH=03,                                              X00075*12
               INITIAL='SEL'                                            00076*12
         DFHMDF POS=(04,05),                                           X00082*19
               COLOR=NEUTRAL,                                          X00083*12
               ATTRB=(ASKIP,NORM),                                     X00084*12
               LENGTH=01,                                              X00085*12
               INITIAL='T'                                              00086*12
         DFHMDF POS=(04,07),                                           X00087*19
               COLOR=NEUTRAL,                                          X00088*12
               ATTRB=(ASKIP,NORM),                                     X00089*12
               LENGTH=11,                                              X00090*12
               INITIAL='VENDOR NAME'                                    00091*12
         DFHMDF POS=(04,33),                                           X00092*19
               COLOR=NEUTRAL,                                          X00093*12
               ATTRB=(ASKIP,NORM),                                     X00094*12
               LENGTH=07,                                              X00095*12
               INITIAL='VNDR NO'                                        00096*12
         DFHMDF POS=(04,41),                                           X00097*19
               COLOR=NEUTRAL,                                          X00098*12
               ATTRB=(ASKIP,NORM),                                     X00099*12
               LENGTH=04,                                              X00100*12
               INITIAL='INHS'                                           00101*12
         DFHMDF POS=(04,46),                                           X00102*19
               COLOR=NEUTRAL,                                          X00103*12
               ATTRB=(ASKIP,NORM),                                     X00104*12
               LENGTH=13,                                              X00105*12
               INITIAL='PAYMENT TERMS'                                  00106*12
         DFHMDF POS=(04,71),                                           X00102*19
               COLOR=NEUTRAL,                                          X00103*12
               ATTRB=(ASKIP,NORM),                                     X00104*12
               LENGTH=03,                                              X00105*12
               INITIAL='CAT'                                            00106*12
         DFHMDF POS=(04,75),                                           X00107*19
               COLOR=NEUTRAL,                                          X00108*12
               ATTRB=(ASKIP,NORM),                                     X00109*12
               LENGTH=01,                                              X00110*12
               INITIAL='E'                                              00111*12
         DFHMDF POS=(04,77),                                           X00112*19
               COLOR=NEUTRAL,                                          X00113*12
               ATTRB=(ASKIP,NORM),                                     X00114*12
               LENGTH=01,                                              X00115*12
               INITIAL='P'                                              00116*12
         DFHMDF POS=(04,79),                                           X00117*19
               COLOR=NEUTRAL,                                          X00118*19
               ATTRB=(ASKIP,NORM),                                     X00119*19
               LENGTH=01,                                              X00120*19
               INITIAL='S'                                              00121*19
ASEL01   DFHMDF POS=(05,003),                                          X00122*12
               COLOR=GREEN,                                            X00123*12
               ATTRB=(UNPROT,NORM),                                    X00124*12
               HILIGHT=UNDERLINE,                                      X00125*12
               LENGTH=001                                               00126*12
ATYPE01  DFHMDF POS=(05,005),                                          X00131*14
               COLOR=BLUE,                                             X00132*12
               ATTRB=(ASKIP,NORM),                                     X00133*12
               LENGTH=001                                               00134*12
AVNME01  DFHMDF POS=(05,007),                                          X00135*14
               COLOR=BLUE,                                             X00136*12
               ATTRB=(ASKIP,NORM),                                     X00137*12
               LENGTH=024                                               00138*12
ADUNS01  DFHMDF POS=(05,032),                                          X00139*14
               COLOR=BLUE,                                             X00140*12
               ATTRB=(ASKIP,NORM),                                     X00141*12
               LENGTH=009                                               00142*12
AINHS01  DFHMDF POS=(05,042),                                          X00143*14
               COLOR=BLUE,                                             X00144*12
               ATTRB=(ASKIP,NORM),                                     X00145*12
               LENGTH=003                                               00146*12
ATRMS01  DFHMDF POS=(05,046),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=023                                               00150*12
AUPCC01  DFHMDF POS=(05,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI01   DFHMDF POS=(05,075),                                          X00151*14
               COLOR=BLUE,                                             X00152*12
               ATTRB=(ASKIP,NORM),                                     X00153*12
               LENGTH=001                                               00154*12
ATKT01   DFHMDF POS=(05,077),                                          X00155*14
               COLOR=BLUE,                                             X00156*12
               ATTRB=(ASKIP,NORM),                                     X00157*12
               LENGTH=001                                               00158*12
ASTAT01  DFHMDF POS=(05,079),                                          X00159*14
               COLOR=BLUE,                                             X00160*13
               ATTRB=(ASKIP,NORM),                                     X00161*13
               LENGTH=001                                               00162*13
ASEL02   DFHMDF POS=(06,003),                                          X00163*12
               COLOR=GREEN,                                            X00164*12
               ATTRB=(UNPROT,NORM),                                    X00165*12
               HILIGHT=UNDERLINE,                                      X00166*12
               LENGTH=001                                               00167*12
ATYPE02  DFHMDF POS=(06,005),                                          X00172*15
               COLOR=BLUE,                                             X00173*12
               ATTRB=(ASKIP,NORM),                                     X00174*12
               LENGTH=001                                               00175*12
AVNME02  DFHMDF POS=(06,007),                                          X00176*15
               COLOR=BLUE,                                             X00177*12
               ATTRB=(ASKIP,NORM),                                     X00178*12
               LENGTH=024                                               00179*12
ADUNS02  DFHMDF POS=(06,032),                                          X00180*15
               COLOR=BLUE,                                             X00181*12
               ATTRB=(ASKIP,NORM),                                     X00182*12
               LENGTH=009                                               00183*12
AINHS02  DFHMDF POS=(06,042),                                          X00184*15
               COLOR=BLUE,                                             X00185*12
               ATTRB=(ASKIP,NORM),                                     X00186*12
               LENGTH=003                                               00187*12
ATRMS02  DFHMDF POS=(06,046),                                          X00188*15
               COLOR=BLUE,                                             X00189*12
               ATTRB=(ASKIP,NORM),                                     X00190*12
               LENGTH=023                                               00191*12
AUPCC02  DFHMDF POS=(06,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI02   DFHMDF POS=(06,075),                                          X00192*15
               COLOR=BLUE,                                             X00193*12
               ATTRB=(ASKIP,NORM),                                     X00194*12
               LENGTH=001                                               00195*12
ATKT02   DFHMDF POS=(06,077),                                          X00196*15
               COLOR=BLUE,                                             X00197*12
               ATTRB=(ASKIP,NORM),                                     X00198*12
               LENGTH=001                                               00199*12
ASTAT02  DFHMDF POS=(06,079),                                          X00200*15
               COLOR=BLUE,                                             X00201*15
               ATTRB=(ASKIP,NORM),                                     X00202*15
               LENGTH=001                                               00203*15
ASEL03   DFHMDF POS=(07,003),                                          X00204*12
               COLOR=GREEN,                                            X00205*12
               ATTRB=(UNPROT,NORM),                                    X00206*12
               HILIGHT=UNDERLINE,                                      X00207*12
               LENGTH=001                                               00208*12
ATYPE03  DFHMDF POS=(07,005),                                          X00213*16
               COLOR=BLUE,                                             X00214*12
               ATTRB=(ASKIP,NORM),                                     X00215*12
               LENGTH=001                                               00216*12
AVNME03  DFHMDF POS=(07,007),                                          X00217*16
               COLOR=BLUE,                                             X00218*12
               ATTRB=(ASKIP,NORM),                                     X00219*12
               LENGTH=024                                               00220*12
ADUNS03  DFHMDF POS=(07,032),                                          X00221*16
               COLOR=BLUE,                                             X00222*12
               ATTRB=(ASKIP,NORM),                                     X00223*12
               LENGTH=009                                               00224*12
AINHS03  DFHMDF POS=(07,042),                                          X00225*16
               COLOR=BLUE,                                             X00226*12
               ATTRB=(ASKIP,NORM),                                     X00227*12
               LENGTH=003                                               00228*12
ATRMS03  DFHMDF POS=(07,046),                                          X00229*16
               COLOR=BLUE,                                             X00230*12
               ATTRB=(ASKIP,NORM),                                     X00231*12
               LENGTH=023                                               00232*12
AUPCC03  DFHMDF POS=(07,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI03   DFHMDF POS=(07,075),                                          X00233*16
               COLOR=BLUE,                                             X00234*12
               ATTRB=(ASKIP,NORM),                                     X00235*12
               LENGTH=001                                               00236*12
ATKT03   DFHMDF POS=(07,077),                                          X00237*16
               COLOR=BLUE,                                             X00238*12
               ATTRB=(ASKIP,NORM),                                     X00239*12
               LENGTH=001                                               00240*12
ASTAT03  DFHMDF POS=(07,079),                                          X00241*16
               COLOR=BLUE,                                             X00242*16
               ATTRB=(ASKIP,NORM),                                     X00243*16
               LENGTH=001                                               00244*16
ASEL04   DFHMDF POS=(08,003),                                          X00245*12
               COLOR=GREEN,                                            X00246*12
               ATTRB=(UNPROT,NORM),                                    X00247*12
               HILIGHT=UNDERLINE,                                      X00248*12
               LENGTH=001                                               00249*12
ATYPE04  DFHMDF POS=(08,005),                                          X00254*16
               COLOR=BLUE,                                             X00255*12
               ATTRB=(ASKIP,NORM),                                     X00256*12
               LENGTH=001                                               00257*12
AVNME04  DFHMDF POS=(08,007),                                          X00258*16
               COLOR=BLUE,                                             X00259*12
               ATTRB=(ASKIP,NORM),                                     X00260*12
               LENGTH=024                                               00261*12
ADUNS04  DFHMDF POS=(08,032),                                          X00262*16
               COLOR=BLUE,                                             X00263*12
               ATTRB=(ASKIP,NORM),                                     X00264*12
               LENGTH=009                                               00265*12
AINHS04  DFHMDF POS=(08,042),                                          X00266*16
               COLOR=BLUE,                                             X00267*12
               ATTRB=(ASKIP,NORM),                                     X00268*12
               LENGTH=003                                               00269*12
ATRMS04  DFHMDF POS=(08,046),                                          X00270*16
               COLOR=BLUE,                                             X00271*12
               ATTRB=(ASKIP,NORM),                                     X00272*12
               LENGTH=023                                               00273*12
AUPCC04  DFHMDF POS=(08,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI04   DFHMDF POS=(08,075),                                          X00274*16
               COLOR=BLUE,                                             X00275*12
               ATTRB=(ASKIP,NORM),                                     X00276*12
               LENGTH=001                                               00277*12
ATKT04   DFHMDF POS=(08,077),                                          X00278*16
               COLOR=BLUE,                                             X00279*12
               ATTRB=(ASKIP,NORM),                                     X00280*12
               LENGTH=001                                               00281*12
ASTAT04  DFHMDF POS=(08,079),                                          X00282*16
               COLOR=BLUE,                                             X00283*16
               ATTRB=(ASKIP,NORM),                                     X00284*16
               LENGTH=001                                               00285*16
ASEL05   DFHMDF POS=(09,003),                                          X00286*12
               COLOR=GREEN,                                            X00287*12
               ATTRB=(UNPROT,NORM),                                    X00288*12
               HILIGHT=UNDERLINE,                                      X00289*12
               LENGTH=001                                               00290*12
ATYPE05  DFHMDF POS=(09,005),                                          X00295*16
               COLOR=BLUE,                                             X00296*12
               ATTRB=(ASKIP,NORM),                                     X00297*12
               LENGTH=001                                               00298*12
AVNME05  DFHMDF POS=(09,007),                                          X00299*16
               COLOR=BLUE,                                             X00300*12
               ATTRB=(ASKIP,NORM),                                     X00301*12
               LENGTH=024                                               00302*12
ADUNS05  DFHMDF POS=(09,032),                                          X00303*16
               COLOR=BLUE,                                             X00304*12
               ATTRB=(ASKIP,NORM),                                     X00305*12
               LENGTH=009                                               00306*12
AINHS05  DFHMDF POS=(09,042),                                          X00307*16
               COLOR=BLUE,                                             X00308*12
               ATTRB=(ASKIP,NORM),                                     X00309*12
               LENGTH=003                                               00310*12
ATRMS05  DFHMDF POS=(09,046),                                          X00311*16
               COLOR=BLUE,                                             X00312*12
               ATTRB=(ASKIP,NORM),                                     X00313*12
               LENGTH=023                                               00314*12
AUPCC05  DFHMDF POS=(09,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI05   DFHMDF POS=(09,075),                                          X00315*16
               COLOR=BLUE,                                             X00316*12
               ATTRB=(ASKIP,NORM),                                     X00317*12
               LENGTH=001                                               00318*12
ATKT05   DFHMDF POS=(09,077),                                          X00319*16
               COLOR=BLUE,                                             X00320*12
               ATTRB=(ASKIP,NORM),                                     X00321*12
               LENGTH=001                                               00322*12
ASTAT05  DFHMDF POS=(09,079),                                          X00323*16
               COLOR=BLUE,                                             X00324*16
               ATTRB=(ASKIP,NORM),                                     X00325*16
               LENGTH=001                                               00326*16
ASEL06   DFHMDF POS=(10,003),                                          X00327*12
               COLOR=GREEN,                                            X00328*12
               ATTRB=(UNPROT,NORM),                                    X00329*12
               HILIGHT=UNDERLINE,                                      X00330*12
               LENGTH=001                                               00331*12
ATYPE06  DFHMDF POS=(10,005),                                          X00336*16
               COLOR=BLUE,                                             X00337*12
               ATTRB=(ASKIP,NORM),                                     X00338*12
               LENGTH=001                                               00339*12
AVNME06  DFHMDF POS=(10,007),                                          X00340*16
               COLOR=BLUE,                                             X00341*12
               ATTRB=(ASKIP,NORM),                                     X00342*12
               LENGTH=024                                               00343*12
ADUNS06  DFHMDF POS=(10,032),                                          X00344*16
               COLOR=BLUE,                                             X00345*12
               ATTRB=(ASKIP,NORM),                                     X00346*12
               LENGTH=009                                               00347*12
AINHS06  DFHMDF POS=(10,042),                                          X00348*16
               COLOR=BLUE,                                             X00349*12
               ATTRB=(ASKIP,NORM),                                     X00350*12
               LENGTH=003                                               00351*12
ATRMS06  DFHMDF POS=(10,046),                                          X00352*16
               COLOR=BLUE,                                             X00353*12
               ATTRB=(ASKIP,NORM),                                     X00354*12
               LENGTH=023                                               00355*12
AUPCC06  DFHMDF POS=(10,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI06   DFHMDF POS=(10,075),                                          X00356*16
               COLOR=BLUE,                                             X00357*12
               ATTRB=(ASKIP,NORM),                                     X00358*12
               LENGTH=001                                               00359*12
ATKT06   DFHMDF POS=(10,077),                                          X00360*16
               COLOR=BLUE,                                             X00361*12
               ATTRB=(ASKIP,NORM),                                     X00362*12
               LENGTH=001                                               00363*12
ASTAT06  DFHMDF POS=(10,079),                                          X00364*16
               COLOR=BLUE,                                             X00365*16
               ATTRB=(ASKIP,NORM),                                     X00366*16
               LENGTH=001                                               00367*16
ASEL07   DFHMDF POS=(11,003),                                          X00368*12
               COLOR=GREEN,                                            X00369*12
               ATTRB=(UNPROT,NORM),                                    X00370*12
               HILIGHT=UNDERLINE,                                      X00371*12
               LENGTH=001                                               00372*12
ATYPE07  DFHMDF POS=(11,005),                                          X00377*17
               COLOR=BLUE,                                             X00378*12
               ATTRB=(ASKIP,NORM),                                     X00379*12
               LENGTH=001                                               00380*12
AVNME07  DFHMDF POS=(11,007),                                          X00381*17
               COLOR=BLUE,                                             X00382*12
               ATTRB=(ASKIP,NORM),                                     X00383*12
               LENGTH=024                                               00384*12
ADUNS07  DFHMDF POS=(11,032),                                          X00385*17
               COLOR=BLUE,                                             X00386*12
               ATTRB=(ASKIP,NORM),                                     X00387*12
               LENGTH=009                                               00388*12
AINHS07  DFHMDF POS=(11,042),                                          X00389*17
               COLOR=BLUE,                                             X00390*12
               ATTRB=(ASKIP,NORM),                                     X00391*12
               LENGTH=003                                               00392*12
ATRMS07  DFHMDF POS=(11,046),                                          X00393*17
               COLOR=BLUE,                                             X00394*12
               ATTRB=(ASKIP,NORM),                                     X00395*12
               LENGTH=023                                               00396*12
AUPCC07  DFHMDF POS=(11,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI07   DFHMDF POS=(11,075),                                          X00397*17
               COLOR=BLUE,                                             X00398*12
               ATTRB=(ASKIP,NORM),                                     X00399*12
               LENGTH=001                                               00400*12
ATKT07   DFHMDF POS=(11,077),                                          X00401*17
               COLOR=BLUE,                                             X00402*12
               ATTRB=(ASKIP,NORM),                                     X00403*12
               LENGTH=001                                               00404*12
ASTAT07  DFHMDF POS=(11,079),                                          X00405*17
               COLOR=BLUE,                                             X00406*17
               ATTRB=(ASKIP,NORM),                                     X00407*17
               LENGTH=001                                               00408*17
ASEL08   DFHMDF POS=(12,003),                                          X00409*12
               COLOR=GREEN,                                            X00410*12
               ATTRB=(UNPROT,NORM),                                    X00411*12
               HILIGHT=UNDERLINE,                                      X00412*12
               LENGTH=001                                               00413*12
ATYPE08  DFHMDF POS=(12,005),                                          X00418*17
               COLOR=BLUE,                                             X00419*12
               ATTRB=(ASKIP,NORM),                                     X00420*12
               LENGTH=001                                               00421*12
AVNME08  DFHMDF POS=(12,007),                                          X00422*17
               COLOR=BLUE,                                             X00423*12
               ATTRB=(ASKIP,NORM),                                     X00424*12
               LENGTH=024                                               00425*12
ADUNS08  DFHMDF POS=(12,032),                                          X00426*17
               COLOR=BLUE,                                             X00427*12
               ATTRB=(ASKIP,NORM),                                     X00428*12
               LENGTH=009                                               00429*12
AINHS08  DFHMDF POS=(12,042),                                          X00430*17
               COLOR=BLUE,                                             X00431*12
               ATTRB=(ASKIP,NORM),                                     X00432*12
               LENGTH=003                                               00433*12
ATRMS08  DFHMDF POS=(12,046),                                          X00434*17
               COLOR=BLUE,                                             X00435*12
               ATTRB=(ASKIP,NORM),                                     X00436*12
               LENGTH=023                                               00437*12
AUPCC08  DFHMDF POS=(12,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI08   DFHMDF POS=(12,075),                                          X00438*17
               COLOR=BLUE,                                             X00439*12
               ATTRB=(ASKIP,NORM),                                     X00440*12
               LENGTH=001                                               00441*12
ATKT08   DFHMDF POS=(12,077),                                          X00442*17
               COLOR=BLUE,                                             X00443*12
               ATTRB=(ASKIP,NORM),                                     X00444*12
               LENGTH=001                                               00445*12
ASTAT08  DFHMDF POS=(12,079),                                          X00446*17
               COLOR=BLUE,                                             X00447*17
               ATTRB=(ASKIP,NORM),                                     X00448*17
               LENGTH=001                                               00449*17
ASEL09   DFHMDF POS=(13,003),                                          X00450*12
               COLOR=GREEN,                                            X00451*12
               ATTRB=(UNPROT,NORM),                                    X00452*12
               HILIGHT=UNDERLINE,                                      X00453*12
               LENGTH=001                                               00454*12
ATYPE09  DFHMDF POS=(13,005),                                          X00459*17
               COLOR=BLUE,                                             X00460*12
               ATTRB=(ASKIP,NORM),                                     X00461*12
               LENGTH=001                                               00462*12
AVNME09  DFHMDF POS=(13,007),                                          X00463*17
               COLOR=BLUE,                                             X00464*12
               ATTRB=(ASKIP,NORM),                                     X00465*12
               LENGTH=024                                               00466*12
ADUNS09  DFHMDF POS=(13,032),                                          X00467*17
               COLOR=BLUE,                                             X00468*12
               ATTRB=(ASKIP,NORM),                                     X00469*12
               LENGTH=009                                               00470*12
AINHS09  DFHMDF POS=(13,042),                                          X00471*17
               COLOR=BLUE,                                             X00472*12
               ATTRB=(ASKIP,NORM),                                     X00473*12
               LENGTH=003                                               00474*12
ATRMS09  DFHMDF POS=(13,046),                                          X00475*17
               COLOR=BLUE,                                             X00476*12
               ATTRB=(ASKIP,NORM),                                     X00477*12
               LENGTH=023                                               00478*12
AUPCC09  DFHMDF POS=(13,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI09   DFHMDF POS=(13,075),                                          X00479*17
               COLOR=BLUE,                                             X00480*12
               ATTRB=(ASKIP,NORM),                                     X00481*12
               LENGTH=001                                               00482*12
ATKT09   DFHMDF POS=(13,077),                                          X00483*17
               COLOR=BLUE,                                             X00484*12
               ATTRB=(ASKIP,NORM),                                     X00485*12
               LENGTH=001                                               00486*12
ASTAT09  DFHMDF POS=(13,079),                                          X00487*17
               COLOR=BLUE,                                             X00488*17
               ATTRB=(ASKIP,NORM),                                     X00489*17
               LENGTH=001                                               00490*17
ASEL10   DFHMDF POS=(14,003),                                          X00491*12
               COLOR=GREEN,                                            X00492*12
               ATTRB=(UNPROT,NORM),                                    X00493*12
               HILIGHT=UNDERLINE,                                      X00494*12
               LENGTH=001                                               00495*12
ATYPE10  DFHMDF POS=(14,005),                                          X00500*17
               COLOR=BLUE,                                             X00501*12
               ATTRB=(ASKIP,NORM),                                     X00502*12
               LENGTH=001                                               00503*12
AVNME10  DFHMDF POS=(14,007),                                          X00504*17
               COLOR=BLUE,                                             X00505*12
               ATTRB=(ASKIP,NORM),                                     X00506*12
               LENGTH=024                                               00507*12
ADUNS10  DFHMDF POS=(14,032),                                          X00508*17
               COLOR=BLUE,                                             X00509*12
               ATTRB=(ASKIP,NORM),                                     X00510*12
               LENGTH=009                                               00511*12
AINHS10  DFHMDF POS=(14,042),                                          X00512*17
               COLOR=BLUE,                                             X00513*12
               ATTRB=(ASKIP,NORM),                                     X00514*12
               LENGTH=003                                               00515*12
ATRMS10  DFHMDF POS=(14,046),                                          X00516*17
               COLOR=BLUE,                                             X00517*12
               ATTRB=(ASKIP,NORM),                                     X00518*12
               LENGTH=023                                               00519*12
AUPCC10  DFHMDF POS=(14,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI10   DFHMDF POS=(14,075),                                          X00520*17
               COLOR=BLUE,                                             X00521*12
               ATTRB=(ASKIP,NORM),                                     X00522*12
               LENGTH=001                                               00523*12
ATKT10   DFHMDF POS=(14,077),                                          X00524*17
               COLOR=BLUE,                                             X00525*12
               ATTRB=(ASKIP,NORM),                                     X00526*12
               LENGTH=001                                               00527*12
ASTAT10  DFHMDF POS=(14,079),                                          X00528*17
               COLOR=BLUE,                                             X00529*17
               ATTRB=(ASKIP,NORM),                                     X00530*17
               LENGTH=001                                               00531*17
ASEL11   DFHMDF POS=(15,003),                                          X00532*12
               COLOR=GREEN,                                            X00533*12
               ATTRB=(UNPROT,NORM),                                    X00534*12
               HILIGHT=UNDERLINE,                                      X00535*12
               LENGTH=001                                               00536*12
ATYPE11  DFHMDF POS=(15,005),                                          X00541*17
               COLOR=BLUE,                                             X00542*12
               ATTRB=(ASKIP,NORM),                                     X00543*12
               LENGTH=001                                               00544*12
AVNME11  DFHMDF POS=(15,007),                                          X00545*17
               COLOR=BLUE,                                             X00546*12
               ATTRB=(ASKIP,NORM),                                     X00547*12
               LENGTH=024                                               00548*12
ADUNS11  DFHMDF POS=(15,032),                                          X00549*17
               COLOR=BLUE,                                             X00550*12
               ATTRB=(ASKIP,NORM),                                     X00551*12
               LENGTH=009                                               00552*12
AINHS11  DFHMDF POS=(15,042),                                          X00553*17
               COLOR=BLUE,                                             X00554*12
               ATTRB=(ASKIP,NORM),                                     X00555*12
               LENGTH=003                                               00556*12
ATRMS11  DFHMDF POS=(15,046),                                          X00557*17
               COLOR=BLUE,                                             X00558*12
               ATTRB=(ASKIP,NORM),                                     X00559*12
               LENGTH=023                                               00560*12
AUPCC11  DFHMDF POS=(15,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI11   DFHMDF POS=(15,075),                                          X00561*17
               COLOR=BLUE,                                             X00562*12
               ATTRB=(ASKIP,NORM),                                     X00563*12
               LENGTH=001                                               00564*12
ATKT11   DFHMDF POS=(15,077),                                          X00565*17
               COLOR=BLUE,                                             X00566*12
               ATTRB=(ASKIP,NORM),                                     X00567*12
               LENGTH=001                                               00568*12
ASTAT11  DFHMDF POS=(15,079),                                          X00569*17
               COLOR=BLUE,                                             X00570*17
               ATTRB=(ASKIP,NORM),                                     X00571*17
               LENGTH=001                                               00572*17
ASEL12   DFHMDF POS=(16,003),                                          X00573*12
               COLOR=GREEN,                                            X00574*12
               ATTRB=(UNPROT,NORM),                                    X00575*12
               HILIGHT=UNDERLINE,                                      X00576*12
               LENGTH=001                                               00577*12
ATYPE12  DFHMDF POS=(16,005),                                          X00582*17
               COLOR=BLUE,                                             X00583*12
               ATTRB=(ASKIP,NORM),                                     X00584*12
               LENGTH=001                                               00585*12
AVNME12  DFHMDF POS=(16,007),                                          X00586*17
               COLOR=BLUE,                                             X00587*12
               ATTRB=(ASKIP,NORM),                                     X00588*12
               LENGTH=024                                               00589*12
ADUNS12  DFHMDF POS=(16,032),                                          X00590*17
               COLOR=BLUE,                                             X00591*12
               ATTRB=(ASKIP,NORM),                                     X00592*12
               LENGTH=009                                               00593*12
AINHS12  DFHMDF POS=(16,042),                                          X00594*17
               COLOR=BLUE,                                             X00595*12
               ATTRB=(ASKIP,NORM),                                     X00596*12
               LENGTH=003                                               00597*12
ATRMS12  DFHMDF POS=(16,046),                                          X00598*17
               COLOR=BLUE,                                             X00599*12
               ATTRB=(ASKIP,NORM),                                     X00600*12
               LENGTH=023                                               00601*12
AUPCC12  DFHMDF POS=(16,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI12   DFHMDF POS=(16,075),                                          X00602*17
               COLOR=BLUE,                                             X00603*12
               ATTRB=(ASKIP,NORM),                                     X00604*12
               LENGTH=001                                               00605*12
ATKT12   DFHMDF POS=(16,077),                                          X00606*17
               COLOR=BLUE,                                             X00607*12
               ATTRB=(ASKIP,NORM),                                     X00608*12
               LENGTH=001                                               00609*12
ASTAT12  DFHMDF POS=(16,079),                                          X00610*17
               COLOR=BLUE,                                             X00611*17
               ATTRB=(ASKIP,NORM),                                     X00612*17
               LENGTH=001                                               00613*17
ASEL13   DFHMDF POS=(17,003),                                          X00614*12
               COLOR=GREEN,                                            X00615*12
               ATTRB=(UNPROT,NORM),                                    X00616*12
               HILIGHT=UNDERLINE,                                      X00617*12
               LENGTH=001                                               00618*12
ATYPE13  DFHMDF POS=(17,005),                                          X00623*17
               COLOR=BLUE,                                             X00624*12
               ATTRB=(ASKIP,NORM),                                     X00625*12
               LENGTH=001                                               00626*12
AVNME13  DFHMDF POS=(17,007),                                          X00627*17
               COLOR=BLUE,                                             X00628*12
               ATTRB=(ASKIP,NORM),                                     X00629*12
               LENGTH=024                                               00630*12
ADUNS13  DFHMDF POS=(17,032),                                          X00631*17
               COLOR=BLUE,                                             X00632*12
               ATTRB=(ASKIP,NORM),                                     X00633*12
               LENGTH=009                                               00634*12
AINHS13  DFHMDF POS=(17,042),                                          X00635*17
               COLOR=BLUE,                                             X00636*12
               ATTRB=(ASKIP,NORM),                                     X00637*12
               LENGTH=003                                               00638*12
ATRMS13  DFHMDF POS=(17,046),                                          X00639*17
               COLOR=BLUE,                                             X00640*12
               ATTRB=(ASKIP,NORM),                                     X00641*12
               LENGTH=023                                               00642*12
AUPCC13  DFHMDF POS=(17,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI13   DFHMDF POS=(17,075),                                          X00643*17
               COLOR=BLUE,                                             X00644*12
               ATTRB=(ASKIP,NORM),                                     X00645*12
               LENGTH=001                                               00646*12
ATKT13   DFHMDF POS=(17,077),                                          X00647*17
               COLOR=BLUE,                                             X00648*12
               ATTRB=(ASKIP,NORM),                                     X00649*12
               LENGTH=001                                               00650*12
ASTAT13  DFHMDF POS=(17,079),                                          X00651*17
               COLOR=BLUE,                                             X00652*17
               ATTRB=(ASKIP,NORM),                                     X00653*17
               LENGTH=001                                               00654*17
ASEL14   DFHMDF POS=(18,003),                                          X00655*12
               COLOR=GREEN,                                            X00656*12
               ATTRB=(UNPROT,NORM),                                    X00657*12
               HILIGHT=UNDERLINE,                                      X00658*12
               LENGTH=001                                               00659*12
ATYPE14  DFHMDF POS=(18,005),                                          X00664*17
               COLOR=BLUE,                                             X00665*12
               ATTRB=(ASKIP,NORM),                                     X00666*12
               LENGTH=001                                               00667*12
AVNME14  DFHMDF POS=(18,007),                                          X00668*17
               COLOR=BLUE,                                             X00669*12
               ATTRB=(ASKIP,NORM),                                     X00670*12
               LENGTH=024                                               00671*12
ADUNS14  DFHMDF POS=(18,032),                                          X00672*17
               COLOR=BLUE,                                             X00673*12
               ATTRB=(ASKIP,NORM),                                     X00674*12
               LENGTH=009                                               00675*12
AINHS14  DFHMDF POS=(18,042),                                          X00676*17
               COLOR=BLUE,                                             X00677*12
               ATTRB=(ASKIP,NORM),                                     X00678*12
               LENGTH=003                                               00679*12
ATRMS14  DFHMDF POS=(18,046),                                          X00680*17
               COLOR=BLUE,                                             X00681*12
               ATTRB=(ASKIP,NORM),                                     X00682*12
               LENGTH=023                                               00683*12
AUPCC14  DFHMDF POS=(18,071),                                          X00147*14
               COLOR=BLUE,                                             X00148*12
               ATTRB=(ASKIP,NORM),                                     X00149*12
               LENGTH=003                                               00150*12
AEDI14   DFHMDF POS=(18,075),                                          X00684*17
               COLOR=BLUE,                                             X00685*12
               ATTRB=(ASKIP,NORM),                                     X00686*12
               LENGTH=001                                               00687*12
ATKT14   DFHMDF POS=(18,077),                                          X00688*17
               COLOR=BLUE,                                             X00689*12
               ATTRB=(ASKIP,NORM),                                     X00690*12
               LENGTH=001                                               00691*12
ASTAT14  DFHMDF POS=(18,079),                                          X00692*17
               COLOR=BLUE,                                             X00693*17
               ATTRB=(ASKIP,NORM),                                     X00694*17
               LENGTH=001                                               00695*17
         DFHMDF POS=(19,045),                                          X00696*12
               COLOR=NEUTRAL,                                          X00697*12
               ATTRB=(ASKIP,NORM),                                     X00698*12
               HILIGHT=OFF,                                            X00699*12
               LENGTH=026,                                             X00700*12
               INITIAL='NUMBER OF SELECTED ITEMS: '                     00701*12
ASELIT   DFHMDF POS=(19,072),                                          X00702*12
               COLOR=BLUE,                                             X00703*12
               ATTRB=(ASKIP,NORM),                                     X00704*12
               LENGTH=007,                                             X00705*12
               PICOUT='ZZZ,ZZ9'                                         00706*12
         DFHMSD TYPE=FINAL                                              00707*12
         END                                                            00708*12
