*          DATA SET VNKM008    AT LEVEL 001 AS OF 06/24/93                      
  PRINT  NOGEN                                                          00001**2
*******************************************************************-*   00002**2
*                                                                   *   00003**2
*        MAPSET  VNKM008                                            *   00004**2
*        MAP     VN008A                                             *   00005**2
*        PROGRAM VNKCS008                                           *   00006**2
*        TRANSID V008 - VENDOR NAME  LIST                           *   00007**2
*        SYSTEM  CICS ARCHITECTURE                                  *   00008**2
*                                                                   *   00009**2
*******************************************************************-*   00010**2
VNKM008  DFHMSD TYPE=MAP,                                              X00011**3
               CTRL=(FREEKB),                                          X00012**2
               LANG=COBOL,                                             X00013**2
               MODE=INOUT,                                             X00014**2
               TIOAPFX=YES                                              00015**2
VN008A   DFHMDI SIZE=(19,080),                                         X00016**3
               MAPATTS=(COLOR,HILIGHT),                                X00017**2
               DSATTS=(COLOR,HILIGHT),                                 X00018**2
               LINE=02,                                                X00019**2
               COLUMN=01                                                00020**2
         DFHMDF POS=(02,001),                                          X00021**3
               COLOR=NEUTRAL,                                          X00022**2
               ATTRB=(ASKIP,NORM),                                     X00023**2
               LENGTH=007,                                             X00024**3
               INITIAL='VENDOR:'                                        00025**3
AVNNAME  DFHMDF POS=(02,009),                                          X00026**3
               COLOR=BLUE,                                             X00027**3
               ATTRB=(ASKIP,NORM),                                     X00028**3
               HILIGHT=OFF,                                            X00029**3
               LENGTH=030                                               00030**3
         DFHMDF POS=(02,044),                                          X00031**3
               COLOR=NEUTRAL,                                          X00032**3
               ATTRB=(ASKIP,NORM),                                     X00033**3
               LENGTH=005,                                             X00034**3
               INITIAL='ITEMS'                                          00035**3
ASTRTIT  DFHMDF POS=(02,050),                                          X00036**2
               COLOR=GREEN,                                            X00037**2
               ATTRB=(UNPROT,NUM,NORM),                                X00038**2
               HILIGHT=UNDERLINE,                                      X00039**2
               LENGTH=007,                                             X00040**2
               PICOUT='ZZZ,ZZ9'                                         00041**2
         DFHMDF POS=(02,058),                                          X00042**2
               COLOR=NEUTRAL,                                          X00043**2
               ATTRB=(ASKIP,NORM),                                     X00044**2
               LENGTH=002,                                             X00045**2
               INITIAL='TO'                                             00046**2
AENDIT   DFHMDF POS=(02,061),                                          X00047**2
               COLOR=BLUE,                                             X00048**2
               ATTRB=(ASKIP,NORM),                                     X00049**2
               LENGTH=007,                                             X00050**2
               PICOUT='ZZZ,ZZ9'                                         00051**2
         DFHMDF POS=(02,069),                                          X00052**2
               COLOR=NEUTRAL,                                          X00053**2
               ATTRB=(ASKIP,NORM),                                     X00054**2
               LENGTH=002,                                             X00055**2
               INITIAL='OF'                                             00056**2
ATOTIT   DFHMDF POS=(02,072),                                          X00057**2
               COLOR=BLUE,                                             X00058**2
               ATTRB=(ASKIP,NORM),                                     X00059**2
               LENGTH=007,                                             X00060**2
               PICOUT='ZZZ,ZZ9'                                         00061**2
         DFHMDF POS=(04,001),                                          X00062**2
               COLOR=NEUTRAL,                                          X00063**2
               ATTRB=(ASKIP,NORM),                                     X00064**2
               LENGTH=004,                                             X00065**2
               INITIAL='SEL '                                           00066**2
         DFHMDF POS=(04,006),                                          X00067**2
               COLOR=NEUTRAL,                                          X00068**2
               ATTRB=(ASKIP,NORM),                                     X00069**2
               LENGTH=010,                                             X00070**2
               INITIAL='ACT       '                                     00071**2
         DFHMDF POS=(04,017),                                          X00072**2
               COLOR=NEUTRAL,                                          X00073**2
               ATTRB=(ASKIP,NORM),                                     X00074**2
               LENGTH=022,                                             X00075**2
               INITIAL='VENDOR NAME           '                         00076**2
         DFHMDF POS=(04,060),                                          X00077**2
               COLOR=NEUTRAL,                                          X00078**2
               ATTRB=(ASKIP,NORM),                                     X00079**2
               LENGTH=016,                                             X00080**2
               INITIAL='TYPE  DESC      '                               00081**2
ASEL01   DFHMDF POS=(05,002),                                          X00082**2
               COLOR=GREEN,                                            X00083**2
               ATTRB=(UNPROT,NORM),                                    X00084**2
               HILIGHT=UNDERLINE,                                      X00085**2
               LENGTH=001                                               00086**2
         DFHMDF POS=(05,004),                                          X00087**2
               ATTRB=(ASKIP),                                          X00088**2
               LENGTH=001                                               00089**2
AACT01   DFHMDF POS=(05,006),                                          X00090**2
               COLOR=BLUE,                                             X00091**2
               ATTRB=(ASKIP,NORM),                                     X00092**2
               LENGTH=003                                               00093**2
AVNME01  DFHMDF POS=(05,010),                                          X00094**2
               COLOR=BLUE,                                             X00095**2
               ATTRB=(ASKIP,NORM),                                     X00096**2
               LENGTH=049                                               00097**2
ANTYP01  DFHMDF POS=(05,061),                                          X00098**2
               COLOR=BLUE,                                             X00099**2
               ATTRB=(ASKIP,NORM),                                     X00100**2
               LENGTH=002                                               00101**2
ATYDS01  DFHMDF POS=(05,064),                                          X00102**2
               COLOR=BLUE,                                             X00103**2
               ATTRB=(ASKIP,NORM),                                     X00104**2
               LENGTH=010                                               00105**2
ASEL02   DFHMDF POS=(06,002),                                          X00106**2
               COLOR=GREEN,                                            X00107**2
               ATTRB=(UNPROT,NORM),                                    X00108**2
               HILIGHT=UNDERLINE,                                      X00109**2
               LENGTH=001                                               00110**2
         DFHMDF POS=(06,004),                                          X00111**2
               ATTRB=(ASKIP),                                          X00112**2
               LENGTH=001                                               00113**2
AACT02   DFHMDF POS=(06,006),                                          X00114**2
               COLOR=BLUE,                                             X00115**2
               ATTRB=(ASKIP,NORM),                                     X00116**2
               LENGTH=003                                               00117**2
AVNME02  DFHMDF POS=(06,010),                                          X00118**2
               COLOR=BLUE,                                             X00119**2
               ATTRB=(ASKIP,NORM),                                     X00120**2
               LENGTH=049                                               00121**2
ANTYP02  DFHMDF POS=(06,061),                                          X00122**2
               COLOR=BLUE,                                             X00123**2
               ATTRB=(ASKIP,NORM),                                     X00124**2
               LENGTH=002                                               00125**2
ATYDS02  DFHMDF POS=(06,064),                                          X00126**2
               COLOR=BLUE,                                             X00127**2
               ATTRB=(ASKIP,NORM),                                     X00128**2
               LENGTH=010                                               00129**2
ASEL03   DFHMDF POS=(07,002),                                          X00130**2
               COLOR=GREEN,                                            X00131**2
               ATTRB=(UNPROT,NORM),                                    X00132**2
               HILIGHT=UNDERLINE,                                      X00133**2
               LENGTH=001                                               00134**2
         DFHMDF POS=(07,004),                                          X00135**2
               ATTRB=(ASKIP),                                          X00136**2
               LENGTH=001                                               00137**2
AACT03   DFHMDF POS=(07,006),                                          X00138**2
               COLOR=BLUE,                                             X00139**2
               ATTRB=(ASKIP,NORM),                                     X00140**2
               LENGTH=003                                               00141**2
AVNME03  DFHMDF POS=(07,010),                                          X00142**2
               COLOR=BLUE,                                             X00143**2
               ATTRB=(ASKIP,NORM),                                     X00144**2
               LENGTH=049                                               00145**2
ANTYP03  DFHMDF POS=(07,061),                                          X00146**2
               COLOR=BLUE,                                             X00147**2
               ATTRB=(ASKIP,NORM),                                     X00148**2
               LENGTH=002                                               00149**2
ATYDS03  DFHMDF POS=(07,064),                                          X00150**2
               COLOR=BLUE,                                             X00151**2
               ATTRB=(ASKIP,NORM),                                     X00152**2
               LENGTH=010                                               00153**2
ASEL04   DFHMDF POS=(08,002),                                          X00154**2
               COLOR=GREEN,                                            X00155**2
               ATTRB=(UNPROT,NORM),                                    X00156**2
               HILIGHT=UNDERLINE,                                      X00157**2
               LENGTH=001                                               00158**2
         DFHMDF POS=(08,004),                                          X00159**2
               ATTRB=(ASKIP),                                          X00160**2
               LENGTH=001                                               00161**2
AACT04   DFHMDF POS=(08,006),                                          X00162**2
               COLOR=BLUE,                                             X00163**2
               ATTRB=(ASKIP,NORM),                                     X00164**2
               LENGTH=003                                               00165**2
AVNME04  DFHMDF POS=(08,010),                                          X00166**2
               COLOR=BLUE,                                             X00167**2
               ATTRB=(ASKIP,NORM),                                     X00168**2
               LENGTH=049                                               00169**2
ANTYP04  DFHMDF POS=(08,061),                                          X00170**2
               COLOR=BLUE,                                             X00171**2
               ATTRB=(ASKIP,NORM),                                     X00172**2
               LENGTH=002                                               00173**2
ATYDS04  DFHMDF POS=(08,064),                                          X00174**2
               COLOR=BLUE,                                             X00175**2
               ATTRB=(ASKIP,NORM),                                     X00176**2
               LENGTH=010                                               00177**2
ASEL05   DFHMDF POS=(09,002),                                          X00178**2
               COLOR=GREEN,                                            X00179**2
               ATTRB=(UNPROT,NORM),                                    X00180**2
               HILIGHT=UNDERLINE,                                      X00181**2
               LENGTH=001                                               00182**2
         DFHMDF POS=(09,004),                                          X00183**2
               ATTRB=(ASKIP),                                          X00184**2
               LENGTH=001                                               00185**2
AACT05   DFHMDF POS=(09,006),                                          X00186**2
               COLOR=BLUE,                                             X00187**2
               ATTRB=(ASKIP,NORM),                                     X00188**2
               LENGTH=003                                               00189**2
AVNME05  DFHMDF POS=(09,010),                                          X00190**2
               COLOR=BLUE,                                             X00191**2
               ATTRB=(ASKIP,NORM),                                     X00192**2
               LENGTH=049                                               00193**2
ANTYP05  DFHMDF POS=(09,061),                                          X00194**2
               COLOR=BLUE,                                             X00195**2
               ATTRB=(ASKIP,NORM),                                     X00196**2
               LENGTH=002                                               00197**2
ATYDS05  DFHMDF POS=(09,064),                                          X00198**2
               COLOR=BLUE,                                             X00199**2
               ATTRB=(ASKIP,NORM),                                     X00200**2
               LENGTH=010                                               00201**2
ASEL06   DFHMDF POS=(10,002),                                          X00202**2
               COLOR=GREEN,                                            X00203**2
               ATTRB=(UNPROT,NORM),                                    X00204**2
               HILIGHT=UNDERLINE,                                      X00205**2
               LENGTH=001                                               00206**2
         DFHMDF POS=(10,004),                                          X00207**2
               ATTRB=(ASKIP),                                          X00208**2
               LENGTH=001                                               00209**2
AACT06   DFHMDF POS=(10,006),                                          X00210**2
               COLOR=BLUE,                                             X00211**2
               ATTRB=(ASKIP,NORM),                                     X00212**2
               LENGTH=003                                               00213**2
AVNME06  DFHMDF POS=(10,010),                                          X00214**2
               COLOR=BLUE,                                             X00215**2
               ATTRB=(ASKIP,NORM),                                     X00216**2
               LENGTH=049                                               00217**2
ANTYP06  DFHMDF POS=(10,061),                                          X00218**2
               COLOR=BLUE,                                             X00219**2
               ATTRB=(ASKIP,NORM),                                     X00220**2
               LENGTH=002                                               00221**2
ATYDS06  DFHMDF POS=(10,064),                                          X00222**2
               COLOR=BLUE,                                             X00223**2
               ATTRB=(ASKIP,NORM),                                     X00224**2
               LENGTH=010                                               00225**2
ASEL07   DFHMDF POS=(11,002),                                          X00226**2
               COLOR=GREEN,                                            X00227**2
               ATTRB=(UNPROT,NORM),                                    X00228**2
               HILIGHT=UNDERLINE,                                      X00229**2
               LENGTH=001                                               00230**2
         DFHMDF POS=(11,004),                                          X00231**2
               ATTRB=(ASKIP),                                          X00232**2
               LENGTH=001                                               00233**2
AACT07   DFHMDF POS=(11,006),                                          X00234**2
               COLOR=BLUE,                                             X00235**2
               ATTRB=(ASKIP,NORM),                                     X00236**2
               LENGTH=003                                               00237**2
AVNME07  DFHMDF POS=(11,010),                                          X00238**2
               COLOR=BLUE,                                             X00239**2
               ATTRB=(ASKIP,NORM),                                     X00240**2
               LENGTH=049                                               00241**2
ANTYP07  DFHMDF POS=(11,061),                                          X00242**2
               COLOR=BLUE,                                             X00243**2
               ATTRB=(ASKIP,NORM),                                     X00244**2
               LENGTH=002                                               00245**2
ATYDS07  DFHMDF POS=(11,064),                                          X00246**2
               COLOR=BLUE,                                             X00247**2
               ATTRB=(ASKIP,NORM),                                     X00248**2
               LENGTH=010                                               00249**2
ASEL08   DFHMDF POS=(12,002),                                          X00250**2
               COLOR=GREEN,                                            X00251**2
               ATTRB=(UNPROT,NORM),                                    X00252**2
               HILIGHT=UNDERLINE,                                      X00253**2
               LENGTH=001                                               00254**2
         DFHMDF POS=(12,004),                                          X00255**2
               ATTRB=(ASKIP),                                          X00256**2
               LENGTH=001                                               00257**2
AACT08   DFHMDF POS=(12,006),                                          X00258**2
               COLOR=BLUE,                                             X00259**2
               ATTRB=(ASKIP,NORM),                                     X00260**2
               LENGTH=003                                               00261**2
AVNME08  DFHMDF POS=(12,010),                                          X00262**2
               COLOR=BLUE,                                             X00263**2
               ATTRB=(ASKIP,NORM),                                     X00264**2
               LENGTH=049                                               00265**2
ANTYP08  DFHMDF POS=(12,061),                                          X00266**2
               COLOR=BLUE,                                             X00267**2
               ATTRB=(ASKIP,NORM),                                     X00268**2
               LENGTH=002                                               00269**2
ATYDS08  DFHMDF POS=(12,064),                                          X00270**2
               COLOR=BLUE,                                             X00271**2
               ATTRB=(ASKIP,NORM),                                     X00272**2
               LENGTH=010                                               00273**2
ASEL09   DFHMDF POS=(13,002),                                          X00274**2
               COLOR=GREEN,                                            X00275**2
               ATTRB=(UNPROT,NORM),                                    X00276**2
               HILIGHT=UNDERLINE,                                      X00277**2
               LENGTH=001                                               00278**2
         DFHMDF POS=(13,004),                                          X00279**2
               ATTRB=(ASKIP),                                          X00280**2
               LENGTH=001                                               00281**2
AACT09   DFHMDF POS=(13,006),                                          X00282**2
               COLOR=BLUE,                                             X00283**2
               ATTRB=(ASKIP,NORM),                                     X00284**2
               LENGTH=003                                               00285**2
AVNME09  DFHMDF POS=(13,010),                                          X00286**2
               COLOR=BLUE,                                             X00287**2
               ATTRB=(ASKIP,NORM),                                     X00288**2
               LENGTH=049                                               00289**2
ANTYP09  DFHMDF POS=(13,061),                                          X00290**2
               COLOR=BLUE,                                             X00291**2
               ATTRB=(ASKIP,NORM),                                     X00292**2
               LENGTH=002                                               00293**2
ATYDS09  DFHMDF POS=(13,064),                                          X00294**2
               COLOR=BLUE,                                             X00295**2
               ATTRB=(ASKIP,NORM),                                     X00296**2
               LENGTH=010                                               00297**2
ASEL10   DFHMDF POS=(14,002),                                          X00298**2
               COLOR=GREEN,                                            X00299**2
               ATTRB=(UNPROT,NORM),                                    X00300**2
               HILIGHT=UNDERLINE,                                      X00301**2
               LENGTH=001                                               00302**2
         DFHMDF POS=(14,004),                                          X00303**2
               ATTRB=(ASKIP),                                          X00304**2
               LENGTH=001                                               00305**2
AACT10   DFHMDF POS=(14,006),                                          X00306**2
               COLOR=BLUE,                                             X00307**2
               ATTRB=(ASKIP,NORM),                                     X00308**2
               LENGTH=003                                               00309**2
AVNME10  DFHMDF POS=(14,010),                                          X00310**2
               COLOR=BLUE,                                             X00311**2
               ATTRB=(ASKIP,NORM),                                     X00312**2
               LENGTH=049                                               00313**2
ANTYP10  DFHMDF POS=(14,061),                                          X00314**2
               COLOR=BLUE,                                             X00315**2
               ATTRB=(ASKIP,NORM),                                     X00316**2
               LENGTH=002                                               00317**2
ATYDS10  DFHMDF POS=(14,064),                                          X00318**2
               COLOR=BLUE,                                             X00319**2
               ATTRB=(ASKIP,NORM),                                     X00320**2
               LENGTH=010                                               00321**2
ASEL11   DFHMDF POS=(15,002),                                          X00322**2
               COLOR=GREEN,                                            X00323**2
               ATTRB=(UNPROT,NORM),                                    X00324**2
               HILIGHT=UNDERLINE,                                      X00325**2
               LENGTH=001                                               00326**2
         DFHMDF POS=(15,004),                                          X00327**2
               ATTRB=(ASKIP),                                          X00328**2
               LENGTH=001                                               00329**2
AACT11   DFHMDF POS=(15,006),                                          X00330**2
               COLOR=BLUE,                                             X00331**2
               ATTRB=(ASKIP,NORM),                                     X00332**2
               LENGTH=003                                               00333**2
AVNME11  DFHMDF POS=(15,010),                                          X00334**2
               COLOR=BLUE,                                             X00335**2
               ATTRB=(ASKIP,NORM),                                     X00336**2
               LENGTH=049                                               00337**2
ANTYP11  DFHMDF POS=(15,061),                                          X00338**2
               COLOR=BLUE,                                             X00339**2
               ATTRB=(ASKIP,NORM),                                     X00340**2
               LENGTH=002                                               00341**2
ATYDS11  DFHMDF POS=(15,064),                                          X00342**2
               COLOR=BLUE,                                             X00343**2
               ATTRB=(ASKIP,NORM),                                     X00344**2
               LENGTH=010                                               00345**2
ASEL12   DFHMDF POS=(16,002),                                          X00346**2
               COLOR=GREEN,                                            X00347**2
               ATTRB=(UNPROT,NORM),                                    X00348**2
               HILIGHT=UNDERLINE,                                      X00349**2
               LENGTH=001                                               00350**2
         DFHMDF POS=(16,004),                                          X00351**2
               ATTRB=(ASKIP),                                          X00352**2
               LENGTH=001                                               00353**2
AACT12   DFHMDF POS=(16,006),                                          X00354**2
               COLOR=BLUE,                                             X00355**2
               ATTRB=(ASKIP,NORM),                                     X00356**2
               LENGTH=003                                               00357**2
AVNME12  DFHMDF POS=(16,010),                                          X00358**2
               COLOR=BLUE,                                             X00359**2
               ATTRB=(ASKIP,NORM),                                     X00360**2
               LENGTH=049                                               00361**2
ANTYP12  DFHMDF POS=(16,061),                                          X00362**2
               COLOR=BLUE,                                             X00363**2
               ATTRB=(ASKIP,NORM),                                     X00364**2
               LENGTH=002                                               00365**2
ATYDS12  DFHMDF POS=(16,064),                                          X00366**2
               COLOR=BLUE,                                             X00367**2
               ATTRB=(ASKIP,NORM),                                     X00368**2
               LENGTH=010                                               00369**2
ASEL13   DFHMDF POS=(17,002),                                          X00370**2
               COLOR=GREEN,                                            X00371**2
               ATTRB=(UNPROT,NORM),                                    X00372**2
               HILIGHT=UNDERLINE,                                      X00373**2
               LENGTH=001                                               00374**2
         DFHMDF POS=(17,004),                                          X00375**2
               ATTRB=(ASKIP),                                          X00376**2
               LENGTH=001                                               00377**2
AACT13   DFHMDF POS=(17,006),                                          X00378**2
               COLOR=BLUE,                                             X00379**2
               ATTRB=(ASKIP,NORM),                                     X00380**2
               LENGTH=003                                               00381**2
AVNME13  DFHMDF POS=(17,010),                                          X00382**2
               COLOR=BLUE,                                             X00383**2
               ATTRB=(ASKIP,NORM),                                     X00384**2
               LENGTH=049                                               00385**2
ANTYP13  DFHMDF POS=(17,061),                                          X00386**2
               COLOR=BLUE,                                             X00387**2
               ATTRB=(ASKIP,NORM),                                     X00388**2
               LENGTH=002                                               00389**2
ATYDS13  DFHMDF POS=(17,064),                                          X00390**2
               COLOR=BLUE,                                             X00391**2
               ATTRB=(ASKIP,NORM),                                     X00392**2
               LENGTH=010                                               00393**2
ASEL14   DFHMDF POS=(18,002),                                          X00394**2
               COLOR=GREEN,                                            X00395**2
               ATTRB=(UNPROT,NORM),                                    X00396**2
               HILIGHT=UNDERLINE,                                      X00397**2
               LENGTH=001                                               00398**2
         DFHMDF POS=(18,004),                                          X00399**2
               ATTRB=(ASKIP),                                          X00400**2
               LENGTH=001                                               00401**2
AACT14   DFHMDF POS=(18,006),                                          X00402**2
               COLOR=BLUE,                                             X00403**2
               ATTRB=(ASKIP,NORM),                                     X00404**2
               LENGTH=003                                               00405**2
AVNME14  DFHMDF POS=(18,010),                                          X00406**2
               COLOR=BLUE,                                             X00407**2
               ATTRB=(ASKIP,NORM),                                     X00408**2
               LENGTH=049                                               00409**2
ANTYP14  DFHMDF POS=(18,061),                                          X00410**2
               COLOR=BLUE,                                             X00411**2
               ATTRB=(ASKIP,NORM),                                     X00412**2
               LENGTH=002                                               00413**2
ATYDS14  DFHMDF POS=(18,064),                                          X00414**2
               COLOR=BLUE,                                             X00415**2
               ATTRB=(ASKIP,NORM),                                     X00416**2
               LENGTH=010                                               00417**2
         DFHMDF POS=(19,045),                                          X00418**2
               COLOR=NEUTRAL,                                          X00419**2
               ATTRB=(ASKIP,NORM),                                     X00420**2
               LENGTH=026,                                             X00421**2
               INITIAL='NUMBER OF SELECTED ITEMS: '                     00422**2
ASELIT   DFHMDF POS=(19,072),                                          X00423**2
               COLOR=BLUE,                                             X00424**2
               ATTRB=(ASKIP,NORM),                                     X00425**2
               LENGTH=007,                                             X00426**2
               PICOUT='ZZZ,ZZ9'                                         00427**2
         DFHMSD TYPE=FINAL                                              00428**2
         END                                                            00429**2
