*          DATA SET VNKM022    AT LEVEL 001 AS OF 09/26/97              00010016
  PRINT  NOGEN                                                          00020016
************************************************************            00030016
*                                                                       00040016
*      MAPSET    VNKM022                                                00050016
*      MAP       VN022A                                                 00060016
*      PROGRAM   VNKCS022                                               00070016
*                                                                       00080016
************************************************************            00090016
VNKM022  DFHMSD TYPE=MAP,                                              X00100016
               CTRL=(FREEKB),                                          X00110016
               LANG=COBOL,                                             X00120016
               MODE=INOUT,                                             X00130016
               TIOAPFX=YES                                              00140016
VN022A   DFHMDI LINE=02,                                               X00150016
               COLUMN=01,                                              X00160016
               SIZE=(19,80),                                           X00170016
               MAPATTS=(COLOR,HILIGHT),                                X00180016
               DSATTS=(COLOR,HILIGHT)                                   00190016
ATERMDE  DFHMDF ATTRB=(ASKIP),                                         X00191028
               COLOR=BLUE,                                             X00192028
               LENGTH=28,                                              X00193028
               POS=(02,45)                                              00194028
         DFHMDF ATTRB=(ASKIP),                                         X00200016
               INITIAL='DISCOUNT DAYS..........:',                     X00210016
               COLOR=NEUTRAL,                                          X00220016
               LENGTH=24,                                              X00230016
               POS=(03,1)                                               00240016
ADSCDYS  DFHMDF ATTRB=(UNPROT),                                        X00250036
               COLOR=GREEN,                                            X00260016
               HILIGHT=UNDERLINE,                                      X00270016
               PICOUT='ZZZ',                                           X00280048
               LENGTH=3,                                               X00290027
               POS=(03,26)                                              00300016
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00310016
               INITIAL=' ',                                            X00320016
               LENGTH=1,                                               X00330016
               POS=(3,30)                                               00340027
         DFHMDF ATTRB=(ASKIP),                                         X00390016
               INITIAL='DISCOUNT PERCENT.......:',                     X00400028
               COLOR=NEUTRAL,                                          X00410016
               LENGTH=24,                                              X00420028
               POS=(04,1)                                               00430016
ADSCPCT  DFHMDF ATTRB=(UNPROT),                                        X00500037
               COLOR=GREEN,                                            X00510016
               HILIGHT=UNDERLINE,                                      X00520016
               PICOUT='ZZ.ZZ',                                         X00530039
               LENGTH=5,                                               X00540037
               POS=(04,26)                                              00550028
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00560016
               INITIAL=' ',                                            X00570016
               LENGTH=1,                                               X00580016
               POS=(4,32)                                               00590038
         DFHMDF ATTRB=(ASKIP),                                         X00591028
               INITIAL='(EXAMPLE: 04.50 IS 4.50 %)',                   X00592038
               COLOR=NEUTRAL,                                          X00593028
               LENGTH=26,                                              X00594038
               POS=(04,51)                                              00595029
         DFHMDF ATTRB=(ASKIP),                                         X00600016
               INITIAL='NET DUE DAYS...........:',                     X00610016
               COLOR=NEUTRAL,                                          X00620016
               LENGTH=24,                                              X00630016
               POS=(06,1)                                               00640016
ANTDDYS  DFHMDF ATTRB=(UNPROT,NUM),                                    X00650034
               COLOR=GREEN,                                            X00660016
               HILIGHT=UNDERLINE,                                      X00670016
               PICOUT='ZZZ',                                           X00680027
               LENGTH=3,                                               X00690027
               POS=(06,26)                                              00700016
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00710016
               INITIAL=' ',                                            X00720016
               LENGTH=1,                                               X00730016
               POS=(6,30)                                               00740027
         DFHMDF ATTRB=(ASKIP),                                         X00750016
               INITIAL='DUE DAYS FROM DATE TEXT:',                     X00760016
               COLOR=NEUTRAL,                                          X00770016
               LENGTH=24,                                              X00780016
               POS=(8,1)                                                00790016
ADYSTXT  DFHMDF ATTRB=(UNPROT,NORM),                                   X00800033
               COLOR=GREEN,                                            X00810016
               HILIGHT=UNDERLINE,                                      X00820016
               LENGTH=17,                                              X00830016
               POS=(8,26)                                               00840016
         DFHMDF ATTRB=(ASKIP,DRK),                                     X00850016
               INITIAL=' ',                                            X00860016
               LENGTH=1,                                               X00870016
               POS=(8,44)                                               00880040
         DFHMDF ATTRB=(ASKIP),                                         X00890016
               INITIAL='(ROG, DOI, EOM, ETC.)',                        X00900016
               COLOR=NEUTRAL,                                          X00910016
               LENGTH=21,                                              X00920016
               POS=(8,51)                                               00930016
         DFHMDF ATTRB=(ASKIP),                                         X00940016
               INITIAL='SPECIAL TERMS..........:',                     X00950016
               COLOR=NEUTRAL,                                          X00960016
               LENGTH=24,                                              X00970016
               POS=(10,1)                                               00980016
ASPCTRM  DFHMDF ATTRB=(UNPROT,NORM),                                   X00990033
               COLOR=GREEN,                                            X01000016
               HILIGHT=UNDERLINE,                                      X01010016
               LENGTH=25,                                              X01020016
               POS=(10,26)                                              01030016
         DFHMDF ATTRB=(ASKIP,DRK),                                     X01040016
               INITIAL=' ',                                            X01050016
               LENGTH=1,                                               X01060016
               POS=(10,52)                                              01070016
         DFHMDF ATTRB=(ASKIP),                                         X01080016
               INITIAL='OPTION 1 - ENTER BOTH THE DISCOUNT DAYS',      X01090041
               COLOR=NEUTRAL,                                          X01100016
               LENGTH=39,                                              X01110042
               POS=(13,1)                                               01120016
         DFHMDF ATTRB=(ASKIP),                                         X01130016
               INITIAL='AND DISCOUNT PERCENT.  NET DUE DAYS',          X01140016
               COLOR=NEUTRAL,                                          X01150016
               LENGTH=35,                                              X01160016
               POS=(13,41)                                              01170044
         DFHMDF ATTRB=(ASKIP),                                         X01180016
               INITIAL='AND DUE DAYS FROM DATE TEXT ARE OPTIONAL.',    X01190016
               COLOR=NEUTRAL,                                          X01200016
               LENGTH=41,                                              X01210016
               POS=(14,12)                                              01220041
         DFHMDF ATTRB=(ASKIP),                                         X01230016
               INITIAL='OPTION 2 - ENTER THE NET DUE DAYS. DUE DAYS',  X01240041
               COLOR=NEUTRAL,                                          X01250016
               LENGTH=43,                                              X01260042
               POS=(16,1)                                               01270016
         DFHMDF ATTRB=(ASKIP),                                         X01280016
               INITIAL='FROM DATE TEXT IS OPTIONAL.',                  X01290016
               COLOR=NEUTRAL,                                          X01300016
               LENGTH=27,                                              X01310016
               POS=(16,45)                                              01320043
         DFHMDF ATTRB=(ASKIP),                                         X01330016
               INITIAL='OPTION 3 - ENTER ONLY THE SPECIAL TERMS.',     X01340016
               COLOR=NEUTRAL,                                          X01350016
               LENGTH=40,                                              X01360016
               POS=(18,1)                                               01370016
         DFHMSD TYPE=FINAL                                              01380016
         END                                                            01390016
