*          DATA SET VNKM032                                                     
  PRINT  NOGEN                                                                  
*******************************************************************-*           
*                                                                   *           
*        MAPSET  VNKM032                                            *           
*        MAP     VN032A                                             *           
*        PROGRAM VNKCS032                                           *           
*        TRANSID V032 - VENDOR RELATIONSHIPS INQUIRY SCREEN         *           
*        SYSTEM  CICS ARCHITECTURE                                  *           
*                                                                   *           
*******************************************************************-*           
VNKM032  DFHMSD TYPE=MAP,                                              X        
               CTRL=(FREEKB),                                          X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES                                                      
VN032A   DFHMDI SIZE=(19,080),                                         X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT),                                 X        
               LINE=02,                                                X        
               COLUMN=01                                                        
         DFHMDF POS=(02,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='VENDOR NAME........:'                                   
AVEND    DFHMDF POS=(02,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
         DFHMDF POS=(03,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='VENDOR ID..........:'                                   
AVNDID   DFHMDF POS=(03,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=009                                                       
         DFHMDF POS=(04,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='ENTITY ID..........:'                                   
AENTID   DFHMDF POS=(04,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=009                                                       
         DFHMDF POS=(06,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='RELATIONSHIP.......:'                                   
ARELATN  DFHMDF POS=(06,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
         DFHMDF POS=(07,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='RELATED ENTITY ID..:'                                   
ARENTID  DFHMDF POS=(07,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=009                                                       
         DFHMDF POS=(08,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='RELATED VENDOR ID..:'                                   
ARVNDID  DFHMDF POS=(08,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=009                                                       
         DFHMDF POS=(09,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='RELATED VENDOR NAME:'                                   
ARVNDNM  DFHMDF POS=(09,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
         DFHMDF POS=(11,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='EFFECTIVE DATE.....:'                                   
AEFFDT   DFHMDF POS=(11,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
         DFHMDF POS=(12,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='EXPIRATION DATE....:'                                   
AEXPDT   DFHMDF POS=(12,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
         DFHMDF POS=(14,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='DATE ADDED.........:'                                   
AADDDT   DFHMDF POS=(14,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
         DFHMDF POS=(15,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='LAST UPDATED BY....:'                                   
AUPDBY   DFHMDF POS=(15,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=008                                                       
         DFHMDF POS=(16,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=020,                                             X        
               INITIAL='LAST UPDATED ON....:'                                   
AUPDDT   DFHMDF POS=(16,023),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
