*          DATA SET VNKM016    AT LEVEL 001 AS OF 06/25/93                      
  PRINT  NOGEN                                                          00001   
*******************************************************************-*   00002   
*                                                                   *   00003   
*        MAPSET  VNKM016                                            *   00004   
*        MAP     VN016A                                             *   00005   
*        PROGRAM VNKCS016                                           *   00006   
*        TRANSID V016 - VENDOR ALIAS NAME ADD CHANGE DELETE         *   00007**2
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*******************************************************************-*   00010   
VNKM016  DFHMSD TYPE=MAP,                                              X00011   
               CTRL=(FREEKB),                                          X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               TIOAPFX=YES                                              00015   
VN016A   DFHMDI SIZE=(19,080),                                         X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT),                                 X00018   
               LINE=02,                                                X00019   
               COLUMN=01                                                00020   
         DFHMDF POS=(03,002),                                          X00021   
               COLOR=NEUTRAL,                                          X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               HILIGHT=OFF,                                            X00024   
               LENGTH=013,                                             X00025   
               INITIAL='      VENDOR:'                                  00026   
AVNNAME  DFHMDF POS=(03,016),                                          X00027   
               COLOR=BLUE,                                             X00028   
               ATTRB=(ASKIP,NORM),                                     X00029   
               HILIGHT=OFF,                                            X00030   
               LENGTH=030                                               00031   
         DFHMDF POS=(03,047),                                          X00032   
               ATTRB=(ASKIP),                                          X00033   
               LENGTH=001                                               00034   
*********************************************************************   00041   
         DFHMDF POS=(06,002),                                          X00049   
               COLOR=NEUTRAL,                                          X00050   
               ATTRB=(ASKIP,NORM),                                     X00051   
               LENGTH=005,                                             X00052   
               INITIAL='TYPE:'                                          00053   
AVNNMTP  DFHMDF POS=(06,008),                                          X00054   
               COLOR=GREEN,                                            X00055   
               ATTRB=(UNPROT,NORM),                                    X00056   
               HILIGHT=UNDERLINE,                                      X00057   
               LENGTH=02                                                00058   
         DFHMDF POS=(06,011),                                          X00059   
               ATTRB=(ASKIP),                                          X00060   
               LENGTH=001                                               00061   
         DFHMDF POS=(06,016),                                          X00062   
               COLOR=NEUTRAL,                                          X00063   
               ATTRB=(ASKIP,NORM),                                     X00064   
               LENGTH=032,                                             X00065**2
               INITIAL='(02=ALIAS 03=LABEL 05=LONG NAME)'               00066**2
*********************************************************************   00041   
         DFHMDF POS=(09,002),                                          X00035   
               COLOR=NEUTRAL,                                          X00036   
               ATTRB=(ASKIP,NORM),                                     X00037   
               HILIGHT=OFF,                                            X00038   
               LENGTH=005,                                             X00039   
               INITIAL='NAME:'                                          00040   
AVNANME  DFHMDF POS=(09,008),                                          X00041   
               COLOR=GREEN,                                            X00042   
               ATTRB=(UNPROT,NORM),                                    X00043   
               HILIGHT=UNDERLINE,                                      X00044   
               LENGTH=250                                               00045   
         DFHMDF POS=(12,019),                                          X00046   
               ATTRB=(ASKIP),                                          X00047   
               LENGTH=001                                               00048   
*********************************************************************   00041   
         DFHMSD TYPE=FINAL                                              00067   
         END                                                            00068   
