*          DATA SET VNKM001    AT LEVEL 005 AS OF 05/27/94                      
  PRINT  NOGEN                                                          00001   
*********************************************************************   00002   
*                                                                   *   00003   
*        MAPSET  VNKM001                                            *   00004   
*        MAP     VN001A                                             *   00005   
*        PROGRAM VNKCS001                                           *   00006   
*        TRANSID V001 - VENDOR CRITERIA SPEC                        *   00007   
*        SYSTEM  CICS ARCHITECTURE                                  *   00008   
*                                                                   *   00009   
*********************************************************************   00010   
VNKM001  DFHMSD TYPE=MAP,                                              X00011   
               CTRL=(FREEKB),                                          X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               TIOAPFX=YES                                              00015   
***************                                                                 
VN001A   DFHMDI SIZE=(19,080),                                         X00016   
               MAPATTS=(COLOR,HILIGHT),                                X00017   
               DSATTS=(COLOR,HILIGHT),                                 X00018   
               LINE=02,                                                X00019   
               COLUMN=01                                                00020   
***************                                                                 
         DFHMDF POS=(05,018),                                          X00021   
               COLOR=NEUTRAL,                                          X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               HILIGHT=OFF,                                            X00024   
               LENGTH=012,                                             X00025   
               INITIAL='VENDOR NAME:'                                   00026   
AVNNAME  DFHMDF POS=(05,031),                                          X00027   
               COLOR=GREEN,                                            X00028   
               ATTRB=(UNPROT,NORM,IC),                                 X00029   
               HILIGHT=UNDERLINE,                                      X00030   
               LENGTH=030                                               00031   
         DFHMDF POS=(05,062),                                          X00032   
               COLOR=NEUTRAL,                                          X00033   
               ATTRB=(ASKIP),                                          X00034   
               LENGTH=001                                               00035   
*                                                                               
         DFHMDF POS=(07,018),                                          X00036   
               COLOR=NEUTRAL,                                          X00037   
               ATTRB=(ASKIP,NORM),                                     X00038   
               HILIGHT=OFF,                                            X00039   
               LENGTH=012,                                             X00040   
               INITIAL='DEPARTMENT.:'                                   00041   
ADPTNBR  DFHMDF POS=(07,031),                                          X00042   
               COLOR=GREEN,                                            X00043   
               ATTRB=(UNPROT,NUM,NORM),                                X00044   
               HILIGHT=UNDERLINE,                                      X00045   
               LENGTH=003                                               00046   
         DFHMDF POS=(07,035),                                          X00047   
               COLOR=NEUTRAL,                                          X00048   
               ATTRB=(ASKIP),                                          X00049   
               LENGTH=001                                               00050   
*                                                                               
         DFHMDF POS=(09,018),                                          X00051   
               COLOR=NEUTRAL,                                          X00052   
               ATTRB=(ASKIP,NORM),                                     X00053   
               HILIGHT=OFF,                                            X00054   
               LENGTH=012,                                             X00055   
               INITIAL='INHOUSE....:'                                   00056   
AINHOUS  DFHMDF POS=(09,031),                                          X00057   
               COLOR=GREEN,                                            X00058   
               ATTRB=(UNPROT,NUM,NORM),                                X00059   
               HILIGHT=UNDERLINE,                                      X00060   
               LENGTH=003                                               00061   
         DFHMDF POS=(09,035),                                          X00062   
               COLOR=NEUTRAL,                                          X00063   
               ATTRB=(ASKIP),                                          X00064   
               LENGTH=001                                               00065   
*                                                                               
         DFHMDF POS=(11,018),                                          X00066**3
               COLOR=NEUTRAL,                                          X00067**3
               ATTRB=(ASKIP,NORM),                                     X00068**3
               HILIGHT=OFF,                                            X00069**3
               LENGTH=012,                                             X00070**3
               INITIAL='VENDOR TYPE:'                                   00071**3
AVNDTYP  DFHMDF POS=(11,031),                                          X00072**3
               COLOR=GREEN,                                            X00073**3
               ATTRB=(UNPROT,NORM),                                    X00074**3
               HILIGHT=UNDERLINE,                                      X00075**3
               LENGTH=001                                               00076**3
         DFHMDF POS=(11,033),                                          X00077**3
               COLOR=NEUTRAL,                                          X00078**3
               ATTRB=(ASKIP),                                          X00079**3
               LENGTH=001                                               00080**3
         DFHMDF POS=(11,038),                                          X00081**3
               COLOR=NEUTRAL,                                          X00082**3
               ATTRB=(ASKIP),                                          X00083**3
               LENGTH=037,                                             X00084**5
               INITIAL='(M-MERCHANDISE, E-EXPENSE, C-CARRIER)'          00085**5
*                                                                               
         DFHMDF POS=(12,038),                                          X00081**3
               COLOR=NEUTRAL,                                          X00082**3
               ATTRB=(ASKIP),                                          X00083**3
               LENGTH=020,                                             X00084**5
               INITIAL='(F-FACTOR, P-PARENT)'                           00085**5
*                                                                               
         DFHMDF POS=(13,018),                                          X00086**3
               COLOR=NEUTRAL,                                          X00087   
               ATTRB=(ASKIP,NORM),                                     X00088   
               HILIGHT=OFF,                                            X00089   
               LENGTH=012,                                             X00090   
               INITIAL='VENDOR NBR.:'                                   00091   
ADUNNBR  DFHMDF POS=(13,031),                                          X00092**3
               COLOR=GREEN,                                            X00093   
               ATTRB=(UNPROT,NUM,NORM),                                X00094   
               HILIGHT=UNDERLINE,                                      X00095   
               LENGTH=009                                               00096   
         DFHMDF POS=(13,041),                                          X00097**3
               COLOR=NEUTRAL,                                          X00098   
               ATTRB=(ASKIP),                                          X00099   
               LENGTH=001                                               00100   
*                                                                               
         DFHMDF POS=(15,018),                                          X00131**3
               COLOR=NEUTRAL,                                          X00132   
               ATTRB=(ASKIP,NORM),                                     X00133   
               HILIGHT=OFF,                                            X00134   
               LENGTH=012,                                             X00135   
               INITIAL='STATUS CODE:'                                   00136   
ASTATUS  DFHMDF POS=(15,031),                                          X00137**3
               COLOR=GREEN,                                            X00138   
               ATTRB=(UNPROT,NORM),                                    X00139   
               HILIGHT=UNDERLINE,                                      X00140   
               LENGTH=001                                               00141   
         DFHMDF POS=(15,033),                                          X00142**3
               COLOR=NEUTRAL,                                          X00143   
               ATTRB=(ASKIP),                                          X00144   
               LENGTH=001                                               00145   
         DFHMDF POS=(15,038),                                          X00146**3
               COLOR=NEUTRAL,                                          X00147   
               ATTRB=(ASKIP),                                          X00148   
               LENGTH=022,                                             X00149   
               INITIAL='(A-ACTIVE, I-INACTIVE)'                         00150   
*                                                                               
         DFHMSD TYPE=FINAL                                              00151   
         END                                                            00152   
