*          DATA SET VNKM005    AT LEVEL 005 AS OF 10/04/95                      
*          DATA SET VNKM005    AT LEVEL 001 AS OF 07/15/93              00001**1
VNKM005  DFHMSD TYPE=MAP,                                              X00002**1
               CTRL=(FREEKB),                                          X00003**1
               LANG=COBOL,                                             X00004**1
               MODE=INOUT,                                             X00005**1
               TIOAPFX=YES                                              00006**1
VN005A   DFHMDI SIZE=(19,080),                                         X00007**1
               MAPATTS=(COLOR,HILIGHT),                                X00008**1
               DSATTS=(COLOR,HILIGHT),                                 X00009**1
               LINE=02,                                                X00010**1
               COLUMN=01                                                00011**1
         DFHMDF POS=(02,001),                                          X00012**1
               COLOR=NEUTRAL,                                          X00013**1
               ATTRB=(ASKIP,NORM),                                     X00014**1
               LENGTH=005,                                             X00015**1
               INITIAL='VEND:'                                          00016**1
AVEND    DFHMDF POS=(02,007),                                          X00017**1
               COLOR=BLUE,                                             X00018**1
               ATTRB=(ASKIP,NORM),                                     X00019**1
               LENGTH=030                                               00020**1
         DFHMDF POS=(02,044),                                          X00021**1
               COLOR=NEUTRAL,                                          X00022**1
               ATTRB=(ASKIP,NORM),                                     X00023**1
               LENGTH=005,                                             X00024**1
               INITIAL='ITEMS'                                          00025**1
ASTRTIT  DFHMDF POS=(02,050),                                          X00026**1
               COLOR=GREEN,                                            X00027**1
               ATTRB=(UNPROT,NUM,NORM),                                X00028**1
               HILIGHT=UNDERLINE,                                      X00029**1
               LENGTH=007,                                             X00030**1
               PICOUT='ZZZ,ZZ9'                                         00031**1
         DFHMDF POS=(02,058),                                          X00032**1
               COLOR=NEUTRAL,                                          X00033**1
               ATTRB=(ASKIP,NORM),                                     X00034**1
               LENGTH=002,                                             X00035**1
               INITIAL='TO'                                             00036**1
AENDIT   DFHMDF POS=(02,061),                                          X00037**1
               COLOR=BLUE,                                             X00038**1
               ATTRB=(ASKIP,NORM),                                     X00039**1
               LENGTH=007,                                             X00040**1
               PICOUT='ZZZ,ZZ9'                                         00041**1
         DFHMDF POS=(02,069),                                          X00042**1
               COLOR=NEUTRAL,                                          X00043**1
               ATTRB=(ASKIP,NORM),                                     X00044**1
               LENGTH=002,                                             X00045**1
               INITIAL='OF'                                             00046**1
ATOTIT   DFHMDF POS=(02,072),                                          X00047**1
               COLOR=BLUE,                                             X00048**1
               ATTRB=(ASKIP,NORM),                                     X00049**1
               LENGTH=007,                                             X00050**1
               PICOUT='ZZZ,ZZ9'                                         00051**1
         DFHMDF POS=(04,001),                                          X00052**1
               COLOR=NEUTRAL,                                          X00053**1
               ATTRB=(ASKIP,NORM),                                     X00054**1
               LENGTH=004,                                             X00055**1
               INITIAL='SEL '                                           00056**1
         DFHMDF POS=(04,006),                                          X00057**1
               COLOR=NEUTRAL,                                          X00058**1
               ATTRB=(ASKIP,NORM),                                     X00059**1
               LENGTH=003,                                             X00060**1
               INITIAL='ACT'                                            00061**1
         DFHMDF POS=(04,014),                                          X00062**1
               COLOR=NEUTRAL,                                          X00063**1
               ATTRB=(ASKIP,NORM),                                     X00064**1
               LENGTH=013,                                             X00065**1
               INITIAL='FUNCTION NAME'                                  00066**1
         DFHMDF POS=(04,041),                                          X00067**4
               COLOR=NEUTRAL,                                          X00068**1
               ATTRB=(ASKIP,NORM),                                     X00069**1
               LENGTH=017,                                             X00070**1
               INITIAL='ADDRESS/REP COUNT'                              00071**1
         DFHMDF POS=(04,064),                                          X00072**1
               COLOR=NEUTRAL,                                          X00073**1
               ATTRB=(ASKIP,NORM),                                     X00074**1
               LENGTH=006,                                             X00075**1
               INITIAL='UPDATE'                                         00076**1
ASEL01   DFHMDF POS=(05,002),                                          X00077**1
               COLOR=GREEN,                                            X00078**1
               ATTRB=(UNPROT,NORM),                                    X00079**1
               HILIGHT=UNDERLINE,                                      X00080**1
               LENGTH=001                                               00081**1
         DFHMDF POS=(05,004),                                          X00082**1
               ATTRB=(ASKIP),                                          X00083**1
               LENGTH=001                                               00084**1
AACT01   DFHMDF POS=(05,006),                                          X00085**1
               COLOR=BLUE,                                             X00086**1
               ATTRB=(ASKIP,NORM),                                     X00087**1
               LENGTH=003                                               00088**1
AFNME01  DFHMDF POS=(05,010),                                          X00089**1
               COLOR=BLUE,                                             X00090**1
               ATTRB=(ASKIP,NORM),                                     X00091**1
               LENGTH=025                                               00092**1
ACNT01   DFHMDF POS=(05,047),                                          X00093**4
               COLOR=BLUE,                                             X00094**1
               ATTRB=(ASKIP,NORM),                                     X00095**1
               LENGTH=003,                                             X00096**1
               PICOUT='ZZ9'                                             00097**1
AUPDT01  DFHMDF POS=(05,066),                                          X00098**2
               COLOR=BLUE,                                             X00099**2
               ATTRB=(ASKIP,NORM),                                     X00100**2
               LENGTH=001                                               00101**3
         DFHMDF POS=(05,068),                                          X00102**4
               ATTRB=(ASKIP),                                          X00103**4
               LENGTH=001                                               00104**4
ASEL02   DFHMDF POS=(06,002),                                          X00105**1
               COLOR=GREEN,                                            X00106**1
               ATTRB=(UNPROT,NORM),                                    X00107**1
               HILIGHT=UNDERLINE,                                      X00108**1
               LENGTH=001                                               00109**1
         DFHMDF POS=(06,004),                                          X00110**1
               ATTRB=(ASKIP),                                          X00111**1
               LENGTH=001                                               00112**1
AACT02   DFHMDF POS=(06,006),                                          X00113**1
               COLOR=BLUE,                                             X00114**1
               ATTRB=(ASKIP,NORM),                                     X00115**1
               LENGTH=003                                               00116**1
AFNME02  DFHMDF POS=(06,010),                                          X00117**1
               COLOR=BLUE,                                             X00118**1
               ATTRB=(ASKIP,NORM),                                     X00119**1
               LENGTH=025                                               00120**1
ACNT02   DFHMDF POS=(06,047),                                          X00121**4
               COLOR=BLUE,                                             X00122**1
               ATTRB=(ASKIP,NORM),                                     X00123**1
               LENGTH=003,                                             X00124**1
               PICOUT='ZZ9'                                             00125**1
AUPDT02  DFHMDF POS=(06,066),                                          X00126**2
               COLOR=BLUE,                                             X00127**2
               ATTRB=(ASKIP,NORM),                                     X00128**2
               LENGTH=001                                               00129**3
         DFHMDF POS=(06,068),                                          X00130**5
               ATTRB=(ASKIP),                                          X00131**5
               LENGTH=001                                               00132**5
ASEL03   DFHMDF POS=(07,002),                                          X00133**1
               COLOR=GREEN,                                            X00134**1
               ATTRB=(UNPROT,NORM),                                    X00135**1
               HILIGHT=UNDERLINE,                                      X00136**1
               LENGTH=001                                               00137**1
         DFHMDF POS=(07,004),                                          X00138**1
               ATTRB=(ASKIP),                                          X00139**1
               LENGTH=001                                               00140**1
AACT03   DFHMDF POS=(07,006),                                          X00141**1
               COLOR=BLUE,                                             X00142**1
               ATTRB=(ASKIP,NORM),                                     X00143**1
               LENGTH=003                                               00144**1
AFNME03  DFHMDF POS=(07,010),                                          X00145**1
               COLOR=BLUE,                                             X00146**1
               ATTRB=(ASKIP,NORM),                                     X00147**1
               LENGTH=025                                               00148**1
ACNT03   DFHMDF POS=(07,047),                                          X00149**4
               COLOR=BLUE,                                             X00150**1
               ATTRB=(ASKIP,NORM),                                     X00151**1
               LENGTH=003,                                             X00152**1
               PICOUT='ZZ9'                                             00153**1
AUPDT03  DFHMDF POS=(07,066),                                          X00154**2
               COLOR=BLUE,                                             X00155**2
               ATTRB=(ASKIP,NORM),                                     X00156**2
               LENGTH=001                                               00157**3
         DFHMDF POS=(07,068),                                          X00158**4
               ATTRB=(ASKIP),                                          X00159**4
               LENGTH=001                                               00160**4
ASEL04   DFHMDF POS=(08,002),                                          X00161**1
               COLOR=GREEN,                                            X00162**1
               ATTRB=(UNPROT,NORM),                                    X00163**1
               HILIGHT=UNDERLINE,                                      X00164**1
               LENGTH=001                                               00165**1
         DFHMDF POS=(08,004),                                          X00166**1
               ATTRB=(ASKIP),                                          X00167**1
               LENGTH=001                                               00168**1
AACT04   DFHMDF POS=(08,006),                                          X00169**1
               COLOR=BLUE,                                             X00170**1
               ATTRB=(ASKIP,NORM),                                     X00171**1
               LENGTH=003                                               00172**1
AFNME04  DFHMDF POS=(08,010),                                          X00173**1
               COLOR=BLUE,                                             X00174**1
               ATTRB=(ASKIP,NORM),                                     X00175**1
               LENGTH=025                                               00176**1
ACNT04   DFHMDF POS=(08,047),                                          X00177**4
               COLOR=BLUE,                                             X00178**1
               ATTRB=(ASKIP,NORM),                                     X00179**1
               LENGTH=003,                                             X00180**1
               PICOUT='ZZ9'                                             00181**1
AUPDT04  DFHMDF POS=(08,066),                                          X00182**2
               COLOR=BLUE,                                             X00183**2
               ATTRB=(ASKIP,NORM),                                     X00184**2
               LENGTH=001                                               00185**3
         DFHMDF POS=(08,068),                                          X00186**4
               ATTRB=(ASKIP),                                          X00187**4
               LENGTH=001                                               00188**4
ASEL05   DFHMDF POS=(09,002),                                          X00189**1
               COLOR=GREEN,                                            X00190**1
               ATTRB=(UNPROT,NORM),                                    X00191**1
               HILIGHT=UNDERLINE,                                      X00192**1
               LENGTH=001                                               00193**1
         DFHMDF POS=(09,004),                                          X00194**1
               ATTRB=(ASKIP),                                          X00195**1
               LENGTH=001                                               00196**1
AACT05   DFHMDF POS=(09,006),                                          X00197**1
               COLOR=BLUE,                                             X00198**1
               ATTRB=(ASKIP,NORM),                                     X00199**1
               LENGTH=003                                               00200**1
AFNME05  DFHMDF POS=(09,010),                                          X00201**1
               COLOR=BLUE,                                             X00202**1
               ATTRB=(ASKIP,NORM),                                     X00203**1
               LENGTH=025                                               00204**1
ACNT05   DFHMDF POS=(09,047),                                          X00205**4
               COLOR=BLUE,                                             X00206**1
               ATTRB=(ASKIP,NORM),                                     X00207**1
               LENGTH=003,                                             X00208**1
               PICOUT='ZZ9'                                             00209**1
AUPDT05  DFHMDF POS=(09,066),                                          X00210**2
               COLOR=BLUE,                                             X00211**2
               ATTRB=(ASKIP,NORM),                                     X00212**2
               LENGTH=001                                               00213**3
         DFHMDF POS=(09,068),                                          X00214**4
               ATTRB=(ASKIP),                                          X00215**4
               LENGTH=001                                               00216**4
ASEL06   DFHMDF POS=(10,002),                                          X00217**1
               COLOR=GREEN,                                            X00218**1
               ATTRB=(UNPROT,NORM),                                    X00219**1
               HILIGHT=UNDERLINE,                                      X00220**1
               LENGTH=001                                               00221**1
         DFHMDF POS=(10,004),                                          X00222**1
               ATTRB=(ASKIP),                                          X00223**1
               LENGTH=001                                               00224**1
AACT06   DFHMDF POS=(10,006),                                          X00225**1
               COLOR=BLUE,                                             X00226**1
               ATTRB=(ASKIP,NORM),                                     X00227**1
               LENGTH=003                                               00228**1
AFNME06  DFHMDF POS=(10,010),                                          X00229**1
               COLOR=BLUE,                                             X00230**1
               ATTRB=(ASKIP,NORM),                                     X00231**1
               LENGTH=025                                               00232**1
ACNT06   DFHMDF POS=(10,047),                                          X00233**4
               COLOR=BLUE,                                             X00234**1
               ATTRB=(ASKIP,NORM),                                     X00235**1
               LENGTH=003,                                             X00236**1
               PICOUT='ZZ9'                                             00237**1
AUPDT06  DFHMDF POS=(10,066),                                          X00238**2
               COLOR=BLUE,                                             X00239**2
               ATTRB=(ASKIP,NORM),                                     X00240**2
               LENGTH=001                                               00241**3
         DFHMDF POS=(10,068),                                          X00242**4
               ATTRB=(ASKIP),                                          X00243**4
               LENGTH=001                                               00244**4
ASEL07   DFHMDF POS=(11,002),                                          X00245**1
               COLOR=GREEN,                                            X00246**1
               ATTRB=(UNPROT,NORM),                                    X00247**1
               HILIGHT=UNDERLINE,                                      X00248**1
               LENGTH=001                                               00249**1
         DFHMDF POS=(11,004),                                          X00250**1
               ATTRB=(ASKIP),                                          X00251**1
               LENGTH=001                                               00252**1
AACT07   DFHMDF POS=(11,006),                                          X00253**1
               COLOR=BLUE,                                             X00254**1
               ATTRB=(ASKIP,NORM),                                     X00255**1
               LENGTH=003                                               00256**1
AFNME07  DFHMDF POS=(11,010),                                          X00257**1
               COLOR=BLUE,                                             X00258**1
               ATTRB=(ASKIP,NORM),                                     X00259**1
               LENGTH=025                                               00260**1
ACNT07   DFHMDF POS=(11,047),                                          X00261**4
               COLOR=BLUE,                                             X00262**1
               ATTRB=(ASKIP,NORM),                                     X00263**1
               LENGTH=003,                                             X00264**1
               PICOUT='ZZ9'                                             00265**1
AUPDT07  DFHMDF POS=(11,066),                                          X00266**2
               COLOR=BLUE,                                             X00267**2
               ATTRB=(ASKIP,NORM),                                     X00268**2
               LENGTH=001                                               00269**3
         DFHMDF POS=(11,068),                                          X00270**4
               ATTRB=(ASKIP),                                          X00271**4
               LENGTH=001                                               00272**4
ASEL08   DFHMDF POS=(12,002),                                          X00273**1
               COLOR=GREEN,                                            X00274**1
               ATTRB=(UNPROT,NORM),                                    X00275**1
               HILIGHT=UNDERLINE,                                      X00276**1
               LENGTH=001                                               00277**1
         DFHMDF POS=(12,004),                                          X00278**1
               ATTRB=(ASKIP),                                          X00279**1
               LENGTH=001                                               00280**1
AACT08   DFHMDF POS=(12,006),                                          X00281**1
               COLOR=BLUE,                                             X00282**1
               ATTRB=(ASKIP,NORM),                                     X00283**1
               LENGTH=003                                               00284**1
AFNME08  DFHMDF POS=(12,010),                                          X00285**1
               COLOR=BLUE,                                             X00286**1
               ATTRB=(ASKIP,NORM),                                     X00287**1
               LENGTH=025                                               00288**1
ACNT08   DFHMDF POS=(12,047),                                          X00289**4
               COLOR=BLUE,                                             X00290**1
               ATTRB=(ASKIP,NORM),                                     X00291**1
               LENGTH=003,                                             X00292**1
               PICOUT='ZZ9'                                             00293**1
AUPDT08  DFHMDF POS=(12,066),                                          X00294**2
               COLOR=BLUE,                                             X00295**2
               ATTRB=(ASKIP,NORM),                                     X00296**2
               LENGTH=001                                               00297**3
         DFHMDF POS=(12,068),                                          X00298**4
               ATTRB=(ASKIP),                                          X00299**4
               LENGTH=001                                               00300**4
ASEL09   DFHMDF POS=(13,002),                                          X00301**1
               COLOR=GREEN,                                            X00302**1
               ATTRB=(UNPROT,NORM),                                    X00303**1
               HILIGHT=UNDERLINE,                                      X00304**1
               LENGTH=001                                               00305**1
         DFHMDF POS=(13,004),                                          X00306**1
               ATTRB=(ASKIP),                                          X00307**1
               LENGTH=001                                               00308**1
AACT09   DFHMDF POS=(13,006),                                          X00309**1
               COLOR=BLUE,                                             X00310**1
               ATTRB=(ASKIP,NORM),                                     X00311**1
               LENGTH=003                                               00312**1
AFNME09  DFHMDF POS=(13,010),                                          X00313**1
               COLOR=BLUE,                                             X00314**1
               ATTRB=(ASKIP,NORM),                                     X00315**1
               LENGTH=025                                               00316**1
ACNT09   DFHMDF POS=(13,047),                                          X00317**4
               COLOR=BLUE,                                             X00318**1
               ATTRB=(ASKIP,NORM),                                     X00319**1
               LENGTH=003,                                             X00320**1
               PICOUT='ZZ9'                                             00321**1
AUPDT09  DFHMDF POS=(13,066),                                          X00322**2
               COLOR=BLUE,                                             X00323**2
               ATTRB=(ASKIP,NORM),                                     X00324**2
               LENGTH=001                                               00325**3
         DFHMDF POS=(13,068),                                          X00326**4
               ATTRB=(ASKIP),                                          X00327**4
               LENGTH=001                                               00328**4
ASEL10   DFHMDF POS=(14,002),                                          X00329**1
               COLOR=GREEN,                                            X00330**1
               ATTRB=(UNPROT,NORM),                                    X00331**1
               HILIGHT=UNDERLINE,                                      X00332**1
               LENGTH=001                                               00333**1
         DFHMDF POS=(14,004),                                          X00334**1
               ATTRB=(ASKIP),                                          X00335**1
               LENGTH=001                                               00336**1
AACT10   DFHMDF POS=(14,006),                                          X00337**1
               COLOR=BLUE,                                             X00338**1
               ATTRB=(ASKIP,NORM),                                     X00339**1
               LENGTH=003                                               00340**1
AFNME10  DFHMDF POS=(14,010),                                          X00341**1
               COLOR=BLUE,                                             X00342**1
               ATTRB=(ASKIP,NORM),                                     X00343**1
               LENGTH=025                                               00344**1
ACNT10   DFHMDF POS=(14,047),                                          X00345**4
               COLOR=BLUE,                                             X00346**1
               ATTRB=(ASKIP,NORM),                                     X00347**1
               LENGTH=003,                                             X00348**1
               PICOUT='ZZ9'                                             00349**1
AUPDT10  DFHMDF POS=(14,066),                                          X00350**2
               COLOR=BLUE,                                             X00351**2
               ATTRB=(ASKIP,NORM),                                     X00352**2
               LENGTH=001                                               00353**3
         DFHMDF POS=(14,068),                                          X00354**4
               ATTRB=(ASKIP),                                          X00355**4
               LENGTH=001                                               00356**4
ASEL11   DFHMDF POS=(15,002),                                          X00357**1
               COLOR=GREEN,                                            X00358**1
               ATTRB=(UNPROT,NORM),                                    X00359**1
               HILIGHT=UNDERLINE,                                      X00360**1
               LENGTH=001                                               00361**1
         DFHMDF POS=(15,004),                                          X00362**1
               ATTRB=(ASKIP),                                          X00363**1
               LENGTH=001                                               00364**1
AACT11   DFHMDF POS=(15,006),                                          X00365**1
               COLOR=BLUE,                                             X00366**1
               ATTRB=(ASKIP,NORM),                                     X00367**1
               LENGTH=003                                               00368**1
AFNME11  DFHMDF POS=(15,010),                                          X00369**1
               COLOR=BLUE,                                             X00370**1
               ATTRB=(ASKIP,NORM),                                     X00371**1
               LENGTH=025                                               00372**1
ACNT11   DFHMDF POS=(15,047),                                          X00373**4
               COLOR=BLUE,                                             X00374**1
               ATTRB=(ASKIP,NORM),                                     X00375**1
               LENGTH=003,                                             X00376**1
               PICOUT='ZZ9'                                             00377**1
AUPDT11  DFHMDF POS=(15,066),                                          X00378**2
               COLOR=BLUE,                                             X00379**2
               ATTRB=(ASKIP,NORM),                                     X00380**2
               LENGTH=001                                               00381**3
         DFHMDF POS=(15,068),                                          X00382**5
               ATTRB=(ASKIP),                                          X00383**4
               LENGTH=001                                               00384**4
ASEL12   DFHMDF POS=(16,002),                                          X00385**1
               COLOR=GREEN,                                            X00386**1
               ATTRB=(UNPROT,NORM),                                    X00387**1
               HILIGHT=UNDERLINE,                                      X00388**1
               LENGTH=001                                               00389**1
         DFHMDF POS=(16,004),                                          X00390**1
               ATTRB=(ASKIP),                                          X00391**1
               LENGTH=001                                               00392**1
AACT12   DFHMDF POS=(16,006),                                          X00393**1
               COLOR=BLUE,                                             X00394**1
               ATTRB=(ASKIP,NORM),                                     X00395**1
               LENGTH=003                                               00396**1
AFNME12  DFHMDF POS=(16,010),                                          X00397**1
               COLOR=BLUE,                                             X00398**1
               ATTRB=(ASKIP,NORM),                                     X00399**1
               LENGTH=025                                               00400**1
ACNT12   DFHMDF POS=(16,047),                                          X00401**4
               COLOR=BLUE,                                             X00402**1
               ATTRB=(ASKIP,NORM),                                     X00403**1
               LENGTH=003,                                             X00404**1
               PICOUT='ZZ9'                                             00405**1
AUPDT12  DFHMDF POS=(16,066),                                          X00406**2
               COLOR=BLUE,                                             X00407**2
               ATTRB=(ASKIP,NORM),                                     X00408**2
               LENGTH=001                                               00409**3
         DFHMDF POS=(16,068),                                          X00410**4
               ATTRB=(ASKIP),                                          X00411**4
               LENGTH=001                                               00412**4
ASEL13   DFHMDF POS=(17,002),                                          X00413**1
               COLOR=GREEN,                                            X00414**1
               ATTRB=(UNPROT,NORM),                                    X00415**1
               HILIGHT=UNDERLINE,                                      X00416**1
               LENGTH=001                                               00417**1
         DFHMDF POS=(17,004),                                          X00418**1
               ATTRB=(ASKIP),                                          X00419**1
               LENGTH=001                                               00420**1
AACT13   DFHMDF POS=(17,006),                                          X00421**1
               COLOR=BLUE,                                             X00422**1
               ATTRB=(ASKIP,NORM),                                     X00423**1
               LENGTH=003                                               00424**1
AFNME13  DFHMDF POS=(17,010),                                          X00425**1
               COLOR=BLUE,                                             X00426**1
               ATTRB=(ASKIP,NORM),                                     X00427**1
               LENGTH=025                                               00428**1
ACNT13   DFHMDF POS=(17,047),                                          X00429**4
               COLOR=BLUE,                                             X00430**1
               ATTRB=(ASKIP,NORM),                                     X00431**1
               LENGTH=003,                                             X00432**1
               PICOUT='ZZ9'                                             00433**1
AUPDT13  DFHMDF POS=(17,066),                                          X00434**2
               COLOR=BLUE,                                             X00435**2
               ATTRB=(ASKIP,NORM),                                     X00436**2
               LENGTH=001                                               00437**3
         DFHMDF POS=(17,068),                                          X00438**4
               ATTRB=(ASKIP),                                          X00439**4
               LENGTH=001                                               00440**4
ASEL14   DFHMDF POS=(18,002),                                          X00441**1
               COLOR=GREEN,                                            X00442**1
               ATTRB=(UNPROT,NORM),                                    X00443**1
               HILIGHT=UNDERLINE,                                      X00444**1
               LENGTH=001                                               00445**1
         DFHMDF POS=(18,004),                                          X00446**1
               ATTRB=(ASKIP),                                          X00447**1
               LENGTH=001                                               00448**1
AACT14   DFHMDF POS=(18,006),                                          X00449**1
               COLOR=BLUE,                                             X00450**1
               ATTRB=(ASKIP,NORM),                                     X00451**1
               LENGTH=003                                               00452**1
AFNME14  DFHMDF POS=(18,010),                                          X00453**1
               COLOR=BLUE,                                             X00454**1
               ATTRB=(ASKIP,NORM),                                     X00455**1
               LENGTH=025                                               00456**1
ACNT14   DFHMDF POS=(18,047),                                          X00457**4
               COLOR=BLUE,                                             X00458**1
               ATTRB=(ASKIP,NORM),                                     X00459**1
               LENGTH=003,                                             X00460**1
               PICOUT='ZZ9'                                             00461**1
AUPDT14  DFHMDF POS=(18,066),                                          X00462**2
               COLOR=BLUE,                                             X00463**2
               ATTRB=(ASKIP,NORM),                                     X00464**2
               LENGTH=001                                               00465**3
         DFHMDF POS=(18,068),                                          X00466**4
               ATTRB=(ASKIP),                                          X00467**4
               LENGTH=001                                               00468**4
         DFHMDF POS=(19,045),                                          X00469**1
               COLOR=NEUTRAL,                                          X00470**1
               ATTRB=(ASKIP,NORM),                                     X00471**1
               LENGTH=026,                                             X00472**1
               INITIAL='NUMBER OF SELECTED ITEMS: '                     00473**1
ASELIT   DFHMDF POS=(19,072),                                          X00474**1
               COLOR=BLUE,                                             X00475**1
               ATTRB=(ASKIP,NORM),                                     X00476**1
               LENGTH=007,                                             X00477**1
               PICOUT='ZZZ,ZZ9'                                         00478**1
         DFHMSD TYPE=FINAL                                              00479**1
         END                                                            00480**1
