*          DATA SET VNKM010    AT LEVEL 004 AS OF 09/29/95                      
*          DATA SET VNKM010    AT LEVEL 001 AS OF 07/08/93              00001   
VNKM010  DFHMSD TYPE=MAP,                                              X00002   
               CTRL=(FREEKB),                                          X00003   
               LANG=COBOL,                                             X00004   
               MODE=INOUT,                                             X00005   
               TIOAPFX=YES                                              00006   
VN010A   DFHMDI SIZE=(19,080),                                         X00007   
               MAPATTS=(COLOR,HILIGHT),                                X00008   
               DSATTS=(COLOR,HILIGHT),                                 X00009   
               LINE=02,                                                X00010   
               COLUMN=01                                                00011   
*                                                                               
         DFHMDF POS=(02,001),                                          X00012   
               COLOR=NEUTRAL,                                          X00013   
               ATTRB=(ASKIP,NORM),                                     X00014   
               LENGTH=010,                                             X00015**2
               INITIAL='VENDOR...:'                                     00016**4
AVNNAME  DFHMDF POS=(02,012),                                          X00017**2
               COLOR=BLUE,                                             X00018   
               ATTRB=(ASKIP,NORM),                                     X00019   
               LENGTH=030                                               00020**2
         DFHMDF POS=(02,044),                                          X00021   
               COLOR=NEUTRAL,                                          X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               LENGTH=009,                                             X00024   
               INITIAL='FUNCTION:'                                      00025   
AFUNCNM  DFHMDF POS=(02,054),                                          X00026   
               COLOR=BLUE,                                             X00027   
               ATTRB=(ASKIP,NORM),                                     X00028   
               LENGTH=024                                               00029   
*                                                                       00030**2
         DFHMDF POS=(03,001),                                          X00031**2
               COLOR=NEUTRAL,                                          X00032**2
               ATTRB=(ASKIP,NORM),                                     X00033**2
               LENGTH=010,                                             X00034**2
               INITIAL='VENDOR NO:'                                     00035**2
ADUNS    DFHMDF POS=(03,012),                                          X00036**3
               COLOR=BLUE,                                             X00037   
               ATTRB=(ASKIP,NORM),                                     X00038   
               LENGTH=009                                               00039**2
         DFHMDF POS=(03,023),                                          X00144**2
               COLOR=NEUTRAL,                                          X00145   
               ATTRB=(ASKIP,NORM),                                     X00146   
               LENGTH=014,                                             X00147   
               INITIAL='PRIM ADDR IND:'                                 00148   
APMADIN  DFHMDF POS=(03,039),                                          X00040**2
               COLOR=BLUE,                                             X00041**2
               ATTRB=(ASKIP,NORM),                                     X00042**2
               LENGTH=001                                               00043**2
         DFHMDF POS=(03,041),                                          X00144**2
               COLOR=NEUTRAL,                                          X00145   
               ATTRB=(ASKIP,NORM),                                     X00146   
               LENGTH=012,                                             X00147   
               INITIAL='LAST UPDATE:'                                   00148   
AUPDT    DFHMDF POS=(03,054),                                          X00149**2
               COLOR=BLUE,                                             X00150   
               ATTRB=(ASKIP,NORM),                                     X00151   
               LENGTH=010                                               00152   
         DFHMDF POS=(03,065),                                          X00153**2
               COLOR=NEUTRAL,                                          X00154   
               ATTRB=(ASKIP),                                          X00155   
               LENGTH=001                                               00156   
         DFHMDF POS=(03,067),                                          X00157**2
               COLOR=NEUTRAL,                                          X00158   
               ATTRB=(ASKIP,NORM),                                     X00159   
               LENGTH=003,                                             X00160   
               INITIAL='ID:'                                            00161   
AUPID    DFHMDF POS=(03,071),                                          X00162**2
               COLOR=BLUE,                                             X00163   
               ATTRB=(ASKIP,NORM),                                     X00164   
               LENGTH=008                                               00165   
         DFHMDF POS=(03,080),                                          X00166**2
               COLOR=NEUTRAL,                                          X00167   
               ATTRB=(ASKIP),                                          X00168   
               LENGTH=001                                               00169   
*                                                                       00043**2
         DFHMDF POS=(04,003),                                          X00044**2
               COLOR=NEUTRAL,                                          X00045**2
               ATTRB=(ASKIP,NORM),                                     X00046**2
               LENGTH=011,                                             X00047**2
               INITIAL='FIRST NAME:'                                    00048**2
AFNAME   DFHMDF POS=(04,015),                                          X00049**2
               COLOR=BLUE,                                             X00050**2
               ATTRB=(ASKIP,NORM),                                     X00051**2
               LENGTH=015                                               00052**2
         DFHMDF POS=(04,031),                                          X00053**2
               COLOR=NEUTRAL,                                          X00054**2
               ATTRB=(ASKIP,NORM),                                     X00055**2
               LENGTH=010,                                             X00056**2
               INITIAL='LAST NAME:'                                     00057**2
ALNAME   DFHMDF POS=(04,042),                                          X00058**2
               COLOR=BLUE,                                             X00059   
               ATTRB=(ASKIP,NORM),                                     X00060   
               LENGTH=015                                               00061   
         DFHMDF POS=(04,058),                                          X00062**2
               COLOR=NEUTRAL,                                          X00063   
               ATTRB=(ASKIP),                                          X00064   
               LENGTH=001                                               00065   
*                                                                               
         DFHMDF POS=(05,003),                                          X00066**2
               COLOR=NEUTRAL,                                          X00067   
               ATTRB=(ASKIP,NORM),                                     X00068   
               LENGTH=011,                                             X00069   
               INITIAL='TITLE.....:'                                    00070   
ATITLE   DFHMDF POS=(05,015),                                          X00071**2
               COLOR=BLUE,                                             X00072   
               ATTRB=(ASKIP,NORM),                                     X00073   
               LENGTH=035                                               00074   
         DFHMDF POS=(05,051),                                          X00075**2
               COLOR=NEUTRAL,                                          X00076   
               ATTRB=(ASKIP),                                          X00077   
               LENGTH=001                                               00078   
*                                                                               
         DFHMDF POS=(06,003),                                          X00079**2
               COLOR=NEUTRAL,                                          X00080   
               ATTRB=(ASKIP,NORM),                                     X00081   
               LENGTH=011,                                             X00082   
               INITIAL='PHONE1....:'                                    00083   
APHONE1  DFHMDF POS=(06,015),                                          X00084**2
               COLOR=BLUE,                                             X00085   
               ATTRB=(ASKIP,NORM),                                     X00086   
               LENGTH=018                                               00087   
         DFHMDF POS=(06,034),                                          X00088**2
               COLOR=NEUTRAL,                                          X00089   
               ATTRB=(ASKIP),                                          X00090   
               LENGTH=001                                               00091   
         DFHMDF POS=(06,037),                                          X00092**2
               COLOR=NEUTRAL,                                          X00093   
               ATTRB=(ASKIP,NORM),                                     X00094   
               LENGTH=004,                                             X00095   
               INITIAL='EXT:'                                           00096   
AEXT1    DFHMDF POS=(06,042),                                          X00097**2
               COLOR=BLUE,                                             X00098   
               ATTRB=(ASKIP,NORM),                                     X00099   
               LENGTH=004                                               00100   
         DFHMDF POS=(06,047),                                          X00101**2
               COLOR=NEUTRAL,                                          X00102   
               ATTRB=(ASKIP),                                          X00103   
               LENGTH=001                                               00104   
         DFHMDF POS=(06,049),                                          X00092**2
               COLOR=NEUTRAL,                                          X00093   
               ATTRB=(ASKIP,NORM),                                     X00094   
               LENGTH=019,                                             X00095   
               INITIAL='COUNTRY PHONE CODE:'                            00096   
ACPC1    DFHMDF POS=(06,069),                                          X00097**2
               COLOR=BLUE,                                             X00098   
               ATTRB=(ASKIP,NORM),                                     X00099   
               LENGTH=003                                               00100   
         DFHMDF POS=(06,073),                                          X00101**2
               COLOR=NEUTRAL,                                          X00102   
               ATTRB=(ASKIP),                                          X00103   
               LENGTH=001                                               00104   
*                                                                               
         DFHMDF POS=(07,003),                                          X00105**2
               COLOR=NEUTRAL,                                          X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               LENGTH=011,                                             X00108   
               INITIAL='PHONE2....:'                                    00109   
APHONE2  DFHMDF POS=(07,015),                                          X00110**2
               COLOR=BLUE,                                             X00111   
               ATTRB=(ASKIP,NORM),                                     X00112   
               LENGTH=018                                               00113   
         DFHMDF POS=(07,034),                                          X00114**2
               COLOR=NEUTRAL,                                          X00115   
               ATTRB=(ASKIP),                                          X00116   
               LENGTH=001                                               00117   
         DFHMDF POS=(07,037),                                          X00118**2
               COLOR=NEUTRAL,                                          X00119   
               ATTRB=(ASKIP,NORM),                                     X00120   
               LENGTH=004,                                             X00121   
               INITIAL='EXT:'                                           00122   
AEXT2    DFHMDF POS=(07,042),                                          X00123**2
               COLOR=BLUE,                                             X00124   
               ATTRB=(ASKIP,NORM),                                     X00125   
               LENGTH=004                                               00126   
         DFHMDF POS=(07,047),                                          X00127**2
               COLOR=NEUTRAL,                                          X00128   
               ATTRB=(ASKIP),                                          X00129   
               LENGTH=001                                               00130   
         DFHMDF POS=(07,049),                                          X00092**2
               COLOR=NEUTRAL,                                          X00093   
               ATTRB=(ASKIP,NORM),                                     X00094   
               LENGTH=019,                                             X00095   
               INITIAL='COUNTRY PHONE CODE:'                            00096   
ACPC2    DFHMDF POS=(07,069),                                          X00097**2
               COLOR=BLUE,                                             X00098   
               ATTRB=(ASKIP,NORM),                                     X00099   
               LENGTH=003                                               00100   
         DFHMDF POS=(07,073),                                          X00101**2
               COLOR=NEUTRAL,                                          X00102   
               ATTRB=(ASKIP),                                          X00103   
               LENGTH=001                                               00104   
*                                                                               
         DFHMDF POS=(08,003),                                          X00131**2
               COLOR=NEUTRAL,                                          X00132   
               ATTRB=(ASKIP,NORM),                                     X00133   
               LENGTH=011,                                             X00134   
               INITIAL='FAX.......:'                                    00135   
AFAX     DFHMDF POS=(08,015),                                          X00136**2
               COLOR=BLUE,                                             X00137   
               ATTRB=(ASKIP,NORM),                                     X00138   
               LENGTH=024                                               00139   
         DFHMDF POS=(08,040),                                          X00140**2
               COLOR=NEUTRAL,                                          X00141   
               ATTRB=(ASKIP),                                          X00142   
               LENGTH=001                                               00143   
*                                                                               
         DFHMDF POS=(08,049),                                          X00249**2
               COLOR=NEUTRAL,                                          X00250   
               ATTRB=(ASKIP,NORM),                                     X00251   
               LENGTH=019,                                             X00252   
               INITIAL='ROOM..............:'                            00253   
AROOM    DFHMDF POS=(08,069),                                          X00254**2
               COLOR=BLUE,                                             X00255   
               ATTRB=(ASKIP,NORM),                                     X00256   
               LENGTH=010                                               00257   
         DFHMDF POS=(08,080),                                          X00258**2
               COLOR=NEUTRAL,                                          X00259   
               ATTRB=(ASKIP),                                          X00260   
               LENGTH=001                                               00261   
*                                                                               
         DFHMDF POS=(09,003),                                          X00249**2
               COLOR=NEUTRAL,                                          X00250   
               ATTRB=(ASKIP,NORM),                                     X00251   
               LENGTH=011,                                             X00252   
               INITIAL='E-MAIL....:'                                    00253   
AEMAIL   DFHMDF POS=(09,015),                                          X00254**2
               COLOR=BLUE,                                             X00255   
               ATTRB=(ASKIP,NORM),                                     X00256   
               LENGTH=064                                               00257   
         DFHMDF POS=(09,080),                                          X00179**2
               COLOR=NEUTRAL,                                          X00180   
               ATTRB=(ASKIP),                                          X00181   
               LENGTH=001                                               00182   
*                                                                               
AD1ENMT  DFHMDF POS=(10,003),                                          X00175**2
               COLOR=NEUTRAL,                                          X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               LENGTH=011                                               00178   
AD1ENM   DFHMDF POS=(10,015),                                          X00175**2
               COLOR=BLUE,                                             X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               LENGTH=040                                               00178   
         DFHMDF POS=(10,056),                                          X00179**2
               COLOR=NEUTRAL,                                          X00180   
               ATTRB=(ASKIP),                                          X00181   
               LENGTH=001                                               00182   
*                                                                               
ADDR12T  DFHMDF POS=(11,003),                                          X00175**2
               COLOR=NEUTRAL,                                          X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               LENGTH=011                                               00178   
AADDR12  DFHMDF POS=(11,015),                                          X00188**2
               COLOR=BLUE,                                             X00189   
               ATTRB=(ASKIP,NORM),                                     X00190   
               LENGTH=040                                               00191   
         DFHMDF POS=(11,056),                                          X00192**2
               COLOR=NEUTRAL,                                          X00193   
               ATTRB=(ASKIP),                                          X00194   
               LENGTH=001                                               00195   
*                                                                               
AADDR23  DFHMDF POS=(12,015),                                          X00188**2
               COLOR=BLUE,                                             X00189   
               ATTRB=(ASKIP,NORM),                                     X00190   
               LENGTH=040                                               00191   
         DFHMDF POS=(12,056),                                          X00192**2
               COLOR=NEUTRAL,                                          X00193   
               ATTRB=(ASKIP),                                          X00194   
               LENGTH=001                                               00195   
*                                                                               
ANODE    DFHMDF POS=(13,003),                                          X00175**2
               COLOR=NEUTRAL,                                          X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               LENGTH=011                                               00178   
AADDR34  DFHMDF POS=(13,015),                                          X00188**2
               COLOR=BLUE,                                             X00189   
               ATTRB=(ASKIP,NORM),                                     X00190   
               LENGTH=040                                               00191   
         DFHMDF POS=(13,056),                                          X00192**2
               COLOR=NEUTRAL,                                          X00193   
               ATTRB=(ASKIP),                                          X00194   
               LENGTH=001                                               00195   
*                                                                               
         DFHMDF POS=(14,003),                                          X00196**2
               COLOR=NEUTRAL,                                          X00197   
               ATTRB=(ASKIP,NORM),                                     X00198   
               LENGTH=011,                                             X00199   
               INITIAL='CITY......:'                                    00200   
ACITY    DFHMDF POS=(14,015),                                          X00201**2
               COLOR=BLUE,                                             X00202   
               ATTRB=(ASKIP,NORM),                                     X00203   
               LENGTH=030                                               00204   
         DFHMDF POS=(14,046),                                          X00205**2
               COLOR=NEUTRAL,                                          X00206   
               ATTRB=(ASKIP,NORM),                                     X00207   
               LENGTH=006,                                             X00208   
               INITIAL='ST/PR:'                                         00209   
ASTCDE   DFHMDF POS=(14,053),                                          X00210**2
               COLOR=BLUE,                                             X00211   
               ATTRB=(ASKIP,NORM),                                     X00212   
               LENGTH=006                                               00213   
ASTNME   DFHMDF POS=(14,060),                                          X00210**2
               COLOR=BLUE,                                             X00211   
               ATTRB=(ASKIP,NORM),                                     X00212   
               LENGTH=019                                               00213   
         DFHMDF POS=(14,080),                                          X00223**2
               COLOR=NEUTRAL,                                          X00224   
               ATTRB=(ASKIP),                                          X00225   
               LENGTH=001                                               00226   
*                                                                               
         DFHMDF POS=(15,003),                                          X00214**2
               COLOR=NEUTRAL,                                          X00215   
               ATTRB=(ASKIP,NORM),                                     X00216   
               LENGTH=011,                                             X00217   
               INITIAL='ZIP.......:'                                    00218   
AZIPCDE  DFHMDF POS=(15,015),                                          X00219**2
               COLOR=BLUE,                                             X00220   
               ATTRB=(ASKIP,NORM),                                     X00221   
               LENGTH=012                                               00222   
         DFHMDF POS=(15,028),                                          X00223**2
               COLOR=NEUTRAL,                                          X00224   
               ATTRB=(ASKIP),                                          X00225   
               LENGTH=001                                               00226   
         DFHMDF POS=(15,042),                                          X00227**2
               COLOR=NEUTRAL,                                          X00228   
               ATTRB=(ASKIP,NORM),                                     X00229   
               LENGTH=008,                                             X00230   
               INITIAL='COUNTRY:'                                       00231   
ACNTCD   DFHMDF POS=(15,051),                                          X00232**2
               COLOR=BLUE,                                             X00233   
               ATTRB=(ASKIP,NORM),                                     X00234   
               LENGTH=003                                               00235   
ACNTNM   DFHMDF POS=(15,055),                                          X00232**2
               COLOR=BLUE,                                             X00233   
               ATTRB=(ASKIP,NORM),                                     X00234   
               LENGTH=024                                               00235   
         DFHMDF POS=(15,080),                                          X00223**2
               COLOR=NEUTRAL,                                          X00224   
               ATTRB=(ASKIP),                                          X00225   
               LENGTH=001                                               00226   
*                                                                               
         DFHMDF POS=(16,003),                                          X00262**2
               COLOR=NEUTRAL,                                          X00263   
               ATTRB=(ASKIP,NORM),                                     X00264   
               LENGTH=011,                                             X00265   
               INITIAL='ATTN TO...:'                                    00266   
AATTNTO  DFHMDF POS=(16,015),                                          X00267**2
               COLOR=BLUE,                                             X00268   
               ATTRB=(ASKIP,NORM),                                     X00269   
               LENGTH=040                                               00270   
         DFHMDF POS=(16,056),                                          X00271**2
               COLOR=NEUTRAL,                                          X00272   
               ATTRB=(ASKIP),                                          X00273   
               LENGTH=001                                               00274   
*                                                                               
         DFHMDF POS=(17,003),                                          X00275**2
               COLOR=NEUTRAL,                                          X00276   
               ATTRB=(ASKIP,NORM),                                     X00277   
               LENGTH=011,                                             X00278   
               INITIAL='COMMENTS..:'                                    00279   
ACOMM1   DFHMDF POS=(17,015),                                          X00280**2
               COLOR=BLUE,                                             X00281   
               ATTRB=(ASKIP,NORM),                                     X00282   
               LENGTH=060                                               00283   
         DFHMDF POS=(17,076),                                          X00284**2
               COLOR=NEUTRAL,                                          X00285   
               ATTRB=(ASKIP),                                          X00286   
               LENGTH=001                                               00287   
*                                                                               
ACOMM2   DFHMDF POS=(18,015),                                          X00288**2
               COLOR=BLUE,                                             X00289   
               ATTRB=(ASKIP,NORM),                                     X00290   
               LENGTH=060                                               00291   
         DFHMDF POS=(18,076),                                          X00292**2
               COLOR=NEUTRAL,                                          X00293   
               ATTRB=(ASKIP),                                          X00294   
               LENGTH=001                                               00295   
*                                                                               
ASTATUS  DFHMDF POS=(19,003),                                          X00175**2
               COLOR=NEUTRAL,                                          X00176   
               ATTRB=(ASKIP,NORM),                                     X00177   
               LENGTH=011                                               00178   
ACOMM3   DFHMDF POS=(19,015),                                          X00296**2
               COLOR=BLUE,                                             X00297   
               ATTRB=(ASKIP,NORM),                                     X00298   
               LENGTH=060                                               00299   
         DFHMDF POS=(19,076),                                          X00300**2
               COLOR=NEUTRAL,                                          X00301   
               ATTRB=(ASKIP),                                          X00302   
               LENGTH=001                                               00303   
         DFHMSD TYPE=FINAL                                              00304   
         END                                                            00305   
