*          DATA SET VNKM011    AT LEVEL 005 AS OF 06/05/07                      
*          DATA SET VNKM011    AT LEVEL 004 AS OF 05/29/07                      
*          DATA SET VNKM011    AT LEVEL 003 AS OF 04/06/07                      
*          DATA SET VNKM011    AT LEVEL 002 AS OF 08/18/94                      
*********************************************************************** 00001   
*                                                                       00005   
*        MAPSET  : VNKM011                                              00005   
*        MAP     : VN011A                                               00006   
*        PROGRAM : VNKCS011                                             00007   
*        TRANSID : V011 - VENDOR PROGRAM INQUIRY                        00008   
*        SYSTEM  : CICS ARCHITECTURE                                    00009   
*                                                                       00005   
*********************************************************************** 00005   
VNKM011  DFHMSD TYPE=MAP,                                              X00006   
               CTRL=(FREEKB),                                          X00007   
               LANG=COBOL,                                             X00008   
               MODE=INOUT,                                             X00009   
               TIOAPFX=YES                                              00010   
VN011A   DFHMDI SIZE=(19,080),                                         X00011   
               MAPATTS=(COLOR,HILIGHT),                                X00012   
               DSATTS=(COLOR,HILIGHT),                                 X00013   
               LINE=02,                                                X00014   
               COLUMN=01                                                00015   
*                                                                       00015   
         DFHMDF POS=(01,002),                                          X00016   
               COLOR=NEUTRAL,                                          X00017   
               ATTRB=(ASKIP,NORM),                                     X00018   
               LENGTH=011,                                             X00019   
               INITIAL='DEPARTMENT:'                                    00020   
ADPTNBR  DFHMDF POS=(01,014),                                          X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               LENGTH=003                                               00024   
         DFHMDF POS=(01,023),                                          X00025   
               COLOR=NEUTRAL,                                          X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               LENGTH=012,                                             X00028   
               INITIAL='VENDOR NAME:'                                   00029   
AVNNAME  DFHMDF POS=(01,036),                                          X00030   
               COLOR=BLUE,                                             X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=030                                               00033   
*                                                                       00015   
         DFHMDF POS=(02,002),                                          X00034   
               COLOR=NEUTRAL,                                          X00035   
               ATTRB=(ASKIP,NORM),                                     X00036   
               LENGTH=011,                                             X00037   
               INITIAL='INHOUSE...:'                                    00038   
AINHS    DFHMDF POS=(02,014),                                          X00039   
               COLOR=BLUE,                                             X00040   
               ATTRB=(ASKIP,NUM,NORM),                                 X00041   
               PICOUT='ZZZ',                                           X00042   
               LENGTH=003                                               00043   
         DFHMDF POS=(02,023),                                          X00025   
               COLOR=NEUTRAL,                                          X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               LENGTH=012,                                             X00028   
               INITIAL='DUNS NUMBER:'                                   00029   
ADUNNBR  DFHMDF POS=(02,036),                                          X00030   
               COLOR=BLUE,                                             X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=009                                               00033   
*                                                                       00015   
         DFHMDF POS=(04,002),                                          X00044   
               COLOR=NEUTRAL,                                          X00045   
               ATTRB=(ASKIP,NORM),                                     X00046   
               LENGTH=022,                                             X00047   
               INITIAL='----PRE-TICKETING-----'                         00048   
         DFHMDF POS=(04,026),                                          X00049   
               COLOR=NEUTRAL,                                          X00050   
               ATTRB=(ASKIP,NORM),                                     X00051   
               LENGTH=052,                                             X00376   
               INITIAL='-------------SERVICES/PROGRAMS-------------    X00377   
                    '                                                   00378   
*                                                                       00015   
         DFHMDF POS=(05,002),                                          X00054   
               COLOR=NEUTRAL,                                          X00055   
               ATTRB=(ASKIP,NORM),                                     X00056   
               LENGTH=013,                                             X00057   
               INITIAL='(Y,N,P).....:'                                  00058   
ATKIND1  DFHMDF POS=(05,016),                                          X00059   
               COLOR=BLUE,                                             X00060   
               ATTRB=(ASKIP,NORM),                                     X00061   
               LENGTH=001                                               00062   
         DFHMDF POS=(05,018),                                          X00063   
               COLOR=NEUTRAL,                                          X00064   
               ATTRB=(ASKIP,NORM),                                     X00065   
               LENGTH=001                                               00066   
         DFHMDF POS=(05,026),                                          X00137   
               COLOR=NEUTRAL,                                          X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=014,                                             X00140   
               INITIAL='DC SPLIT REQD:'                                 00141   
ADCSIND  DFHMDF POS=(05,041),                                          X00142   
               COLOR=BLUE,                                             X00143   
               ATTRB=(ASKIP,NORM),                                     X00144   
               LENGTH=001                                               00145   
         DFHMDF POS=(05,043),                                          X00146   
               COLOR=NEUTRAL,                                          X00147   
               ATTRB=(ASKIP,NORM),                                     X00148   
               LENGTH=005,                                             X00149   
               INITIAL='(Y/N)'                                          00150   
ADCSDAY  DFHMDF POS=(05,049),                                          X00151   
               COLOR=BLUE,                                             X00152   
               ATTRB=(ASKIP,NORM),                                     X00153   
               LENGTH=004,                                             X00154   
               PICOUT='ZZZ9'                                            00466   
         DFHMDF POS=(05,054),                                          X00155   
               COLOR=NEUTRAL,                                          X00156   
               ATTRB=(ASKIP,NORM),                                     X00157   
               LENGTH=013,                                             X00158   
               INITIAL='LEADTIME DAYS'                                  00159   
*                                                                       00159   
         DFHMDF POS=(06,002),                                          X00127   
               COLOR=NEUTRAL,                                          X00128   
               ATTRB=(ASKIP,NORM),                                     X00129   
               LENGTH=013,                                             X00130   
               INITIAL='LEAD TIME...:'                                  00131   
ALDTME1  DFHMDF POS=(06,016),                                          X00132   
               COLOR=BLUE,                                             X00133   
               ATTRB=(ASKIP,NORM),                                     X00134   
               LENGTH=003,                                             X00135   
               PICOUT='ZZ9'                                             00136   
         DFHMDF POS=(06,026),                                          X00215   
               COLOR=NEUTRAL,                                          X00216   
               ATTRB=(ASKIP,NORM),                                     X00217   
               LENGTH=014,                                             X00218   
               INITIAL='PACK BY STORE:'                                 00219   
APKSTOR  DFHMDF POS=(06,041),                                          X00220   
               COLOR=BLUE,                                             X00221   
               ATTRB=(ASKIP,NORM),                                     X00222   
               LENGTH=001                                               00223   
         DFHMDF POS=(06,043),                                          X00224   
               COLOR=NEUTRAL,                                          X00225   
               ATTRB=(ASKIP,NORM),                                     X00226   
               LENGTH=005,                                             X00227   
               INITIAL='(Y/N)'                                          00228   
*                                                                       00015   
         DFHMDF POS=(07,002),                                          X00160   
               COLOR=NEUTRAL,                                          X00161   
               ATTRB=(ASKIP,NORM),                                     X00162   
               LENGTH=013,                                             X00163   
               INITIAL='TICKET MAKER:'                                  00164   
ATKMKR1  DFHMDF POS=(07,016),                                          X00165   
               COLOR=BLUE,                                             X00166   
               ATTRB=(ASKIP,NORM),                                     X00167   
               LENGTH=001                                               00168   
         DFHMDF POS=(07,018),                                          X00206   
               COLOR=NEUTRAL,                                          X00207   
               ATTRB=(ASKIP,NORM),                                     X00208   
               LENGTH=005,                                             X00209   
               INITIAL='(K/V)'                                          00210   
         DFHMDF POS=(07,024),                                          X00170   
               COLOR=NEUTRAL,                                          X00171   
               ATTRB=(ASKIP,NORM),                                     X00172   
               LENGTH=001                                               00173   
         DFHMDF POS=(07,026),                                          X00252   
               COLOR=NEUTRAL,                                          X00253   
               ATTRB=(ASKIP,NORM),                                     X00254   
               LENGTH=014,                                             X00255   
               INITIAL='HANGER INSERT:'                                 00256   
AHNGIS1  DFHMDF POS=(07,041),                                          X00257   
               COLOR=BLUE,                                             X00258   
               ATTRB=(ASKIP,NORM),                                     X00259   
               LENGTH=001                                               00260   
         DFHMDF POS=(07,043),                                          X00261   
               COLOR=NEUTRAL,                                          X00262   
               ATTRB=(ASKIP,NORM),                                     X00263   
               LENGTH=005,                                             X00264   
               INITIAL='(Y/N)'                                          00265   
*                                                                       00015   
         DFHMDF POS=(08,002),                                          X00197   
               COLOR=NEUTRAL,                                          X00198   
               ATTRB=(ASKIP,NORM),                                     X00199   
               LENGTH=013,                                             X00200   
               INITIAL='BULK TICKETS:'                                  00201   
ABKTKT1  DFHMDF POS=(08,016),                                          X00202   
               COLOR=BLUE,                                             X00203   
               ATTRB=(ASKIP,NORM),                                     X00204   
               LENGTH=001                                               00205   
         DFHMDF POS=(08,018),                                          X00206   
               COLOR=NEUTRAL,                                          X00207   
               ATTRB=(ASKIP,NORM),                                     X00208   
               LENGTH=005,                                             X00209   
               INITIAL='(Y/N)'                                          00210   
         DFHMDF POS=(08,024),                                          X00170   
               COLOR=NEUTRAL,                                          X00171   
               ATTRB=(ASKIP,NORM),                                     X00172   
               LENGTH=001                                               00173   
         DFHMDF POS=(08,026),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=014,                                             X00324   
               INITIAL='SUPPLIES UPC.:'                                 00325   
ASUPUCP  DFHMDF POS=(08,041),                                          X00326   
               COLOR=BLUE,                                             X00327   
               ATTRB=(ASKIP,NORM),                                     X00328   
               LENGTH=001                                               00329   
         DFHMDF POS=(08,043),                                          X00330   
               COLOR=NEUTRAL,                                          X00331   
               ATTRB=(ASKIP,NORM),                                     X00332   
               LENGTH=005,                                             X00333   
               INITIAL='(Y/N)'                                          00334   
*                                                                       00015   
         DFHMDF POS=(09,026),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=014,                                             X00324   
               INITIAL='DIRECT SHIP..:'                                 00325   
ADIRSHP  DFHMDF POS=(09,041),                                          X00257   
               COLOR=BLUE,                                             X00258   
               ATTRB=(ASKIP,NORM),                                     X00259   
               LENGTH=001                                               00260   
         DFHMDF POS=(09,043),                                          X00261   
               COLOR=NEUTRAL,                                          X00262   
               ATTRB=(ASKIP,NORM),                                     X00263   
               LENGTH=005,                                             X00264   
               INITIAL='(Y/N)'                                          00265   
         DFHMDF POS=(09,050),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=005,                                             X00324   
               INITIAL='RATE:'                                          00325   
ADIRRTE  DFHMDF POS=(09,056),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=007,                                             X00385   
               PICOUT='ZZZ9.99'                                         00386   
         DFHMDF POS=(09,064),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=004,                                             X00324   
               INITIAL='PCT:'                                           00325   
ADIRPCT  DFHMDF POS=(09,069),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(09,075),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
*                                                                       00015   
         DFHMDF POS=(10,026),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=014,                                             X00324   
               INITIAL='RFID STATUS..:'                                 00325   
RFDCOMP  DFHMDF POS=(10,041),                                          X00518   
               COLOR=BLUE,                                             X00519   
               ATTRB=(ASKIP,NORM),                                     X00520   
               LENGTH=001                                               00521   
         DFHMDF POS=(10,043),                                          X00522   
               COLOR=NEUTRAL,                                          X00523   
               ATTRB=(ASKIP,NORM),                                     X00524   
               LENGTH=035,                                             X00525   
               INITIAL='(N-NO RFID, T-TAGGING, C-COMPLIANT)'            00526   
*                                                                       00015   
         DFHMDF POS=(12,002),                                          X00344   
               COLOR=NEUTRAL,                                          X00345   
               ATTRB=(ASKIP,NORM),                                     X00346   
               LENGTH=022,                                             X00347   
               INITIAL='--SUPPRESS TICKETING--'                         00348   
         DFHMDF POS=(12,026),                                          X00349   
               COLOR=NEUTRAL,                                          X00350   
               ATTRB=(ASKIP,NORM),                                     X00351   
               LENGTH=053,                                             X00352   
               INITIAL='-------AGREEMENTS AFFECTING INVOICE--------  EFX00377   
               F DATE'                                                  00378   
*                                                                       00015   
         DFHMDF POS=(13,002),                                          X00355   
               COLOR=NEUTRAL,                                          X00356   
               ATTRB=(ASKIP,NORM),                                     X00357   
               LENGTH=013,                                             X00358   
               INITIAL='(Y,N,P).....:'                                  00359   
ATKIND2  DFHMDF POS=(13,016),                                          X00360   
               COLOR=BLUE,                                             X00361   
               ATTRB=(ASKIP,NORM),                                     X00362   
               LENGTH=001                                               00363   
         DFHMDF POS=(13,018),                                          X00364   
               COLOR=NEUTRAL,                                          X00365   
               ATTRB=(ASKIP,NORM),                                     X00366   
               LENGTH=001                                               00367   
         DFHMDF POS=(13,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='NEW STORE DISC....:'                            00372   
ANEWSTR  DFHMDF POS=(13,046),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00376   
         DFHMDF POS=(13,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00398   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
ANEWPCT  DFHMDF POS=(13,050),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(13,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=007,                                             X00390   
               INITIAL='% DAYS:'                                        00391   
ANEWDAY  DFHMDF POS=(13,064),                                          X00392   
               COLOR=BLUE,                                             X00393   
               ATTRB=(ASKIP,NORM),                                     X00394   
               LENGTH=003,                                             X00395   
               PICOUT='ZZ9'                                             00396   
         DFHMDF POS=(13,068),                                          X00397   
               COLOR=NEUTRAL,                                          X00398   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
ANEWEFF  DFHMDF POS=(13,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00015   
         DFHMDF POS=(14,002),                                          X00457   
               COLOR=NEUTRAL,                                          X00458   
               ATTRB=(ASKIP,NORM),                                     X00459   
               LENGTH=013,                                             X00460   
               INITIAL='LEAD TIME...:'                                  00461   
ALDTME2  DFHMDF POS=(14,016),                                          X00462   
               COLOR=BLUE,                                             X00463   
               ATTRB=(ASKIP,NORM),                                     X00464   
               LENGTH=003,                                             X00465   
               PICOUT='ZZ9'                                             00466   
         DFHMDF POS=(14,020),                                          X00467   
               COLOR=NEUTRAL,                                          X00468   
               ATTRB=(ASKIP,NORM),                                     X00469   
               LENGTH=001                                               00470   
         DFHMDF POS=(14,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='MOS DISC..........:'                            00372   
AMOSDIS  DFHMDF POS=(14,046),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00376   
         DFHMDF POS=(14,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
AMOSPCT  DFHMDF POS=(14,050),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(14,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
AMOSEFF  DFHMDF POS=(14,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00015   
         DFHMDF POS=(15,002),                                          X00485   
               COLOR=NEUTRAL,                                          X00486   
               ATTRB=(ASKIP,NORM),                                     X00487   
               LENGTH=013,                                             X00488   
               INITIAL='TICKET MAKER:'                                  00489   
ATKMKR2  DFHMDF POS=(15,016),                                          X00490   
               COLOR=BLUE,                                             X00491   
               ATTRB=(ASKIP,NORM),                                     X00492   
               LENGTH=001                                               00493   
         DFHMDF POS=(15,018),                                          X00494   
               COLOR=NEUTRAL,                                          X00495   
               ATTRB=(ASKIP,NORM),                                     X00496   
               LENGTH=007,                                             X00497   
               INITIAL='(V/U)'                                          00498   
         DFHMDF POS=(15,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='TRADE DISC........:'                            00372   
ATRDDIS  DFHMDF POS=(15,046),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00376   
         DFHMDF POS=(15,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
ATRDPCT  DFHMDF POS=(15,050),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(15,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
ATRDEFF  DFHMDF POS=(15,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00015   
         DFHMDF POS=(16,002),                                          X00513   
               COLOR=NEUTRAL,                                          X00514   
               ATTRB=(ASKIP,NORM),                                     X00515   
               LENGTH=013,                                             X00516   
               INITIAL='BULK TICKETS:'                                  00517   
ABKTKT2  DFHMDF POS=(16,016),                                          X00518   
               COLOR=BLUE,                                             X00519   
               ATTRB=(ASKIP,NORM),                                     X00520   
               LENGTH=001                                               00521   
         DFHMDF POS=(16,018),                                          X00522   
               COLOR=NEUTRAL,                                          X00523   
               ATTRB=(ASKIP,NORM),                                     X00524   
               LENGTH=005,                                             X00525   
               INITIAL='(Y/N)'                                          00526   
         DFHMDF POS=(16,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='BROADCAST OFF INVC:'                            00372   
AADVDIS  DFHMDF POS=(16,046),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00376   
         DFHMDF POS=(16,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
AADVPCT  DFHMDF POS=(16,050),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(16,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
AADVEFF  DFHMDF POS=(16,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00015   
         DFHMDF POS=(17,026),                                          X00415   
               COLOR=NEUTRAL,                                          X00416   
               ATTRB=(ASKIP,NORM),                                     X00417   
               LENGTH=019,                                             X00418   
               INITIAL='CO-OP ALLOWANCE...:'                            00372   
ACOPALW  DFHMDF POS=(17,046),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00376   
         DFHMDF POS=(17,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
ACOPPCT  DFHMDF POS=(17,050),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(17,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
ACOPEFF  DFHMDF POS=(17,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00015   
         DFHMDF POS=(18,026),                                          X00443   
               COLOR=NEUTRAL,                                          X00444   
               ATTRB=(ASKIP,NORM),                                     X00445   
               LENGTH=019,                                             X00446   
               INITIAL='PROFITASST/ADCOOP.:'                            00372   
APFTALW  DFHMDF POS=(18,046),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00376   
         DFHMDF POS=(18,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
APFTPCT  DFHMDF POS=(18,050),                                          X00382   
               COLOR=BLUE,                                             X00383   
               ATTRB=(ASKIP,NORM),                                     X00384   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(18,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
APFTEFF  DFHMDF POS=(18,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00015   
         DFHMDF POS=(19,026),                                          X00443   
               COLOR=NEUTRAL,                                          X00444   
               ATTRB=(ASKIP,NORM),                                     X00445   
               LENGTH=019,                                             X00446   
               INITIAL='TABLE/TOWER DATING:'                            00372   
ATBLIND  DFHMDF POS=(19,046),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00376   
         DFHMDF POS=(19,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
         DFHMDF POS=(19,058),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=005,                                             X00390   
               INITIAL='DAYS:'                                          00391   
ATBLDAY  DFHMDF POS=(19,064),                                          X00392   
               COLOR=BLUE,                                             X00393   
               ATTRB=(ASKIP,NORM),                                     X00394   
               LENGTH=003,                                             X00395   
               PICOUT='ZZ9'                                             00396   
         DFHMDF POS=(19,068),                                          X00397   
               COLOR=NEUTRAL,                                          X00398   
               ATTRB=(ASKIP,NORM),                                     X00399   
               LENGTH=001                                               00400   
ATBLEFF  DFHMDF POS=(19,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00015   
         DFHMSD TYPE=FINAL                                              00541   
         END                                                            00542   
