*          DATA SET VNKM031                                                     
  PRINT  NOGEN                                                                  
*******************************************************************-*           
*                                                                   *           
*        MAPSET  VNKM031                                            *           
*        MAP     VN031A                                             *           
*        PROGRAM VNKCS031                                           *           
*        TRANSID V031 - VENDOR RELATIONSHIPS LIST SCREEN            *           
*        SYSTEM  CICS ARCHITECTURE                                  *           
*                                                                   *           
*******************************************************************-*           
VNKM031  DFHMSD TYPE=MAP,                                              X        
               CTRL=(FREEKB),                                          X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES                                                      
VN031A   DFHMDI SIZE=(19,080),                                         X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT),                                 X        
               LINE=02,                                                X        
               COLUMN=01                                                        
         DFHMDF POS=(02,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=007,                                             X        
               INITIAL='VENDOR:'                                                
AVEND    DFHMDF POS=(02,010),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
         DFHMDF POS=(02,053),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='ITEMS'                                                  
ASTRTIT  DFHMDF POS=(02,060),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NUM,NORM),                                X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMDF POS=(02,065),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='TO'                                                     
AENDIT   DFHMDF POS=(02,068),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMDF POS=(02,073),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='OF'                                                     
ATOTIT   DFHMDF POS=(02,076),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMDF POS=(04,001),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='SEL '                                                   
         DFHMDF POS=(04,006),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ACT'                                                    
         DFHMDF POS=(04,011),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=017,                                             X        
               INITIAL='RELATIONSHIP NAME'                                      
         DFHMDF POS=(04,044),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='COUNT'                                                  
ASEL01   DFHMDF POS=(05,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(05,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT01   DFHMDF POS=(05,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM01  DFHMDF POS=(05,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT01   DFHMDF POS=(05,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL02   DFHMDF POS=(06,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(06,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT02   DFHMDF POS=(06,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM02  DFHMDF POS=(06,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT02   DFHMDF POS=(06,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL03   DFHMDF POS=(07,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(07,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT03   DFHMDF POS=(07,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM03  DFHMDF POS=(07,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT03   DFHMDF POS=(07,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL04   DFHMDF POS=(08,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(08,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT04   DFHMDF POS=(08,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM04  DFHMDF POS=(08,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT04   DFHMDF POS=(08,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL05   DFHMDF POS=(09,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(09,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT05   DFHMDF POS=(09,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM05  DFHMDF POS=(09,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT05   DFHMDF POS=(09,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL06   DFHMDF POS=(10,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(10,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT06   DFHMDF POS=(10,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM06  DFHMDF POS=(10,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT06   DFHMDF POS=(10,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL07   DFHMDF POS=(11,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(11,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT07   DFHMDF POS=(11,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM07  DFHMDF POS=(11,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT07   DFHMDF POS=(11,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL08   DFHMDF POS=(12,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(12,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT08   DFHMDF POS=(12,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM08  DFHMDF POS=(12,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT08   DFHMDF POS=(12,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL09   DFHMDF POS=(13,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(13,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT09   DFHMDF POS=(13,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM09  DFHMDF POS=(13,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT09   DFHMDF POS=(13,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL10   DFHMDF POS=(14,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(14,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT10   DFHMDF POS=(14,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM10  DFHMDF POS=(14,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT10   DFHMDF POS=(14,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL11   DFHMDF POS=(15,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(15,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT11   DFHMDF POS=(15,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM11  DFHMDF POS=(15,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT11   DFHMDF POS=(15,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL12   DFHMDF POS=(16,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(16,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT12   DFHMDF POS=(16,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM12  DFHMDF POS=(16,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT12   DFHMDF POS=(16,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL13   DFHMDF POS=(17,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(17,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT13   DFHMDF POS=(17,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM13  DFHMDF POS=(17,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT13   DFHMDF POS=(17,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
ASEL14   DFHMDF POS=(18,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(18,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT14   DFHMDF POS=(18,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ARLNM14  DFHMDF POS=(18,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
ACNT14   DFHMDF POS=(18,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               PICOUT='ZZZZ9'                                                   
         DFHMDF POS=(19,049),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=026,                                             X        
               INITIAL='NUMBER OF SELECTED ITEMS: '                             
ASELIT   DFHMDF POS=(19,076),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
