*          DATA SET VNKM013    AT LEVEL 001 AS OF 10/20/93                      
*          DATA SET VNKM013    AT LEVEL 001 AS OF 07/13/93              00001   
*********************************************************************** 00001   
*                                                                       00004   
*        MAPSET  : VNKM013                                              00005   
*        MAP     : VN013A                                               00006   
*        PROGRAM : VNKCS013                                             00007   
*        TRANSID : V013 - VENDOR TERMS INQUIRY                          00008   
*        SYSTEM  : CICS ARCHITECTURE                                    00009   
*                                                                       00010   
*********************************************************************** 00005   
VNKM013  DFHMSD TYPE=MAP,                                              X00002   
               CTRL=(FREEKB),                                          X00003   
               DSATTS=(COLOR,HILIGHT),                                 X00004   
               LANG=COBOL,                                             X00005   
               MODE=INOUT,                                             X00006   
               TIOAPFX=YES                                              00007   
VN013A   DFHMDI SIZE=(19,080),                                         X00008   
               MAPATTS=(COLOR,HILIGHT),                                X00009   
               DSATTS=(COLOR,HILIGHT),                                 X00010   
               LINE=02,                                                X00011   
               COLUMN=01                                                00012   
         DFHMDF POS=(02,003),                                          X00013   
               COLOR=NEUTRAL,                                          X00014   
               ATTRB=(ASKIP,NORM),                                     X00015   
               LENGTH=011,                                             X00016   
               INITIAL='DEPARTMENT:'                                    00017   
ADPTNBR  DFHMDF POS=(02,015),                                          X00018   
               COLOR=BLUE,                                             X00019   
               ATTRB=(ASKIP,NORM),                                     X00020   
               LENGTH=003                                               00021   
         DFHMDF POS=(02,025),                                          X00022   
               COLOR=NEUTRAL,                                          X00023   
               ATTRB=(ASKIP,NORM),                                     X00024   
               LENGTH=008,                                             X00025   
               INITIAL='NAME...:'                                       00026   
AVNAME   DFHMDF POS=(02,034),                                          X00027   
               COLOR=BLUE,                                             X00028   
               ATTRB=(ASKIP,NORM),                                     X00029   
               LENGTH=029                                               00030   
*                                                                               
         DFHMDF POS=(03,003),                                          X00031   
               COLOR=NEUTRAL,                                          X00032   
               ATTRB=(ASKIP,NORM),                                     X00033   
               LENGTH=011,                                             X00034   
               INITIAL='INHOUSE...:'                                    00035   
AINHS    DFHMDF POS=(03,015),                                          X00036   
               COLOR=BLUE,                                             X00037   
               ATTRB=(ASKIP,NORM),                                     X00038   
               LENGTH=003                                               00039   
         DFHMDF POS=(03,025),                                          X00040   
               COLOR=NEUTRAL,                                          X00041   
               ATTRB=(ASKIP,NORM),                                     X00042   
               LENGTH=008,                                             X00043   
               INITIAL='VNDR NO:'                                       00044   
ADUNS    DFHMDF POS=(03,034),                                          X00045   
               COLOR=BLUE,                                             X00046   
               ATTRB=(ASKIP,NORM),                                     X00047   
               LENGTH=009                                               00048   
*                                                                               
         DFHMDF POS=(05,003),                                          X00049   
               COLOR=NEUTRAL,                                          X00050   
               ATTRB=(ASKIP,NORM),                                     X00051   
               LENGTH=019,                                             X00052   
               INITIAL='PAYMENT TERMS.....:'                            00053   
APAYTRM  DFHMDF POS=(05,023),                                          X00054   
               COLOR=BLUE,                                             X00055   
               ATTRB=(ASKIP,NUM,NORM),                                 X00056   
               LENGTH=003                                               00057   
APAYTXT  DFHMDF POS=(05,029),                                          X00058   
               COLOR=BLUE,                                             X00059   
               ATTRB=(PROT,NORM),                                      X00060   
               LENGTH=028                                               00061   
*                                                                               
         DFHMDF POS=(06,003),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=019,                                             X        
               INITIAL='FREIGHT TERMS.....:'                                    
AFRTIDT  DFHMDF POS=(06,023),                                          X00057**2
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NUM,NORM),                                 X        
               LENGTH=03                                                        
APAYFRG  DFHMDF POS=(06,029),                                          X00186   
               COLOR=BLUE,                                             X00187   
               ATTRB=(ASKIP,NORM),                                     X00188   
               LENGTH=001                                               00189   
         DFHMDF POS=(06,031),                                          X00136**2
               COLOR=NEUTRAL,                                          X00137**2
               ATTRB=(ASKIP,NORM),                                     X00138**2
               LENGTH=007,                                             X00139**2
               INITIAL='(K/V/B)'                                        00140**2
AKFRGHT  DFHMDF POS=(06,040),                                          X00204   
               COLOR=BLUE,                                             X00205   
               ATTRB=(ASKIP,NUM,NORM),                                 X00206   
               LENGTH=006                                               00207   
         DFHMDF POS=(06,047),                                          X00159**2
               COLOR=NEUTRAL,                                          X00160**2
               ATTRB=(ASKIP,NUM,NORM),                                 X00161**2
               LENGTH=007,                                             X00162**2
               INITIAL='% KOHLS'                                        00163**2
AVFRGHT  DFHMDF POS=(06,055),                                          X00227   
               COLOR=BLUE,                                             X00228   
               ATTRB=(ASKIP,NUM,NORM),                                 X00229   
               LENGTH=006                                               00230   
         DFHMDF POS=(06,062),                                          X00187**2
               COLOR=NEUTRAL,                                          X00188**2
               ATTRB=(ASKIP,NORM),                                     X00189**2
               LENGTH=008,                                             X00190**2
               INITIAL='% VENDOR'                                       00191**2
*                                                                               
         DFHMDF POS=(08,003),                                          X00072   
               COLOR=NEUTRAL,                                          X00073   
               ATTRB=(ASKIP,NORM),                                     X00074   
               LENGTH=039,                                             X00075   
               INITIAL='------------SHIPPING TERMS-------------'        00076   
         DFHMDF POS=(08,045),                                          X00077   
               COLOR=NEUTRAL,                                          X00078   
               ATTRB=(ASKIP,NORM),                                     X00079   
               LENGTH=027,                                             X00080   
               INITIAL='------PURCHASE TERMS-------'                    00081   
*                                                                               
         DFHMDF POS=(09,003),                                          X00082   
               COLOR=NEUTRAL,                                          X00083   
               ATTRB=(ASKIP,NORM),                                     X00084   
               LENGTH=018,                                             X00085   
               INITIAL='FOB POINT........:'                             00086   
AFOBPNT  DFHMDF POS=(09,022),                                          X00087   
               COLOR=BLUE,                                             X00088   
               ATTRB=(ASKIP,NORM),                                     X00089   
               LENGTH=020                                               00090   
*                                                                               
         DFHMDF POS=(10,003),                                          X00100   
               COLOR=NEUTRAL,                                          X00101   
               ATTRB=(ASKIP,NORM),                                     X00102   
               LENGTH=018,                                             X00103   
               INITIAL='SHIPPING POINT...:'                             00104   
ASHPPNT  DFHMDF POS=(10,022),                                          X00105   
               COLOR=BLUE,                                             X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               LENGTH=020                                               00108   
*                                                                               
         DFHMDF POS=(09,045),                                          X00172   
               COLOR=NEUTRAL,                                          X00173   
               ATTRB=(ASKIP,NORM),                                     X00174   
               LENGTH=019,                                             X00175   
               INITIAL='RTV RA REQUIRED...:'                            00176   
ARTVRQD  DFHMDF POS=(09,065),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=001                                                       
*                                                                               
         DFHMDF POS=(10,045),                                          X00190   
               COLOR=NEUTRAL,                                          X00191   
               ATTRB=(ASKIP,NORM),                                     X00192   
               LENGTH=019,                                             X00193   
               INITIAL='RTV NO RA REQUIRED:'                            00194   
ARTVNRQ  DFHMDF POS=(10,065),                                          X00195   
               COLOR=BLUE,                                             X00196   
               ATTRB=(ASKIP,NORM),                                     X00197   
               LENGTH=001                                               00198   
*                                                                               
*                                                                               
         DFHMDF POS=(11,003),                                          X00100   
               COLOR=NEUTRAL,                                          X00101   
               ATTRB=(ASKIP,NORM),                                     X00102   
               LENGTH=018,                                             X00103   
               INITIAL='LATE SHIP PENALTY:'                             00104   
ALTEIND  DFHMDF POS=(11,022),                                          X00105   
               COLOR=BLUE,                                             X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               LENGTH=001                                               00108   
ACHGPCT  DFHMDF POS=(11,032),                                          X00105   
               COLOR=BLUE,                                             X00106   
               ATTRB=(ASKIP,NUM,NORM),                                 X00107   
               LENGTH=007                                               00108   
         DFHMDF POS=(11,040),                                          X00159**2
               COLOR=NEUTRAL,                                          X00160**2
               ATTRB=(ASKIP,NORM),                                     X00161**2
               LENGTH=001,                                             X00162**2
               INITIAL='%'                                              00163**2
         DFHMDF POS=(11,045),                                          X00213   
               COLOR=NEUTRAL,                                          X00214   
               ATTRB=(ASKIP,NORM),                                     X00215   
               LENGTH=019,                                             X00216   
               INITIAL='DEBIT AND DESTROY.:'                            00217   
ADBTDST  DFHMDF POS=(11,065),                                          X00218   
               COLOR=BLUE,                                             X00219   
               ATTRB=(ASKIP,NORM),                                     X00220   
               LENGTH=001                                               00221   
*                                                                               
*                                                                               
         DFHMDF POS=(12,003),                                          X00100   
               COLOR=NEUTRAL,                                          X00101   
               ATTRB=(ASKIP,NORM),                                     X00102   
               LENGTH=018,                                             X00103   
               INITIAL='CHARGE FACTOR....:'                             00104   
ACHGCDE  DFHMDF POS=(12,022),                                          X00105   
               COLOR=BLUE,                                             X00106   
               ATTRB=(ASKIP,NORM),                                     X00107   
               LENGTH=001                                               00108   
         DFHMDF POS=(12,024),                                          X00136**2
               COLOR=NEUTRAL,                                          X00137**2
               ATTRB=(ASKIP,NORM),                                     X00138**2
               LENGTH=012,                                             X00139**2
               INITIAL='(S = SINGLE)'                                   00140**2
         DFHMDF POS=(12,045),                                          X00236   
               COLOR=NEUTRAL,                                          X00237   
               ATTRB=(ASKIP,NORM),                                     X00238   
               LENGTH=019,                                             X00239   
               INITIAL='MARKOUT...........:'                            00240   
AMRKOUT  DFHMDF POS=(12,065),                                          X00241   
               COLOR=BLUE,                                             X00242   
               ATTRB=(ASKIP,NORM),                                     X00243   
               LENGTH=001                                               00244   
*                                                                               
         DFHMDF POS=(13,024),                                          X00136**2
               COLOR=NEUTRAL,                                          X00137**2
               ATTRB=(ASKIP,NORM),                                     X00138**2
               LENGTH=011,                                             X00139**2
               INITIAL='(D = DAILY)'                                    00140**2
         DFHMDF POS=(13,045),                                          X00236   
               COLOR=NEUTRAL,                                          X00237   
               ATTRB=(ASKIP,NORM),                                     X00238   
               LENGTH=019,                                             X00239   
               INITIAL='AUTHORIZATION ID..:'                            00240   
AAUTHID  DFHMDF POS=(13,065),                                          X00241   
               COLOR=BLUE,                                             X00242   
               ATTRB=(ASKIP,NORM),                                     X00243   
               LENGTH=010                                               00244   
*                                                                               
         DFHMDF POS=(14,024),                                          X00136**2
               COLOR=NEUTRAL,                                          X00137**2
               ATTRB=(ASKIP,NORM),                                     X00138**2
               LENGTH=012,                                             X00139**2
               INITIAL='(W = WEEKLY)'                                   00140**2
*                                                                               
         DFHMSD TYPE=FINAL                                              00245   
         END                                                            00246   
