*          DATA SET VNKM007    AT LEVEL 003 AS OF 09/13/95                      
*          DATA SET VNKM007    AT LEVEL 009 AS OF 08/08/95              00001   
*          DATA SET VNKM007    AT LEVEL 001 AS OF 06/16/95              00002   
*          DATA SET VNKM007    AT LEVEL 001 AS OF 06/08/95              00003   
*          DATA SET VNKM007    AT LEVEL 022 AS OF 06/09/94              00004   
  PRINT  NOGEN                                                          00005   
*********************************************************************** 00006   
* MAPSET : VNKM007                                                      00007   
*    MAP : VN007A                                                       00008   
*                    VENDOR ADD / UPDATE                                00009   
*********************************************************************** 00010   
VNKM007  DFHMSD TYPE=MAP,                                              X00011   
               CTRL=(FREEKB),                                          X00012   
               LANG=COBOL,                                             X00013   
               MODE=INOUT,                                             X00014   
               TIOAPFX=YES                                              00015   
VN007A   DFHMDI LINE=02,                                               X00016   
               COLUMN=01,                                              X00017   
               SIZE=(19,80),                                           X00018   
               MAPATTS=(COLOR,HILIGHT),                                X00019   
               DSATTS=(COLOR,HILIGHT)                                   00020   
         DFHMDF ATTRB=(PROT),                                          X00021   
               INITIAL='PRIMARY NAME..:',                              X00022   
               COLOR=NEUTRAL,                                          X00023   
               LENGTH=15,                                              X00024   
               POS=(02,2)                                               00025   
AVNNAME  DFHMDF ATTRB=(UNPROT,IC),                                     X00026   
               COLOR=GREEN,                                            X00027   
               HILIGHT=UNDERLINE,                                      X00028   
               LENGTH=30,                                              X00029   
               POS=(02,18)                                              00030   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(02,49),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='SHORT NAME....:',                              X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=15,                                              X00037   
               POS=(02,51)                                              00038   
AVNSNME  DFHMDF ATTRB=(UNPROT),                                        X00039   
               COLOR=GREEN,                                            X00040   
               HILIGHT=UNDERLINE,                                      X00041   
               LENGTH=10,                                              X00042   
               POS=(02,67)                                              00043   
         DFHMDF ATTRB=(ASKIP),                                         X00044   
               LENGTH=1,                                               X00045   
               POS=(02,78)                                              00046   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='PRIMARY TYPE..:',                              X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=15,                                              X00037   
               POS=(03,2)                                               00038   
APRMTYP  DFHMDF ATTRB=(UNPROT),                                        X00039   
               COLOR=GREEN,                                            X00040   
               HILIGHT=UNDERLINE,                                      X00041   
               LENGTH=1,                                               X00042   
               POS=(03,18)                                              00043   
         DFHMDF ATTRB=(ASKIP),                                         X00044   
               LENGTH=0,                                               X00045   
               POS=(03,20)                                              00046   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='(M,E,F)',                                      X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=7,                                               X00037   
               POS=(03,21)                                              00038   
ATYPDSC  DFHMDF ATTRB=(PROT),                                          X00039   
               COLOR=BLUE,                                             X00040   
               LENGTH=11,                                              X00042   
               POS=(03,29)                                              00043   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(03,41),                                            X00032   
               LENGTH=9                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='VENDOR NUMBER.:',                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=15,                                              X00063   
               POS=(03,51)                                              00064   
ADUNNBR  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=9,                                               X00068   
               POS=(03,67)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(03,77),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00047   
               INITIAL='STATUS........:',                              X00048   
               COLOR=NEUTRAL,                                          X00049   
               LENGTH=15,                                              X00050   
               POS=(04,2)                                               00051   
AVNSTAT  DFHMDF ATTRB=(UNPROT),                                        X00052   
               COLOR=GREEN,                                            X00053   
               HILIGHT=UNDERLINE,                                      X00054   
               LENGTH=1,                                               X00055   
               POS=(04,18)                                              00056   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(04,20),                                            X00032   
               LENGTH=01                                                00033   
         DFHMDF ATTRB=(PROT),                                          X00047   
               INITIAL='ENTITY ID:',                                   X00048   
               COLOR=NEUTRAL,                                          X00049   
               LENGTH=10,                                              X00050   
               POS=(04,28)                                              00051   
AENTID   DFHMDF ATTRB=(PROT),                                          X00052   
               COLOR=BLUE,                                             X00053   
               LENGTH=9,                                               X00055   
               PICOUT='ZZZZZZZZ9',                                     X00042   
               POS=(04,39)                                              00056   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='VENDOR ON HOLD:',                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=15,                                              X00063   
               POS=(04,51)                                              00064   
AVNHOLD  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=1,                                               X00068   
               POS=(04,67)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(04,69),                                            X00032   
               LENGTH=11                                                00033   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='NDA FLAG .....:',                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=15,                                              X00063   
               POS=(05,02)                                              00064   
ANDAIND  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=1,                                               X00068   
               POS=(05,18)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(05,20),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='PREPACK EDI...:',                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=15,                                              X00063   
               POS=(05,51)                                              00064   
APPEDI   DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=1,                                               X00068   
               POS=(05,67)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(05,69),                                            X00032   
               LENGTH=11                                                00033   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='USING FACTOR..:',                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=15,                                              X00063   
               POS=(06,02)                                              00064   
AUSEFAC  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=1,                                               X00068   
               POS=(06,18)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(06,20),                                            X00032   
               LENGTH=7                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='SEPARATE PYMTS...:',                           X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=18,                                              X00063   
               POS=(06,28)                                              00064   
ASEPPAY  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=1,                                               X00068   
               POS=(06,47)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(06,49),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='PAYMNT HANDLNG:',                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=15,                                              X00063   
               POS=(06,51)                                              00064   
APAYHND  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=2,                                               X00068   
               POS=(06,67)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(06,70),                                            X00032   
               LENGTH=10                                                00033   
*                                                                               
         DFHMDF ATTRB=(PROT),                                          X00047   
               INITIAL='PSOFT PARENTCO:',                              X00048   
               COLOR=NEUTRAL,                                          X00049   
               LENGTH=15,                                              X00050   
               POS=(07,2)                                               00051   
APRNTCO  DFHMDF ATTRB=(UNPROT),                                        X00052   
               COLOR=GREEN,                                            X00053   
               HILIGHT=UNDERLINE,                                      X00054   
               LENGTH=30,                                              X00055   
               POS=(07,18)                                              00056   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(07,49),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00060   
               INITIAL='PRNT VNDR NBR.:',                              X00061   
               COLOR=NEUTRAL,                                          X00062   
               LENGTH=15,                                              X00063   
               POS=(07,51)                                              00064   
APRNTNB  DFHMDF ATTRB=(UNPROT),                                        X00065   
               COLOR=GREEN,                                            X00066   
               HILIGHT=UNDERLINE,                                      X00067   
               LENGTH=9,                                               X00068   
               PICOUT='ZZZZZZZZZ',                                     X00042   
               POS=(07,67)                                              00069   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(07,77),                                            X00032   
               LENGTH=3                                                 00033   
*                                                                               
         DFHMDF ATTRB=(PROT),                                          X00086   
               INITIAL='----------------------',                       X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=22,                                              X00089   
               POS=(09,02)                                              00090   
         DFHMDF ATTRB=(PROT),                                          X00086   
               INITIAL='MERCHANDISE VENDOR INFORMATION',               X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=30,                                              X00089   
               POS=(09,25)                                              00090   
         DFHMDF ATTRB=(PROT),                                          X00086   
               INITIAL='----------------------',                       X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=22,                                              X00089   
               POS=(09,56)                                              00090   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(09,79),                                            X00032   
               LENGTH=1                                                 00033   
ADPTLBL  DFHMDF ATTRB=(PROT),                                          X00086   
               INITIAL='DEPARTMENT:',                                  X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=11,                                              X00089   
               POS=(10,02)                                              00090   
ADPTNBR  DFHMDF ATTRB=(UNPROT),                                        X00091   
               COLOR=GREEN,                                            X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               LENGTH=3,                                               X00094   
               POS=(10,14)                                              00095   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(10,18),                                            X00032   
               LENGTH=10                                                00033   
AINHLBL  DFHMDF ATTRB=(PROT),                                          X00099   
               INITIAL='INHOUSE.......:',                              X00100   
               COLOR=NEUTRAL,                                          X00101   
               LENGTH=15,                                              X00102   
               POS=(10,29)                                              00103   
AINHS    DFHMDF ATTRB=(UNPROT,NUM,NORM),                               X00104   
               COLOR=GREEN,                                            X00105   
               HILIGHT=UNDERLINE,                                      X00106   
               LENGTH=3,                                               X00107   
               PICOUT='ZZZ',                                           X00108   
               POS=(10,45)                                              00109   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(10,49),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00291   
               INITIAL='PSOFT PARENT CO.:',                            X00292   
               LENGTH=17,                                              X00293   
               COLOR=NEUTRAL,                                          X00083   
               POS=(10,51)                                              00295   
APARIND  DFHMDF ATTRB=(UNPROT),                                        X00283   
               COLOR=GREEN,                                            X00284   
               HILIGHT=UNDERLINE,                                      X00285   
               LENGTH=1,                                               X00286   
               POS=(10,69)                                              00287   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='(Y/N)',                                        X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=5,                                               X00037   
               POS=(10,71)                                              00038   
         DFHMDF ATTRB=(PROT),                                          X00086   
               INITIAL='-----------------------',                      X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=23,                                              X00089   
               POS=(11,02)                                              00090   
         DFHMDF ATTRB=(PROT),                                          X00086   
               INITIAL='EXPENSE VENDOR INFORMATION',                   X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=26,                                              X00089   
               POS=(11,26)                                              00090   
         DFHMDF ATTRB=(PROT),                                          X00086   
               INITIAL='-------------------------',                    X00087   
               COLOR=NEUTRAL,                                          X00088   
               LENGTH=25,                                              X00089   
               POS=(11,53)                                              00090   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(11,79),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00244   
               INITIAL='PARTNER.......:',                              X00245   
               LENGTH=15,                                              X00246   
               COLOR=NEUTRAL,                                          X00247   
               POS=(12,02)                                              00248   
APRTNR   DFHMDF ATTRB=(UNPROT),                                        X00249   
               COLOR=GREEN,                                            X00250   
               HILIGHT=UNDERLINE,                                      X00251   
               LENGTH=1,                                               X00252   
               POS=(12,18)                                              00253   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(12,20),                                            X00032   
               LENGTH=0                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='(Y/N)',                                        X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=5,                                               X00037   
               POS=(12,21)                                              00038   
         DFHMDF ATTRB=(PROT),                                          X00244   
               INITIAL='PARTNER TYPE...:',                             X00245   
               LENGTH=16,                                              X00246   
               COLOR=NEUTRAL,                                          X00247   
               POS=(12,29)                                              00248   
APTNRTY  DFHMDF ATTRB=(UNPROT),                                        X00249   
               COLOR=GREEN,                                            X00250   
               HILIGHT=UNDERLINE,                                      X00251   
               LENGTH=2,                                               X00252   
               POS=(12,46)                                              00253   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(12,49),                                            X00032   
               LENGTH=0                                                 00033   
APTRDSC  DFHMDF ATTRB=(PROT),                                          X00039   
               COLOR=BLUE,                                             X00040   
               LENGTH=20,                                              X00042   
               POS=(12,50)                                              00043   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(12,71),                                            X00032   
               LENGTH=9                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00244   
               INITIAL='SCAC..........:',                              X00245   
               LENGTH=15,                                              X00246   
               COLOR=NEUTRAL,                                          X00247   
               POS=(13,02)                                              00248   
ASCAC    DFHMDF ATTRB=(UNPROT),                                        X00249   
               COLOR=GREEN,                                            X00250   
               HILIGHT=UNDERLINE,                                      X00251   
               LENGTH=4,                                               X00252   
               POS=(13,18)                                              00253   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(13,23),                                            X00032   
               LENGTH=5                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00257   
               INITIAL='MANIFEST AS PRO:',                             X00258   
               LENGTH=16,                                              X00259   
               COLOR=NEUTRAL,                                          X00260   
               POS=(13,29)                                              00261   
AMANPRO  DFHMDF ATTRB=(UNPROT),                                        X00262   
               COLOR=GREEN,                                            X00263   
               HILIGHT=UNDERLINE,                                      X00264   
               LENGTH=1,                                               X00265   
               POS=(13,46)                                              00266   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(13,48),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00257   
               INITIAL='LINE OF CREDIT:',                              X00258   
               LENGTH=15,                                              X00259   
               COLOR=NEUTRAL,                                          X00260   
               POS=(13,50)                                              00261   
ALNCRDT  DFHMDF ATTRB=(UNPROT,NUM,NORM),                               X00262   
               COLOR=GREEN,                                            X00263   
               HILIGHT=UNDERLINE,                                      X00264   
               LENGTH=13,                                              X00265   
               PICOUT='ZZZZZZZZZZ.99',                                 X        
               POS=(13,66)                                              00266   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(13,80),                                            X00032   
               LENGTH=1                                                 00033   
*                                                                       00257   
         DFHMDF ATTRB=(PROT),                                          X00257   
               INITIAL='MTHLY CAPACITY:',                              X00258   
               LENGTH=15,                                              X00259   
               COLOR=NEUTRAL,                                          X00260   
               POS=(14,50)                                              00261   
ACPACTY  DFHMDF ATTRB=(UNPROT,NUM,NORM),                               X00262   
               COLOR=GREEN,                                            X00263   
               HILIGHT=UNDERLINE,                                      X00264   
               LENGTH=11,                                              X00265   
               PICOUT='ZZZZZZZZZZ9',                                   X        
               POS=(14,66)                                              00266   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(14,78),                                            X00032   
               LENGTH=1                                                 00033   
*                                                                       00257   
*        DFHMDF ATTRB=(PROT),                                           00257   
*              INITIAL='RELATIONSHIPS?:',                               00258   
*              LENGTH=15,                                               00259   
*              COLOR=NEUTRAL,                                           00260   
*              POS=(15,02)                                              00261   
*RELIND  DFHMDF POS=(15,18),LENGTH=01,ATTRB=(UNPROT,NORM),              00072**3
*              HILIGHT=UNDERLINE,                                       00073**3
*              COLOR=GREEN                                              00074**3
*        DFHMDF POS=(15,20),LENGTH=00,ATTRB=(ASKIP)                     00072**3
*        DFHMDF ATTRB=(PROT),                                           00034   
*              INITIAL='(Y/N)',                                         00035   
*              COLOR=NEUTRAL,                                           00036   
*              LENGTH=5,                                                00037   
*              POS=(15,21)                                              00038   
*        DFHMDF ATTRB=(PROT),                                           00274   
*              INITIAL='RELATED CO ID..:',                              00275   
*              LENGTH=16,                                               00276   
*              COLOR=NEUTRAL,                                           00277   
*              POS=(15,29)                                              00278   
*RELENT  DFHMDF ATTRB=(UNPROT,NUM,NORM),                                00262   
*              COLOR=GREEN,                                             00263   
*              HILIGHT=UNDERLINE,                                       00264   
*              LENGTH=09,                                               00265   
*              PICOUT='ZZZZZZZZZ',                                      00042   
*              POS=(15,46)                                              00266   
*RELCMP  DFHMDF ATTRB=(PROT),                                           00279   
*              COLOR=BLUE,                                              00280   
*              LENGTH=23,                                               00281   
*              POS=(15,56)                                              00282   
*                                                                       00257   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(16,02),                                            X00032   
               LENGTH=78                                                00033   
         DFHMDF ATTRB=(PROT),                                          X00296   
               INITIAL='CAPITAL',                                      X00297   
               COLOR=NEUTRAL,                                          X00298   
               LENGTH=7,                                               X00299   
               POS=(17,02)                                              00300   
         DFHMDF ATTRB=(PROT),                                          X00296   
               XINIT=50,                                               X00297   
               COLOR=NEUTRAL,                                          X00298   
               LENGTH=1,                                               X00299   
               POS=(17,10)                                              00300   
         DFHMDF ATTRB=(PROT),                                          X00296   
               INITIAL='EXPENSE:',                                     X00297   
               COLOR=NEUTRAL,                                          X00298   
               LENGTH=8,                                               X00299   
               POS=(17,12)                                              00300   
ACAPEXP  DFHMDF ATTRB=(UNPROT),                                        X00301   
               COLOR=GREEN,                                            X00302   
               HILIGHT=UNDERLINE,                                      X00303   
               LENGTH=1,                                               X00304   
               POS=(17,21)                                              00305   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(17,23),                                            X00032   
               LENGTH=0                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='(Y/N)',                                        X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=5,                                               X00037   
               POS=(17,24)                                              00038   
AEXPLBL  DFHMDF ATTRB=(PROT),                                          X00296   
               INITIAL='NONMDS DEPT:',                                 X00297   
               COLOR=NEUTRAL,                                          X00298   
               LENGTH=12,                                              X00299   
               POS=(17,30)                                              00300   
ADPTEXP  DFHMDF ATTRB=(UNPROT),                                        X00301   
               COLOR=GREEN,                                            X00302   
               HILIGHT=UNDERLINE,                                      X00303   
               LENGTH=3,                                               X00304   
               POS=(17,43)                                              00305   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(17,48),                                            X00032   
               LENGTH=0                                                 00033   
*        DFHMDF ATTRB=(PROT),                                           00353   
*              INITIAL='CARTON LABELING:',                              00354   
*              LENGTH=16,                                               00355   
*              COLOR=NEUTRAL,                                           00356   
*              POS=(17,55)                                              00357   
*CRTLBL  DFHMDF ATTRB=(UNPROT),                                         00358   
*              COLOR=GREEN,                                             00359   
*              HILIGHT=UNDERLINE,                                       00360   
*              LENGTH=1,                                                00361   
*              POS=(17,72)                                              00362   
*        DFHMDF ATTRB=(ASKIP),                                          00031   
*              POS=(17,74),                                             00032   
*              LENGTH=0                                                 00033   
*        DFHMDF ATTRB=(PROT),                                           00034   
*              INITIAL='(Y/N)',                                         00035   
*              COLOR=NEUTRAL,                                           00036   
*              LENGTH=5,                                                00037   
*              POS=(17,75)                                              00038   
*                                                                       00033   
         DFHMDF ATTRB=(PROT),                                          X00270   
               INITIAL='CLASSIFICATION...:',                           X00271   
               COLOR=NEUTRAL,                                          X00272   
               LENGTH=18,                                              X00273   
               POS=(18,02)                                              00274   
ACLASFC  DFHMDF ATTRB=(UNPROT),                                        X00275   
               COLOR=GREEN,                                            X00276   
               HILIGHT=UNDERLINE,                                      X00277   
               LENGTH=1,                                               X00278   
               POS=(18,21)                                              00279   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(18,23),                                            X00032   
               LENGTH=0                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='(E/R)',                                        X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=5,                                               X00037   
               POS=(18,24)                                              00038   
         DFHMDF ATTRB=(PROT),                                          X00270   
               INITIAL='PERSISTENCE:',                                 X00271   
               COLOR=NEUTRAL,                                          X00272   
               LENGTH=12,                                              X00273   
               POS=(18,30)                                              00274   
APERSIS  DFHMDF ATTRB=(UNPROT),                                        X00275   
               COLOR=GREEN,                                            X00276   
               HILIGHT=UNDERLINE,                                      X00277   
               LENGTH=1,                                               X00278   
               POS=(18,43)                                              00279   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(18,45),                                            X00032   
               LENGTH=9                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00353   
               INITIAL='1099 VENDOR....:',                             X00354   
               LENGTH=16,                                              X00355   
               COLOR=NEUTRAL,                                          X00356   
               POS=(18,55)                                              00357   
A1099    DFHMDF ATTRB=(UNPROT),                                        X00358   
               COLOR=GREEN,                                            X00359   
               HILIGHT=UNDERLINE,                                      X00360   
               LENGTH=1,                                               X00361   
               POS=(18,72)                                              00362   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(18,74),                                            X00032   
               LENGTH=0                                                 00033   
         DFHMDF ATTRB=(PROT),                                          X00034   
               INITIAL='(Y/N)',                                        X00035   
               COLOR=NEUTRAL,                                          X00036   
               LENGTH=5,                                               X00037   
               POS=(18,75)                                              00038   
         DFHMDF ATTRB=(PROT),                                          X00353   
               INITIAL='WITHHOLDING CDE:',                             X00354   
               LENGTH=16,                                              X00355   
               COLOR=NEUTRAL,                                          X00356   
               POS=(19,55)                                              00357   
AWTHCDE  DFHMDF ATTRB=(UNPROT),                                        X00358   
               COLOR=GREEN,                                            X00359   
               HILIGHT=UNDERLINE,                                      X00360   
               LENGTH=5,                                               X00361   
               POS=(19,72)                                              00362   
         DFHMDF ATTRB=(ASKIP),                                         X00031   
               POS=(19,79),                                            X00032   
               LENGTH=1                                                 00033   
         DFHMSD TYPE=FINAL                                              00366   
         END                                                            00367   
