*          DATA SET VNKM017    AT LEVEL 001 AS OF 06/16/95                      
*          DATA SET VNKM017    AT LEVEL 003 AS OF 06/08/95              00001   
*          DATA SET VNKM017A1  AT LEVEL 002 AS OF 04/18/95              00002   
*          DATA SET VNKM017    AT LEVEL 005 AS OF 02/05/93              00003   
  PRINT  NOGEN                                                          00004   
*-------------------------------------------------------------------*   00005   
*                                                                   *   00006   
*        MAPSET  VNKM017                                            *   00007   
*        MAP     VN017A                                             *   00008   
*        PROGRAM VNKCS017                                           *   00009   
*        TRANSID V017 - VENDOR DC UPDATE                                00010   
*        SYSTEM  CICS ARCHITECTURE                                  *   00011   
*                                                                   *   00012   
*-------------------------------------------------------------------*   00013   
VNKM017 DFHMSD TYPE=MAP,                                               X00014   
               MODE=INOUT,                                             X00015   
               LANG=COBOL,                                             X00016   
               TIOAPFX=YES,                                            X00017   
               CTRL=(FREEKB)                                            00018   
VN017A  DFHMDI LINE=2,COLUMN=1,                                        X00019   
               SIZE=(19,80),                                           X00020   
               MAPATTS=(COLOR,HILIGHT),                                X00021   
               DSATTS=(COLOR,HILIGHT)                                   00022   
*                                                                       00023   
AVENDO1 DFHMDF ATTRB=(ASKIP,BRT),                                      X00024   
               LENGTH=08,                                              X00026   
               COLOR=NEUTRAL,                                          X00027   
               POS=(02,10)                                              00028   
AVENDOR DFHMDF ATTRB=(ASKIP,BRT),                                      X00029   
               LENGTH=30,                                              X00030   
               COLOR=NEUTRAL,                                          X00031   
               POS=(02,19)                                              00033   
*                                                                       00023   
A856AS1 DFHMDF ATTRB=(ASKIP,BRT),                                      X00024   
               INITIAL='EDI856 (ASN)..........:',                      X00025   
               LENGTH=23,                                              X00026   
               COLOR=NEUTRAL,                                          X00027   
               POS=(04,10)                                              00028   
A856ASN DFHMDF ATTRB=(UNPROT,NORM),                                    X00029   
               LENGTH=1,                                               X00030   
               COLOR=GREEN,                                            X00031   
               HILIGHT=UNDERLINE,                                      X00032   
               POS=(04,34)                                              00033   
A856AS2 DFHMDF ATTRB=(ASKIP),                                          X00034   
               LENGTH=1,                                               X00035   
               COLOR=NEUTRAL,                                          X00036   
               POS=(04,36)                                              00037   
A856AS3 DFHMDF ATTRB=(ASKIP,BRT),                                      X00038   
               INITIAL='(Y, N, OR P)',                                 X00039   
               LENGTH=12,                                              X00040   
               COLOR=NEUTRAL,                                          X00041   
               POS=(04,38)                                              00042   
*                                                                       00043   
A856AS4 DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='(Y=USE ASN DATA FOR ADVANCE SHIPMENT NOTIFICATIX00045   
               ON REPORT)',                                            X00046   
               LENGTH=58,                                              X00047   
               COLOR=NEUTRAL,                                          X00048   
               POS=(05,12)                                              00049   
*                                                                       00050   
A856AS5 DFHMDF ATTRB=(ASKIP,BRT),                                      X00051   
               INITIAL='(P=USE ASN DATA TO CREATE PACKSLIPS FOR THE DC)X00052   
               ',                                                      X00053   
               LENGTH=47,                                              X00054   
               COLOR=NEUTRAL,                                          X00055   
               POS=(06,12)                                              00056   
*                                                                       00084   
A214FO1 DFHMDF ATTRB=(ASKIP,BRT),                                      X00085   
               INITIAL='EDI214 FORECAST (SHIP):',                      X00086   
               LENGTH=23,                                              X00087   
               COLOR=NEUTRAL,                                          X00088   
               POS=(08,10)                                              00089   
A214FOR DFHMDF ATTRB=(UNPROT,NORM),                                    X00090   
               LENGTH=1,                                               X00091   
               COLOR=GREEN,                                            X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               POS=(08,34)                                              00094   
A214FO2 DFHMDF ATTRB=(ASKIP),                                          X00095   
               LENGTH=1,                                               X00096   
               COLOR=NEUTRAL,                                          X00097   
               POS=(08,36)                                              00098   
A214FO3 DFHMDF ATTRB=(ASKIP,BRT),                                      X00099   
               INITIAL='(Y OR N)',                                     X00100   
               LENGTH=08,                                              X00101   
               COLOR=NEUTRAL,                                          X00102   
               POS=(08,38)                                              00103   
*                                                                       00104   
A214FO4 DFHMDF ATTRB=(ASKIP,BRT),                                      X00105   
               INITIAL='(Y=USE SHIP DATA TO CREATE SHIPMENTS FOR THE DCX00106   
               )',                                                     X00107   
               LENGTH=48,                                              X00108   
               COLOR=NEUTRAL,                                          X00109   
               POS=(09,12)                                              00110   
*                                                                       00057   
A856FO1 DFHMDF ATTRB=(ASKIP,BRT),                                      X00058   
               INITIAL='EDI856 FORECAST (ASN).:',                      X00059   
               LENGTH=23,                                              X00060   
               COLOR=NEUTRAL,                                          X00061   
               POS=(11,10)                                              00062   
A856FOR DFHMDF ATTRB=(UNPROT,NORM),                                    X00063   
               LENGTH=1,                                               X00064   
               COLOR=GREEN,                                            X00065   
               HILIGHT=UNDERLINE,                                      X00066   
               POS=(11,34)                                              00067   
A856FO2 DFHMDF ATTRB=(ASKIP),                                          X00068   
               LENGTH=1,                                               X00069   
               COLOR=NEUTRAL,                                          X00070   
               POS=(11,36)                                              00071   
A856FO3 DFHMDF ATTRB=(ASKIP,BRT),                                      X00072   
               INITIAL='(Y OR N)',                                     X00073   
               LENGTH=08,                                              X00074   
               COLOR=NEUTRAL,                                          X00075   
               POS=(11,38)                                              00076   
*                                                                       00077   
A856FO4 DFHMDF ATTRB=(ASKIP,BRT),                                      X00078   
               INITIAL='(Y=USE ASN DATA TO CREATE SHIPMENTS FOR THE DC)X00079   
               ',                                                      X00080   
               LENGTH=47,                                              X00081   
               COLOR=NEUTRAL,                                          X00082   
               POS=(12,12)                                              00083   
*                                                                       00023   
APROAS1 DFHMDF ATTRB=(ASKIP,BRT),                                      X00024   
               INITIAL='856 (ASN)................:',                   X00025   
               LENGTH=26,                                              X00026   
               COLOR=NEUTRAL,                                          X00027   
               POS=(13,10)                                              00028   
APROASN DFHMDF ATTRB=(UNPROT,NORM),                                    X00029   
               LENGTH=1,                                               X00030   
               COLOR=GREEN,                                            X00031   
               HILIGHT=UNDERLINE,                                      X00032   
               POS=(13,38)                                              00033   
APROAS2 DFHMDF ATTRB=(ASKIP),                                          X00034   
               LENGTH=1,                                               X00035   
               COLOR=NEUTRAL,                                          X00036   
               POS=(13,40)                                              00037   
APROAS3 DFHMDF ATTRB=(ASKIP,BRT),                                      X00038   
               INITIAL='(Y, N, OR P)',                                 X00039   
               LENGTH=12,                                              X00040   
               COLOR=NEUTRAL,                                          X00041   
               POS=(13,42)                                              00042   
*                                                                       00043   
APROAS4 DFHMDF ATTRB=(ASKIP,BRT),                                      X00044   
               INITIAL='(Y=USE ASN DATA FOR ADVANCE SHIPMENT NOTIFICATIX00045   
               ON REPORT)        ',                                    X00046   
               LENGTH=65,                                              X00047   
               COLOR=NEUTRAL,                                          X00048   
               POS=(14,12)                                              00049   
*                                                                       00050   
APROAS5 DFHMDF ATTRB=(ASKIP,BRT),                                      X00051   
               INITIAL='(P=USE ASN DATA TO CREATE PACKSLIPS FOR THE DC)X00052   
                       ',                                              X00053   
               LENGTH=55,                                              X00054   
               COLOR=NEUTRAL,                                          X00055   
               POS=(15,12)                                              00056   
*                                                                       00084   
A128CA1 DFHMDF ATTRB=(ASKIP,BRT),                                      X00085   
               INITIAL='UCC128 CARTON INFORMATION:',                   X00086   
               LENGTH=26,                                              X00087   
               COLOR=NEUTRAL,                                          X00088   
               POS=(18,10)                                              00089   
A128CAR DFHMDF ATTRB=(UNPROT,NORM),                                    X00090   
               LENGTH=1,                                               X00091   
               COLOR=GREEN,                                            X00092   
               HILIGHT=UNDERLINE,                                      X00093   
               POS=(18,38)                                              00094   
A128CA2 DFHMDF ATTRB=(ASKIP),                                          X00095   
               LENGTH=1,                                               X00096   
               COLOR=NEUTRAL,                                          X00097   
               POS=(18,40)                                              00098   
A128CA3 DFHMDF ATTRB=(ASKIP,BRT),                                      X00099   
               INITIAL='(Y OR N)',                                     X00100   
               LENGTH=08,                                              X00101   
               COLOR=NEUTRAL,                                          X00102   
               POS=(18,42)                                              00103   
*                                                                       00104   
A128CA4 DFHMDF ATTRB=(ASKIP,BRT),                                      X00105   
               INITIAL='(Y=USE ASN DATA TO CREATE CARTON INFORMATION)',X00106   
               LENGTH=45,                                              X00108   
               COLOR=NEUTRAL,                                          X00109   
               POS=(19,12)                                              00110   
*                                                                       00111   
         DFHMSD TYPE=FINAL                                              00112   
         END                                                            00113   
