*          DATA SET VNKM027                                                     
*********************************************************************** 00001   
*                                                                       00005   
*        MAPSET  : VNKM027                                              00005   
*        MAP     : VN027A                                               00006   
*        PROGRAM : VNKCS027                                             00007   
*        TRANSID : V027 - VEND OFF-INVOICE PROGRAM MAINTENANCE          00008   
*        SYSTEM  : CICS ARCHITECTURE                                    00009   
*                                                                       00005   
*********************************************************************** 00005   
VNKM027  DFHMSD TYPE=MAP,                                              X00006   
               CTRL=(FREEKB),                                          X00007   
               LANG=COBOL,                                             X00008   
               MODE=INOUT,                                             X00009   
               TIOAPFX=YES                                              00010   
VN027A   DFHMDI SIZE=(19,080),                                         X00011   
               MAPATTS=(COLOR,HILIGHT),                                X00012   
               DSATTS=(COLOR,HILIGHT),                                 X00013   
               LINE=02,                                                X00014   
               COLUMN=01                                                00015   
*                                                                       00015   
         DFHMDF POS=(01,002),                                          X00016   
               COLOR=NEUTRAL,                                          X00017   
               ATTRB=(ASKIP,NORM),                                     X00018   
               LENGTH=011,                                             X00019   
               INITIAL='DEPARTMENT:'                                    00020   
ADPTNBR  DFHMDF POS=(01,014),                                          X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               LENGTH=003                                               00024   
         DFHMDF POS=(01,023),                                          X00025   
               COLOR=NEUTRAL,                                          X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               LENGTH=012,                                             X00028   
               INITIAL='VENDOR NAME:'                                   00029   
AVNNAME  DFHMDF POS=(01,036),                                          X00030   
               COLOR=BLUE,                                             X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=030                                               00033   
*                                                                       00015   
         DFHMDF POS=(02,002),                                          X00034   
               COLOR=NEUTRAL,                                          X00035   
               ATTRB=(ASKIP,NORM),                                     X00036   
               LENGTH=011,                                             X00037   
               INITIAL='INHOUSE...:'                                    00038   
AINHS    DFHMDF POS=(02,014),                                          X00039   
               COLOR=BLUE,                                             X00040   
               ATTRB=(ASKIP,NUM,NORM),                                 X00041   
               PICOUT='ZZZ',                                           X00042   
               LENGTH=003                                               00043   
         DFHMDF POS=(02,023),                                          X00025   
               COLOR=NEUTRAL,                                          X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               LENGTH=012,                                             X00028   
               INITIAL='DUNS NUMBER:'                                   00029   
ADUNNBR  DFHMDF POS=(02,036),                                          X00030   
               COLOR=BLUE,                                             X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=009                                               00033   
*                                                                       00015   
**************                                                          00015**3
        DFHMDF POS=(04,44),LENGTH=05,ATTRB=(ASKIP,NORM),               C00016**3
               COLOR=NEUTRAL,INITIAL='ITEMS'                            00017**3
ASTRTIT DFHMDF POS=(04,50),LENGTH=05,ATTRB=(NUM,UNPROT,NORM),          C00018**3
               COLOR=GREEN,                                            C00019**3
               HILIGHT=UNDERLINE,                                      C00020**3
               PICOUT='ZZZZ9'                                           00021**3
        DFHMDF POS=(04,56),LENGTH=02,ATTRB=(ASKIP,NORM),               C00022**3
               COLOR=NEUTRAL,                                          C00023**3
               INITIAL='TO'                                             00024**3
AENDIT  DFHMDF POS=(04,59),LENGTH=05,ATTRB=(ASKIP,NORM),               C00025**3
               COLOR=BLUE,                                             C00026**3
               PICOUT='ZZZZ9'                                           00027**3
        DFHMDF POS=(04,65),LENGTH=02,ATTRB=(ASKIP,NORM),               C00028**3
               COLOR=NEUTRAL,                                          C00029**3
               INITIAL='OF'                                             00030**3
ATOTIT  DFHMDF POS=(04,68),LENGTH=05,ATTRB=(ASKIP,NORM),               C00031**3
               COLOR=BLUE,                                             C00032**3
               PICOUT='ZZZZ9'                                           00033**3
*                                                                       00034**3
        DFHMDF POS=(06,03),LENGTH=11,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='   AP      '                                    00040**3
        DFHMDF POS=(06,36),LENGTH=08,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='NET NET '                                       00040**3
        DFHMDF POS=(06,45),LENGTH=09,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL=' POSTING '                                      00040**3
*                                                                       00034**3
        DFHMDF POS=(07,02),LENGTH=07,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='S  TRCD'                                        00040**3
        DFHMDF POS=(07,11),LENGTH=07,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='PERCENT'                                        00040**3
        DFHMDF POS=(07,19),LENGTH=11,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='DESCRIPTION'                                    00040**3
        DFHMDF POS=(07,36),LENGTH=08,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='RTV DISC'                                       00040**3
        DFHMDF POS=(07,45),LENGTH=09,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='FREQUENCY'                                      00040**3
        DFHMDF POS=(07,56),LENGTH=09,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='EFFECTIVE'                                      00040**3
        DFHMDF POS=(07,69),LENGTH=07,ATTRB=(PROT,NORM),                C00038**3
               COLOR=NEUTRAL,                                          C00039**3
               INITIAL='EXPIRES'                                        00040**3
*                                                                       00034**3
ASEL01  DFHMDF POS=(08,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(08,04),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ATRCD01 DFHMDF POS=(08,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(08,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT01 DFHMDF POS=(08,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(08,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC01 DFHMDF POS=(08,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV01 DFHMDF POS=(08,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(08,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC01 DFHMDF POS=(08,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(08,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN01 DFHMDF POS=(08,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ01 DFHMDF POS=(08,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM01 DFHMDF POS=(08,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD01 DFHMDF POS=(08,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY01 DFHMDF POS=(08,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(08,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM01 DFHMDF POS=(08,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD01 DFHMDF POS=(08,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY01 DFHMDF POS=(08,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(08,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL02  DFHMDF POS=(09,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(09,04),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ATRCD02 DFHMDF POS=(09,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(09,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT02 DFHMDF POS=(09,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(09,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC02 DFHMDF POS=(09,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV02 DFHMDF POS=(09,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(09,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC02 DFHMDF POS=(09,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(09,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN02 DFHMDF POS=(09,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ02 DFHMDF POS=(09,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM02 DFHMDF POS=(09,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD02 DFHMDF POS=(09,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY02 DFHMDF POS=(09,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(09,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM02 DFHMDF POS=(09,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD02 DFHMDF POS=(09,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY02 DFHMDF POS=(09,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(09,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL03  DFHMDF POS=(10,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(10,04),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ATRCD03 DFHMDF POS=(10,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(10,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT03 DFHMDF POS=(10,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(10,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC03 DFHMDF POS=(10,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV03 DFHMDF POS=(10,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(10,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC03 DFHMDF POS=(10,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(10,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN03 DFHMDF POS=(10,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ03 DFHMDF POS=(10,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM03 DFHMDF POS=(10,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD03 DFHMDF POS=(10,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY03 DFHMDF POS=(10,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(10,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM03 DFHMDF POS=(10,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD03 DFHMDF POS=(10,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY03 DFHMDF POS=(10,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(10,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL04  DFHMDF POS=(11,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(11,04),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ATRCD04 DFHMDF POS=(11,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(11,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT04 DFHMDF POS=(11,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(11,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC04 DFHMDF POS=(11,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV04 DFHMDF POS=(11,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(11,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC04 DFHMDF POS=(11,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(11,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN04 DFHMDF POS=(11,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ04 DFHMDF POS=(11,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM04 DFHMDF POS=(11,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD04 DFHMDF POS=(11,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY04 DFHMDF POS=(11,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(11,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM04 DFHMDF POS=(11,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD04 DFHMDF POS=(11,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY04 DFHMDF POS=(11,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(11,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL05  DFHMDF POS=(12,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(12,04),LENGTH=01,ATTRB=(ASKIP)                      00075**3
ATRCD05 DFHMDF POS=(12,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(12,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT05 DFHMDF POS=(12,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(12,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC05 DFHMDF POS=(12,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV05 DFHMDF POS=(12,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(12,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC05 DFHMDF POS=(12,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(12,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN05 DFHMDF POS=(12,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ05 DFHMDF POS=(12,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM05 DFHMDF POS=(12,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD05 DFHMDF POS=(12,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY05 DFHMDF POS=(12,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(12,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM05 DFHMDF POS=(12,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD05 DFHMDF POS=(12,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY05 DFHMDF POS=(12,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(12,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL06  DFHMDF POS=(13,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(13,04),LENGTH=01,ATTRB=(ASKIP)                      00075**3
ATRCD06 DFHMDF POS=(13,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(13,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT06 DFHMDF POS=(13,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(13,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC06 DFHMDF POS=(13,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV06 DFHMDF POS=(13,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(13,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC06 DFHMDF POS=(13,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(13,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN06 DFHMDF POS=(13,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ06 DFHMDF POS=(13,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM06 DFHMDF POS=(13,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD06 DFHMDF POS=(13,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY06 DFHMDF POS=(13,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(13,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM06 DFHMDF POS=(13,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD06 DFHMDF POS=(13,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY06 DFHMDF POS=(13,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(13,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL07  DFHMDF POS=(14,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(14,04),LENGTH=01,ATTRB=(ASKIP)                      00075**3
ATRCD07 DFHMDF POS=(14,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(14,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT07 DFHMDF POS=(14,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(14,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC07 DFHMDF POS=(14,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV07 DFHMDF POS=(14,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(14,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC07 DFHMDF POS=(14,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(14,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN07 DFHMDF POS=(14,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ07 DFHMDF POS=(14,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM07 DFHMDF POS=(14,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD07 DFHMDF POS=(14,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY07 DFHMDF POS=(14,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(14,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM07 DFHMDF POS=(14,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD07 DFHMDF POS=(14,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY07 DFHMDF POS=(14,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(14,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL08  DFHMDF POS=(15,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(15,04),LENGTH=01,ATTRB=(ASKIP)                      00075**3
ATRCD08 DFHMDF POS=(15,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(15,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT08 DFHMDF POS=(15,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(15,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC08 DFHMDF POS=(15,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV08 DFHMDF POS=(15,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(15,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC08 DFHMDF POS=(15,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(15,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN08 DFHMDF POS=(15,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ08 DFHMDF POS=(15,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM08 DFHMDF POS=(15,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD08 DFHMDF POS=(15,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY08 DFHMDF POS=(15,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(15,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM08 DFHMDF POS=(15,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD08 DFHMDF POS=(15,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY08 DFHMDF POS=(15,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(15,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL09  DFHMDF POS=(16,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(16,04),LENGTH=01,ATTRB=(ASKIP)                      00075**3
ATRCD09 DFHMDF POS=(16,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(16,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT09 DFHMDF POS=(16,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(16,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC09 DFHMDF POS=(16,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV09 DFHMDF POS=(16,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(16,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC09 DFHMDF POS=(16,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(16,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN09 DFHMDF POS=(16,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ09 DFHMDF POS=(16,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM09 DFHMDF POS=(16,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD09 DFHMDF POS=(16,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY09 DFHMDF POS=(16,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(16,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM09 DFHMDF POS=(16,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD09 DFHMDF POS=(16,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY09 DFHMDF POS=(16,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(16,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL10  DFHMDF POS=(17,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(17,04),LENGTH=01,ATTRB=(ASKIP)                      00075**3
ATRCD10 DFHMDF POS=(17,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(17,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT10 DFHMDF POS=(17,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(17,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC10 DFHMDF POS=(17,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV10 DFHMDF POS=(17,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(17,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC10 DFHMDF POS=(17,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(17,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN10 DFHMDF POS=(17,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ10 DFHMDF POS=(17,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM10 DFHMDF POS=(17,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD10 DFHMDF POS=(17,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY10 DFHMDF POS=(17,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(17,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM10 DFHMDF POS=(17,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD10 DFHMDF POS=(17,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY10 DFHMDF POS=(17,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(17,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
ASEL11  DFHMDF POS=(18,02),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(18,04),LENGTH=01,ATTRB=(ASKIP)                      00075**3
ATRCD11 DFHMDF POS=(18,06),                                            C00077**3
               COLOR=GREEN,                                            C00060   
               ATTRB=(UNPROT,NORM),                                    C00061   
               HILIGHT=UNDERLINE,                                      C00062   
               LENGTH=02                                                00063   
        DFHMDF POS=(18,09),LENGTH=01,ATTRB=(ASKIP)                      00072**3
APRCT11 DFHMDF POS=(18,11),                                            C00079**3
               COLOR=GREEN,                                            C00409   
               ATTRB=(UNPROT,NORM),                                    C00410   
               HILIGHT=UNDERLINE,                                      C00411   
               LENGTH=005,                                             C00412   
               PICOUT='Z9.99'                                           00413   
        DFHMDF POS=(18,17),LENGTH=01,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=NEUTRAL,INITIAL='%'                                00080**3
ADESC11 DFHMDF POS=(18,19),LENGTH=17,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
ANRTV11 DFHMDF POS=(18,37),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(18,39),LENGTH=01,ATTRB=(ASKIP)                      00072**3
ANDSC11 DFHMDF POS=(18,41),LENGTH=01,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
        DFHMDF POS=(18,43),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AFQIN11 DFHMDF POS=(18,45),LENGTH=02,ATTRB=(UNPROT,NORM),              C00072**3
               HILIGHT=UNDERLINE,                                      C00073**3
               COLOR=GREEN                                              00074**3
AFREQ11 DFHMDF POS=(18,48),LENGTH=07,ATTRB=(ASKIP,NORM),               C00079**3
               COLOR=BLUE                                               00080**3
AEFMM11 DFHMDF POS=(18,56),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFDD11 DFHMDF POS=(18,59),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEFCY11 DFHMDF POS=(18,62),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(18,67),LENGTH=01,ATTRB=(ASKIP)                      00072**3
AEXMM11 DFHMDF POS=(18,69),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXDD11 DFHMDF POS=(18,72),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=02                                                00120   
AEXCY11 DFHMDF POS=(18,75),                                            C00121   
               COLOR=GREEN,                                            C00119   
               ATTRB=(UNPROT),                                         C00118   
               HILIGHT=UNDERLINE,                                      C        
               LENGTH=04                                                00120   
        DFHMDF POS=(18,80),LENGTH=01,ATTRB=(ASKIP)                      00072**3
*                                                                       00034**3
*                                                                       00015   
         DFHMSD TYPE=FINAL                                              00541   
         END                                                            00542   
