*          DATA SET VNKM012    AT LEVEL 004 AS OF 06/05/07                      
*          DATA SET VNKM012    AT LEVEL 003 AS OF 05/29/07                      
*          DATA SET VNKM012    AT LEVEL 002 AS OF 08/18/94                      
*********************************************************************** 00001   
*                                                                       00005   
*        MAPSET  : VNKM012                                              00005   
*        MAP     : VN012A                                               00006   
*        PROGRAM : VNKCS012                                             00007   
*        TRANSID : V012 - VENDOR PROGRAM MAINTENANCE                    00008   
*        SYSTEM  : CICS ARCHITECTURE                                    00009   
*                                                                       00005   
*********************************************************************** 00005   
VNKM012  DFHMSD TYPE=MAP,                                              X00006   
               CTRL=(FREEKB),                                          X00007   
               LANG=COBOL,                                             X00008   
               MODE=INOUT,                                             X00009   
               TIOAPFX=YES                                              00010   
VN012A   DFHMDI SIZE=(19,080),                                         X00011   
               MAPATTS=(COLOR,HILIGHT),                                X00012   
               DSATTS=(COLOR,HILIGHT),                                 X00013   
               LINE=02,                                                X00014   
               COLUMN=01                                                00015   
*                                                                       00038   
         DFHMDF POS=(01,002),                                          X00016   
               COLOR=NEUTRAL,                                          X00017   
               ATTRB=(ASKIP,NORM),                                     X00018   
               LENGTH=011,                                             X00019   
               INITIAL='DEPARTMENT:'                                    00020   
ADPTNBR  DFHMDF POS=(01,014),                                          X00021   
               COLOR=BLUE,                                             X00022   
               ATTRB=(ASKIP,NORM),                                     X00023   
               LENGTH=003                                               00024   
         DFHMDF POS=(01,023),                                          X00025   
               COLOR=NEUTRAL,                                          X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               LENGTH=012,                                             X00028   
               INITIAL='VENDOR NAME:'                                   00029   
AVNNAME  DFHMDF POS=(01,036),                                          X00030   
               COLOR=BLUE,                                             X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=030                                               00033   
*                                                                       00038   
         DFHMDF POS=(02,002),                                          X00034   
               COLOR=NEUTRAL,                                          X00035   
               ATTRB=(ASKIP,NORM),                                     X00036   
               LENGTH=011,                                             X00037   
               INITIAL='INHOUSE...:'                                    00038   
AINHS    DFHMDF POS=(02,014),                                          X00039   
               COLOR=BLUE,                                             X00040   
               ATTRB=(ASKIP,NUM,NORM),                                 X00041   
               PICOUT='ZZZ',                                           X00042   
               LENGTH=003                                               00043   
         DFHMDF POS=(02,023),                                          X00025   
               COLOR=NEUTRAL,                                          X00026   
               ATTRB=(ASKIP,NORM),                                     X00027   
               LENGTH=012,                                             X00028   
               INITIAL='DUNS NUMBER:'                                   00029   
ADUNNBR  DFHMDF POS=(02,036),                                          X00030   
               COLOR=BLUE,                                             X00031   
               ATTRB=(ASKIP,NORM),                                     X00032   
               LENGTH=009                                               00033   
*                                                                       00038   
         DFHMDF POS=(04,002),                                          X00044   
               COLOR=NEUTRAL,                                          X00045   
               ATTRB=(ASKIP,NORM),                                     X00046   
               LENGTH=022,                                             X00047   
               INITIAL='----PRE-TICKETING-----'                         00048   
         DFHMDF POS=(04,026),                                          X00049   
               COLOR=NEUTRAL,                                          X00050   
               ATTRB=(ASKIP,NORM),                                     X00051   
               LENGTH=052,                                             X00376   
               INITIAL='-------------SERVICES/PROGRAMS-------------    X00377   
                    '                                                   00378   
*                                                                       00038   
         DFHMDF POS=(05,002),                                          X00054   
               COLOR=NEUTRAL,                                          X00055   
               ATTRB=(ASKIP,NORM),                                     X00056   
               LENGTH=013,                                             X00057   
               INITIAL='(Y,N,P).....:'                                  00058   
ATKIND1  DFHMDF POS=(05,016),                                          X00059   
               COLOR=GREEN,                                            X00060   
               ATTRB=(UNPROT,NORM),                                    X00061   
               HILIGHT=UNDERLINE,                                      X00062   
               LENGTH=001                                               00063   
         DFHMDF POS=(05,018),                                          X00064   
               COLOR=NEUTRAL,                                          X00065   
               ATTRB=(ASKIP,NORM),                                     X00066   
               LENGTH=001                                               00067   
         DFHMDF POS=(05,026),                                          X00137   
               COLOR=NEUTRAL,                                          X00138   
               ATTRB=(ASKIP,NORM),                                     X00139   
               LENGTH=014,                                             X00140   
               INITIAL='DC SPLIT REQD:'                                 00141   
ADCSIND  DFHMDF POS=(05,041),                                          X00142   
               COLOR=GREEN,                                            X00143   
               ATTRB=(UNPROT,NORM),                                    X00144   
               HILIGHT=UNDERLINE,                                      X00141   
               LENGTH=001                                               00145   
         DFHMDF POS=(05,043),                                          X00146   
               COLOR=NEUTRAL,                                          X00147   
               ATTRB=(ASKIP,NORM),                                     X00148   
               LENGTH=005,                                             X00149   
               INITIAL='(Y/N)'                                          00150   
ADCSDAY  DFHMDF POS=(05,049),                                          X00151   
               COLOR=GREEN,                                            X00152   
               ATTRB=(UNPROT,NUM,NORM),                                X00153   
               HILIGHT=UNDERLINE,                                      X00141   
               LENGTH=004,                                             X00154   
               PICOUT='ZZZ9'                                            00466   
         DFHMDF POS=(05,054),                                          X00155   
               COLOR=NEUTRAL,                                          X00156   
               ATTRB=(ASKIP,NORM),                                     X00157   
               LENGTH=013,                                             X00158   
               INITIAL='LEADTIME DAYS'                                  00159   
*                                                                       00038   
         DFHMDF POS=(06,002),                                          X00133   
               COLOR=NEUTRAL,                                          X00134   
               ATTRB=(ASKIP,NORM),                                     X00135   
               LENGTH=013,                                             X00136   
               INITIAL='LEAD TIME...:'                                  00137   
ALDTME1  DFHMDF POS=(06,016),                                          X00138   
               COLOR=GREEN,                                            X00139   
               ATTRB=(UNPROT,NORM),                                    X00140   
               HILIGHT=UNDERLINE,                                      X00141   
               LENGTH=003,                                             X00142   
               PICOUT='ZZ9'                                             00143   
         DFHMDF POS=(06,020),                                          X00144   
               COLOR=NEUTRAL,                                          X00145   
               ATTRB=(ASKIP,NORM),                                     X00146   
               LENGTH=001                                               00147   
         DFHMDF POS=(06,026),                                          X00228   
               COLOR=NEUTRAL,                                          X00229   
               ATTRB=(ASKIP,NORM),                                     X00230   
               LENGTH=014,                                             X00231   
               INITIAL='PACK BY STORE:'                                 00232   
APKSTOR  DFHMDF POS=(06,041),                                          X00233   
               COLOR=GREEN,                                            X00234   
               ATTRB=(UNPROT,NORM),                                    X00235   
               HILIGHT=UNDERLINE,                                      X00236   
               LENGTH=001                                               00237   
         DFHMDF POS=(06,043),                                          X00238   
               COLOR=NEUTRAL,                                          X00239   
               ATTRB=(ASKIP,NORM),                                     X00240   
               LENGTH=005,                                             X00241   
               INITIAL='(Y/N)'                                          00242   
*                                                                       00038   
         DFHMDF POS=(07,002),                                          X00173   
               COLOR=NEUTRAL,                                          X00174   
               ATTRB=(ASKIP,NORM),                                     X00175   
               LENGTH=013,                                             X00176   
               INITIAL='TICKET MAKER:'                                  00177   
ATKMKR1  DFHMDF POS=(07,016),                                          X00178   
               COLOR=GREEN,                                            X00179   
               ATTRB=(UNPROT,NORM),                                    X00180   
               HILIGHT=UNDERLINE,                                      X00181   
               LENGTH=001                                               00182   
         DFHMDF POS=(07,018),                                          X00223   
               COLOR=NEUTRAL,                                          X00224   
               ATTRB=(ASKIP,NORM),                                     X00225   
               LENGTH=005,                                             X00226   
               INITIAL='(K/V)'                                          00227   
         DFHMDF POS=(07,026),                                          X00268   
               COLOR=NEUTRAL,                                          X00269   
               ATTRB=(ASKIP,NORM),                                     X00270   
               LENGTH=014,                                             X00271   
               INITIAL='HANGER INSERT:'                                 00272   
AHNGIS1  DFHMDF POS=(07,041),                                          X00273   
               COLOR=GREEN,                                            X00274   
               ATTRB=(UNPROT,NORM),                                    X00275   
               HILIGHT=UNDERLINE,                                      X00276   
               LENGTH=001                                               00277   
         DFHMDF POS=(07,043),                                          X00278   
               COLOR=NEUTRAL,                                          X00279   
               ATTRB=(ASKIP,NORM),                                     X00280   
               LENGTH=005,                                             X00281   
               INITIAL='(Y/N)'                                          00282   
*                                                                       00038   
         DFHMDF POS=(08,002),                                          X00213   
               COLOR=NEUTRAL,                                          X00214   
               ATTRB=(ASKIP,NORM),                                     X00215   
               LENGTH=013,                                             X00216   
               INITIAL='BULK TICKETS:'                                  00217   
ABKTKT1  DFHMDF POS=(08,016),                                          X00218   
               COLOR=GREEN,                                            X00219   
               ATTRB=(UNPROT,NORM),                                    X00220   
               HILIGHT=UNDERLINE,                                      X00221   
               LENGTH=001                                               00222   
         DFHMDF POS=(08,018),                                          X00223   
               COLOR=NEUTRAL,                                          X00224   
               ATTRB=(ASKIP,NORM),                                     X00225   
               LENGTH=005,                                             X00226   
               INITIAL='(Y/N)'                                          00227   
         DFHMDF POS=(08,026),                                          X00343   
               COLOR=NEUTRAL,                                          X00344   
               ATTRB=(ASKIP,NORM),                                     X00345   
               LENGTH=014,                                             X00346   
               INITIAL='SUPPLIES UPC.:'                                 00347   
ASUPUCP  DFHMDF POS=(08,041),                                          X00348   
               COLOR=GREEN,                                            X00349   
               ATTRB=(UNPROT,NORM),                                    X00350   
               HILIGHT=UNDERLINE,                                      X00351   
               LENGTH=001                                               00352   
         DFHMDF POS=(08,043),                                          X00353   
               COLOR=NEUTRAL,                                          X00354   
               ATTRB=(ASKIP,NORM),                                     X00355   
               LENGTH=005,                                             X00356   
               INITIAL='(Y/N)'                                          00357   
*                                                                       00015   
         DFHMDF POS=(09,026),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=014,                                             X00324   
               INITIAL='DIRECT SHIP..:'                                 00325   
ADIRSHP  DFHMDF POS=(09,041),                                          X00257   
               COLOR=GREEN,                                            X00274   
               ATTRB=(UNPROT,NORM),                                    X00275   
               HILIGHT=UNDERLINE,                                      X00276   
               LENGTH=001                                               00277   
         DFHMDF POS=(09,043),                                          X00261   
               COLOR=NEUTRAL,                                          X00262   
               ATTRB=(ASKIP,NORM),                                     X00263   
               LENGTH=005,                                             X00264   
               INITIAL='(Y/N)'                                          00265   
         DFHMDF POS=(09,049),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=005,                                             X00324   
               INITIAL='RATE:'                                          00325   
ADIRRTE  DFHMDF POS=(09,056),                                          X00382   
               COLOR=GREEN,                                            X00274   
               ATTRB=(UNPROT,NORM),                                    X00275   
               HILIGHT=UNDERLINE,                                      X00276   
               LENGTH=007,                                             X00277   
               PICOUT='ZZZ9.99'                                         00386   
         DFHMDF POS=(09,064),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=004,                                             X00324   
               INITIAL='PCT:'                                           00325   
ADIRPCT  DFHMDF POS=(09,069),                                          X00382   
               COLOR=GREEN,                                            X00274   
               ATTRB=(UNPROT,NORM),                                    X00275   
               HILIGHT=UNDERLINE,                                      X00276   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(09,075),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
*                                                                       00038   
         DFHMDF POS=(10,026),                                          X00321   
               COLOR=NEUTRAL,                                          X00322   
               ATTRB=(ASKIP,NORM),                                     X00323   
               LENGTH=014,                                             X00324   
               INITIAL='RFID STATUS..:'                                 00325   
RFDCOMP  DFHMDF POS=(10,041),                                          X00518   
               COLOR=GREEN,                                            X00274   
               ATTRB=(UNPROT,NORM),                                    X00275   
               HILIGHT=UNDERLINE,                                      X00276   
               LENGTH=001                                               00277   
         DFHMDF POS=(10,043),                                          X00522   
               COLOR=NEUTRAL,                                          X00523   
               ATTRB=(ASKIP,NORM),                                     X00524   
               LENGTH=035,                                             X00525   
               INITIAL='(N-NO RFID, T-TAGGING, C-COMPLIANT)'            00526   
*                                                                       00015   
         DFHMDF POS=(12,002),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=022,                                             X00371   
               INITIAL='--SUPPRESS TICKETING--'                         00372   
         DFHMDF POS=(12,026),                                          X00373   
               COLOR=NEUTRAL,                                          X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=053,                                             X00376   
               INITIAL='-------AGREEMENTS AFFECTING INVOICE--------  EFX00377   
               F DATE'                                                  00378   
*                                                                       00038   
         DFHMDF POS=(13,002),                                          X00379   
               COLOR=NEUTRAL,                                          X00380   
               ATTRB=(ASKIP,NORM),                                     X00381   
               LENGTH=013,                                             X00382   
               INITIAL='(Y,N,P).....:'                                  00383   
ATKIND2  DFHMDF POS=(13,016),                                          X00384   
               COLOR=GREEN,                                            X00385   
               ATTRB=(UNPROT,NORM),                                    X00386   
               HILIGHT=UNDERLINE,                                      X00387   
               LENGTH=001                                               00388   
         DFHMDF POS=(13,018),                                          X00389   
               COLOR=NEUTRAL,                                          X00390   
               ATTRB=(ASKIP,NORM),                                     X00391   
               LENGTH=001                                               00392   
         DFHMDF POS=(13,026),                                          X00393   
               COLOR=NEUTRAL,                                          X00394   
               ATTRB=(ASKIP,NORM),                                     X00395   
               LENGTH=019,                                             X00396   
               INITIAL='NEW STORE DISC....:'                            00397   
ANEWSTR  DFHMDF POS=(13,046),                                          X00398   
               COLOR=GREEN,                                            X00399   
               ATTRB=(UNPROT,NORM),                                    X00400   
               HILIGHT=UNDERLINE,                                      X00401   
               LENGTH=001                                               00402   
         DFHMDF POS=(13,048),                                          X00403   
               COLOR=NEUTRAL,                                          X00404   
               ATTRB=(ASKIP,NORM),                                     X00405   
               LENGTH=001                                               00406   
ANEWPCT  DFHMDF POS=(13,050),                                          X00408   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=005,                                             X00412   
               PICOUT='Z9.99'                                           00413   
         DFHMDF POS=(13,056),                                          X00414   
               COLOR=NEUTRAL,                                          X00415   
               ATTRB=(ASKIP,NORM),                                     X00416   
               LENGTH=007,                                             X00417   
               INITIAL='% DAYS:'                                        00418   
ANEWDAY  DFHMDF POS=(13,064),                                          X00419   
               COLOR=GREEN,                                            X00420   
               ATTRB=(UNPROT,NORM),                                    X00421   
               HILIGHT=UNDERLINE,                                      X00422   
               LENGTH=003,                                             X00423   
               PICOUT='ZZ9'                                             00424   
         DFHMDF POS=(13,068),                                          X00425   
               COLOR=NEUTRAL,                                          X00426   
               ATTRB=(ASKIP,NORM),                                     X00427   
               LENGTH=001                                               00428   
ANEWEFF  DFHMDF POS=(13,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00038   
         DFHMDF POS=(14,002),                                          X00489   
               COLOR=NEUTRAL,                                          X00490   
               ATTRB=(ASKIP,NORM),                                     X00491   
               LENGTH=013,                                             X00492   
               INITIAL='LEAD TIME...:'                                  00493   
ALDTME2  DFHMDF POS=(14,016),                                          X00494   
               COLOR=GREEN,                                            X00495   
               ATTRB=(UNPROT,NORM),                                    X00496   
               HILIGHT=UNDERLINE,                                      X00497   
               LENGTH=003,                                             X00498   
               PICOUT='ZZ9'                                             00499   
         DFHMDF POS=(14,020),                                          X00500   
               COLOR=NEUTRAL,                                          X00501   
               ATTRB=(ASKIP,NORM),                                     X00502   
               LENGTH=001                                               00503   
         DFHMDF POS=(14,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='MOS DISC..........:'                            00372   
AMOSDIS  DFHMDF POS=(14,046),                                          X00373   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=001                                               00376   
         DFHMDF POS=(14,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00379   
               LENGTH=001                                               00380   
AMOSPCT  DFHMDF POS=(14,050),                                          X00382   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(14,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
AMOSEFF  DFHMDF POS=(14,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00038   
         DFHMDF POS=(15,002),                                          X00519   
               COLOR=NEUTRAL,                                          X00520   
               ATTRB=(ASKIP,NORM),                                     X00521   
               LENGTH=013,                                             X00522   
               INITIAL='TICKET MAKER:'                                  00523   
ATKMKR2  DFHMDF POS=(15,016),                                          X00524   
               COLOR=GREEN,                                            X00525   
               ATTRB=(UNPROT,NORM),                                    X00526   
               HILIGHT=UNDERLINE,                                      X00527   
               LENGTH=001                                               00528   
         DFHMDF POS=(15,018),                                          X00529   
               COLOR=NEUTRAL,                                          X00530   
               ATTRB=(ASKIP,NORM),                                     X00531   
               LENGTH=007,                                             X00532   
               INITIAL='(V/U)'                                          00533   
         DFHMDF POS=(15,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='TRADE DISC........:'                            00372   
ATRDDIS  DFHMDF POS=(15,046),                                          X00373   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=001                                               00376   
         DFHMDF POS=(15,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=001                                               00380   
ATRDPCT  DFHMDF POS=(15,050),                                          X00382   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(15,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
ATRDEFF  DFHMDF POS=(15,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00038   
         DFHMDF POS=(16,002),                                          X00549   
               COLOR=NEUTRAL,                                          X00550   
               ATTRB=(ASKIP,NORM),                                     X00551   
               LENGTH=013,                                             X00552   
               INITIAL='BULK TICKETS:'                                  00553   
ABKTKT2  DFHMDF POS=(16,016),                                          X00554   
               COLOR=GREEN,                                            X00555   
               ATTRB=(UNPROT,NORM),                                    X00556   
               HILIGHT=UNDERLINE,                                      X00557   
               LENGTH=001                                               00558   
         DFHMDF POS=(16,018),                                          X00559   
               COLOR=NEUTRAL,                                          X00560   
               ATTRB=(ASKIP,NORM),                                     X00561   
               LENGTH=005,                                             X00562   
               INITIAL='(Y/N)'                                          00563   
         DFHMDF POS=(16,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='BROADCAST OFF INVC:'                            00372   
AADVDIS  DFHMDF POS=(16,046),                                          X00373   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=001                                               00376   
         DFHMDF POS=(16,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00379   
               LENGTH=001                                               00380   
AADVPCT  DFHMDF POS=(16,050),                                          X00382   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(16,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
AADVEFF  DFHMDF POS=(16,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00038   
         DFHMDF POS=(17,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='CO-OP ALLOWANCE...:'                            00372   
ACOPALW  DFHMDF POS=(17,046),                                          X00373   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=001                                               00376   
         DFHMDF POS=(17,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00379   
               LENGTH=001                                               00380   
ACOPPCT  DFHMDF POS=(17,050),                                          X00382   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(17,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
ACOPEFF  DFHMDF POS=(17,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00038   
         DFHMDF POS=(18,026),                                          X00368   
               COLOR=NEUTRAL,                                          X00369   
               ATTRB=(ASKIP,NORM),                                     X00370   
               LENGTH=019,                                             X00371   
               INITIAL='PROFITASST/ADCOOP.:'                            00372   
APFTALW  DFHMDF POS=(18,046),                                          X00373   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=001                                               00376   
         DFHMDF POS=(18,048),                                          X00377   
               COLOR=NEUTRAL,                                          X00378   
               ATTRB=(ASKIP,NORM),                                     X00379   
               LENGTH=001                                               00380   
APFTPCT  DFHMDF POS=(18,050),                                          X00382   
               COLOR=GREEN,                                            X00409   
               ATTRB=(UNPROT,NORM),                                    X00410   
               HILIGHT=UNDERLINE,                                      X00411   
               LENGTH=005,                                             X00385   
               PICOUT='Z9.99'                                           00386   
         DFHMDF POS=(18,056),                                          X00387   
               COLOR=NEUTRAL,                                          X00388   
               ATTRB=(ASKIP,NORM),                                     X00389   
               LENGTH=001,                                             X00390   
               INITIAL='%'                                              00391   
APFTEFF  DFHMDF POS=(18,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00038   
         DFHMDF POS=(19,026),                                          X00393   
               COLOR=NEUTRAL,                                          X00394   
               ATTRB=(ASKIP,NORM),                                     X00395   
               LENGTH=019,                                             X00396   
               INITIAL='TABLE/TOWER DATING:'                            00372   
ATBLIND  DFHMDF POS=(19,046),                                          X00398   
               COLOR=GREEN,                                            X00399   
               ATTRB=(UNPROT,NORM),                                    X00400   
               HILIGHT=UNDERLINE,                                      X00401   
               LENGTH=001                                               00402   
         DFHMDF POS=(19,048),                                          X00403   
               COLOR=NEUTRAL,                                          X00404   
               ATTRB=(ASKIP,NORM),                                     X00405   
               LENGTH=001                                               00406   
         DFHMDF POS=(19,058),                                          X00414   
               COLOR=NEUTRAL,                                          X00415   
               ATTRB=(ASKIP,NORM),                                     X00416   
               LENGTH=005,                                             X00417   
               INITIAL='DAYS:'                                          00418   
ATBLDAY  DFHMDF POS=(19,064),                                          X00419   
               COLOR=GREEN,                                            X00420   
               ATTRB=(UNPROT,NORM),                                    X00421   
               HILIGHT=UNDERLINE,                                      X00422   
               LENGTH=003,                                             X00423   
               PICOUT='ZZ9'                                             00424   
         DFHMDF POS=(19,068),                                          X00425   
               COLOR=NEUTRAL,                                          X00426   
               ATTRB=(ASKIP,NORM),                                     X00427   
               LENGTH=001                                               00428   
ATBLEFF  DFHMDF POS=(19,070),                                          X00373   
               COLOR=BLUE,                                             X00374   
               ATTRB=(ASKIP,NORM),                                     X00375   
               LENGTH=010                                               00376   
*                                                                       00038   
         DFHMSD TYPE=FINAL                                              00579   
         END                                                            00580   
