*          DATA SET VNKM028                                                     
  PRINT  NOGEN                                                                  
*******************************************************************-*           
*                                                                   *           
*        MAPSET  VNKM028                                            *           
*        MAP     VN028A                                             *           
*        PROGRAM VNKCS028                                           *           
*        TRANSID V028 - VENDOR CAPABILITIES LIST SCREEN             *           
*        SYSTEM  CICS ARCHITECTURE                                  *           
*                                                                   *           
*******************************************************************-*           
VNKM028  DFHMSD TYPE=MAP,                                              X        
               CTRL=(FREEKB),                                          X        
               LANG=COBOL,                                             X        
               MODE=INOUT,                                             X        
               TIOAPFX=YES                                                      
VN028A   DFHMDI SIZE=(19,080),                                         X        
               MAPATTS=(COLOR,HILIGHT),                                X        
               DSATTS=(COLOR,HILIGHT),                                 X        
               LINE=02,                                                X        
               COLUMN=01                                                        
         DFHMDF POS=(02,002),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=007,                                             X        
               INITIAL='VENDOR:'                                                
AVEND    DFHMDF POS=(02,010),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
         DFHMDF POS=(02,053),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=005,                                             X        
               INITIAL='ITEMS'                                                  
ASTRTIT  DFHMDF POS=(02,060),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NUM,NORM),                                X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMDF POS=(02,065),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='TO'                                                     
AENDIT   DFHMDF POS=(02,068),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMDF POS=(02,073),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=002,                                             X        
               INITIAL='OF'                                                     
ATOTIT   DFHMDF POS=(02,076),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMDF POS=(04,001),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               INITIAL='SEL '                                                   
         DFHMDF POS=(04,006),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003,                                             X        
               INITIAL='ACT'                                                    
         DFHMDF POS=(04,011),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=015,                                             X        
               INITIAL='CAPABILITY NAME'                                        
         DFHMDF POS=(04,044),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=009,                                             X        
               INITIAL='EFFECTIVE'                                              
         DFHMDF POS=(04,057),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=007,                                             X        
               INITIAL='EXPIRES'                                                
ASEL01   DFHMDF POS=(05,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(05,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT01   DFHMDF POS=(05,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME01  DFHMDF POS=(05,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT01  DFHMDF POS=(05,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT01  DFHMDF POS=(05,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL02   DFHMDF POS=(06,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(06,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT02   DFHMDF POS=(06,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME02  DFHMDF POS=(06,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT02  DFHMDF POS=(06,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT02  DFHMDF POS=(06,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL03   DFHMDF POS=(07,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(07,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT03   DFHMDF POS=(07,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME03  DFHMDF POS=(07,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT03  DFHMDF POS=(07,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT03  DFHMDF POS=(07,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL04   DFHMDF POS=(08,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(08,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT04   DFHMDF POS=(08,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME04  DFHMDF POS=(08,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT04  DFHMDF POS=(08,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT04  DFHMDF POS=(08,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL05   DFHMDF POS=(09,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(09,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT05   DFHMDF POS=(09,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME05  DFHMDF POS=(09,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT05  DFHMDF POS=(09,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT05  DFHMDF POS=(09,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL06   DFHMDF POS=(10,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(10,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT06   DFHMDF POS=(10,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME06  DFHMDF POS=(10,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT06  DFHMDF POS=(10,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT06  DFHMDF POS=(10,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL07   DFHMDF POS=(11,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(11,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT07   DFHMDF POS=(11,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME07  DFHMDF POS=(11,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT07  DFHMDF POS=(11,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT07  DFHMDF POS=(11,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL08   DFHMDF POS=(12,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(12,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT08   DFHMDF POS=(12,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME08  DFHMDF POS=(12,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT08  DFHMDF POS=(12,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT08  DFHMDF POS=(12,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL09   DFHMDF POS=(13,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(13,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT09   DFHMDF POS=(13,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME09  DFHMDF POS=(13,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT09  DFHMDF POS=(13,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT09  DFHMDF POS=(13,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL10   DFHMDF POS=(14,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(14,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT10   DFHMDF POS=(14,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME10  DFHMDF POS=(14,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT10  DFHMDF POS=(14,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT10  DFHMDF POS=(14,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL11   DFHMDF POS=(15,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(15,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT11   DFHMDF POS=(15,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME11  DFHMDF POS=(15,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT11  DFHMDF POS=(15,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT11  DFHMDF POS=(15,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL12   DFHMDF POS=(16,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(16,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT12   DFHMDF POS=(16,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME12  DFHMDF POS=(16,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT12  DFHMDF POS=(16,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT12  DFHMDF POS=(16,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL13   DFHMDF POS=(17,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(17,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT13   DFHMDF POS=(17,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME13  DFHMDF POS=(17,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT13  DFHMDF POS=(17,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT13  DFHMDF POS=(17,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
ASEL14   DFHMDF POS=(18,002),                                          X        
               COLOR=GREEN,                                            X        
               ATTRB=(UNPROT,NORM),                                    X        
               HILIGHT=UNDERLINE,                                      X        
               LENGTH=001                                                       
         DFHMDF POS=(18,004),                                          X        
               ATTRB=(ASKIP),                                          X        
               LENGTH=001                                                       
AACT14   DFHMDF POS=(18,006),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=003                                                       
ACNME14  DFHMDF POS=(18,011),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=030                                                       
AEFDT14  DFHMDF POS=(18,044),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
AEXDT14  DFHMDF POS=(18,057),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=010                                                       
         DFHMDF POS=(19,049),                                          X        
               COLOR=NEUTRAL,                                          X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=026,                                             X        
               INITIAL='NUMBER OF SELECTED ITEMS: '                             
ASELIT   DFHMDF POS=(19,076),                                          X        
               COLOR=BLUE,                                             X        
               ATTRB=(ASKIP,NORM),                                     X        
               LENGTH=004,                                             X        
               PICOUT='ZZZ9'                                                    
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
