000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    VNKUT019.                                         00020003
000300 AUTHOR.        ANIL BEDEKAR                                      00030004
000400 DATE-WRITTEN.  JULY 2011.                                        00040000
000500***************************************************************** 00050000
000600*               COBOL WITH DB2                                  * 00060000
000700***************************************************************** 00070000
000800*     VENDOR DATA EXTRACT FOR BUSINESS CONTINUITY PROGRAM       * 00080000
000900***************************************************************** 00090000
001000*  PURPOSE: CREATE AN EXTRACT FILE OF SKELETON VENDOR DATA      * 00100000
001100*           THAT WILL BE ADDED TO IN LATER PROCESSING.  EMPLOYEE* 00110000
001200*           VENDORS WILL NOT BE INCLUDED IN THE FILE.           * 00120000
001300*           FILE TO BE USED IN VNKUT020 AND VNKUT015.           * 00130009
001400***************************************************************** 00140000
001500*                                                               * 00150000
001600*  DB2 TABLES:  TEXTENT                                         * 00160000
001700*               TENTNME                                         * 00170000
001800*                                                               * 00180000
001900*   INPUT: 1) VARIOUS VENDOR DB2 DATABASE TABLES  (SEE ABOVE)   * 00190000
002000*  OUTPUT: 1) VENDOR EXTRACT FILE                 (VNRD010)     * 00200004
002100*                                                               * 00210000
002200***************************************************************** 00220000
002300* MAINTENANCE LOG:                                              * 00230000
002400*                                                               * 00240000
002500* 08/10/2011                                                    * 00250004
002600*   CHANGE  MADE: INITIAL VERSION.                              * 00260002
002700*  MADE BY: ANIL BEDEKAR                WR/PITS: WR37038        * 00270004
002800*                                                               * 00280000
002810* 02/09/2017                                                    * 00281018
002820*   CHANGE  MADE: ADDED THE FOLLOWING CONDITIONS TO THE         * 00282018
002821*   VENDOR_CSR:                                                 * 00282118
002822*   AND VND_PRSST_CDE <> 'O'                                    * 00282218
002823*   AND PAYT_HNDLNG_CDE NOT IN ('AS','AT','KC','PR','RT','TX',  * 00282318
002824*                                'EM','NP')                     * 00282418
002825*   AND PRTNR_TYP_CDE NOT IN ('FA','CL','CR','TM')              * 00282518
002826*   AND NEED_1099_IND = 'N'                                     * 00282618
002827*   ADDED LOGIC IN B200 TO SKIP WRITING TO THE OUTPUT FILE IF   * 00282718
002828*   THE VENDOR IS A MERCHANDISE VENDOR.                         * 00282818
002829*   THE ABOVE CHANGES ARE TAGGED WITH PRB0059571.               * 00282918
002830*  MADE BY: SRINATH(COGNIZANT)          WR/PITS: CHG0162036     * 00283019
002840*                                                               * 00284018
002900***************************************************************** 00290000
003000 ENVIRONMENT DIVISION.                                            00300000
003100 CONFIGURATION SECTION.                                           00310000
003200 SOURCE-COMPUTER.        IBM-370.                                 00320000
003300 OBJECT-COMPUTER.        IBM-370.                                 00330000
003400                                                                  00340000
003500 INPUT-OUTPUT SECTION.                                            00350000
003600                                                                  00360000
003700 FILE-CONTROL.                                                    00370000
003800     SELECT VENDOR-EXTRACT-FILE      ASSIGN TO OUT01.             00380000
003900                                                                  00390000
004000 DATA DIVISION.                                                   00400000
004100 FILE SECTION.                                                    00410000
004200                                                                  00420000
004300 FD  VENDOR-EXTRACT-FILE                                          00430000
004400     RECORDING MODE IS F                                          00440000
004500     LABEL RECORDS ARE STANDARD                                   00450000
004600     BLOCK CONTAINS 0 RECORDS                                     00460000
004700     RECORD CONTAINS 100 CHARACTERS                               00470009
004800     DATA RECORD IS VENDOR-EXTRACT-REC.                           00480005
004900                                                                  00490000
005000 01  VENDOR-EXTRACT-REC    PIC X(100).                            00500009
005100                                                                  00510000
005200 WORKING-STORAGE SECTION.                                         00520000
005300                                                                  00530000
005400 01  PROGRAM-SWITCHES.                                            00540000
005500     05  PS-END-OF-VENDOR-SW         PIC X(01)  VALUE 'Y'.        00550000
005600         88  MORE-VENDOR-CSR                    VALUE 'Y'.        00560000
005700         88  END-OF-VENDOR-CSR                  VALUE 'N'.        00570000
005800                                                                  00580000
005900 01  PROGRAM-VARIABLES.                                           00590000
006000     05  PV-PROGRAM-NAME             PIC X(8)   VALUE 'VNKUT019'. 00600003
006100                                                                  00610000
006200 01  PROGRAM-COUNTERS.                                            00620000
006300     05  PV-COUNT-VENDOR-READ        PIC 9(09)  VALUE 0.          00630000
006400     05  PV-COUNT-MERCH-RECORD       PIC 9(09)  VALUE 0.          00640006
006500     05  PV-COUNT-EXPEN-RECORD       PIC 9(09)  VALUE 0.          00650006
006600                                                                  00660000
006700 01  ABEND-CODE                     PIC S9(04) VALUE 0 COMP SYNC. 00670005
006800                                                                  00680000
006900 01  ABEND-AREAS.                                                 00690000
007000     05  AA-ABEND-LIT                PIC X(40)  VALUE             00700000
007100             '*****       ABEND'.                                 00710000
007200     05  AA-PROGRAM-LIT              PIC X(40)  VALUE             00720000
007300             '*****   PROGRAM: VNKUT019'.                         00730003
007400     05  AA-PARAGRAPH-LIT.                                        00740000
007500         10  FILLER                  PIC X(17)  VALUE             00750000
007600             '***** PARAGRAPH: '.                                 00760000
007700         10  AA-PARAGRAPH-NAME       PIC X(35)  VALUE SPACES.     00770000
007800     05  AA-MESSAGE-LINE.                                         00780000
007900         10  FILLER                  PIC X(06)  VALUE '*****'.    00790000
008000         10  AA-MESSAGE              PIC X(127) VALUE SPACES.     00800000
008100         10  FILLER REDEFINES AA-MESSAGE.                         00810000
008200             15 AA-MESSAGE-1         PIC X(45).                   00820000
008300             15 AA-MESSAGE-2         PIC X(45).                   00830000
008400             15 AA-MESSAGE-3         PIC X(37).                   00840000
008500     05  AA-DB2-ERROR-LIT            PIC X(40)  VALUE             00850000
008600             '*****    DB2 ERROR'.                                00860000
008700     05  AA-DB2-OPERATION-LIT.                                    00870000
008800         10  FILLER                  PIC X(17)  VALUE             00880000
008900             '***** OPERATION: '.                                 00890000
009000         10  AA-DB2-OPERATION.                                    00900000
009100             15  AA-DB2-OP-1         PIC X(25)  VALUE SPACES.     00910000
009200             15  AA-DB2-OP-2         PIC X(25)  VALUE SPACES.     00920000
009300     05  AA-DB2-TABLE-1              PIC X(18)  VALUE SPACES.     00930000
009400     05  AA-DB2-TABLE-2              PIC X(18)  VALUE SPACES.     00940000
009500     05  AA-DB2-TABLE-3              PIC X(18)  VALUE SPACES.     00950000
009600                                                                  00960000
009700*--------------------------------------------------------------*  00970000
009800*   THIS IS THE RECORD LAYOUT FOR THE VENDOR EXTRACT.          *  00980000
009900*--------------------------------------------------------------*  00990000
010000     COPY VNRD010.                                                01000004
010100                                                                  01010000
010200*--------------------------------------------------------------*  01020000
010300*  DPWS004 CONTAINS THE FIELDS NECESSARY TO CALL THE SQLCA     *  01030000
010400*  MESSAGE MODULE 'DSNTIAR' AND DISPLAY THE FORMATTED RESULTS. *  01040000
010500*--------------------------------------------------------------*  01050000
010600     COPY DPWS004.                                                01060000
010700                                                                  01070000
010800*-------------------------------------------------------------*   01080000
010900*  EXTERNAL ENTITY ID TABLE                                   *   01090000
011000*-------------------------------------------------------------*   01100000
011100     EXEC SQL                                                     01110000
011200          INCLUDE TEXTENT                                         01120000
011300     END-EXEC.                                                    01130000
011400                                                                  01140000
011500*--------------------------------------------------------------*  01150000
011600*  EXTERNAL ENTITY NAME TABLE                                  *  01160000
011700*--------------------------------------------------------------*  01170000
011800     EXEC SQL                                                     01180000
011900          INCLUDE TENTNME                                         01190000
012000     END-EXEC.                                                    01200000
012100                                                                  01210000
012200*--------------------------------------------------------------*  01220000
012300*  COMMUNICATIONS AREA2 FOR DB2                                *  01230000
012400*--------------------------------------------------------------*  01240000
012500     COPY SQLCA2.                                                 01250000
012600*--------------------------------------------------------------*  01260000
012700*     SQL COMMUNICATIONS AREA DCLGEN                           *  01270000
012800*--------------------------------------------------------------*  01280000
012900     EXEC SQL                                                     01290000
013000         INCLUDE SQLCA                                            01300000
013100     END-EXEC.                                                    01310000
013200                                                                  01320000
013300*----------------------------------------------------------------*01330000
013400*    OPEN A CURSOR TO RETRIEVE ALL ACTIVE MERCHANDISE AND EXPENSE*01340000
013500*    VENDORS THAT HAVE A CURRENT OR PREVIOUS FISCAL YEAR SALES   *01350000
013600*    RANK GREATER THAN ZERO.                                     *01360000
013700*----------------------------------------------------------------*01370000
013800     EXEC SQL                                                     01380000
013900          DECLARE VENDOR_CSR CURSOR FOR                           01390000
014000           SELECT   A.ENT_ID                                      01400000
014100                   ,A.DUN_NBR                                     01410000
014200                   ,B.ENT_NAME_DESC                               01420000
014300                   ,A.PRIM_TYP_CDE                                01430000
014400                   ,A.CFY_SLSRNK_NBR                              01440000
014500                   ,A.PFY_SLSRNK_NBR                              01450000
014600                   ,'  '                                          01460000
014700                   ,' '                                           01470000
014800             FROM   TEXTENT A                                     01480000
014900                   ,TENTNME B                                     01490000
015000            WHERE   A.ENT_ID         = B.ENT_ID                   01500000
015100              AND   B.TYPE_CDE       = '01'                       01510000
015200              AND   A.PRIM_TYP_CDE   = 'M'                        01520000
015300              AND   A.STATUS_CDE     = 'A'                        01530000
015400              AND ((A.CFY_SLSRNK_NBR > 0) OR                      01540000
015500                   (A.PFY_SLSRNK_NBR > 0))                        01550000
015600                                                                  01560000
015700             UNION                                                01570000
015800                                                                  01580000
015900           SELECT   A.ENT_ID                                      01590000
016000                   ,A.DUN_NBR                                     01600000
016100                   ,B.ENT_NAME_DESC                               01610000
016200                   ,A.PRIM_TYP_CDE                                01620000
016300                   ,0                                             01630000
016400                   ,0                                             01640000
016500                   ,A.PRTNR_TYP_CDE                               01650000
016600                   ,A.CAP_EXP_CDE                                 01660000
016700             FROM   TEXTENT A                                     01670000
016800                   ,TENTNME B                                     01680000
016900            WHERE   A.ENT_ID         = B.ENT_ID                   01690000
017000              AND   B.TYPE_CDE       = '01'                       01700000
017100              AND   A.PRIM_TYP_CDE   = 'E'                        01710000
017200              AND   A.STATUS_CDE     = 'A'                        01720000
017300              AND   A.VND_CLSN_CDE NOT IN ('E')                   01730000
017301*PRB0059571 START                                                 01730110
017310              AND VND_PRSST_CDE <> 'O'                            01731010
017320              AND PAYT_HNDLG_CDE NOT IN ('AS','AT','KC','PR',     01732011
017321                                          'RT','TX','EM','NP')    01732110
017330              AND PRTNR_TYP_CDE NOT IN ('FA','CL','CR','TM')      01733010
017340              AND NEED_1099_IND = 'N'                             01734010
017350*PRB0059571 END                                                   01735010
017400     END-EXEC.                                                    01740000
017500                                                                  01750000
017600 LINKAGE SECTION.                                                 01760000
017700************************                                          01770000
017800 PROCEDURE DIVISION.                                              01780000
017900************************                                          01790000
018000 A100-MAINLINE-ROUTINE.                                           01800000
018100                                                                  01810000
018200     PERFORM B100-INITIALIZATION.                                 01820000
018300                                                                  01830000
018400     PERFORM B200-PROCESS-VENDOR-CSR                              01840000
018500       UNTIL END-OF-VENDOR-CSR.                                   01850000
018600                                                                  01860000
018700     PERFORM B300-TERMINATION.                                    01870000
018800     GOBACK.                                                      01880000
018900                                                                  01890000
019000*--------------------------------------------------------------*  01900000
019100*  INITIALIZATION PROCESSING                                   *  01910000
019200*--------------------------------------------------------------*  01920000
019300 B100-INITIALIZATION.                                             01930000
019400                                                                  01940000
019500     DISPLAY ' '.                                                 01950000
019600     DISPLAY '**--------------- VNKUT019 --------------------**'. 01960003
019700     DISPLAY 'DATE ' FUNCTION CURRENT-DATE(1:8)                   01970000
019800           '  TIME ' FUNCTION CURRENT-DATE(9:6)                   01980000
019900                                                                  01990000
020000     OPEN OUTPUT VENDOR-EXTRACT-FILE.                             02000004
020100                                                                  02010000
020200                                                                  02020000
020300     INITIALIZE DCLTEXTENT                                        02030000
020400                DCLTENTNME                                        02040000
020500                AA-DB2-TABLE-1                                    02050000
020600                AA-DB2-TABLE-2                                    02060000
020700                AA-DB2-TABLE-3.                                   02070000
020800                                                                  02080000
020900     PERFORM X100-OPEN-VENDOR-CSR.                                02090000
021000                                                                  02100000
021100     PERFORM F100-FETCH-VENDOR-CSR.                               02110000
021200     IF END-OF-VENDOR-CSR                                         02120000
021300         DISPLAY '***  VNKUT019  ***'                             02130003
021400         DISPLAY 'FIRST FETCH OF VENDOR CURSOR     '              02140000
021500         DISPLAY 'NO VENDOR DATA TO PROCESS  '                    02150000
021600         DISPLAY ' '                                              02160000
021700     END-IF.                                                      02170000
021800                                                                  02180000
021900*--------------------------------------------------------------*  02190000
022000* PROCESS THE VENDOR CURSOR                                    *  02200000
022100*--------------------------------------------------------------*  02210000
022200 B200-PROCESS-VENDOR-CSR.                                         02220000
022300                                                                  02230000
022400     INITIALIZE VN010-VENDOR-EXTRACT-REC.                         02240003
022500                                                                  02250003
022600     MOVE EXTENT-ENT-ID         TO VN010-ENT-ID.                  02260003
022700     MOVE EXTENT-DUN-NBR        TO VN010-DUN-NBR.                 02270003
022800     MOVE ENTNME-ENT-NAME-DESC  TO VN010-ENT-NAME-DESC.           02280003
022900     MOVE EXTENT-PRIM-TYP-CDE   TO VN010-PRIM-TYP-CDE.            02290003
023000     IF EXTENT-PRIM-TYP-CDE = 'M'                                 02300006
023100        SET VN010-MDSE-VENDOR      TO TRUE                        02310006
023200        SET VN010-MERCH-ACTIVE     TO TRUE                        02320006
023300     ELSE                                                         02330006
023400        SET VN010-EXP-VENDOR       TO TRUE                        02340006
023500        SET VN010-EXPEN-INACTIVE   TO TRUE                        02350006
023600     END-IF.                                                      02360006
023700     MOVE EXTENT-CFY-SLSRNK-NBR TO VN010-CFY-SLSRNK-NBR.          02370003
023800     MOVE EXTENT-PFY-SLSRNK-NBR TO VN010-PFY-SLSRNK-NBR.          02380003
023900     MOVE EXTENT-PRTNR-TYP-CDE  TO VN010-PRTNR-TYP-CDE.           02390003
024000     MOVE EXTENT-CAP-EXP-CDE    TO VN010-CAP-EXP-CDE.             02400003
024100*PRB0059571 START                                                 02410017
024110     IF EXTENT-PRIM-TYP-CDE NOT = 'M'                             02411015
024200        PERFORM W100-WRITE-VENDOR-EXTRACT                         02420017
024300     END-IF.                                                      02430015
024301*PRB0059571 END                                                   02430116
024310*WE ARE SKIPPING WRITING MERCHANDISE VENDORS INTO THE OUTPUT FILE 02431016
024320*AT THIS POINT, SINCE IT WOULD BE EASIEST TO REVERT THESE CHANGES 02432016
024330*IN THE FUTURE, IF NEEDED.                                        02433016
024400     PERFORM F100-FETCH-VENDOR-CSR.                               02440000
024500                                                                  02450000
024600                                                                  02460000
024700*--------------------------------------------------------------*  02470000
024800*  END OF PROGRAM PROCESSING                                   *  02480000
024900*--------------------------------------------------------------*  02490000
025000 B300-TERMINATION.                                                02500000
025100                                                                  02510000
025200     DISPLAY '**********************************************'.    02520000
025300     DISPLAY '**         VNKUT019 RECORD COUNTS           **'.    02530003
025400     DISPLAY '**********************************************'.    02540000
025500     DISPLAY ' VENDOR RECS FETCHED:' PV-COUNT-VENDOR-READ.        02550000
025600     DISPLAY ' MERCH VEND WRITTEN :' PV-COUNT-MERCH-RECORD.       02560006
025700     DISPLAY ' EXPEN VEND WRITTEN :' PV-COUNT-EXPEN-RECORD.       02570006
025800     DISPLAY '**********************************************'.    02580000
025900                                                                  02590000
026000     PERFORM X110-CLOSE-VENDOR-CSR.                               02600000
026100                                                                  02610000
026200     CLOSE VENDOR-EXTRACT-FILE.                                   02620003
026300                                                                  02630000
026400*----------------------------------------------------------------*02640000
026500*  RETRIEVES THE VENDOR CURSOR DATA                              *02650000
026600*----------------------------------------------------------------*02660000
026700 F100-FETCH-VENDOR-CSR.                                           02670000
026800                                                                  02680000
026900     EXEC SQL                                                     02690000
027000         FETCH VENDOR_CSR                                         02700000
027100          INTO  :EXTENT-ENT-ID                                    02710000
027200               ,:EXTENT-DUN-NBR                                   02720000
027300               ,:ENTNME-ENT-NAME-DESC                             02730000
027400               ,:EXTENT-PRIM-TYP-CDE                              02740000
027500               ,:EXTENT-CFY-SLSRNK-NBR                            02750000
027600               ,:EXTENT-PFY-SLSRNK-NBR                            02760000
027700               ,:EXTENT-PRTNR-TYP-CDE                             02770000
027800               ,:EXTENT-CAP-EXP-CDE                               02780000
027900     END-EXEC.                                                    02790000
028000                                                                  02800000
028100     EVALUATE TRUE                                                02810000
028200         WHEN SQLCODE = ZERO                                      02820000
028300             ADD 1 TO PV-COUNT-VENDOR-READ                        02830000
028400         WHEN SQLCODE = +100                                      02840000
028500             SET END-OF-VENDOR-CSR TO TRUE                        02850000
028600         WHEN SQLWARN0 NOT = SPACES                               02860000
028700         WHEN SQLCODE  NOT = ZERO                                 02870000
028800             MOVE 'F100-FETCH-VENDOR-CSR' TO AA-PARAGRAPH-NAME    02880000
028900             MOVE 'UNSUCCESSFUL FETCH WITH VENDOR_CSR'            02890000
029000                                        TO AA-DB2-OPERATION       02900000
029100             MOVE 'TEXTENT'             TO AA-DB2-TABLE-1         02910000
029200             MOVE 'TENTNME'             TO AA-DB2-TABLE-2         02920000
029300             MOVE SPACE                 TO AA-DB2-TABLE-3         02930000
029400             PERFORM Z998-DB2-ABEND                               02940000
029500     END-EVALUATE.                                                02950000
029600                                                                  02960000
029700*--------------------------------------------------------------*  02970000
029800*  WRITE OUT A RECORD TO THE VENDOR EXTRACT FILE               *  02980000
029900*--------------------------------------------------------------*  02990000
030000 W100-WRITE-VENDOR-EXTRACT.                                       03000000
030100                                                                  03010000
030200     WRITE VENDOR-EXTRACT-REC FROM VN010-VENDOR-EXTRACT-REC.      03020005
030300                                                                  03030006
030400     IF VN010-PRIM-TYP-CDE = 'M'                                  03040006
030500        ADD 1 TO PV-COUNT-MERCH-RECORD                            03050006
030600     ELSE                                                         03060006
030700        ADD 1 TO PV-COUNT-EXPEN-RECORD                            03070006
030800     END-IF.                                                      03080006
030900                                                                  03090000
031000 X100-OPEN-VENDOR-CSR.                                            03100000
031100*--------------------------------------------------------------*  03110000
031200*    OPEN VENDOR CURSOR.                                       *  03120000
031300*--------------------------------------------------------------*  03130000
031400                                                                  03140000
031500     EXEC SQL                                                     03150000
031600         OPEN VENDOR_CSR                                          03160000
031700     END-EXEC.                                                    03170000
031800                                                                  03180000
031900     EVALUATE TRUE                                                03190000
032000         WHEN SQLCODE = ZERO                                      03200000
032100             CONTINUE                                             03210000
032200         WHEN SQLWARN0 NOT = SPACES                               03220000
032300         WHEN SQLCODE  NOT = ZERO                                 03230000
032400             MOVE 'X100-OPEN-VENDOR-CSR'                          03240000
032500                                 TO AA-PARAGRAPH-NAME             03250000
032600             MOVE 'UNSUCCESSFUL OPEN ON VENDOR_CSR'               03260000
032700                                 TO AA-DB2-OPERATION              03270000
032800             MOVE 'TEXTENT'      TO AA-DB2-TABLE-1                03280000
032900             MOVE 'TENTNME'      TO AA-DB2-TABLE-2                03290000
033000             MOVE SPACE          TO AA-DB2-TABLE-3                03300000
033100             PERFORM Z998-DB2-ABEND                               03310000
033200     END-EVALUATE.                                                03320000
033300                                                                  03330000
033400 X110-CLOSE-VENDOR-CSR.                                           03340000
033500*--------------------------------------------------------------*  03350000
033600*    CLOSE THE VENDOR_CSR CURSOR                               *  03360000
033700*--------------------------------------------------------------*  03370000
033800                                                                  03380000
033900     EXEC SQL                                                     03390000
034000         CLOSE VENDOR_CSR                                         03400000
034100     END-EXEC.                                                    03410000
034200                                                                  03420000
034300       EVALUATE TRUE                                              03430000
034400           WHEN SQLCODE = ZERO                                    03440000
034500                CONTINUE                                          03450000
034600                                                                  03460000
034700           WHEN SQLWARN0 NOT = SPACES                             03470000
034800           WHEN SQLCODE  NOT = ZERO                               03480000
034900               MOVE 'X110-CLOSE-VENDOR-CSR'                       03490000
035000                                   TO AA-PARAGRAPH-NAME           03500000
035100               MOVE 'UNSUCCESSFUL CLOSE ON VENDOR_CSR'            03510000
035200                                   TO AA-DB2-OPERATION            03520000
035300               MOVE 'TEXTENT'      TO AA-DB2-TABLE-1              03530000
035400               MOVE 'TENTNME'      TO AA-DB2-TABLE-2              03540000
035500               MOVE SPACE          TO AA-DB2-TABLE-3              03550000
035600               PERFORM Z998-DB2-ABEND                             03560000
035700       END-EVALUATE.                                              03570000
035800                                                                  03580000
035900*--------------------------------------------------------------*  03590000
036000*  DB2 ABEND ROUTINE                                           *  03600000
036100*--------------------------------------------------------------*  03610000
036200 Z998-DB2-ABEND.                                                  03620000
036300                                                                  03630000
036400     DISPLAY '**********************************************'.    03640000
036500     DISPLAY '**        VNKUT019 ABENDING !!!!!!!         **'.    03650003
036600     DISPLAY '**********************************************'.    03660000
036700                                                                  03670000
036800     DISPLAY AA-ABEND-LIT.                                        03680000
036900     DISPLAY AA-DB2-ERROR-LIT.                                    03690000
037000     DISPLAY AA-PROGRAM-LIT.                                      03700000
037100     DISPLAY AA-PARAGRAPH-LIT.                                    03710000
037200     DISPLAY AA-DB2-OPERATION-LIT.                                03720000
037300     DISPLAY AA-DB2-TABLE-1.                                      03730000
037400     DISPLAY AA-DB2-TABLE-2.                                      03740000
037500     DISPLAY AA-DB2-TABLE-3.                                      03750000
037600                                                                  03760000
037700     COPY DPPD004.                                                03770000
037800     CLOSE VENDOR-EXTRACT-FILE.                                   03780006
037900     CALL 'ILBOABN0' USING ABEND-CODE.                            03790000
038000                                                                  03800000
