000010*----------------------------------------------------------------*00001000
000020*   RECORD LAYOUT FOR THE VENDOR EXTRACT FILE FOR DOMAIN COPIES  *00002000
000030*                                                                *00003000
000040*   RECORD FORMAT IS SEQUENTIAL                                  *00004000
000050*          LENGTH = 150                                          *00005000
000060*----------------------------------------------------------------*00006000
000070 01  VN100-VENDOR-EXTRACT-RECD.                                   00007000
000080     05  VN100-ENT-ID                  PIC S9(9) COMP.            00008000
000090     05  VN100-VND-NBR                 PIC X(9).                  00009000
000100     05  VN100-PRIM-TYP-CDE            PIC X(1).                  00010000
000200         88  VN100-MDS-VENDOR               VALUE 'M'.            00020000
000300         88  VN100-EXP-VENDOR               VALUE 'E'.            00030000
000310         88  VN100-FACTOR                   VALUE 'F'.            00031000
000311         88  VN100-PARTNER                  VALUE 'P'.            00031105
000312         88  VN100-KOHLS-EMPLOYEE           VALUE 'K'.            00031205
000320     05  VN100-PRIMARY-NAME            PIC X(30).                 00032000
000330     05  VN100-STATUS-CDE              PIC X(1).                  00033000
000340         88  VN100-VENDOR-ACTIVE            VALUE 'A'.            00034000
000350         88  VN100-VENDOR-INACTIVE          VALUE 'I'.            00035000
000360     05  VN100-CRE-TMST                PIC X(26).                 00036000
000370     05  VN100-LAST-UPD-TMST           PIC X(26).                 00037000
000371     05  VN100-ENT-ID-CHAR             PIC 9(9).                  00037101
000372     05  VN100-NDA-IND                 PIC X(1).                  00037200
000373     05  VN100-PRNT-CO-ENT-ID-CHAR     PIC 9(9).                  00037301
000374     05  VN100-PRNT-CO-IND             PIC X(1).                  00037400
000375     05  VN100-PRTNR-TYP-CDE           PIC X(2).                  00037502
000376         88  VN100-AGENT                    VALUE 'AG'.           00037602
000377         88  VN100-BANK                     VALUE 'BK'.           00037702
000378         88  VN100-CUSTOMS-BROKER           VALUE 'BR'.           00037802
000379         88  VN100-CONSOLIDATOR             VALUE 'CO'.           00037902
000380         88  VN100-CARRIER                  VALUE 'CR'.           00038002
000381         88  VN100-DECONSOLIDATOR           VALUE 'DE'.           00038102
000382         88  VN100-FACTORY                  VALUE 'FA'.           00038202
000383         88  VN100-FREIGHT-FORWARDER        VALUE 'FF'.           00038302
000384         88  VN100-OFFICE-OF-PLACEMENT      VALUE 'OP'.           00038402
000385         88  VN100-TICKET-MAKER             VALUE 'TM'.           00038502
000386         88  VN100-MAKER                    VALUE 'S1'.           00038602
000387         88  VN100-IMPORT-PARENT            VALUE 'S2'.           00038702
000388     05  VN100-SCAC-CDE                PIC X(4).                  00038803
000389     05  VN100-CFY-SLSRNK-NBR          PIC S9(4) COMP.            00038903
000390     05  VN100-PFY-SLSRNK-NBR          PIC S9(4) COMP.            00039003
000391     05  VN100-P12MN-SLSRNK-NBR        PIC S9(4) COMP.            00039103
000392     05  VN100-EDI-PO-PREPK-CDE        PIC X(1).                  00039203
000393     05  VN100-SHRT-VND-NM             PIC X(10).                 00039303
000394     05  FILLER                        PIC X(10).                 00039404
