000100******************************************************************00010000
000200**  THIS IS THE RECORD LAYOUT FOR THE CWT_EXENT_CPBL_CDE EDW    **00020008
000300**  TABLE                                                       **00030002
000400**                                                              **00040002
000500**  COPYBOOK VNRD206                                            **00050008
000600**  USED IN VNKUT211                                            **00060008
000700**                                                              **00070000
000800**  RECORD FORMAT:  SEQUENTIAL, LRECL=068                       **00080004
000900******************************************************************00090000
001000**   CHANGE LOG:                                                **00100000
001100**                                                              **00110000
001200**                                                              **00120000
001300**                                                              **00130000
001400******************************************************************00140000
001500 01  VN206-RECORD.                                                00150005
001600     05  VN206-EXENT-CPBL-CDE           PIC  X(03).               00160005
001700     05  VN206-EXENT-CPBL-DESC          PIC  X(30).               00170005
001800     05  VN206-ACTV-CDE                 PIC  X(01).               00180005
001900     05  VN206-SOR-LAST-UPD-TMST        PIC  X(26).               00190005
002000     05  VN206-SOR-LAST-UPD-USRID       PIC  X(08).               00200008
