000010*----------------------------------------------------------------*00001000
000020*   RECORD LAYOUT FOR THE VENDOR CAPABILITIES EXTRACT FOR        *00002000
000030*   DOMAIN COPIES. (DB2 TABLE VNT_VND_CPBL)                      *00003001
000031*                                                                *00003100
000040*   RECORD FORMAT IS SEQUENTIAL                                  *00004000
000050*          LENGTH = 100                                          *00005000
000060*----------------------------------------------------------------*00006000
000061 01  VN104-CAPABILITY-EXTRACT-RECD.                               00006100
000062     05 VN104-ENT-ID                  PIC  S9(9) COMP.            00006200
000063     05 VN104-VND-CPBL-CDE            PIC   X(3).                 00006300
000064     05 VN104-EFF-BEG-DTE             PIC   X(10).                00006400
000065     05 VN104-EFF-END-DTE             PIC   X(10).                00006500
000066     05 VN104-CRE-DTE                 PIC   X(10).                00006600
000067     05 VN104-LAST-UPD-BY-USR-ID      PIC   X(8).                 00006700
000068     05 VN104-LAST-UPD-TMST           PIC   X(26).                00006800
000069     05 FILLER                        PIC   X(29).                00006900
