000100******************************************************************00010000
000200*  COPYBOOK: VNRD007                                             *00020000
000300*  THIS IS THE COPYBOOK FOR THE CONSUMER DIRECT SHIP VENDOR      *00030000
000400*  FILE THAT IS FTP'D TO THE LAN.                                *00040000
000500*                                                                *00050000
000600*  USED IN:  VNKUT107                                            *00060000
000700*                                                                *00070000
000800*  LRECL 200                                                     *00080000
000900*                                                                *00090000
001000******************************************************************00100000
001100*  CHANGE RECORD:                                                *00110000
001200*                                                                *00120000
001300*  10/15/2008  SCOTT KRUSCHKA                     WR# 35285      *00130000
001400*    INITIAL CREATION.                                           *00140000
001500*                                                                *00150000
001510*  06/09/2009  KRYSTEN LEROY                      WR# 36729      *00151003
001520*    ADDED THE VN007-PRFT-DISCOUNT-PCT FIELD, RENUMBERED THE     *00152003
001530*    THE FILLER FIELDS ACCORDINGLY, ADJUSTED THE PIC VALUE OF THE*00153003
001540*    LAST FILLER FIELD SO THAT THE LRECL WOULD REMAIN 200.       *00154003
001600******************************************************************00160000
001700 01  VN007-VENDOR-REPORT-REC.                                     00170000
001800   02  VN007-COL-AREA                   PIC X(200).               00180000
001900   02  VN007-REPT-AREA REDEFINES VN007-COL-AREA.                  00190000
002000     05  VN007-ENT-NAME-DESC            PIC X(30).                00200000
002100     05  VN007-FILLER-1                 PIC X(01).                00210000
002200     05  VN007-DUN-NBR                  PIC X(09).                00220000
002300     05  VN007-FILLER-2                 PIC X(01).                00230000
002400     05  VN007-DEPT-NBR                 PIC X(03).                00240000
002500     05  VN007-FILLER-3                 PIC X(01).                00250000
002600     05  VN007-PYMNT-TERMS-DESC         PIC X(28).                00260000
002700     05  VN007-FILLER-4                 PIC X(01).                00270000
002800     05  VN007-NEW-STR-DAYS-QTY         PIC -9(4).                00280000
002900     05  VN007-FILLER-5                 PIC X(01).                00290000
003000     05  VN007-NEW-DISCOUNT-PCT         PIC -99.99.               00300000
003100     05  VN007-FILLER-6                 PIC X(01).                00310000
003200     05  VN007-MOS-DISCOUNT-PCT         PIC -99.99.               00320000
003300     05  VN007-FILLER-7                 PIC X(01).                00330000
003400     05  VN007-TRD-DISCOUNT-PCT         PIC -99.99.               00340000
003500     05  VN007-FILLER-8                 PIC X(01).                00350000
003600     05  VN007-BRD-DISCOUNT-PCT         PIC -99.99.               00360000
003700     05  VN007-FILLER-9                 PIC X(01).                00370000
003800     05  VN007-COOP-DISCOUNT-PCT        PIC -99.99.               00380000
003900     05  VN007-FILLER-10                PIC X(01).                00390000
003910     05  VN007-PRFT-DISCOUNT-PCT        PIC -99.99.               00391008
003920     05  VN007-FILLER-11                PIC X(01).                00392008
004000     05  VN007-RATE-HNDLG-FEE           PIC X(08).                00400000
004100     05  VN007-FILLER-12                PIC X(01).                00410008
004200     05  VN007-CHRG-PCT-IND             PIC X(01).                00420000
004300     05  VN007-FILLER-13                PIC X(01).                00430008
004400     05  VN007-RTV-RA-REQD-IND          PIC X(01).                00440000
004500     05  VN007-FILLER-14                PIC X(01).                00450008
004600     05  VN007-RTV-NO-RA-REQD-IND       PIC X(01).                00460000
004700     05  VN007-FILLER-15                PIC X(01).                00470008
004800     05  VN007-DEBIT-DESTROY-IND        PIC X(01).                00480000
004900     05  VN007-FILLER-16                PIC X(01).                00490008
005000     05  VN007-MARKOUT-IND              PIC X(01).                00500000
005100     05  VN007-FILLER-17                PIC X(01).                00510008
005200     05  VN007-VND-AUTH-ID              PIC X(10).                00520000
005400     05  VN007-FILLER-18                PIC X(49).                00540008
