000100******************************************************************00010000
000200*                                                                *00020000
000300*    THIS IS THE RECORD LAYOUT FOR THE VENDOR EXTRACT FILE       *00030000
000400*    FOR THE BUSINESS CONTINUITY PROJECT.                        *00040000
000410*    LRECL = 100                                                 *00041000
000500*                                                                *00042000
000600******************************************************************00043000
000700 01  VN010-VENDOR-EXTRACT-REC.                                    00044000
000800     05  VN010-ENT-ID                       PIC 9(09).            00045000
000900     05  VN010-DUN-NBR                      PIC X(09).            00046000
001000     05  VN010-ENT-NAME-DESC                PIC X(30).            00047000
001100     05  VN010-PRIM-TYP-CDE                 PIC X(01).            00048000
001200         88  VN010-MDSE-VENDOR                  VALUE 'M'.        00049000
001300         88  VN010-EXP-VENDOR                   VALUE 'E'.        00050000
001400     05  VN010-CFY-SLSRNK-NBR               PIC 9(04).            00060000
001700     05  VN010-PFY-SLSRNK-NBR               PIC 9(04).            00070000
001900     05  VN010-PRTNR-TYP-CDE                PIC X(02).            00080000
002000         88  VN010-CARRIER                      VALUE 'CR'.       00090000
002100         88  VN010-BROKER                       VALUE 'BR'.       00100000
002200     05  VN010-CAP-EXP-CDE                  PIC X(01).            00110000
002210         88  VN010-VENDOOR-IS-CAPEXP            VALUES 'Y' 'B'.   00120000
002220     05  VN010-VENDOR-ACTIVE-FLG            PIC X(01).            00130000
002230         88  VN010-EXPEN-ACTIVE                 VALUE 'A'.        00140000
002240         88  VN010-EXPEN-INACTIVE               VALUE 'I'.        00150000
002250         88  VN010-MERCH-ACTIVE                 VALUE 'M'.        00160000
002300     05  FILLER                             PIC X(39).            00170000
