000100******************************************************************00010004
000200*                                                                *00020004
000300*    THIS IS THE MESSAGE FORMAT LAYOUT FOR THE INTERFACE OF      *00030004
000400*    SUPPLIERS AND PARTNERS FROM THE LEGACY VENDOR SYSTEM TO     *00040004
000500*    RMS USING MQSERIES MESSAGE QUEUES.                          *00050004
000600*                                                                *00060004
000700***** NOTE: VN003-MSGBUFFER (AT THE BOTTOM) PIC LENGTH HAS TO    *00070004
000800*****       MATCH ANY INCREASE IN THE SIZE TO THE FIELD VALUE    *00080004
000900*****       OF VN003-NEW-VENDOR-MSG-LENGTH AND                   *00090036
001000*****       VN003-PARTNER-MSG-LENGTH.  VN003-MSGBUFFER IS USED   *00100036
001100*****       IN THE MQ CALLS OF VNKCS024.  IT HAS TO BE ABLE      *00110036
001200*****       TO HANDLE THE MAXIMUM MESSAGE LENGTH WHICH IS THE    *00120036
001300*****       VN003-NEW-VENDOR-MESSAGE.                            *00130036
001400*                                                                *00140004
001500******************************************************************00150004
001600 01  VN003-MESSAGE-DETAIL-LAYOUT.                                 00160004
001700     05  VN003-MESSAGE-HEADER.                                    00170004
001800         10  VN003-SEGMENT-TYPE              PIC X(10).           00180004
001900             88  VN003-NEW-VND-SEGMENT       VALUE 'NEW VENDOR'.  00190004
002000             88  VN003-UPD-VND-SEGMENT       VALUE 'VENDOR'.      00200004
002100             88  VN003-ADDRESS-SEGMENT       VALUE 'ADDRESS'.     00210004
002200             88  VN003-DEPT-SEGMENT          VALUE 'DEPT'.        00220004
002300             88  VN003-EDI-SEGMENT           VALUE 'EDI'.         00230004
002400             88  VN003-CPBLTY-SEGMENT        VALUE 'CPBLTY'.      00240009
002500             88  VN003-RLTNSHP-SEGMENT       VALUE 'RLTNSHP'.     00250010
002600             88  VN003-PARTNER-SEGMENT       VALUE 'PARTNER'.     00260031
002700             88  VN003-LONGNAME-SEGMENT      VALUE 'LONGNAME'.    00270026
002800         10  VN003-VENDOR-NBR                PIC X(09).           00280010
002900         10  VN003-ENT-ID                    PIC 9(09).           00290010
003000     05  VN003-NEW-VENDOR-SEGMENT-DATA.                           00300010
003100         10  VN003-VENDOR-SEGMENT-DATA.                           00310010
003200             15  VN003-VENDOR-STATUS         PIC X(01).           00320010
003300             15  VN003-VENDOR-TYPE           PIC X(01).           00330010
003400             15  VN003-PARTNER-TYPE          PIC X(06).           00340010
003500             15  VN003-SCAC-CDE              PIC X(04).           00350010
003600             15  VN003-VENDOR-NAME           PIC X(30).           00360010
003700             15  VN003-LINE-OF-CREDIT        PIC 9(10).99.        00370010
003800             15  VN003-PO-PREPK-CDE          PIC X(01).           00380010
003900         10  VN003-ADDRESS-SEGMENT-DATA.                          00390010
004000             15  VN003-ADDR-SEQ-NBR          PIC 9(05).           00400010
004100             15  VN003-ADDR-TYP-CDE          PIC 9(05).           00410010
004200             15  VN003-PRIMARY-ADDR-IND      PIC X(01).           00420010
004300             15  VN003-ADDR-LINE1            PIC X(30).           00430010
004400             15  VN003-ADDR-LINE2            PIC X(30).           00440010
004500             15  VN003-ADDR-LINE3            PIC X(30).           00450010
004600             15  VN003-CITY                  PIC X(20).           00460010
004700             15  VN003-STATE-PROV            PIC X(06).           00470010
004800             15  VN003-COUNTRY               PIC X(03).           00480010
004900             15  VN003-ZIP                   PIC X(10).           00490010
005000             15  VN003-CONTACT-NAME          PIC X(20).           00500010
005100             15  VN003-TELEPHONE             PIC X(18).           00510010
005200             15  VN003-FAX                   PIC X(20).           00520010
005300             15  VN003-EMAIL                 PIC X(64).           00530010
005400         10  VN003-DEPARTMENT-SEGMENT-DATA.                       00540010
005500             15  VN003-DEPT-NBR              PIC X(04).           00550010
005600             15  VN003-DEPT-STATUS           PIC X(01).           00560010
005700             15  VN003-DC-SPLIT-LEADTIME     PIC 9(05).           00570010
005800             15  VN003-DC-SPLIT-REQD         PIC X(01).           00580010
005900             15  VN003-PRETICKET-LEADTIME    PIC 9(05).           00590010
006000             15  VN003-BULK-TICKETS          PIC X(01).           00600010
006100             15  VN003-TICKET-MAKER          PIC X(01).           00610010
006200             15  VN003-HANGERS               PIC X(01).           00620010
006300             15  VN003-PACK-BY-STORE         PIC X(01).           00630010
006400             15  VN003-NEW-STORE-DISC        PIC .9999.           00640010
006500             15  VN003-NEW-STORE-DAYS        PIC 9(05).           00650010
006600             15  VN003-PAYMENT-TERM-ID       PIC 9(05).           00660010
006700             15  VN003-FREIGHT-TERM-ID       PIC 9(05).           00670010
006800             15  VN003-MOS-DISC              PIC .9999.           00680010
006900             15  VN003-TRADE-DISC            PIC .9999.           00690010
007000             15  VN003-ADV-DISC              PIC .9999.           00700010
007100             15  VN003-COOP-DISC             PIC .9999.           00710012
007200             15  VN003-PRFTASST-ADCOOP-ALW   PIC .9999.           00720019
007300             15  VN003-TBL-TWR-DAYS          PIC 9(05).           00730018
007400             15  VN003-BRDL-DISC             PIC .9999.           00740021
007500         10  VN003-CAPABILITY-SEGMENT-DATA.                       00750010
007600             15  VN003-CPBLTY-CDE            PIC X(03).           00760010
007700             15  VN003-CPBLTY-INDICATOR      PIC X(01).           00770010
007800                 88  VN003-CPBLTY-ADD        VALUE 'A'.           00780010
007900                 88  VN003-CPBLTY-DELETE     VALUE 'D'.           00790010
008000         10  VN003-RELATION-SEGMENT-DATA.                         00800010
008100             15  VN003-RLTNSHP-ENT-ID        PIC X(09).           00810010
008200             15  VN003-RLTNSHP-CDE           PIC X(02).           00820010
008300             15  VN003-RLTNSHP-INDICATOR     PIC X(01).           00830010
008400                 88  VN003-RLTNSHP-ADD       VALUE 'A'.           00840010
008500                 88  VN003-RLTNSHP-DELETE    VALUE 'D'.           00850010
008600     05  VN003-PARTNER-SEGMENT-DATA REDEFINES                     00860035
008700         VN003-NEW-VENDOR-SEGMENT-DATA.                           00870031
008800         10  VN003-PARTNER-SEGMENT-DATA-RED.                      00880035
008900             15  VN003-P-VENDOR-STATUS       PIC X(01).           00890031
009000             15  VN003-P-VENDOR-TYPE         PIC X(01).           00900031
009100             15  VN003-P-PARTNER-TYPE        PIC X(06).           00910031
009200             15  VN003-P-SCAC-CDE            PIC X(04).           00920031
009300             15  VN003-P-VENDOR-NAME         PIC X(30).           00930031
009400             15  VN003-P-LINE-OF-CREDIT      PIC 9(10).99.        00940031
009500             15  VN003-P-PO-PREPK-CDE        PIC X(01).           00950031
009600             15  VN003-P-PARTNER-DELETE-IND  PIC X(01).           00960035
009700         10  VN003-LONGNAME-SEGMENT-DATA.                         00970031
009800             15  VN003-P-LONGNAME            PIC X(250).          00980031
009900         10  VN003-P-FILLER                  PIC X(102).          00990037
010000                                                                  01000010
010100 01  VN003-NEW-VENDOR-MSG-LENGTH             PIC S9(9) VALUE +437.01010030
010200 01  VN003-NEW-VENDOR-MESSAGE.                                    01020010
010300     05  VN003-NEW-VENDOR-HEADER             PIC X(28).           01030010
010400     05  VN003-NEW-VENDOR-DATA               PIC X(409).          01040030
010500                                                                  01050010
010600 01  VN003-VENDOR-MSG-LENGTH                 PIC S9(9) VALUE +85. 01060025
010700 01  VN003-VENDOR-MESSAGE.                                        01070010
010800     05  VN003-VENDOR-HEADER                 PIC X(28).           01080010
010900     05  VN003-VENDOR-DATA                   PIC X(56).           01090025
011000     05  VN003-PARTNER-DELETE-IND            PIC X(1).            01100010
011100                                                                  01110010
011200 01  VN003-ADDRESS-MSG-LENGTH                PIC S9(9) VALUE +291.01120010
011300 01  VN003-ADDRESS-MESSAGE.                                       01130010
011400     05  VN003-ADDRESS-HEADER                PIC X(28).           01140010
011500     05  VN003-ADDRESS-DATA                  PIC X(262).          01150010
011600     05  VN003-ADDRESS-DELETE-IND            PIC X(1).            01160010
011700                                                                  01170010
011800 01  VN003-DEPARTMENT-MSG-LENGTH             PIC S9(9) VALUE +103.01180021
011900 01  VN003-DEPARTMENT-MESSAGE.                                    01190010
012000     05  VN003-DEPARTMENT-HEADER             PIC X(28).           01200010
012100     05  VN003-DEPARTMENT-DATA               PIC X(75).           01210021
012200                                                                  01220010
012300 01  VN003-EDI-MSG-LENGTH                    PIC S9(9) VALUE +36. 01230010
012400 01  VN003-EDI-MESSAGE.                                           01240010
012500     05  VN003-EDI-HEADER                    PIC X(28).           01250010
012600     05  VN003-EDI-PO-IND                    PIC X(01).           01260010
012700     05  VN003-EDI-ASN-IND                   PIC X(01).           01270010
012800     05  VN003-EDI-POCHG-IND                 PIC X(01).           01280010
012900     05  VN003-EDI-PO-PROD-IND               PIC X(01).           01290010
013000     05  VN003-EDI-PO-TEST-IND               PIC X(01).           01300010
013100     05  VN003-EDI-POCHG-PROD-IND            PIC X(01).           01310010
013200     05  VN003-EDI-POCHG-TEST-IND            PIC X(01).           01320010
013300     05  VN003-EDI-VNDR-TYPE-IND             PIC X(01).           01330010
013400                                                                  01340010
013500 01  VN003-CPBLTY-MSG-LENGTH                 PIC S9(9) VALUE +32. 01350010
013600 01  VN003-CPBLTY-MESSAGE.                                        01360010
013700     05  VN003-CPBLTY-HEADER                 PIC X(28).           01370010
013800     05  VN003-CPBLTY-DATA                   PIC X(04).           01380010
013900                                                                  01390010
014000 01  VN003-RLTNSHP-MSG-LENGTH                PIC S9(9) VALUE +40. 01400010
014100 01  VN003-RLTNSHP-MESSAGE.                                       01410010
014200     05  VN003-RLTNSHP-HEADER                PIC X(28).           01420010
014300     05  VN003-RLTNSHP-DATA                  PIC X(12).           01430010
014400                                                                  01440010
014500 01  VN003-PARTNER-MSG-LENGTH                PIC S9(9) VALUE +437.01450035
014600 01  VN003-PARTNER-MESSAGE.                                       01460031
014700     05  VN003-PARTNER-HEADER                PIC X(28).           01470031
014800     05  VN003-PARTNER-DATA                  PIC X(409).          01480035
014900                                                                  01490031
015000 01  VN003-LONGNAME-MSG-LENGTH               PIC S9(9) VALUE +279.01500039
015100 01  VN003-LONGNAME-MESSAGE.                                      01510031
015200     05  VN003-LONGNAME-HEADER               PIC X(28).           01520031
015300     05  VN003-LONGNAME-DATA                 PIC X(250).          01530031
015400     05  VN003-LONGNAME-DELETE-IND           PIC X(1).            01540039
015500                                                                  01550031
015600** THE PIC LENGTH BELOW HAS TO MATCH THE PIC VALUE OF THE LONGEST 01560026
015700** MESSAGES ABOVE (VN003-NEW-VENDOR-MSG-LENGTH &                  01570036
015800** VN003-PARTNER-MSG-LENGTH).                                     01580036
015900 01  VN003-MSGBUFFER                         PIC X(437).          01590030
016000                                                                  01600026
