000100******************************************************************00010000
000200*   THIS IS THE VENDOR REPRESENTATIVE EXTRACT RECORD LAYOUT.     *00020000
000300*                                                                *00030000
000400*   USED BY: VNKUT103                                            *00040000
000500*                                                                *00050000
000700*   RECORD FORMAT: SEQUENTIAL                                    *00060000
000800*   LENGTH = 380                                                 *00070000
000801*                                                                *00080000
000802*   CREATED: 02/09/05 ROLF NOHE             WR: W30005           *00080100
000803******************************************************************00080200
000804 01  VN106-VENDOR-REPR-EXT-REC.                                   00080300
000805     05  VN106-ENT-ID                  PIC S9(09) COMP.           00080400
000806     05  VN106-VND-ADDR-ID             PIC S9(04) COMP.           00080500
000807     05  VN106-SEQ-NBR                 PIC S9(04) COMP.           00080600
000808     05  VN106-EMAIL-ADDR-ID           PIC  X(250).               00080700
000810     05  VN106-ADDR-TYP-CDE            PIC S9(04) COMP.           00080800
000820         88  VN106-SALES-REPRESENTATIVE     VALUE 1.              00080900
000830         88  VN106-PURCHASE-ORDER           VALUE 2.              00081000
000840         88  VN106-RETURN-TO-VENDOR         VALUE 3.              00082000
000850         88  VN106-CORPORATE                VALUE 4.              00083000
000860         88  VN106-PRE-TICKETING            VALUE 5.              00084000
000870         88  VN106-SHOWROOM                 VALUE 6.              00085000
000880         88  VN106-EDI                      VALUE 7.              00086000
000890         88  VN106-ACCOUNTS-RECEIVABLE      VALUE 8.              00087000
000900         88  VN106-REMITTANCE               VALUE 9.              00088000
001000         88  VN106-CUSTOMER-SERVICES        VALUE 10.             00089000
001100         88  VN106-CONFIRMATION             VALUE 11.             00090000
001200         88  VN106-SHIPPING                 VALUE 12.             00100000
001300         88  VN106-DC-SPLIT                 VALUE 13.             00110000
001400         88  VN106-DC-CUSTOMER-SERVICES     VALUE 14.             00120000
001500         88  VN106-VENDOR-COMMUNICATION     VALUE 15.             00130000
001600         88  VN106-1099                     VALUE 16.             00140000
001700     05  FILLER                        PIC X(120).                00150000
