000100******************************************************************00010000
000200**  THIS IS THE RECORD LAYOUT FOR THE CWT_EXENT, CWT_EXP_VND &  **00020004
000300**  CWT_MDSE_VND EDW TABLES.                                    **00030004
000400**                                                              **00040004
000500**  COPYBOOK VNRD210                                            **00050008
000600**  USED IN VNKUT210                                            **00060007
000700**                                                              **00070000
000800**  RECORD FORMAT:  SEQUENTIAL, LRECL=136                       **00080006
000900******************************************************************00090000
001000**   CHANGE LOG:                                                **00100000
001100**                                                              **00110000
001200**                                                              **00120000
001300**                                                              **00130000
001400******************************************************************00140000
001500 01  VN210-RECORD.                                                00150001
001600     05  VN210-EXENT-ID                 PIC  X(10).               00160002
001700     05  VN210-EXENT-NBR                PIC  X(10).               00170002
001800     05  VN210-VND-TYP-CDE              PIC  X(01).               00180005
001900     05  VN210-PRIM-EXENT-NM            PIC  X(30).               00190002
002000     05  VN210-EXENT-ACTV-IND           PIC  X(01).               00200002
002100     05  VN210-SHRT-EXENT-NM            PIC  X(10).               00210002
002200     05  VN210-SOR-CRE-TMST             PIC  X(26).               00220002
002300     05  VN210-SOR-LAST-UPD-TMST        PIC  X(26).               00230002
002400     05  VN210-SCAC-CDE                 PIC  X(04).               00240002
002500     05  VN210-CFY-SLS-RNK-NBR          PIC  X(06).               00250002
002600     05  VN210-PFY-SLS-RNK-NBR          PIC  X(06).               00260002
002700     05  VN210-PREV-12-MN-SLS-RNK-NBR   PIC  X(06).               00270002
