00001 ****************************************************************  06/22/93
00002 **                  VNWS004                                     * VNWS004 
00003 **                                                             *     LV001
00004 ** THIS IS THE INTER-APPLICATION COMM AREA LAYOUT FROM THE     *  VNWS004 
00005 ** VENDOR DEPARTMENT SCREEN (VNKCS004)                         *     CL**6
00006 ** LENGTH: 200 BYTES                                           *     CL**4
00007 ****************************************************************  VNWS004 
00008          10  VN004-INTER-APPL-COMMAREA REDEFINES                     CL**2
00009              INTER-APPL-COMM-AREA.                                VNWS004 
00010              15  FILLER            PIC X(01).                     VNWS004 
00011              15  VN004-ENT-ID      PIC S9(09) COMP.                  CL**2
00012              15  FILLER            PIC X(195).                       CL**5
