000101****************************************************************  00010107
000102**                  VNWS010                                    *  00010207
000103**                                                             *  00010307
000104** THIS IS THE SELECTION QUEUE LAYOUT FOR THE VENDOR PAYMENT   *  00010408
000105** TERMS SCREENS.                                              *  00010508
000107**                                                             *  00010707
000108** NOTE: THIS COPYBOOK IS USED BY VENDOR PROGRAMS VNKCS021 AND *  00010807
000109**       VNKCS022.                                             *  00010907
000120****************************************************************  00012007
000200 01  VN010-PAYT-TERM-SELECT-RECORD.                               00020005
000300     05  VN010-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00030005
000400                                                COMP-3.           00040004
000500     05  VN010-MAX-ITEMS              PIC 99    VALUE 20.         00050005
000600     05  VN010-SEL-QUEUE-NAME         PIC X(8).                   00060005
000700     05  VN010-SELECTED-ITEM-ARRAY.                               00070005
000800         10  FILLER                   OCCURS 20 TIMES             00080004
000900                                      INDEXED BY VN010-IDX.       00090005
001000             15  VN010-ITEM           PIC S9(9) COMP-3.           00100005
001100             15  VN010-ACTION-SW      PIC X.                      00110005
001200                 88  VN010-INQ                  VALUE 'I'.        00120005
001300                 88  VN010-UPD                  VALUE 'U'.        00130005
001400                 88  VN010-DEL                  VALUE 'D'.        00140005
001500                 88  VN010-ERR                  VALUE 'E'.        00150005
001600             15  VN010-KEY-DATA.                                  00160005
001700                 20  VN010-PAY-TERM-ID     PIC 9(03) VALUE ZERO.  00170005
002500                 20  VN010-PAYT-TERM-ID-DESC                      00250005
002600                                           PIC X(28).             00260004
002700                                                                  00270004
