00001 ****************************************************************  12/04/95
00002 **                  VNWS005                                    *  VNWS005 
00003 **                                                             *     LV030
00004 ** THIS IS THE ADDRESS DATA THAT IS USED IN THE COPY ADDRESS   *     CL*17
00005 ** PROGRAM: (VNKCS018)                                         *     CL*17
00006 ** LENGTH: 200 BYTES.                                          *     CL*23
00007 ****************************************************************     CL*17
00008          10  VN005-INTER-APPL-COMMAREA  REDEFINES                    CL*26
00009                                         INTER-APPL-COMM-AREA.        CL*24
00010              15  FILLER                 PIC X.                       CL*28
00011              15  VN005-ENT-ID           PIC S9(09) COMP.             CL*21
00012              15  VN005-FUNCTION-ID      PIC S9(04) COMP.             CL*21
00013              15  VN005-REP-SEQ-NBR      PIC S9(04) COMP.             CL*21
00014              15  VN005-LOC-SEQ-NBR      PIC S9(04) COMP.             CL*17
00015              15  VN005-VENDOR-NAME      PIC  X(30).                  CL*18
00016              15  FILLER                 PIC  X(159).                 CL*29
