00001 *                 VNWS002                                         01/12/94
00002 *                                                                 VNWS002 
00003 *    INTER-APPLICATION COMMUNICATION AREA FOR VNKCS002,              LV002
00004 *    VENDOR / DEPARTMENT LIST PROGRAM                                CL**2
00005 *    LENGTH = 200 BYTES                                           VNWS002 
00006 *                                                                 VNWS002 
00007 *    NOTE: THIS COPYBOOK (ALONG WITH 'VNWS003') IS USED BY        VNWS002 
00008 *          THE EDI APPLICATION MODULE 'ETKCS300'. PLEASE NOTIFY      CL**2
00009 *          EDI SUPPORT BEFORE ANY CHANGES ARE IMPLEMENTED.        VNWS002 
00010 *                                                                 VNWS002 
00011 ******************************************************************VNWS002 
00012          10  VN002-INTER-APPL-COMMAREA  REDEFINES                 VNWS002 
00013                                         INTER-APPL-COMM-AREA.     VNWS002 
00014              15  FILLER                     PIC X.                VNWS002 
00015              15  VN002-NUMBER-OF-SELECTED-ITEMS                   VNWS002 
00016                                             PIC S9(9) COMP-3.     VNWS002 
00017              15  VN002-NUMBER-OF-TS-ITEMS   PIC S9(5) COMP-3.     VNWS002 
00018              15  VN002-SEL-QUEUE-NAME       PIC X(8).             VNWS002 
00019              15  VN002-ENT-ID               PIC S9(09) COMP.      VNWS002 
00020              15  VN002-FUNCTION-ID          PIC S9(04) COMP.      VNWS002 
00021              15  FILLER                     PIC X(177).           VNWS002 
