000100******************************************************************00010000
000200*                                                                *00020000
000300*     THIS IS THE WORKING STORAGE COPY MEMBER THAT SERVES AS     *00030000
000400*     THE PARAMETER LIST FOR CALLING THE RMS SUPPLIER MESSAGE    *00040000
000500*     CREATION SUBROUTINE (VNKCS024).                            *00050010
000600*                                                                *00060000
000700******************************************************************00070000
000800 02  VN007-INTERFACE-MESSAGE-PARMS.                               00080000
000900     05  VN007-SENDING-FIELDS.                                    00090000
001000         10  VN007-VENDOR-FIELDS.                                 00100000
001100             15  VN007-VND-NBR             PIC X(09).             00110000
001200             15  VN007-PRIM-TYP-CDE        PIC X(01).             00120000
001300             15  VN007-PRTNR-TYP-CDE       PIC X(02).             00130000
001400             15  VN007-VND-IN-RMS-IND      PIC X(01).             00140000
001500             15  VN007-STATUS-CDE          PIC X(01).             00150000
001600             15  VN007-ENT-NAME-DESC       PIC X(30).             00160000
001700             15  VN007-SCAC-CDE            PIC X(04).             00170000
001800             15  VN007-LINE-OF-CR-AMT      PIC S9(11)V99 COMP-3.  00180000
001900             15  VN007-PRTNR-DELETE-IND    PIC X(01).             00190000
002000             15  VN007-ENT-ID              PIC S9(09) COMP.       00200000
002100             15  VN007-PO-PREPK-CDE        PIC X(01).             00210000
002200         10  VN007-ADDRESS-FIELDS OCCURS 4 TIMES                  00220000
002300                   INDEXED BY VN007-ADDR-IND.                     00230000
002400             15  VN007-FUNCTION-ID         PIC S9(04) COMP.       00240000
002500             15  VN007-ADDR-SEQ-NBR        PIC S9(04) COMP.       00250000
002600             15  VN007-PRIM-ADDR-IND       PIC X(01).             00260000
002700             15  VN007-CNTRY-CD            PIC X(03).             00270000
002800             15  VN007-ADDR-LINE1          PIC X(30).             00280000
002900             15  VN007-ADDR-LINE2          PIC X(30).             00290000
003000             15  VN007-ADDR-LINE3          PIC X(30).             00300000
003100             15  VN007-CITY                PIC X(20).             00310000
003200             15  VN007-ST-PROV-CDE         PIC X(06).             00320000
003300             15  VN007-ZIP-CDE             PIC X(10).             00330000
003400             15  VN007-EMAIL-ADD           PIC X(64).             00340000
003500             15  VN007-CONTACT-NAME        PIC X(20).             00350000
003600             15  VN007-TEL1-NBR            PIC X(18).             00360000
003700             15  VN007-FAX-NBR             PIC X(20).             00370000
003800             15  VN007-ADDR-DELETE-IND     PIC X(01).             00380000
003900         10  VN007-DEPARTMENT-FIELDS OCCURS 10 TIMES              00390000
004000                   INDEXED BY VN007-DEPT-IND.                     00400000
004100             15  VN007-DEPT-NBR            PIC X(3).              00410000
004200             15  VN007-VND-DEPT-STAT-CD    PIC X(1).              00420000
004300             15  VN007-BULK-STK-TKT-IND    PIC X(1).              00430000
004400             15  VN007-TKT-MKR-IND         PIC X(1).              00440000
004500             15  VN007-HANGER-IND          PIC X(1).              00450000
004600             15  VN007-PACK-BY-STR-IND     PIC X(1).              00460000
004700             15  VN007-SPLIT-REQD-IND      PIC X(1).              00470000
004800             15  VN007-SPLIT-LEADTIME-QTY  PIC S9(4)  COMP.       00480000
004900             15  VN007-PRETKT-LEADTIME-QTY PIC S9(4)  COMP.       00490000
005000             15  VN007-NSD-DISC-PCT        PIC SV9999 COMP-3.     00500000
005100             15  VN007-NSD-EXT-DAYS-QTY    PIC S9(4)  COMP.       00510000
005200             15  VN007-MOS-DISC-PCT        PIC SV9999 COMP-3.     00520000
005300             15  VN007-TRD-DISC-PCT        PIC SV9999 COMP-3.     00530000
005400             15  VN007-ADV-DISC-PCT        PIC SV9999 COMP-3.     00540000
005500             15  VN007-COOP-DISC-PCT       PIC SV9999 COMP-3.     00550009
005600             15  VN007-PRFTASST-ADCOOP-PCT PIC SV9999 COMP-3.     00560010
005700             15  VN007-BRDL-DISC-PCT       PIC SV9999 COMP-3.     00570011
005800             15  VN007-TBL-TWR-DAYS-QTY    PIC S9(4)  COMP.       00580010
005900             15  VN007-PAYT-TERM-ID        PIC S9(4)  COMP.       00590000
006000             15  VN007-FRGT-TERM-ID        PIC S9(4)  COMP.       00600000
006100         10  VN007-EDI-FIELDS.                                    00610000
006200             15  VN007-EDI-PO-IND          PIC X(01).             00620000
006300             15  VN007-EDI-ASN-IND         PIC X(01).             00630000
006400             15  VN007-EDI-POCHG-IND       PIC X(01).             00640000
006500             15  VN007-EDI-PO-PROD-IND     PIC X(01).             00650000
006600             15  VN007-EDI-PO-TEST-IND     PIC X(01).             00660000
006700             15  VN007-EDI-POCHG-PROD-IND  PIC X(01).             00670000
006800             15  VN007-EDI-POCHG-TEST-IND  PIC X(01).             00680000
006900             15  VN007-EDI-VNDR-TYPE-IND   PIC X(01).             00690000
007000         10  VN007-CAPABILITY-FIELDS OCCURS 20 TIMES              00700000
007100                   INDEXED BY VN007-CPBL-IND.                     00710001
007200             15  VN007-CPBLTY-CDE          PIC X(03).             00720000
007300             15  VN007-CPBLTY-INDICATOR    PIC X(01).             00730000
007400                 88  VN007-CPBLTY-ADD      VALUE 'A'.             00740000
007500                 88  VN007-CPBLTY-DELETE   VALUE 'D'.             00750000
007600         10  VN007-RELATIONSHIP-FIELDS OCCURS 20 TIMES            00760000
007700                   INDEXED BY VN007-RLTN-IND.                     00770001
007800             15  VN007-RLTNSHP-ENT-ID      PIC X(09).             00780006
007900             15  VN007-RLTNSHP-CDE         PIC X(02).             00790005
008000             15  VN007-RLTNSHP-INDICATOR   PIC X(01).             00800005
008100                 88  VN007-RLTNSHP-ADD     VALUE 'A'.             00810005
008200                 88  VN007-RLTNSHP-DELETE  VALUE 'D'.             00820005
008300         10  VN007-LONGNAME-FIELDS.                               00830015
008400             15  VN007-LONGNAME            PIC X(250).            00840015
008500             15  VN007-LONGNAME-DELETE-IND PIC X(01).             00850017
008600         10  VN007-QMGR-NAME               PIC X(48).             00860014
008700     05  VN007-RETURN-FIELDS.                                     00870005
008800         10  VN007-ERROR-INDICATOR     PIC X(01).                 00880005
008900             88  VN007-NO-ERRORS                  VALUE ' '.      00890005
009000             88  VN007-MQ-ERROR                   VALUE 'M'.      00900005
009100         10  VN007-PROGRAM-NAME       PIC X(08).                  00910005
009200         10  VN007-PARAGRAPH-NAME     PIC X(30).                  00920005
009300         10  VN007-MESSAGE            PIC X(57).                  00930000
009400         10  VN007-REASON-CODE        PIC X(30).                  00940000
