000100******************************************************************00010000
000200*                                                                *00020000
000300*  THIS IS THE WORKING STORAGE COPY MEMBER THAT SERVES AS THE    *00030000
000400*  PARAMETER LIST FOR CALLING THE RMS SUPPLIER INTERFACE         *00040000
000500*  SUBROUTINE (VNKCS023).                                        *00050000
000600*                                                                *00060000
000700******************************************************************00070000
000800 02 VN013-VENDOR-INTERFACE-PARMS.                                 00080000
000900    05 VN013-SENDING-FIELDS.                                      00090000
001000       10 VN013-ENT-ID                 PIC S9(09) COMP.           00100000
001100       10 VN013-ACTION-CDE             PIC X(01).                 00110000
001200          88 VN013-ACTION-ADD              VALUE 'A'.             00120000
001300          88 VN013-ACTION-UPDATE           VALUE 'U'.             00130000
001400          88 VN013-ACTION-DELETE           VALUE 'D'.             00140000
001500       10 VN013-FUNCTION-TYPE          PIC X(01).                 00150000
001600          88 VN013-FUNCTION-VENDOR         VALUE 'V'.             00160000
001700          88 VN013-FUNCTION-DEPT           VALUE 'D'.             00170000
001800          88 VN013-FUNCTION-TERMS          VALUE 'T'.             00180000
001900          88 VN013-FUNCTION-PROGRAMS       VALUE 'P'.             00190000
002000          88 VN013-FUNCTION-ADDRESS        VALUE 'A'.             00200000
002100          88 VN013-FUNCTION-VENDOR-ALLW    VALUE 'C'.             00210000
002200          88 VN013-FUNCTION-NAME           VALUE 'N'.             00220001
002300       10 VN013-TEXTENT-FIELDS.                                   00230000
002400          15 VN013-VND-NBR             PIC X(09).                 00240000
002500          15 VN013-PRIM-TYP-CDE        PIC X(01).                 00250000
002600             88 VN013-FACTOR               VALUE 'F'.             00260000
002700             88 VN013-EXPENSE              VALUE 'E'.             00270000
002800             88 VN013-MERCHANDISE          VALUE 'M'.             00280000
002900          15 VN013-VND-IN-RMS-IND      PIC X(01).                 00290000
003000          15 VN013-STATUS-CDE          PIC X(01).                 00300000
003100          15 VN013-PO-PREPK-CDE        PIC X(01).                 00310000
003200      10  VN013-TENTNME-FIELDS.                                   00320000
003300          15 VN013-ENT-NAME-DESC       PIC X(30).                 00330000
003400          15 VN013-LONG-NAME           PIC X(250).                00340001
003500      10  VN013-TBUSLOC-FIELDS.                                   00350001
003600          15 VN013-FUNCTION-ID         PIC S9(04) COMP.           00360001
003700          15 VN013-ADDR-SEQ-NBR        PIC S9(04) COMP.           00370001
003800          15 VN013-PRIM-ADDR-IND       PIC X(01).                 00380001
003900          15 VN013-CNTRY-CD            PIC X(03).                 00390001
004000          15 VN013-ADDR-LINE1          PIC X(30).                 00400001
004100          15 VN013-ADDR-LINE2          PIC X(30).                 00410001
004200          15 VN013-ADDR-LINE3          PIC X(30).                 00420001
004300          15 VN013-CITY                PIC X(20).                 00430001
004400          15 VN013-ST-PROV-CDE         PIC X(06).                 00440001
004500          15 VN013-ZIP-CDE             PIC X(10).                 00450001
004600      10  VN013-TENTREP-FIELDS.                                   00460001
004700          15 VN013-EMAIL-ADD           PIC X(64).                 00470001
004800          15 VN013-CONTACT-NAME        PIC X(20).                 00480001
004900          15 VN013-TEL1-NBR            PIC X(18).                 00490001
005000          15 VN013-FAX-NBR             PIC X(20).                 00500001
005100      10  VN013-TVNDDPT-FIELDS.                                   00510001
005200          15 VN013-DEPT-NBR            PIC X(3).                  00520001
005300          15 VN013-VND-DEPT-STAT-CD    PIC X(1).                  00530001
005400      10  VN013-TVNDAGR-FIELDS.                                   00540001
005500          15 VN013-BULK-STK-TKT-IND    PIC X(1).                  00550001
005600          15 VN013-TKT-MKR-IND         PIC X(1).                  00560001
005700          15 VN013-HANGER-IND          PIC X(1).                  00570001
005800          15 VN013-PACK-BY-STR-IND     PIC X(1).                  00580001
005900          15 VN013-SPLIT-REQD-IND      PIC X(1).                  00590001
006000          15 VN013-SPLIT-LEADTIME-QTY  PIC S9(4)  COMP.           00600001
006100          15 VN013-PRETKT-LEADTIME-QTY PIC S9(4)  COMP.           00610001
006200          15 VN013-NSD-DISC-PCT        PIC SV9999 COMP-3.         00620001
006300          15 VN013-NSD-EXT-DAYS-QTY    PIC S9(4)  COMP.           00630001
006400          15 VN013-MOS-DISC-PCT        PIC SV9999 COMP-3.         00640001
006500          15 VN013-TRD-DISC-PCT        PIC SV9999 COMP-3.         00650001
006600          15 VN013-ADV-DISC-PCT        PIC SV9999 COMP-3.         00660001
006700          15 VN013-COOP-DISC-PCT       PIC SV9999 COMP-3.         00670001
006800          15 VN013-PRFTASST-ADCOOP-PCT PIC SV9999 COMP-3.         00680001
006900          15 VN013-TBL-TWR-DAYS-QTY    PIC S9(4)  COMP.           00690001
007000          15 VN013-BRDL-DISC-PCT       PIC SV9999 COMP-3.         00700001
007100          15 VN013-PAYT-TERM-ID        PIC S9(4)  COMP.           00710001
007200          15 VN013-FRGT-TERM-ID        PIC S9(4)  COMP.           00720001
007300      10  VN013-QMGR-NAME              PIC X(48).                 00730001
007400     05  VN013-RETURN-FIELDS.                                     00740001
007500         10  VN013-RMS-VENDOR-IND      PIC X(01).                 00750001
007600             88  VN013-RMS-VENDOR-ADDED           VALUE 'Y'.      00760001
007700         10  VN013-ADDRESS-WARNING     PIC X(01).                 00770001
007800             88  VN013-MAX-ADDR-EXCEEDED          VALUE 'Y'.      00780001
007900         10  VN013-DEPT-WARNING        PIC X(01).                 00790001
008000             88  VN013-MAX-DEPT-EXCEEDED          VALUE 'Y'.      00800001
008100         10  VN013-CPBLTY-WARNING      PIC X(01).                 00810001
008200             88  VN013-MAX-CPBLTY-EXCEEDED        VALUE 'Y'.      00820001
008300         10  VN013-RLTNSHP-WARNING     PIC X(01).                 00830001
008400             88  VN013-MAX-RLTNSHP-EXCEEDED       VALUE 'Y'.      00840001
008500         10  VN013-ERROR-INDICATOR     PIC X(01).                 00850001
008600             88  VN013-NO-ERRORS                  VALUE ' '.      00860001
008700             88  VN013-DB-ERROR                   VALUE 'D'.      00870001
008800             88  VN013-MQ-ERROR                   VALUE 'M'.      00880001
008900         10  VN013-PROGRAM-NAME       PIC X(08).                  00890001
009000         10  VN013-PARAGRAPH-NAME     PIC X(30).                  00900001
009100         10  VN013-MESSAGE            PIC X(57).                  00910001
009200         10  VN013-SQLCODE            PIC X(30).                  00920001
