000100******************* REVISED ************************************  03/02/01
000200****************************************************************  08/02/94
000300**                  VNWS001                                    *  VNWS001 
000400**                                                             *     LV001
000500** THIS IS THE INTER-APPLICATION COMM AREA LAYOUT FROM THE     *  VNWS001 
000600** VENDOR CRITERIA SPECIFICATION.                              *  VNWS001 
000700** LENGTH: 200 BYTES                                           *  VNWS001 
000800**                                                             *  VNWS001 
000900** NOTE: THIS COPYBOOK IS USED BY EDI PROGRAMS ETKCS307 AND    *  VNWS001 
001000**       ETKCS308. PLEASE NOTIFY EDI SUPPORT BEFORE ANY        *  VNWS001 
001100**       CHANGES ARE IMPLEMENTED.                                 VNWS001 
001200****************************************************************  VNWS001 
001300         10  VN001-INTER-APPL-COMMAREA REDEFINES                  VNWS001 
001400             INTER-APPL-COMM-AREA.                                VNWS001 
001500             15  FILLER                    PIC X(01).             VNWS001 
001600             15  VN001-DEPARTMENT-NUMBER   PIC X(03).             VNWS001 
001700             15  VN001-INHOUSE-NUMBER      PIC X(03).             VNWS001 
001800             15  VN001-DUNS-NUMBER         PIC X(09).             VNWS001 
001900             15  VN001-FUNCTION-ID         PIC S9(04) COMP.       VNWS001 
002000             15  VN001-VENDOR-NAME         PIC X(30).             VNWS001 
002100             15  FILLER                    PIC X(04).             VNWS001 
002200             15  FILLER                    PIC X(04).             VNWS001 
002300             15  VN001-STATUS-CODE         PIC X(01).             VNWS001 
002400             15  VN001-VENDOR-TYPE         PIC X(01).             VNWS001 
002500             15  FILLER                    PIC X(142).            VNWS001 
