000100***************************************************************** 00010002
000200*                         VNWS019                                 00020002
000300*                                                                 00030002
000400*   THIS IS THE TEMP-STORAGE QUEUE (RECORD LAYOUT) USED BY        00040002
000500*   VNKCS028 (VENDOR CAPABILITIES LIST) TO PASS ALONG SELECTED    00050002
000600*   VENDOR CAPABILITIES TO THE VENDOR CAPABILITIES 'ADD',         00060002
000700*   'INQUIRY' OR 'UPDATE' SCREENS.                                00070002
000800*                                                                 00080002
000900***************************************************************** 00090002
001000 01  VN019-CAPABILITY-REC.                                        00100002
001100     05  VN019-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00110002
001200                                                COMP-3.           00120002
001300     05  VN019-MAX-ITEMS              PIC  99   VALUE 20.         00130002
001400     05  VN019-KEY-ENT-ID             PIC S9(09) COMP.            00140002
001500     05  VN019-KEY-VENDOR-ID          PIC X(09).                  00150002
001600     05  VN019-KEY-VENDOR-NAME        PIC X(30).                  00160002
001700     05  VN019-KEY-CAPBLTY-CDE        PIC XXX.                    00170002
001800     05  VN019-KEY-CAPBLTY-NAME       PIC X(30).                  00180002
001900     05  VN019-SELECTED-ITEM-ARRAY.                               00190002
002000         10  FILLER                   OCCURS 20 TIMES             00200002
002100                                      INDEXED BY VN019-IDX.       00210002
002200             15  VN019-ITEM           PIC S9(9) COMP-3.           00220002
002300             15  VN019-ACTION-SW      PIC X.                      00230002
002400                 88  VN019-ADD                  VALUE 'A'.        00240002
002500                 88  VN019-INQ                  VALUE 'I'.        00250002
002600                 88  VN019-UPD                  VALUE 'U'.        00260002
002700                 88  VN019-DEL                  VALUE 'D'.        00270002
002800                 88  VN019-ERR                  VALUE 'E'.        00280002
002900             15  VN019-KEY-DATA.                                  00290002
003000                 20  VN019-CAPBLTY-CDE     PIC XXX.               00300002
003100                 20  VN019-CAPBLTY-NAME    PIC X(30).             00310002
