000100***************************************************************** 00010006
000200*                 VNWS018                                         00020006
000300*                                                                 00030006
000400*    INTER-APPLICATION COMMUNICATION AREA FOR VNKCS028,           00040006
000500*    VENDOR CAPABILITIES LIST PROGRAM                             00050006
000600*    LENGTH = 200 BYTES                                           00060006
000700*                                                                 00070006
000800*   THIS IS THE TEMP-STORAGE QUEUE (RECORD LAYOUT) USED BY        00080006
000900*   VNKCS028 (VENDOR CAPABILITIES LIST) TO PASS ALONG SELECTED    00090006
001000*   VENDOR CAPABILITIES TO THE VENDOR CAPABILITIES 'ADD',         00100006
001100*   'INQUIRY' OR 'UPDATE' SCREENS.                                00110006
001200*                                                                 00120006
001300******************************************************************00130006
001400         10  VN018-INTER-APPL-COMMAREA  REDEFINES                 00140006
001500                                        INTER-APPL-COMM-AREA.     00150006
001600             15  FILLER                     PIC X.                00160006
001700             15  VN018-NUMBER-OF-SELECTED-ITEMS                   00170006
001800                                            PIC S9(9) COMP-3.     00180006
001900             15  VN018-NUMBER-OF-TS-ITEMS   PIC S9(5) COMP-3.     00190006
002000             15  VN018-SEL-QUEUE-NAME       PIC X(8).             00200006
002100             15  VN018-ENT-ID               PIC S9(09) COMP.      00210006
002200             15  VN018-VENDOR-NAME          PIC X(30).            00220006
002300             15  VN018-VENDOR-ID            PIC X(09).            00230006
002400             15  VN018-CAPBLTY-CDE          PIC X(3).             00240006
002500             15  VN018-CAPBLTY-NAME         PIC X(30).            00250006
002600             15  FILLER                     PIC X(107).           00260006
