*          DATA SET WSKM315                                             00010005
  PRINT  NOGEN                                                          00020005
*-------------------------------------------------------------------*   00030005
*                                                                   *   00040005
*        MAPSET  WSKM315                                            *   00050005
*        MAP     WS315A                                             *   00060005
*        PROGRAM WSKCS315                                           *   00070005
*        TRANSID W315 - TRIP/WMS SHIPMENT CROSS REFERENCE           *   00080005
*        SYSTEM  CICS ARCHITECTURE                                  *   00090005
*                                                                   *   00100005
*-------------------------------------------------------------------*   00110005
*********************************************************************** 00120000
WSKM315 DFHMSD TYPE=DSECT,                                             X00130007
               LANG=COBOL,                                             X00140000
               MODE=INOUT,                                             X00150000
               STORAGE=AUTO,                                           X00160000
               TERM=3270-2,                                            X00170000
               TIOAPFX=YES                                              00180000
*********************************************************************** 00190000
WS315A  DFHMDI LINE=2,COLUMN=1,                                        X00200000
               SIZE=(19,80),                                           X00210000
               CTRL=(FREEKB),                                          X00220000
               MAPATTS=(COLOR,HILIGHT),                                X00230000
               DSATTS=(COLOR,HILIGHT)                                   00240000
*********************************************************************** 00250000
        DFHMDF POS=(02,01),                                            X00260000
               LENGTH=09,                                              X00270000
               ATTRB=(ASKIP,NORM),                                     X00280000
               COLOR=NEUTRAL,                                          X00290000
               INITIAL='CARRIER: '                                      00300001
ACARR   DFHMDF POS=(02,11),                                            X00310017
               LENGTH=04,                                              X00320000
               ATTRB=(ASKIP,NORM),                                     X00330000
               COLOR=BLUE                                               00340000
        DFHMDF POS=(02,16),                                            X00350001
               LENGTH=09,                                              X00360001
               ATTRB=(ASKIP,NORM),                                     X00370001
               COLOR=NEUTRAL,                                          X00380001
               INITIAL='TRAILER: '                                      00390001
ATRLR   DFHMDF POS=(02,26),                                            X00400018
               LENGTH=12,                                              X00410015
               ATTRB=(ASKIP,NORM),                                     X00420001
               COLOR=BLUE                                               00430001
        DFHMDF POS=(02,39),                                            X00440015
               LENGTH=09,                                              X00450001
               ATTRB=(ASKIP,NORM),                                     X00460001
               COLOR=NEUTRAL,                                          X00470001
               INITIAL='TRIP ID: '                                      00480001
ATRIP   DFHMDF POS=(02,49),                                            X00490018
               LENGTH=09,                                              X00500001
               ATTRB=(ASKIP,NORM),                                     X00510001
               COLOR=BLUE                                               00520001
ATRTYP  DFHMDF POS=(02,59),                                            X00521044
               LENGTH=19,                                              X00522044
               ATTRB=(ASKIP,NORM),                                     X00523044
               COLOR=BLUE                                               00524044
*********************************************************************** 00530000
        DFHMDF POS=(03,01),                                            X00540002
               LENGTH=14,                                              X00550002
               ATTRB=(ASKIP,NORM),                                     X00560000
               COLOR=NEUTRAL,                                          X00570001
               INITIAL='ARRIVAL DATE: '                                 00580001
AARRV   DFHMDF POS=(03,16),                                            X00590018
               LENGTH=10,                                              X00600001
               ATTRB=(ASKIP,NORM),                                     X00610001
               COLOR=BLUE                                               00620001
        DFHMDF POS=(03,47),                                            X00630001
               LENGTH=06,                                              X00640001
               ATTRB=(ASKIP,NORM),                                     X00650000
               COLOR=NEUTRAL,                                          X00660000
               INITIAL='ITEMS '                                         00670001
ASTRIT  DFHMDF POS=(03,54),                                            X00680018
               LENGTH=05,                                              X00690000
               ATTRB=(ASKIP,NORM),                                     X00700000
               COLOR=BLUE,                                             X00710000
               PICOUT='ZZZZ9'                                           00720000
        DFHMDF POS=(03,60),                                            X00730019
               LENGTH=03,                                              X00740001
               ATTRB=(ASKIP,NORM),                                     X00750001
               COLOR=NEUTRAL,                                          X00760001
               INITIAL='TO '                                            00770001
AENDIT  DFHMDF POS=(03,64),                                            X00780020
               LENGTH=05,                                              X00790001
               ATTRB=(ASKIP,NORM),                                     X00800001
               COLOR=BLUE,                                             X00810001
               PICOUT='ZZZZ9'                                           00820001
        DFHMDF POS=(03,70),                                            X00830020
               LENGTH=02,                                              X00840000
               ATTRB=(ASKIP,NORM),                                     X00850000
               COLOR=NEUTRAL,                                          X00860000
               INITIAL='OF'                                             00870000
ATOTIT  DFHMDF POS=(03,73),                                            X00880020
               LENGTH=05,                                              X00890000
               ATTRB=(ASKIP,NORM),                                     X00900000
               COLOR=BLUE,                                             X00910000
               PICOUT='ZZZZ9'                                           00920000
*********************************************************************** 00930027
        DFHMDF POS=(05,19),                                            X00940031
               LENGTH=04,                                              X00950027
               ATTRB=(ASKIP,NORM),                                     X00960027
               COLOR=NEUTRAL,                                          X00970027
               INITIAL='DNLD'                                           00980027
        DFHMDF POS=(05,24),                                            X00990031
               LENGTH=11,                                              X01000031
               ATTRB=(ASKIP,NORM),                                     X01010027
               COLOR=NEUTRAL,                                          X01020027
               INITIAL='--DOWNLOAD-'                                    01030031
        DFHMDF POS=(05,36),                                            X01040031
               LENGTH=11,                                              X01050031
               ATTRB=(ASKIP,NORM),                                     X01060027
               COLOR=NEUTRAL,                                          X01070027
               INITIAL='--RECEIPT--'                                    01080031
        DFHMDF POS=(05,51),                                            X01090031
               LENGTH=04,                                              X01100027
               ATTRB=(ASKIP,NORM),                                     X01110027
               COLOR=NEUTRAL,                                          X01120027
               INITIAL='UNIT'                                           01130027
        DFHMDF POS=(05,59),                                            X01140032
               LENGTH=04,                                              X01150027
               ATTRB=(ASKIP,NORM),                                     X01160027
               COLOR=NEUTRAL,                                          X01170027
               INITIAL='CRTN'                                           01180027
        DFHMDF POS=(05,65),                                            X01190031
               LENGTH=04,                                              X01200027
               ATTRB=(ASKIP,NORM),                                     X01210027
               COLOR=NEUTRAL,                                          X01220027
               INITIAL='SSCC'                                           01230027
        DFHMDF POS=(05,72),                                            X01240032
               LENGTH=06,                                              X01250027
               ATTRB=(ASKIP,NORM),                                     X01260027
               COLOR=NEUTRAL,                                          X01270027
               INITIAL='CREATE'                                         01280027
*********************************************************************** 01290027
        DFHMDF POS=(06,01),                                            X01300028
               LENGTH=01,                                              X01310030
               ATTRB=(ASKIP,NORM),                                     X01320027
               COLOR=NEUTRAL,                                          X01330027
               INITIAL='S'                                              01340030
        DFHMDF POS=(06,03),                                            X01350031
               LENGTH=08,                                              X01360027
               ATTRB=(ASKIP,NORM),                                     X01370027
               COLOR=NEUTRAL,                                          X01380027
               INITIAL='SHIPMENT'                                       01390027
        DFHMDF POS=(06,19),                                            X01400031
               LENGTH=03,                                              X01410027
               ATTRB=(ASKIP,NORM),                                     X01420027
               COLOR=NEUTRAL,                                          X01430027
               INITIAL='IND'                                            01440027
        DFHMDF POS=(06,24),                                            X01450031
               LENGTH=04,                                              X01460027
               ATTRB=(ASKIP,NORM),                                     X01470027
               COLOR=NEUTRAL,                                          X01480027
               INITIAL='DATE'                                           01490027
        DFHMDF POS=(06,30),                                            X01500031
               LENGTH=04,                                              X01510027
               ATTRB=(ASKIP,NORM),                                     X01520027
               COLOR=NEUTRAL,                                          X01530027
               INITIAL='TIME'                                           01540027
        DFHMDF POS=(06,36),                                            X01550031
               LENGTH=04,                                              X01560027
               ATTRB=(ASKIP,NORM),                                     X01570027
               COLOR=NEUTRAL,                                          X01580027
               INITIAL='DATE'                                           01590027
        DFHMDF POS=(06,42),                                            X01600031
               LENGTH=04,                                              X01610027
               ATTRB=(ASKIP,NORM),                                     X01620027
               COLOR=NEUTRAL,                                          X01630027
               INITIAL='TIME'                                           01640027
        DFHMDF POS=(06,52),                                            X01650031
               LENGTH=03,                                              X01660027
               ATTRB=(ASKIP,NORM),                                     X01670027
               COLOR=NEUTRAL,                                          X01680027
               INITIAL='QTY'                                            01690027
        DFHMDF POS=(06,60),                                            X01700032
               LENGTH=03,                                              X01710027
               ATTRB=(ASKIP,NORM),                                     X01720027
               COLOR=NEUTRAL,                                          X01730027
               INITIAL='QTY'                                            01740027
        DFHMDF POS=(06,64),                                            X01750030
               LENGTH=07,                                              X01760031
               ATTRB=(ASKIP,NORM),                                     X01770027
               COLOR=NEUTRAL,                                          X01780027
               INITIAL='CTN QTY'                                        01790031
        DFHMDF POS=(06,73),                                            X01800032
               LENGTH=02,                                              X01810027
               ATTRB=(ASKIP,NORM),                                     X01820027
               COLOR=NEUTRAL,                                          X01830027
               INITIAL='BY'                                             01840027
*********************************************************************** 01850027
*********************************************************************** 01860000
ASEL01  DFHMDF POS=(07,01),                                            X01870031
               LENGTH=01,                                              X01880028
               ATTRB=(UNPROT,NORM,IC),                                 X01890028
               HILIGHT=UNDERLINE,                                      X01900028
               COLOR=GREEN                                              01910028
ASHP01  DFHMDF POS=(07,03),                                            X01920031
               LENGTH=15,                                              X01930023
               ATTRB=(ASKIP,NORM),                                     X01940000
               COLOR=BLUE                                               01950000
ADCD01  DFHMDF POS=(07,19),                                            X01960031
               LENGTH=04,                                              X01970000
               ATTRB=(ASKIP,NORM),                                     X01980000
               COLOR=BLUE                                               01990000
ADDT01  DFHMDF POS=(07,24),                                            X02000031
               LENGTH=05,                                              X02010023
               ATTRB=(ASKIP,NORM),                                     X02020000
               COLOR=BLUE                                               02030000
ADTM01  DFHMDF POS=(07,30),                                            X02040031
               LENGTH=05,                                              X02050001
               ATTRB=(ASKIP,NORM),                                     X02060000
               COLOR=BLUE                                               02070000
ARDT01  DFHMDF POS=(07,36),                                            X02080031
               LENGTH=05,                                              X02090023
               ATTRB=(ASKIP,NORM),                                     X02100000
               COLOR=BLUE                                               02110000
ARTM01  DFHMDF POS=(07,42),                                            X02120031
               LENGTH=05,                                              X02130023
               ATTRB=(ASKIP,NORM),                                     X02140023
               COLOR=BLUE                                               02150023
AUQT01  DFHMDF POS=(07,48),                                            X02160031
               LENGTH=07,                                              X02170025
               ATTRB=(ASKIP,NORM),                                     X02180000
               COLOR=BLUE,                                             X02190023
               PICOUT='ZZZZZZ9'                                         02200025
ACQT01  DFHMDF POS=(07,56),                                            X02210031
               LENGTH=07,                                              X02220025
               ATTRB=(ASKIP,NORM),                                     X02230023
               COLOR=BLUE,                                             X02240023
               PICOUT='ZZZZZZ9'                                         02250025
ACEX01  DFHMDF POS=(07,64),                                            X02260031
               LENGTH=07,                                              X02270027
               ATTRB=(ASKIP,NORM),                                     X02280027
               COLOR=BLUE,                                             X02290027
               PICOUT='ZZZZZZ9'                                         02300027
ACRE01  DFHMDF POS=(07,72),                                            X02310031
               LENGTH=08,                                              X02320001
               ATTRB=(ASKIP,NORM),                                     X02330000
               COLOR=BLUE                                               02340000
*********************************************************************** 02350000
*********************************************************************** 02360033
ASEL02  DFHMDF POS=(08,01),                                            X02370033
               LENGTH=01,                                              X02380033
               ATTRB=(UNPROT,NORM,IC),                                 X02390033
               HILIGHT=UNDERLINE,                                      X02400033
               COLOR=GREEN                                              02410033
ASHP02  DFHMDF POS=(08,03),                                            X02420033
               LENGTH=15,                                              X02430033
               ATTRB=(ASKIP,NORM),                                     X02440033
               COLOR=BLUE                                               02450033
ADCD02  DFHMDF POS=(08,19),                                            X02460033
               LENGTH=04,                                              X02470033
               ATTRB=(ASKIP,NORM),                                     X02480033
               COLOR=BLUE                                               02490033
ADDT02  DFHMDF POS=(08,24),                                            X02500033
               LENGTH=05,                                              X02510033
               ATTRB=(ASKIP,NORM),                                     X02520033
               COLOR=BLUE                                               02530033
ADTM02  DFHMDF POS=(08,30),                                            X02540033
               LENGTH=05,                                              X02550033
               ATTRB=(ASKIP,NORM),                                     X02560033
               COLOR=BLUE                                               02570033
ARDT02  DFHMDF POS=(08,36),                                            X02580033
               LENGTH=05,                                              X02590033
               ATTRB=(ASKIP,NORM),                                     X02600033
               COLOR=BLUE                                               02610033
ARTM02  DFHMDF POS=(08,42),                                            X02620033
               LENGTH=05,                                              X02630033
               ATTRB=(ASKIP,NORM),                                     X02640033
               COLOR=BLUE                                               02650033
AUQT02  DFHMDF POS=(08,48),                                            X02660033
               LENGTH=07,                                              X02670033
               ATTRB=(ASKIP,NORM),                                     X02680033
               COLOR=BLUE,                                             X02690033
               PICOUT='ZZZZZZ9'                                         02700033
ACQT02  DFHMDF POS=(08,56),                                            X02710033
               LENGTH=07,                                              X02720033
               ATTRB=(ASKIP,NORM),                                     X02730033
               COLOR=BLUE,                                             X02740033
               PICOUT='ZZZZZZ9'                                         02750033
ACEX02  DFHMDF POS=(08,64),                                            X02760033
               LENGTH=07,                                              X02770033
               ATTRB=(ASKIP,NORM),                                     X02780033
               COLOR=BLUE,                                             X02790033
               PICOUT='ZZZZZZ9'                                         02800033
ACRE02  DFHMDF POS=(08,72),                                            X02810033
               LENGTH=08,                                              X02820033
               ATTRB=(ASKIP,NORM),                                     X02830033
               COLOR=BLUE                                               02840033
*********************************************************************** 02850033
*********************************************************************** 02860033
ASEL03  DFHMDF POS=(09,01),                                            X02870033
               LENGTH=01,                                              X02880033
               ATTRB=(UNPROT,NORM,IC),                                 X02890033
               HILIGHT=UNDERLINE,                                      X02900033
               COLOR=GREEN                                              02910033
ASHP03  DFHMDF POS=(09,03),                                            X02920033
               LENGTH=15,                                              X02930033
               ATTRB=(ASKIP,NORM),                                     X02940033
               COLOR=BLUE                                               02950033
ADCD03  DFHMDF POS=(09,19),                                            X02960033
               LENGTH=04,                                              X02970033
               ATTRB=(ASKIP,NORM),                                     X02980033
               COLOR=BLUE                                               02990033
ADDT03  DFHMDF POS=(09,24),                                            X03000033
               LENGTH=05,                                              X03010033
               ATTRB=(ASKIP,NORM),                                     X03020033
               COLOR=BLUE                                               03030033
ADTM03  DFHMDF POS=(09,30),                                            X03040033
               LENGTH=05,                                              X03050033
               ATTRB=(ASKIP,NORM),                                     X03060033
               COLOR=BLUE                                               03070033
ARDT03  DFHMDF POS=(09,36),                                            X03080033
               LENGTH=05,                                              X03090033
               ATTRB=(ASKIP,NORM),                                     X03100033
               COLOR=BLUE                                               03110033
ARTM03  DFHMDF POS=(09,42),                                            X03120033
               LENGTH=05,                                              X03130033
               ATTRB=(ASKIP,NORM),                                     X03140033
               COLOR=BLUE                                               03150033
AUQT03  DFHMDF POS=(09,48),                                            X03160033
               LENGTH=07,                                              X03170033
               ATTRB=(ASKIP,NORM),                                     X03180033
               COLOR=BLUE,                                             X03190033
               PICOUT='ZZZZZZ9'                                         03200033
ACQT03  DFHMDF POS=(09,56),                                            X03210033
               LENGTH=07,                                              X03220033
               ATTRB=(ASKIP,NORM),                                     X03230033
               COLOR=BLUE,                                             X03240033
               PICOUT='ZZZZZZ9'                                         03250033
ACEX03  DFHMDF POS=(09,64),                                            X03260033
               LENGTH=07,                                              X03270033
               ATTRB=(ASKIP,NORM),                                     X03280033
               COLOR=BLUE,                                             X03290033
               PICOUT='ZZZZZZ9'                                         03300033
ACRE03  DFHMDF POS=(09,72),                                            X03310033
               LENGTH=08,                                              X03320033
               ATTRB=(ASKIP,NORM),                                     X03330033
               COLOR=BLUE                                               03340033
*********************************************************************** 03350033
*********************************************************************** 03360033
ASEL04  DFHMDF POS=(10,01),                                            X03370033
               LENGTH=01,                                              X03380033
               ATTRB=(UNPROT,NORM,IC),                                 X03390033
               HILIGHT=UNDERLINE,                                      X03400033
               COLOR=GREEN                                              03410033
ASHP04  DFHMDF POS=(10,03),                                            X03420033
               LENGTH=15,                                              X03430033
               ATTRB=(ASKIP,NORM),                                     X03440033
               COLOR=BLUE                                               03450033
ADCD04  DFHMDF POS=(10,19),                                            X03460033
               LENGTH=04,                                              X03470033
               ATTRB=(ASKIP,NORM),                                     X03480033
               COLOR=BLUE                                               03490033
ADDT04  DFHMDF POS=(10,24),                                            X03500033
               LENGTH=05,                                              X03510033
               ATTRB=(ASKIP,NORM),                                     X03520033
               COLOR=BLUE                                               03530033
ADTM04  DFHMDF POS=(10,30),                                            X03540033
               LENGTH=05,                                              X03550033
               ATTRB=(ASKIP,NORM),                                     X03560033
               COLOR=BLUE                                               03570033
ARDT04  DFHMDF POS=(10,36),                                            X03580033
               LENGTH=05,                                              X03590033
               ATTRB=(ASKIP,NORM),                                     X03600033
               COLOR=BLUE                                               03610033
ARTM04  DFHMDF POS=(10,42),                                            X03620033
               LENGTH=05,                                              X03630033
               ATTRB=(ASKIP,NORM),                                     X03640033
               COLOR=BLUE                                               03650033
AUQT04  DFHMDF POS=(10,48),                                            X03660033
               LENGTH=07,                                              X03670033
               ATTRB=(ASKIP,NORM),                                     X03680033
               COLOR=BLUE,                                             X03690033
               PICOUT='ZZZZZZ9'                                         03700033
ACQT04  DFHMDF POS=(10,56),                                            X03710033
               LENGTH=07,                                              X03720033
               ATTRB=(ASKIP,NORM),                                     X03730033
               COLOR=BLUE,                                             X03740033
               PICOUT='ZZZZZZ9'                                         03750033
ACEX04  DFHMDF POS=(10,64),                                            X03760033
               LENGTH=07,                                              X03770033
               ATTRB=(ASKIP,NORM),                                     X03780033
               COLOR=BLUE,                                             X03790033
               PICOUT='ZZZZZZ9'                                         03800033
ACRE04  DFHMDF POS=(10,72),                                            X03810033
               LENGTH=08,                                              X03820033
               ATTRB=(ASKIP,NORM),                                     X03830033
               COLOR=BLUE                                               03840033
*********************************************************************** 03850033
*********************************************************************** 03860033
ASEL05  DFHMDF POS=(11,01),                                            X03870033
               LENGTH=01,                                              X03880033
               ATTRB=(UNPROT,NORM,IC),                                 X03890033
               HILIGHT=UNDERLINE,                                      X03900033
               COLOR=GREEN                                              03910033
ASHP05  DFHMDF POS=(11,03),                                            X03920033
               LENGTH=15,                                              X03930033
               ATTRB=(ASKIP,NORM),                                     X03940033
               COLOR=BLUE                                               03950033
ADCD05  DFHMDF POS=(11,19),                                            X03960033
               LENGTH=04,                                              X03970033
               ATTRB=(ASKIP,NORM),                                     X03980033
               COLOR=BLUE                                               03990033
ADDT05  DFHMDF POS=(11,24),                                            X04000033
               LENGTH=05,                                              X04010033
               ATTRB=(ASKIP,NORM),                                     X04020033
               COLOR=BLUE                                               04030033
ADTM05  DFHMDF POS=(11,30),                                            X04040033
               LENGTH=05,                                              X04050033
               ATTRB=(ASKIP,NORM),                                     X04060033
               COLOR=BLUE                                               04070033
ARDT05  DFHMDF POS=(11,36),                                            X04080033
               LENGTH=05,                                              X04090033
               ATTRB=(ASKIP,NORM),                                     X04100033
               COLOR=BLUE                                               04110033
ARTM05  DFHMDF POS=(11,42),                                            X04120033
               LENGTH=05,                                              X04130033
               ATTRB=(ASKIP,NORM),                                     X04140033
               COLOR=BLUE                                               04150033
AUQT05  DFHMDF POS=(11,48),                                            X04160033
               LENGTH=07,                                              X04170033
               ATTRB=(ASKIP,NORM),                                     X04180033
               COLOR=BLUE,                                             X04190033
               PICOUT='ZZZZZZ9'                                         04200033
ACQT05  DFHMDF POS=(11,56),                                            X04210033
               LENGTH=07,                                              X04220033
               ATTRB=(ASKIP,NORM),                                     X04230033
               COLOR=BLUE,                                             X04240033
               PICOUT='ZZZZZZ9'                                         04250033
ACEX05  DFHMDF POS=(11,64),                                            X04260033
               LENGTH=07,                                              X04270033
               ATTRB=(ASKIP,NORM),                                     X04280033
               COLOR=BLUE,                                             X04290033
               PICOUT='ZZZZZZ9'                                         04300033
ACRE05  DFHMDF POS=(11,72),                                            X04310033
               LENGTH=08,                                              X04320033
               ATTRB=(ASKIP,NORM),                                     X04330033
               COLOR=BLUE                                               04340033
*********************************************************************** 04350033
*********************************************************************** 04360033
ASEL06  DFHMDF POS=(12,01),                                            X04370033
               LENGTH=01,                                              X04380033
               ATTRB=(UNPROT,NORM,IC),                                 X04390033
               HILIGHT=UNDERLINE,                                      X04400033
               COLOR=GREEN                                              04410033
ASHP06  DFHMDF POS=(12,03),                                            X04420033
               LENGTH=15,                                              X04430033
               ATTRB=(ASKIP,NORM),                                     X04440033
               COLOR=BLUE                                               04450033
ADCD06  DFHMDF POS=(12,19),                                            X04460033
               LENGTH=04,                                              X04470033
               ATTRB=(ASKIP,NORM),                                     X04480033
               COLOR=BLUE                                               04490033
ADDT06  DFHMDF POS=(12,24),                                            X04500033
               LENGTH=05,                                              X04510033
               ATTRB=(ASKIP,NORM),                                     X04520033
               COLOR=BLUE                                               04530033
ADTM06  DFHMDF POS=(12,30),                                            X04540033
               LENGTH=05,                                              X04550033
               ATTRB=(ASKIP,NORM),                                     X04560033
               COLOR=BLUE                                               04570033
ARDT06  DFHMDF POS=(12,36),                                            X04580033
               LENGTH=05,                                              X04590033
               ATTRB=(ASKIP,NORM),                                     X04600033
               COLOR=BLUE                                               04610033
ARTM06  DFHMDF POS=(12,42),                                            X04620033
               LENGTH=05,                                              X04630033
               ATTRB=(ASKIP,NORM),                                     X04640033
               COLOR=BLUE                                               04650033
AUQT06  DFHMDF POS=(12,48),                                            X04660033
               LENGTH=07,                                              X04670033
               ATTRB=(ASKIP,NORM),                                     X04680033
               COLOR=BLUE,                                             X04690033
               PICOUT='ZZZZZZ9'                                         04700033
ACQT06  DFHMDF POS=(12,56),                                            X04710033
               LENGTH=07,                                              X04720033
               ATTRB=(ASKIP,NORM),                                     X04730033
               COLOR=BLUE,                                             X04740033
               PICOUT='ZZZZZZ9'                                         04750033
ACEX06  DFHMDF POS=(12,64),                                            X04760033
               LENGTH=07,                                              X04770033
               ATTRB=(ASKIP,NORM),                                     X04780033
               COLOR=BLUE,                                             X04790033
               PICOUT='ZZZZZZ9'                                         04800033
ACRE06  DFHMDF POS=(12,72),                                            X04810033
               LENGTH=08,                                              X04820033
               ATTRB=(ASKIP,NORM),                                     X04830033
               COLOR=BLUE                                               04840033
*********************************************************************** 04850033
*********************************************************************** 04860033
ASEL07  DFHMDF POS=(13,01),                                            X04870033
               LENGTH=01,                                              X04880033
               ATTRB=(UNPROT,NORM,IC),                                 X04890033
               HILIGHT=UNDERLINE,                                      X04900033
               COLOR=GREEN                                              04910033
ASHP07  DFHMDF POS=(13,03),                                            X04920033
               LENGTH=15,                                              X04930033
               ATTRB=(ASKIP,NORM),                                     X04940033
               COLOR=BLUE                                               04950033
ADCD07  DFHMDF POS=(13,19),                                            X04960033
               LENGTH=04,                                              X04970033
               ATTRB=(ASKIP,NORM),                                     X04980033
               COLOR=BLUE                                               04990033
ADDT07  DFHMDF POS=(13,24),                                            X05000033
               LENGTH=05,                                              X05010033
               ATTRB=(ASKIP,NORM),                                     X05020033
               COLOR=BLUE                                               05030033
ADTM07  DFHMDF POS=(13,30),                                            X05040033
               LENGTH=05,                                              X05050033
               ATTRB=(ASKIP,NORM),                                     X05060033
               COLOR=BLUE                                               05070033
ARDT07  DFHMDF POS=(13,36),                                            X05080033
               LENGTH=05,                                              X05090033
               ATTRB=(ASKIP,NORM),                                     X05100033
               COLOR=BLUE                                               05110033
ARTM07  DFHMDF POS=(13,42),                                            X05120033
               LENGTH=05,                                              X05130033
               ATTRB=(ASKIP,NORM),                                     X05140033
               COLOR=BLUE                                               05150033
AUQT07  DFHMDF POS=(13,48),                                            X05160033
               LENGTH=07,                                              X05170033
               ATTRB=(ASKIP,NORM),                                     X05180033
               COLOR=BLUE,                                             X05190033
               PICOUT='ZZZZZZ9'                                         05200033
ACQT07  DFHMDF POS=(13,56),                                            X05210033
               LENGTH=07,                                              X05220033
               ATTRB=(ASKIP,NORM),                                     X05230033
               COLOR=BLUE,                                             X05240033
               PICOUT='ZZZZZZ9'                                         05250033
ACEX07  DFHMDF POS=(13,64),                                            X05260033
               LENGTH=07,                                              X05270033
               ATTRB=(ASKIP,NORM),                                     X05280033
               COLOR=BLUE,                                             X05290033
               PICOUT='ZZZZZZ9'                                         05300033
ACRE07  DFHMDF POS=(13,72),                                            X05310033
               LENGTH=08,                                              X05320033
               ATTRB=(ASKIP,NORM),                                     X05330033
               COLOR=BLUE                                               05340033
*********************************************************************** 05350033
*********************************************************************** 05360033
ASEL08  DFHMDF POS=(14,01),                                            X05370033
               LENGTH=01,                                              X05380033
               ATTRB=(UNPROT,NORM,IC),                                 X05390033
               HILIGHT=UNDERLINE,                                      X05400033
               COLOR=GREEN                                              05410033
ASHP08  DFHMDF POS=(14,03),                                            X05420033
               LENGTH=15,                                              X05430033
               ATTRB=(ASKIP,NORM),                                     X05440033
               COLOR=BLUE                                               05450033
ADCD08  DFHMDF POS=(14,19),                                            X05460033
               LENGTH=04,                                              X05470033
               ATTRB=(ASKIP,NORM),                                     X05480033
               COLOR=BLUE                                               05490033
ADDT08  DFHMDF POS=(14,24),                                            X05500033
               LENGTH=05,                                              X05510033
               ATTRB=(ASKIP,NORM),                                     X05520033
               COLOR=BLUE                                               05530033
ADTM08  DFHMDF POS=(14,30),                                            X05540033
               LENGTH=05,                                              X05550033
               ATTRB=(ASKIP,NORM),                                     X05560033
               COLOR=BLUE                                               05570033
ARDT08  DFHMDF POS=(14,36),                                            X05580033
               LENGTH=05,                                              X05590033
               ATTRB=(ASKIP,NORM),                                     X05600033
               COLOR=BLUE                                               05610033
ARTM08  DFHMDF POS=(14,42),                                            X05620033
               LENGTH=05,                                              X05630033
               ATTRB=(ASKIP,NORM),                                     X05640033
               COLOR=BLUE                                               05650033
AUQT08  DFHMDF POS=(14,48),                                            X05660033
               LENGTH=07,                                              X05670033
               ATTRB=(ASKIP,NORM),                                     X05680033
               COLOR=BLUE,                                             X05690033
               PICOUT='ZZZZZZ9'                                         05700033
ACQT08  DFHMDF POS=(14,56),                                            X05710033
               LENGTH=07,                                              X05720033
               ATTRB=(ASKIP,NORM),                                     X05730033
               COLOR=BLUE,                                             X05740033
               PICOUT='ZZZZZZ9'                                         05750033
ACEX08  DFHMDF POS=(14,64),                                            X05760033
               LENGTH=07,                                              X05770033
               ATTRB=(ASKIP,NORM),                                     X05780033
               COLOR=BLUE,                                             X05790033
               PICOUT='ZZZZZZ9'                                         05800033
ACRE08  DFHMDF POS=(14,72),                                            X05810033
               LENGTH=08,                                              X05820033
               ATTRB=(ASKIP,NORM),                                     X05830033
               COLOR=BLUE                                               05840033
*********************************************************************** 05850033
*********************************************************************** 05860033
ASEL09  DFHMDF POS=(15,01),                                            X05870033
               LENGTH=01,                                              X05880033
               ATTRB=(UNPROT,NORM,IC),                                 X05890033
               HILIGHT=UNDERLINE,                                      X05900033
               COLOR=GREEN                                              05910033
ASHP09  DFHMDF POS=(15,03),                                            X05920033
               LENGTH=15,                                              X05930033
               ATTRB=(ASKIP,NORM),                                     X05940033
               COLOR=BLUE                                               05950033
ADCD09  DFHMDF POS=(15,19),                                            X05960033
               LENGTH=04,                                              X05970033
               ATTRB=(ASKIP,NORM),                                     X05980033
               COLOR=BLUE                                               05990033
ADDT09  DFHMDF POS=(15,24),                                            X06000033
               LENGTH=05,                                              X06010033
               ATTRB=(ASKIP,NORM),                                     X06020033
               COLOR=BLUE                                               06030033
ADTM09  DFHMDF POS=(15,30),                                            X06040033
               LENGTH=05,                                              X06050033
               ATTRB=(ASKIP,NORM),                                     X06060033
               COLOR=BLUE                                               06070033
ARDT09  DFHMDF POS=(15,36),                                            X06080033
               LENGTH=05,                                              X06090033
               ATTRB=(ASKIP,NORM),                                     X06100033
               COLOR=BLUE                                               06110033
ARTM09  DFHMDF POS=(15,42),                                            X06120033
               LENGTH=05,                                              X06130033
               ATTRB=(ASKIP,NORM),                                     X06140033
               COLOR=BLUE                                               06150033
AUQT09  DFHMDF POS=(15,48),                                            X06160033
               LENGTH=07,                                              X06170033
               ATTRB=(ASKIP,NORM),                                     X06180033
               COLOR=BLUE,                                             X06190033
               PICOUT='ZZZZZZ9'                                         06200033
ACQT09  DFHMDF POS=(15,56),                                            X06210033
               LENGTH=07,                                              X06220033
               ATTRB=(ASKIP,NORM),                                     X06230033
               COLOR=BLUE,                                             X06240033
               PICOUT='ZZZZZZ9'                                         06250033
ACEX09  DFHMDF POS=(15,64),                                            X06260033
               LENGTH=07,                                              X06270033
               ATTRB=(ASKIP,NORM),                                     X06280033
               COLOR=BLUE,                                             X06290033
               PICOUT='ZZZZZZ9'                                         06300033
ACRE09  DFHMDF POS=(15,72),                                            X06310033
               LENGTH=08,                                              X06320033
               ATTRB=(ASKIP,NORM),                                     X06330033
               COLOR=BLUE                                               06340033
*********************************************************************** 06350033
*********************************************************************** 06360033
ASEL10  DFHMDF POS=(16,01),                                            X06370033
               LENGTH=01,                                              X06380033
               ATTRB=(UNPROT,NORM,IC),                                 X06390033
               HILIGHT=UNDERLINE,                                      X06400033
               COLOR=GREEN                                              06410033
ASHP10  DFHMDF POS=(16,03),                                            X06420033
               LENGTH=15,                                              X06430033
               ATTRB=(ASKIP,NORM),                                     X06440033
               COLOR=BLUE                                               06450033
ADCD10  DFHMDF POS=(16,19),                                            X06460033
               LENGTH=04,                                              X06470033
               ATTRB=(ASKIP,NORM),                                     X06480033
               COLOR=BLUE                                               06490033
ADDT10  DFHMDF POS=(16,24),                                            X06500033
               LENGTH=05,                                              X06510033
               ATTRB=(ASKIP,NORM),                                     X06520033
               COLOR=BLUE                                               06530033
ADTM10  DFHMDF POS=(16,30),                                            X06540033
               LENGTH=05,                                              X06550033
               ATTRB=(ASKIP,NORM),                                     X06560033
               COLOR=BLUE                                               06570033
ARDT10  DFHMDF POS=(16,36),                                            X06580033
               LENGTH=05,                                              X06590033
               ATTRB=(ASKIP,NORM),                                     X06600033
               COLOR=BLUE                                               06610033
ARTM10  DFHMDF POS=(16,42),                                            X06620033
               LENGTH=05,                                              X06630033
               ATTRB=(ASKIP,NORM),                                     X06640033
               COLOR=BLUE                                               06650033
AUQT10  DFHMDF POS=(16,48),                                            X06660033
               LENGTH=07,                                              X06670033
               ATTRB=(ASKIP,NORM),                                     X06680033
               COLOR=BLUE,                                             X06690033
               PICOUT='ZZZZZZ9'                                         06700033
ACQT10  DFHMDF POS=(16,56),                                            X06710033
               LENGTH=07,                                              X06720033
               ATTRB=(ASKIP,NORM),                                     X06730033
               COLOR=BLUE,                                             X06740033
               PICOUT='ZZZZZZ9'                                         06750033
ACEX10  DFHMDF POS=(16,64),                                            X06760033
               LENGTH=07,                                              X06770033
               ATTRB=(ASKIP,NORM),                                     X06780033
               COLOR=BLUE,                                             X06790033
               PICOUT='ZZZZZZ9'                                         06800033
ACRE10  DFHMDF POS=(16,72),                                            X06810033
               LENGTH=08,                                              X06820033
               ATTRB=(ASKIP,NORM),                                     X06830033
               COLOR=BLUE                                               06840033
*********************************************************************** 06850033
*********************************************************************** 06860033
ASEL11  DFHMDF POS=(17,01),                                            X06870033
               LENGTH=01,                                              X06880033
               ATTRB=(UNPROT,NORM,IC),                                 X06890033
               HILIGHT=UNDERLINE,                                      X06900033
               COLOR=GREEN                                              06910033
ASHP11  DFHMDF POS=(17,03),                                            X06920033
               LENGTH=15,                                              X06930033
               ATTRB=(ASKIP,NORM),                                     X06940033
               COLOR=BLUE                                               06950033
ADCD11  DFHMDF POS=(17,19),                                            X06960033
               LENGTH=04,                                              X06970033
               ATTRB=(ASKIP,NORM),                                     X06980033
               COLOR=BLUE                                               06990033
ADDT11  DFHMDF POS=(17,24),                                            X07000033
               LENGTH=05,                                              X07010033
               ATTRB=(ASKIP,NORM),                                     X07020033
               COLOR=BLUE                                               07030033
ADTM11  DFHMDF POS=(17,30),                                            X07040033
               LENGTH=05,                                              X07050033
               ATTRB=(ASKIP,NORM),                                     X07060033
               COLOR=BLUE                                               07070033
ARDT11  DFHMDF POS=(17,36),                                            X07080033
               LENGTH=05,                                              X07090033
               ATTRB=(ASKIP,NORM),                                     X07100033
               COLOR=BLUE                                               07110033
ARTM11  DFHMDF POS=(17,42),                                            X07120033
               LENGTH=05,                                              X07130033
               ATTRB=(ASKIP,NORM),                                     X07140033
               COLOR=BLUE                                               07150033
AUQT11  DFHMDF POS=(17,48),                                            X07160033
               LENGTH=07,                                              X07170033
               ATTRB=(ASKIP,NORM),                                     X07180033
               COLOR=BLUE,                                             X07190033
               PICOUT='ZZZZZZ9'                                         07200033
ACQT11  DFHMDF POS=(17,56),                                            X07210033
               LENGTH=07,                                              X07220033
               ATTRB=(ASKIP,NORM),                                     X07230033
               COLOR=BLUE,                                             X07240033
               PICOUT='ZZZZZZ9'                                         07250033
ACEX11  DFHMDF POS=(17,64),                                            X07260033
               LENGTH=07,                                              X07270033
               ATTRB=(ASKIP,NORM),                                     X07280033
               COLOR=BLUE,                                             X07290033
               PICOUT='ZZZZZZ9'                                         07300033
ACRE11  DFHMDF POS=(17,72),                                            X07310033
               LENGTH=08,                                              X07320033
               ATTRB=(ASKIP,NORM),                                     X07330033
               COLOR=BLUE                                               07340033
*********************************************************************** 07350033
         DFHMDF POS=(18,031),                                          X07360043
               COLOR=NEUTRAL,                                          X07370034
               ATTRB=(ASKIP,BRT),                                      X07380034
               LENGTH=014,                                             X07390034
               INITIAL='TRAILER TOTAL:'                                 07400034
AUNTTOT  DFHMDF POS=(18,046),                                          X07410043
               COLOR=BLUE,                                             X07420034
               ATTRB=(ASKIP),                                          X07430034
               LENGTH=009,                                             X07440040
               PICOUT='ZZZZZZZZ9',                                     X07450040
               INITIAL='         '                                      07460042
ACRTTOT  DFHMDF POS=(18,056),                                          X07470043
               COLOR=BLUE,                                             X07480034
               ATTRB=(ASKIP),                                          X07490034
               LENGTH=007,                                             X07500040
               PICOUT='ZZZZZZ9',                                       X07510040
               INITIAL='       '                                        07520042
ASSCTOT  DFHMDF POS=(18,064),                                          X07530043
               COLOR=BLUE,                                             X07540034
               ATTRB=(ASKIP),                                          X07550034
               LENGTH=007,                                             X07560040
               PICOUT='ZZZZZZ9',                                       X07570040
               INITIAL='       '                                        07580042
*********************************************************************** 07590000
*********************************************************************** 07600000
        DFHMDF POS=(19,45),                                            X07610000
               LENGTH=25,                                              X07620000
               ATTRB=(ASKIP,NORM),                                     X07630000
               COLOR=NEUTRAL,                                          X07640000
               INITIAL='NUMBER OF SELECTED ITEMS:'                      07650000
ASELIT  DFHMDF POS=(19,72),                                            X07660000
               LENGTH=07,                                              X07670000
               ATTRB=(ASKIP,NORM),                                     X07680000
               COLOR=BLUE,                                             X07690000
               PICOUT='ZZZ,ZZ9'                                         07700000
        DFHMSD TYPE=FINAL                                               07710000
        END                                                             07720000
