000200 IDENTIFICATION DIVISION.                                                 
000300 PROGRAM-ID.    WSKUT063.                                                 
000400 AUTHOR.        GERMAN BANDA.                                             
000500 DATE-WRITTEN.  JUNE 2018.                                                
000510*****************************************************************         
000520*  This program will read in a location file and directory      *         
000530*  location and generate the Missing Cases email file           *         
000560*****************************************************************         
227145* 07/10/2019   JIM ARENDT                   CHG0227145                    
227145* IN PARAGRAPH 1000-INIT ADDED A SPACE WHEN DISPLAY PV-IN-VENDOR.         
227145*****************************************************************         
000600 ENVIRONMENT DIVISION.                                                    
000700 INPUT-OUTPUT SECTION.                                                    
000800                                                                          
000900 FILE-CONTROL.                                                            
001000     SELECT PARMS-EXTRACT-FILE        ASSIGN TO INP01.                    
001100     SELECT PARMS-EXTRACT-LOC-FILE    ASSIGN TO INP02.                    
001120     SELECT PARMS-EMAIL-OUT-FILE      ASSIGN TO OUT01.                    
001200                                                                          
001300 DATA DIVISION.                                                           
001400 FILE SECTION.                                                            
001500                                                                          
001600                                                                          
001700 FD  PARMS-EXTRACT-FILE                                                   
001800     RECORDING MODE IS F                                                  
001900     LABEL RECORDS ARE STANDARD                                           
002000     RECORD CONTAINS 80                                                   
002100     BLOCK CONTAINS 0 RECORDS                                             
002200     DATA RECORD IS PARMS-IN-RECORD.                                      
002300 01  PARMS-IN-RECORD                  PIC X(80).                          
002400                                                                          
002410 FD  PARMS-EXTRACT-LOC-FILE                                               
002420     RECORDING MODE IS F                                                  
002430     LABEL RECORDS ARE STANDARD                                           
002440     RECORD CONTAINS 80                                                   
002450     BLOCK CONTAINS 0 RECORDS                                             
002460     DATA RECORD IS PARMS-IN-LOC-RECORD.                                  
002470 01  PARMS-IN-LOC-RECORD              PIC X(80).                          
002480                                                                          
002500 FD  PARMS-EMAIL-OUT-FILE                                                 
002600     RECORDING MODE IS F                                                  
002700     LABEL RECORDS ARE STANDARD                                           
002800     RECORD CONTAINS 133                                                  
002900     BLOCK CONTAINS 0 RECORDS                                             
003000     DATA RECORD IS PARMS-EMAIL-OUT-RECORD.                               
003100 01  PARMS-EMAIL-OUT-RECORD      PIC X(133).                              
003200                                                                          
003300 WORKING-STORAGE SECTION.                                                 
003400                                                                          
003500 01  PV-ABEND-CODE                    PIC S9(04)   VALUE ZERO             
003600                                                   COMP SYNC.             
003700                                                                          
003800 01  PS-PROGRAM-SWITCHES.                                                 
003900     05  PS-END-EXTRACT-SW            PIC X(1)   VALUE 'N'.               
004000         88  PS-END-EXTRACT                      VALUE 'Y'.               
004300                                                                          
004400                                                                          
004500 01  PV-PROGRAM-VARIABLES.                                                
004600     05  PV-RETRY-COUNT               PIC S9(04)  VALUE ZERO              
004700                                                  COMP SYNC.              
004800     05  PV-PARAGRAPH-NAME            PIC X(30)   VALUE SPACES.           
004900     05  PV-ERROR-MESSAGE-1           PIC X(60)   VALUE SPACES.           
005000     05  PV-ERROR-MESSAGE-2           PIC X(60)   VALUE SPACES.           
005010     05  PV-TMST                      PIC X(26)   VALUE SPACES.           
005100     05  PV-SQLCODE                   PIC 9(9)    VALUE ZERO.             
005700     05  PV-DISP-NBR                  PIC Z(8)9.                          
005800     05  PV-POSITION                 PIC 9(05) VALUE 0.                   
005900     05  PV-FIELD-LGTH               PIC 9(05) VALUE 0.                   
005910     05  PV-PUB-ADR-LGTH             PIC 9(03) VALUE 0.                   
006100     05  PV-WORK-FIELD               PIC X(300) VALUE SPACES.             
006200     05  PV-WORK-KEY                  PIC 9(06) VALUE 0.                  
006300     05  PV-ADDR-TRIMMED              PIC X(40) VALUE SPACE.              
006301     05  PV-ADDR-TRIM-NO-SYMBL        PIC X(40) VALUE SPACE.              
006310     05  PV-FORMAT-FOLDER-LOC.                                            
006320         10 PV-FOLDER-ROOT            PIC X(01) VALUE SPACES.             
006330         10 FILLER                    PIC X(02) VALUE ':\'.               
006340         10 PV-FOLDER-DIRA            PIC X(05) VALUE SPACES.             
006350         10 FILLER                    PIC X(01) VALUE '\'.                
006360         10 PV-FOLDER-DIRG            PIC X(02) VALUE SPACES.             
006370         10 FILLER                    PIC X(01) VALUE '\'.                
006380         10 PV-FOLDER-DIRH            PIC X(08) VALUE SPACES.             
006390         10 FILLER                    PIC X(01) VALUE '\'.                
006391         10 PV-FOLDER-DIRL            PIC X(03) VALUE SPACES.             
006392         10 FILLER                    PIC X(01) VALUE '\'.                
006393         10 PV-FOLDER-DIRI            PIC X(07) VALUE SPACES.             
006394         10 FILLER                    PIC X(01) VALUE SPACES.             
006395         10 PV-FOLDER-DIRJ            PIC X(05) VALUE SPACES.             
006396         10 FILLER                    PIC X(01) VALUE SPACES.             
006397         10 PV-FOLDER-DIRK            PIC X(06) VALUE SPACES.             
006398         10 FILLER                    PIC X(01) VALUE '\'.                
006401         10 PV-FOLDER-File            PIC X(05) VALUE                     
006402               'WS_DC'.                                                   
006403         10 PV-FOLDER-EFC-LOC         PIC X(03) VALUE SPACES.             
006404         10 PV-FOLDER-FILE-NME        PIC X(14) VALUE                     
006405                '_MissingCases_'.                                         
006406         10 PV-FOLDER-FILE-DTTM       PIC X(15) VALUE SPACES.             
006407         10 PV-FOLDER-FILE-CSV        PIC X(04) VALUE '.csv'.             
006408     05  PV-FORMAT-HYPER-LINK.                                            
006409         10 FILLER                    PIC X(03) VALUE '///'.              
006410         10 PV-FOLDER-ROOT-H          PIC X(01) VALUE SPACES.             
006411         10 FILLER                    PIC X(02) VALUE ':/'.               
006412         10 PV-FOLDER-DIRA-H          PIC X(05) VALUE SPACES.             
006413         10 FILLER                    PIC X(01) VALUE '/'.                
006414         10 PV-FOLDER-DIRG-H          PIC X(02) VALUE SPACES.             
006415         10 FILLER                    PIC X(01) VALUE '/'.                
006416         10 PV-FOLDER-DIRH-H          PIC X(08) VALUE SPACES.             
006417         10 FILLER                    PIC X(01) VALUE '/'.                
006418         10 PV-FOLDER-DIRL-H          PIC X(03) VALUE SPACES.             
006419         10 FILLER                    PIC X(01) VALUE '/'.                
006423         10 PV-FOLDER-DIRI-H          PIC X(07) VALUE SPACES.             
006424         10 FILLER                    PIC X(03) VALUE '%20'.              
006426         10 PV-FOLDER-DIRJ-H          PIC X(05) VALUE SPACES.             
006427         10 FILLER                    PIC X(03) VALUE '%20'.              
006428         10 PV-FOLDER-DIRK-H          PIC X(06) VALUE SPACES.             
006429         10 FILLER                    PIC X(01) VALUE '/'.                
006432         10 PV-FOLDER-FILE-H          PIC X(05) VALUE                     
006433               'WS_DC'.                                                   
006434         10 PV-FOLDER-EFC-LOC-H       PIC X(03) VALUE SPACES.             
006435         10 PV-FOLDER-FILE-NME-H      PIC X(14) VALUE                     
006436                '_MissingCases_'.                                         
006437         10 PV-FOLDER-FILE-DTTM-H     PIC X(15) VALUE SPACES.             
006438         10 PV-FOLDER-FILE-CSV-H      PIC X(04) VALUE '.csv'.             
006439                                                                          
006440 01  PV-COUNTERS COMP-3.                                                  
006500     05  PV-READ-COUNT                PIC S9(9)    VALUE ZERO.            
006600     05  PV-WRITE-COUNT               PIC S9(9)    VALUE ZERO.            
006700     05  PV-SKIP-COUNT                PIC S9(9)    VALUE ZERO.            
006710     05  PV-COMMIT-COUNT              PIC S9(9)    VALUE ZERO.            
006800                                                                          
006900 01  PC-PROGRAM-CONSTANTS.                                                
007000     05  PC-PROGRAM-NAME              PIC X(08)  VALUE 'WSKUT063'.        
007100     05  PC-MAX-RETRIES               PIC S9(04) VALUE +3                 
007200                                                 COMP SYNC.               
007300     05  PC-COMMIT                    PIC S9(04) VALUE 999.               
007400     05  PC-LT                        PIC X(01)  VALUE '<'.               
007500     05  PC-GT                        PIC X(01)  VALUE '>'.               
007510     05  PC-WSKRX005                  PIC X(08)  VALUE 'WSKRX005'.        
007600     05  PC-Kohls-Ext                 PIC X(10)  VALUE                    
007700                                      '@Kohls.com'.                       
008510 01  PV-PARM-IN-RECORD.                                                   
008520     05  PV-IN-DIR                    PIC X(01) VALUE SPACES.             
008521     05  FILLER                       PIC X(01) VALUE SPACES.             
008522     05  PV-IN-DIRA                   PIC X(05) VALUE SPACES.             
008523     05  FILLER                       PIC X(01) VALUE SPACES.             
008524     05  PV-IN-DIRG                   PIC X(02) VALUE SPACES.             
008525     05  FILLER                       PIC X(01) VALUE SPACES.             
008526     05  PV-IN-DIRH                   PIC X(08) VALUE SPACES.             
008527     05  FILLER                       PIC X(01) VALUE SPACES.             
008528     05  PV-IN-DIRI                   PIC X(07) VALUE SPACES.             
008529     05  FILLER                       PIC X(01) VALUE SPACES.             
008530     05  PV-IN-DIRJ                   PIC X(05) VALUE SPACES.             
008531     05  FILLER                       PIC X(01) VALUE SPACES.             
008532     05  PV-IN-DIRK                   PIC X(06) VALUE SPACES.             
008533     05  FILLER                       PIC X(01) VALUE SPACES.             
008534     05  PV-IN-DIRL                   PIC X(03) VALUE SPACES.             
008535     05  FILLER                       PIC X(01) VALUE SPACES.             
008536     05  PV-IN-DTTM                   PIC X(15) VALUE SPACES.             
008537     05  FILLER                       PIC X(01) VALUE SPACES.             
008538     05  PV-IN-VENDOR                 PIC X(08) VALUE SPACES.             
008539 01  PV-PARM-IN-LOC-RECORD.                                               
008540     05  PV-IN-LOC                    PIC X(03) VALUE SPACES.             
008541     05  FILLER                       PIC X(01) VALUE SPACES.             
008544     05  PV-IN-ADR                    PIC X(25) VALUE SPACES.             
008548 01  PV-EMAIL-OUT-RECORD.                                                 
008550     05  PV-EMAIL-BLANK-LINE             PIC X(133) VALUE SPACE.          
008551     05  PV-email-header-1.                                               
008552         10  PV-header-txt               PIC X(13)  VALUE                 
008553             'helo MVSHOST '.                                             
008554         10  FILLER                      PIC X(67)  VALUE SPACE.          
008555     05  PV-email-header-2.                                               
008556         10  PV-header-from              PIC X(10)  VALUE                 
008557             'mail from:'.                                                
008558         10  PV-header-from-addr         PIC X(26)  VALUE                 
008559             '<KohlsBatchMail@kohls.com>'.                                
008560         10  FILLER                      PIC X(44)  VALUE SPACE.          
008561     05  PV-email-header-3.                                               
008562         10  PV-header-rcpt-to           PIC X(08)  VALUE                 
008563             'rcpt to:'.                                                  
008565         10  PV-rcpt-to-addr             PIC X(40)  VALUE SPACE.          
008568         10  FILLER                      PIC X(47)  VALUE SPACE.          
008569     05  PV-email-header-4.                                               
008570         10  PV-header-data              PIC X(04)  VALUE                 
008571             'data'.                                                      
008572         10  Filler                      PIC X(76)  VALUE SPACE.          
008580     05  PV-email-header-5.                                               
008590         10  PV-header-From              PIC X(31)  VALUE                 
008591             'From: KohlsBatchMail@kohls.com'.                            
008592         10  Filler                      PIC X(49)  VALUE SPACE.          
008593     05  PV-email-header-6.                                               
008594         10  PV-header-To                PIC X(04)  VALUE                 
008595             'To: '.                                                      
008596         10  PV-header-to-addr           PIC X(40)  VALUE SPACE.          
008599         10  Filler                      PIC X(51)  VALUE SPACE.          
008600     05  PV-email-header-7.                                               
008601         10  PV-header-Subject           PIC X(09)  VALUE                 
008602             'Subject: '.                                                 
008604         10  PV-Header-EFC               PIC X(03)  VALUE 'EFC'.          
008605         10  PV-Header-Loc               PIC X(03)  VALUE SPACE.          
008606         10  PV-Header-Txt               PIC X(14)  VALUE                 
008607              ' Missing Cases'.                                           
008608         10  Filler                      PIC X(51)  VALUE SPACE.          
008609     05  PV-email-header-8.                                               
008610         10  PV-header-Subject-IS        PIC X(27)  VALUE                 
008611             'Kohls Information-Services '.                               
008617         10  Filler                      PIC X(53)  VALUE SPACE.          
008618     05  PV-email-header-9.                                               
008619         10  PV-header-Subject-Serv      PIC X(39)  VALUE                 
008620             'Service: Direct-to-Customer Fulfillment'.                   
008621         10  Filler                      PIC X(41)  VALUE SPACE.          
008622     05  PV-email-header-10.                                              
008623         10  PV-header-Subject-Sub       PIC X(22)  VALUE                 
008624             'Sub-Service: Receiving'.                                    
008625         10  Filler                      PIC X(58)  VALUE SPACE.          
008626     05  PV-email-header-11.                                              
008627         10  PV-header-Application       PIC X(12)  VALUE                 
008628             'Application:'.                                              
008629         10  Filler                      PIC X(68)  VALUE SPACE.          
008630     05  PV-email-header-12.                                              
008631         10  PV-header-Application       PIC X(25)  VALUE                 
008632             'List the cases, that EFC '.                                 
008633         10  PV-header-App-loc           PIC X(04)  VALUE SPACE.          
008634         10  PV-header-Received          PIC X(40)  VALUE                 
008635             'received in WMOS from midnight 1 day ago'.                  
008636         10  PV-header-Received-2        PIC X(06)  VALUE                 
008637             ' until'.                                                    
008638         10  Filler                      PIC X(06)  VALUE SPACE.          
008639     05  PV-email-header-12a.                                             
008640         10  PV-header-Application-a     PIC X(25)  VALUE                 
008641             'List the cases, that EFC '.                                 
008642         10  PV-header-App-loc-a         PIC X(04)  VALUE SPACE.          
008643         10  PV-header-Received-a        PIC X(41)  VALUE                 
008644             'received in WAMAS from midnight 1 day ago'.                 
008645         10  PV-header-Received-2-a      PIC X(06)  VALUE                 
008646             ' until'.                                                    
008647         10  Filler                      PIC X(06)  VALUE SPACE.          
008648     05  PV-email-header-13.                                              
008649         10  PV-header-Received-3        PIC X(40)  VALUE                 
008650             'midnight today, that are not recorded in'.                  
008651         10  PV-header-Received-4        PIC X(41)  VALUE                 
008652             ' the corporate Logistics-Receiving system'.                 
008653     05  PV-email-header-14.                                              
008654         10  PV-header-Result            PIC X(07)  VALUE                 
008655             'Result:'.                                                   
008656         10  Filler                      PIC X(73)  VALUE SPACE.          
008657     05  PV-email-header-15.                                              
008658         10  PV-Folder-Location          PIC X(12)  VALUE                 
008659             '+ Location: '.                                              
008660         10  PV-FORMAT-FOLDER-EMAIL      PIC X(88)  VALUE SPACE.          
008661     05  PV-email-header-16.                                              
008662         10  PV-Folder-Location-H        PIC X(12)  VALUE                 
008663             '+ Hyperlink:'.                                              
008664         10  PV-FORMAT-HYPER-EMAIL       PIC X(121) VALUE SPACE.          
008665 01  PV-COMMIT-RECORD.                                                    
008666     05  PV-COMMIT-STMT-1                PIC X(03)  VALUE                 
008667                                         'com'.                           
008668     05  PV-COMMIT-STMT-2                PIC X(04)  VALUE                 
008669                                         'mit;'.                          
008670     05  PV-FILLER-5                     PIC X(73)  VALUE SPACE.          
008680/                                                                         
011100 PROCEDURE DIVISION.                                                      
011200                                                                          
011300     PERFORM 1000-INIT.                                                   
011400                                                                          
011500     PERFORM 2000-PROCESS                                                 
011702                                                                          
011710     PERFORM 9000-TERMINATE.                                              
011800                                                                          
011900     GOBACK.                                                              
012000                                                                          
012100 1000-INIT.                                                               
012200                                                                          
012300     OPEN INPUT  PARMS-EXTRACT-FILE                                       
012310                 PARMS-EXTRACT-LOC-FILE                                   
012400          OUTPUT PARMS-EMAIL-OUT-FILE.                                    
012500                                                                          
012700                                                                          
012800     PERFORM 8000-PARMS-EXTRACT-FILE.                                     
012810     PERFORM 8100-PARMS-EXTRACT-LOC-FILE.                                 
012900                                                                          
227145     DISPLAY 'PV-IN-VENDOR ' PV-IN-VENDOR.                                
012911     DISPLAY PV-PARM-IN-RECORD.                                           
012920                                                                          
012930                                                                          
013000 2000-PROCESS.                                                            
013005     MOVE PV-IN-LOC     TO PV-FOLDER-EFC-LOC                              
013006                           PV-FOLDER-EFC-LOC-H                            
013007                           PV-Header-Loc                                  
013010                           PV-header-App-loc                              
013011                           PV-header-App-loc-a                            
013013     PERFORM 2100-FIND-ADDR-LENGTH                                        
013014     MOVE PV-ADDR-TRIMMED       TO PV-rcpt-to-addr                        
013015     MOVE PV-ADDR-TRIM-NO-SYMBL TO PV-header-to-addr.                     
013020                                                                          
013100     MOVE PV-IN-DIR     TO PV-FOLDER-ROOT                                 
013101                           PV-FOLDER-ROOT-H                               
013110     MOVE PV-IN-DIRA    TO PV-FOLDER-DIRA                                 
013111                           PV-FOLDER-DIRA-H                               
013120     MOVE PV-IN-DIRG    TO PV-FOLDER-DIRG                                 
013121                           PV-FOLDER-DIRG-H                               
013130     MOVE PV-IN-DIRH    TO PV-FOLDER-DIRH                                 
013131                           PV-FOLDER-DIRH-H                               
013140     MOVE PV-IN-DIRI    TO PV-FOLDER-DIRI                                 
013141                           PV-FOLDER-DIRI-H                               
013150     MOVE PV-IN-DIRJ    TO PV-FOLDER-DIRJ                                 
013151                           PV-FOLDER-DIRJ-H                               
013160     MOVE PV-IN-DIRK    TO PV-FOLDER-DIRK                                 
013161                           PV-FOLDER-DIRK-H                               
013170     MOVE PV-IN-DIRL    TO PV-FOLDER-DIRL                                 
013171                           PV-FOLDER-DIRL-H                               
013180     MOVE PV-IN-DTTM    TO PV-FOLDER-FILE-DTTM                            
013181                           PV-FOLDER-FILE-DTTM-H.                         
013182                                                                          
013183                                                                          
013310     MOVE PV-FORMAT-FOLDER-LOC TO PV-FORMAT-FOLDER-EMAIL                  
013311     DISPLAY PV-FORMAT-FOLDER-EMAIL                                       
013320     MOVE PV-FORMAT-HYPER-LINK TO PV-FORMAT-HYPER-EMAIL                   
013400     PERFORM 8200-WRITE-EXTRACT-REC.                                      
013500                                                                          
013700/                                                                         
026100 2100-FIND-ADDR-LENGTH.                                                   
026101     MOVE LENGTH OF PV-IN-ADR      TO PV-FIELD-LGTH.                      
026102     MOVE PV-IN-ADR                TO PV-WORK-FIELD.                      
026103     PERFORM VARYING PV-POSITION                                          
026104                FROM PV-FIELD-LGTH                                        
026105                  BY -1                                                   
026106               UNTIL PV-WORK-FIELD (PV-POSITION : 1) NOT = SPACE          
026107                  OR PV-POSITION = 1                                      
026108                                                                          
026109     END-PERFORM.                                                         
026111     MOVE PV-POSITION                      TO PV-PUB-ADR-LGTH.            
026112     PERFORM 2200-STRING-RFMT-ADDRESS.                                    
026124/                                                                         
026125 2200-STRING-RFMT-ADDRESS.                                                
026126      String PC-LT                                                        
026127             PV-IN-ADR (1:PV-PUB-ADR-LGTH)                                
026128             PC-Kohls-Ext                                                 
026129             PC-GT                                                        
026130             DELIMITED BY SIZE                                            
026131             INTO PV-ADDR-TRIMMED                                         
026133                                                                          
026135      String PV-IN-ADR (1:PV-PUB-ADR-LGTH)                                
026136             PC-Kohls-Ext                                                 
026138             DELIMITED BY SIZE                                            
026139             INTO PV-ADDR-TRIM-NO-SYMBL.                                  
026141                                                                          
026142                                                                          
026143/                                                                         
026150 8000-PARMS-EXTRACT-FILE.                                                 
026300     READ PARMS-EXTRACT-FILE INTO PV-PARM-IN-RECORD                       
026500     AT END                                                               
026600         SET PS-END-EXTRACT           TO TRUE                             
026700     NOT AT END                                                           
026800         ADD 1                        TO PV-READ-COUNT                    
026900     END-READ.                                                            
027000                                                                          
027010 8100-PARMS-EXTRACT-LOC-FILE.                                             
027020                                                                          
027030     READ PARMS-EXTRACT-LOC-FILE INTO PV-PARM-IN-LOC-RECORD               
027040     AT END                                                               
027050         SET PS-END-EXTRACT           TO TRUE                             
027060     NOT AT END                                                           
027070         ADD 1                        TO PV-READ-COUNT                    
027080     END-READ.                                                            
027090                                                                          
027100 8200-WRITE-EXTRACT-REC.                                                  
027200                                                                          
027300     ADD 1                         TO PV-WRITE-COUNT                      
027400                                      PV-COMMIT-COUNT.                    
027500     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-1                  
027510     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-2                  
027520     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-3                  
027521     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-4                  
027522     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-5                  
027523     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-6                  
027524     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-7                  
027525     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-8                  
027526     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-9                  
027527     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-10                 
027528     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-EMAIL-BLANK-LINE                
027529     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-EMAIL-BLANK-LINE                
027530     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-11                 
027531     IF PV-IN-VENDOR   = PC-WSKRX005                                      
027532       WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-12a              
027533     ELSE                                                                 
027534       WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-12               
027535     END-IF                                                               
027536     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-13                 
027537     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-EMAIL-BLANK-LINE                
027538     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-EMAIL-BLANK-LINE                
027539     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-14                 
027540     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-15                 
027541     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-EMAIL-BLANK-LINE                
027542     WRITE PARMS-EMAIL-OUT-RECORD FROM PV-email-header-16.                
027550                                                                          
027690/                                                                         
027700 9000-TERMINATE.                                                          
027800                                                                          
027900     CLOSE PARMS-EXTRACT-FILE                                             
028000           PARMS-EMAIL-OUT-FILE                                           
028100                                                                          
028200     DISPLAY '************************'.                                  
028300     DISPLAY '******* WSKUT063 *******'.                                  
028400     DISPLAY '************************'.                                  
028500     DISPLAY SPACES                                                       
028600                                                                          
028700     MOVE PV-READ-COUNT               TO PV-DISP-NBR                      
028800     DISPLAY 'Records  EXTRACTS READ      = ' PV-DISP-NBR                 
028900                                                                          
029000     MOVE PV-WRITE-COUNT              TO PV-DISP-NBR                      
029100     DISPLAY 'SELECTED EXTRACTS WRITTEN    = ' PV-DISP-NBR                
029200                                                                          
029300     DISPLAY SPACES                                                       
029400     DISPLAY '************************'.                                  
029500                                                                          
033300                                                                          
