000100************************************************************      00010000
000200* WSRD003                                 AS OF 02/08/2007 *      00020014
000300************************************************************      00030000
000400*    RECORD PURPOSE: PICK TICKET INSTRUCTIONS              *      00040012
000500*    RECORD LENGTH:   200 BYTES                            *      00050014
000600************************************************************      00060000
000700 01  WS003-PICK-TICKET-INST.                                      00070006
000800     05  WS003-ACTION-TYPE       PIC X(01)     VALUE SPACES.      00080002
000900         88  WS003-ADD                         VALUE 'A'.         00090002
001000         88  WS003-MODIFY                      VALUE 'M'.         00100002
001100         88  WS003-DELETE                      VALUE 'D'.         00110002
001200*DISTRO NUMBER.                                                   00120011
001300     05  WS003-PKT-CTRL-NBR      PIC X(10).                       00130002
001400*LINE NUMBER.                                                     00140011
001500     05  WS003-PKT-SEQ-NBR       PIC 9(09).                       00150011
001600*SEQ NUMBER.                                                      00160011
001700     05  WS003-SPL-INSTR-NBR     PIC 9(03).                       00170011
001800     05  WS003-SPL-INSTR-TYPE    PIC X(02).                       00180002
001900     05  WS003-SPL-INSTR-CODE    PIC X(02).                       00190002
002000     05  WS003-SPL-INSTR-DESC    PIC X(100).                      00200002
002100     05  WS003-PKT-PROFILE-ID    PIC X(10).                       00210002
002200     05  WS003-HOST-INPT-ID      PIC X(10).                       00220002
002300*DATE FORMAT IS YYYYMMDDHH24MISS                                  00230010
002400     05  WS003-CREATE-DATE-TIME  PIC X(22).                       00240014
002500*DATE FORMAT IS YYYYMMDDHH24MISS                                  00250010
002600     05  WS003-MOD-DATE-TIME     PIC X(22).                       00260014
002610     05  FILLER                  PIC X(09).                       00261014
002700************************************************************      00270011
002800************************************************************      00280011
