000100************************************************************      00010004
000110* WSRD018                                                  *      00011006
000120************************************************************      00012005
000200*    RECORD PURPOSE: BILL OF LADING CONTAINER ITEM         *      00020004
000300*           UPLOAD FROM XML TO MVS  (FEB. 2007)            *      00030007
000400*    RECORD LENGTH:  107 BYTES                             *      00040004
000500*    RECORD FORMAT:  SEQUENTIAL                            *      00050004
000600************************************************************      00060004
000700                                                                  00070004
000800 01  WS018-BOL-CONTAINER-ITEM-REC.                                00080006
000900     05  WS018-LOCATION          PIC 9(04)     VALUE ZEROS.       00090006
001000     05  FILLER                  PIC X(01)     VALUE SPACES.      00100004
001100     05  WS018-BATCH-NBR         PIC 9(07)     VALUE ZEROS.       00110006
001200     05  FILLER                  PIC X(01)     VALUE SPACES.      00120004
001300     05  WS018-BOL-NBR           PIC 9(09)     VALUE ZEROS.       00130006
001400     05  FILLER                  PIC X(01)     VALUE SPACES.      00140004
001500     05  WS018-CONTAINER-ID      PIC X(20)     VALUE ZEROS.       00150006
001600     05  FILLER                  PIC X(01)     VALUE SPACES.      00160004
001700     05  WS018-ITEM-NBR          PIC X(16)     VALUE SPACES.      00170006
001800     05  FILLER                  PIC X(01)     VALUE SPACES.      00180004
001900     05  WS018-DISTRIBUTION-NBR  PIC X(09)     VALUE ZEROS.       00190006
002000     05  FILLER                  PIC X(01)     VALUE SPACES.      00200004
002100     05  WS018-UNIT-QTY          PIC 9(08)     VALUE ZEROS.       00210006
002200     05  FILLER                  PIC X(01)     VALUE SPACES.      00220004
002300     05  WS018-SHIPPED-WGT       PIC X(13)     VALUE ZEROS.       00230006
002400*        9(8)V9(4)                                                00240004
002500     05  FILLER                  PIC X(01)     VALUE SPACES.      00250004
002600     05  WS018-ALLOCATED-WGT     PIC X(13)     VALUE ZEROS.       00260006
002700*        9(8)V9(4)                                                00270004
