000100************************************************************      00010000
000200* WSRD027                                                  *      00020001
000300************************************************************      00030000
000400*    ERROR RECORD LAYOUT FOR RECEIPT PIX TRANSACTION       *      00040000
000410*    WMS PROCESS                                           *      00041000
000420*    RECORD LENGTH: 1055                                   *      00042003
000430************************************************************      00043000
000440 01  WS027-RECEIPT-PIX-ERROR-REC.                                 00044000
000450     05  WS027-ERROR-TYPE-CDE      PIC X(01).                     00045000
000460         88  WS027-REC-NOT-FOUND               VALUE 'A'.         00046000
000470         88  WS027-DUP-INSERT                  VALUE 'B'.         00047000
000480         88  WS027-SQL-ERROR                   VALUE 'C'.         00048000
000490         88  WS027-INVALID-REC                 VALUE 'D'.         00049000
000491         88  WS027-CASE-SHPMT-ERR              VALUE 'E'.         00049104
000492     05  WS027-ERROR-COPYBOOK      PIC X(07).                     00049204
000500     05  WS027-ERROR-PGM-NAME      PIC X(08).                     00050000
000600     05  WS027-ERROR-PARA-NBR      PIC X(05).                     00060000
000610     05  WS027-ERROR-DESC-TXT      PIC X(25).                     00061000
000700     05  WS027-SQLCODE             PIC S9(09).                    00070000
000800     05  WS027-FORMAT-RECORD       PIC X(1000).                   00080003
