000100***************************************************************** 00010000
000200*    WSRD049                                      6/07/2007     * 00020000
000300***************************************************************** 00030000
000400*    WST_PIX_TRAN_HIST  PURGE FILE LAYOUT         LENGTH = 700  * 00040000
000500***************************************************************** 00050000
000600***                                                               00060000
000700 01  WS049-PIX-TRAN-HIST-REC.                                     00070000
000800     10 WS049-TRAN-TYPE               PIC   X(03).                00080000
000900     10 WS049-TRAN-CODE               PIC   X(03).                00090000
001000     10 WS049-TRAN-NBR                PIC  S9(09).                00100000
001100     10 WS049-PIX-SEQ-NBR             PIC  S9(09).                00110000
001200     10 WS049-PROC-STAT-CODE          PIC  S9(02)V.               00120000
001300     10 WS049-WHSE                    PIC   X(03).                00130000
001400     10 WS049-CO                      PIC   X(10).                00140000
001500     10 WS049-DIV                     PIC   X(10).                00150000
001600     10 WS049-CASE-NBR                PIC   X(20).                00160000
001700     10 WS049-SKU-ID                  PIC   X(10).                00170000
001800     10 WS049-SEASON                  PIC   X(02).                00180000
001900     10 WS049-SEASON-YR               PIC   X(02).                00190000
002000     10 WS049-STYLE                   PIC   X(08).                00200000
002100     10 WS049-STYLE-SFX               PIC   X(08).                00210000
002200     10 WS049-COLOR                   PIC   X(04).                00220000
002300     10 WS049-COLOR-SFX               PIC   X(02).                00230000
002400     10 WS049-SEC-DIM                 PIC   X(03).                00240000
002500     10 WS049-QUAL                    PIC   X(01).                00250000
002600     10 WS049-SIZE-DESC               PIC   X(15).                00260000
002700     10 WS049-SIZE-RANGE-CODE         PIC   X(04).                00270000
002800     10 WS049-SIZE-POSN-IN-TBL        PIC   X(02).                00280000
002900     10 WS049-INVN-TYPE               PIC   X(01).                00290000
003000     10 WS049-PROD-STAT               PIC   X(03).                00300000
003100     10 WS049-BATCH-NBR               PIC   X(15).                00310000
003200     10 WS049-SKU-ATTR-1              PIC   X(01).                00320000
003300     10 WS049-SKU-ATTR-2              PIC   X(01).                00330000
003400     10 WS049-SKU-ATTR-3              PIC   X(01).                00340000
003500     10 WS049-SKU-ATTR-4              PIC   X(01).                00350000
003600     10 WS049-SKU-ATTR-5              PIC   X(01).                00360000
003700     10 WS049-CNTRY-OF-ORGN           PIC   X(04).                00370000
003800     10 WS049-INVN-ADJMT-QTY          PIC  S9(8)V9(5).            00380000
003900     10 WS049-INVN-ADJMT-TYPE         PIC   X(01).                00390000
004000     10 WS049-WT-ADJMT-QTY            PIC  S9(8)V9(5).            00400000
004100     10 WS049-WT-ADJMT-TYPE           PIC   X(01).                00410000
004200     10 WS049-UOM                     PIC   X(02).                00420000
004300     10 WS049-REF-WHSE                PIC   X(03).                00430000
004400     10 WS049-RSN-CODE                PIC   X(02).                00440000
004500     10 WS049-RCPT-VARI               PIC   X(01).                00450000
004600     10 WS049-RCPT-CMPL               PIC   X(01).                00460000
004700     10 WS049-CASES-SHPD              PIC  S9(09).                00470000
004800     10 WS049-UNITS-SHPD              PIC  S9(10)V9(5).           00480000
004900     10 WS049-CASES-RCVD              PIC  S9(09).                00490000
005000     10 WS049-UNITS-RCVD              PIC  S9(10)V9(5).           00500000
005100     10 WS049-ACTN-CODE               PIC   X(02).                00510000
005200     10 WS049-CUSTOM-REF              PIC   X(30).                00520000
005300     10 WS049-DATE-PROC               PIC   X(10).                00530000
005400     10 WS049-SYS-USER-ID             PIC   X(15).                00540000
005500     10 WS049-ERROR-CMNT              PIC   X(25).                00550000
005600     10 WS049-REF-CODE-ID-1           PIC   X(03).                00560000
005700     10 WS049-REF-FIELD-1             PIC   X(20).                00570000
005800     10 WS049-REF-CODE-ID-2           PIC   X(03).                00580000
005900     10 WS049-REF-FIELD-2             PIC   X(20).                00590000
006000     10 WS049-REF-CODE-ID-3           PIC   X(03).                00600000
006100     10 WS049-REF-FIELD-3             PIC   X(20).                00610000
006200     10 WS049-REF-CODE-ID-4           PIC   X(03).                00620000
006300     10 WS049-REF-FIELD-4             PIC   X(20).                00630000
006400     10 WS049-REF-CODE-ID-5           PIC   X(03).                00640000
006500     10 WS049-REF-FIELD-5             PIC   X(20).                00650000
006600     10 WS049-REF-CODE-ID-6           PIC   X(03).                00660000
006700     10 WS049-REF-FIELD-6             PIC   X(20).                00670000
006800     10 WS049-REF-CODE-ID-7           PIC   X(03).                00680000
006900     10 WS049-REF-FIELD-7             PIC   X(20).                00690000
007000     10 WS049-REF-CODE-ID-8           PIC   X(03).                00700000
007100     10 WS049-REF-FIELD-8             PIC   X(20).                00710000
007200     10 WS049-REF-CODE-ID-9           PIC   X(03).                00720000
007300     10 WS049-REF-FIELD-9             PIC   X(20).                00730000
007400     10 WS049-REF-CODE-ID-10          PIC   X(03).                00740000
007500     10 WS049-REF-FIELD-10            PIC   X(20).                00750000
007600     10 WS049-XML-GROUP-ID            PIC   X(10).                00760000
007700     10 WS049-CREATE-DATE-TIME        PIC   X(26).                00770000
007800     10 WS049-MOD-DATE-TIME           PIC   X(26).                00780000
007900     10 WS049-USER-ID                 PIC   X(15).                00790000
008000     10 WS049-K-DC-NBR                PIC  S9(04).                00800000
008100     10 WS049-K-ISRT-TMST             PIC   X(26).                00810000
008200     10 FILLER                        PIC   X(38).                00820000
