000100***************************************************************** 00010000
000110*    WSRD045                                      5/22/2007     * 00011000
000111***************************************************************** 00011100
000120*    Pix repository extract file - layout is the same as the    * 00012000
000121*    pix XML plus the Queue name at the end                     * 00012100
000123***************************************************************** 00012300
000124 01  WS045-PIX-REP-REC.                                           00012400
000127     05  WS045-TransactionType               PIC X(03).           00012700
000128     05  WS045-TransactionCode               PIC X(03).           00012800
000129     05  WS045-TransactionNumber             PIC 9(09).           00012900
000130     05  WS045-SequenceNumber                PIC 9(09).           00013000
000131     05  WS045-SKUDefinition.                                     00013100
000140         10  WS045-Company                   PIC X(10).           00014000
000150         10  WS045-Divisio1                  PIC X(10).           00015000
000160         10  WS045-StyleSuffix               PIC X(08).           00016000
000170         10  WS045-SkuID                     PIC X(10).           00017000
000180     05  WS045-SubSKUFields.                                      00018000
000190         10  WS045-InventoryType             PIC X(08).           00019000
000191         10  WS045-ProductStatus             PIC X(08).           00019100
000192         10  WS045-BatchNumber               PIC X(08).           00019200
000193         10  WS045-SKUAttribute1             PIC X(08).           00019300
000194         10  WS045-SKUAttribute2             PIC X(08).           00019400
000195         10  WS045-SKUAttribute3             PIC X(08).           00019500
000196         10  WS045-SKUAttribute4             PIC X(08).           00019600
000197         10  WS045-SKUAttribute5             PIC X(08).           00019700
000198         10  WS045-CountryOfOrgin            PIC X(08).           00019800
000199     05  WS045-PIXFields.                                         00019900
000200         10  WS045-DateCreated               PIC X(19).           00020000
000201         10  WS045-CaseNumber                PIC X(20).           00020100
000202         10  WS045-InvAdjustmentQty          PIC 9(08)v9(5).      00020200
000203         10  WS045-UnitOfMeasure             PIC X(02).           00020300
000204         10  WS045-InvAdjustmentType         PIC X(01).           00020400
000205         10  WS045-ReceivedFrom              PIC X(01).           00020500
000206         10  WS045-Warehouse                 PIC X(12).           00020600
000207         10  WS045-DCNumber                  PIC X(04).           00020700
000208         10  WS045-As400UserID               PIC X(15).           00020800
000209         10  WS045-ReferenceWhse             PIC X(03).           00020900
000210         10  WS045-TransReasonCode           PIC X(02).           00021000
000211         10  WS045-ReceiptsVariance          PIC X(01).           00021100
000212         10  WS045-Weight                    PIC X(02).           00021200
000213         10  WS045-ReceiptsCompleted         PIC X(01).           00021300
000214         10  WS045-CasesShipped              PIC 9(07).           00021400
000215         10  WS045-UnitsShipped              PIC 9(10)v9(05).     00021500
000216         10  WS045-CasesReceived             PIC 9(07).           00021600
000217         10  WS045-UnitsReceived             PIC 9(10)v9(05).     00021700
000218         10  WS045-ReferenceCode1            PIC X(03).           00021800
000219         10  WS045-Reference1                PIC X(20).           00021900
000220         10  WS045-ReferenceCode2            PIC X(03).           00022000
000221         10  WS045-Reference2                PIC X(20).           00022100
000222         10  WS045-ReferenceCode3            PIC X(03).           00022200
000223         10  WS045-Reference3                PIC X(20).           00022300
000224         10  WS045-ReferenceCode4            PIC X(03).           00022400
000225         10  WS045-Reference4                PIC X(20).           00022500
000226         10  WS045-ReferenceCode5            PIC X(03).           00022600
000227         10  WS045-Reference5                PIC X(20).           00022700
000228         10  WS045-ReferenceCode6            PIC X(03).           00022800
000229         10  WS045-ReferenceField6           PIC X(20).           00022900
000230         10  WS045-ReferenceCode7            PIC X(03).           00023000
000231         10  WS045-ReferenceField7           PIC X(20).           00023100
000232         10  WS045-ReferenceCode8            PIC X(03).           00023200
000233         10  WS045-ReferenceField8           PIC X(20).           00023300
000234         10  WS045-ReferenceField9           PIC X(20).           00023400
000235         10  WS045-ReferenceCode9            PIC X(03).           00023500
000236         10  WS045-ReferenceField10          PIC X(20).           00023600
000237         10  WS045-ReferenceCode10           PIC X(03).           00023700
000238         10  WS045-ActionCode                PIC X(02).           00023800
000239         10  WS045-CustomReference           PIC X(30).           00023900
000240         10  WS045-ErrorComment              PIC X(25).           00024000
000250         10  WS045-WeightAdjustmentQuantity  PIC 9(08)v9(05).     00025000
000260         10  WS045-WeightAdjustmentType      PIC X(01).           00026000
000270***                                                               00027000
000280     05  WS045-INSERT-TMST                   PIC X(26).           00028001
000290     05  WS045-DC-NUMBER                     PIC 9(04).           00029001
000291     05  WS045-QUEUE                         PIC X(10).           00029102
000300***                                                               00030001
000400     05  FILLER                              PIC X(85).           00040002
