000010***************************************************************** 00010000
000020*    WSRD023                                                    * 00020000
000030*    RECORD: Case Header/detail     (for XML conversion)        * 00030000
000040***************************************************************** 00031000
218265* CHG0218265  Added AltCaseNbr                                  * 00032000
000040***************************************************************** 00033000
000050 01  INBOUND-ASN-WORK-FIELDS.                                     00034000
000060     05  CH-SUB                          PIC 9(03).               00035000
000070     05  CD-SUB                          PIC 9(04).               00036000
000080     05  CH-count                        PIC 9(03).               00037000
000090     05  CD-count                        PIC 9(04).               00038000
000091     05  WS023-MAX-CRTN-PER-MSG          PIC 9(04) VALUE 150.     00039000
000092                                                                  00040000
000093 01  InboundASNBridge.                                            00050000
000094   05  InboundASN.                                                00060000
000095     10  ShipmentNbr                             PIC X(20).       00070000
000096     10  ToLocation                              PIC X(04).       00080000
000097     10  AsnType                                 PIC X(02).       00090000
000098     10  BatchCtlNbr                             PIC X(10).       00100000
000099     10  ListOfASNCases.                                          00110000
000100         15  ASNCase   occurs 1 to 150 times                      00120000
000101                       DEPENDING ON CH-COUNT.                     00130000
000102             20  CaseNbr                         PIC X(20).       00140000
218265             20  AltCaseNbr                      PIC X(20).       00150000
000103             20  ASNCaseHeaderFields.                             00160000
000104                 25  Warehouse                   PIC X(04).       00170000
000105                 25  Compan1                     PIC X(10).       00180000
000106                 25  Divisio1                    PIC X(10).       00190000
000107                 25  PONbr                       PIC 9(20).       00200000
000107                 25  AltPONbr                    PIC X(10).       00201000
000108                 25  ReceivedShipmentNbr         PIC X(20).       00202000
000109                 25  OriginalShipmentNbr         PIC X(20).       00203000
000110                 25  DcOrderNbr                  PIC X(10).       00204000
000111                 25  WorkOrderNbr                PIC X(12).       00205000
000112                 25  ProcessImmdNeeds            PIC X(01).       00206000
000113                 25  Volume                      PIC X(13).       00207000
000114                 25  EstimatedWeight             PIC X(13).       00208000
000115                 25  ShipVia                     PIC X(04).       00209000
000116                 25  TrailerNumber               PIC X(12).       00210000
000117                 25  StatusDateTime              PIC X(19).       00220000
000118                 25  SingleSkuCase               PIC X(01).       00230000
000119                 25  VendorID                    PIC 9(09).       00240000
000120                 25  PhysicalEntityCode          PIC X(01).       00250000
000120                 25  PoTypeCode                  PIC X(02).       00260000
000120                 25  PresentDesc                 PIC X(05).       00270000
000120                 25  OtpkQty                     PIC 9(04).       00280000
000120                 25  InpkQty                     PIC 9(04).       00290000
000121             20  ListOfASNCaseDetails.                            00300000
000122                 25  ASNCaseDetail     OCCURS 1 TO 600 TIMES      00310000
000123                                       DEPENDING ON CD-COUNT.     00320000
000124                     30  SkuSequenceNbr      PIC 9(05).           00330000
000125                     30  SKUDefinition.                           00331000
000126                         35  Compan2         PIC X(10).           00332000
000127                         35  Divisio2        PIC X(10).           00333000
000128                         35  StyleSuffix     PIC X(08).           00334000
000129                         35  SkuID           PIC X(10).           00335000
000130                     30  ShippedAsnQuantity  PIC 9(13).           00336000
000131                     30  SubSKUFields.                            00337000
000140                         35  InventoryType   PIC x(01).           00338000
000150                     30  ASNCaseDetailFields.                     00339000
000160                         35  CutNbr          PIC x(04).           00340000
000161                         35  ShipmentNb2     PIC x(20).           00350000
000170                         35  AssortmentNbr   PIC 9(12).           00360000
