000100************************************************************      00010002
000200* WSRD014                                                  *      00020002
000300************************************************************      00030002
000400*    RECORD PURPOSE: RECEIPT PIX TRANSACTIONS FROM WMOS    *      00040002
000500*    RECORD LENGTH: 203                                    *      00050007
000600* ***NOTE, IF THIS RECORD LENGTH CHANGES, MUST UPDATE      *      00060009
000700************************************************************      00070002
000800 01  WS014-RECEIPT-PIX-RECORD.                                    00080002
001100     05  WS014-TRANS-TYPE-CODE     PIC X(01).                     00110002
001200         88  WS014-RTE-TO-RCVNG                VALUE 'R'.         00120002
001300         88  WS014-RTE-TO-OTBND-SHIP           VALUE 'S'.         00130002
001400         88  WS014-RTE-TO-INTRANSIT            VALUE 'I'.         00140002
001410     05  WS014-RCVNG-TRANS-TYPE    PIC X(02).                     00141003
001412         88  WS014-TRLR-CHECK-IN               VALUE 'CI'.        00141203
001413         88  WS014-CASE-RECEIPT                VALUE 'CR'.        00141303
001430         88  WS014-VERIFY-SHIPMT               VALUE 'VS'.        00143003
001440         88  WS014-SHUT-DOWN                   VALUE 'SD'.        00144013
001441         88  WS014-CASE-ADJUSTMT               VALUE 'CA'.        00144115
001442     05  WS014-CASE-NUMBER         PIC X(20).                     00144215
001443     05  WS014-PO-NUMBER           PIC 9(08).                     00144315
001444     05  WS014-REC-SEQ-NUMBER      PIC 9(04).                     00144415
001445     05  WS014-PO-LINE-NUMBER      PIC 9(04).                     00144515
001446     05  WS014-SKU-NUMBER          PIC 9(08).                     00144615
001447     05  WS014-SKU-QTY             PIC 9(05).                     00144715
001448     05  WS014-SKU-ADJ-IND         PIC X(01).                     00144815
001449         88  WS014-SKU-ADJ-POS                 VALUE 'A'.         00144915
001450         88  WS014-SKU-ADJ-NEG                 VALUE 'S'.         00145015
001451     05  WS014-ORIG-SHIPMT-NBR     PIC X(20).                     00145115
001452     05  WS014-RCVD-SHPMT-NBR      PIC X(20).                     00145215
001453     05  WS014-CRE-USER-ID         PIC X(08).                     00145315
001454     05  WS014-DC-LOCATION         PIC 9(04).                     00145402
001455     05  WS014-STORE-NUMBER        PIC 9(04).                     00145502
001456     05  WS014-DOOR-ID             PIC X(04).                     00145603
001457     05  WS014-SCAC                PIC X(04).                     00145703
001458     05  WS014-VEHICLE             PIC X(10).                     00145803
001460     05  WS014-CRE-TMST            PIC X(26).                     00146003
001461     05  WS014-SEAL                PIC X(20).                     00146114
001470     05  FILLER                    PIC X(30).                     00147013
