000100************************************************************      00010000
000200* WSRD022                                                  *      00020000
000300************************************************************      00030000
000400*    RECORD PURPOSE: INVENTORY ADJUSTMENT UPLOAD           *      00040000
000600*    RECORD LENGTH:   85 BYTES                             *      00060000
000700*    RECORD FORMAT:  SEQUENTIAL                            *      00070000
000800************************************************************      00080000
000900 01  WS022-INV-ADJ-UPLOAD-RECORD.                                 00090000
001000     05  WS022-LOCATION          PIC 9(04)     VALUE ZEROES.      00100000
001100     05  FILLER                  PIC X(01)     VALUE SPACES.      00110000
001200     05  WS022-BATCH-NBR         PIC 9(07)     VALUE ZEROES.      00120000
001300     05  FILLER                  PIC X(01)     VALUE SPACES.      00130000
001400     05  WS022-ITEM-NBR          PIC X(16)     VALUE SPACES.      00140003
001500     05  FILLER                  PIC X(01)     VALUE SPACES.      00150000
001600     05  WS022-UNIT-QTY-ADJ      PIC X(14)     VALUE SPACES.      00160000
001700*  PIC  S9(8).9(4)                                                00170000
001800     05  FILLER                  PIC X(01)     VALUE SPACES.      00180000
001900     05  WS022-REASON-CDE        PIC X(02)     VALUE SPACES.      00190003
005500     05  FILLER                  PIC X(01)     VALUE SPACES.      00550000
005600     05  WS022-TRAN-TYP          PIC X(03)     VALUE SPACES.      00560003
005610     05  FILLER                  PIC X(01)     VALUE SPACES.      00561003
005620     05  WS022-TRAN-CDE          PIC X(03)     VALUE SPACES.      00562003
005630     05  FILLER                  PIC X(01)     VALUE SPACES.      00563003
005631     05  WS022-ACTN-CDE          PIC X(02)     VALUE SPACES.      00563105
005632     05  FILLER                  PIC X(01)     VALUE SPACES.      00563205
005640     05  WS022-TRAN-NBR          PIC X(10)     VALUE SPACES.      00564007
005650     05  FILLER                  PIC X(01)     VALUE SPACES.      00565003
005660     05  WS022-PIX-SEQ-NBR       PIC X(10)     VALUE SPACES.      00566007
005661     05  FILLER                  PIC X(01)     VALUE SPACES.      00566104
005670     05  WS022-INS-ADAPTER-IND   PIC X(01).                       00567004
005900         88 WS022-FROM-FSHN-ADAPTER      VALUE 'F'.               00590004
006000         88 WS022-FROM-PUTAWAY-ADAPTER   VALUE 'P'.               00600004
006100     05  FILLER                  PIC X(03)     VALUE SPACES.      00610006
