000300******************************************************************00030000
001724* WSRD051                                                        *00172400
001740******************************************************************00174000
001800* LAYOUT FROM BMC UNLOAD - PURGE OF INBOUND REPOSITORY           *00180001
001810* LENGTH -  46                                                   *00181003
001900******************************************************************00190000
001910 01  WS051-INBN-REPOSITORY-RECORD.                                00191001
002200     10 WS051-PRC-GP-ID            PIC  S9(9) COMP.               00220001
002300     10 WS051-PRC-CNTL-TMST        PIC   X(26).                   00230001
002310     10 WS051-TRN-TYP-CDE          PIC   X(8).                    00231001
002400     10 WS051-LOC-NBR              PIC  S9(4) COMP.               00240002
002500     10 WS051-STAT-CDE             PIC   X(6).                    00250001
002900******************************************************************00290000
