000100************************************************************      00010000
000200* WSRD008                                 AS OF 12/12/2006 *      00020000
000300************************************************************      00030000
000400*    RECORD PURPOSE: APPOINTMENT - TRAILER INTO WMOS       *      00040000
000500*    RECORD LENGTH:   300 BYTES                            *      00050004
000600************************************************************      00060000
000700 01  WS008-APPOINTMENT-REC.                                       00070002
000710     05  WS008-AP-DATA.                                           00071004
000800         10  WS008-AP-ACTION-TYPE       PIC X(01) VALUE SPACES.   00080004
000900             88  WS008-AP-ADD                     VALUE 'A'.      00090004
001000             88  WS008-AP-MODIFY                  VALUE 'M'.      00100004
001100             88  WS008-AP-DELETE                  VALUE 'D'.      00110004
001110         10  WS008-AP-RECORD-TYPE      PIC X(02)  VALUE SPACES.   00111004
001120             88  WS008-AP-APPOINTMT               VALUE 'AP'.     00112004
001130         10  WS008-AP-CREATE-USERID    PIC X(08)  VALUE SPACES.   00113004
001140         10  WS008-AP-CREATE-TMST      PIC X(26)  VALUE SPACES.   00114004
001200*                                                                 00120004
001300         10  WS008-AP-SHIPMT-NBR       PIC X(20).                 00130004
001400         10  WS008-AP-WHSE             PIC X(04).                 00140008
001410         10  WS008-AP-EXPCT-STRT-DT-TM PIC X(14).                 00141004
001500         10  WS008-AP-APPT-PRTY        PIC 9(05).                 00150004
001510             88  WS008-AP-NO-PRIORITY             VALUE ZERO.     00151004
001520         10  WS008-AP-SCAC             PIC X(04).                 00152005
001530         10  WS008-AP-TRLR-NBR         PIC X(12).                 00153007
001600         10  WS008-AP-BOL              PIC X(20).                 00160004
001900         10  WS008-AP-PRO-NBR          PIC X(20).                 00190004
001910         10  WS008-AP-STATUS-CODE      PIC 9(02).                 00191004
001920             88  WS008-AP-INS-UPD                 VALUE 0.        00192004
001930             88  WS008-AP-DELETE                  VALUE 99.       00193004
002000         10  WS008-AP-SEAL-NBR         PIC X(20).                 00200008
002290     05  FILLER                        PIC X(142).                00229008
