000100***************************************************************** 00010000
000110*    WSRD028                                                    * 00011000
000120*    RECORD: PIX                    (for PIX conversion)        * 00012000
000130***************************************************************** 00013000
000140*                                                                 00014000
000150 01  PIXBridge.                                                   00015001
000160     05  PIX.                                                     00016001
000170         10  TransactionType                     PIC X(03).       00017001
000171         10  TransactionCode                     PIC X(03).       00017101
000172         10  TransactionNumber                   PIC 9(09).       00017202
000173         10  SequenceNumber                      PIC 9(09).       00017302
000174         10  SKUDefinition.                                       00017402
000175             15  StyleSuffix                     PIC X(08).       00017502
000176         10  PIXFields.                                           00017602
000177             15  DateCreated                     PIC X(20).       00017702
000178             15  CaseNumber                      PIC X(20).       00017802
000179             15  InvAdjustmentQty                PIC 9(13).       00017902
000180             15  InvAdjustmentType               PIC X(01).       00018002
000181             15  Warehouse                       PIC X(12).       00018102
000182             15  DCNumber                        PIC X(04).       00018207
000183             15  As400UserID                     PIC X(15).       00018308
000184             15  TransReasonCode                 PIC X(02).       00018408
000185             15  ReferenceCode1                  PIC X(03).       00018508
000190             15  Reference1                      PIC X(20).       00019001
000191             15  ReferenceCode2                  PIC X(03).       00019101
000192             15  Reference2                      PIC X(20).       00019201
000193             15  ReferenceCode3                  PIC X(03).       00019301
000194             15  Reference3                      PIC X(20).       00019401
000195             15  ReferenceCode4                  PIC X(03).       00019501
000196             15  Reference4                      PIC X(20).       00019601
000197             15  ReferenceCode5                  PIC X(03).       00019701
000198             15  Reference5                      PIC X(20).       00019801
000199             15  ReferenceCode6                  PIC X(03).       00019901
000200             15  ReferenceField6                 PIC X(20).       00020003
000201             15  ReferenceCode7                  PIC X(03).       00020101
000202             15  ReferenceField7                 PIC X(20).       00020203
000203             15  ReferenceCode8                  PIC X(03).       00020301
000204             15  ReferenceField8                 PIC X(20).       00020404
000206             15  ReferenceField9                 PIC X(20).       00020603
000207             15  ReferenceCode9                  PIC X(03).       00020705
000209             15  ReferenceField10                PIC X(20).       00020903
000210             15  ReferenceCode10                 PIC X(03).       00021005
000220             15  ActionCode                      PIC X(02).       00022006
