000100************************************************************      00001000
000110* WSRD057                                                  *      00002000
000120************************************************************      00003000
000130*    RECORD PURPOSE: WMOS ITEM SURCHARGE MISMATCH          *      00004000
000150*    RECORD LENGTH:  100 BYTES                             *      00005000
000160*    RECORD FORMAT:  SEQUENTIAL                            *      00006000
000170*                                                          *      00007000
000171************************************************************      00008000
000172                                                                  00009000
000173 01  WS057-ITEM-SURCHARGE-RECORD.                                 00009100
000175     05  WS057-ITEM-SURCHARGE-MISMATCH.                           00009200
013000         10 WS057-INTR-UPC-ID           PIC S9(09) COMP.          00040000
013000         10 WS057-DEPT                  PIC  9(04).               00041000
013000         10 WS057-SKU-NBR               PIC  9(08).               00041100
013000         10 WS057-SKU-DESC              PIC  X(30).               00042000
013000         10 WS057-SHIP-SRCHG-FEE-AMT    PIC S9(03)V9(02) COMP-3.  00050000
013000         10 WS057-CUBE-SRCHG-FEE-AMT    PIC S9(03)V9(02) COMP-3.  00060000
013000         10 WS057-ITEM-LENGTH           PIC S9(04)V9(03) COMP-3.  00061000
013000         10 WS057-ITEM-WIDTH            PIC S9(04)V9(03) COMP-3.  00062000
013000         10 WS057-ITEM-HEIGHT           PIC S9(04)V9(03) COMP-3.  00063000
013000         10 WS057-ITEM-WEIGHT           PIC S9(05)V9(03) COMP-3.  00064001
013000         10 FILLER                      PIC X(30) VALUE  SPACES.  00070000
