000100************************************************************      00010000
000200* WSRD044                                 AS OF 05/22/2007 *      00020000
000300************************************************************      00030000
000400*    PIX REPOSITORY EXTRACT - INPUT LAYOUT                 *      00040000
000500*    MULTIPLE RECORDS CAN BE READ IN                       *      00050000
000510*    RECORD LENGTH = 80                                    *      00051002
000600************************************************************      00060000
000700 01  WS044-EXTRACT-REC.                                           00070000
000710     05  WS044-FROM-TMST            PIC X(26) VALUE SPACES.       00071000
000711     05  FILLER                     PIC X(01) VALUE SPACE.        00071100
000720     05  WS044-TO-TMST              PIC X(26) VALUE SPACES.       00072000
000721     05  FILLER                     PIC X(01) VALUE SPACE.        00072100
000730     05  WS044-PIX-TYP              PIC X(03) VALUE SPACES.       00073000
000731         88  WS044-ALL-PIX                    VALUE 'ALL'.        00073100
000732     05  FILLER                     PIC X(01) VALUE SPACE.        00073200
000733     05  WS044-PIX-CDE              PIC X(02) VALUE SPACES.       00073300
000734     05  FILLER                     PIC X(01) VALUE SPACE.        00073400
000740     05  WS044-PIX-ACTN-CDE         PIC X(02) VALUE SPACES.       00074000
000750     05  FILLER                     PIC X(01) VALUE SPACES.       00075000
000751     05  WS044-QUEUE                PIC X(10) VALUE SPACES.       00075100
000752     05  FILLER                     PIC X(01) VALUE SPACES.       00075201
000753     05  WS044-DC-NBR               PIC 9(04) VALUE ZEROES.       00075301
