000100******************************************************************00010003
000200*  WSWS004                                                       *00020003
000300*      THIS COPYBOOK IS USED FOR THE MAINTANCE OF THE WMS ASN    *00030003
000400*  DOWNLOAD CONTROL TABLES FROM THE SHIPPING SYSTEM              *00040003
000500*                                             LENGTH=125         *00050008
000600******************************************************************00060003
000700*                                                                 00070003
000800 01  WS004-FIELDS.                                                00080003
000900     05  WS004-FUNCTION-IND              PIC X(1).                00090003
001000         88  WS004-SHIP-TRAILER          VALUE 'S'.               00100003
001100         88  WS004-MANUAL-DOWNLOAD       VALUE 'M'.               00110003
001200     05  WS004-OTBND-TRIP-ID             PIC S9(9) COMP.          00120003
001300     05  WS004-WMS-SHPT-ID               PIC X(20).               00130003
001400     05  WS004-OPER-UNT-ID               PIC S9(4) COMP.          00140003
001500     05  WS004-SHIPMENT-SOURCE           PIC X(02).               00150003
001600         88  WS004-SOURCE-RCVNG          VALUE 'RC'.              00160003
001700         88  WS004-SOURCE-SHIP           VALUE 'SH'.              00170003
001800     05  WS004-USER-ID                   PIC X(08).               00180003
001900     05  WS004-CALLING-PROGRAM-NAME    PIC  X(08).                00190003
002000     05  WS004-SUCCESS-IND             PIC  X(01).                00200003
002100         88  WS004-SUCCESSFUL          VALUES                     00210003
002200                                      ZERO, SPACES, LOW-VALUES.   00220003
002300         88  WS004-ERROR                   VALUE '1'.             00230003
002400         88  WS004-INVALID-SQL             VALUE '2'.             00240003
002500         88  WS004-DATABASE-BUSY           VALUE '3'.             00250003
002600         88  WS004-INVALID-FUNC-IND        VALUE '4'.             00260003
002700     05  WS004-PARAGRAPH-NAME          PIC  X(20).                00270003
002800     05  WS004-CRA-RET-MSG             PIC  X(25).                00280006
002801***                                                               00280107
002810     05  WS004-SRC-TASK-NUMBER         PIC  9(07).                00281007
002820***                                                               00282007
002900     05  FILLER                        PIC  X(27).                00290009
