000100**************************************************************    00010004
000200*  WSWS003                                                   *    00020004
000300*      THIS COPYBOOK IS USED TO CALL THE ASN DOWNLOAD MODULE *    00030004
000500*                                                            *    00050004
000600*    ******      !!!!!     IMPORTANT       !!!!!     ******  *    00060004
000700*                                                            *    00070004
000800*   WHEN THE PROGRAM CHANGES IT MUST BE COMPILED FOR         *    00080004
000900*   BOTH BATCH AND CICS                                      *    00090004
001000*                                                            *    00100004
001100*   TO INVOKE THIS PROGRAM FROM A CICS EXIT YOU MUST USE THIS*    00110004
001200*   FORMAT:                                                  *    00120004
001300*     CALL WS003-WMS-PGM USING DFHEIBLK                      *    00130004
001400*                              WS003-COMMAREA                *    00140004
001500*                              WS003-SHIPT-COMMAREA          *    00150004
001600*   IN BATCH DO THIS:                                        *    00160004
001700*     CALL WS003-WMS-PGM USING WS003-SHIPT-COMMAREA          *    00170004
001800*    ******     !!!!!      IMPORTANT     !!!!!       ******  *    00180004
001900*                                                            *    00190004
002000*                                                            *    00200004
002100*     INITIALIZE WS003-SHIPT-COMMAREA BEFORE CALLING WSKUT301     00210004
002200*                                                            *    00220004
002300*     WS003-TRIP-ID        IS REQUIRED                       *    00230004
002400*     WS003-WM-SHIPT-NBR   IS REQUIRED                       *    00240004
002500*     WS003-APPOINTMENT-SW IS REQUIRED                       *    00250004
002600*                                                            *    00260004
002700*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *    00270004
002800*           DECREMENT THE FILLER NEAR THE END OF THIS        *    00280004
002900*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *    00290004
003000*           AT LENGTH OF 400                                 *    00300006
003100**************************************************************    00310004
003200*                                                                 00320002
003300 01  WS003-SHIPT-COMMAREA.                                        00330004
003400     05  WS003-TRIP-ID                   PIC S9(9) COMP.          00340002
003500     05  WS003-WM-SHIPT-NBR              PIC X(20).               00350002
003600     05  WS003-APPOINTMENT-SW            PIC X(01) VALUE 'Y'.     00360002
003700         88  WS003-APPOINTMENT-YES                 VALUE 'Y'.     00370002
003800         88  WS003-APPOINTMENT-NO                  VALUE 'N'.     00380002
003600     05  WS003-CANCEL-SHPMT-IND        PIC  X(01).                00381015
003700         88  WS003-CANCEL-SHPMT-YES                VALUE 'Y'.     00382016
003800         88  WS003-CANCEL-SHPMT-NO                 VALUE 'N'.     00383016
003900     05  WS003-PARAGRAPH-NAME          PIC  X(20).                00390002
004000     05  WS003-CALLING-PROGRAM-NAME    PIC  X(08).                00400002
004100     05  WS003-SUCCESS-IND             PIC  X(01).                00410002
004200         88  WS003-SUCCESSFUL          VALUES                     00420002
004300                                      ZERO, SPACES, LOW-VALUES.   00430002
004400         88  WS003-ERROR                   VALUE '1'.             00440002
004500         88  WS003-INVALID-SQL             VALUE '2'.             00450002
004600         88  WS003-DATABASE-BUSY           VALUE '3'.             00460002
004610     05  WS003-SQLCODE                 PIC S9(9).                 00461007
004700     05  WS003-SQL-ERROR-PARA          PIC X(20).                 00470009
004800     05  WS003-CRA-RET-MSG             PIC X(25)  VALUE SPACES.   00480009
004920     05  WS003-SQLCA                   PIC X(136).                00492009
004921***                                                               00492112
004930     05  WS003-OPER-UNT-ID             PIC 9(04).                 00493012
004931     05  WS003-USERID                  PIC X(08).                 00493112
004932     05  WS003-SRC-TASK-NUMBER         PIC 9(07).                 00493213
004940***                                                               00494012
004950     05  FILLER                        PIC X(134).                00495014
004960                                                                  00496012
005000 01  WS003-COMMAREA                    PIC X(01).                 00500009
005100 01  WS003-WMS-PGM                     PIC X(08) VALUE 'WSKUT006'.00510010
