000010************************************************************      00001000
000020* COMMUNICATION AREA USED TO PASS CARTON INFORMATION TO    *      00002000
000030* TO THE RECEIVER CREATE PROGRAM                           *      00003000
000031* NEW FIELDS FOR SKU LEVEL RECEIVING CHANGED               *      00003716
000032* WS008-PO-LINE-NBR                                        *      00003816
000033* WS008-ITEM-QTY                                           *      00003916
000034* WS008-CRE-SKU-LVL-PKSL-SW                                *      00004016
000035* 88  WS008-CRE-SKU-LVL-PKSL                               *      00004116
000037* WSWS008              RECORD LENGTH = 500                 *      00004216
000038************************************************************      00004316
000039 01  WS008-COMM-AREA.                                             00004416
000040     05  WS008-SHIPT-UNT-ID            PIC  S9(18)V COMP-3.       00004516
000041     05  WS008-PO-NUMBER               PIC  S9(9) COMP.           00004616
000042     05  WS008-ORIG-REC-SEQ-NBR        PIC  S9(9) COMP.           00004716
000043     05  WS008-NEW-REC-SEQ-NBR         PIC  S9(9) COMP.           00004816
000045     05  WS008-TRIP-ID                 PIC  S9(9) COMP.           00004900
000052     05  WS008-ORIG-PKSL-SEQ-NBR       PIC  S9(4) COMP.           00005200
000053     05  WS008-NEW-PKSL-SEQ-NBR        PIC  S9(4) COMP.           00005300
000054     05  WS008-OPER-UNT-ID             PIC  S9(4) COMP.           00005406
000055     05  WS008-DEST-STR-NBR            PIC  S9(4) COMP.           00005506
000056     05  WS008-SCAC-ID                 PIC  X(4).                 00005608
000060     05  WS008-NEW-SHIP                PIC  S9(9) COMP.           00006008
000061     05  WS008-ORIG-BOL-NBR            PIC  X(16).                00006108
000063     05  WS008-SIGNON-USER-ID          PIC  X(08).                00006309
000064     05  WS008-FUNCTION-SWITCH         PIC  X(1).                 00006409
000066         88  WS008-CREATE-RECEIVER          VALUE '1'.            00006611
000067         88  WS008-CREATE-PKSLIP            VALUE '2'.            00006711
000068         88  WS008-DETACH-ONLY              VALUE '3'.            00006812
000069     05  WS008-CALL-SOURCE-SWITCH      PIC  X(1).                 00006912
000070         88  WS008-SRC-CHECKIN              VALUE '1'.            00007012
000071         88  WS008-SRC-VERIFICATION         VALUE '2'.            00007112
000072     05  WS008-UPDATE-PKSLIP-SW        PIC  X(1).                 00007212
000073         88  WS008-UPDATE-PKSLIP-ONLY       VALUE '1'.            00007312
000074         88  WS008-UPDATE-RCVR-PKSLIP       VALUE '2'.            00007412
000075     05  WS008-PROGRAM-NAME            PIC  X(08).                00007512
000076     05  WS008-SUCCESS-IND             PIC  X(01).                00007612
000077         88  WS008-SUCCESSFUL          VALUES                     00007712
000078                                      ZERO, SPACES, LOW-VALUES.   00007812
000079         88  WS008-ERROR                   VALUE '1'.             00007912
000080         88  WS008-INVALID-SQL             VALUE '2'.             00008012
000081         88  WS008-DATABASE-BUSY           VALUE '3'.             00008112
000082     05  WS008-ORIG-PRO-NBR            PIC  X(22).                00008212
000083     05  WS008-NEW-PRO-NBR             PIC  X(22).                00008312
000084     05  WS008-SQLCA                   PIC  X(136).               00008412
000085     05  WS008-CRA-RET-MSG             PIC  X(133) VALUE SPACES.  00008512
000086     05  WS008-CRA-REQ-ID              PIC  X(08)  VALUE SPACES.  00008612
000087     05  WS008-USER-ID                 PIC  X(08)  VALUE SPACES.  00008712
000088     05  WS008-PO-LINE-NBR             PIC  S9(9) COMP.           00008815
000089     05  WS008-ITEM-QTY                PIC  S9(9) COMP.           00008913
000090     05  WS008-CRE-SKU-LVL-PKSL-SW     PIC  X(1).                 00009013
000091         88  WS008-CRE-SKU-LVL-PKSL         VALUE '1'.            00009113
000090     05  WS008-SKU-LVL-RCVING-SW       PIC  X(1).                 00009220
000091         88  WS008-SKU-LVL-RCVING           VALUE '1'.            00009320
000100     05  WS008-CAN-ORIG                PIC  X(30)  VALUE SPACE.   00010024
000100     05  WS008-CAN-NEW                 PIC  X(30)  VALUE SPACE.   00011024
000100     05  FILLER                        PIC  X(23)  VALUE SPACE.   00020024
