000100******************************************************************00010016
000200*  WSWS001                                                       *00020016
000300*      THIS COPYBOOK IS USED FOR THE MAINTANCE OF THE WMS ASN    *00030016
000400*  DOWNLOAD CONTROL TABLES.                                      *00040016
000500*                                             LENGTH=300         *00050024
000600******************************************************************00060016
000700*                                                                 00070016
000800 01  WS001-FIELDS.                                                00080016
000900     05  WS001-FUNCTION-IND              PIC X(1).                00090016
001000         88  WS001-INSERT                VALUE 'I'.               00100016
001100         88  WS001-PKSLIP-INACTIVE       VALUE 'P'.               00110016
001200         88  WS001-SHIPMT-DETACH         VALUE 'D'.               00120016
001300         88  WS001-MANUAL-DOWNLOAD       VALUE 'M'.               00130016
001300         88  WS001-CREATE-DUMMY          VALUE 'C'.               00131025
001400     05  WS001-TRIP-ID                   PIC S9(9) COMP.          00140016
001500     05  WS001-KOHLS-SHIPT-ID            PIC S9(9) COMP.          00150016
001600     05  WS001-OPER-UNT-ID               PIC S9(4) COMP.          00160016
001700     05  WS001-SHIPMENT-SOURCE           PIC X(02).               00170016
001800         88  WS001-SOURCE-RCVNG          VALUE 'RC'.              00180016
001900         88  WS001-SOURCE-SHIP           VALUE 'SH'.              00190016
002000     05  WS001-USER-ID                   PIC X(08).               00200016
002100     05  WS001-COC-UPD-TIMESTAMP         PIC X(26).               00210016
002200     05  WS001-BEGIN-RCV-IND             PIC X(01).               00220016
002300     05  WS001-PO-NBR                    PIC S9(9) COMP.          00230016
002400     05  WS001-RCVR-NBR                  PIC S9(9) COMP.          00240016
002500     05  WS001-PO-LNE-NBR                PIC S9(9) COMP.          00250016
002600     05  WS001-PREPK-ID                  PIC S9(4) COMP.          00260016
002700     05  WS001-SKU-NBR                   PIC X(08).               00270016
002800     05  WS001-DTL-ASN-LEVEL-IND         PIC X(01).               00280016
002900     05  WS001-CALLING-PROGRAM-NAME    PIC  X(08).                00290016
003000     05  WS001-SUCCESS-IND             PIC  X(01).                00300016
003100         88  WS001-SUCCESSFUL          VALUES                     00310016
003200                                      ZERO, SPACES, LOW-VALUES.   00320016
003300         88  WS001-ERROR                   VALUE '1'.             00330016
003400         88  WS001-INVALID-SQL             VALUE '2'.             00340016
003500         88  WS001-DATABASE-BUSY           VALUE '3'.             00350016
003600         88  WS001-INVALID-FUNC-IND        VALUE '4'.             00360016
003700         88  WS001-UNABLE-TO-DETACH        VALUE '5'.             00370016
003800         88  WS001-NO-WMS-SHIPMENT         VALUE '6'.             00380016
003900     05  WS001-PARAGRAPH-NAME          PIC  X(20).                00390016
004000     05  WS001-CRA-RET-MSG             PIC  X(25).                00400018
004100     05  WS001-SQLCA                   PIC  X(136).               00410019
004110***                                                               00411023
004200     05  WS001-SRC-TASK-NUMBER         PIC  9(07).                00420022
003900     05  WS001-EXT-SHP-ID              PIC  X(20).                00421026
004300     05  FILLER                        PIC  X(12).                00430026
