000100******************************************************************00010000
000200*  WSWS011                                                        00011000
000300*                                                                 00012000
000400*  RECORD LAYOUT FOR THE XREF HDR SELECTION TEMP STORAGE QUEUE.   00013004
000600*                                                                 00015000
000700******************************************************************00016000
000200 01  WS011-SELECT-RECORD.                                         00017000
000300     05  WS011-SELECTED-ITEMS         PIC S9(5) VALUE ZERO        00018000
000400                                                COMP-3.           00019000
000500     05  WS011-MAX-ITEMS              PIC 99    VALUE 20.         00020000
000600     05  WS011-SELECTED-ITEM-ARRAY.                               00030000
000700         10  FILLER                   OCCURS 20 TIMES             00040000
000800                                      INDEXED BY WS011-IDX.       00050002
000900             15  WS011-ITEM           PIC S9(9) COMP-3.           00060009
00010              15  WS011-ACTION-SW      PIC X.                      00070010
00011                  88  WS011-INQ                  VALUE 'I'.        00080010
00012                  88  WS011-UPD                  VALUE 'U'.        00090010
00013                  88  WS011-DEL                  VALUE 'D'.        00100010
00014                  88  WS011-ERR                  VALUE 'E'.        00110010
001600*                                                                 00130000
001500             15  WS011-KEY-DATA.                                  00140010
001700                 20  WS011-EXT-SHP-ID           PIC  X(20).       00330005
001700                 20  WS011-DWNLD-DATE           PIC  X(10).       00370005
001700                 20  WS011-DWNLD-TIME           PIC  X(05).       00380005
004200                                                                  00390000
001500             15  FILLER                         PIC  X(25).       00400013
