000100******************************************************************00010000
000200* WSWS024 - 100 CHAR                                             *00020000
000300*    LAYOUT OF THE TUPLDER RECORDS FOR ERRORS RECEIVED FROM      *00030000
000400*    EFC/LFC CASE RECEIPT PIX WITH BAD PO NUMBER                 *00040000
000600******************************************************************00060000
000700                                                                  00070000
000800 01  WS024-UPLOAD-ERROR-RECORD.                                   00080000
000900     05  WS024-RECORD-TYPE               PIC X(02) VALUE SPACE.   00090000
001000         88  WS024-CASE-RCPT                       VALUE 'CR'.    00100000
001010         88  WS024-PREV-RECV                       VALUE 'PR'.    00101008
001100     05  WS024-ERROR-DATA                PIC X(98).               00110000
001200                                                                  00120000
001300     05  WS024-PIX-CASE-RCPT-REC  REDEFINES WS024-ERROR-DATA.     00130000
001520         10  WS024-STORE-NUMBER          PIC  9(04).              00152000
001600         10  WS024-CASE-NUMBER           PIC  X(20).              00160000
001610         10  WS024-CASE-NUMBER-R REDEFINES WS024-CASE-NUMBER.     00161002
001620             15  FILLER                  PIC  X(02).              00162002
001630             15  WS024-CASE-NUMBER-N     PIC  9(18).              00163003
001700         10  WS024-PO-NUMBER             PIC  9(08).              00170000
001800         10  WS024-REC-SEQ-NUMBER        PIC  9(04).              00180000
001900         10  WS024-PO-LINE-NUMBER        PIC  9(04).              00190000
002000         10  WS024-SKU-NUMBER            PIC  9(08).              00200000
002100         10  WS024-SKU-QTY               PIC  9(05).              00210000
002110         10  WS024-CRE-USER-ID           PIC  X(08).              00211000
002112         10  WS024-NEW-PO-NUMBER         PIC  9(08).              00211200
002114         10  WS024-RCVD-SHPMT-NBR        PIC  X(20).              00211400
002115         10  WS024-NEW-LINE              PIC  9(04).              00211505
002116         10  WS024-NEW-RCVR              PIC  9(04).              00211610
002117         10  FILLER                      PIC  X(01).              00211710
002130                                                                  00213000
