000100************************************************************      00010000
000200* WSWS007                                                  *      00020000
000300************************************************************      00030000
000400*    RECORD PURPOSE: RECEIPT PIX TRANSACTIONS FROM WMOS    *      00040000
000500*    RECORD LENGTH:                                        *      00050000
000600* ***NOTE, IF THIS RECORD LENGTH CHANGES, MUST UPDATE      *      00060000
000700************************************************************      00070000
000800 01  WS007-RECEIPT-PIX-RECORD.                                    00080000
000900     05  WS007-WSRD014-RECORD          PIC X(203).                00090000
001000     05  WS007-CALLING-PROGRAM-NAME    PIC  X(08).                00100000
001100     05  WS007-SUCCESS-IND             PIC  X(01).                00110000
001200         88  WS007-SUCCESSFUL          VALUES                     00120000
001300                                      ZERO, SPACES, LOW-VALUES.   00130000
001400*****    88  WS007-ERROR                   VALUE '1'.             00140000
001500         88  WS007-INVALID-SQL             VALUE '2'.             00150000
001600         88  WS007-DATABASE-BUSY           VALUE '3'.             00160000
001600         88  WS007-ASN-LVL-ERR             VALUE 'E'.             00161001
001600         88  WS007-NO-PURITM               VALUE 'F'.             00162001
001600         88  WS007-VRFD-RCVR-ERR           VALUE 'G'.             00163001
001600         88  WS007-UPD-PKSLIP-ERR          VALUE 'H'.             00164001
001600         88  WS007-RCVR-CRE-ERR            VALUE 'I'.             00165001
001600         88  WS007-NO-USABLE-PO            VALUE 'J'.             00166001
001600         88  WS007-VEM-ERROR               VALUE 'K'.             00167002
001600         88  WS007-INVALID-REC-TYP         VALUE 'L'.             00168002
001600         88  WS007-INVALID-SHPMT-NBR       VALUE 'M'.             00169002
001700     05  WS007-SQLCODE                 PIC S9(9).                 00170000
001800     05  WS007-SQL-ERROR-PARA          PIC X(20).                 00180000
001900     05  WS007-CRA-RET-MSG             PIC X(25)  VALUE SPACES.   00190000
002000     05  WS007-SQLCA                   PIC X(136).                00200000
002100***                                                               00210000
002200     05  WS007-SRC-TASK-NUMBER         PIC  9(07).                00220000
002300     05  FILLER                        PIC  X(91).                00230000
