000100***************************************************************** 00010015
      * COPYBOOK XIRD002      RECORD LENGTH = 48                      * 00020032
000200* THIS IS A COPYBOOK OF GROUP INFORMATION CREATED FROM THE RACF * 00030030
000300* EXTRACTS. THIS GROUP FILE WILL BE USED FOR EAI OF GROUP INFO. * 00040030
000500***************************************************************** 00050015
000600                                                                  00060015
000700 01  XI002-FORMATTED-OUTPUT-RECORD.                               00070032
000800     05  XI002-GROUP-ID                 PIC X(08) VALUE SPACES.   00080032
           05  FILLER                         PIC X(01) VALUE SPACES.   00090031
001100     05  XI002-GROUP-NAME               PIC X(40) VALUE SPACES.   00100032
