000100 IDENTIFICATION DIVISION.                                         00010099
000200 PROGRAM-ID.       XLKRP001.                                      00020099
000300 AUTHOR.           PAUL OMAN.                                     00030099
000400 DATE-WRITTEN.     SEPTEMBER 2003.                                00040099
000500 DATE-COMPILED.                                                   00050099
000600****************************************************************  00060099
000700*     SHOWS COUNTS BY PO FOR EACH OF THE EIGHT RECORD TYPES    *  00070099
000800*                                                              *  00080099
000900*     ALSO SHOWS WHAT COLUMNS THE ERRORS WERE ON IF THEY WERE  *  00090099
001000*     DATA ISSUES.  CREATES REPORT THAT GOES TO RDS SO THE     *  00100099
001100*     CLIENT AREA CAN MONITOR THE ERRORS.                      *  00110099
001200****************************************************************  00120099
001300 ENVIRONMENT DIVISION.                                            00130099
001400 CONFIGURATION SECTION.                                           00140099
001500 SOURCE-COMPUTER.        IBM-3090.                                00150099
001600 OBJECT-COMPUTER.        IBM-3090.                                00160099
001700 INPUT-OUTPUT SECTION.                                            00170099
001800 FILE-CONTROL.                                                    00180099
001900     SELECT FD-COMPARE-FILE-IN   ASSIGN TO COMPAREI.              00190099
002000     SELECT FD-REPORT            ASSIGN TO UT-S-REPORT.           00200099
002010*** PRB0051493 START                                              00201099
002011     SELECT FD-RMSONLY-FILE-IN   ASSIGN TO RMSONLYI.              00201199
002012     SELECT FD-STRTTMST-FILE-IN  ASSIGN TO STRTTMST.              00201299
002013     SELECT FD-ENDTMST-FILE-IN   ASSIGN TO ENDTMST.               00201399
002020*** PRB0051493 END                                                00202099
002100****************************************************************  00210099
002200 DATA DIVISION.                                                   00220099
002300 FILE SECTION.                                                    00230099
002400                                                                  00240099
002500 FD  FD-COMPARE-FILE-IN                                           00250099
002600     LABEL RECORDS ARE STANDARD                                   00260099
002700     RECORDING MODE IS F                                          00270099
002800     BLOCK  CONTAINS 0 RECORDS.                                   00280099
002900 01  COMPARE-IN-RECORD             PIC X(830).                    00290099
003000                                                                  00300099
003001*** PRB0051493 START                                              00300199
003002                                                                  00300299
003010 FD  FD-RMSONLY-FILE-IN                                           00301099
003020     LABEL RECORDS ARE STANDARD                                   00302099
003030     RECORDING MODE IS F                                          00303099
003040     BLOCK  CONTAINS 0 RECORDS.                                   00304099
003050 01  RMSONLY-IN-RECORD             PIC X(482).                    00305099
003060                                                                  00306099
003070 FD  FD-STRTTMST-FILE-IN                                          00307099
003080     LABEL RECORDS ARE STANDARD                                   00308099
003090     RECORDING MODE IS F                                          00309099
003091     BLOCK  CONTAINS 0 RECORDS.                                   00309199
003092 01  STRTTMST-IN-RECORD            PIC X(50).                     00309299
003093                                                                  00309399
003094 FD  FD-ENDTMST-FILE-IN                                           00309499
003095     LABEL RECORDS ARE STANDARD                                   00309599
003096     RECORDING MODE IS F                                          00309699
003097     BLOCK  CONTAINS 0 RECORDS.                                   00309799
003098 01  ENDTMST-IN-RECORD             PIC X(50).                     00309899
003099                                                                  00309999
003100*** PRB0051493 END                                                00310099
003101                                                                  00310199
003110 FD  FD-REPORT                                                    00311099
003200     LABEL RECORDS ARE STANDARD                                   00320099
003300     RECORDING MODE IS F                                          00330099
003400     BLOCK  CONTAINS 0 RECORDS.                                   00340099
003500 01  REPORT-RECORD                 PIC X(132).                    00350099
003600                                                                  00360099
003700****************************************************************  00370099
003800 WORKING-STORAGE SECTION.                                         00380099
003900                                                                  00390099
004000 01  WS-REPORT-RECORD              PIC X(132) VALUE SPACES.       00400099
004100                                                                  00410099
004200 01  WS-XLRD023-RECORD.                                           00420099
004300     COPY XLRD023.                                                00430099
004400                                                                  00440099
004410*** PRB0051493 START                                              00441099
004420     COPY XLRD014.                                                00442099
004430     COPY XLRD063.                                                00443099
004440                                                                  00444099
004441*** PRB0051493 END                                                00444199
004450                                                                  00445099
004500 01  WS-COMPARE-RECORD.                                           00450099
004600     05  WS-COMPARE-RECORD-TYPE    PIC X(01) VALUE SPACES.        00460099
004700     05  WS-COMPARE-PO-NUMBER      PIC X(08) VALUE SPACES.        00470099
004800     05  WS-COMPARE-SORT-KEY       PIC X(20) VALUE SPACES.        00480099
004900     05  WS-COMPARE-INDICATOR      PIC X(01) VALUE SPACES.        00490099
005000     05  WS-FILLER                 PIC X(800) VALUE SPACES.       00500099
005100                                                                  00510099
005200 01  WS-CURRENT-DATETIME.                                         00520099
005300     05  WS-CURRENT-DATE              PIC  X(08)  VALUE SPACES.   00530099
005400     05  FILLER REDEFINES WS-CURRENT-DATE.                        00540099
005500         10 WS-CURRENT-DATE-CCYY      PIC  X(04).                 00550099
005600         10 WS-CURRENT-DATE-MM        PIC  X(02).                 00560099
005700         10 WS-CURRENT-DATE-DD        PIC  X(02).                 00570099
005800     05  WS-CURRENT-TIME              PIC  X(06)  VALUE SPACES.   00580099
005900     05  FILLER REDEFINES WS-CURRENT-TIME.                        00590099
006000         10 WS-CURRENT-TIME-HH        PIC  X(02).                 00600099
006100         10 WS-CURRENT-TIME-MM        PIC  X(02).                 00610099
006200         10 WS-CURRENT-TIME-SS        PIC  X(02).                 00620099
006300                                                                  00630099
006400 01  WORK-FIELDS-CHARACTER.                                       00640099
006500     05  WS-YES                    PIC X    VALUE 'Y'.            00650099
006600     05  WS-NO                     PIC X    VALUE 'N'.            00660099
006700     05  FIRST-TIME                PIC X    VALUE 'Y'.            00670099
006800     05  ASTERISK-LINE.                                           00680099
006900         10 FILLER                 PIC X(1)  VALUE ' '.           00690099
007000         10 FILLER                 PIC X(40) VALUE ALL '*'.       00700099
007100     05  END-OF-COMPARE-RECORDS    PIC X    VALUE 'N'.            00710099
007200     05  WORK-PARAGRAPH            PIC X(30) VALUE SPACES.        00720099
007300     05  WS-BLANK-03               PIC X(03) VALUE SPACES.        00730099
007400     05  WS-BLANK-05               PIC X(05) VALUE SPACES.        00740099
007500     05  WS-BLANK-10               PIC X(10) VALUE SPACES.        00750099
007600     05  WS-BLANK-15               PIC X(15) VALUE SPACES.        00760099
007700     05  WS-BLANK-20               PIC X(20) VALUE SPACES.        00770099
007800     05  WS-BLANK-25               PIC X(25) VALUE SPACES.        00780099
007900     05  WS-BLANK-30               PIC X(30) VALUE SPACES.        00790099
008000     05  WS-BLANK-35               PIC X(35) VALUE SPACES.        00800099
008100     05  WS-BLANK-40               PIC X(40) VALUE SPACES.        00810099
008200     05  WS-BLANK-45               PIC X(45) VALUE SPACES.        00820099
008300     05  WS-BLANK-50               PIC X(50) VALUE SPACES.        00830099
008400     05  WS-BLANK-55               PIC X(55) VALUE SPACES.        00840099
008500     05  WS-BLANK-60               PIC X(60) VALUE SPACES.        00850099
008600     05  WS-BLANK-65               PIC X(65) VALUE SPACES.        00860099
008700     05  WS-BLANK-70               PIC X(70) VALUE SPACES.        00870099
008800                                                                  00880099
008900 01  PV-COUNTERS.                                                 00890099
009000     05  PV-NUMBER-LINES           PIC S9(7) VALUE 99.            00900099
009100     05  PV-LINE-ADVANCE-COUNT     PIC S9(7) VALUE 0.             00910099
009200     05  PV-LINE-COUNT             PIC S9(7) VALUE 0.             00920099
009300     05  PV-LINE-COUNT-LIMIT       PIC S9(7) VALUE 5.             00930099
009400     05  PV-SQLCODE                PIC S9(7) VALUE 0.             00940099
009500     05  PV-PAGE-NUMBER            PIC S9(7) VALUE 0.             00950099
009600     05  PC-MAX-LINES              PIC S9(7) VALUE 64.            00960099
009700     05  PC-PGM-NAME               PIC X(08) VALUE 'XLKRP001'.    00970099
009701*** PRB0051493 START                                              00970199
      *CHG0112236 - START                                               00970299
009710     05  PC-MAX-IDX                PIC 9(09) VALUE 15000.         00971099
      *CHG0112236 - END                                                 00971199
009720*** PRB0051493 START                                              00972099
009800     05  PV-FIELD-NAME             PIC X(19) VALUE SPACES.        00980099
009900     05  PV-RMS-VALUE              PIC X(20) VALUE SPACES.        00990099
010000     05  PV-RMS-VALUE-REDEF1 REDEFINES PV-RMS-VALUE.              01000099
010100         10  FILLER                PIC X(05).                     01010099
010200         10  PV-RMS-VALUE-PIC9     PIC Z(10)99999.                01020099
010300     05  PV-RMS-VALUE-REDEF2 REDEFINES PV-RMS-VALUE.              01030099
010400         10  PV-RMS-VALUE-PIC9V9   PIC Z(12)999.9(4).             01040099
010500     05  PV-LEGACY-VALUE           PIC X(20) VALUE SPACES.        01050099
010600     05  PV-LEGACY-VALUE-REDEF REDEFINES PV-LEGACY-VALUE.         01060099
010700         10  FILLER                PIC X(05).                     01070099
010800         10  PV-LEGACY-VALUE-PIC9  PIC Z(10)99999.                01080099
010900     05  PV-LEGCACY-VALUE-REDEF2 REDEFINES PV-LEGACY-VALUE.       01090099
011000         10  PV-LEGACY-VALUE-PIC9V9   PIC Z(12)999.9(4).          01100099
011100                                                                  01110099
011200 01  WORK-SWITCHES.                                               01120099
011300     05  PS-EXCEEDED-LIMIT-SW      PIC X(01) VALUE SPACES.        01130099
011400         88  PS-EXCEEDED-LIMIT               VALUE 'Y'.           01140099
011500         88  PS-DIDNT-EXCEED-LIMIT           VALUE 'N'.           01150099
011600     05  PS-NEW-PAGE-SW            PIC X(01) VALUE SPACES.        01160099
011700         88  PS-NEW-PAGE                     VALUE 'Y'.           01170099
011800         88  PS-NO-NEW-PAGE                  VALUE 'N'.           01180099
011900     05  PS-PO-SW                  PIC X(01) VALUE SPACES.        01190099
012000         88  PS-NEW-PO                       VALUE 'Y'.           01200099
012100         88  PS-NOT-NEW-PO                   VALUE 'N'.           01210099
012200     05  PS-PRINT-PARAGRAPH-SW     PIC X(01) VALUE SPACES.        01220099
012300         88  PS-PRINT-PARAGRAPH              VALUE 'Y'.           01230099
012400         88  PS-DONT-PRINT-PARAGRAPH         VALUE 'N'.           01240099
012500     05  PS-PRT-PO-SW              PIC X(01) VALUE SPACES.        01250099
012600         88  PS-PRT-PO-YES                   VALUE 'Y'.           01260099
012700         88  PS-PRT-PO-NO                    VALUE 'N'.           01270099
012710     05  PS-END-OF-RMSONLY-FILE-SW PIC X(01) VALUE SPACES.        01271099
012720         88  PS-END-OF-RMSONLY-FILE          VALUE 'Y'.           01272099
012730         88  PS-NOT-END-OF-RMSONLY-FILE      VALUE 'N'.           01273099
012800                                                                  01280099
012900     05  ABEND                     PIC X(8)  VALUE 'ABEND'.       01290099
013000     05  ABEND-MESSAGE             PIC X(80) VALUE SPACES.        01300099
013010*** PRB0051093 START                                              01301099
013020     05  ABEND-CODE                PIC S9(04) VALUE +0            01302099
013030                                              COMP SYNC.          01303099
013100*** PRB0051493 END                                                01310099
013200                                                                  01320099
013300 01  WORK-FIELDS-PIC9.                                            01330099
013400     05  X                         PIC 99   VALUE  0.             01340099
013500     05  Y                         PIC 99   VALUE  0.             01350099
013600     05  WS-RETURN-CODE            PIC 9(8) VALUE  0.             01360099
013700     05  CURRENT-PO-NO             PIC 9(8) VALUE  0.             01370099
013800     05  CURRENT-PO-NO-COMP        PIC S9(9) VALUE  0 COMP.       01380099
013900     05  PV-PREVIOUS-PO-NO         PIC 9(8) VALUE  0.             01390099
014000     05  PREVIOUS-PO-NO            PIC 9(8) VALUE  0.             01400099
014100     05  PREVIOUS-TEMPLATE-IND     PIC X(01) VALUE SPACES.        01410099
014200     05  PREVIOUS-COMPARE-IND      PIC X(01) VALUE SPACES.        01420099
014300     05  PV-SKU-NBR                PIC X(8) VALUE  SPACES.        01430099
014400     05  PV-SKU-NBR-PIC9 REDEFINES PV-SKU-NBR                     01440099
014500                                   PIC Z(8).                      01450099
014600     05  PV-PREVIOUS-SKU           PIC X(8) VALUE  SPACES.        01460099
014700     05  SAVE-PO-NBR               PIC X(08) VALUE SPACES.        01470099
014800     05  SAVE-PKG-CD               PIC X(02) VALUE SPACES.        01480099
014900     05  SAVE-EDI-XMIT             PIC X(16) VALUE SPACES.        01490099
015000     05  SAVE-EDI-IND              PIC X(01) VALUE SPACES.        01500099
015100     05  SAVE-STATUS-CODE          PIC X(02) VALUE SPACES.        01510099
015200                                                                  01520099
015300 01  WORK-FIELDS-COMP-3              COMP-3.                      01530099
015400     05  TTL-OF-INPUT-RECORDS        PIC S9(7)  VALUE  0.         01540099
015500     05  NUMBER-OTHER-STMTS          PIC S9(7)  VALUE  0.         01550099
015600     05  NUMBER-OF-COMPARE-RECORDS   PIC S9(7)  VALUE  0.         01560099
015700     05  NUMBER-OF-OUTPUT-RECORDS    PIC S9(7)  VALUE  0.         01570099
015800                                                                  01580099
015900 01  PO-COUNT-FIELDS.                                             01590099
016000     05  NUMBER-XXT-PO               PIC  9(5)  VALUE  0.         01600099
016100     05  NUMBER-XXT-PO-INSTR         PIC  9(5)  VALUE  0.         01610099
016200     05  NUMBER-XXT-PO-DISC          PIC  9(5)  VALUE  0.         01620099
016300     05  NUMBER-XXT-PO-SKU           PIC  9(5)  VALUE  0.         01630099
016400     05  NUMBER-XXT-PO-PK-SKU        PIC  9(5)  VALUE  0.         01640099
016500     05  NUMBER-XXT-PO-PK-SKU-LOC    PIC  9(5)  VALUE  0.         01650099
016600     05  NUMBER-XXT-PO-INBD-ALLOC    PIC  9(5)  VALUE  0.         01660099
016700     05  NUMBER-XXT-PO-OUTBND-ALLOC  PIC  9(5)  VALUE  0.         01670099
016800     05  NUMBER-PO-HDR-RMS           PIC  9(5)  VALUE  0.         01680099
016900     05  NUMBER-PO-HDR-LGCY          PIC  9(5)  VALUE  0.         01690099
017000     05  NUMBER-PO-HDR-DATA          PIC  9(5)  VALUE  0.         01700099
017100     05  NUMBER-PO-INSTR-RMS         PIC  9(5)  VALUE  0.         01710099
017200     05  NUMBER-PO-INSTR-LGCY        PIC  9(5)  VALUE  0.         01720099
017300     05  NUMBER-PO-INSTR-DATA        PIC  9(5)  VALUE  0.         01730099
017400     05  NUMBER-PO-DISC-RMS          PIC  9(5)  VALUE  0.         01740099
017500     05  NUMBER-PO-DISC-LGCY         PIC  9(5)  VALUE  0.         01750099
017600     05  NUMBER-PO-DISC-DATA         PIC  9(5)  VALUE  0.         01760099
017700     05  NUMBER-PO-SKU-RMS           PIC  9(5)  VALUE  0.         01770099
017800     05  NUMBER-PO-SKU-LGCY          PIC  9(5)  VALUE  0.         01780099
017900     05  NUMBER-PO-SKU-DATA          PIC  9(5)  VALUE  0.         01790099
018000     05  NUMBER-PO-PK-SKU-RMS        PIC  9(5)  VALUE  0.         01800099
018100     05  NUMBER-PO-PK-SKU-LGCY       PIC  9(5)  VALUE  0.         01810099
018200     05  NUMBER-PO-PK-SKU-DATA       PIC  9(5)  VALUE  0.         01820099
018300     05  NUMBER-PO-PK-SKU-LOC-RMS    PIC  9(5)  VALUE  0.         01830099
018400     05  NUMBER-PO-PK-SKU-LOC-LGCY   PIC  9(5)  VALUE  0.         01840099
018500     05  NUMBER-PO-PK-SKU-LOC-DATA   PIC  9(5)  VALUE  0.         01850099
018600     05  NUMBER-PO-INBD-ALLOC-RMS    PIC  9(5)  VALUE  0.         01860099
018700     05  NUMBER-PO-INBD-ALLOC-LGCY   PIC  9(5)  VALUE  0.         01870099
018800     05  NUMBER-PO-INBD-ALLOC-DATA   PIC  9(5)  VALUE  0.         01880099
018900     05  NUMBER-PO-OUTBND-ALLOC-RMS  PIC  9(5)  VALUE  0.         01890099
019000     05  NUMBER-PO-OUTBND-ALLOC-LGCY PIC  9(5)  VALUE 0.          01900099
019100     05  NUMBER-PO-OUTBND-ALLOC-DATA PIC  9(5)  VALUE  0.         01910099
019200                                                                  01920099
019300     05  PO-NBR-DIFF                 PIC  9(5) VALUE 0.           01930099
019400     05  DEPT-NBR-DIFF               PIC  9(5) VALUE 0.           01940099
019500     05  BYR-NBR-DIFF                PIC  9(5) VALUE 0.           01950099
019600     05  ENT-ID-DIFF                 PIC  9(5) VALUE 0.           01960099
019700     05  AGNT-ENT-ID-DIFF            PIC  9(5) VALUE 0.           01970099
019800     05  CRE-DTE-DIFF                PIC  9(5) VALUE 0.           01980099
019900     05  NOT-BEF-DTE-DIFF            PIC  9(5) VALUE 0.           01990099
020000     05  NOT-AFT-DTE-DIFF            PIC  9(5) VALUE 0.           02000099
020100     05  OTB-EOW-DTE-DIFF            PIC  9(5) VALUE 0.           02010099
020200     05  CLOSE-DTE-DIFF              PIC  9(5) VALUE 0.           02020099
020300     05  PAYT-TERM-ID-DIFF           PIC  9(5) VALUE 0.           02030099
020400     05  FRGT-TERM-ID-DIFF           PIC  9(5) VALUE 0.           02040099
020500     05  STAT-CDE-DIFF               PIC  9(5) VALUE 0.           02050099
020600     05  ORIG-PO-APVL-DTE-DIFF       PIC  9(5) VALUE 0.           02060099
020700     05  ORIG-APP-BY-USR-ID-DIFF     PIC  9(5) VALUE 0.           02070099
020800     05  EDI-SNT-IND-DIFF            PIC  9(5) VALUE 0.           02080099
020900     05  EDI-PO-IND-DIFF             PIC  9(5) VALUE 0.           02090099
021000     05  IMPRT-PO-IND-DIFF           PIC  9(5) VALUE 0.           02100099
021100     05  FCTRY-NM-DIFF               PIC  9(5) VALUE 0.           02110099
021200     05  POE-CDE-DIFF                PIC  9(5) VALUE 0.           02120099
021300     05  FOB-CDE-DIFF                PIC  9(5) VALUE 0.           02130099
021400     05  PO-TYP-CDE-DIFF             PIC  9(5) VALUE 0.           02140099
021500     05  PK-BY-STR-IND-DIFF          PIC  9(5) VALUE 0.           02150099
021600     05  CONSLR-ACTL-DTE-DIFF        PIC  9(5) VALUE 0.           02160099
021700     05  CONSLR-REQR-DTE-DIFF        PIC  9(5) VALUE 0.           02170099
021800     05  CONSLR-RLSE-CDE-DIFF        PIC  9(5) VALUE 0.           02180099
021900     05  TKT-MKR-ACTL-DTE-DIFF       PIC  9(5) VALUE 0.           02190099
022000     05  TKT-MKR-REQR-DTE-DIFF       PIC  9(5) VALUE 0.           02200099
022100     05  TKT-MKR-RLSE-CDE-DIFF       PIC  9(5) VALUE 0.           02210099
022200     05  RLSE-DTE-DIFF               PIC  9(5) VALUE 0.           02220099
022300     05  FRST-FCTRY-DTE-DIFF         PIC  9(5) VALUE 0.           02230099
022400     05  LAST-FCTRY-DTE-DIFF         PIC  9(5) VALUE 0.           02240099
022500     05  DIR-STR-IND-DIFF            PIC  9(5) VALUE 0.           02250099
022600     05  EXTD-NOT-AFT-DTE-DIFF       PIC  9(5) VALUE 0.           02260099
022700     05  HNG-IND-DIFF                PIC  9(5) VALUE 0.           02270099
022800     05  NW-STR-ORD-IND-DIFF         PIC  9(5) VALUE 0.           02280099
022900     05  PKGNG-CDE-DIFF              PIC  9(5) VALUE 0.           02290099
023000     05  PKGNG-DESC-DIFF             PIC  9(5) VALUE 0.           02300099
023100     05  PTKT-LDTM-DAYS-QTY-DIFF     PIC  9(5) VALUE 0.           02310099
023200     05  SEASET-SHRT-DESC-DIFF       PIC  9(5) VALUE 0.           02320099
023300     05  SEASET-YR-DIFF              PIC  9(5) VALUE 0.           02330099
023400     05  CRE-BY-USR-ID-DIFF          PIC  9(5) VALUE 0.           02340099
023500     05  PTKT-IND-DIFF               PIC  9(5) VALUE 0.           02350099
023600     05  C-O-PROD-CDE-DIFF           PIC  9(5) VALUE 0.           02360099
023700     05  AGNT-OFC-CNTRY-CDE-DIFF     PIC  9(5) VALUE 0.           02370099
023800     05  UNT-PER-CBMT-QTY-DIFF       PIC  9(5) VALUE 0.           02380099
023900     05  QTA-CTG-CDE-DIFF            PIC  9(5) VALUE 0.           02390099
024000     05  IMPRT-VND-ID-DIFF           PIC  9(5) VALUE 0.           02400099
024100     05  IMPRT-FCTRY-ID-DIFF         PIC  9(5) VALUE 0.           02410099
024200     05  IMPRT-VND-NM-DIFF           PIC  9(5) VALUE 0.           02420099
024300     05  IMPRT-FCTRY-NM-DIFF         PIC  9(5) VALUE 0.           02430099
024301     05  DERVD-LBL-TYP-CDE-DIFF      PIC  9(5) VALUE 0.           02430199
024302     05  DELY-ID-DIFF                PIC  9(5) VALUE 0.           02430299
024303     05  PO-SHRT-CYC-IND-DIFF        PIC  9(5) VALUE 0.           02430399
024304                                                                  02430499
024305     05  IN-PO-NBR-DIFF              PIC  9(5)  VALUE  0.         02430599
024306     05  IN-RECIP-CDE-DIFF           PIC  9(5)  VALUE  0.         02430699
024307     05  IN-INSTR-DESC-DIFF          PIC  9(5)  VALUE  0.         02430799
024308                                                                  02430899
024309     05  DI-PO-NBR-DIFF              PIC  9(5)  VALUE  0.         02430999
024310     05  DI-DL-ID-DIFF               PIC  9(5)  VALUE  0.         02431099
024320     05  DI-DL-DTL-ID-DIFF           PIC  9(5)  VALUE  0.         02432099
024330     05  DI-DISC-TYPE-CDE-DIFF       PIC  9(5)  VALUE  0.         02433099
024340     05  DI-EXTD-DAYS-QTY-DIFF       PIC  9(5)  VALUE  0.         02434099
024350     05  DI-DISC-PCT-DIFF            PIC  9(5)  VALUE  0.         02435099
024360     05  DI-TOT-DISC-AMT-DIFF        PIC  9(5)  VALUE  0.         02436099
024370                                                                  02437099
024380     05  SK-PO-NBR-DIFF              PIC  9(5)  VALUE  0.         02438099
024390     05  SK-SKU-NBR-DIFF             PIC  9(5)  VALUE  0.         02439099
024400     05  SK-UNT-COST-AMT-DIFF        PIC  9(5)  VALUE  0.         02440099
024500     05  SK-FRST-COST-AMT-DIFF       PIC  9(5)  VALUE  0.         02450099
024600     05  SK-VND-QTY-DIFF             PIC  9(5)  VALUE  0.         02460099
024700     05  SK-INPK-QTY-DIFF            PIC  9(5)  VALUE  0.         02470099
024710     05  SK-OTPK-QTY-DIFF            PIC  9(5)  VALUE  0.         02471099
024800     05  SK-PROMO-STRT-DTE-DIFF      PIC  9(5)  VALUE  0.         02480099
024900     05  SK-PIC-SKU-IND-DIFF         PIC  9(5)  VALUE  0.         02490099
025000     05  SK-ORIG-ORD-QTY-DIFF        PIC  9(5)  VALUE  0.         02500099
025100     05  SK-ORD-QTY-DIFF             PIC  9(5)  VALUE  0.         02510099
025200     05  SK-CNCLD-QTY-DIFF           PIC  9(5)  VALUE  0.         02520099
025300     05  SK-PK-SKU-IND-DIFF          PIC  9(5)  VALUE  0.         02530099
025400     05  SK-PK-SKU-DESC-DIFF         PIC  9(5)  VALUE  0.         02540099
025500     05  SK-DC-ORD-MULT-QTY-DIFF     PIC  9(5)  VALUE  0.         02550099
025600                                                                  02560099
025700     05  LO-PO-NBR-DIFF              PIC  9(5)  VALUE  0.         02570099
025800     05  LO-SKU-NBR-DIFF             PIC  9(5)  VALUE  0.         02580099
025900     05  LO-LOC-NBR-DIFF             PIC  9(5)  VALUE  0.         02590099
026000     05  LO-LOC-TYP-CDE-DIFF         PIC  9(5)  VALUE  0.         02600099
026100     05  SK-UNT-RTL-AMT-DIFF         PIC  9(5)  VALUE  0.         02610099
026200     05  SK-GP-RTL-AMT-DIFF          PIC  9(5)  VALUE  0.         02620099
026300     05  SK-GP-RTL-QTY-DIFF          PIC  9(5)  VALUE  0.         02630099
026400     05  LO-ORD-QTY-DIFF             PIC  9(5)  VALUE  0.         02640099
026500     05  LO-ORIG-ORD-QTY-DIFF        PIC  9(5)  VALUE  0.         02650099
026600     05  LO-CNCLD-QTY-DIFF           PIC  9(5)  VALUE  0.         02660099
026700     05  LO-CNCL-CDE-DIFF            PIC  9(5)  VALUE  0.         02670099
026800     05  LO-CNCL-DTE-DIFF            PIC  9(5)  VALUE  0.         02680099
026900     05  LO-CNCLD-BY-USR-ID-DIFF     PIC  9(5)  VALUE  0.         02690099
027000     05  LO-DC-ALLC-MULT-QTY-DIFF    PIC  9(5)  VALUE  0.         02700099
027100     05  LO-STR-ALLC-MLT-QTY-DIFF    PIC  9(5)  VALUE  0.         02710099
027200     05  LO-ALLOC-RND-CDE-DIFF       PIC  9(5)  VALUE  0.         02720099
027300     05  LO-SHTG-PRT-OPT-CDE-DIFF    PIC  9(5)  VALUE  0.         02730099
027400     05  LO-OVRG-PRT-OPT-CDE-DIFF    PIC  9(5)  VALUE  0.         02740099
027500     05  LO-EXT-SHTG-THR-IND-DIFF    PIC  9(5)  VALUE  0.         02750099
027600                                                                  02760099
027700     05  SB-PO-NBR-DIFF              PIC  9(5)  VALUE  0.         02770099
027800     05  SB-SKU-NBR-DIFF             PIC  9(5)  VALUE  0.         02780099
027900     05  SB-LOC-NBR-DIFF             PIC  9(5)  VALUE  0.         02790099
028000     05  SB-STR-NBR-DIFF             PIC  9(5)  VALUE  0.         02800099
028100     05  SB-RNK-SEQ-NBR-DIFF         PIC  9(5)  VALUE  0.         02810099
028200     05  SB-ALLOC-QTY-DIFF           PIC  9(5)  VALUE  0.         02820099
028300     05  SB-ALLOC-SEQ-CDE-DIFF       PIC  9(5)  VALUE  0.         02830099
028400     05  SB-STR-CNSTR-CDE-DIFF       PIC  9(5)  VALUE  0.         02840099
028500     05  SB-STR-CNSTR-QTY-DIFF       PIC  9(5)  VALUE  0.         02850099
028600                                                                  02860099
028700     05  PB-PO-NBR-DIFF              PIC  9(5)  VALUE  0.         02870099
028800     05  PB-PK-SKU-NBR-DIFF          PIC  9(5)  VALUE  0.         02880099
028900     05  PB-SKU-NBR-DIFF             PIC  9(5)  VALUE  0.         02890099
029000     05  PB-UNT-COST-AMT-DIFF        PIC  9(5)  VALUE  0.         02900099
029100     05  PB-FRST-COST-AMT-DIFF       PIC  9(5)  VALUE  0.         02910099
029200     05  PB-RATO-UNT-QTY-DIFF        PIC  9(5)  VALUE  0.         02920099
029210     05  PB-INPK-UNT-QTY-DIFF        PIC  9(5)  VALUE  0.         02921099
029220     05  PB-OTPK-UNT-QTY-DIFF        PIC  9(5)  VALUE  0.         02922099
029300                                                                  02930099
029400     05  PL-PO-NBR-DIFF              PIC  9(5)  VALUE  0.         02940099
029500     05  PL-SKU-NBR-DIFF             PIC  9(5)  VALUE  0.         02950099
029600     05  PL-PK-SKU-NBR-DIFF          PIC  9(5)  VALUE  0.         02960099
029700     05  PL-LOC-NBR-DIFF             PIC  9(5)  VALUE  0.         02970099
029800     05  PB-UNT-RTL-AMT-DIFF         PIC  9(5)  VALUE  0.         02980099
029900     05  PB-GP-RTL-AMT-DIFF          PIC  9(5)  VALUE  0.         02990099
030000     05  PB-GP-RTL-QTY-DIFF          PIC  9(5)  VALUE  0.         03000099
030100                                                                  03010099
030200 01  WORK-FIELDS-TOTAL               COMP-3.                      03020099
030300     05  TTL-XXT-PO                  PIC S9(5)  VALUE  0.         03030099
030400     05  TTL-XXT-PO-INSTR            PIC S9(5)  VALUE  0.         03040099
030500     05  TTL-XXT-PO-DISC             PIC S9(5)  VALUE  0.         03050099
030600     05  TTL-XXT-PO-SKU              PIC S9(5)  VALUE  0.         03060099
030700     05  TTL-XXT-PO-PK-SKU           PIC S9(5)  VALUE  0.         03070099
030800     05  TTL-XXT-PO-PK-SKU-LOC       PIC S9(5)  VALUE  0.         03080099
030900     05  TTL-XXT-PO-INBD-ALLOC       PIC S9(5)  VALUE  0.         03090099
031000     05  TTL-XXT-PO-OUTBND-ALLOC     PIC S9(5)  VALUE  0.         03100099
031100     05  TTL-PO-HDR-RMS              PIC S9(5)  VALUE  0.         03110099
031200     05  TTL-PO-HDR-LGCY             PIC S9(5)  VALUE  0.         03120099
031300     05  TTL-PO-HDR-DATA             PIC S9(5)  VALUE  0.         03130099
031400     05  TTL-PO-INSTR-RMS            PIC S9(5)  VALUE  0.         03140099
031500     05  TTL-PO-INSTR-LGCY           PIC S9(5)  VALUE  0.         03150099
031600     05  TTL-PO-INSTR-DATA           PIC S9(5)  VALUE  0.         03160099
031700     05  TTL-PO-DISC-RMS             PIC S9(5)  VALUE  0.         03170099
031800     05  TTL-PO-DISC-LGCY            PIC S9(5)  VALUE  0.         03180099
031900     05  TTL-PO-DISC-DATA            PIC S9(5)  VALUE  0.         03190099
032000     05  TTL-PO-SKU-RMS              PIC S9(5)  VALUE  0.         03200099
032100     05  TTL-PO-SKU-LGCY             PIC S9(5)  VALUE  0.         03210099
032200     05  TTL-PO-SKU-DATA             PIC S9(5)  VALUE  0.         03220099
032300     05  TTL-PO-PK-SKU-RMS           PIC S9(5)  VALUE  0.         03230099
032400     05  TTL-PO-PK-SKU-LGCY          PIC S9(5)  VALUE  0.         03240099
032500     05  TTL-PO-PK-SKU-DATA          PIC S9(5)  VALUE  0.         03250099
032600     05  TTL-PO-PK-SKU-LOC-RMS       PIC S9(5)  VALUE  0.         03260099
032700     05  TTL-PO-PK-SKU-LOC-LGCY      PIC S9(5)  VALUE  0.         03270099
032800     05  TTL-PO-PK-SKU-LOC-DATA      PIC S9(5)  VALUE  0.         03280099
032900     05  TTL-PO-INBD-ALLOC-RMS       PIC S9(5)  VALUE  0.         03290099
033000     05  TTL-PO-INBD-ALLOC-LGCY      PIC S9(5)  VALUE  0.         03300099
033100     05  TTL-PO-INBD-ALLOC-DATA      PIC S9(5)  VALUE  0.         03310099
033200     05  TTL-PO-OUTBND-ALLOC-RMS     PIC S9(5)  VALUE  0.         03320099
033300     05  TTL-PO-OUTBND-ALLOC-LGCY    PIC S9(5)  VALUE  0.         03330099
033400     05  TTL-PO-OUTBND-ALLOC-DATA    PIC S9(5)  VALUE  0.         03340099
033500                                                                  03350099
033600     05  TTL-PO-NBR-DIFF             PIC S9(5) VALUE 0.           03360099
033700     05  TTL-DEPT-NBR-DIFF           PIC S9(5) VALUE 0.           03370099
033800     05  TTL-BYR-NBR-DIFF            PIC S9(5) VALUE 0.           03380099
033900     05  TTL-ENT-ID-DIFF             PIC S9(5) VALUE 0.           03390099
034000     05  TTL-AGNT-ENT-ID-DIFF        PIC S9(5) VALUE 0.           03400099
034100     05  TTL-CRE-DTE-DIFF            PIC S9(5) VALUE 0.           03410099
034200     05  TTL-NOT-BEF-DTE-DIFF        PIC S9(5) VALUE 0.           03420099
034300     05  TTL-NOT-AFT-DTE-DIFF        PIC S9(5) VALUE 0.           03430099
034400     05  TTL-OTB-EOW-DTE-DIFF        PIC S9(5) VALUE 0.           03440099
034500     05  TTL-CLOSE-DTE-DIFF          PIC S9(5) VALUE 0.           03450099
034600     05  TTL-PAYT-TERM-ID-DIFF       PIC S9(5) VALUE 0.           03460099
034700     05  TTL-FRGT-TERM-ID-DIFF       PIC S9(5) VALUE 0.           03470099
034800     05  TTL-STAT-CDE-DIFF           PIC S9(5) VALUE 0.           03480099
034900     05  TTL-ORIG-PO-APVL-DTE-DIFF   PIC S9(5) VALUE 0.           03490099
035000     05  TTL-ORIG-APP-BY-USR-ID-DIFF PIC S9(5) VALUE 0.           03500099
035100     05  TTL-EDI-SNT-IND-DIFF        PIC S9(5) VALUE 0.           03510099
035200     05  TTL-EDI-PO-IND-DIFF         PIC S9(5) VALUE 0.           03520099
035300     05  TTL-IMPRT-PO-IND-DIFF       PIC S9(5) VALUE 0.           03530099
035400     05  TTL-FCTRY-NM-DIFF           PIC S9(5) VALUE 0.           03540099
035500     05  TTL-POE-CDE-DIFF            PIC S9(5) VALUE 0.           03550099
035600     05  TTL-FOB-CDE-DIFF            PIC S9(5) VALUE 0.           03560099
035700     05  TTL-PO-TYP-CDE-DIFF         PIC S9(5) VALUE 0.           03570099
035800     05  TTL-PK-BY-STR-IND-DIFF      PIC S9(5) VALUE 0.           03580099
035900     05  TTL-CONSLR-ACTL-DTE-DIFF    PIC S9(5) VALUE 0.           03590099
036000     05  TTL-CONSLR-REQR-DTE-DIFF    PIC S9(5) VALUE 0.           03600099
036100     05  TTL-CONSLR-RLSE-CDE-DIFF    PIC S9(5) VALUE 0.           03610099
036200     05  TTL-TKT-MKR-ACTL-DTE-DIFF   PIC S9(5) VALUE 0.           03620099
036300     05  TTL-TKT-MKR-REQR-DTE-DIFF   PIC S9(5) VALUE 0.           03630099
036400     05  TTL-TKT-MKR-RLSE-CDE-DIFF   PIC S9(5) VALUE 0.           03640099
036500     05  TTL-RLSE-DTE-DIFF           PIC S9(5) VALUE 0.           03650099
036600     05  TTL-FRST-FCTRY-DTE-DIFF     PIC S9(5) VALUE 0.           03660099
036700     05  TTL-LAST-FCTRY-DTE-DIFF     PIC S9(5) VALUE 0.           03670099
036800     05  TTL-DIR-STR-IND-DIFF        PIC S9(5) VALUE 0.           03680099
036900     05  TTL-EXTD-NOT-AFT-DTE-DIFF   PIC S9(5) VALUE 0.           03690099
037000     05  TTL-HNG-IND-DIFF            PIC S9(5) VALUE 0.           03700099
037100     05  TTL-NW-STR-ORD-IND-DIFF     PIC S9(5) VALUE 0.           03710099
037200     05  TTL-PKGNG-CDE-DIFF          PIC S9(5) VALUE 0.           03720099
037300     05  TTL-PKGNG-DESC-DIFF         PIC S9(5) VALUE 0.           03730099
037400     05  TTL-PTKT-LDTM-DAYS-QTY-DIFF PIC S9(5) VALUE 0.           03740099
037500     05  TTL-SEASET-SHRT-DESC-DIFF   PIC S9(5) VALUE 0.           03750099
037600     05  TTL-SEASET-YR-DIFF          PIC S9(5) VALUE 0.           03760099
037700     05  TTL-CRE-BY-USR-ID-DIFF      PIC S9(5) VALUE 0.           03770099
037800     05  TTL-PTKT-IND-DIFF           PIC S9(5) VALUE 0.           03780099
037900     05  TTL-C-O-PROD-CDE-DIFF       PIC S9(5) VALUE 0.           03790099
038000     05  TTL-AGNT-OFC-CNTRY-CDE-DIFF PIC S9(5) VALUE 0.           03800099
038100     05  TTL-UNT-PER-CBMT-QTY-DIFF   PIC S9(5) VALUE 0.           03810099
038200     05  TTL-QTA-CTG-CDE-DIFF        PIC S9(5) VALUE 0.           03820099
038300     05  TTL-IMPRT-VND-ID-DIFF       PIC S9(5) VALUE 0.           03830099
038400     05  TTL-IMPRT-FCTRY-ID-DIFF     PIC S9(5) VALUE 0.           03840099
038500     05  TTL-IMPRT-VND-NM-DIFF       PIC S9(5) VALUE 0.           03850099
038600     05  TTL-IMPRT-FCTRY-NM-DIFF     PIC S9(5) VALUE 0.           03860099
038700                                                                  03870099
038800     05  TTL-IN-PO-NBR-DIFF          PIC S9(5)  VALUE  0.         03880099
038900     05  TTL-IN-RECIP-CDE-DIFF       PIC S9(5)  VALUE  0.         03890099
039000     05  TTL-IN-INSTR-DESC-DIFF      PIC S9(5)  VALUE  0.         03900099
039100                                                                  03910099
039200     05  TTL-DI-PO-NBR-DIFF          PIC S9(5)  VALUE  0.         03920099
039300     05  TTL-DI-DL-ID-DIFF           PIC S9(5)  VALUE  0.         03930099
039400     05  TTL-DI-DL-DTL-ID-DIFF       PIC S9(5)  VALUE  0.         03940099
039500     05  TTL-DI-DISC-TYPE-CDE-DIFF   PIC S9(5)  VALUE  0.         03950099
039600     05  TTL-DI-EXTD-DAYS-QTY-DIFF   PIC S9(5)  VALUE  0.         03960099
039700     05  TTL-DI-DISC-PCT-DIFF        PIC S9(5)  VALUE  0.         03970099
039800     05  TTL-DI-TOT-DISC-AMT-DIFF    PIC S9(5)  VALUE  0.         03980099
039900                                                                  03990099
040000     05  TTL-SK-PO-NBR-DIFF          PIC S9(5)  VALUE  0.         04000099
040100     05  TTL-SK-SKU-NBR-DIFF         PIC S9(5)  VALUE  0.         04010099
040200     05  TTL-SK-UNT-COST-AMT-DIFF    PIC S9(5)  VALUE  0.         04020099
040300     05  TTL-SK-FRST-COST-AMT-DIFF   PIC S9(5)  VALUE  0.         04030099
040400     05  TTL-SK-VND-QTY-DIFF         PIC S9(5)  VALUE  0.         04040099
040500     05  TTL-SK-INPK-QTY-DIFF        PIC S9(5)  VALUE  0.         04050099
040510     05  TTL-SK-OTPK-QTY-DIFF        PIC S9(5)  VALUE  0.         04051099
040600     05  TTL-SK-PROMO-STRT-DTE-DIFF  PIC S9(5)  VALUE  0.         04060099
040700     05  TTL-SK-PIC-SKU-IND-DIFF     PIC S9(5)  VALUE  0.         04070099
040800     05  TTL-SK-ORIG-ORD-QTY-DIFF    PIC S9(5)  VALUE  0.         04080099
040900     05  TTL-SK-ORD-QTY-DIFF         PIC S9(5)  VALUE  0.         04090099
041000     05  TTL-SK-CNCLD-QTY-DIFF       PIC S9(5)  VALUE  0.         04100099
041100     05  TTL-SK-PK-SKU-IND-DIFF      PIC S9(5)  VALUE  0.         04110099
041200     05  TTL-SK-PK-SKU-DESC-DIFF     PIC S9(5)  VALUE  0.         04120099
041300     05  TTL-SK-DC-ORD-MULT-QTY-DIFF PIC S9(5) VALUE 0.           04130099
041400                                                                  04140099
041500     05  TTL-LO-PO-NBR-DIFF          PIC S9(5)  VALUE  0.         04150099
041600     05  TTL-LO-SKU-NBR-DIFF         PIC S9(5)  VALUE  0.         04160099
041700     05  TTL-LO-LOC-NBR-DIFF         PIC S9(5)  VALUE  0.         04170099
041800     05  TTL-LO-LOC-TYP-CDE-DIFF     PIC S9(5)  VALUE  0.         04180099
041900     05  TTL-SK-UNT-RTL-AMT-DIFF     PIC S9(5)  VALUE  0.         04190099
042000     05  TTL-SK-GP-RTL-AMT-DIFF      PIC S9(5)  VALUE  0.         04200099
042100     05  TTL-SK-GP-RTL-QTY-DIFF      PIC S9(5)  VALUE  0.         04210099
042200     05  TTL-LO-ORD-QTY-DIFF         PIC S9(5)  VALUE  0.         04220099
042300     05  TTL-LO-ORIG-ORD-QTY-DIFF    PIC S9(5)  VALUE  0.         04230099
042400     05  TTL-LO-CNCLD-QTY-DIFF       PIC S9(5)  VALUE  0.         04240099
042500     05  TTL-LO-CNCL-CDE-DIFF        PIC S9(5)  VALUE  0.         04250099
042600     05  TTL-LO-CNCL-DTE-DIFF        PIC S9(5)  VALUE  0.         04260099
042700     05  TTL-LO-CNCLD-BY-USR-ID-DIFF  PIC S9(5) VALUE 0.          04270099
042800     05  TTL-LO-DC-ALLC-MULT-QTY-DIFF PIC S9(5) VALUE 0.          04280099
042900     05  TTL-LO-STR-ALLC-MLT-QTY-DIFF PIC S9(5) VALUE 0.          04290099
043000     05  TTL-LO-ALLOC-RND-CDE-DIFF    PIC S9(5) VALUE 0.          04300099
043100     05  TTL-LO-SHTG-PRT-OPT-CDE-DIFF PIC S9(5) VALUE 0.          04310099
043200     05  TTL-LO-OVRG-PRT-OPT-CDE-DIFF PIC S9(5) VALUE 0.          04320099
043300     05  TTL-LO-EXT-SHTG-THR-IND-DIFF PIC S9(5) VALUE 0.          04330099
043400                                                                  04340099
043500     05  TTL-SB-PO-NBR-DIFF          PIC S9(5)  VALUE  0.         04350099
043600     05  TTL-SB-SKU-NBR-DIFF         PIC S9(5)  VALUE  0.         04360099
043700     05  TTL-SB-LOC-NBR-DIFF         PIC S9(5)  VALUE  0.         04370099
043800     05  TTL-SB-STR-NBR-DIFF         PIC S9(5)  VALUE  0.         04380099
043900     05  TTL-SB-RNK-SEQ-NBR-DIFF     PIC S9(5)  VALUE  0.         04390099
044000     05  TTL-SB-ALLOC-QTY-DIFF       PIC S9(5)  VALUE  0.         04400099
044100     05  TTL-SB-ALLOC-SEQ-CDE-DIFF   PIC S9(5)  VALUE  0.         04410099
044200     05  TTL-SB-STR-CNSTR-CDE-DIFF   PIC S9(5)  VALUE  0.         04420099
044300     05  TTL-SB-STR-CNSTR-QTY-DIFF   PIC S9(5)  VALUE  0.         04430099
044400                                                                  04440099
044500     05  TTL-PB-PO-NBR-DIFF          PIC S9(5)  VALUE  0.         04450099
044600     05  TTL-PB-PK-SKU-NBR-DIFF      PIC S9(5)  VALUE  0.         04460099
044700     05  TTL-PB-SKU-NBR-DIFF         PIC S9(5)  VALUE  0.         04470099
044800     05  TTL-PB-UNT-COST-AMT-DIFF    PIC S9(5)  VALUE  0.         04480099
044900     05  TTL-PB-FRST-COST-AMT-DIFF   PIC S9(5)  VALUE  0.         04490099
045000     05  TTL-PB-UNT-RTL-AMT-DIFF     PIC S9(5)  VALUE  0.         04500099
045100     05  TTL-PB-GP-RTL-AMT-DIFF      PIC S9(5)  VALUE  0.         04510099
045200     05  TTL-PB-GP-RTL-QTY-DIFF      PIC S9(5)  VALUE  0.         04520099
045300     05  TTL-PB-RATO-UNT-QTY-DIFF    PIC S9(5)  VALUE  0.         04530099
045310     05  TTL-PB-INPK-UNT-QTY-DIFF    PIC S9(5)  VALUE  0.         04531099
045320     05  TTL-PB-OTPK-UNT-QTY-DIFF    PIC S9(5)  VALUE  0.         04532099
045400                                                                  04540099
045500     05  TTL-PL-PO-NBR-DIFF          PIC S9(5)  VALUE  0.         04550099
045600     05  TTL-PL-SKU-NBR-DIFF         PIC S9(5)  VALUE  0.         04560099
045700     05  TTL-PL-PK-SKU-NBR-DIFF      PIC S9(5)  VALUE  0.         04570099
045800     05  TTL-PL-LOC-NBR-DIFF         PIC S9(5)  VALUE  0.         04580099
045900                                                                  04590099
046000 01  WORK-FIELDS-OTHER.                                           04600099
046100     05  WS-PAGE-COUNT               PIC S9(5)  VALUE  0.         04610099
046200     05  WS-34                       PIC S9(5)  VALUE  34.        04620099
046300     05  WS-COUNT                    PIC S9(5)  VALUE  0.         04630099
046400     05  LINE-COUNT                  PIC S9(5)  VALUE  66.        04640099
046500     05  PAGE-COUNT                  PIC S9(5)  VALUE  0.         04650099
046600     05  STMT-COUNT                  PIC S9(5)  VALUE  0.         04660099
046700                                                                  04670099
046800 01  WORK-FIELDS-DATES.                                           04680099
046900     05  WS-DATE-YYMMDD.                                          04690099
047000         10  WS-DATE-YY            PIC 99   VALUE 0.              04700099
047100         10  WS-DATE-MM            PIC 99   VALUE 0.              04710099
047200         10  WS-DATE-DD            PIC 99   VALUE 0.              04720099
047300                                                                  04730099
047400     05  WS-TIME.                                                 04740099
047500         10  WS-TIME-HH            PIC 99   VALUE 0.              04750099
047600         10  WS-TIME-MM            PIC 99   VALUE 0.              04760099
047700         10  WS-TIME-SS            PIC 99   VALUE 0.              04770099
047800         10  WS-TIME-HD            PIC 99   VALUE 0.              04780099
047900                                                                  04790099
048000     05  WORK-DATE.                                               04800099
048100         10  WORK-DATE-YY          PIC 99   VALUE 0.              04810099
048200         10  WORK-DATE-MM          PIC 99   VALUE 0.              04820099
048300         10  WORK-DATE-DD          PIC 99   VALUE 0.              04830099
048400                                                                  04840099
048500     05  WS-OUT-DATE.                                             04850099
048600         10  WS-OUT-MONTH          PIC 99   VALUE 0.              04860099
048700         10  FILLER                PIC X    VALUE '/'.            04870099
048800         10  WS-OUT-DAY            PIC 99   VALUE 0.              04880099
048900         10  FILLER                PIC X    VALUE '/'.            04890099
049000         10  WS-OUT-YEAR           PIC 99   VALUE 0.              04900099
049100                                                                  04910099
049200     05  WS-OUT-TIME.                                             04920099
049300         10  WS-OUT-HOUR           PIC 99   VALUE 0.              04930099
049400         10  FILLER                PIC X    VALUE ':'.            04940099
049500         10  WS-OUT-MINUTE         PIC 99   VALUE 0.              04950099
049600         10  FILLER                PIC X    VALUE ':'.            04960099
049700         10  WS-OUT-SECONDS        PIC 99   VALUE 0.              04970099
049800                                                                  04980099
049900****************************************************************  04990099
050000*    STANDARD HEADING LAYOUT.                                  *  05000099
050100****************************************************************  05010099
050200                                                                  05020099
050300     COPY DPWS133.                                                05030099
050400                                                                  05040099
050500 01  REPORT-HEADING-2.                                            05050099
050600     05  FILLER                    PIC X(44) VALUE                05060099
050700         '                                            '.          05070099
050800     05  FILLER                    PIC X(44) VALUE                05080099
050900         '  DAILY RMS/LEGACY PO DATA INTEGRITY REPORT '.          05090099
051000     05  FILLER                    PIC X(44) VALUE                05100099
051100         '                                            '.          05110099
051200                                                                  05120099
051300 01  REPORT-HEADING-4.                                            05130099
051400     05  FILLER                    PIC X(44) VALUE                05140099
051410*** PRB0051493 START                                              05141099
051500*        '          PKG         EDI        STAT   SKU '.          05150099
051510         '          PKG                    STAT   SKU '.          05151099
051520*** PRB0051493 END                                                05152099
051600     05  FILLER                    PIC X(44) VALUE                05160099
051700         '                                            '.          05170099
051800     05  FILLER                    PIC X(44) VALUE                05180099
051900         '                                            '.          05190099
052000                                                                  05200099
052100 01  REPORT-HEADING-5.                                            05210099
052200     05  FILLER                    PIC X(44) VALUE                05220099
052210*** PRB0051493 START                                              05221099
052300*        '   PO      CD   REXMIT TMST/IND   CD  NUMBER'.          05230099
052310         '   PO      CD   RMS PO UPD TMST   CD  NUMBER'.          05231099
052320*** PRB0051493 END                                                05232099
052400     05  FILLER                    PIC X(44) VALUE                05240099
052500         '    LOC  STR      TEMPLATE#/FIELD        RMS'.          05250099
052600     05  FILLER                    PIC X(44) VALUE                05260099
052700         ' VALUE            LEGACY VALUE              '.          05270099
052800                                                                  05280099
052900 01  REPORT-HEADING-6.                                            05290099
053000     05  FILLER                    PIC X(44) VALUE                05300099
053100         ' --------  -- ------------------  --  ------'.          05310099
053200     05  FILLER                    PIC X(44) VALUE                05320099
053300         '--  ----------  --------------------  ------'.          05330099
053400     05  FILLER                    PIC X(44) VALUE                05340099
053500         '-------------  -------------------          '.          05350099
053600                                                                  05360099
053700 01  REPORT-HEADING-7.                                            05370099
053800     05  FILLER                    PIC X(44) VALUE                05380099
053900         '                                            '.          05390099
054000     05  FILLER                    PIC X(44) VALUE                05400099
054100         '                                            '.          05410099
054200     05  FILLER                    PIC X(44) VALUE                05420099
054300         '                                            '.          05430099
054310                                                                  05431099
054311*** PRB0051493 START                                              05431199
054312                                                                  05431299
054320 01  REPORT-HEADING-8.                                            05432099
054321     05  FILLER                    PIC X(28) VALUE                05432199
054322         '                            '.                          05432299
054330     05  FILLER                    PIC X(18) VALUE                05433099
054340         ' EXTRACT RANGE OF '.                                    05434099
054341     05  HEAD-START-TMST           PIC X(26) VALUE SPACES.        05434199
054350     05  FILLER                    PIC X(06) VALUE                05435099
054360         ' THRU '.                                                05436099
054361     05  HEAD-END-TMST             PIC X(26) VALUE SPACES.        05436199
054370     05  FILLER                    PIC X(28) VALUE                05437099
054380         '                            '.                          05438099
054392*** PRB0051493 END                                                05439299
054400                                                                  05440099
054500 01  REPORT-FOOTER-1.                                             05450099
054600     05  FILLER                    PIC X(44) VALUE                05460099
054700         '                                            '.          05470099
054800     05  FILLER                    PIC X(44) VALUE                05480099
054900         '       *** END OF REPORT ***                '.          05490099
055000     05  FILLER                    PIC X(44) VALUE                05500099
055100         '                                            '.          05510099
055200                                                                  05520099
055300 01  REPORT-NO-RECORDS.                                           05530099
055400     05  FILLER                    PIC X(44) VALUE                05540099
055500         '                                            '.          05550099
055600     05  FILLER                    PIC X(44) VALUE                05560099
055700         '       ***** EMPTY FILE *****               '.          05570099
055800     05  FILLER                    PIC X(44) VALUE                05580099
055900         '                                            '.          05590099
056000                                                                  05600099
056100 01  DETAIL-LINE                 PIC X(132) VALUE SPACES.         05610099
056200                                                                  05620099
056300 01  DETAIL-LINE-1.                                               05630099
056400     05  DTL1-PO-NBR             PIC X(08) VALUE SPACES.          05640099
056500     05  FILLER                  PIC X(03) VALUE SPACES.          05650099
056600     05  DTL1-PKG-CD             PIC X(02) VALUE SPACES.          05660099
056700     05  FILLER                  PIC X(01) VALUE SPACES.          05670099
056800     05  DTL1-EDI-XMIT           PIC X(16) VALUE SPACES.          05680099
056900     05  FILLER                  PIC X(01) VALUE SPACES.          05690099
057000     05  DTL1-EDI-IND            PIC X(01) VALUE SPACES.          05700099
057100     05  FILLER                  PIC X(02) VALUE SPACES.          05710099
057200     05  DTL1-STATUS-CODE        PIC X(02) VALUE SPACES.          05720099
057300     05  FILLER                  PIC X(02) VALUE SPACES.          05730099
057400     05  DTL1-SKU-NBR            PIC X(08) VALUE SPACES.          05740099
057500     05  FILLER                  PIC X(02) VALUE SPACES.          05750099
057600     05  DTL1-VARIABLE-AREA      PIC X(10) VALUE SPACES.          05760099
057700                                                                  05770099
057800     05  DTL1-REDEFINE-1     REDEFINES  DTL1-VARIABLE-AREA.       05780099
057900         10  FILLER              PIC X(01).                       05790099
058000         10  DTL1-COMPONENT-NBR  PIC X(08).                       05800099
058100         10  FILLER              PIC X(01).                       05810099
058200                                                                  05820099
058300     05  DTL1-REDEFINE-2     REDEFINES  DTL1-VARIABLE-AREA.       05830099
058400         10  DTL1-LOC-NBR        PIC X(04).                       05840099
058500         10  FILLER              PIC X(02).                       05850099
058600         10  DTL1-STR-NBR        PIC X(04).                       05860099
058700                                                                  05870099
058800     05  FILLER                  PIC X(02) VALUE SPACES.          05880099
058900     05  DTL1-TEMP-FIELD-NBR     PIC X(20) VALUE SPACES.          05890099
059000     05  FILLER                  PIC X(02) VALUE SPACES.          05900099
059100     05  DTL1-RMS-VALUE          PIC X(20) VALUE SPACES.          05910099
059200     05  FILLER                  PIC X(02) VALUE SPACES.          05920099
059300     05  DTL1-LEGACY-VALUE       PIC X(20) VALUE SPACES.          05930099
059400     05  FILLER                  PIC X(07) VALUE SPACES.          05940099
059500                                                                  05950099
059510*** PRB0051493 START                                              05951099
059520 01  WS-WORK-RMSONLY-DATA.                                        05952099
      *CHG0112236 - START                                               05952199
059530     05  WS-RMSONLY-TABLE  OCCURS 15000 TIMES INDEXED BY CS-IDX.  05953099
      *CHG0112236 - END                                                 05953199
059540         10  RMSONLY-PO-NBR      PIC 9(08).                       05954099
059550         10  RMSONLY-UPD-TMST    PIC X(26).                       05955099
059560                                                                  05956099
059561*** PRB0051493 END                                                05956199
059580                                                                  05958099
059600****************************************************************  05960099
059700*    ABEND PROCESSING COPYBOOK.                                *  05970099
059800****************************************************************  05980099
059900                                                                  05990099
060000     COPY DPWS013.                                                06000099
060100                                                                  06010099
060200     EXEC SQL                                                     06020099
060300          INCLUDE TPURCHS                                         06030099
060400     END-EXEC.                                                    06040099
060500                                                                  06050099
060600     EXEC SQL                                                     06060099
060700          INCLUDE SQLCA                                           06070099
060800     END-EXEC.                                                    06080099
060900                                                                  06090099
061000 PROCEDURE DIVISION.                                              06100099
061100                                                                  06110099
061200     PERFORM 1000-INITIALIZATION THRU                             06120099
061300             1000-EXIT.                                           06130099
061400                                                                  06140099
061500     PERFORM 2000-PROCESS-RECORDS THRU                            06150099
061600             2000-EXIT.                                           06160099
061700                                                                  06170099
061800     PERFORM 9900-TERMINATION THRU                                06180099
061900             9900-EXIT.                                           06190099
062000                                                                  06200099
062100     GOBACK.                                                      06210099
062200                                                                  06220099
062300 1000-INITIALIZATION.                                             06230099
062400                                                                  06240099
062500     OPEN INPUT                                                   06250099
062600                 FD-COMPARE-FILE-IN                               06260099
062601*** PRB0051493 START                                              06260199
062610                 FD-RMSONLY-FILE-IN                               06261099
062620                 FD-STRTTMST-FILE-IN                              06262099
062630                 FD-ENDTMST-FILE-IN                               06263099
062640*** PRB0051493 END                                                06264099
062700          OUTPUT FD-REPORT.                                       06270099
062800                                                                  06280099
062900     DISPLAY '***** BEGIN PROGRAM: ' PC-PGM-NAME ' *****'.        06290099
063000     MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATETIME.           06300099
063100     DISPLAY 'DATE: ' WS-CURRENT-DATE-MM '-' WS-CURRENT-DATE-DD   06310099
063200             '-'      WS-CURRENT-DATE-CCYY '    '                 06320099
063300             'TIME: ' WS-CURRENT-TIME-HH ':' WS-CURRENT-TIME-MM   06330099
063400             ':' WS-CURRENT-TIME-SS.                              06340099
063500     DISPLAY ' '.                                                 06350099
063600                                                                  06360099
063700     MOVE  0  TO  NUMBER-OF-COMPARE-RECORDS.                      06370099
063800                                                                  06380099
063900     INITIALIZE PO-COUNT-FIELDS.                                  06390099
064000                                                                  06400099
064100     MOVE PC-PGM-NAME          TO DP133-PROGRAM-NAME.             06410099
064200     MOVE 1                    TO DP133-REPORT-NUMBER.            06420099
064300     MOVE WS-CURRENT-DATE-MM   TO DP133-RUN-MONTH.                06430099
064400     MOVE WS-CURRENT-DATE-DD   TO DP133-RUN-DAY.                  06440099
064500     MOVE WS-CURRENT-DATE-CCYY TO DP133-RUN-YEAR.                 06450099
064600     MOVE WS-CURRENT-TIME-HH   TO DP133-RUN-HOUR.                 06460099
064700     MOVE WS-CURRENT-TIME-MM   TO DP133-RUN-MINUTE.               06470099
064800                                                                  06480099
064900     ACCEPT WS-DATE-YYMMDD FROM DATE.                             06490099
065000     DISPLAY ' '.                                                 06500099
065100     DISPLAY 'DATE - '                                            06510099
065200              WS-DATE-YYMMDD.                                     06520099
065300     DISPLAY ' '.                                                 06530099
065400     ACCEPT WS-TIME        FROM TIME.                             06540099
065500     DISPLAY ' '.                                                 06550099
065600     DISPLAY 'TIME - '                                            06560099
065700              WS-TIME.                                            06570099
065800     MOVE WS-DATE-YY TO WS-OUT-YEAR.                              06580099
065900     MOVE WS-DATE-MM TO WS-OUT-MONTH.                             06590099
066000     MOVE WS-DATE-DD TO WS-OUT-DAY.                               06600099
066100     MOVE WS-TIME-HH TO WS-OUT-HOUR.                              06610099
066200     MOVE WS-TIME-MM TO WS-OUT-MINUTE.                            06620099
066300     MOVE WS-TIME-SS TO WS-OUT-SECONDS.                           06630099
066400                                                                  06640099
066410*** PRB0051493 START                                              06641099
066420     PERFORM 9300-READ-START-TIMESTAMP.                           06642099
066430     MOVE XL014-CONTROL-TMST       TO HEAD-START-TMST.            06643099
066440     PERFORM 9400-READ-END-TIMESTAMP.                             06644099
066450     MOVE XL014-CONTROL-TMST       TO HEAD-END-TMST.              06645099
066451     PERFORM 9500-READ-RMSONLY-FILE.                              06645199
066460                                                                  06646099
066461*** PRB0051493 END                                                06646199
066470                                                                  06647099
066500 1000-EXIT. EXIT.                                                 06650099
066600                                                                  06660099
066700 2000-PROCESS-RECORDS.                                            06670099
066800                                                                  06680099
066900     MOVE  WS-NO  TO  END-OF-COMPARE-RECORDS.                     06690099
067000                                                                  06700099
067100     PERFORM 9200-READ-COMPARE-INPUT THRU                         06710099
067200             9200-EXIT.                                           06720099
067300                                                                  06730099
067400     PERFORM UNTIL (END-OF-COMPARE-RECORDS = WS-YES)              06740099
067500                                                                  06750099
067600         IF CURRENT-PO-NO = PREVIOUS-PO-NO                        06760099
067700            CONTINUE                                              06770099
067800         ELSE                                                     06780099
067900*JPL                                                              06790099
067910*** PRB0051493 START                                              06791099
067930            PERFORM 9000-CHECK-RMSONLY-PO                         06793099
067991*** PRB0051493 END                                                06799199
068000            SET PS-PRT-PO-YES TO TRUE                             06800099
068100            IF FIRST-TIME = WS-YES                                06810099
068200               MOVE WS-NO TO FIRST-TIME                           06820099
068300               STRING ' DATE - '                                  06830099
068400                       WS-OUT-DATE                                06840099
068500                      ' TIME - '                                  06850099
068600                       WS-OUT-TIME                                06860099
068700                       DELIMITED BY SIZE                          06870099
068800                       INTO WS-REPORT-RECORD                      06880099
068900               PERFORM 9600-WRITE-REPORT-RECORD THRU              06890099
069000                       9600-EXIT                                  06900099
069100            ELSE                                                  06910099
069200               DISPLAY ' '                                        06920099
069300               DISPLAY ASTERISK-LINE                              06930099
069400               DISPLAY 'PO NUMBER - '                             06940099
069500                        PREVIOUS-PO-NO                            06950099
069600               DISPLAY ASTERISK-LINE                              06960099
069700               MOVE SPACES         TO WS-REPORT-RECORD            06970099
069800               PERFORM 9600-WRITE-REPORT-RECORD THRU              06980099
069900                       9600-EXIT                                  06990099
070000               MOVE ASTERISK-LINE  TO WS-REPORT-RECORD            07000099
070100               PERFORM 9600-WRITE-REPORT-RECORD THRU              07010099
070200                       9600-EXIT                                  07020099
070300                                                                  07030099
070400               STRING '  PO NUMBER - '                            07040099
070500                       PREVIOUS-PO-NO                             07050099
070600                       DELIMITED BY SIZE                          07060099
070700                       INTO WS-REPORT-RECORD                      07070099
070800               PERFORM 9600-WRITE-REPORT-RECORD THRU              07080099
070900                       9600-EXIT                                  07090099
071000                                                                  07100099
071100               MOVE ASTERISK-LINE  TO WS-REPORT-RECORD            07110099
071200               PERFORM 9600-WRITE-REPORT-RECORD THRU              07120099
071300                       9600-EXIT                                  07130099
071400               PERFORM 4000-DISPLAY-COUNTS THRU                   07140099
071500                       4000-EXIT                                  07150099
071600            END-IF                                                07160099
071700                                                                  07170099
071800            MOVE CURRENT-PO-NO TO PREVIOUS-PO-NO                  07180099
071900         END-IF                                                   07190099
072000                                                                  07200099
072100         PERFORM 2400-SUMMARIZE-COUNTS THRU                       07210099
072200                 2400-EXIT                                        07220099
072300                                                                  07230099
072400         PERFORM 9200-READ-COMPARE-INPUT THRU                     07240099
072500                 9200-EXIT                                        07250099
072600                                                                  07260099
072700     END-PERFORM.                                                 07270099
072800                                                                  07280099
072900     IF NUMBER-OF-COMPARE-RECORDS = 0                             07290099
073000        PERFORM 8400-PRINT-HEADINGS                               07300099
073100                                                                  07310099
073200        WRITE REPORT-RECORD FROM REPORT-NO-RECORDS                07320099
073300              AFTER ADVANCING 2 LINES.                            07330099
073400                                                                  07340099
073500     WRITE REPORT-RECORD FROM REPORT-FOOTER-1                     07350099
073600           AFTER ADVANCING 2 LINES.                               07360099
073700                                                                  07370099
073800                                                                  07380099
073900 2000-EXIT. EXIT.                                                 07390099
074000                                                                  07400099
074100****************************************************************  07410099
074200*                                                              *  07420099
074300*                                                              *  07430099
074400*                                                              *  07440099
074500*                                                              *  07450099
074600*                                                              *  07460099
074700*                                                              *  07470099
074800****************************************************************  07480099
074900                                                                  07490099
075000 2400-SUMMARIZE-COUNTS.                                           07500099
075100                                                                  07510099
075200     EVALUATE TRUE                                                07520099
075300         WHEN XL023-XXT-PO                                        07530099
075400              ADD 1 TO NUMBER-XXT-PO                              07540099
075500                                                                  07550099
075600              EVALUATE TRUE                                       07560099
075700                  WHEN XL023-ON-RMS-ONLY                          07570099
075800                       ADD 1 TO NUMBER-PO-HDR-RMS                 07580099
075900                       PERFORM 8000-WRITE-DETAIL-LINE             07590099
076000                                                                  07600099
076100                  WHEN XL023-ON-LEGACY-ONLY                       07610099
076200                       ADD 1 TO NUMBER-PO-HDR-LGCY                07620099
076300                       PERFORM 8000-WRITE-DETAIL-LINE             07630099
076400                                                                  07640099
076500                  WHEN XL023-ON-BOTH-RMS-LEGACY                   07650099
076600                       ADD 1 TO NUMBER-PO-HDR-DATA                07660099
076700                       PERFORM 4200-EVALUATE-DATA THRU            07670099
076800                               4200-EXIT                          07680099
076900                                                                  07690099
077000              END-EVALUATE                                        07700099
077100                                                                  07710099
077200         WHEN XL023-XXT-PO-INSTR                                  07720099
077300              ADD 1 TO NUMBER-XXT-PO-INSTR                        07730099
077400              EVALUATE TRUE                                       07740099
077500                  WHEN XL023-ON-RMS-ONLY                          07750099
077600                       ADD 1 TO NUMBER-PO-INSTR-RMS               07760099
077700                       PERFORM 8000-WRITE-DETAIL-LINE             07770099
077800                                                                  07780099
077900                  WHEN XL023-ON-LEGACY-ONLY                       07790099
078000                       ADD 1 TO NUMBER-PO-INSTR-LGCY              07800099
078100                       PERFORM 8000-WRITE-DETAIL-LINE             07810099
078200                                                                  07820099
078300                  WHEN XL023-ON-BOTH-RMS-LEGACY                   07830099
078400                       ADD 1 TO NUMBER-PO-INSTR-DATA              07840099
078500                       PERFORM 4200-EVALUATE-DATA THRU            07850099
078600                               4200-EXIT                          07860099
078700                                                                  07870099
078800              END-EVALUATE                                        07880099
078900                                                                  07890099
079000         WHEN XL023-XXT-PO-DISC                                   07900099
079100              ADD 1 TO NUMBER-XXT-PO-DISC                         07910099
079200              EVALUATE TRUE                                       07920099
079300                  WHEN XL023-ON-RMS-ONLY                          07930099
079400                       ADD 1 TO NUMBER-PO-DISC-RMS                07940099
079500                       PERFORM 8000-WRITE-DETAIL-LINE             07950099
079600                                                                  07960099
079700                  WHEN XL023-ON-LEGACY-ONLY                       07970099
079800                       ADD 1 TO NUMBER-PO-DISC-LGCY               07980099
079900                       PERFORM 8000-WRITE-DETAIL-LINE             07990099
080000                                                                  08000099
080100                  WHEN XL023-ON-BOTH-RMS-LEGACY                   08010099
080200                       ADD 1 TO NUMBER-PO-DISC-DATA               08020099
080300                       PERFORM 4200-EVALUATE-DATA THRU            08030099
080400                               4200-EXIT                          08040099
080500                                                                  08050099
080600              END-EVALUATE                                        08060099
080700                                                                  08070099
080800         WHEN XL023-XXT-PO-SKU                                    08080099
080900              ADD 1 TO NUMBER-XXT-PO-SKU                          08090099
081000              EVALUATE TRUE                                       08100099
081100                  WHEN XL023-ON-RMS-ONLY                          08110099
081200                       ADD 1 TO NUMBER-PO-SKU-RMS                 08120099
081300                       PERFORM 8000-WRITE-DETAIL-LINE             08130099
081400                                                                  08140099
081500                  WHEN XL023-ON-LEGACY-ONLY                       08150099
081600                       ADD 1 TO NUMBER-PO-SKU-LGCY                08160099
081700                       PERFORM 8000-WRITE-DETAIL-LINE             08170099
081800                                                                  08180099
081900                  WHEN XL023-ON-BOTH-RMS-LEGACY                   08190099
082000                       ADD 1 TO NUMBER-PO-SKU-DATA                08200099
082100                       PERFORM 4200-EVALUATE-DATA THRU            08210099
082200                               4200-EXIT                          08220099
082300                                                                  08230099
082400              END-EVALUATE                                        08240099
082500                                                                  08250099
082600         WHEN XL023-XXT-PO-PK-SKU                                 08260099
082700              ADD 1 TO NUMBER-XXT-PO-PK-SKU                       08270099
082800              EVALUATE TRUE                                       08280099
082900                  WHEN XL023-ON-RMS-ONLY                          08290099
083000                       ADD 1 TO NUMBER-PO-PK-SKU-RMS              08300099
083100                       PERFORM 8000-WRITE-DETAIL-LINE             08310099
083200                                                                  08320099
083300                  WHEN XL023-ON-LEGACY-ONLY                       08330099
083400                       ADD 1 TO NUMBER-PO-PK-SKU-LGCY             08340099
083500                       PERFORM 8000-WRITE-DETAIL-LINE             08350099
083600                                                                  08360099
083700                  WHEN XL023-ON-BOTH-RMS-LEGACY                   08370099
083800                       ADD 1 TO NUMBER-PO-PK-SKU-DATA             08380099
083900                       PERFORM 4200-EVALUATE-DATA THRU            08390099
084000                               4200-EXIT                          08400099
084100                                                                  08410099
084200              END-EVALUATE                                        08420099
084300                                                                  08430099
084400         WHEN XL023-XXT-PO-PK-SKU-LOC                             08440099
084500              ADD 1 TO NUMBER-XXT-PO-PK-SKU-LOC                   08450099
084600              EVALUATE TRUE                                       08460099
084700                  WHEN XL023-ON-RMS-ONLY                          08470099
084800                       ADD 1 TO NUMBER-PO-PK-SKU-LOC-RMS          08480099
084900                       PERFORM 8000-WRITE-DETAIL-LINE             08490099
085000                                                                  08500099
085100                  WHEN XL023-ON-LEGACY-ONLY                       08510099
085200                       ADD 1 TO NUMBER-PO-PK-SKU-LOC-LGCY         08520099
085300                       PERFORM 8000-WRITE-DETAIL-LINE             08530099
085400                                                                  08540099
085500                  WHEN XL023-ON-BOTH-RMS-LEGACY                   08550099
085600                       ADD 1 TO NUMBER-PO-PK-SKU-LOC-DATA         08560099
085700                       PERFORM 4200-EVALUATE-DATA THRU            08570099
085800                               4200-EXIT                          08580099
085900                                                                  08590099
086000              END-EVALUATE                                        08600099
086100                                                                  08610099
086200         WHEN XL023-XXT-PO-INBD-ALLOC                             08620099
086300              ADD 1 TO NUMBER-XXT-PO-INBD-ALLOC                   08630099
086400              EVALUATE TRUE                                       08640099
086500                  WHEN XL023-ON-RMS-ONLY                          08650099
086600                       ADD 1 TO NUMBER-PO-INBD-ALLOC-RMS          08660099
086700                       PERFORM 8000-WRITE-DETAIL-LINE             08670099
086800                                                                  08680099
086900                  WHEN XL023-ON-LEGACY-ONLY                       08690099
087000                       ADD 1 TO NUMBER-PO-INBD-ALLOC-LGCY         08700099
087100                       PERFORM 8000-WRITE-DETAIL-LINE             08710099
087200                                                                  08720099
087300                  WHEN XL023-ON-BOTH-RMS-LEGACY                   08730099
087400                       ADD 1 TO NUMBER-PO-INBD-ALLOC-DATA         08740099
087500                       PERFORM 4200-EVALUATE-DATA THRU            08750099
087600                               4200-EXIT                          08760099
087700                                                                  08770099
087800              END-EVALUATE                                        08780099
087900                                                                  08790099
088000         WHEN XL023-XXT-PO-OTBND-ALLOC                            08800099
088100              ADD 1 TO NUMBER-XXT-PO-OUTBND-ALLOC                 08810099
088200              EVALUATE TRUE                                       08820099
088300                  WHEN XL023-ON-RMS-ONLY                          08830099
088400                       ADD 1 TO NUMBER-PO-OUTBND-ALLOC-RMS        08840099
088500                       PERFORM 8000-WRITE-DETAIL-LINE             08850099
088600                                                                  08860099
088700                  WHEN XL023-ON-LEGACY-ONLY                       08870099
088800                       ADD 1 TO NUMBER-PO-OUTBND-ALLOC-LGCY       08880099
088900                       PERFORM 8000-WRITE-DETAIL-LINE             08890099
089000                                                                  08900099
089100                  WHEN XL023-ON-BOTH-RMS-LEGACY                   08910099
089200                       ADD 1 TO NUMBER-PO-OUTBND-ALLOC-DATA       08920099
089300                       PERFORM 4200-EVALUATE-DATA THRU            08930099
089400                               4200-EXIT                          08940099
089500                                                                  08950099
089600              END-EVALUATE                                        08960099
089700                                                                  08970099
089800         WHEN OTHER                                               08980099
089900              ADD 1 TO NUMBER-OTHER-STMTS                         08990099
090000                                                                  09000099
090100     END-EVALUATE.                                                09010099
090200                                                                  09020099
090300 2400-EXIT. EXIT.                                                 09030099
090400                                                                  09040099
090500****************************************************************  09050099
090600*                                                              *  09060099
090700*                                                              *  09070099
090800*                                                              *  09080099
090900****************************************************************  09090099
091000                                                                  09100099
091100 3000-WRITE-COUNTS.                                               09110099
091200                                                                  09120099
091300     IF NUMBER-XXT-PO           = 0 AND                           09130099
091400        NUMBER-PO-HDR-RMS       = 0 AND                           09140099
091500        NUMBER-PO-HDR-LGCY      = 0 AND                           09150099
091600        NUMBER-PO-HDR-DATA                                        09160099
091700        CONTINUE                                                  09170099
091800     ELSE                                                         09180099
091900        MOVE SPACES         TO WS-REPORT-RECORD                   09190099
092000        PERFORM 9600-WRITE-REPORT-RECORD THRU                     09200099
092100                9600-EXIT                                         09210099
092200        STRING  ' PO ---------------->'                           09220099
092300                ' - XLRD015 - 1 -'                                09230099
092400                WS-BLANK-03                                       09240099
092500                 NUMBER-PO-HDR-DATA           ' - DATA'           09250099
092600                WS-BLANK-03                                       09260099
092700                 NUMBER-PO-HDR-RMS            ' - RMS'            09270099
092800                WS-BLANK-03                                       09280099
092900                 NUMBER-PO-HDR-LGCY           ' - LGCY'           09290099
093000                WS-BLANK-03                                       09300099
093100                 NUMBER-XXT-PO                ' - TOTL'           09310099
093200                 DELIMITED BY SIZE                                09320099
093300                 INTO WS-REPORT-RECORD                            09330099
093400        PERFORM 9600-WRITE-REPORT-RECORD THRU                     09340099
093500                9600-EXIT                                         09350099
093600                                                                  09360099
093700        IF NUMBER-PO-HDR-DATA = 0                                 09370099
093800           CONTINUE                                               09380099
093900        ELSE                                                      09390099
094000           IF PO-NBR-DIFF           NOT = 0                       09400099
094100              STRING  WS-BLANK-30                                 09410099
094200                      'PO-NBR-DIFF         '                      09420099
094300                       PO-NBR-DIFF                                09430099
094400                       DELIMITED BY SIZE                          09440099
094500                       INTO WS-REPORT-RECORD                      09450099
094600              PERFORM 9600-WRITE-REPORT-RECORD THRU               09460099
094700                      9600-EXIT                                   09470099
094800           END-IF                                                 09480099
094900           IF DEPT-NBR-DIFF         NOT = 0                       09490099
095000              STRING  WS-BLANK-30                                 09500099
095100                      'DEPT-NBR-DIFF       '                      09510099
095200                       DEPT-NBR-DIFF                              09520099
095300                       DELIMITED BY SIZE                          09530099
095400                       INTO WS-REPORT-RECORD                      09540099
095500              PERFORM 9600-WRITE-REPORT-RECORD THRU               09550099
095600                      9600-EXIT                                   09560099
095700           END-IF                                                 09570099
095800           IF BYR-NBR-DIFF          NOT = 0                       09580099
095900              STRING  WS-BLANK-30                                 09590099
096000                      'BYR-NBR-DIFF        '                      09600099
096100                       BYR-NBR-DIFF                               09610099
096200                       DELIMITED BY SIZE                          09620099
096300                       INTO WS-REPORT-RECORD                      09630099
096400              PERFORM 9600-WRITE-REPORT-RECORD THRU               09640099
096500                      9600-EXIT                                   09650099
096600           END-IF                                                 09660099
096700           IF ENT-ID-DIFF           NOT = 0                       09670099
096800              STRING  WS-BLANK-30                                 09680099
096900                      'ENT-ID-DIFF         '                      09690099
097000                       ENT-ID-DIFF                                09700099
097100                       DELIMITED BY SIZE                          09710099
097200                       INTO WS-REPORT-RECORD                      09720099
097300              PERFORM 9600-WRITE-REPORT-RECORD THRU               09730099
097400                      9600-EXIT                                   09740099
097500           END-IF                                                 09750099
097600           IF AGNT-ENT-ID-DIFF      NOT = 0                       09760099
097700              STRING  WS-BLANK-30                                 09770099
097800                      'AGNT-ENT-ID-DIFF    '                      09780099
097900                       AGNT-ENT-ID-DIFF                           09790099
098000                       DELIMITED BY SIZE                          09800099
098100                       INTO WS-REPORT-RECORD                      09810099
098200              PERFORM 9600-WRITE-REPORT-RECORD THRU               09820099
098300                      9600-EXIT                                   09830099
098400           END-IF                                                 09840099
098500           IF CRE-DTE-DIFF          NOT = 0                       09850099
098600              STRING  WS-BLANK-30                                 09860099
098700                      'CRE-DTE-DIFF        '                      09870099
098800                       CRE-DTE-DIFF                               09880099
098900                       DELIMITED BY SIZE                          09890099
099000                       INTO WS-REPORT-RECORD                      09900099
099100              PERFORM 9600-WRITE-REPORT-RECORD THRU               09910099
099200                      9600-EXIT                                   09920099
099300           END-IF                                                 09930099
099400           IF NOT-BEF-DTE-DIFF      NOT = 0                       09940099
099500              STRING  WS-BLANK-30                                 09950099
099600                      'NOT-BEF-DTE-DIFF    '                      09960099
099700                       NOT-BEF-DTE-DIFF                           09970099
099800                       DELIMITED BY SIZE                          09980099
099900                       INTO WS-REPORT-RECORD                      09990099
100000              PERFORM 9600-WRITE-REPORT-RECORD THRU               10000099
100100                      9600-EXIT                                   10010099
100200           END-IF                                                 10020099
100300           IF NOT-AFT-DTE-DIFF     NOT = 0                        10030099
100400              STRING  WS-BLANK-30                                 10040099
100500                      'NOT-AFT-DTE-DIFF    '                      10050099
100600                       NOT-AFT-DTE-DIFF                           10060099
100700                       DELIMITED BY SIZE                          10070099
100800                       INTO WS-REPORT-RECORD                      10080099
100900              PERFORM 9600-WRITE-REPORT-RECORD THRU               10090099
101000                      9600-EXIT                                   10100099
101100           END-IF                                                 10110099
101200           IF OTB-EOW-DTE-DIFF      NOT = 0                       10120099
101300              STRING  WS-BLANK-30                                 10130099
101400                      'OTB-EOW-DTE-DIFF    '                      10140099
101500                       OTB-EOW-DTE-DIFF                           10150099
101600                       DELIMITED BY SIZE                          10160099
101700                       INTO WS-REPORT-RECORD                      10170099
101800              PERFORM 9600-WRITE-REPORT-RECORD THRU               10180099
101900                      9600-EXIT                                   10190099
102000           END-IF                                                 10200099
102100           IF CLOSE-DTE-DIFF        NOT = 0                       10210099
102200              STRING  WS-BLANK-30                                 10220099
102300                      'CLOSE-DTE-DIFF      '                      10230099
102400                       CLOSE-DTE-DIFF                             10240099
102500                       DELIMITED BY SIZE                          10250099
102600                       INTO WS-REPORT-RECORD                      10260099
102700              PERFORM 9600-WRITE-REPORT-RECORD THRU               10270099
102800                      9600-EXIT                                   10280099
102900           END-IF                                                 10290099
103000           IF PAYT-TERM-ID-DIFF     NOT = 0                       10300099
103100              STRING  WS-BLANK-30                                 10310099
103200                      'PAYT-TERM-ID-DIFF   '                      10320099
103300                       PAYT-TERM-ID-DIFF                          10330099
103400                       DELIMITED BY SIZE                          10340099
103500                       INTO WS-REPORT-RECORD                      10350099
103600              PERFORM 9600-WRITE-REPORT-RECORD THRU               10360099
103700                      9600-EXIT                                   10370099
103800           END-IF                                                 10380099
103900           IF FRGT-TERM-ID-DIFF     NOT = 0                       10390099
104000              STRING  WS-BLANK-30                                 10400099
104100                      'FRGT-TERM-ID-DIFF   '                      10410099
104200                       FRGT-TERM-ID-DIFF                          10420099
104300                       DELIMITED BY SIZE                          10430099
104400                       INTO WS-REPORT-RECORD                      10440099
104500              PERFORM 9600-WRITE-REPORT-RECORD THRU               10450099
104600                      9600-EXIT                                   10460099
104700           END-IF                                                 10470099
104800           IF STAT-CDE-DIFF         NOT = 0                       10480099
104900              STRING  WS-BLANK-30                                 10490099
105000                      'STAT-CDE-DIFF       '                      10500099
105100                       STAT-CDE-DIFF                              10510099
105200                       DELIMITED BY SIZE                          10520099
105300                       INTO WS-REPORT-RECORD                      10530099
105400              PERFORM 9600-WRITE-REPORT-RECORD THRU               10540099
105500                      9600-EXIT                                   10550099
105600           END-IF                                                 10560099
105700           IF ORIG-PO-APVL-DTE-DIFF NOT = 0                       10570099
105800              STRING  WS-BLANK-30                                 10580099
105900                      'ORIG-PO-APVL-DTE-DIFF '                    10590099
106000                       ORIG-PO-APVL-DTE-DIFF                      10600099
106100                       DELIMITED BY SIZE                          10610099
106200                       INTO WS-REPORT-RECORD                      10620099
106300              PERFORM 9600-WRITE-REPORT-RECORD THRU               10630099
106400                      9600-EXIT                                   10640099
106500           END-IF                                                 10650099
106600           IF ORIG-APP-BY-USR-ID-DIFF  NOT = 0                    10660099
106700              STRING  WS-BLANK-30                                 10670099
106800                      'ORIG-APP-BY-USR-ID-DIFF '                  10680099
106900                       ORIG-APP-BY-USR-ID-DIFF                    10690099
107000                       DELIMITED BY SIZE                          10700099
107100                       INTO WS-REPORT-RECORD                      10710099
107200              PERFORM 9600-WRITE-REPORT-RECORD THRU               10720099
107300                      9600-EXIT                                   10730099
107400           END-IF                                                 10740099
107500           IF EDI-SNT-IND-DIFF      NOT = 0                       10750099
107600              STRING  WS-BLANK-30                                 10760099
107700                      'EDI-SNT-IND-DIFF    '                      10770099
107800                       EDI-SNT-IND-DIFF                           10780099
107900                       DELIMITED BY SIZE                          10790099
108000                       INTO WS-REPORT-RECORD                      10800099
108100              PERFORM 9600-WRITE-REPORT-RECORD THRU               10810099
108200                      9600-EXIT                                   10820099
108300           END-IF                                                 10830099
108400           IF EDI-PO-IND-DIFF       NOT = 0                       10840099
108500              STRING  WS-BLANK-30                                 10850099
108600                      'EDI-PO-IND-DIFF     '                      10860099
108700                       EDI-PO-IND-DIFF                            10870099
108800                       DELIMITED BY SIZE                          10880099
108900                       INTO WS-REPORT-RECORD                      10890099
109000              PERFORM 9600-WRITE-REPORT-RECORD THRU               10900099
109100                      9600-EXIT                                   10910099
109200           END-IF                                                 10920099
109300           IF IMPRT-PO-IND-DIFF     NOT = 0                       10930099
109400              STRING  WS-BLANK-30                                 10940099
109500                      'IMPRT-PO-IND-DIFF   '                      10950099
109600                       IMPRT-PO-IND-DIFF                          10960099
109700                       DELIMITED BY SIZE                          10970099
109800                       INTO WS-REPORT-RECORD                      10980099
109900              PERFORM 9600-WRITE-REPORT-RECORD THRU               10990099
110000                      9600-EXIT                                   11000099
110100           END-IF                                                 11010099
110200           IF FCTRY-NM-DIFF         NOT = 0                       11020099
110300              STRING  WS-BLANK-30                                 11030099
110400                      'FCTRY-NM-DIFF       '                      11040099
110500                       FCTRY-NM-DIFF                              11050099
110600                       DELIMITED BY SIZE                          11060099
110700                       INTO WS-REPORT-RECORD                      11070099
110800              PERFORM 9600-WRITE-REPORT-RECORD THRU               11080099
110900                      9600-EXIT                                   11090099
111000           END-IF                                                 11100099
111100           IF POE-CDE-DIFF          NOT = 0                       11110099
111200              STRING  WS-BLANK-30                                 11120099
111300                      'POE-CDE-DIFF        '                      11130099
111400                       POE-CDE-DIFF                               11140099
111500                       DELIMITED BY SIZE                          11150099
111600                       INTO WS-REPORT-RECORD                      11160099
111700              PERFORM 9600-WRITE-REPORT-RECORD THRU               11170099
111800                      9600-EXIT                                   11180099
111900           END-IF                                                 11190099
112000           IF FOB-CDE-DIFF          NOT = 0                       11200099
112100              STRING  WS-BLANK-30                                 11210099
112200                      'FOB-CDE-DIFF        '                      11220099
112300                       FOB-CDE-DIFF                               11230099
112400                       DELIMITED BY SIZE                          11240099
112500                       INTO WS-REPORT-RECORD                      11250099
112600              PERFORM 9600-WRITE-REPORT-RECORD THRU               11260099
112700                      9600-EXIT                                   11270099
112800           END-IF                                                 11280099
112900           IF PO-TYP-CDE-DIFF       NOT = 0                       11290099
113000              STRING  WS-BLANK-30                                 11300099
113100                      'PO-TYP-CDE-DIFF     '                      11310099
113200                       PO-TYP-CDE-DIFF                            11320099
113300                       DELIMITED BY SIZE                          11330099
113400                       INTO WS-REPORT-RECORD                      11340099
113500              PERFORM 9600-WRITE-REPORT-RECORD THRU               11350099
113600                      9600-EXIT                                   11360099
113700           END-IF                                                 11370099
113800           IF PK-BY-STR-IND-DIFF    NOT = 0                       11380099
113900              STRING  WS-BLANK-30                                 11390099
114000                      'PK-BY-STR-IND-DIFF  '                      11400099
114100                       PK-BY-STR-IND-DIFF                         11410099
114200                       DELIMITED BY SIZE                          11420099
114300                       INTO WS-REPORT-RECORD                      11430099
114400              PERFORM 9600-WRITE-REPORT-RECORD THRU               11440099
114500                      9600-EXIT                                   11450099
114600           END-IF                                                 11460099
114700           IF CONSLR-ACTL-DTE-DIFF  NOT = 0                       11470099
114800              STRING  WS-BLANK-30                                 11480099
114900                      'CONSLR-ACTL-DTE-DIFF '                     11490099
115000                       CONSLR-ACTL-DTE-DIFF                       11500099
115100                       DELIMITED BY SIZE                          11510099
115200                       INTO WS-REPORT-RECORD                      11520099
115300              PERFORM 9600-WRITE-REPORT-RECORD THRU               11530099
115400                      9600-EXIT                                   11540099
115500           END-IF                                                 11550099
115600           IF CONSLR-REQR-DTE-DIFF  NOT = 0                       11560099
115700              STRING  WS-BLANK-30                                 11570099
115800                      'CONSLR-REQR-DTE-DIFF '                     11580099
115900                       CONSLR-REQR-DTE-DIFF                       11590099
116000                       DELIMITED BY SIZE                          11600099
116100                       INTO WS-REPORT-RECORD                      11610099
116200              PERFORM 9600-WRITE-REPORT-RECORD THRU               11620099
116300                      9600-EXIT                                   11630099
116400           END-IF                                                 11640099
116500           IF CONSLR-RLSE-CDE-DIFF  NOT = 0                       11650099
116600              STRING  WS-BLANK-30                                 11660099
116700                      'CONSLR-RLSE-CDE-DIFF '                     11670099
116800                       CONSLR-RLSE-CDE-DIFF                       11680099
116900                       DELIMITED BY SIZE                          11690099
117000                       INTO WS-REPORT-RECORD                      11700099
117100              PERFORM 9600-WRITE-REPORT-RECORD THRU               11710099
117200                      9600-EXIT                                   11720099
117300           END-IF                                                 11730099
117400           IF TKT-MKR-ACTL-DTE-DIFF NOT = 0                       11740099
117500              STRING  WS-BLANK-30                                 11750099
117600                      'TKT-MKR-ACTL-DTE-DIFF '                    11760099
117700                       TKT-MKR-ACTL-DTE-DIFF                      11770099
117800                       DELIMITED BY SIZE                          11780099
117900                       INTO WS-REPORT-RECORD                      11790099
118000              PERFORM 9600-WRITE-REPORT-RECORD THRU               11800099
118100                      9600-EXIT                                   11810099
118200           END-IF                                                 11820099
118300           IF TKT-MKR-REQR-DTE-DIFF NOT = 0                       11830099
118400              STRING  WS-BLANK-30                                 11840099
118500                      'TKT-MKR-REQR-DTE-DIFF '                    11850099
118600                       TKT-MKR-REQR-DTE-DIFF                      11860099
118700                       DELIMITED BY SIZE                          11870099
118800                       INTO WS-REPORT-RECORD                      11880099
118900              PERFORM 9600-WRITE-REPORT-RECORD THRU               11890099
119000                      9600-EXIT                                   11900099
119100           END-IF                                                 11910099
119200           IF TKT-MKR-RLSE-CDE-DIFF NOT = 0                       11920099
119300              STRING  WS-BLANK-30                                 11930099
119400                      'TKT-MKR-RLSE-CDE-DIFF '                    11940099
119500                       TKT-MKR-RLSE-CDE-DIFF                      11950099
119600                       DELIMITED BY SIZE                          11960099
119700                       INTO WS-REPORT-RECORD                      11970099
119800              PERFORM 9600-WRITE-REPORT-RECORD THRU               11980099
119900                      9600-EXIT                                   11990099
120000           END-IF                                                 12000099
120100           IF RLSE-DTE-DIFF         NOT = 0                       12010099
120200              STRING  WS-BLANK-30                                 12020099
120300                      'RLSE-DTE-DIFF       '                      12030099
120400                       RLSE-DTE-DIFF                              12040099
120500                       DELIMITED BY SIZE                          12050099
120600                       INTO WS-REPORT-RECORD                      12060099
120700              PERFORM 9600-WRITE-REPORT-RECORD THRU               12070099
120800                      9600-EXIT                                   12080099
120900           END-IF                                                 12090099
121000           IF FRST-FCTRY-DTE-DIFF   NOT = 0                       12100099
121100              STRING  WS-BLANK-30                                 12110099
121200                      'FRST-FCTRY-DTE-DIFF '                      12120099
121300                       FRST-FCTRY-DTE-DIFF                        12130099
121400                       DELIMITED BY SIZE                          12140099
121500                       INTO WS-REPORT-RECORD                      12150099
121600              PERFORM 9600-WRITE-REPORT-RECORD THRU               12160099
121700                      9600-EXIT                                   12170099
121800           END-IF                                                 12180099
121900           IF LAST-FCTRY-DTE-DIFF   NOT = 0                       12190099
122000              STRING  WS-BLANK-30                                 12200099
122100                      'LAST-FCTRY-DTE-DIFF '                      12210099
122200                       LAST-FCTRY-DTE-DIFF                        12220099
122300                       DELIMITED BY SIZE                          12230099
122400                       INTO WS-REPORT-RECORD                      12240099
122500              PERFORM 9600-WRITE-REPORT-RECORD THRU               12250099
122600                      9600-EXIT                                   12260099
122700           END-IF                                                 12270099
122800           IF DIR-STR-IND-DIFF      NOT = 0                       12280099
122900              STRING  WS-BLANK-30                                 12290099
123000                      'DIR-STR-IND-DIFF    '                      12300099
123100                       DIR-STR-IND-DIFF                           12310099
123200                       DELIMITED BY SIZE                          12320099
123300                       INTO WS-REPORT-RECORD                      12330099
123400              PERFORM 9600-WRITE-REPORT-RECORD THRU               12340099
123500                      9600-EXIT                                   12350099
123600           END-IF                                                 12360099
123700           IF EXTD-NOT-AFT-DTE-DIFF NOT = 0                       12370099
123800              STRING  WS-BLANK-30                                 12380099
123900                      'EXTD-NOT-AFT-DTE-DIFF '                    12390099
124000                       EXTD-NOT-AFT-DTE-DIFF                      12400099
124100                       DELIMITED BY SIZE                          12410099
124200                       INTO WS-REPORT-RECORD                      12420099
124300              PERFORM 9600-WRITE-REPORT-RECORD THRU               12430099
124400                      9600-EXIT                                   12440099
124500           END-IF                                                 12450099
124600           IF HNG-IND-DIFF          NOT = 0                       12460099
124700              STRING  WS-BLANK-30                                 12470099
124800                      'HNG-IND-DIFF        '                      12480099
124900                       HNG-IND-DIFF                               12490099
125000                       DELIMITED BY SIZE                          12500099
125100                       INTO WS-REPORT-RECORD                      12510099
125200              PERFORM 9600-WRITE-REPORT-RECORD THRU               12520099
125300                      9600-EXIT                                   12530099
125400           END-IF                                                 12540099
125500           IF NW-STR-ORD-IND-DIFF  NOT = 0                        12550099
125600              STRING  WS-BLANK-30                                 12560099
125700                      'NW-STR-ORD-IND-DIFF '                      12570099
125800                       NW-STR-ORD-IND-DIFF                        12580099
125900                       DELIMITED BY SIZE                          12590099
126000                       INTO WS-REPORT-RECORD                      12600099
126100              PERFORM 9600-WRITE-REPORT-RECORD THRU               12610099
126200                      9600-EXIT                                   12620099
126300           END-IF                                                 12630099
126400           IF PKGNG-CDE-DIFF        NOT = 0                       12640099
126500              STRING  WS-BLANK-30                                 12650099
126600                      'PKGNG-CDE-DIFF      '                      12660099
126700                       PKGNG-CDE-DIFF                             12670099
126800                       DELIMITED BY SIZE                          12680099
126900                       INTO WS-REPORT-RECORD                      12690099
127000              PERFORM 9600-WRITE-REPORT-RECORD THRU               12700099
127100                      9600-EXIT                                   12710099
127200           END-IF                                                 12720099
127300           IF PKGNG-DESC-DIFF       NOT = 0                       12730099
127400              STRING  WS-BLANK-30                                 12740099
127500                      'PKGNG-DESC-DIFF      '                     12750099
127600                       PKGNG-DESC-DIFF                            12760099
127700                       DELIMITED BY SIZE                          12770099
127800                       INTO WS-REPORT-RECORD                      12780099
127900              PERFORM 9600-WRITE-REPORT-RECORD THRU               12790099
128000                      9600-EXIT                                   12800099
128100           END-IF                                                 12810099
128200           IF PTKT-LDTM-DAYS-QTY-DIFF NOT = 0                     12820099
128300              STRING  WS-BLANK-30                                 12830099
128400                      'PTKT-LDTM-DAYS-QTY-DIFF '                  12840099
128500                       PTKT-LDTM-DAYS-QTY-DIFF                    12850099
128600                       DELIMITED BY SIZE                          12860099
128700                       INTO WS-REPORT-RECORD                      12870099
128800              PERFORM 9600-WRITE-REPORT-RECORD THRU               12880099
128900                      9600-EXIT                                   12890099
129000           END-IF                                                 12900099
129100           IF SEASET-SHRT-DESC-DIFF NOT = 0                       12910099
129200              STRING  WS-BLANK-30                                 12920099
129300                      'SEASET-SHRT-DESC-DIFF '                    12930099
129400                       SEASET-SHRT-DESC-DIFF                      12940099
129500                       DELIMITED BY SIZE                          12950099
129600                       INTO WS-REPORT-RECORD                      12960099
129700              PERFORM 9600-WRITE-REPORT-RECORD THRU               12970099
129800                      9600-EXIT                                   12980099
129900           END-IF                                                 12990099
130000           IF SEASET-YR-DIFF        NOT = 0                       13000099
130100              STRING  WS-BLANK-30                                 13010099
130200                      'SEASET-YR-DIFF      '                      13020099
130300                       SEASET-YR-DIFF                             13030099
130400                       DELIMITED BY SIZE                          13040099
130500                       INTO WS-REPORT-RECORD                      13050099
130600              PERFORM 9600-WRITE-REPORT-RECORD THRU               13060099
130700                      9600-EXIT                                   13070099
130800           END-IF                                                 13080099
130900           IF CRE-BY-USR-ID-DIFF    NOT = 0                       13090099
131000              STRING  WS-BLANK-30                                 13100099
131100                      'CRE-BY-USR-ID-DIFF  '                      13110099
131200                       CRE-BY-USR-ID-DIFF                         13120099
131300                       DELIMITED BY SIZE                          13130099
131400                       INTO WS-REPORT-RECORD                      13140099
131500              PERFORM 9600-WRITE-REPORT-RECORD THRU               13150099
131600                      9600-EXIT                                   13160099
131700           END-IF                                                 13170099
131800           IF PTKT-IND-DIFF         NOT = 0                       13180099
131900              STRING  WS-BLANK-30                                 13190099
132000                      'PTKT-IND-DIFF       '                      13200099
132100                       PTKT-IND-DIFF                              13210099
132200                       DELIMITED BY SIZE                          13220099
132300                       INTO WS-REPORT-RECORD                      13230099
132400              PERFORM 9600-WRITE-REPORT-RECORD THRU               13240099
132500                      9600-EXIT                                   13250099
132600           END-IF                                                 13260099
132700           IF C-O-PROD-CDE-DIFF     NOT = 0                       13270099
132800              STRING  WS-BLANK-30                                 13280099
132900                      'C-O-PROD-CDE-DIFF   '                      13290099
133000                       C-O-PROD-CDE-DIFF                          13300099
133100                       DELIMITED BY SIZE                          13310099
133200                       INTO WS-REPORT-RECORD                      13320099
133300              PERFORM 9600-WRITE-REPORT-RECORD THRU               13330099
133400                      9600-EXIT                                   13340099
133500           END-IF                                                 13350099
133600           IF AGNT-OFC-CNTRY-CDE-DIFF NOT = 0                     13360099
133700              STRING  WS-BLANK-30                                 13370099
133800                      'AGNT-OFC-CNTRY-CDE-DIFF '                  13380099
133900                       AGNT-OFC-CNTRY-CDE-DIFF                    13390099
134000                       DELIMITED BY SIZE                          13400099
134100                       INTO WS-REPORT-RECORD                      13410099
134200              PERFORM 9600-WRITE-REPORT-RECORD THRU               13420099
134300                      9600-EXIT                                   13430099
134400           END-IF                                                 13440099
134500           IF UNT-PER-CBMT-QTY-DIFF NOT = 0                       13450099
134600              STRING  WS-BLANK-30                                 13460099
134700                      'UNT-PER-CBMT-QTY-DIFF '                    13470099
134800                       UNT-PER-CBMT-QTY-DIFF                      13480099
134900                       DELIMITED BY SIZE                          13490099
135000                       INTO WS-REPORT-RECORD                      13500099
135100              PERFORM 9600-WRITE-REPORT-RECORD THRU               13510099
135200                      9600-EXIT                                   13520099
135300           END-IF                                                 13530099
135400           IF QTA-CTG-CDE-DIFF      NOT = 0                       13540099
135500              STRING  WS-BLANK-30                                 13550099
135600                      'QTA-CTG-CDE-DIFF    '                      13560099
135700                       QTA-CTG-CDE-DIFF                           13570099
135800                       DELIMITED BY SIZE                          13580099
135900                       INTO WS-REPORT-RECORD                      13590099
136000              PERFORM 9600-WRITE-REPORT-RECORD THRU               13600099
136100                      9600-EXIT                                   13610099
136200           END-IF                                                 13620099
136300           IF IMPRT-VND-ID-DIFF     NOT = 0                       13630099
136400              STRING  WS-BLANK-30                                 13640099
136500                      'IMPRT-VND-ID-DIFF    '                     13650099
136600                       IMPRT-VND-ID-DIFF                          13660099
136700                       DELIMITED BY SIZE                          13670099
136800                       INTO WS-REPORT-RECORD                      13680099
136900              PERFORM 9600-WRITE-REPORT-RECORD THRU               13690099
137000                      9600-EXIT                                   13700099
137100           END-IF                                                 13710099
137200           IF IMPRT-FCTRY-ID-DIFF   NOT = 0                       13720099
137300              STRING  WS-BLANK-30                                 13730099
137400                      'IMPRT-FCTRY-ID-DIFF  '                     13740099
137500                       IMPRT-FCTRY-ID-DIFF                        13750099
137600                       DELIMITED BY SIZE                          13760099
137700                       INTO WS-REPORT-RECORD                      13770099
137800              PERFORM 9600-WRITE-REPORT-RECORD THRU               13780099
137900                      9600-EXIT                                   13790099
138000           END-IF                                                 13800099
138100           IF IMPRT-VND-NM-DIFF     NOT = 0                       13810099
138200              STRING  WS-BLANK-30                                 13820099
138300                      'IMPRT-VND-NM-DIFF   '                      13830099
138400                       IMPRT-VND-NM-DIFF                          13840099
138500                       DELIMITED BY SIZE                          13850099
138600                       INTO WS-REPORT-RECORD                      13860099
138700              PERFORM 9600-WRITE-REPORT-RECORD THRU               13870099
138800                      9600-EXIT                                   13880099
138900           END-IF                                                 13890099
139000           IF IMPRT-FCTRY-NM-DIFF   NOT = 0                       13900099
139100              STRING  WS-BLANK-30                                 13910099
139200                      'IMPRT-FCTRY-NM-DIFF '                      13920099
139300                       IMPRT-FCTRY-NM-DIFF                        13930099
139400                       DELIMITED BY SIZE                          13940099
139500                       INTO WS-REPORT-RECORD                      13950099
139600              PERFORM 9600-WRITE-REPORT-RECORD THRU               13960099
139700                      9600-EXIT                                   13970099
139800           END-IF                                                 13980099
139900           IF DERVD-LBL-TYP-CDE-DIFF NOT = 0                      13990099
140000              STRING  WS-BLANK-30                                 14000099
140100                      'DERVD-LBL-TYP-CDE-DIFF '                   14010099
140200                       DERVD-LBL-TYP-CDE-DIFF                     14020099
140300                       DELIMITED BY SIZE                          14030099
140400                       INTO WS-REPORT-RECORD                      14040099
140500              PERFORM 9600-WRITE-REPORT-RECORD THRU               14050099
140600                      9600-EXIT                                   14060099
140700           END-IF                                                 14070099
140800*  WR33239                                                        14080099
140900           IF DELY-ID-DIFF NOT = 0                                14090099
141000              STRING  WS-BLANK-30                                 14100099
141100                      'DELY-ID-DIFF '                             14110099
141110                       DELY-ID-DIFF                               14111099
141120                       DELIMITED BY SIZE                          14112099
141130                       INTO WS-REPORT-RECORD                      14113099
141140              PERFORM 9600-WRITE-REPORT-RECORD THRU               14114099
141150                      9600-EXIT                                   14115099
141160           END-IF                                                 14116099
141170           IF PO-SHRT-CYC-IND-DIFF NOT = 0                        14117099
141180              STRING  WS-BLANK-30                                 14118099
141190                      'PO-SHRT-CYC-IND-DIFF '                     14119099
141191                       PO-SHRT-CYC-IND-DIFF                       14119199
141192                       DELIMITED BY SIZE                          14119299
141193                       INTO WS-REPORT-RECORD                      14119399
141194              PERFORM 9600-WRITE-REPORT-RECORD THRU               14119499
141195                      9600-EXIT                                   14119599
141196           END-IF                                                 14119699
141197        END-IF                                                    14119799
141198     END-IF.                                                      14119899
141199                                                                  14119999
141200******************************************************************14120099
141300     IF NUMBER-XXT-PO-INSTR     = 0 AND                           14130099
141400        NUMBER-PO-INSTR-RMS     = 0 AND                           14140099
141500        NUMBER-PO-INSTR-LGCY    = 0 AND                           14150099
141600        NUMBER-PO-INSTR-DATA                                      14160099
141700        CONTINUE                                                  14170099
141800     ELSE                                                         14180099
141900        MOVE SPACES         TO WS-REPORT-RECORD                   14190099
142000        PERFORM 9600-WRITE-REPORT-RECORD THRU                     14200099
142100                9600-EXIT                                         14210099
142200        STRING  ' PO-INSTR ---------->'                           14220099
142300                ' - XLRD016 - 2 -'                                14230099
142400                WS-BLANK-03                                       14240099
142500                 NUMBER-PO-INSTR-DATA         ' - DATA'           14250099
142600                WS-BLANK-03                                       14260099
142700                 NUMBER-PO-INSTR-RMS          ' - RMS'            14270099
142800                WS-BLANK-03                                       14280099
142900                 NUMBER-PO-INSTR-LGCY         ' - LGCY'           14290099
143000                WS-BLANK-03                                       14300099
143100                 NUMBER-XXT-PO-INSTR          ' - TOTL'           14310099
143200                 DELIMITED BY SIZE                                14320099
143300                 INTO WS-REPORT-RECORD                            14330099
143400              PERFORM 9600-WRITE-REPORT-RECORD THRU               14340099
143500                      9600-EXIT                                   14350099
143600                                                                  14360099
143700     END-IF.                                                      14370099
143800                                                                  14380099
143900        IF NUMBER-PO-INSTR-DATA = 0                               14390099
144000           CONTINUE                                               14400099
144100        ELSE                                                      14410099
144200           IF IN-PO-NBR-DIFF              NOT = 0                 14420099
144300              STRING  WS-BLANK-30                                 14430099
144400                      'IN-PO-NBR-DIFF          '                  14440099
144500                       IN-PO-NBR-DIFF                             14450099
144600                       DELIMITED BY SIZE                          14460099
144700                       INTO WS-REPORT-RECORD                      14470099
144800              PERFORM 9600-WRITE-REPORT-RECORD THRU               14480099
144900                      9600-EXIT                                   14490099
145000           END-IF                                                 14500099
145100           IF IN-RECIP-CDE-DIFF           NOT = 0                 14510099
145200              STRING  WS-BLANK-30                                 14520099
145300                      'IN-RECIP-CDE-DIFF       '                  14530099
145400                       IN-RECIP-CDE-DIFF                          14540099
145500                       DELIMITED BY SIZE                          14550099
145600                       INTO WS-REPORT-RECORD                      14560099
145700              PERFORM 9600-WRITE-REPORT-RECORD THRU               14570099
145800                      9600-EXIT                                   14580099
145900           END-IF                                                 14590099
146000           IF IN-INSTR-DESC-DIFF           NOT = 0                14600099
146100              STRING  WS-BLANK-30                                 14610099
146200                      'IN-INSTR-DESC-DIFF      '                  14620099
146300                       IN-INSTR-DESC-DIFF                         14630099
146400                       DELIMITED BY SIZE                          14640099
146500                       INTO WS-REPORT-RECORD                      14650099
146600              PERFORM 9600-WRITE-REPORT-RECORD THRU               14660099
146700                      9600-EXIT                                   14670099
146800           END-IF                                                 14680099
146900     END-IF.                                                      14690099
147000                                                                  14700099
147100******************************************************************14710099
147200                                                                  14720099
147300     IF NUMBER-XXT-PO-DISC      = 0 AND                           14730099
147400        NUMBER-PO-DISC-RMS      = 0 AND                           14740099
147500        NUMBER-PO-DISC-LGCY     = 0 AND                           14750099
147600        NUMBER-PO-DISC-DATA                                       14760099
147700        CONTINUE                                                  14770099
147800     ELSE                                                         14780099
147900        MOVE SPACES         TO WS-REPORT-RECORD                   14790099
148000        PERFORM 9600-WRITE-REPORT-RECORD THRU                     14800099
148100                9600-EXIT                                         14810099
148200        STRING  ' PO-DISC ----------->'                           14820099
148300                ' - XLRD017 - 3 -'                                14830099
148400                WS-BLANK-03                                       14840099
148500                 NUMBER-PO-DISC-DATA          ' - DATA'           14850099
148600                WS-BLANK-03                                       14860099
148700                 NUMBER-PO-DISC-RMS           ' - RMS'            14870099
148800                WS-BLANK-03                                       14880099
148900                 NUMBER-PO-DISC-LGCY          ' - LGCY'           14890099
149000                WS-BLANK-03                                       14900099
149100                 NUMBER-XXT-PO-DISC           ' - TOTL'           14910099
149200                 DELIMITED BY SIZE                                14920099
149300                 INTO WS-REPORT-RECORD                            14930099
149400              PERFORM 9600-WRITE-REPORT-RECORD THRU               14940099
149500                      9600-EXIT                                   14950099
149600                                                                  14960099
149700                                                                  14970099
149800        IF NUMBER-PO-DISC-DATA = 0                                14980099
149900           CONTINUE                                               14990099
150000        ELSE                                                      15000099
150100           IF DI-PO-NBR-DIFF              NOT = 0                 15010099
150200              STRING  WS-BLANK-30                                 15020099
150300                      'DI-PO-NBR-DIFF        '                    15030099
150400                       DI-PO-NBR-DIFF                             15040099
150500                       DELIMITED BY SIZE                          15050099
150600                       INTO WS-REPORT-RECORD                      15060099
150700              PERFORM 9600-WRITE-REPORT-RECORD THRU               15070099
150800                      9600-EXIT                                   15080099
150900           END-IF                                                 15090099
151000           IF DI-DL-ID-DIFF               NOT = 0                 15100099
151100              STRING  WS-BLANK-30                                 15110099
151200                      'DI-DL-ID-DIFF         '                    15120099
151300                       DI-DL-ID-DIFF                              15130099
151400                       DELIMITED BY SIZE                          15140099
151500                       INTO WS-REPORT-RECORD                      15150099
151600              PERFORM 9600-WRITE-REPORT-RECORD THRU               15160099
151700                      9600-EXIT                                   15170099
151800           END-IF                                                 15180099
151900           IF DI-DL-DTL-ID-DIFF           NOT = 0                 15190099
152000              STRING  WS-BLANK-30                                 15200099
152100                      'DI-DL-DTL-ID-DIFF     '                    15210099
152200                       DI-DL-DTL-ID-DIFF                          15220099
152300                       DELIMITED BY SIZE                          15230099
152400                       INTO WS-REPORT-RECORD                      15240099
152500              PERFORM 9600-WRITE-REPORT-RECORD THRU               15250099
152600                      9600-EXIT                                   15260099
152700           END-IF                                                 15270099
152800           IF DI-DISC-TYPE-CDE-DIFF       NOT = 0                 15280099
152900              STRING  WS-BLANK-30                                 15290099
153000                      'DI-DISC-TYPE-CDE-DIFF '                    15300099
153100                       DI-DISC-TYPE-CDE-DIFF                      15310099
153200                       DELIMITED BY SIZE                          15320099
153300                       INTO WS-REPORT-RECORD                      15330099
153400              PERFORM 9600-WRITE-REPORT-RECORD THRU               15340099
153500                      9600-EXIT                                   15350099
153600           END-IF                                                 15360099
153700           IF DI-EXTD-DAYS-QTY-DIFF       NOT = 0                 15370099
153800              STRING  WS-BLANK-30                                 15380099
153900                      'DI-EXTD-DAYS-QTY-DIFF '                    15390099
154000                       DI-EXTD-DAYS-QTY-DIFF                      15400099
154100                       DELIMITED BY SIZE                          15410099
154200                       INTO WS-REPORT-RECORD                      15420099
154300              PERFORM 9600-WRITE-REPORT-RECORD THRU               15430099
154400                      9600-EXIT                                   15440099
154500           END-IF                                                 15450099
154600           IF DI-DISC-PCT-DIFF            NOT = 0                 15460099
154700              STRING  WS-BLANK-30                                 15470099
154800                      'DI-DISC-PCT-DIFF        '                  15480099
154900                       DI-DISC-PCT-DIFF                           15490099
155000                       DELIMITED BY SIZE                          15500099
155100                       INTO WS-REPORT-RECORD                      15510099
155200              PERFORM 9600-WRITE-REPORT-RECORD THRU               15520099
155300                      9600-EXIT                                   15530099
155400           END-IF                                                 15540099
155500           IF DI-TOT-DISC-AMT-DIFF        NOT = 0                 15550099
155600              STRING  WS-BLANK-30                                 15560099
155700                      'DI-TOT-DISC-AMT-DIFF  '                    15570099
155800                       DI-TOT-DISC-AMT-DIFF                       15580099
155900                       DELIMITED BY SIZE                          15590099
156000                       INTO WS-REPORT-RECORD                      15600099
156100              PERFORM 9600-WRITE-REPORT-RECORD THRU               15610099
156200                      9600-EXIT                                   15620099
156300           END-IF                                                 15630099
156400     END-IF.                                                      15640099
156500                                                                  15650099
156600     IF NUMBER-XXT-PO-SKU       = 0 AND                           15660099
156700        NUMBER-PO-SKU-RMS       = 0 AND                           15670099
156800        NUMBER-PO-SKU-LGCY      = 0 AND                           15680099
156900        NUMBER-PO-SKU-DATA                                        15690099
157000        CONTINUE                                                  15700099
157100     ELSE                                                         15710099
157200        MOVE SPACES         TO WS-REPORT-RECORD                   15720099
157300        PERFORM 9600-WRITE-REPORT-RECORD THRU                     15730099
157400                9600-EXIT                                         15740099
157500        STRING  ' PO-SKU ------------>'                           15750099
157600                ' - XLRD018 - 4 -'                                15760099
157700                WS-BLANK-03                                       15770099
157800                 NUMBER-PO-SKU-DATA           ' - DATA'           15780099
157900                WS-BLANK-03                                       15790099
158000                 NUMBER-PO-SKU-RMS            ' - RMS'            15800099
158100                WS-BLANK-03                                       15810099
158200                 NUMBER-PO-SKU-LGCY           ' - LGCY'           15820099
158300                WS-BLANK-03                                       15830099
158400                 NUMBER-XXT-PO-SKU            ' - TOTL'           15840099
158500                 DELIMITED BY SIZE                                15850099
158600                 INTO WS-REPORT-RECORD                            15860099
158700              PERFORM 9600-WRITE-REPORT-RECORD THRU               15870099
158800                      9600-EXIT                                   15880099
158900                                                                  15890099
159000                                                                  15900099
159100        IF NUMBER-PO-SKU-DATA = 0                                 15910099
159200           CONTINUE                                               15920099
159300        ELSE                                                      15930099
159400           IF SK-PO-NBR-DIFF               NOT = 0                15940099
159500              STRING  WS-BLANK-30                                 15950099
159600                   'SK-PO-NBR-DIFF         '                      15960099
159700                    SK-PO-NBR-DIFF                                15970099
159800                       DELIMITED BY SIZE                          15980099
159900                       INTO WS-REPORT-RECORD                      15990099
160000              PERFORM 9600-WRITE-REPORT-RECORD THRU               16000099
160100                      9600-EXIT                                   16010099
160200           END-IF                                                 16020099
160300           IF SK-SKU-NBR-DIFF               NOT = 0               16030099
160400              STRING  WS-BLANK-30                                 16040099
160500                   'SK-SKU-NBR-DIFF        '                      16050099
160600                    SK-SKU-NBR-DIFF                               16060099
160700                       DELIMITED BY SIZE                          16070099
160800                       INTO WS-REPORT-RECORD                      16080099
160900              PERFORM 9600-WRITE-REPORT-RECORD THRU               16090099
161000                      9600-EXIT                                   16100099
161100           END-IF                                                 16110099
161200           IF SK-UNT-COST-AMT-DIFF         NOT = 0                16120099
161300              STRING  WS-BLANK-30                                 16130099
161400                   'SK-UNT-COST-AMT-DIFF   '                      16140099
161500                    SK-UNT-COST-AMT-DIFF                          16150099
161600                       DELIMITED BY SIZE                          16160099
161700                       INTO WS-REPORT-RECORD                      16170099
161800              PERFORM 9600-WRITE-REPORT-RECORD THRU               16180099
161900                      9600-EXIT                                   16190099
162000           END-IF                                                 16200099
162100                                                                  16210099
162200           IF SK-FRST-COST-AMT-DIFF        NOT = 0                16220099
162300              STRING  WS-BLANK-30                                 16230099
162400                   'SK-FRST-COST-AMT-DIFF  '                      16240099
162500                    SK-FRST-COST-AMT-DIFF                         16250099
162600                       DELIMITED BY SIZE                          16260099
162700                       INTO WS-REPORT-RECORD                      16270099
162800              PERFORM 9600-WRITE-REPORT-RECORD THRU               16280099
162900                      9600-EXIT                                   16290099
163000           END-IF                                                 16300099
163100           IF SK-VND-QTY-DIFF              NOT = 0                16310099
163200              STRING  WS-BLANK-30                                 16320099
163300                   'SK-VND-QTY-DIFF        '                      16330099
163400                    SK-VND-QTY-DIFF                               16340099
163500                       DELIMITED BY SIZE                          16350099
163600                       INTO WS-REPORT-RECORD                      16360099
163700              PERFORM 9600-WRITE-REPORT-RECORD THRU               16370099
163800                      9600-EXIT                                   16380099
163900           END-IF                                                 16390099
163901*GB 3/20/12                                                       16390199
163910           IF SK-INPK-QTY-DIFF              NOT = 0               16391099
163920              STRING  WS-BLANK-30                                 16392099
163930                   'SK-INPK-QTY-DIFF        '                     16393099
163940                    SK-INPK-QTY-DIFF                              16394099
163950                       DELIMITED BY SIZE                          16395099
163960                       INTO WS-REPORT-RECORD                      16396099
163970              PERFORM 9600-WRITE-REPORT-RECORD THRU               16397099
163980                      9600-EXIT                                   16398099
163990           END-IF                                                 16399099
163991           IF SK-OTPK-QTY-DIFF              NOT = 0               16399199
163992              STRING  WS-BLANK-30                                 16399299
163993                   'SK-OTPK-QTY-DIFF        '                     16399399
163994                    SK-OTPK-QTY-DIFF                              16399499
163995                       DELIMITED BY SIZE                          16399599
163996                       INTO WS-REPORT-RECORD                      16399699
163997              PERFORM 9600-WRITE-REPORT-RECORD THRU               16399799
163998                      9600-EXIT                                   16399899
163999           END-IF                                                 16399999
164000*GB 3/20/12                                                       16400099
164010           IF SK-PROMO-STRT-DTE-DIFF       NOT = 0                16401099
164100              STRING  WS-BLANK-30                                 16410099
164200                   'SK-PROMO-STRT-DTE-DIFF '                      16420099
164300                    SK-PROMO-STRT-DTE-DIFF                        16430099
164400                       DELIMITED BY SIZE                          16440099
164500                       INTO WS-REPORT-RECORD                      16450099
164600              PERFORM 9600-WRITE-REPORT-RECORD THRU               16460099
164700                      9600-EXIT                                   16470099
164800           END-IF                                                 16480099
164900           IF SK-PIC-SKU-IND-DIFF          NOT = 0                16490099
165000              STRING  WS-BLANK-30                                 16500099
165100                   'SK-PIC-SKU-IND-DIFF     '                     16510099
165200                    SK-PIC-SKU-IND-DIFF                           16520099
165300                       DELIMITED BY SIZE                          16530099
165400                       INTO WS-REPORT-RECORD                      16540099
165500              PERFORM 9600-WRITE-REPORT-RECORD THRU               16550099
165600                      9600-EXIT                                   16560099
165700           END-IF                                                 16570099
165800           IF SK-ORIG-ORD-QTY-DIFF         NOT = 0                16580099
165900              STRING  WS-BLANK-30                                 16590099
166000                   'SK-ORIG-ORD-QTY-DIFF  '                       16600099
166100                    SK-ORIG-ORD-QTY-DIFF                          16610099
166200                       DELIMITED BY SIZE                          16620099
166300                       INTO WS-REPORT-RECORD                      16630099
166400              PERFORM 9600-WRITE-REPORT-RECORD THRU               16640099
166500                      9600-EXIT                                   16650099
166600           END-IF                                                 16660099
166700           IF SK-ORD-QTY-DIFF              NOT = 0                16670099
166800              STRING  WS-BLANK-30                                 16680099
166900                   'SK-ORD-QTY-DIFF     '                         16690099
167000                    SK-ORD-QTY-DIFF                               16700099
167100                       DELIMITED BY SIZE                          16710099
167200                       INTO WS-REPORT-RECORD                      16720099
167300              PERFORM 9600-WRITE-REPORT-RECORD THRU               16730099
167400                      9600-EXIT                                   16740099
167500           END-IF                                                 16750099
167600           IF SK-CNCLD-QTY-DIFF            NOT = 0                16760099
167700              STRING  WS-BLANK-30                                 16770099
167800                   'SK-CNCLD-QTY-DIFF   '                         16780099
167900                    SK-CNCLD-QTY-DIFF                             16790099
168000                       DELIMITED BY SIZE                          16800099
168100                       INTO WS-REPORT-RECORD                      16810099
168200              PERFORM 9600-WRITE-REPORT-RECORD THRU               16820099
168300                      9600-EXIT                                   16830099
168400           END-IF                                                 16840099
168500           IF SK-PK-SKU-IND-DIFF           NOT = 0                16850099
168600              STRING  WS-BLANK-30                                 16860099
168700                   'SK-PK-SKU-IND-DIFF    '                       16870099
168800                    SK-PK-SKU-IND-DIFF                            16880099
168900                       DELIMITED BY SIZE                          16890099
169000                       INTO WS-REPORT-RECORD                      16900099
169100              PERFORM 9600-WRITE-REPORT-RECORD THRU               16910099
169200                      9600-EXIT                                   16920099
169300           END-IF                                                 16930099
169400           IF SK-PK-SKU-DESC-DIFF          NOT = 0                16940099
169500              STRING  WS-BLANK-30                                 16950099
169600                   'SK-PK-SKU-DESC-DIFF   '                       16960099
169700                    SK-PK-SKU-DESC-DIFF                           16970099
169800                       DELIMITED BY SIZE                          16980099
169900                       INTO WS-REPORT-RECORD                      16990099
170000              PERFORM 9600-WRITE-REPORT-RECORD THRU               17000099
170100                      9600-EXIT                                   17010099
170200           END-IF                                                 17020099
170300           IF SK-DC-ORD-MULT-QTY-DIFF      NOT = 0                17030099
170400              STRING  WS-BLANK-30                                 17040099
170500                   'SK-DC-ORD-MULT-QTY-DIFF '                     17050099
170600                    SK-DC-ORD-MULT-QTY-DIFF                       17060099
170700                       DELIMITED BY SIZE                          17070099
170800                       INTO WS-REPORT-RECORD                      17080099
170900              PERFORM 9600-WRITE-REPORT-RECORD THRU               17090099
171000                      9600-EXIT                                   17100099
171100           END-IF                                                 17110099
171200     END-IF.                                                      17120099
171300                                                                  17130099
171400     IF NUMBER-XXT-PO-PK-SKU    = 0 AND                           17140099
171500        NUMBER-PO-PK-SKU-RMS    = 0 AND                           17150099
171600        NUMBER-PO-PK-SKU-LGCY   = 0 AND                           17160099
171700        NUMBER-PO-PK-SKU-DATA                                     17170099
171800        CONTINUE                                                  17180099
171900     ELSE                                                         17190099
172000        MOVE SPACES         TO WS-REPORT-RECORD                   17200099
172100        PERFORM 9600-WRITE-REPORT-RECORD THRU                     17210099
172200                9600-EXIT                                         17220099
172300        STRING  ' PO-PK-SKU --------->'                           17230099
172400                ' - XLRD021 - 5 -'                                17240099
172500                WS-BLANK-03                                       17250099
172600                 NUMBER-PO-PK-SKU-DATA        ' - DATA'           17260099
172700                WS-BLANK-03                                       17270099
172800                 NUMBER-PO-PK-SKU-RMS         ' - RMS'            17280099
172900                WS-BLANK-03                                       17290099
173000                 NUMBER-PO-PK-SKU-LGCY        ' - LGCY'           17300099
173100                WS-BLANK-03                                       17310099
173200                 NUMBER-XXT-PO-PK-SKU         ' - TOTL'           17320099
173300                 DELIMITED BY SIZE                                17330099
173400                 INTO WS-REPORT-RECORD                            17340099
173500              PERFORM 9600-WRITE-REPORT-RECORD THRU               17350099
173600                      9600-EXIT                                   17360099
173700                                                                  17370099
173800                                                                  17380099
173900        IF NUMBER-PO-PK-SKU-DATA = 0                              17390099
174000           CONTINUE                                               17400099
174100        ELSE                                                      17410099
174200           IF PB-PO-NBR-DIFF               NOT = 0                17420099
174300              STRING  WS-BLANK-30                                 17430099
174400                   'PB-PO-NBR-DIFF         '                      17440099
174500                    PB-PO-NBR-DIFF                                17450099
174600                       DELIMITED BY SIZE                          17460099
174700                       INTO WS-REPORT-RECORD                      17470099
174800              PERFORM 9600-WRITE-REPORT-RECORD THRU               17480099
174900                      9600-EXIT                                   17490099
175000           END-IF                                                 17500099
175100           IF PB-PK-SKU-NBR-DIFF           NOT = 0                17510099
175200              STRING  WS-BLANK-30                                 17520099
175300                   'PB-PK-SKU-NBR-DIFF     '                      17530099
175400                    PB-PK-SKU-NBR-DIFF                            17540099
175500                       DELIMITED BY SIZE                          17550099
175600                       INTO WS-REPORT-RECORD                      17560099
175700              PERFORM 9600-WRITE-REPORT-RECORD THRU               17570099
175800                      9600-EXIT                                   17580099
175900           END-IF                                                 17590099
176000           IF PB-SKU-NBR-DIFF              NOT = 0                17600099
176100              STRING  WS-BLANK-30                                 17610099
176200                   'PB-SKU-NBR-DIFF        '                      17620099
176300                    PB-SKU-NBR-DIFF                               17630099
176400                       DELIMITED BY SIZE                          17640099
176500                       INTO WS-REPORT-RECORD                      17650099
176600              PERFORM 9600-WRITE-REPORT-RECORD THRU               17660099
176700                      9600-EXIT                                   17670099
176800           END-IF                                                 17680099
176900           IF PB-UNT-COST-AMT-DIFF         NOT = 0                17690099
177000              STRING  WS-BLANK-30                                 17700099
177100                   'PB-UNT-COST-AMT-DIFF   '                      17710099
177200                    PB-UNT-COST-AMT-DIFF                          17720099
177300                       DELIMITED BY SIZE                          17730099
177400                       INTO WS-REPORT-RECORD                      17740099
177500              PERFORM 9600-WRITE-REPORT-RECORD THRU               17750099
177600                      9600-EXIT                                   17760099
177700           END-IF                                                 17770099
177800           IF PB-FRST-COST-AMT-DIFF        NOT = 0                17780099
177900              STRING  WS-BLANK-30                                 17790099
178000                   'PB-FRST-COST-AMT-DIFF  '                      17800099
178100                    PB-FRST-COST-AMT-DIFF                         17810099
178200                       DELIMITED BY SIZE                          17820099
178300                       INTO WS-REPORT-RECORD                      17830099
178400              PERFORM 9600-WRITE-REPORT-RECORD THRU               17840099
178500                      9600-EXIT                                   17850099
178600           END-IF                                                 17860099
178700           IF PB-UNT-RTL-AMT-DIFF          NOT = 0                17870099
178800              STRING  WS-BLANK-30                                 17880099
178900                   'PB-UNT-RTL-AMT-DIFF    '                      17890099
178910                    PB-UNT-RTL-AMT-DIFF                           17891099
178920                       DELIMITED BY SIZE                          17892099
178930                       INTO WS-REPORT-RECORD                      17893099
178940              PERFORM 9600-WRITE-REPORT-RECORD THRU               17894099
178950                      9600-EXIT                                   17895099
178960           END-IF                                                 17896099
178970           IF PB-GP-RTL-AMT-DIFF           NOT = 0                17897099
178980              STRING  WS-BLANK-30                                 17898099
178990                   'PB-GP-RTL-AMT-DIFF   '                        17899099
178991                    PB-GP-RTL-AMT-DIFF                            17899199
178992                       DELIMITED BY SIZE                          17899299
178993                       INTO WS-REPORT-RECORD                      17899399
178994              PERFORM 9600-WRITE-REPORT-RECORD THRU               17899499
178995                      9600-EXIT                                   17899599
178996           END-IF                                                 17899699
178997           IF PB-GP-RTL-QTY-DIFF           NOT = 0                17899799
178998              STRING  WS-BLANK-30                                 17899899
178999                   'PB-GP-RTL-QTY-DIFF     '                      17899999
179000                    PB-GP-RTL-QTY-DIFF                            17900099
179001                       DELIMITED BY SIZE                          17900199
179002                       INTO WS-REPORT-RECORD                      17900299
179003              PERFORM 9600-WRITE-REPORT-RECORD THRU               17900399
179004                      9600-EXIT                                   17900499
179005           END-IF                                                 17900599
179006           IF PB-RATO-UNT-QTY-DIFF         NOT = 0                17900699
179007              STRING  WS-BLANK-30                                 17900799
179008                   'PB-RATO-UNT-QTY-DIFF  '                       17900899
179009                    PB-RATO-UNT-QTY-DIFF                          17900999
179010                       DELIMITED BY SIZE                          17901099
179020                       INTO WS-REPORT-RECORD                      17902099
179030              PERFORM 9600-WRITE-REPORT-RECORD THRU               17903099
179040                      9600-EXIT                                   17904099
179050           END-IF                                                 17905099
179051           IF PB-INPK-UNT-QTY-DIFF         NOT = 0                17905199
179052              STRING  WS-BLANK-30                                 17905299
179053                   'PB-INPK-UNT-QTY-DIFF  '                       17905399
179054                    PB-INPK-UNT-QTY-DIFF                          17905499
179055                       DELIMITED BY SIZE                          17905599
179056                       INTO WS-REPORT-RECORD                      17905699
179057              PERFORM 9600-WRITE-REPORT-RECORD THRU               17905799
179058                      9600-EXIT                                   17905899
179059           END-IF                                                 17905999
179060           IF PB-OTPK-UNT-QTY-DIFF         NOT = 0                17906099
179061              STRING  WS-BLANK-30                                 17906199
179062                   'PB-OTPK-UNT-QTY-DIFF  '                       17906299
179063                    PB-OTPK-UNT-QTY-DIFF                          17906399
179064                       DELIMITED BY SIZE                          17906499
179065                       INTO WS-REPORT-RECORD                      17906599
179066              PERFORM 9600-WRITE-REPORT-RECORD THRU               17906699
179067                      9600-EXIT                                   17906799
179068           END-IF                                                 17906899
179070        END-IF                                                    17907099
179071     END-IF.                                                      17907199
179080                                                                  17908099
179090     IF NUMBER-XXT-PO-PK-SKU-LOC = 0 AND                          17909099
179100        NUMBER-PO-PK-SKU-LOC-RMS = 0 AND                          17910099
179200        NUMBER-PO-PK-SKU-LOC-LGCY = 0 AND                         17920099
179300        NUMBER-PO-PK-SKU-LOC-DATA                                 17930099
179400        CONTINUE                                                  17940099
179500     ELSE                                                         17950099
179600        MOVE SPACES         TO WS-REPORT-RECORD                   17960099
179700        PERFORM 9600-WRITE-REPORT-RECORD THRU                     17970099
179800                9600-EXIT                                         17980099
179900        STRING  ' PO-PK-SKU-LOC ----->'                           17990099
180000                ' - XLRD022 - 6 -'                                18000099
180100                WS-BLANK-03                                       18010099
180200                 NUMBER-PO-PK-SKU-LOC-DATA    ' - DATA'           18020099
180300                WS-BLANK-03                                       18030099
180400                 NUMBER-PO-PK-SKU-LOC-RMS     ' - RMS'            18040099
180500                WS-BLANK-03                                       18050099
180600                 NUMBER-PO-PK-SKU-LOC-LGCY    ' - LGCY'           18060099
180700                WS-BLANK-03                                       18070099
180800                 NUMBER-XXT-PO-PK-SKU-LOC     ' - TOTL'           18080099
180900                 DELIMITED BY SIZE                                18090099
181000                 INTO WS-REPORT-RECORD                            18100099
181100              PERFORM 9600-WRITE-REPORT-RECORD THRU               18110099
181200                      9600-EXIT                                   18120099
181300                                                                  18130099
181400        IF NUMBER-PO-PK-SKU-LOC-DATA = 0                          18140099
181500           CONTINUE                                               18150099
181600        ELSE                                                      18160099
181700           IF PL-PO-NBR-DIFF               NOT = 0                18170099
181800              STRING  WS-BLANK-30                                 18180099
181900                   'PL-PO-NBR-DIFF           '                    18190099
182000                    PL-PO-NBR-DIFF                                18200099
182100                       DELIMITED BY SIZE                          18210099
182200                       INTO WS-REPORT-RECORD                      18220099
182300              PERFORM 9600-WRITE-REPORT-RECORD THRU               18230099
182400                      9600-EXIT                                   18240099
182500           END-IF                                                 18250099
182600           IF PL-SKU-NBR-DIFF              NOT = 0                18260099
182700              STRING  WS-BLANK-30                                 18270099
182800                   'PL-SKU-NBR-DIFF      '                        18280099
182900                    PL-SKU-NBR-DIFF                               18290099
183000                       DELIMITED BY SIZE                          18300099
183100                       INTO WS-REPORT-RECORD                      18310099
183200              PERFORM 9600-WRITE-REPORT-RECORD THRU               18320099
183300                      9600-EXIT                                   18330099
183400           END-IF                                                 18340099
183500           IF PL-PK-SKU-NBR-DIFF           NOT = 0                18350099
183600              STRING  WS-BLANK-30                                 18360099
183700                   'PL-PK-SKU-NBR-DIFF     '                      18370099
183800                    PL-PK-SKU-NBR-DIFF                            18380099
183900                       DELIMITED BY SIZE                          18390099
184000                       INTO WS-REPORT-RECORD                      18400099
184100              PERFORM 9600-WRITE-REPORT-RECORD THRU               18410099
184200                      9600-EXIT                                   18420099
184300           END-IF                                                 18430099
184400           IF PL-LOC-NBR-DIFF              NOT = 0                18440099
184500              STRING  WS-BLANK-30                                 18450099
184600                   'PL-LOC-NBR-DIFF        '                      18460099
184700                    PL-LOC-NBR-DIFF                               18470099
184800                       DELIMITED BY SIZE                          18480099
184900                       INTO WS-REPORT-RECORD                      18490099
185000              PERFORM 9600-WRITE-REPORT-RECORD THRU               18500099
185100                      9600-EXIT                                   18510099
185200           END-IF                                                 18520099
185300        END-IF                                                    18530099
185400     END-IF.                                                      18540099
185500                                                                  18550099
185600     IF NUMBER-XXT-PO-INBD-ALLOC = 0 AND                          18560099
185700        NUMBER-PO-INBD-ALLOC-RMS = 0 AND                          18570099
185800        NUMBER-PO-INBD-ALLOC-LGCY = 0 AND                         18580099
185900        NUMBER-PO-INBD-ALLOC-DATA                                 18590099
186000        CONTINUE                                                  18600099
186100     ELSE                                                         18610099
186200        MOVE SPACES         TO WS-REPORT-RECORD                   18620099
186300        PERFORM 9600-WRITE-REPORT-RECORD THRU                     18630099
186400                9600-EXIT                                         18640099
186500        STRING  ' PO-INBD-ALLOC ----->'                           18650099
186600                ' - XLRD019 - 7 -'                                18660099
186700                WS-BLANK-03                                       18670099
186800                 NUMBER-PO-INBD-ALLOC-DATA    ' - DATA'           18680099
186900                WS-BLANK-03                                       18690099
187000                 NUMBER-PO-INBD-ALLOC-RMS     ' - RMS'            18700099
187100                WS-BLANK-03                                       18710099
187200                 NUMBER-PO-INBD-ALLOC-LGCY    ' - LGCY'           18720099
187300                WS-BLANK-03                                       18730099
187400                 NUMBER-XXT-PO-INBD-ALLOC     ' - TOTL'           18740099
187500                 DELIMITED BY SIZE                                18750099
187600                 INTO WS-REPORT-RECORD                            18760099
187700              PERFORM 9600-WRITE-REPORT-RECORD THRU               18770099
187800                      9600-EXIT                                   18780099
187900                                                                  18790099
188000        IF NUMBER-PO-INBD-ALLOC-DATA = 0                          18800099
188100           CONTINUE                                               18810099
188200        ELSE                                                      18820099
188300           IF LO-PO-NBR-DIFF               NOT = 0                18830099
188400              STRING  WS-BLANK-30                                 18840099
188500                   'LO-PO-NBR-DIFF       '                        18850099
188600                    LO-PO-NBR-DIFF                                18860099
188700                       DELIMITED BY SIZE                          18870099
188800                       INTO WS-REPORT-RECORD                      18880099
188900              PERFORM 9600-WRITE-REPORT-RECORD THRU               18890099
189000                      9600-EXIT                                   18900099
189100           END-IF                                                 18910099
189200           IF LO-SKU-NBR-DIFF              NOT = 0                18920099
189300              STRING  WS-BLANK-30                                 18930099
189400                   'LO-SKU-NBR-DIFF        '                      18940099
189500                    LO-SKU-NBR-DIFF                               18950099
189600                       DELIMITED BY SIZE                          18960099
189700                       INTO WS-REPORT-RECORD                      18970099
189800              PERFORM 9600-WRITE-REPORT-RECORD THRU               18980099
189900                      9600-EXIT                                   18990099
190000           END-IF                                                 19000099
190100           IF LO-LOC-NBR-DIFF              NOT = 0                19010099
190200              STRING  WS-BLANK-30                                 19020099
190300                   'LO-LOC-NBR-DIFF          '                    19030099
190400                    LO-LOC-NBR-DIFF                               19040099
190500                       DELIMITED BY SIZE                          19050099
190600                       INTO WS-REPORT-RECORD                      19060099
190700              PERFORM 9600-WRITE-REPORT-RECORD THRU               19070099
190800                      9600-EXIT                                   19080099
190900           END-IF                                                 19090099
191000           IF LO-LOC-TYP-CDE-DIFF          NOT = 0                19100099
191100              STRING  WS-BLANK-30                                 19110099
191200                   'LO-LOC-TYP-CDE-DIFF      '                    19120099
191300                    LO-LOC-TYP-CDE-DIFF                           19130099
191400                       DELIMITED BY SIZE                          19140099
191500                       INTO WS-REPORT-RECORD                      19150099
191600              PERFORM 9600-WRITE-REPORT-RECORD THRU               19160099
191700                      9600-EXIT                                   19170099
191800           END-IF                                                 19180099
191900           IF SK-UNT-RTL-AMT-DIFF          NOT = 0                19190099
192000              STRING  WS-BLANK-30                                 19200099
192100                   'SK-UNT-RTL-AMT-DIFF      '                    19210099
192200                    SK-UNT-RTL-AMT-DIFF                           19220099
192300                       DELIMITED BY SIZE                          19230099
192400                       INTO WS-REPORT-RECORD                      19240099
192500              PERFORM 9600-WRITE-REPORT-RECORD THRU               19250099
192600                      9600-EXIT                                   19260099
192700           END-IF                                                 19270099
192800           IF SK-GP-RTL-AMT-DIFF           NOT = 0                19280099
192900              STRING  WS-BLANK-30                                 19290099
193000                   'SK-GP-RTL-AMT-DIFF       '                    19300099
193100                    SK-GP-RTL-AMT-DIFF                            19310099
193200                       DELIMITED BY SIZE                          19320099
193300                       INTO WS-REPORT-RECORD                      19330099
193400              PERFORM 9600-WRITE-REPORT-RECORD THRU               19340099
193500                      9600-EXIT                                   19350099
193600           END-IF                                                 19360099
193700           IF SK-GP-RTL-QTY-DIFF           NOT = 0                19370099
193800              STRING  WS-BLANK-30                                 19380099
193900                   'SK-GP-RTL-QTY-DIFF       '                    19390099
194000                    SK-GP-RTL-QTY-DIFF                            19400099
194100                       DELIMITED BY SIZE                          19410099
194200                       INTO WS-REPORT-RECORD                      19420099
194300              PERFORM 9600-WRITE-REPORT-RECORD THRU               19430099
194400                      9600-EXIT                                   19440099
194500           END-IF                                                 19450099
194600           IF LO-ORD-QTY-DIFF              NOT = 0                19460099
194700              STRING  WS-BLANK-30                                 19470099
194800                   'LO-ORD-QTY-DIFF          '                    19480099
194900                    LO-ORD-QTY-DIFF                               19490099
195000                       DELIMITED BY SIZE                          19500099
195100                       INTO WS-REPORT-RECORD                      19510099
195200              PERFORM 9600-WRITE-REPORT-RECORD THRU               19520099
195300                      9600-EXIT                                   19530099
195400           END-IF                                                 19540099
195500           IF LO-ORIG-ORD-QTY-DIFF         NOT = 0                19550099
195600              STRING  WS-BLANK-30                                 19560099
195700                   'LO-ORIG-ORD-QTY-DIFF     '                    19570099
195800                    LO-ORIG-ORD-QTY-DIFF                          19580099
195900                       DELIMITED BY SIZE                          19590099
196000                       INTO WS-REPORT-RECORD                      19600099
196100              PERFORM 9600-WRITE-REPORT-RECORD THRU               19610099
196200                      9600-EXIT                                   19620099
196300           END-IF                                                 19630099
196400           IF LO-CNCLD-QTY-DIFF            NOT = 0                19640099
196500              STRING  WS-BLANK-30                                 19650099
196600                   'LO-CNCLD-QTY-DIFF        '                    19660099
196700                    LO-CNCLD-QTY-DIFF                             19670099
196800                       DELIMITED BY SIZE                          19680099
196900                       INTO WS-REPORT-RECORD                      19690099
197000              PERFORM 9600-WRITE-REPORT-RECORD THRU               19700099
197100                      9600-EXIT                                   19710099
197200           END-IF                                                 19720099
197300           IF LO-CNCL-CDE-DIFF             NOT = 0                19730099
197400              STRING  WS-BLANK-30                                 19740099
197500                   'LO-CNCL-CDE-DIFF         '                    19750099
197600                    LO-CNCL-CDE-DIFF                              19760099
197700                       DELIMITED BY SIZE                          19770099
197800                       INTO WS-REPORT-RECORD                      19780099
197900              PERFORM 9600-WRITE-REPORT-RECORD THRU               19790099
198000                      9600-EXIT                                   19800099
198100           END-IF                                                 19810099
198200           IF LO-CNCL-DTE-DIFF             NOT = 0                19820099
198300              STRING  WS-BLANK-30                                 19830099
198400                   'LO-CNCL-DTE-DIFF         '                    19840099
198500                    LO-CNCL-DTE-DIFF                              19850099
198600                       DELIMITED BY SIZE                          19860099
198700                       INTO WS-REPORT-RECORD                      19870099
198800              PERFORM 9600-WRITE-REPORT-RECORD THRU               19880099
198900                      9600-EXIT                                   19890099
199000           END-IF                                                 19900099
199100           IF LO-CNCLD-BY-USR-ID-DIFF      NOT = 0                19910099
199200              STRING  WS-BLANK-30                                 19920099
199300                   'LO-CNCLD-BY-USR-ID-DIFF  '                    19930099
199400                    LO-CNCLD-BY-USR-ID-DIFF                       19940099
199500                       DELIMITED BY SIZE                          19950099
199600                       INTO WS-REPORT-RECORD                      19960099
199700              PERFORM 9600-WRITE-REPORT-RECORD THRU               19970099
199800                      9600-EXIT                                   19980099
199900           END-IF                                                 19990099
200000           IF LO-DC-ALLC-MULT-QTY-DIFF     NOT = 0                20000099
200100              STRING  WS-BLANK-30                                 20010099
200200                   'LO-DC-ALLC-MULT-QTY-DIFF '                    20020099
200300                    LO-DC-ALLC-MULT-QTY-DIFF                      20030099
200400                       DELIMITED BY SIZE                          20040099
200500                       INTO WS-REPORT-RECORD                      20050099
200600              PERFORM 9600-WRITE-REPORT-RECORD THRU               20060099
200700                      9600-EXIT                                   20070099
200800           END-IF                                                 20080099
200900           IF LO-STR-ALLC-MLT-QTY-DIFF     NOT = 0                20090099
201000              STRING  WS-BLANK-30                                 20100099
201100                   'LO-STR-ALLC-MLT-QTY-DIFF '                    20110099
201200                    LO-STR-ALLC-MLT-QTY-DIFF                      20120099
201300                       DELIMITED BY SIZE                          20130099
201400                       INTO WS-REPORT-RECORD                      20140099
201500              PERFORM 9600-WRITE-REPORT-RECORD THRU               20150099
201600                      9600-EXIT                                   20160099
201700           END-IF                                                 20170099
201800           IF LO-ALLOC-RND-CDE-DIFF        NOT = 0                20180099
201900              STRING  WS-BLANK-30                                 20190099
202000                   'LO-ALLOC-RND-CDE-DIFF    '                    20200099
202100                    LO-ALLOC-RND-CDE-DIFF                         20210099
202200                       DELIMITED BY SIZE                          20220099
202300                       INTO WS-REPORT-RECORD                      20230099
202400              PERFORM 9600-WRITE-REPORT-RECORD THRU               20240099
202500                      9600-EXIT                                   20250099
202600           END-IF                                                 20260099
202700           IF LO-SHTG-PRT-OPT-CDE-DIFF     NOT = 0                20270099
202800              STRING  WS-BLANK-30                                 20280099
202900                   'LO-SHTG-PRT-OPT-CDE-DIFF '                    20290099
203000                    LO-SHTG-PRT-OPT-CDE-DIFF                      20300099
203100                       DELIMITED BY SIZE                          20310099
203200                       INTO WS-REPORT-RECORD                      20320099
203300              PERFORM 9600-WRITE-REPORT-RECORD THRU               20330099
203400                      9600-EXIT                                   20340099
203500           END-IF                                                 20350099
203600           IF LO-OVRG-PRT-OPT-CDE-DIFF     NOT = 0                20360099
203700              STRING  WS-BLANK-30                                 20370099
203800                   'LO-OVRG-PRT-OPT-CDE-DIFF '                    20380099
203900                    LO-OVRG-PRT-OPT-CDE-DIFF                      20390099
204000                       DELIMITED BY SIZE                          20400099
204100                       INTO WS-REPORT-RECORD                      20410099
204200              PERFORM 9600-WRITE-REPORT-RECORD THRU               20420099
204300                      9600-EXIT                                   20430099
204400           END-IF                                                 20440099
204500           IF LO-EXT-SHTG-THR-IND-DIFF     NOT = 0                20450099
204600              STRING  WS-BLANK-30                                 20460099
204700                   'LO-EXT-SHTG-THR-IND-DIFF '                    20470099
204800                    LO-EXT-SHTG-THR-IND-DIFF                      20480099
204900                       DELIMITED BY SIZE                          20490099
205000                       INTO WS-REPORT-RECORD                      20500099
205100              PERFORM 9600-WRITE-REPORT-RECORD THRU               20510099
205200                      9600-EXIT                                   20520099
205300           END-IF                                                 20530099
205400        END-IF                                                    20540099
205500     END-IF.                                                      20550099
205600                                                                  20560099
205700     IF NUMBER-XXT-PO-OUTBND-ALLOC = 0 AND                        20570099
205800        NUMBER-PO-OUTBND-ALLOC-RMS = 0 AND                        20580099
205900        NUMBER-PO-OUTBND-ALLOC-LGCY = 0 AND                       20590099
206000        NUMBER-PO-OUTBND-ALLOC-DATA                               20600099
206100        CONTINUE                                                  20610099
206200     ELSE                                                         20620099
206300        MOVE SPACES         TO WS-REPORT-RECORD                   20630099
206400        PERFORM 9600-WRITE-REPORT-RECORD THRU                     20640099
206500                9600-EXIT                                         20650099
206600        STRING  ' PO-OUTBND-ALLOC --->'                           20660099
206700                ' - XLRD020 - 8 -'                                20670099
206800                WS-BLANK-03                                       20680099
206900                 NUMBER-PO-OUTBND-ALLOC-DATA  ' - DATA'           20690099
207000                WS-BLANK-03                                       20700099
207100                 NUMBER-PO-OUTBND-ALLOC-RMS   ' - RMS'            20710099
207200                WS-BLANK-03                                       20720099
207300                 NUMBER-PO-OUTBND-ALLOC-LGCY ' - LGCY'            20730099
207400                WS-BLANK-03                                       20740099
207500                 NUMBER-XXT-PO-OUTBND-ALLOC  ' - TOTL'            20750099
207600                 DELIMITED BY SIZE                                20760099
207700                 INTO WS-REPORT-RECORD                            20770099
207800              PERFORM 9600-WRITE-REPORT-RECORD THRU               20780099
207900                      9600-EXIT                                   20790099
208000                                                                  20800099
208100        IF NUMBER-PO-OUTBND-ALLOC-DATA = 0                        20810099
208200           CONTINUE                                               20820099
208300        ELSE                                                      20830099
208400           IF SB-PO-NBR-DIFF               NOT = 0                20840099
208500              STRING  WS-BLANK-30                                 20850099
208600                   'SB-PO-NBR-DIFF           '                    20860099
208700                    SB-PO-NBR-DIFF                                20870099
208800                       DELIMITED BY SIZE                          20880099
208900                       INTO WS-REPORT-RECORD                      20890099
209000              PERFORM 9600-WRITE-REPORT-RECORD THRU               20900099
209100                      9600-EXIT                                   20910099
209200           END-IF                                                 20920099
209300           IF SB-SKU-NBR-DIFF              NOT = 0                20930099
209400              STRING  WS-BLANK-30                                 20940099
209500                   'SB-SKU-NBR-DIFF          '                    20950099
209600                    SB-SKU-NBR-DIFF                               20960099
209700                       DELIMITED BY SIZE                          20970099
209800                       INTO WS-REPORT-RECORD                      20980099
209900              PERFORM 9600-WRITE-REPORT-RECORD THRU               20990099
210000                      9600-EXIT                                   21000099
210100           END-IF                                                 21010099
210200           IF SB-LOC-NBR-DIFF              NOT = 0                21020099
210300              STRING  WS-BLANK-30                                 21030099
210400                   'SB-LOC-NBR-DIFF          '                    21040099
210500                    SB-LOC-NBR-DIFF                               21050099
210600                       DELIMITED BY SIZE                          21060099
210700                       INTO WS-REPORT-RECORD                      21070099
210800              PERFORM 9600-WRITE-REPORT-RECORD THRU               21080099
210900                      9600-EXIT                                   21090099
211000           END-IF                                                 21100099
211100           IF SB-STR-NBR-DIFF              NOT = 0                21110099
211200              STRING  WS-BLANK-30                                 21120099
211300                   'SB-STR-NBR-DIFF          '                    21130099
211400                    SB-STR-NBR-DIFF                               21140099
211500                       DELIMITED BY SIZE                          21150099
211600                       INTO WS-REPORT-RECORD                      21160099
211700              PERFORM 9600-WRITE-REPORT-RECORD THRU               21170099
211800                      9600-EXIT                                   21180099
211900           END-IF                                                 21190099
212000           IF SB-RNK-SEQ-NBR-DIFF          NOT = 0                21200099
212100              STRING  WS-BLANK-30                                 21210099
212200                   'SB-RNK-SEQ-NBR-DIFF      '                    21220099
212300                    SB-RNK-SEQ-NBR-DIFF                           21230099
212400                       DELIMITED BY SIZE                          21240099
212500                       INTO WS-REPORT-RECORD                      21250099
212600              PERFORM 9600-WRITE-REPORT-RECORD THRU               21260099
212700                      9600-EXIT                                   21270099
212800           END-IF                                                 21280099
212900           IF SB-ALLOC-QTY-DIFF            NOT = 0                21290099
213000              STRING  WS-BLANK-30                                 21300099
213100                   'SB-ALLOC-QTY-DIFF        '                    21310099
213200                    SB-ALLOC-QTY-DIFF                             21320099
213300                       DELIMITED BY SIZE                          21330099
213400                       INTO WS-REPORT-RECORD                      21340099
213500              PERFORM 9600-WRITE-REPORT-RECORD THRU               21350099
213600                      9600-EXIT                                   21360099
213700           END-IF                                                 21370099
213800           IF SB-ALLOC-SEQ-CDE-DIFF        NOT = 0                21380099
213900              STRING  WS-BLANK-30                                 21390099
214000                   'SB-ALLOC-SEQ-CDE-DIFF    '                    21400099
214100                    SB-ALLOC-SEQ-CDE-DIFF                         21410099
214200                       DELIMITED BY SIZE                          21420099
214300                       INTO WS-REPORT-RECORD                      21430099
214400              PERFORM 9600-WRITE-REPORT-RECORD THRU               21440099
214500                      9600-EXIT                                   21450099
214600           END-IF                                                 21460099
214700           IF SB-STR-CNSTR-CDE-DIFF        NOT = 0                21470099
214800              STRING  WS-BLANK-30                                 21480099
214900                   'SB-STR-CNSTR-CDE-DIFF    '                    21490099
215000                    SB-STR-CNSTR-CDE-DIFF                         21500099
215100                       DELIMITED BY SIZE                          21510099
215200                       INTO WS-REPORT-RECORD                      21520099
215300              PERFORM 9600-WRITE-REPORT-RECORD THRU               21530099
215400                      9600-EXIT                                   21540099
215500           END-IF                                                 21550099
215600           IF SB-STR-CNSTR-QTY-DIFF        NOT = 0                21560099
215700              STRING  WS-BLANK-30                                 21570099
215800                   'SB-STR-CNSTR-QTY-DIFF    '                    21580099
215900                    SB-STR-CNSTR-QTY-DIFF                         21590099
216000                       DELIMITED BY SIZE                          21600099
216100                       INTO WS-REPORT-RECORD                      21610099
216200              PERFORM 9600-WRITE-REPORT-RECORD THRU               21620099
216300                      9600-EXIT                                   21630099
216400           END-IF                                                 21640099
216500        END-IF                                                    21650099
216600     END-IF.                                                      21660099
216700                                                                  21670099
216800 3000-EXIT. EXIT.                                                 21680099
216900                                                                  21690099
217000                                                                  21700099
217100 4000-DISPLAY-COUNTS.                                             21710099
217200                                                                  21720099
217300                                                                  21730099
217400     IF NUMBER-XXT-PO           = 0 AND                           21740099
217500        NUMBER-PO-HDR-RMS       = 0 AND                           21750099
217600        NUMBER-PO-HDR-LGCY      = 0 AND                           21760099
217700        NUMBER-PO-HDR-DATA                                        21770099
217800        CONTINUE                                                  21780099
217900     ELSE                                                         21790099
218000        DISPLAY ' '                                               21800099
218100        DISPLAY 'PO ---------------->'                            21810099
218200                ' - XLRD015 - 1 - '                               21820099
218300                WS-BLANK-03                                       21830099
218400                 NUMBER-PO-HDR-DATA           ' - DATA'           21840099
218500                WS-BLANK-03                                       21850099
218600                 NUMBER-PO-HDR-RMS            ' - RMS'            21860099
218700                WS-BLANK-03                                       21870099
218800                 NUMBER-PO-HDR-LGCY           ' - LGCY'           21880099
218900                WS-BLANK-03                                       21890099
219000                 NUMBER-XXT-PO                ' - TOTL'           21900099
219100                                                                  21910099
219200        IF NUMBER-PO-HDR-DATA NOT = 0                             21920099
219300           IF PO-NBR-DIFF           NOT = 0                       21930099
219400              DISPLAY WS-BLANK-30                                 21940099
219500                      'PO-NBR-DIFF           '                    21950099
219600                       PO-NBR-DIFF                                21960099
219700           END-IF                                                 21970099
219800           IF DEPT-NBR-DIFF         NOT = 0                       21980099
219900              DISPLAY WS-BLANK-30                                 21990099
220000                      'DEPT-NBR-DIFF         '                    22000099
220100                       DEPT-NBR-DIFF                              22010099
220200           END-IF                                                 22020099
220300           IF BYR-NBR-DIFF          NOT = 0                       22030099
220400              DISPLAY WS-BLANK-30                                 22040099
220500                      'BYR-NBR-DIFF          '                    22050099
220600                       BYR-NBR-DIFF                               22060099
220700           END-IF                                                 22070099
220800           IF ENT-ID-DIFF           NOT = 0                       22080099
220900              DISPLAY WS-BLANK-30                                 22090099
221000                      'ENT-ID-DIFF           '                    22100099
221100                       ENT-ID-DIFF                                22110099
221200           END-IF                                                 22120099
221300           IF AGNT-ENT-ID-DIFF      NOT = 0                       22130099
221400              DISPLAY WS-BLANK-30                                 22140099
221500                      'AGNT-ENT-ID-DIFF      '                    22150099
221600                       AGNT-ENT-ID-DIFF                           22160099
221700           END-IF                                                 22170099
221800           IF CRE-DTE-DIFF          NOT = 0                       22180099
221900              DISPLAY WS-BLANK-30                                 22190099
222000                      'CRE-DTE-DIFF          '                    22200099
222100                       CRE-DTE-DIFF                               22210099
222200           END-IF                                                 22220099
222300           IF NOT-BEF-DTE-DIFF      NOT = 0                       22230099
222400              DISPLAY WS-BLANK-30                                 22240099
222500                      'NOT-BEF-DTE-DIFF      '                    22250099
222600                       NOT-BEF-DTE-DIFF                           22260099
222700           END-IF                                                 22270099
222800           IF NOT-AFT-DTE-DIFF     NOT = 0                        22280099
222900              DISPLAY WS-BLANK-30                                 22290099
223000                      'NOT-AFT-DTE-DIFF      '                    22300099
223100                       NOT-AFT-DTE-DIFF                           22310099
223200           END-IF                                                 22320099
223300           IF OTB-EOW-DTE-DIFF      NOT = 0                       22330099
223400              DISPLAY WS-BLANK-30                                 22340099
223500                      'OTB-EOW-DTE-DIFF      '                    22350099
223600                       OTB-EOW-DTE-DIFF                           22360099
223700           END-IF                                                 22370099
223800           IF CLOSE-DTE-DIFF        NOT = 0                       22380099
223900              DISPLAY WS-BLANK-30                                 22390099
224000                      'CLOSE-DTE-DIFF        '                    22400099
224100                       CLOSE-DTE-DIFF                             22410099
224200           END-IF                                                 22420099
224300           IF PAYT-TERM-ID-DIFF     NOT = 0                       22430099
224400              DISPLAY WS-BLANK-30                                 22440099
224500                      'PAYT-TERM-ID-DIFF     '                    22450099
224600                       PAYT-TERM-ID-DIFF                          22460099
224700           END-IF                                                 22470099
224800           IF FRGT-TERM-ID-DIFF     NOT = 0                       22480099
224900              DISPLAY WS-BLANK-30                                 22490099
225000                      'FRGT-TERM-ID-DIFF     '                    22500099
225100                       FRGT-TERM-ID-DIFF                          22510099
225200           END-IF                                                 22520099
225300           IF STAT-CDE-DIFF         NOT = 0                       22530099
225400              DISPLAY WS-BLANK-30                                 22540099
225500                      'STAT-CDE-DIFF         '                    22550099
225600                       STAT-CDE-DIFF                              22560099
225700           END-IF                                                 22570099
225800           IF ORIG-PO-APVL-DTE-DIFF NOT = 0                       22580099
225900              DISPLAY WS-BLANK-30                                 22590099
226000                      'ORIG-PO-APVL-DTE-DIFF '                    22600099
226100                       ORIG-PO-APVL-DTE-DIFF                      22610099
226200           END-IF                                                 22620099
226300           IF ORIG-APP-BY-USR-ID-DIFF  NOT = 0                    22630099
226400              DISPLAY WS-BLANK-30                                 22640099
226500                      'ORIG-APP-BY-USR-ID-DIFF '                  22650099
226600                       ORIG-APP-BY-USR-ID-DIFF                    22660099
226700           END-IF                                                 22670099
226800           IF EDI-SNT-IND-DIFF      NOT = 0                       22680099
226900              DISPLAY WS-BLANK-30                                 22690099
227000                      'EDI-SNT-IND-DIFF      '                    22700099
227100                       EDI-SNT-IND-DIFF                           22710099
227200           END-IF                                                 22720099
227300           IF EDI-PO-IND-DIFF       NOT = 0                       22730099
227400              DISPLAY WS-BLANK-30                                 22740099
227500                      'EDI-PO-IND-DIFF       '                    22750099
227600                       EDI-PO-IND-DIFF                            22760099
227700           END-IF                                                 22770099
227800           IF IMPRT-PO-IND-DIFF     NOT = 0                       22780099
227900              DISPLAY WS-BLANK-30                                 22790099
228000                      'IMPRT-PO-IND-DIFF     '                    22800099
228100                       IMPRT-PO-IND-DIFF                          22810099
228200           END-IF                                                 22820099
228300           IF FCTRY-NM-DIFF         NOT = 0                       22830099
228400              DISPLAY WS-BLANK-30                                 22840099
228500                      'FCTRY-NM-DIFF         '                    22850099
228600                       FCTRY-NM-DIFF                              22860099
228700           END-IF                                                 22870099
228800           IF POE-CDE-DIFF          NOT = 0                       22880099
228900              DISPLAY WS-BLANK-30                                 22890099
229000                      'POE-CDE-DIFF          '                    22900099
229100                       POE-CDE-DIFF                               22910099
229200           END-IF                                                 22920099
229300           IF FOB-CDE-DIFF          NOT = 0                       22930099
229400              DISPLAY WS-BLANK-30                                 22940099
229500                      'FOB-CDE-DIFF          '                    22950099
229600                       FOB-CDE-DIFF                               22960099
229700           END-IF                                                 22970099
229800           IF PO-TYP-CDE-DIFF       NOT = 0                       22980099
229900              DISPLAY WS-BLANK-30                                 22990099
230000                      'PO-TYP-CDE-DIFF       '                    23000099
230100                       PO-TYP-CDE-DIFF                            23010099
230200           END-IF                                                 23020099
230300           IF PK-BY-STR-IND-DIFF    NOT = 0                       23030099
230400              DISPLAY WS-BLANK-30                                 23040099
230500                      'PK-BY-STR-IND-DIFF    '                    23050099
230600                       PK-BY-STR-IND-DIFF                         23060099
230700           END-IF                                                 23070099
230800           IF CONSLR-ACTL-DTE-DIFF  NOT = 0                       23080099
230900              DISPLAY WS-BLANK-30                                 23090099
231000                      'CONSLR-ACTL-DTE-DIFF  '                    23100099
231100                       CONSLR-ACTL-DTE-DIFF                       23110099
231200           END-IF                                                 23120099
231300           IF CONSLR-REQR-DTE-DIFF  NOT = 0                       23130099
231400              DISPLAY WS-BLANK-30                                 23140099
231500                      'CONSLR-REQR-DTE-DIFF  '                    23150099
231600                       CONSLR-REQR-DTE-DIFF                       23160099
231700           END-IF                                                 23170099
231800           IF CONSLR-RLSE-CDE-DIFF  NOT = 0                       23180099
231900              DISPLAY WS-BLANK-30                                 23190099
232000                      'CONSLR-RLSE-CDE-DIFF  '                    23200099
232100                       CONSLR-RLSE-CDE-DIFF                       23210099
232200           END-IF                                                 23220099
232300           IF TKT-MKR-ACTL-DTE-DIFF NOT = 0                       23230099
232400              DISPLAY WS-BLANK-30                                 23240099
232500                      'TKT-MKR-ACTL-DTE-DIFF '                    23250099
232600                       TKT-MKR-ACTL-DTE-DIFF                      23260099
232700           END-IF                                                 23270099
232800           IF TKT-MKR-REQR-DTE-DIFF NOT = 0                       23280099
232900              DISPLAY WS-BLANK-30                                 23290099
233000                      'TKT-MKR-REQR-DTE-DIFF '                    23300099
233100                       TKT-MKR-REQR-DTE-DIFF                      23310099
233200           END-IF                                                 23320099
233300           IF TKT-MKR-RLSE-CDE-DIFF NOT = 0                       23330099
233400              DISPLAY WS-BLANK-30                                 23340099
233500                      'TKT-MKR-RLSE-CDE-DIFF '                    23350099
233600                       TKT-MKR-RLSE-CDE-DIFF                      23360099
233700           END-IF                                                 23370099
233800           IF RLSE-DTE-DIFF         NOT = 0                       23380099
233900              DISPLAY WS-BLANK-30                                 23390099
234000                      'RLSE-DTE-DIFF         '                    23400099
234100                       RLSE-DTE-DIFF                              23410099
234200           END-IF                                                 23420099
234300           IF FRST-FCTRY-DTE-DIFF   NOT = 0                       23430099
234400              DISPLAY WS-BLANK-30                                 23440099
234500                      'FRST-FCTRY-DTE-DIFF   '                    23450099
234600                       FRST-FCTRY-DTE-DIFF                        23460099
234700           END-IF                                                 23470099
234800           IF LAST-FCTRY-DTE-DIFF   NOT = 0                       23480099
234900              DISPLAY WS-BLANK-30                                 23490099
235000                      'LAST-FCTRY-DTE-DIFF   '                    23500099
235100                       LAST-FCTRY-DTE-DIFF                        23510099
235200           END-IF                                                 23520099
235300           IF DIR-STR-IND-DIFF      NOT = 0                       23530099
235400              DISPLAY WS-BLANK-30                                 23540099
235500                      'DIR-STR-IND-DIFF      '                    23550099
235600                       DIR-STR-IND-DIFF                           23560099
235700           END-IF                                                 23570099
235800           IF EXTD-NOT-AFT-DTE-DIFF NOT = 0                       23580099
235900              DISPLAY WS-BLANK-30                                 23590099
236000                      'EXTD-NOT-AFT-DTE-DIFF '                    23600099
236100                       EXTD-NOT-AFT-DTE-DIFF                      23610099
236200           END-IF                                                 23620099
236300           IF HNG-IND-DIFF          NOT = 0                       23630099
236400              DISPLAY WS-BLANK-30                                 23640099
236500                      'HNG-IND-DIFF          '                    23650099
236600                       HNG-IND-DIFF                               23660099
236700           END-IF                                                 23670099
236800           IF NW-STR-ORD-IND-DIFF  NOT = 0                        23680099
236900              DISPLAY WS-BLANK-30                                 23690099
237000                      'NW-STR-ORD-IND-DIFF   '                    23700099
237100                       NW-STR-ORD-IND-DIFF                        23710099
237200           END-IF                                                 23720099
237300           IF PKGNG-CDE-DIFF        NOT = 0                       23730099
237400              DISPLAY WS-BLANK-30                                 23740099
237500                      'PKGNG-CDE-DIFF        '                    23750099
237600                       PKGNG-CDE-DIFF                             23760099
237700           END-IF                                                 23770099
237800           IF PKGNG-DESC-DIFF       NOT = 0                       23780099
237900              DISPLAY WS-BLANK-30                                 23790099
238000                      'PKGNG-DESC-DIFF         '                  23800099
238100                       PKGNG-DESC-DIFF                            23810099
238200           END-IF                                                 23820099
238300           IF PTKT-LDTM-DAYS-QTY-DIFF NOT = 0                     23830099
238400              DISPLAY WS-BLANK-30                                 23840099
238500                      'PTKT-LDTM-DAYS-QTY-DIFF  '                 23850099
238600                       PTKT-LDTM-DAYS-QTY-DIFF                    23860099
238700           END-IF                                                 23870099
238800           IF SEASET-SHRT-DESC-DIFF NOT = 0                       23880099
238900              DISPLAY WS-BLANK-30                                 23890099
239000                      'SEASET-SHRT-DESC-DIFF '                    23900099
239100                       SEASET-SHRT-DESC-DIFF                      23910099
239200           END-IF                                                 23920099
239300           IF SEASET-YR-DIFF        NOT = 0                       23930099
239400              DISPLAY WS-BLANK-30                                 23940099
239500                      'SEASET-YR-DIFF        '                    23950099
239600                       SEASET-YR-DIFF                             23960099
239700           END-IF                                                 23970099
239800           IF CRE-BY-USR-ID-DIFF    NOT = 0                       23980099
239900              DISPLAY WS-BLANK-30                                 23990099
240000                      'CRE-BY-USR-ID-DIFF    '                    24000099
240100                       CRE-BY-USR-ID-DIFF                         24010099
240200           END-IF                                                 24020099
240300           IF PTKT-IND-DIFF         NOT = 0                       24030099
240400              DISPLAY WS-BLANK-30                                 24040099
240500                      'PTKT-IND-DIFF         '                    24050099
240600                       PTKT-IND-DIFF                              24060099
240700           END-IF                                                 24070099
240800           IF C-O-PROD-CDE-DIFF     NOT = 0                       24080099
240900              DISPLAY WS-BLANK-30                                 24090099
241000                      'C-O-PROD-CDE-DIFF     '                    24100099
241100                       C-O-PROD-CDE-DIFF                          24110099
241200           END-IF                                                 24120099
241300           IF AGNT-OFC-CNTRY-CDE-DIFF NOT = 0                     24130099
241400              DISPLAY WS-BLANK-30                                 24140099
241500                      'AGNT-OFC-CNTRY-CDE-DIFF '                  24150099
241600                       AGNT-OFC-CNTRY-CDE-DIFF                    24160099
241700           END-IF                                                 24170099
241800           IF UNT-PER-CBMT-QTY-DIFF NOT = 0                       24180099
241900              DISPLAY WS-BLANK-30                                 24190099
242000                      'UNT-PER-CBMT-QTY-DIFF  '                   24200099
242100                       UNT-PER-CBMT-QTY-DIFF                      24210099
242200           END-IF                                                 24220099
242300           IF QTA-CTG-CDE-DIFF      NOT = 0                       24230099
242400              DISPLAY WS-BLANK-30                                 24240099
242500                      'QTA-CTG-CDE-DIFF      '                    24250099
242600                       QTA-CTG-CDE-DIFF                           24260099
242700           END-IF                                                 24270099
242800           IF IMPRT-VND-ID-DIFF     NOT = 0                       24280099
242900              DISPLAY WS-BLANK-30                                 24290099
243000                      'IMPRT-VND-ID-DIFF      '                   24300099
243100                       IMPRT-VND-ID-DIFF                          24310099
243200           END-IF                                                 24320099
243300           IF IMPRT-FCTRY-ID-DIFF   NOT = 0                       24330099
243400              DISPLAY WS-BLANK-30                                 24340099
243500                      'IMPRT-FCTRY-ID-DIFF    '                   24350099
243600                       IMPRT-FCTRY-ID-DIFF                        24360099
243700           END-IF                                                 24370099
243800           IF IMPRT-VND-NM-DIFF     NOT = 0                       24380099
243900              DISPLAY WS-BLANK-30                                 24390099
244000                      'IMPRT-VND-NM-DIFF      '                   24400099
244100                       IMPRT-VND-NM-DIFF                          24410099
244200           END-IF                                                 24420099
244300           IF IMPRT-FCTRY-NM-DIFF   NOT = 0                       24430099
244400              DISPLAY WS-BLANK-30                                 24440099
244500                      'IMPRT-FCTRY-NM-DIFF    '                   24450099
244600                       IMPRT-FCTRY-NM-DIFF                        24460099
244700           END-IF                                                 24470099
244800           IF DERVD-LBL-TYP-CDE-DIFF NOT = 0                      24480099
244900              DISPLAY WS-BLANK-30                                 24490099
245000                      'DERVD-LBL-TYP-CDE-DIFF '                   24500099
245100                       DERVD-LBL-TYP-CDE-DIFF                     24510099
245200           END-IF                                                 24520099
245300*  WR33239                                                        24530099
245400           IF DELY-ID-DIFF NOT = 0                                24540099
245500              DISPLAY WS-BLANK-30                                 24550099
245600                      'DELY-ID-DIFF '                             24560099
245700                       DELY-ID-DIFF                               24570099
245800           END-IF                                                 24580099
245900           IF PO-SHRT-CYC-IND-DIFF NOT = 0                        24590099
246000              DISPLAY WS-BLANK-30                                 24600099
246100                      'PO-SHRT-CYC-IND-DIFF'                      24610099
246200                       PO-SHRT-CYC-IND-DIFF                       24620099
246300           END-IF                                                 24630099
246400        END-IF                                                    24640099
246500     END-IF.                                                      24650099
246600                                                                  24660099
246700******************************************************************24670099
246800                                                                  24680099
246900     IF NUMBER-XXT-PO-INSTR     = 0 AND                           24690099
247000        NUMBER-PO-INSTR-RMS     = 0 AND                           24700099
247100        NUMBER-PO-INSTR-LGCY    = 0 AND                           24710099
247200        NUMBER-PO-INSTR-DATA                                      24720099
247300        CONTINUE                                                  24730099
247400     ELSE                                                         24740099
247500        DISPLAY ' '                                               24750099
247600        DISPLAY 'PO-INSTR ---------->'                            24760099
247700                ' - XLRD016 - 2 - '                               24770099
247800                WS-BLANK-03                                       24780099
247900                 NUMBER-PO-INSTR-DATA         ' - DATA'           24790099
248000                WS-BLANK-03                                       24800099
248100                 NUMBER-PO-INSTR-RMS          ' - RMS'            24810099
248200                WS-BLANK-03                                       24820099
248300                 NUMBER-PO-INSTR-LGCY         ' - LGCY'           24830099
248400                WS-BLANK-03                                       24840099
248500                 NUMBER-XXT-PO-INSTR          ' - TOTL'           24850099
248600                                                                  24860099
248700     END-IF.                                                      24870099
248800                                                                  24880099
248900        IF NUMBER-PO-INSTR-DATA  NOT = 0                          24890099
249000           IF IN-PO-NBR-DIFF              NOT = 0                 24900099
249100              DISPLAY WS-BLANK-30                                 24910099
249200                      'IN-PO-NBR-DIFF          '                  24920099
249300                       IN-PO-NBR-DIFF                             24930099
249400           END-IF                                                 24940099
249500           IF IN-RECIP-CDE-DIFF           NOT = 0                 24950099
249600              DISPLAY WS-BLANK-30                                 24960099
249700                      'IN-RECIP-CDE-DIFF     '                    24970099
249800                       IN-RECIP-CDE-DIFF                          24980099
249900           END-IF                                                 24990099
250000           IF IN-INSTR-DESC-DIFF           NOT = 0                25000099
250100              DISPLAY WS-BLANK-30                                 25010099
250200                      'IN-INSTR-DESC-DIFF '                       25020099
250300                       IN-INSTR-DESC-DIFF                         25030099
250400           END-IF                                                 25040099
250500     END-IF.                                                      25050099
250600                                                                  25060099
250700******************************************************************25070099
250800                                                                  25080099
250900     IF NUMBER-XXT-PO-DISC      = 0 AND                           25090099
251000        NUMBER-PO-DISC-RMS      = 0 AND                           25100099
251100        NUMBER-PO-DISC-LGCY     = 0 AND                           25110099
251200        NUMBER-PO-DISC-DATA                                       25120099
251300        CONTINUE                                                  25130099
251400     ELSE                                                         25140099
251500        DISPLAY ' '                                               25150099
251600        DISPLAY 'PO-DISC ----------->'                            25160099
251700                ' - XLRD017 - 3 - '                               25170099
251800                WS-BLANK-03                                       25180099
251900                 NUMBER-PO-DISC-DATA          ' - DATA'           25190099
252000                WS-BLANK-03                                       25200099
252100                 NUMBER-PO-DISC-RMS           ' - RMS'            25210099
252200                WS-BLANK-03                                       25220099
252300                 NUMBER-PO-DISC-LGCY          ' - LGCY'           25230099
252400                WS-BLANK-03                                       25240099
252500                 NUMBER-XXT-PO-DISC           ' - TOTL'           25250099
252600                                                                  25260099
252700        IF NUMBER-PO-DISC-DATA NOT = 0                            25270099
252800           IF DI-PO-NBR-DIFF              NOT = 0                 25280099
252900              DISPLAY WS-BLANK-30                                 25290099
253000                      'DI-PO-NBR-DIFF          '                  25300099
253100                       DI-PO-NBR-DIFF                             25310099
253200           END-IF                                                 25320099
253300           IF DI-DL-ID-DIFF               NOT = 0                 25330099
253400              DISPLAY WS-BLANK-30                                 25340099
253500                      'DI-DL-ID-DIFF           '                  25350099
253600                       DI-DL-ID-DIFF                              25360099
253700           END-IF                                                 25370099
253800           IF DI-DL-DTL-ID-DIFF           NOT = 0                 25380099
253900              DISPLAY WS-BLANK-30                                 25390099
254000                      'DI-DL-DTL-ID-DIFF       '                  25400099
254100                       DI-DL-DTL-ID-DIFF                          25410099
254200           END-IF                                                 25420099
254300           IF DI-DISC-TYPE-CDE-DIFF       NOT = 0                 25430099
254400              DISPLAY WS-BLANK-30                                 25440099
254500                      'DI-DISC-TYPE-CDE-DIFF   '                  25450099
254600                       DI-DISC-TYPE-CDE-DIFF                      25460099
254700           END-IF                                                 25470099
254800           IF DI-EXTD-DAYS-QTY-DIFF       NOT = 0                 25480099
254900              DISPLAY WS-BLANK-30                                 25490099
255000                      'DI-EXTD-DAYS-QTY-DIFF   '                  25500099
255100                       DI-EXTD-DAYS-QTY-DIFF                      25510099
255200           END-IF                                                 25520099
255300           IF DI-DISC-PCT-DIFF            NOT = 0                 25530099
255400              DISPLAY WS-BLANK-30                                 25540099
255500                      'DI-DISC-PCT-DIFF        '                  25550099
255600                       DI-DISC-PCT-DIFF                           25560099
255700           END-IF                                                 25570099
255800           IF DI-TOT-DISC-AMT-DIFF        NOT = 0                 25580099
255900              DISPLAY WS-BLANK-30                                 25590099
256000                      'DI-TOT-DISC-AMT-DIFF    '                  25600099
256100                       DI-TOT-DISC-AMT-DIFF                       25610099
256200           END-IF                                                 25620099
256300     END-IF.                                                      25630099
256400                                                                  25640099
256500******************************************************************25650099
256600                                                                  25660099
256700     IF NUMBER-XXT-PO-SKU       = 0 AND                           25670099
256800        NUMBER-PO-SKU-RMS       = 0 AND                           25680099
256900        NUMBER-PO-SKU-LGCY      = 0 AND                           25690099
257000        NUMBER-PO-SKU-DATA                                        25700099
257100        CONTINUE                                                  25710099
257200     ELSE                                                         25720099
257300        DISPLAY ' '                                               25730099
257400        DISPLAY 'PO-SKU ------------>'                            25740099
257500                ' - XLRD018 - 4 - '                               25750099
257600                WS-BLANK-03                                       25760099
257700                 NUMBER-PO-SKU-DATA           ' - DATA'           25770099
257800                WS-BLANK-03                                       25780099
257900                 NUMBER-PO-SKU-RMS            ' - RMS'            25790099
258000                WS-BLANK-03                                       25800099
258100                 NUMBER-PO-SKU-LGCY           ' - LGCY'           25810099
258200                WS-BLANK-03                                       25820099
258300                 NUMBER-XXT-PO-SKU            ' - TOTL'           25830099
258400                                                                  25840099
258500        IF NUMBER-PO-SKU-DATA NOT = 0                             25850099
258600           IF SK-PO-NBR-DIFF               NOT = 0                25860099
258700              DISPLAY WS-BLANK-30                                 25870099
258800                   'SK-PO-NBR-DIFF           '                    25880099
258900                    SK-PO-NBR-DIFF                                25890099
259000           END-IF                                                 25900099
259100           IF SK-SKU-NBR-DIFF               NOT = 0               25910099
259200              DISPLAY WS-BLANK-30                                 25920099
259300                   'SK-SKU-NBR-DIFF          '                    25930099
259400                    SK-SKU-NBR-DIFF                               25940099
259500           END-IF                                                 25950099
259600           IF SK-UNT-COST-AMT-DIFF         NOT = 0                25960099
259700              DISPLAY WS-BLANK-30                                 25970099
259800                   'SK-UNT-COST-AMT-DIFF     '                    25980099
259900                    SK-UNT-COST-AMT-DIFF                          25990099
260000           END-IF                                                 26000099
260100                                                                  26010099
260200           IF SK-FRST-COST-AMT-DIFF        NOT = 0                26020099
260300              DISPLAY WS-BLANK-30                                 26030099
260400                   'SK-FRST-COST-AMT-DIFF    '                    26040099
260500                    SK-FRST-COST-AMT-DIFF                         26050099
260600           END-IF                                                 26060099
260700           IF SK-VND-QTY-DIFF              NOT = 0                26070099
260800              DISPLAY WS-BLANK-30                                 26080099
260900                   'SK-VND-QTY-DIFF          '                    26090099
261000                    SK-VND-QTY-DIFF                               26100099
261100           END-IF                                                 26110099
261101*GB 3/20/12                                                       26110199
261110           IF SK-INPK-QTY-DIFF             NOT = 0                26111099
261120              DISPLAY WS-BLANK-30                                 26112099
261130                   'SK-INPK-QTY-DIFF          '                   26113099
261140                    SK-INPK-QTY-DIFF                              26114099
261150           END-IF                                                 26115099
261151           IF SK-OTPK-QTY-DIFF             NOT = 0                26115199
261152              DISPLAY WS-BLANK-30                                 26115299
261153                   'SK-OTPK-QTY-DIFF          '                   26115399
261154                    SK-OTPK-QTY-DIFF                              26115499
261155           END-IF                                                 26115599
261160*GB 3/20/12                                                       26116099
261200           IF SK-PROMO-STRT-DTE-DIFF       NOT = 0                26120099
261300              DISPLAY WS-BLANK-30                                 26130099
261400                   'SK-PROMO-STRT-DTE-DIFF   '                    26140099
261500                    SK-PROMO-STRT-DTE-DIFF                        26150099
261600           END-IF                                                 26160099
261700           IF SK-PIC-SKU-IND-DIFF          NOT = 0                26170099
261800              DISPLAY WS-BLANK-30                                 26180099
261900                   'SK-PIC-SKU-IND-DIFF       '                   26190099
262000                    SK-PIC-SKU-IND-DIFF                           26200099
262100           END-IF                                                 26210099
262200           IF SK-ORIG-ORD-QTY-DIFF         NOT = 0                26220099
262300              DISPLAY WS-BLANK-30                                 26230099
262400                   'SK-ORIG-ORD-QTY-DIFF      '                   26240099
262500                    SK-ORIG-ORD-QTY-DIFF                          26250099
262600           END-IF                                                 26260099
262700           IF SK-ORD-QTY-DIFF              NOT = 0                26270099
262800              DISPLAY WS-BLANK-30                                 26280099
262900                   'SK-ORD-QTY-DIFF         '                     26290099
263000                    SK-ORD-QTY-DIFF                               26300099
263100           END-IF                                                 26310099
263200           IF SK-CNCLD-QTY-DIFF            NOT = 0                26320099
263300              DISPLAY WS-BLANK-30                                 26330099
263400                   'SK-CNCLD-QTY-DIFF       '                     26340099
263500                    SK-CNCLD-QTY-DIFF                             26350099
263600           END-IF                                                 26360099
263700           IF SK-PK-SKU-IND-DIFF           NOT = 0                26370099
263800              DISPLAY WS-BLANK-30                                 26380099
263900                   'SK-PK-SKU-IND-DIFF       '                    26390099
264000                    SK-PK-SKU-IND-DIFF                            26400099
264100           END-IF                                                 26410099
264200           IF SK-PK-SKU-DESC-DIFF          NOT = 0                26420099
264300              DISPLAY WS-BLANK-30                                 26430099
264400                   'SK-PK-SKU-DESC-DIFF       '                   26440099
264500                    SK-PK-SKU-DESC-DIFF                           26450099
264600           END-IF                                                 26460099
264700           IF SK-DC-ORD-MULT-QTY-DIFF      NOT = 0                26470099
264800              DISPLAY WS-BLANK-30                                 26480099
264900                   'SK-DC-ORD-MULT-QTY-DIFF   '                   26490099
265000                    SK-DC-ORD-MULT-QTY-DIFF                       26500099
265100           END-IF                                                 26510099
265200     END-IF.                                                      26520099
265300                                                                  26530099
265400******************************************************************26540099
265500                                                                  26550099
265600     IF NUMBER-XXT-PO-PK-SKU    = 0 AND                           26560099
265700        NUMBER-PO-PK-SKU-RMS    = 0 AND                           26570099
265800        NUMBER-PO-PK-SKU-LGCY   = 0 AND                           26580099
265900        NUMBER-PO-PK-SKU-DATA                                     26590099
266000        CONTINUE                                                  26600099
266100     ELSE                                                         26610099
266200        DISPLAY ' '                                               26620099
266300        DISPLAY 'PO-PK-SKU --------->'                            26630099
266400                ' - XLRD021 - 5 - '                               26640099
266500                WS-BLANK-03                                       26650099
266600                 NUMBER-PO-PK-SKU-DATA        ' - DATA'           26660099
266700                WS-BLANK-03                                       26670099
266800                 NUMBER-PO-PK-SKU-RMS         ' - RMS'            26680099
266900                WS-BLANK-03                                       26690099
267000                 NUMBER-PO-PK-SKU-LGCY        ' - LGCY'           26700099
267100                WS-BLANK-03                                       26710099
267200                 NUMBER-XXT-PO-PK-SKU         ' - TOTL'           26720099
267300                                                                  26730099
267400        IF NUMBER-PO-PK-SKU-DATA NOT = 0                          26740099
267500           IF PB-PO-NBR-DIFF               NOT = 0                26750099
267600              DISPLAY WS-BLANK-30                                 26760099
267700                   'PB-PO-NBR-DIFF           '                    26770099
267800                    PB-PO-NBR-DIFF                                26780099
267900           END-IF                                                 26790099
268000           IF PB-PK-SKU-NBR-DIFF           NOT = 0                26800099
268100              DISPLAY WS-BLANK-30                                 26810099
268200                   'PB-PK-SKU-NBR-DIFF       '                    26820099
268300                    PB-PK-SKU-NBR-DIFF                            26830099
268400           END-IF                                                 26840099
268500           IF PB-SKU-NBR-DIFF              NOT = 0                26850099
268600              DISPLAY WS-BLANK-30                                 26860099
268700                   'PB-SKU-NBR-DIFF          '                    26870099
268800                    PB-SKU-NBR-DIFF                               26880099
268900           END-IF                                                 26890099
269000           IF PB-UNT-COST-AMT-DIFF         NOT = 0                26900099
269100              DISPLAY WS-BLANK-30                                 26910099
269200                   'PB-UNT-COST-AMT-DIFF     '                    26920099
269300                    PB-UNT-COST-AMT-DIFF                          26930099
269400           END-IF                                                 26940099
269500           IF PB-FRST-COST-AMT-DIFF        NOT = 0                26950099
269600              DISPLAY WS-BLANK-30                                 26960099
269700                   'PB-FRST-COST-AMT-DIFF    '                    26970099
269800                    PB-FRST-COST-AMT-DIFF                         26980099
269900           END-IF                                                 26990099
270000           IF PB-UNT-RTL-AMT-DIFF          NOT = 0                27000099
270100              DISPLAY WS-BLANK-30                                 27010099
270200                   'PB-UNT-RTL-AMT-DIFF      '                    27020099
270300                    PB-UNT-RTL-AMT-DIFF                           27030099
270400           END-IF                                                 27040099
270500           IF PB-GP-RTL-AMT-DIFF           NOT = 0                27050099
270600              DISPLAY WS-BLANK-30                                 27060099
270700                   'PB-GP-RTL-AMT-DIFF       '                    27070099
270800                    PB-GP-RTL-AMT-DIFF                            27080099
270900           END-IF                                                 27090099
271000           IF PB-GP-RTL-QTY-DIFF           NOT = 0                27100099
271100              DISPLAY WS-BLANK-30                                 27110099
271200                   'PB-GP-RTL-QTY-DIFF       '                    27120099
271300                    PB-GP-RTL-QTY-DIFF                            27130099
271400           END-IF                                                 27140099
271500           IF PB-RATO-UNT-QTY-DIFF         NOT = 0                27150099
271600              DISPLAY WS-BLANK-30                                 27160099
271700                   'PB-RATO-UNT-QTY-DIFF     '                    27170099
271800                    PB-RATO-UNT-QTY-DIFF                          27180099
271900           END-IF                                                 27190099
271910           IF PB-INPK-UNT-QTY-DIFF         NOT = 0                27191099
271920              DISPLAY WS-BLANK-30                                 27192099
271930                   'PB-INPK-UNT-QTY-DIFF     '                    27193099
271940                    PB-INPK-UNT-QTY-DIFF                          27194099
271950           END-IF                                                 27195099
271960           IF PB-OTPK-UNT-QTY-DIFF         NOT = 0                27196099
271970              DISPLAY WS-BLANK-30                                 27197099
271980                   'PB-OTPK-UNT-QTY-DIFF     '                    27198099
271990                    PB-OTPK-UNT-QTY-DIFF                          27199099
271991           END-IF                                                 27199199
272000        END-IF                                                    27200099
272100     END-IF.                                                      27210099
272200                                                                  27220099
272300******************************************************************27230099
272400                                                                  27240099
272500     IF NUMBER-XXT-PO-PK-SKU-LOC = 0 AND                          27250099
272600        NUMBER-PO-PK-SKU-LOC-RMS = 0 AND                          27260099
272700        NUMBER-PO-PK-SKU-LOC-LGCY = 0 AND                         27270099
272800        NUMBER-PO-PK-SKU-LOC-DATA                                 27280099
272900        CONTINUE                                                  27290099
273000     ELSE                                                         27300099
273100        DISPLAY ' '                                               27310099
273200        DISPLAY 'PO-PK-SKU-LOC ----->'                            27320099
273300                ' - XLRD022 - 6 - '                               27330099
273400                WS-BLANK-03                                       27340099
273500                 NUMBER-PO-PK-SKU-LOC-DATA    ' - DATA'           27350099
273600                WS-BLANK-03                                       27360099
273700                 NUMBER-PO-PK-SKU-LOC-RMS     ' - RMS'            27370099
273800                WS-BLANK-03                                       27380099
273900                 NUMBER-PO-PK-SKU-LOC-LGCY    ' - LGCY'           27390099
274000                WS-BLANK-03                                       27400099
274100                 NUMBER-XXT-PO-PK-SKU-LOC     ' - TOTL'           27410099
274200                                                                  27420099
274300        IF NUMBER-PO-PK-SKU-LOC-DATA NOT = 0                      27430099
274400           IF PL-PO-NBR-DIFF               NOT = 0                27440099
274500              DISPLAY WS-BLANK-30                                 27450099
274600                   'PL-PO-NBR-DIFF           '                    27460099
274700                    PL-PO-NBR-DIFF                                27470099
274800           END-IF                                                 27480099
274900           IF PL-SKU-NBR-DIFF              NOT = 0                27490099
275000              DISPLAY WS-BLANK-30                                 27500099
275100                   'PL-SKU-NBR-DIFF          '                    27510099
275200                    PL-SKU-NBR-DIFF                               27520099
275300           END-IF                                                 27530099
275400           IF PL-PK-SKU-NBR-DIFF           NOT = 0                27540099
275500              DISPLAY WS-BLANK-30                                 27550099
275600                   'PL-PK-SKU-NBR-DIFF       '                    27560099
275700                    PL-PK-SKU-NBR-DIFF                            27570099
275800           END-IF                                                 27580099
275900           IF PL-LOC-NBR-DIFF              NOT = 0                27590099
276000              DISPLAY WS-BLANK-30                                 27600099
276100                   'PL-LOC-NBR-DIFF          '                    27610099
276200                    PL-LOC-NBR-DIFF                               27620099
276300           END-IF                                                 27630099
276400        END-IF                                                    27640099
276500     END-IF.                                                      27650099
276600                                                                  27660099
276700******************************************************************27670099
276800                                                                  27680099
276900     IF NUMBER-XXT-PO-INBD-ALLOC = 0 AND                          27690099
277000        NUMBER-PO-INBD-ALLOC-RMS = 0 AND                          27700099
277100        NUMBER-PO-INBD-ALLOC-LGCY = 0 AND                         27710099
277200        NUMBER-PO-INBD-ALLOC-DATA                                 27720099
277300        CONTINUE                                                  27730099
277400     ELSE                                                         27740099
277500        DISPLAY ' '                                               27750099
277600        DISPLAY 'PO-INBD-ALLOC ----->'                            27760099
277700                ' - XLRD019 - 7 - '                               27770099
277800                WS-BLANK-03                                       27780099
277900                 NUMBER-PO-INBD-ALLOC-DATA    ' - DATA'           27790099
278000                WS-BLANK-03                                       27800099
278100                 NUMBER-PO-INBD-ALLOC-RMS     ' - RMS'            27810099
278200                WS-BLANK-03                                       27820099
278300                 NUMBER-PO-INBD-ALLOC-LGCY    ' - LGCY'           27830099
278400                WS-BLANK-03                                       27840099
278500                 NUMBER-XXT-PO-INBD-ALLOC     ' - TOTL'           27850099
278600                                                                  27860099
278700        IF NUMBER-PO-INBD-ALLOC-DATA NOT = 0                      27870099
278800           IF LO-PO-NBR-DIFF               NOT = 0                27880099
278900              DISPLAY WS-BLANK-30                                 27890099
279000                   'LO-PO-NBR-DIFF           '                    27900099
279100                    LO-PO-NBR-DIFF                                27910099
279200           END-IF                                                 27920099
279300           IF LO-SKU-NBR-DIFF              NOT = 0                27930099
279400              DISPLAY WS-BLANK-30                                 27940099
279500                   'LO-SKU-NBR-DIFF          '                    27950099
279600                    LO-SKU-NBR-DIFF                               27960099
279700           END-IF                                                 27970099
279800           IF LO-LOC-NBR-DIFF              NOT = 0                27980099
279900              DISPLAY WS-BLANK-30                                 27990099
280000                   'LO-LOC-NBR-DIFF          '                    28000099
280100                    LO-LOC-NBR-DIFF                               28010099
280200           END-IF                                                 28020099
280300           IF LO-LOC-TYP-CDE-DIFF          NOT = 0                28030099
280400              DISPLAY WS-BLANK-30                                 28040099
280500                   'LO-LOC-TYP-CDE-DIFF      '                    28050099
280600                    LO-LOC-TYP-CDE-DIFF                           28060099
280700           END-IF                                                 28070099
280800           IF SK-UNT-RTL-AMT-DIFF          NOT = 0                28080099
280900              DISPLAY WS-BLANK-30                                 28090099
281000                   'SK-UNT-RTL-AMT-DIFF      '                    28100099
281100                    SK-UNT-RTL-AMT-DIFF                           28110099
281200           END-IF                                                 28120099
281300           IF SK-GP-RTL-AMT-DIFF           NOT = 0                28130099
281400              DISPLAY WS-BLANK-30                                 28140099
281500                   'SK-GP-RTL-AMT-DIFF       '                    28150099
281600                    SK-GP-RTL-AMT-DIFF                            28160099
281700           END-IF                                                 28170099
281800           IF SK-GP-RTL-QTY-DIFF           NOT = 0                28180099
281900              DISPLAY WS-BLANK-30                                 28190099
282000                   'SK-GP-RTL-QTY-DIFF       '                    28200099
282100                    SK-GP-RTL-QTY-DIFF                            28210099
282200           END-IF                                                 28220099
282300           IF LO-ORD-QTY-DIFF              NOT = 0                28230099
282400              DISPLAY WS-BLANK-30                                 28240099
282500                   'LO-ORD-QTY-DIFF          '                    28250099
282600                    LO-ORD-QTY-DIFF                               28260099
282700           END-IF                                                 28270099
282800           IF LO-ORIG-ORD-QTY-DIFF         NOT = 0                28280099
282900              DISPLAY WS-BLANK-30                                 28290099
283000                   'LO-ORIG-ORD-QTY-DIFF     '                    28300099
283100                    LO-ORIG-ORD-QTY-DIFF                          28310099
283200           END-IF                                                 28320099
283300           IF LO-CNCLD-QTY-DIFF            NOT = 0                28330099
283400              DISPLAY WS-BLANK-30                                 28340099
283500                   'LO-CNCLD-QTY-DIFF        '                    28350099
283600                    LO-CNCLD-QTY-DIFF                             28360099
283700           END-IF                                                 28370099
283800           IF LO-CNCL-CDE-DIFF             NOT = 0                28380099
283900              DISPLAY WS-BLANK-30                                 28390099
284000                   'LO-CNCL-CDE-DIFF         '                    28400099
284100                    LO-CNCL-CDE-DIFF                              28410099
284200           END-IF                                                 28420099
284300           IF LO-CNCL-DTE-DIFF             NOT = 0                28430099
284400              DISPLAY WS-BLANK-30                                 28440099
284500                   'LO-CNCL-DTE-DIFF         '                    28450099
284600                    LO-CNCL-DTE-DIFF                              28460099
284700           END-IF                                                 28470099
284800           IF LO-CNCLD-BY-USR-ID-DIFF      NOT = 0                28480099
284900              DISPLAY WS-BLANK-30                                 28490099
285000                   'LO-CNCLD-BY-USR-ID-DIFF  '                    28500099
285100                    LO-CNCLD-BY-USR-ID-DIFF                       28510099
285200           END-IF                                                 28520099
285300           IF LO-DC-ALLC-MULT-QTY-DIFF     NOT = 0                28530099
285400              DISPLAY WS-BLANK-30                                 28540099
285500                   'LO-DC-ALLC-MULT-QTY-DIFF '                    28550099
285600                    LO-DC-ALLC-MULT-QTY-DIFF                      28560099
285700           END-IF                                                 28570099
285800           IF LO-STR-ALLC-MLT-QTY-DIFF     NOT = 0                28580099
285900              DISPLAY WS-BLANK-30                                 28590099
286000                   'LO-STR-ALLC-MLT-QTY-DIFF '                    28600099
286100                    LO-STR-ALLC-MLT-QTY-DIFF                      28610099
286200           END-IF                                                 28620099
286300           IF LO-ALLOC-RND-CDE-DIFF        NOT = 0                28630099
286400              DISPLAY WS-BLANK-30                                 28640099
286500                   'LO-ALLOC-RND-CDE-DIFF    '                    28650099
286600                    LO-ALLOC-RND-CDE-DIFF                         28660099
286700           END-IF                                                 28670099
286800           IF LO-SHTG-PRT-OPT-CDE-DIFF     NOT = 0                28680099
286900              DISPLAY WS-BLANK-30                                 28690099
287000                   'LO-SHTG-PRT-OPT-CDE-DIFF '                    28700099
287100                    LO-SHTG-PRT-OPT-CDE-DIFF                      28710099
287200           END-IF                                                 28720099
287300           IF LO-OVRG-PRT-OPT-CDE-DIFF     NOT = 0                28730099
287400              DISPLAY WS-BLANK-30                                 28740099
287500                   'LO-OVRG-PRT-OPT-CDE-DIFF '                    28750099
287600                    LO-OVRG-PRT-OPT-CDE-DIFF                      28760099
287700           END-IF                                                 28770099
287800           IF LO-EXT-SHTG-THR-IND-DIFF     NOT = 0                28780099
287900              DISPLAY WS-BLANK-30                                 28790099
288000                   'LO-EXT-SHTG-THR-IND-DIFF '                    28800099
288100                    LO-EXT-SHTG-THR-IND-DIFF                      28810099
288200           END-IF                                                 28820099
288300        END-IF                                                    28830099
288400     END-IF.                                                      28840099
288500                                                                  28850099
288600******************************************************************28860099
288700                                                                  28870099
288800     IF NUMBER-XXT-PO-OUTBND-ALLOC = 0 AND                        28880099
288900        NUMBER-PO-OUTBND-ALLOC-RMS = 0 AND                        28890099
289000        NUMBER-PO-OUTBND-ALLOC-LGCY = 0 AND                       28900099
289100        NUMBER-PO-OUTBND-ALLOC-DATA                               28910099
289200        CONTINUE                                                  28920099
289300     ELSE                                                         28930099
289400        DISPLAY ' '                                               28940099
289500        DISPLAY 'PO-OUTBND-ALLOC --->'                            28950099
289600                ' - XLRD020 - 8 - '                               28960099
289700                WS-BLANK-03                                       28970099
289800                 NUMBER-PO-OUTBND-ALLOC-DATA  ' - DATA'           28980099
289900                WS-BLANK-03                                       28990099
290000                 NUMBER-PO-OUTBND-ALLOC-RMS   ' - RMS'            29000099
290100                WS-BLANK-03                                       29010099
290200                 NUMBER-PO-OUTBND-ALLOC-LGCY ' - LGCY'            29020099
290300                WS-BLANK-03                                       29030099
290400                 NUMBER-XXT-PO-OUTBND-ALLOC  ' - TOTL'            29040099
290500                                                                  29050099
290600        IF NUMBER-PO-OUTBND-ALLOC-DATA NOT = 0                    29060099
290700           IF SB-PO-NBR-DIFF               NOT = 0                29070099
290800              DISPLAY WS-BLANK-30                                 29080099
290900                   'SB-PO-NBR-DIFF           '                    29090099
291000                    SB-PO-NBR-DIFF                                29100099
291100           END-IF                                                 29110099
291200           IF SB-SKU-NBR-DIFF              NOT = 0                29120099
291300              DISPLAY WS-BLANK-30                                 29130099
291400                   'SB-SKU-NBR-DIFF          '                    29140099
291500                    SB-SKU-NBR-DIFF                               29150099
291600           END-IF                                                 29160099
291700           IF SB-LOC-NBR-DIFF              NOT = 0                29170099
291800              DISPLAY WS-BLANK-30                                 29180099
291900                   'SB-LOC-NBR-DIFF          '                    29190099
292000                    SB-LOC-NBR-DIFF                               29200099
292100           END-IF                                                 29210099
292200           IF SB-STR-NBR-DIFF              NOT = 0                29220099
292300              DISPLAY WS-BLANK-30                                 29230099
292400                   'SB-STR-NBR-DIFF          '                    29240099
292500                    SB-STR-NBR-DIFF                               29250099
292600           END-IF                                                 29260099
292700           IF SB-RNK-SEQ-NBR-DIFF          NOT = 0                29270099
292800              DISPLAY WS-BLANK-30                                 29280099
292900                   'SB-RNK-SEQ-NBR-DIFF      '                    29290099
293000                    SB-RNK-SEQ-NBR-DIFF                           29300099
293100           END-IF                                                 29310099
293200           IF SB-ALLOC-QTY-DIFF            NOT = 0                29320099
293300              DISPLAY WS-BLANK-30                                 29330099
293400                   'SB-ALLOC-QTY-DIFF        '                    29340099
293500                    SB-ALLOC-QTY-DIFF                             29350099
293600           END-IF                                                 29360099
293700           IF SB-ALLOC-SEQ-CDE-DIFF        NOT = 0                29370099
293800              DISPLAY WS-BLANK-30                                 29380099
293900                   'SB-ALLOC-SEQ-CDE-DIFF    '                    29390099
294000                    SB-ALLOC-SEQ-CDE-DIFF                         29400099
294100           END-IF                                                 29410099
294200           IF SB-STR-CNSTR-CDE-DIFF        NOT = 0                29420099
294300              DISPLAY WS-BLANK-30                                 29430099
294400                   'SB-STR-CNSTR-CDE-DIFF    '                    29440099
294500                    SB-STR-CNSTR-CDE-DIFF                         29450099
294600           END-IF                                                 29460099
294700           IF SB-STR-CNSTR-QTY-DIFF        NOT = 0                29470099
294800              DISPLAY WS-BLANK-30                                 29480099
294900                   'SB-STR-CNSTR-QTY-DIFF    '                    29490099
295000                    SB-STR-CNSTR-QTY-DIFF                         29500099
295100           END-IF                                                 29510099
295200        END-IF                                                    29520099
295300     END-IF.                                                      29530099
295400                                                                  29540099
295500     PERFORM P4100-TOTAL-COUNTS THRU                              29550099
295600             P4100-EXIT.                                          29560099
295700                                                                  29570099
295800     PERFORM 3000-WRITE-COUNTS THRU                               29580099
295900             3000-EXIT.                                           29590099
296000                                                                  29600099
296100     INITIALIZE PO-COUNT-FIELDS.                                  29610099
296200                                                                  29620099
296300 4000-EXIT. EXIT.                                                 29630099
296400                                                                  29640099
296500 P4100-TOTAL-COUNTS.                                              29650099
296600                                                                  29660099
296700     ADD NUMBER-XXT-PO                TO TTL-XXT-PO.              29670099
296800     ADD NUMBER-XXT-PO-INSTR          TO TTL-XXT-PO-INSTR.        29680099
296900     ADD NUMBER-XXT-PO-DISC           TO TTL-XXT-PO-DISC.         29690099
297000     ADD NUMBER-XXT-PO-SKU            TO TTL-XXT-PO-SKU.          29700099
297100     ADD NUMBER-XXT-PO-PK-SKU         TO TTL-XXT-PO-PK-SKU.       29710099
297200     ADD NUMBER-XXT-PO-PK-SKU-LOC     TO TTL-XXT-PO-PK-SKU-LOC.   29720099
297300     ADD NUMBER-XXT-PO-INBD-ALLOC     TO TTL-XXT-PO-INBD-ALLOC.   29730099
297400     ADD NUMBER-XXT-PO-OUTBND-ALLOC   TO TTL-XXT-PO-OUTBND-ALLOC. 29740099
297500     ADD NUMBER-PO-HDR-RMS            TO TTL-PO-HDR-RMS.          29750099
297600     ADD NUMBER-PO-HDR-LGCY           TO TTL-PO-HDR-LGCY.         29760099
297700     ADD NUMBER-PO-HDR-DATA           TO TTL-PO-HDR-DATA.         29770099
297800     ADD NUMBER-PO-INSTR-RMS          TO TTL-PO-INSTR-RMS.        29780099
297900     ADD NUMBER-PO-INSTR-LGCY         TO TTL-PO-INSTR-LGCY.       29790099
298000     ADD NUMBER-PO-INSTR-DATA         TO TTL-PO-INSTR-DATA.       29800099
298100     ADD NUMBER-PO-DISC-RMS           TO TTL-PO-DISC-RMS.         29810099
298200     ADD NUMBER-PO-DISC-LGCY          TO TTL-PO-DISC-LGCY.        29820099
298300     ADD NUMBER-PO-DISC-DATA          TO TTL-PO-DISC-DATA.        29830099
298400     ADD NUMBER-PO-SKU-RMS            TO TTL-PO-SKU-RMS.          29840099
298500     ADD NUMBER-PO-SKU-LGCY           TO TTL-PO-SKU-LGCY.         29850099
298600     ADD NUMBER-PO-SKU-DATA           TO TTL-PO-SKU-DATA.         29860099
298700     ADD NUMBER-PO-PK-SKU-RMS         TO TTL-PO-PK-SKU-RMS.       29870099
298800     ADD NUMBER-PO-PK-SKU-LGCY        TO TTL-PO-PK-SKU-LGCY.      29880099
298900     ADD NUMBER-PO-PK-SKU-DATA        TO TTL-PO-PK-SKU-DATA.      29890099
299000     ADD NUMBER-PO-PK-SKU-LOC-RMS     TO TTL-PO-PK-SKU-LOC-RMS.   29900099
299100     ADD NUMBER-PO-PK-SKU-LOC-LGCY TO TTL-PO-PK-SKU-LOC-LGCY.     29910099
299200     ADD NUMBER-PO-PK-SKU-LOC-DATA    TO TTL-PO-PK-SKU-LOC-DATA.  29920099
299300     ADD NUMBER-PO-INBD-ALLOC-RMS     TO TTL-PO-INBD-ALLOC-RMS.   29930099
299400     ADD NUMBER-PO-INBD-ALLOC-LGCY    TO TTL-PO-INBD-ALLOC-LGCY.  29940099
299500     ADD NUMBER-PO-INBD-ALLOC-DATA    TO TTL-PO-INBD-ALLOC-DATA.  29950099
299600     ADD NUMBER-PO-OUTBND-ALLOC-RMS  TO  TTL-PO-OUTBND-ALLOC-RMS. 29960099
299700     ADD NUMBER-PO-OUTBND-ALLOC-LGCY TO TTL-PO-OUTBND-ALLOC-LGCY. 29970099
299800     ADD NUMBER-PO-OUTBND-ALLOC-DATA TO TTL-PO-OUTBND-ALLOC-DATA. 29980099
299900                                                                  29990099
300000     ADD IN-PO-NBR-DIFF           TO   TTL-IN-PO-NBR-DIFF.        30000099
300100     ADD IN-RECIP-CDE-DIFF        TO   TTL-IN-RECIP-CDE-DIFF.     30010099
300200     ADD IN-INSTR-DESC-DIFF       TO   TTL-IN-INSTR-DESC-DIFF.    30020099
300300                                                                  30030099
300400     ADD DI-PO-NBR-DIFF           TO   TTL-DI-PO-NBR-DIFF.        30040099
300500     ADD DI-DL-ID-DIFF            TO   TTL-DI-DL-ID-DIFF.         30050099
300600     ADD DI-DL-DTL-ID-DIFF        TO   TTL-DI-DL-DTL-ID-DIFF.     30060099
300700     ADD DI-DISC-TYPE-CDE-DIFF    TO   TTL-DI-DISC-TYPE-CDE-DIFF. 30070099
300800     ADD DI-EXTD-DAYS-QTY-DIFF    TO   TTL-DI-EXTD-DAYS-QTY-DIFF. 30080099
300900     ADD DI-DISC-PCT-DIFF         TO   TTL-DI-DISC-PCT-DIFF.      30090099
301000     ADD DI-TOT-DISC-AMT-DIFF     TO   TTL-DI-TOT-DISC-AMT-DIFF.  30100099
301100                                                                  30110099
301200     ADD SK-PO-NBR-DIFF           TO  TTL-SK-PO-NBR-DIFF.         30120099
301300     ADD SK-SKU-NBR-DIFF          TO  TTL-SK-SKU-NBR-DIFF.        30130099
301400     ADD SK-UNT-COST-AMT-DIFF     TO  TTL-SK-UNT-COST-AMT-DIFF.   30140099
301500     ADD SK-FRST-COST-AMT-DIFF    TO  TTL-SK-FRST-COST-AMT-DIFF.  30150099
301600     ADD SK-VND-QTY-DIFF          TO  TTL-SK-VND-QTY-DIFF.        30160099
301610*GB 3/20/12                                                       30161099
301700     ADD SK-INPK-QTY-DIFF         TO  TTL-SK-INPK-QTY-DIFF.       30170099
301701     ADD SK-OTPK-QTY-DIFF         TO  TTL-SK-OTPK-QTY-DIFF.       30170199
301710*GB 3/20/12                                                       30171099
301800     ADD SK-PROMO-STRT-DTE-DIFF   TO  TTL-SK-PROMO-STRT-DTE-DIFF. 30180099
301900     ADD SK-PIC-SKU-IND-DIFF      TO  TTL-SK-PIC-SKU-IND-DIFF.    30190099
302000     ADD SK-ORIG-ORD-QTY-DIFF     TO  TTL-SK-ORIG-ORD-QTY-DIFF.   30200099
302100     ADD SK-ORD-QTY-DIFF          TO  TTL-SK-ORD-QTY-DIFF.        30210099
302200     ADD SK-CNCLD-QTY-DIFF        TO  TTL-SK-CNCLD-QTY-DIFF.      30220099
302300     ADD SK-PK-SKU-IND-DIFF       TO  TTL-SK-PK-SKU-IND-DIFF.     30230099
302400     ADD SK-PK-SKU-DESC-DIFF      TO  TTL-SK-PK-SKU-DESC-DIFF.    30240099
302500     ADD SK-DC-ORD-MULT-QTY-DIFF  TO TTL-SK-DC-ORD-MULT-QTY-DIFF. 30250099
302600                                                                  30260099
302700     ADD LO-PO-NBR-DIFF           TO TTL-LO-PO-NBR-DIFF.          30270099
302800     ADD LO-SKU-NBR-DIFF          TO TTL-LO-SKU-NBR-DIFF.         30280099
302900     ADD LO-LOC-NBR-DIFF          TO TTL-LO-LOC-NBR-DIFF.         30290099
303000     ADD LO-LOC-TYP-CDE-DIFF      TO TTL-LO-LOC-TYP-CDE-DIFF.     30300099
303100     ADD SK-UNT-RTL-AMT-DIFF      TO TTL-SK-UNT-RTL-AMT-DIFF.     30310099
303200     ADD SK-GP-RTL-AMT-DIFF       TO TTL-SK-GP-RTL-AMT-DIFF.      30320099
303300     ADD SK-GP-RTL-QTY-DIFF       TO TTL-SK-GP-RTL-QTY-DIFF.      30330099
303400     ADD LO-ORD-QTY-DIFF          TO TTL-LO-ORD-QTY-DIFF.         30340099
303500     ADD LO-ORIG-ORD-QTY-DIFF     TO TTL-LO-ORIG-ORD-QTY-DIFF.    30350099
303600     ADD LO-CNCLD-QTY-DIFF        TO TTL-LO-CNCLD-QTY-DIFF.       30360099
303700     ADD LO-CNCL-CDE-DIFF         TO TTL-LO-CNCL-CDE-DIFF.        30370099
303800     ADD LO-CNCL-DTE-DIFF         TO TTL-LO-CNCL-DTE-DIFF.        30380099
303900     ADD LO-CNCLD-BY-USR-ID-DIFF  TO                              30390099
304000                            TTL-LO-CNCLD-BY-USR-ID-DIFF.          30400099
304100     ADD LO-DC-ALLC-MULT-QTY-DIFF TO                              30410099
304200                            TTL-LO-DC-ALLC-MULT-QTY-DIFF.         30420099
304300     ADD LO-STR-ALLC-MLT-QTY-DIFF TO                              30430099
304400                            TTL-LO-STR-ALLC-MLT-QTY-DIFF.         30440099
304500     ADD LO-ALLOC-RND-CDE-DIFF    TO                              30450099
304600                            TTL-LO-ALLOC-RND-CDE-DIFF.            30460099
304700     ADD LO-SHTG-PRT-OPT-CDE-DIFF TO                              30470099
304800                            TTL-LO-SHTG-PRT-OPT-CDE-DIFF.         30480099
304900     ADD LO-OVRG-PRT-OPT-CDE-DIFF TO                              30490099
305000                            TTL-LO-OVRG-PRT-OPT-CDE-DIFF.         30500099
305100     ADD LO-EXT-SHTG-THR-IND-DIFF TO                              30510099
305200                            TTL-LO-EXT-SHTG-THR-IND-DIFF.         30520099
305300                                                                  30530099
305400     ADD SB-PO-NBR-DIFF           TO TTL-SB-PO-NBR-DIFF.          30540099
305500     ADD SB-SKU-NBR-DIFF          TO TTL-SB-SKU-NBR-DIFF.         30550099
305600     ADD SB-LOC-NBR-DIFF          TO TTL-SB-LOC-NBR-DIFF.         30560099
305700     ADD SB-STR-NBR-DIFF          TO TTL-SB-STR-NBR-DIFF.         30570099
305800     ADD SB-RNK-SEQ-NBR-DIFF      TO TTL-SB-RNK-SEQ-NBR-DIFF.     30580099
305900     ADD SB-ALLOC-QTY-DIFF        TO TTL-SB-ALLOC-QTY-DIFF.       30590099
306000     ADD SB-ALLOC-SEQ-CDE-DIFF    TO TTL-SB-ALLOC-SEQ-CDE-DIFF.   30600099
306100     ADD SB-STR-CNSTR-CDE-DIFF    TO TTL-SB-STR-CNSTR-CDE-DIFF.   30610099
306200     ADD SB-STR-CNSTR-QTY-DIFF    TO TTL-SB-STR-CNSTR-QTY-DIFF.   30620099
306300                                                                  30630099
306400     ADD PB-PO-NBR-DIFF           TO TTL-PB-PO-NBR-DIFF.          30640099
306500     ADD PB-PK-SKU-NBR-DIFF       TO TTL-PB-PK-SKU-NBR-DIFF.      30650099
306600     ADD PB-SKU-NBR-DIFF          TO TTL-PB-SKU-NBR-DIFF.         30660099
306700     ADD PB-UNT-COST-AMT-DIFF     TO TTL-PB-UNT-COST-AMT-DIFF.    30670099
306800     ADD PB-FRST-COST-AMT-DIFF    TO TTL-PB-FRST-COST-AMT-DIFF.   30680099
306900     ADD PB-UNT-RTL-AMT-DIFF      TO TTL-PB-UNT-RTL-AMT-DIFF.     30690099
307000     ADD PB-GP-RTL-AMT-DIFF       TO TTL-PB-GP-RTL-AMT-DIFF.      30700099
307100     ADD PB-GP-RTL-QTY-DIFF       TO TTL-PB-GP-RTL-QTY-DIFF.      30710099
307200     ADD PB-RATO-UNT-QTY-DIFF     TO TTL-PB-RATO-UNT-QTY-DIFF.    30720099
307210     ADD PB-INPK-UNT-QTY-DIFF     TO TTL-PB-INPK-UNT-QTY-DIFF.    30721099
307220     ADD PB-OTPK-UNT-QTY-DIFF     TO TTL-PB-OTPK-UNT-QTY-DIFF.    30722099
307300                                                                  30730099
307400     ADD PL-PO-NBR-DIFF           TO TTL-PL-PO-NBR-DIFF.          30740099
307500     ADD PL-SKU-NBR-DIFF          TO TTL-PL-SKU-NBR-DIFF.         30750099
307600     ADD PL-PK-SKU-NBR-DIFF       TO TTL-PL-PK-SKU-NBR-DIFF.      30760099
307700     ADD PL-LOC-NBR-DIFF          TO TTL-PL-LOC-NBR-DIFF.         30770099
307800                                                                  30780099
307900                                                                  30790099
308000                                                                  30800099
308100 P4100-EXIT. EXIT.                                                30810099
308200                                                                  30820099
308300 4200-EVALUATE-DATA.                                              30830099
308400                                                                  30840099
308500     EVALUATE TRUE                                                30850099
308600         WHEN XL023-XXT-PO                                        30860099
308700              IF XL023-PO-NBR-DIFF             = '*'              30870099
308800                 ADD 1 TO PO-NBR-DIFF                             30880099
308900                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     30890099
309000                 MOVE XL023-PO-NBR-RMS       TO                   30900099
309100                                             PV-RMS-VALUE-PIC9    30910099
309200                 MOVE XL023-PO-NBR-LGCY TO                        30920099
309300                                             PV-LEGACY-VALUE-PIC9 30930099
309400                 PERFORM 8000-WRITE-DETAIL-LINE                   30940099
309500              END-IF                                              30950099
309600              IF XL023-DEPT-NBR-DIFF           = '*'              30960099
309700                 ADD 1 TO DEPT-NBR-DIFF                           30970099
309800                 MOVE 'DEPT NBR          '   TO PV-FIELD-NAME     30980099
309900                 MOVE XL023-DEPT-NBR-RMS       TO                 30990099
310000                                             PV-RMS-VALUE-PIC9    31000099
310100                 MOVE XL023-DEPT-NBR-LGCY TO                      31010099
310200                                             PV-LEGACY-VALUE-PIC9 31020099
310300                 PERFORM 8000-WRITE-DETAIL-LINE                   31030099
310400              END-IF                                              31040099
310500              IF XL023-BYR-NBR-DIFF            = '*'              31050099
310600                 ADD 1 TO BYR-NBR-DIFF                            31060099
310700                 MOVE 'BYR NBR           '   TO PV-FIELD-NAME     31070099
310800                 MOVE XL023-BYR-NBR-RMS       TO                  31080099
310900                                             PV-RMS-VALUE-PIC9    31090099
311000                 MOVE XL023-BYR-NBR-LGCY TO                       31100099
311100                                             PV-LEGACY-VALUE-PIC9 31110099
311200                 PERFORM 8000-WRITE-DETAIL-LINE                   31120099
311300              END-IF                                              31130099
311400              IF XL023-ENT-ID-DIFF             = '*'              31140099
311500                 ADD 1 TO ENT-ID-DIFF                             31150099
311600                 MOVE 'ENT ID            '   TO PV-FIELD-NAME     31160099
311700                 MOVE XL023-ENT-ID-RMS       TO                   31170099
311800                                             PV-RMS-VALUE-PIC9    31180099
311900                 MOVE XL023-ENT-ID-LGCY TO                        31190099
312000                                             PV-LEGACY-VALUE-PIC9 31200099
312100                 PERFORM 8000-WRITE-DETAIL-LINE                   31210099
312200              END-IF                                              31220099
312300              IF XL023-AGNT-ENT-ID-DIFF        = '*'              31230099
312400                 ADD 1 TO AGNT-ENT-ID-DIFF                        31240099
312500                 MOVE 'AGNT ENT ID       '   TO PV-FIELD-NAME     31250099
312600                 MOVE XL023-AGNT-ENT-ID-RMS       TO              31260099
312700                                             PV-RMS-VALUE         31270099
312800                 MOVE XL023-AGNT-ENT-ID-LGCY TO                   31280099
312900                                             PV-LEGACY-VALUE      31290099
313000                 PERFORM 8000-WRITE-DETAIL-LINE                   31300099
313100              END-IF                                              31310099
313200              IF XL023-CRE-DTE-DIFF            = '*'              31320099
313300                 ADD 1 TO CRE-DTE-DIFF                            31330099
313400                 MOVE 'CRE DTE           '   TO PV-FIELD-NAME     31340099
313500                 MOVE XL023-CRE-DTE-RMS       TO                  31350099
313600                                             PV-RMS-VALUE         31360099
313700                 MOVE XL023-CRE-DTE-LGCY TO                       31370099
313800                                             PV-LEGACY-VALUE      31380099
313900                 PERFORM 8000-WRITE-DETAIL-LINE                   31390099
314000              END-IF                                              31400099
314100              IF XL023-NOT-BEF-DTE-DIFF        = '*'              31410099
314200                 ADD 1 TO NOT-BEF-DTE-DIFF                        31420099
314300                 MOVE 'NOT BEF DTE       '   TO PV-FIELD-NAME     31430099
314400                 MOVE XL023-NOT-BEF-DTE-RMS       TO              31440099
314500                                             PV-RMS-VALUE         31450099
314600                 MOVE XL023-NOT-BEF-DTE-LGCY TO                   31460099
314700                                             PV-LEGACY-VALUE      31470099
314800                 PERFORM 8000-WRITE-DETAIL-LINE                   31480099
314900              END-IF                                              31490099
315000              IF XL023-NOT-AFT-DTE-DIFF        = '*'              31500099
315100                 ADD 1 TO NOT-AFT-DTE-DIFF                        31510099
315200                 MOVE 'NOT AFT DTE       '   TO PV-FIELD-NAME     31520099
315300                 MOVE XL023-NOT-AFT-DTE-RMS       TO              31530099
315400                                             PV-RMS-VALUE         31540099
315500                 MOVE XL023-NOT-AFT-DTE-LGCY TO                   31550099
315600                                             PV-LEGACY-VALUE      31560099
315700                 PERFORM 8000-WRITE-DETAIL-LINE                   31570099
315800              END-IF                                              31580099
315900              IF XL023-OTB-EOW-DTE-DIFF        = '*'              31590099
316000                 ADD 1 TO OTB-EOW-DTE-DIFF                        31600099
316100                 MOVE 'OTB EOW DTE       '   TO PV-FIELD-NAME     31610099
316200                 MOVE XL023-OTB-EOW-DTE-RMS     TO                31620099
316300                                             PV-RMS-VALUE         31630099
316400                 MOVE XL023-OTB-EOW-DTE-LGCY TO                   31640099
316500                                             PV-LEGACY-VALUE      31650099
316600                 PERFORM 8000-WRITE-DETAIL-LINE                   31660099
316700              END-IF                                              31670099
316800              IF XL023-CLOSE-DTE-DIFF          = '*'              31680099
316900                 ADD 1 TO CLOSE-DTE-DIFF                          31690099
317000                 MOVE 'CLOSE DTE         '   TO PV-FIELD-NAME     31700099
317100                 MOVE XL023-CLOSE-DTE-RMS       TO                31710099
317200                                             PV-RMS-VALUE         31720099
317300                 MOVE XL023-CLOSE-DTE-LGCY TO                     31730099
317400                                             PV-LEGACY-VALUE      31740099
317500                 PERFORM 8000-WRITE-DETAIL-LINE                   31750099
317600              END-IF                                              31760099
317700              IF XL023-PAYT-TERM-ID-DIFF       = '*'              31770099
317800                 ADD 1 TO PAYT-TERM-ID-DIFF                       31780099
317900                 MOVE 'PAYT TERM ID      '   TO PV-FIELD-NAME     31790099
318000                 MOVE XL023-PAYT-TERM-ID-RMS       TO             31800099
318100                                             PV-RMS-VALUE-PIC9    31810099
318200                 MOVE XL023-PAYT-TERM-ID-LGCY TO                  31820099
318300                                             PV-LEGACY-VALUE-PIC9 31830099
318400                 PERFORM 8000-WRITE-DETAIL-LINE                   31840099
318500              END-IF                                              31850099
318600              IF XL023-FRGT-TERM-ID-DIFF       = '*'              31860099
318700                 ADD 1 TO FRGT-TERM-ID-DIFF                       31870099
318800                 MOVE 'FRGT TERM ID      '   TO PV-FIELD-NAME     31880099
318900                 MOVE XL023-FRGT-TERM-ID-RMS       TO             31890099
319000                                             PV-RMS-VALUE-PIC9    31900099
319100                 MOVE XL023-FRGT-TERM-ID-LGCY TO                  31910099
319200                                             PV-LEGACY-VALUE-PIC9 31920099
319300                 PERFORM 8000-WRITE-DETAIL-LINE                   31930099
319400              END-IF                                              31940099
319500              IF XL023-STAT-CDE-DIFF           = '*'              31950099
319600                 ADD 1 TO STAT-CDE-DIFF                           31960099
319700                 MOVE 'STAT CDE          '   TO PV-FIELD-NAME     31970099
319800                 MOVE XL023-STAT-CDE-RMS       TO                 31980099
319900                                             PV-RMS-VALUE         31990099
320000                 MOVE XL023-STAT-CDE-LGCY TO                      32000099
320100                                             PV-LEGACY-VALUE      32010099
320200                 PERFORM 8000-WRITE-DETAIL-LINE                   32020099
320300              END-IF                                              32030099
320400              IF XL023-ORIG-PO-APVL-DTE-DIFF   = '*'              32040099
320500                 ADD 1 TO ORIG-PO-APVL-DTE-DIFF                   32050099
320600                 MOVE 'ORIG PO APVL DTE  '   TO PV-FIELD-NAME     32060099
320700                 MOVE XL023-ORIG-PO-APVL-DTE-RMS       TO         32070099
320800                                             PV-RMS-VALUE         32080099
320900                 MOVE XL023-ORIG-PO-APVL-DTE-LGCY TO              32090099
321000                                             PV-LEGACY-VALUE      32100099
321100                 PERFORM 8000-WRITE-DETAIL-LINE                   32110099
321200              END-IF                                              32120099
321300              IF XL023-ORIG-APP-BY-USR-ID-DIFF = '*'              32130099
321400                 ADD 1 TO ORIG-APP-BY-USR-ID-DIFF                 32140099
321500                 MOVE 'ORIG APP BY USR ID'   TO PV-FIELD-NAME     32150099
321600                 MOVE XL023-ORIG-APP-BY-USR-ID-RMS       TO       32160099
321700                                             PV-RMS-VALUE         32170099
321800                 MOVE XL023-ORIG-APP-BY-USR-ID-LGCY TO            32180099
321900                                             PV-LEGACY-VALUE      32190099
322000                 PERFORM 8000-WRITE-DETAIL-LINE                   32200099
322100              END-IF                                              32210099
322200              IF XL023-EDI-SNT-IND-DIFF        = '*'              32220099
322300                 ADD 1 TO EDI-SNT-IND-DIFF                        32230099
322400                 MOVE 'EDI SNT IND       '   TO PV-FIELD-NAME     32240099
322500                 MOVE XL023-EDI-SNT-IND-RMS       TO              32250099
322600                                             PV-RMS-VALUE         32260099
322700                 MOVE XL023-EDI-SNT-IND-LGCY TO                   32270099
322800                                             PV-LEGACY-VALUE      32280099
322900                 PERFORM 8000-WRITE-DETAIL-LINE                   32290099
323000              END-IF                                              32300099
323100              IF XL023-EDI-PO-IND-DIFF         = '*'              32310099
323200                 ADD 1 TO EDI-PO-IND-DIFF                         32320099
323300                 MOVE 'EDI PO IND        '   TO PV-FIELD-NAME     32330099
323400                 MOVE XL023-EDI-PO-IND-RMS       TO               32340099
323500                                             PV-RMS-VALUE         32350099
323600                 MOVE XL023-EDI-PO-IND-LGCY TO                    32360099
323700                                             PV-LEGACY-VALUE      32370099
323800                 PERFORM 8000-WRITE-DETAIL-LINE                   32380099
323900              END-IF                                              32390099
324000              IF XL023-IMPRT-PO-IND-DIFF       = '*'              32400099
324100                 ADD 1 TO IMPRT-PO-IND-DIFF                       32410099
324200                 MOVE 'IMPRT PO IND      '   TO PV-FIELD-NAME     32420099
324300                 MOVE XL023-IMPRT-PO-IND-RMS       TO             32430099
324400                                             PV-RMS-VALUE         32440099
324500                 MOVE XL023-IMPRT-PO-IND-LGCY TO                  32450099
324600                                             PV-LEGACY-VALUE      32460099
324700                 PERFORM 8000-WRITE-DETAIL-LINE                   32470099
324800              END-IF                                              32480099
324900              IF XL023-FCTRY-NM-DIFF           = '*'              32490099
325000                 ADD 1 TO FCTRY-NM-DIFF                           32500099
325100                 MOVE 'FCTRY-NM          '   TO PV-FIELD-NAME     32510099
325200                 MOVE XL023-FCTRY-NM-RMS       TO                 32520099
325300                                             PV-RMS-VALUE         32530099
325400                 MOVE XL023-FCTRY-NM-LGCY TO                      32540099
325500                                             PV-LEGACY-VALUE      32550099
325600                 PERFORM 8000-WRITE-DETAIL-LINE                   32560099
325700              END-IF                                              32570099
325800              IF XL023-POE-CDE-DIFF            = '*'              32580099
325900                 ADD 1 TO POE-CDE-DIFF                            32590099
326000                 MOVE 'POE CDE           '   TO PV-FIELD-NAME     32600099
326100                 MOVE XL023-POE-CDE-RMS       TO                  32610099
326200                                             PV-RMS-VALUE         32620099
326300                 MOVE XL023-POE-CDE-LGCY TO                       32630099
326400                                             PV-LEGACY-VALUE      32640099
326500                 PERFORM 8000-WRITE-DETAIL-LINE                   32650099
326600              END-IF                                              32660099
326700              IF XL023-FOB-CDE-DIFF            = '*'              32670099
326800                 ADD 1 TO FOB-CDE-DIFF                            32680099
326900                 MOVE 'FOB CDE           '   TO PV-FIELD-NAME     32690099
327000                 MOVE XL023-FOB-CDE-RMS       TO                  32700099
327100                                             PV-RMS-VALUE         32710099
327200                 MOVE XL023-FOB-CDE-LGCY TO                       32720099
327300                                             PV-LEGACY-VALUE      32730099
327400                 PERFORM 8000-WRITE-DETAIL-LINE                   32740099
327500              END-IF                                              32750099
327600              IF XL023-PO-TYP-CDE-DIFF         = '*'              32760099
327700                 ADD 1 TO PO-TYP-CDE-DIFF                         32770099
327800                 MOVE 'PO TYP CDE        '   TO PV-FIELD-NAME     32780099
327900                 MOVE XL023-PO-TYP-CDE-RMS       TO               32790099
328000                                             PV-RMS-VALUE         32800099
328100                 MOVE XL023-PO-TYP-CDE-LGCY TO                    32810099
328200                                             PV-LEGACY-VALUE      32820099
328300                 PERFORM 8000-WRITE-DETAIL-LINE                   32830099
328400              END-IF                                              32840099
328500              IF XL023-PK-BY-STR-IND-DIFF      = '*'              32850099
328600                 ADD 1 TO PK-BY-STR-IND-DIFF                      32860099
328700                 MOVE 'PK BY STR IND     '   TO PV-FIELD-NAME     32870099
328800                 MOVE XL023-PK-BY-STR-IND-RMS       TO            32880099
328900                                             PV-RMS-VALUE         32890099
329000                 MOVE XL023-PK-BY-STR-IND-LGCY TO                 32900099
329100                                             PV-LEGACY-VALUE      32910099
329200                 PERFORM 8000-WRITE-DETAIL-LINE                   32920099
329300              END-IF                                              32930099
329400              IF XL023-CONSLR-ACTL-DTE-DIFF    = '*'              32940099
329500                 ADD 1 TO CONSLR-ACTL-DTE-DIFF                    32950099
329600                 MOVE 'CONSLR ACTL DTE   '   TO PV-FIELD-NAME     32960099
329700                 MOVE XL023-CONSLR-ACTL-DTE-RMS       TO          32970099
329800                                             PV-RMS-VALUE         32980099
329900                 MOVE XL023-CONSLR-ACTL-DTE-LGCY TO               32990099
330000                                             PV-LEGACY-VALUE      33000099
330100                 PERFORM 8000-WRITE-DETAIL-LINE                   33010099
330200              END-IF                                              33020099
330300              IF XL023-CONSLR-REQR-DTE-DIFF    = '*'              33030099
330400                 ADD 1 TO CONSLR-REQR-DTE-DIFF                    33040099
330500                 MOVE 'CONSLR REQR DTE   '   TO PV-FIELD-NAME     33050099
330600                 MOVE XL023-CONSLR-REQR-DTE-RMS       TO          33060099
330700                                             PV-RMS-VALUE         33070099
330800                 MOVE XL023-CONSLR-REQR-DTE-LGCY TO               33080099
330900                                             PV-LEGACY-VALUE      33090099
331000                 PERFORM 8000-WRITE-DETAIL-LINE                   33100099
331100              END-IF                                              33110099
331200              IF XL023-CONSLR-RLSE-CDE-DIFF    = '*'              33120099
331300                 ADD 1 TO CONSLR-RLSE-CDE-DIFF                    33130099
331400                 MOVE 'CONSLR RLSE CDE   '   TO PV-FIELD-NAME     33140099
331500                 MOVE XL023-CONSLR-RLSE-CDE-RMS       TO          33150099
331600                                             PV-RMS-VALUE         33160099
331700                 MOVE XL023-CONSLR-RLSE-CDE-LGCY TO               33170099
331800                                             PV-LEGACY-VALUE      33180099
331900                 PERFORM 8000-WRITE-DETAIL-LINE                   33190099
332000              END-IF                                              33200099
332100              IF XL023-TKT-MKR-ACTL-DTE-DIFF   = '*'              33210099
332200                 ADD 1 TO TKT-MKR-ACTL-DTE-DIFF                   33220099
332300                 MOVE 'TKT MKR ACTL DTE  '   TO PV-FIELD-NAME     33230099
332400                 MOVE XL023-TKT-MKR-ACTL-DTE-RMS       TO         33240099
332500                                             PV-RMS-VALUE         33250099
332600                 MOVE XL023-TKT-MKR-ACTL-DTE-LGCY TO              33260099
332700                                             PV-LEGACY-VALUE      33270099
332800                 PERFORM 8000-WRITE-DETAIL-LINE                   33280099
332900              END-IF                                              33290099
333000              IF XL023-TKT-MKR-REQR-DTE-DIFF   = '*'              33300099
333100                 ADD 1 TO TKT-MKR-REQR-DTE-DIFF                   33310099
333200                 MOVE 'TKT MKR REQR DTE  '   TO PV-FIELD-NAME     33320099
333300                 MOVE XL023-TKT-MKR-REQR-DTE-RMS       TO         33330099
333400                                             PV-RMS-VALUE         33340099
333500                 MOVE XL023-TKT-MKR-REQR-DTE-LGCY TO              33350099
333600                                             PV-LEGACY-VALUE      33360099
333700                 PERFORM 8000-WRITE-DETAIL-LINE                   33370099
333800              END-IF                                              33380099
333900              IF XL023-TKT-MKR-RLSE-CDE-DIFF   = '*'              33390099
334000                 ADD 1 TO TKT-MKR-RLSE-CDE-DIFF                   33400099
334100                 MOVE 'TKT MKR RLSE CDE  '   TO PV-FIELD-NAME     33410099
334200                 MOVE XL023-TKT-MKR-RLSE-CDE-RMS       TO         33420099
334300                                             PV-RMS-VALUE         33430099
334400                 MOVE XL023-TKT-MKR-RLSE-CDE-LGCY TO              33440099
334500                                             PV-LEGACY-VALUE      33450099
334600                 PERFORM 8000-WRITE-DETAIL-LINE                   33460099
334700              END-IF                                              33470099
334800              IF XL023-RLSE-DTE-DIFF           = '*'              33480099
334900                 ADD 1 TO RLSE-DTE-DIFF                           33490099
335000                 MOVE 'RLSE DTE          '   TO PV-FIELD-NAME     33500099
335100                 MOVE XL023-RLSE-DTE-RMS       TO                 33510099
335200                                             PV-RMS-VALUE         33520099
335300                 MOVE XL023-RLSE-DTE-LGCY TO                      33530099
335400                                             PV-LEGACY-VALUE      33540099
335500                 PERFORM 8000-WRITE-DETAIL-LINE                   33550099
335600              END-IF                                              33560099
335700              IF XL023-FRST-FCTRY-DTE-DIFF     = '*'              33570099
335800                 ADD 1 TO FRST-FCTRY-DTE-DIFF                     33580099
335900                 MOVE 'FRST FCTRY DTE    '   TO PV-FIELD-NAME     33590099
336000                 MOVE XL023-FRST-FCTRY-DTE-RMS       TO           33600099
336100                                             PV-RMS-VALUE         33610099
336200                 MOVE XL023-FRST-FCTRY-DTE-LGCY TO                33620099
336300                                             PV-LEGACY-VALUE      33630099
336400                 PERFORM 8000-WRITE-DETAIL-LINE                   33640099
336500              END-IF                                              33650099
336600              IF XL023-LAST-FCTRY-DTE-DIFF     = '*'              33660099
336700                 ADD 1 TO LAST-FCTRY-DTE-DIFF                     33670099
336800                 MOVE 'LAST FCTRY DTE    '   TO PV-FIELD-NAME     33680099
336900                 MOVE XL023-LAST-FCTRY-DTE-RMS       TO           33690099
337000                                             PV-RMS-VALUE         33700099
337100                 MOVE XL023-LAST-FCTRY-DTE-LGCY TO                33710099
337200                                             PV-LEGACY-VALUE      33720099
337300                 PERFORM 8000-WRITE-DETAIL-LINE                   33730099
337400              END-IF                                              33740099
337500              IF XL023-DIR-STR-IND-DIFF        = '*'              33750099
337600                 ADD 1 TO DIR-STR-IND-DIFF                        33760099
337700                 MOVE 'DIR STR IND       '   TO PV-FIELD-NAME     33770099
337800                 MOVE XL023-DIR-STR-IND-RMS       TO              33780099
337900                                             PV-RMS-VALUE         33790099
338000                 MOVE XL023-DIR-STR-IND-LGCY TO                   33800099
338100                                             PV-LEGACY-VALUE      33810099
338200                 PERFORM 8000-WRITE-DETAIL-LINE                   33820099
338300              END-IF                                              33830099
338400              IF XL023-EXTD-NOT-AFT-DTE-DIFF   = '*'              33840099
338500                 ADD 1 TO EXTD-NOT-AFT-DTE-DIFF                   33850099
338600                 MOVE 'EXTD NOT AFT DTE  '   TO PV-FIELD-NAME     33860099
338700                 MOVE XL023-EXTD-NOT-AFT-DTE-RMS       TO         33870099
338800                                             PV-RMS-VALUE         33880099
338900                 MOVE XL023-EXTD-NOT-AFT-DTE-LGCY TO              33890099
339000                                             PV-LEGACY-VALUE      33900099
339100                 PERFORM 8000-WRITE-DETAIL-LINE                   33910099
339200              END-IF                                              33920099
339300              IF XL023-HNG-IND-DIFF            = '*'              33930099
339400                 ADD 1 TO HNG-IND-DIFF                            33940099
339500                 MOVE 'HNG IND           '   TO PV-FIELD-NAME     33950099
339600                 MOVE XL023-HNG-IND-RMS       TO                  33960099
339700                                             PV-RMS-VALUE         33970099
339800                 MOVE XL023-HNG-IND-LGCY TO                       33980099
339900                                             PV-LEGACY-VALUE      33990099
340000                 PERFORM 8000-WRITE-DETAIL-LINE                   34000099
340100              END-IF                                              34010099
340200              IF XL023-NW-STR-ORD-IND-DIFF     = '*'              34020099
340300                 ADD 1 TO NW-STR-ORD-IND-DIFF                     34030099
340400                 MOVE 'NW STR ORD IND    '   TO PV-FIELD-NAME     34040099
340500                 MOVE XL023-NW-STR-ORD-IND-RMS       TO           34050099
340600                                             PV-RMS-VALUE         34060099
340700                 MOVE XL023-NW-STR-ORD-IND-LGCY TO                34070099
340800                                             PV-LEGACY-VALUE      34080099
340900                 PERFORM 8000-WRITE-DETAIL-LINE                   34090099
341000              END-IF                                              34100099
341100              IF XL023-PKGNG-CDE-DIFF          = '*'              34110099
341200                 ADD 1 TO PKGNG-CDE-DIFF                          34120099
341300                 MOVE 'PKGNG CDE         '   TO PV-FIELD-NAME     34130099
341400                 MOVE XL023-PKGNG-CDE-RMS       TO                34140099
341500                                             PV-RMS-VALUE         34150099
341600                 MOVE XL023-PKGNG-CDE-LGCY TO                     34160099
341700                                             PV-LEGACY-VALUE      34170099
341800                 PERFORM 8000-WRITE-DETAIL-LINE                   34180099
341900              END-IF                                              34190099
342000              IF XL023-PKGNG-DESC-DIFF         = '*'              34200099
342100                 ADD 1 TO PKGNG-DESC-DIFF                         34210099
342200                 MOVE 'PKGNG DESC        '   TO PV-FIELD-NAME     34220099
342300                 MOVE XL023-PKGNG-DESC-RMS       TO               34230099
342400                                             PV-RMS-VALUE         34240099
342500                 MOVE XL023-PKGNG-DESC-LGCY TO                    34250099
342600                                             PV-LEGACY-VALUE      34260099
342700                 PERFORM 8000-WRITE-DETAIL-LINE                   34270099
342800              END-IF                                              34280099
342900              IF XL023-PTKT-LDTM-DAYS-QTY-DIFF = '*'              34290099
343000                 ADD 1 TO PTKT-LDTM-DAYS-QTY-DIFF                 34300099
343100                 MOVE 'PTKT LDTM DAYS QTY'   TO PV-FIELD-NAME     34310099
343200                 MOVE XL023-PTKT-LDTM-DAYS-QTY-RMS       TO       34320099
343300                                             PV-RMS-VALUE-PIC9    34330099
343400                 MOVE XL023-PTKT-LDTM-DAYS-QTY-LGCY TO            34340099
343500                                             PV-LEGACY-VALUE-PIC9 34350099
343600                 PERFORM 8000-WRITE-DETAIL-LINE                   34360099
343700              END-IF                                              34370099
343800              IF XL023-SEASET-SHRT-DESC-DIFF   = '*'              34380099
343900                 ADD 1 TO SEASET-SHRT-DESC-DIFF                   34390099
344000                 MOVE 'SEASET SHRT DESC  '   TO PV-FIELD-NAME     34400099
344100                 MOVE XL023-SEASET-SHRT-DESC-RMS       TO         34410099
344200                                             PV-RMS-VALUE         34420099
344300                 MOVE XL023-SEASET-SHRT-DESC-LGCY TO              34430099
344400                                             PV-LEGACY-VALUE      34440099
344500                 PERFORM 8000-WRITE-DETAIL-LINE                   34450099
344600              END-IF                                              34460099
344700              IF XL023-SEASET-YR-DIFF          = '*'              34470099
344800                 ADD 1 TO SEASET-YR-DIFF                          34480099
344900                 MOVE 'SEASET YR         '   TO PV-FIELD-NAME     34490099
345000                 MOVE XL023-SEASET-YR-RMS       TO                34500099
345100                                             PV-RMS-VALUE         34510099
345200                 MOVE XL023-SEASET-YR-LGCY TO                     34520099
345300                                             PV-LEGACY-VALUE      34530099
345400                 PERFORM 8000-WRITE-DETAIL-LINE                   34540099
345500              END-IF                                              34550099
345600              IF XL023-CRE-BY-USR-ID-DIFF      = '*'              34560099
345700                 ADD 1 TO CRE-BY-USR-ID-DIFF                      34570099
345800                 MOVE 'CRE BY USR ID     '   TO PV-FIELD-NAME     34580099
345900                 MOVE XL023-CRE-BY-USR-ID-RMS       TO            34590099
346000                                             PV-RMS-VALUE         34600099
346100                 MOVE XL023-CRE-BY-USR-ID-LGCY TO                 34610099
346200                                             PV-LEGACY-VALUE      34620099
346300                 PERFORM 8000-WRITE-DETAIL-LINE                   34630099
346400              END-IF                                              34640099
346500              IF XL023-PTKT-IND-DIFF           = '*'              34650099
346600                 ADD 1 TO PTKT-IND-DIFF                           34660099
346700                 MOVE 'PTKT IND          '   TO PV-FIELD-NAME     34670099
346800                 MOVE XL023-PTKT-IND-RMS       TO                 34680099
346900                                             PV-RMS-VALUE         34690099
347000                 MOVE XL023-PTKT-IND-LGCY TO                      34700099
347100                                             PV-LEGACY-VALUE      34710099
347200                 PERFORM 8000-WRITE-DETAIL-LINE                   34720099
347300              END-IF                                              34730099
347400              IF XL023-C-O-PROD-CDE-DIFF       = '*'              34740099
347500                 ADD 1 TO C-O-PROD-CDE-DIFF                       34750099
347600                 MOVE 'C O PROD CDE      '   TO PV-FIELD-NAME     34760099
347700                 MOVE XL023-C-O-PROD-CDE-RMS       TO             34770099
347800                                             PV-RMS-VALUE         34780099
347900                 MOVE XL023-C-O-PROD-CDE-LGCY TO                  34790099
348000                                             PV-LEGACY-VALUE      34800099
348100                 PERFORM 8000-WRITE-DETAIL-LINE                   34810099
348200              END-IF                                              34820099
348300              IF XL023-AGNT-OFC-CNTRY-CDE-DIFF = '*'              34830099
348400                 ADD 1 TO AGNT-OFC-CNTRY-CDE-DIFF                 34840099
348500                 MOVE 'AGNT OFC CNTRY CDE'   TO PV-FIELD-NAME     34850099
348600                 MOVE XL023-AGNT-OFC-CNTRY-CDE-RMS TO             34860099
348700                                             PV-RMS-VALUE         34870099
348800                 MOVE XL023-AGNT-OFC-CNTRY-CDE-LGCY TO            34880099
348900                                             PV-LEGACY-VALUE      34890099
349000                 PERFORM 8000-WRITE-DETAIL-LINE                   34900099
349100              END-IF                                              34910099
349200              IF XL023-UNT-PER-CBMT-QTY-DIFF    = '*'             34920099
349300                 ADD 1 TO UNT-PER-CBMT-QTY-DIFF                   34930099
349400                 MOVE 'UNT PER CBMT QTY  '   TO PV-FIELD-NAME     34940099
349500                 MOVE XL023-UNT-PER-CBMT-QTY-RMS   TO             34950099
349600                                             PV-RMS-VALUE         34960099
349700                 MOVE XL023-UNT-PER-CBMT-QTY-LGCY  TO             34970099
349800                                             PV-LEGACY-VALUE      34980099
349900                 PERFORM 8000-WRITE-DETAIL-LINE                   34990099
350000              END-IF                                              35000099
350100              IF XL023-QTA-CTG-CDE-DIFF        = '*'              35010099
350200                 ADD 1 TO QTA-CTG-CDE-DIFF                        35020099
350300                 MOVE 'QTA CTG CODE      '   TO PV-FIELD-NAME     35030099
350400                 MOVE XL023-QTA-CTG-CDE-RMS   TO                  35040099
350500                                             PV-RMS-VALUE         35050099
350600                 MOVE XL023-QTA-CTG-CDE-LGCY  TO                  35060099
350700                                             PV-LEGACY-VALUE      35070099
350800                 PERFORM 8000-WRITE-DETAIL-LINE                   35080099
350900              END-IF                                              35090099
351000              IF XL023-IMPRT-VND-ID-DIFF       = '*'              35100099
351100                 ADD 1 TO IMPRT-VND-ID-DIFF                       35110099
351200                 MOVE 'IMPRT VND ID      '   TO PV-FIELD-NAME     35120099
351300                 MOVE XL023-IMPRT-VND-ID-RMS      TO              35130099
351400                                             PV-RMS-VALUE         35140099
351500                 MOVE XL023-IMPRT-VND-ID-LGCY     TO              35150099
351600                                             PV-LEGACY-VALUE      35160099
351700                 PERFORM 8000-WRITE-DETAIL-LINE                   35170099
351800              END-IF                                              35180099
351900              IF XL023-IMPRT-FCTRY-ID-DIFF     = '*'              35190099
352000                 ADD 1 TO IMPRT-FCTRY-ID-DIFF                     35200099
352100                 MOVE 'IMPRT FCTRY ID    '   TO PV-FIELD-NAME     35210099
352200                 MOVE XL023-IMPRT-FCTRY-ID-RMS     TO             35220099
352300                                             PV-RMS-VALUE         35230099
352400                 MOVE XL023-IMPRT-FCTRY-ID-LGCY    TO             35240099
352500                                             PV-LEGACY-VALUE      35250099
352600                 PERFORM 8000-WRITE-DETAIL-LINE                   35260099
352700              END-IF                                              35270099
352800              IF XL023-IMPRT-VND-NM-DIFF       = '*'              35280099
352900                 ADD 1 TO IMPRT-VND-NM-DIFF                       35290099
353000                 MOVE 'IMPRT VND NAME    '   TO PV-FIELD-NAME     35300099
353100                 MOVE XL023-IMPRT-VND-NM-RMS      TO              35310099
353200                                             PV-RMS-VALUE         35320099
353300                 MOVE XL023-IMPRT-VND-NM-LGCY     TO              35330099
353400                                             PV-LEGACY-VALUE      35340099
353500                 PERFORM 8000-WRITE-DETAIL-LINE                   35350099
353600              END-IF                                              35360099
353700              IF XL023-IMPRT-FCTRY-NM-DIFF     = '*'              35370099
353800                 ADD 1 TO IMPRT-FCTRY-NM-DIFF                     35380099
353900                 MOVE 'IMPRT FCTRY NAME  '   TO PV-FIELD-NAME     35390099
354000                 MOVE XL023-IMPRT-FCTRY-NM-RMS     TO             35400099
354100                                             PV-RMS-VALUE         35410099
354200                 MOVE XL023-IMPRT-FCTRY-NM-LGCY    TO             35420099
354300                                             PV-LEGACY-VALUE      35430099
354400                 PERFORM 8000-WRITE-DETAIL-LINE                   35440099
354500              END-IF                                              35450099
354600              IF XL023-DERVD-LBL-TYP-CDE-DIFF  = '*'              35460099
354700                 ADD 1 TO DERVD-LBL-TYP-CDE-DIFF                  35470099
354800                 MOVE 'DERVD LBL TYP CDE '   TO PV-FIELD-NAME     35480099
354900                 MOVE XL023-DERVD-LBL-TYP-CDE-RMS  TO             35490099
355000                                             PV-RMS-VALUE         35500099
355100                 MOVE XL023-DERVD-LBL-TYP-CDE-LGCY TO             35510099
355200                                             PV-LEGACY-VALUE      35520099
355300                 PERFORM 8000-WRITE-DETAIL-LINE                   35530099
355400              END-IF                                              35540099
355500*  WR33239                                                        35550099
355600              IF XL023-DELY-ID-DIFF  = '*'                        35560099
355700                 ADD 1 TO DELY-ID-DIFF                            35570099
355800                 MOVE 'DELY ID '   TO PV-FIELD-NAME               35580099
355900                 MOVE XL023-DELY-ID-RMS  TO                       35590099
356000                                             PV-RMS-VALUE         35600099
356100                 MOVE XL023-DELY-ID-LGCY TO                       35610099
356200                                             PV-LEGACY-VALUE      35620099
356300                 PERFORM 8000-WRITE-DETAIL-LINE                   35630099
356400              END-IF                                              35640099
356500              IF XL023-PO-SHRT-CYC-IND-DIFF = '*'                 35650099
356600                 ADD 1 TO DELY-ID-DIFF                            35660099
356700                 MOVE 'PO SHRT CYC IND '   TO PV-FIELD-NAME       35670099
356710                 MOVE XL023-PO-SHRT-CYC-IND-RMS TO                35671099
356720                                             PV-RMS-VALUE         35672099
356730                 MOVE XL023-PO-SHRT-CYC-IND-LGCY TO               35673099
356740                                             PV-LEGACY-VALUE      35674099
356750                 PERFORM 8000-WRITE-DETAIL-LINE                   35675099
356760              END-IF                                              35676099
356770                                                                  35677099
356780         WHEN XL023-XXT-PO-INSTR                                  35678099
356790              IF XL023-IN-PO-NBR-DIFF              = '*'          35679099
356800                 ADD 1 TO IN-PO-NBR-DIFF                          35680099
356900                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     35690099
357000                 MOVE XL023-IN-PO-NBR-RMS       TO                35700099
357100                                             PV-RMS-VALUE-PIC9    35710099
357200                 MOVE XL023-IN-PO-NBR-LGCY TO                     35720099
357300                                             PV-LEGACY-VALUE-PIC9 35730099
357400                 PERFORM 8000-WRITE-DETAIL-LINE                   35740099
357500              END-IF                                              35750099
357600              IF XL023-IN-RECIP-CDE-DIFF     = '*'                35760099
357700                 ADD 1 TO IN-RECIP-CDE-DIFF                       35770099
357800                 MOVE 'RECIP CDE         '   TO PV-FIELD-NAME     35780099
357900                 MOVE XL023-IN-RECIP-CDE-RMS TO                   35790099
358000                                             PV-RMS-VALUE         35800099
358100                 MOVE XL023-IN-RECIP-CDE-LGCY TO                  35810099
358200                                             PV-LEGACY-VALUE      35820099
358300                 PERFORM 8000-WRITE-DETAIL-LINE                   35830099
358400              END-IF                                              35840099
358500              IF XL023-IN-INSTR-DESC-DIFF       = '*'             35850099
358600                 ADD 1 TO IN-INSTR-DESC-DIFF                      35860099
358700                 MOVE 'INSTR DESC        '   TO PV-FIELD-NAME     35870099
358800                 MOVE XL023-IN-INSTR-DESC-RMS TO                  35880099
358900                                             PV-RMS-VALUE         35890099
359000                 MOVE XL023-IN-INSTR-DESC-LGCY TO                 35900099
359100                                             PV-LEGACY-VALUE      35910099
359200                 PERFORM 8000-WRITE-DETAIL-LINE                   35920099
359300              END-IF                                              35930099
359400                                                                  35940099
359500         WHEN XL023-XXT-PO-DISC                                   35950099
359600              IF XL023-DI-PO-NBR-DIFF           = '*'             35960099
359700                 ADD 1 TO DI-PO-NBR-DIFF                          35970099
359800                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     35980099
359900                 MOVE XL023-DI-PO-NBR-RMS       TO                35990099
360000                                             PV-RMS-VALUE-PIC9    36000099
360100                 MOVE XL023-DI-PO-NBR-LGCY TO                     36010099
360200                                             PV-LEGACY-VALUE-PIC9 36020099
360300                 PERFORM 8000-WRITE-DETAIL-LINE                   36030099
360400              END-IF                                              36040099
360500              IF XL023-DI-DL-ID-DIFF            = '*'             36050099
360600                 ADD 1 TO DI-DL-ID-DIFF                           36060099
360700                 MOVE 'DL ID             '   TO PV-FIELD-NAME     36070099
360800                 MOVE XL023-DI-DL-ID-RMS       TO                 36080099
360900                                             PV-RMS-VALUE-PIC9    36090099
361000                 MOVE XL023-DI-DL-ID-LGCY TO                      36100099
361100                                             PV-LEGACY-VALUE-PIC9 36110099
361200                 PERFORM 8000-WRITE-DETAIL-LINE                   36120099
361300              END-IF                                              36130099
361400              IF XL023-DI-DL-DTL-ID-DIFF        = '*'             36140099
361500                 ADD 1 TO DI-DL-DTL-ID-DIFF                       36150099
361600                 MOVE 'DL DTL ID         '   TO PV-FIELD-NAME     36160099
361700                 MOVE XL023-DI-DL-DTL-ID-RMS       TO             36170099
361800                                             PV-RMS-VALUE-PIC9    36180099
361900                 MOVE XL023-DI-DL-DTL-ID-LGCY TO                  36190099
362000                                             PV-LEGACY-VALUE-PIC9 36200099
362100                 PERFORM 8000-WRITE-DETAIL-LINE                   36210099
362200              END-IF                                              36220099
362300              IF XL023-DI-DISC-TYPE-CDE-DIFF    = '*'             36230099
362400                 ADD 1 TO DI-DISC-TYPE-CDE-DIFF                   36240099
362500                 MOVE 'DISC TYPE CDE     '   TO PV-FIELD-NAME     36250099
362600                 MOVE XL023-DI-DISC-TYPE-CDE-RMS       TO         36260099
362700                                             PV-RMS-VALUE         36270099
362800                 MOVE XL023-DI-DISC-TYPE-CDE-LGCY TO              36280099
362900                                             PV-LEGACY-VALUE      36290099
363000                 PERFORM 8000-WRITE-DETAIL-LINE                   36300099
363100              END-IF                                              36310099
363200              IF XL023-DI-EXTD-DAYS-QTY-DIFF    = '*'             36320099
363300                 ADD 1 TO DI-EXTD-DAYS-QTY-DIFF                   36330099
363400                 MOVE 'EXTD DAYS QTY     '   TO PV-FIELD-NAME     36340099
363500                 MOVE XL023-DI-EXTD-DAYS-QTY-RMS       TO         36350099
363600                                             PV-RMS-VALUE-PIC9    36360099
363700                 MOVE XL023-DI-EXTD-DAYS-QTY-LGCY TO              36370099
363800                                             PV-LEGACY-VALUE-PIC9 36380099
363900                 PERFORM 8000-WRITE-DETAIL-LINE                   36390099
364000              END-IF                                              36400099
364100              IF XL023-DI-DISC-PCT-DIFF         = '*'             36410099
364200                 ADD 1 TO DI-DISC-PCT-DIFF                        36420099
364300                 MOVE 'DISC PCT          '   TO PV-FIELD-NAME     36430099
364400                 MOVE XL023-DI-DISC-PCT-RMS       TO              36440099
364500                                             PV-RMS-VALUE-PIC9V9  36450099
364600                 MOVE XL023-DI-DISC-PCT-LGCY TO                   36460099
364700                                          PV-LEGACY-VALUE-PIC9V9  36470099
364800                 PERFORM 8000-WRITE-DETAIL-LINE                   36480099
364900              END-IF                                              36490099
365000              IF XL023-DI-TOT-DISC-AMT-DIFF     = '*'             36500099
365100                 ADD 1 TO DI-TOT-DISC-AMT-DIFF                    36510099
365200                 MOVE 'TOT DISC AMT      '   TO PV-FIELD-NAME     36520099
365300                 MOVE XL023-DI-TOT-DISC-AMT-RMS       TO          36530099
365400                                             PV-RMS-VALUE-PIC9V9  36540099
365500                 MOVE XL023-DI-TOT-DISC-AMT-LGCY TO               36550099
365600                                          PV-LEGACY-VALUE-PIC9V9  36560099
365700                 PERFORM 8000-WRITE-DETAIL-LINE                   36570099
365800              END-IF                                              36580099
365900                                                                  36590099
366000         WHEN XL023-XXT-PO-SKU                                    36600099
366100              IF XL023-SK-PO-NBR-DIFF           = '*'             36610099
366200                 ADD 1 TO SK-PO-NBR-DIFF                          36620099
366300                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     36630099
366400                 MOVE XL023-SK-PO-NBR-RMS       TO                36640099
366500                                             PV-RMS-VALUE-PIC9    36650099
366600                 MOVE XL023-SK-PO-NBR-LGCY TO                     36660099
366700                                             PV-LEGACY-VALUE-PIC9 36670099
366800                 PERFORM 8000-WRITE-DETAIL-LINE                   36680099
366900              END-IF                                              36690099
367000              IF XL023-SK-SKU-NBR-DIFF          = '*'             36700099
367100                 ADD 1 TO SK-SKU-NBR-DIFF                         36710099
367200                 MOVE 'SKU NBR           '   TO PV-FIELD-NAME     36720099
367300                 MOVE XL023-SK-SKU-NBR-RMS       TO               36730099
367400                                             PV-RMS-VALUE-PIC9    36740099
367500                 MOVE XL023-SK-SKU-NBR-LGCY TO                    36750099
367600                                             PV-LEGACY-VALUE-PIC9 36760099
367700                 PERFORM 8000-WRITE-DETAIL-LINE                   36770099
367800              END-IF                                              36780099
367900              IF XL023-SK-UNT-COST-AMT-DIFF     = '*'             36790099
368000                 ADD 1 TO SK-UNT-COST-AMT-DIFF                    36800099
368100                 MOVE 'UNT COST AMT      '   TO PV-FIELD-NAME     36810099
368200                 MOVE XL023-SK-UNT-COST-AMT-RMS       TO          36820099
368300                                             PV-RMS-VALUE-PIC9V9  36830099
368400                 MOVE XL023-SK-UNT-COST-AMT-LGCY TO               36840099
368500                                          PV-LEGACY-VALUE-PIC9V9  36850099
368600                 PERFORM 8000-WRITE-DETAIL-LINE                   36860099
368700              END-IF                                              36870099
368800              IF XL023-SK-FRST-COST-AMT-DIFF    = '*'             36880099
368900                 ADD 1 TO SK-FRST-COST-AMT-DIFF                   36890099
369000                 MOVE 'FRST COST AMT     '   TO PV-FIELD-NAME     36900099
369100                 MOVE XL023-SK-FRST-COST-AMT-RMS       TO         36910099
369200                                             PV-RMS-VALUE-PIC9V9  36920099
369300                 MOVE XL023-SK-FRST-COST-AMT-LGCY TO              36930099
369400                                          PV-LEGACY-VALUE-PIC9V9  36940099
369500                 PERFORM 8000-WRITE-DETAIL-LINE                   36950099
369600              END-IF                                              36960099
369700              IF XL023-SK-VND-QTY-DIFF          = '*'             36970099
369800                 ADD 1 TO SK-VND-QTY-DIFF                         36980099
369900                 MOVE 'VND QTY (OUTER)   '   TO PV-FIELD-NAME     36990099
370000                 MOVE XL023-SK-VND-QTY-RMS       TO               37000099
370100                                             PV-RMS-VALUE-PIC9V9  37010099
370200                 MOVE XL023-SK-VND-QTY-LGCY TO                    37020099
370300                                          PV-LEGACY-VALUE-PIC9V9  37030099
370400                 PERFORM 8000-WRITE-DETAIL-LINE                   37040099
370500              END-IF                                              37050099
370501**GB 3/20/12                                                      37050199
370502              IF XL023-SK-INPK-QTY-DIFF         = '*'             37050299
370503                 ADD 1 TO SK-INPK-QTY-DIFF                        37050399
370504                 MOVE 'INNER PK QTY      '   TO PV-FIELD-NAME     37050499
370505                 MOVE XL023-SK-INPK-QTY-RMS      TO               37050599
370506                                             PV-RMS-VALUE-PIC9V9  37050699
370507                 MOVE XL023-SK-INPK-QTY-LGCY TO                   37050799
370508                                          PV-LEGACY-VALUE-PIC9V9  37050899
370509                 PERFORM 8000-WRITE-DETAIL-LINE                   37050999
370510              END-IF                                              37051099
370511              IF XL023-SK-OTPK-QTY-DIFF         = '*'             37051199
370512                 ADD 1 TO SK-OTPK-QTY-DIFF                        37051299
370513                 MOVE 'OUTER PK QTY      '   TO PV-FIELD-NAME     37051399
370514                 MOVE XL023-SK-OTPK-QTY-RMS      TO               37051499
370515                                             PV-RMS-VALUE-PIC9V9  37051599
370516                 MOVE XL023-SK-OTPK-QTY-LGCY TO                   37051699
370517                                          PV-LEGACY-VALUE-PIC9V9  37051799
370518                 PERFORM 8000-WRITE-DETAIL-LINE                   37051899
370519              END-IF                                              37051999
370520**GB 3/20/12                                                      37052099
370530              IF XL023-SK-PROMO-STRT-DTE-DIFF   = '*'             37053099
370540                 ADD 1 TO SK-PROMO-STRT-DTE-DIFF                  37054099
370550                 MOVE 'PROMO STRT DTE    '   TO PV-FIELD-NAME     37055099
370560                 MOVE XL023-SK-PROMO-STRT-DTE-RMS       TO        37056099
370570                                             PV-RMS-VALUE         37057099
370580                 MOVE XL023-SK-PROMO-STRT-DTE-LGCY TO             37058099
370590                                             PV-LEGACY-VALUE      37059099
370600                 PERFORM 8000-WRITE-DETAIL-LINE                   37060099
370700              END-IF                                              37070099
370800              IF XL023-SK-PIC-SKU-IND-DIFF      = '*'             37080099
370900                 ADD 1 TO SK-PIC-SKU-IND-DIFF                     37090099
371000                 MOVE 'PIC SKU IND       '   TO PV-FIELD-NAME     37100099
371100                 MOVE XL023-SK-PIC-SKU-IND-RMS       TO           37110099
371200                                             PV-RMS-VALUE         37120099
371300                 MOVE XL023-SK-PIC-SKU-IND-LGCY TO                37130099
371400                                             PV-LEGACY-VALUE      37140099
371500                 PERFORM 8000-WRITE-DETAIL-LINE                   37150099
371600              END-IF                                              37160099
371700              IF XL023-SK-ORIG-ORD-QTY-DIFF     = '*'             37170099
371800                 ADD 1 TO SK-ORIG-ORD-QTY-DIFF                    37180099
371900                 MOVE 'ORIG ORD QTY      '   TO PV-FIELD-NAME     37190099
372000                 MOVE XL023-SK-ORIG-ORD-QTY-RMS       TO          37200099
372100                                             PV-RMS-VALUE-PIC9V9  37210099
372200                 MOVE XL023-SK-ORIG-ORD-QTY-LGCY TO               37220099
372300                                          PV-LEGACY-VALUE-PIC9V9  37230099
372400                 PERFORM 8000-WRITE-DETAIL-LINE                   37240099
372500              END-IF                                              37250099
372600              IF XL023-SK-ORD-QTY-DIFF          = '*'             37260099
372700                 ADD 1 TO SK-ORD-QTY-DIFF                         37270099
372800                 MOVE 'ORD QTY           '   TO PV-FIELD-NAME     37280099
372900                 MOVE XL023-SK-ORD-QTY-RMS       TO               37290099
373000                                             PV-RMS-VALUE-PIC9V9  37300099
373100                 MOVE XL023-SK-ORD-QTY-LGCY TO                    37310099
373200                                          PV-LEGACY-VALUE-PIC9V9  37320099
373300                 PERFORM 8000-WRITE-DETAIL-LINE                   37330099
373400              END-IF                                              37340099
373500              IF XL023-SK-CNCLD-QTY-DIFF        = '*'             37350099
373600                 ADD 1 TO SK-CNCLD-QTY-DIFF                       37360099
373700                 MOVE 'CNCLD QTY         '   TO PV-FIELD-NAME     37370099
373800                 MOVE XL023-SK-CNCLD-QTY-RMS       TO             37380099
373900                                             PV-RMS-VALUE-PIC9V9  37390099
374000                 MOVE XL023-SK-CNCLD-QTY-LGCY TO                  37400099
374100                                          PV-LEGACY-VALUE-PIC9V9  37410099
374200                 PERFORM 8000-WRITE-DETAIL-LINE                   37420099
374300              END-IF                                              37430099
374400              IF XL023-SK-PK-SKU-IND-DIFF       = '*'             37440099
374500                 ADD 1 TO SK-PK-SKU-IND-DIFF                      37450099
374600                 MOVE 'PK SKU IND        '   TO PV-FIELD-NAME     37460099
374700                 MOVE XL023-SK-PK-SKU-IND-RMS       TO            37470099
374800                                             PV-RMS-VALUE         37480099
374900                 MOVE XL023-SK-PK-SKU-IND-LGCY TO                 37490099
375000                                             PV-LEGACY-VALUE      37500099
375100                 PERFORM 8000-WRITE-DETAIL-LINE                   37510099
375200              END-IF                                              37520099
375300              IF XL023-SK-PK-SKU-DESC-DIFF      = '*'             37530099
375400                 ADD 1 TO SK-PK-SKU-DESC-DIFF                     37540099
375500                 MOVE 'PK SKU DESC       '   TO PV-FIELD-NAME     37550099
375600                 MOVE XL023-SK-PK-SKU-DESC-RMS       TO           37560099
375700                                             PV-RMS-VALUE         37570099
375800                 MOVE XL023-SK-PK-SKU-DESC-LGCY TO                37580099
375900                                             PV-LEGACY-VALUE      37590099
376000                 PERFORM 8000-WRITE-DETAIL-LINE                   37600099
376100              END-IF                                              37610099
376200              IF XL023-SK-DC-ORD-MULT-QTY-DIFF  = '*'             37620099
376300                 ADD 1 TO SK-DC-ORD-MULT-QTY-DIFF                 37630099
376400                 MOVE 'DC ORD MULT QTY   '   TO PV-FIELD-NAME     37640099
376500                 MOVE XL023-SK-DC-ORD-MULT-QTY-RMS       TO       37650099
376600                                             PV-RMS-VALUE-PIC9    37660099
376700                 MOVE XL023-SK-DC-ORD-MULT-QTY-LGCY TO            37670099
376800                                             PV-LEGACY-VALUE-PIC9 37680099
376900                 PERFORM 8000-WRITE-DETAIL-LINE                   37690099
377000              END-IF                                              37700099
377100              IF XL023-SK-UNT-RTL-AMT-DIFF      = '*'             37710099
377200                 ADD 1 TO SK-UNT-RTL-AMT-DIFF                     37720099
377300                 MOVE 'UNT RTL AMT       '   TO PV-FIELD-NAME     37730099
377400                 MOVE XL023-SK-UNT-RTL-AMT-RMS       TO           37740099
377500                                             PV-RMS-VALUE-PIC9V9  37750099
377600                 MOVE XL023-SK-UNT-RTL-AMT-LGCY TO                37760099
377700                                          PV-LEGACY-VALUE-PIC9V9  37770099
377800                 PERFORM 8000-WRITE-DETAIL-LINE                   37780099
377900              END-IF                                              37790099
378000              IF XL023-SK-GP-RTL-AMT-DIFF       = '*'             37800099
378010                 ADD 1 TO SK-GP-RTL-AMT-DIFF                      37801099
378020                 MOVE 'GP RTL AMT        '   TO PV-FIELD-NAME     37802099
378030                 MOVE XL023-SK-GP-RTL-AMT-RMS       TO            37803099
378040                                             PV-RMS-VALUE-PIC9V9  37804099
378050                 MOVE XL023-SK-GP-RTL-AMT-LGCY TO                 37805099
378060                                          PV-LEGACY-VALUE-PIC9V9  37806099
378070                 PERFORM 8000-WRITE-DETAIL-LINE                   37807099
378080              END-IF                                              37808099
378090              IF XL023-SK-GP-RTL-QTY-DIFF       = '*'             37809099
378100                 ADD 1 TO SK-GP-RTL-QTY-DIFF                      37810099
378101                 MOVE 'GP RTL QTY        '   TO PV-FIELD-NAME     37810199
378102                 MOVE XL023-SK-GP-RTL-QTY-RMS       TO            37810299
378103                                             PV-RMS-VALUE-PIC9V9  37810399
378104                 MOVE XL023-SK-GP-RTL-QTY-LGCY TO                 37810499
378105                                          PV-LEGACY-VALUE-PIC9V9  37810599
378106                 PERFORM 8000-WRITE-DETAIL-LINE                   37810699
378107              END-IF                                              37810799
378108                                                                  37810899
378109         WHEN XL023-XXT-PO-PK-SKU                                 37810999
378110              IF XL023-PB-PO-NBR-DIFF           = '*'             37811099
378120                 ADD 1 TO PB-PO-NBR-DIFF                          37812099
378130                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     37813099
378140                 MOVE XL023-PB-PO-NBR-RMS       TO                37814099
378150                                             PV-RMS-VALUE-PIC9    37815099
378160                 MOVE XL023-PB-PO-NBR-LGCY TO                     37816099
378170                                             PV-LEGACY-VALUE-PIC9 37817099
378180                 PERFORM 8000-WRITE-DETAIL-LINE                   37818099
378190              END-IF                                              37819099
378200              IF XL023-PB-PK-SKU-NBR-DIFF       = '*'             37820099
378300                 ADD 1 TO PB-PK-SKU-NBR-DIFF                      37830099
378400                 MOVE 'PK SKU NBR        '   TO PV-FIELD-NAME     37840099
378500                 MOVE XL023-PB-PK-SKU-NBR-RMS       TO            37850099
378600                                             PV-RMS-VALUE-PIC9    37860099
378700                 MOVE XL023-PB-PK-SKU-NBR-LGCY TO                 37870099
378800                                             PV-LEGACY-VALUE-PIC9 37880099
378900                 PERFORM 8000-WRITE-DETAIL-LINE                   37890099
379000              END-IF                                              37900099
379100              IF XL023-PB-SKU-NBR-DIFF          = '*'             37910099
379200                 ADD 1 TO PB-SKU-NBR-DIFF                         37920099
379300                 MOVE 'SKU NBR           '   TO PV-FIELD-NAME     37930099
379400                 MOVE XL023-PB-SKU-NBR-RMS       TO               37940099
379500                                             PV-RMS-VALUE-PIC9    37950099
379600                 MOVE XL023-PB-SKU-NBR-LGCY TO                    37960099
379700                                             PV-LEGACY-VALUE-PIC9 37970099
379800                 PERFORM 8000-WRITE-DETAIL-LINE                   37980099
379900              END-IF                                              37990099
380000              IF XL023-PB-UNT-COST-AMT-DIFF     = '*'             38000099
380100                 ADD 1 TO PB-UNT-COST-AMT-DIFF                    38010099
380200                 MOVE 'UNT COST AMT      '   TO PV-FIELD-NAME     38020099
380300                 MOVE XL023-PB-UNT-COST-AMT-RMS       TO          38030099
380400                                             PV-RMS-VALUE-PIC9V9  38040099
380500                 MOVE XL023-PB-UNT-COST-AMT-LGCY TO               38050099
380600                                          PV-LEGACY-VALUE-PIC9V9  38060099
380700                 PERFORM 8000-WRITE-DETAIL-LINE                   38070099
380800              END-IF                                              38080099
380900              IF XL023-PB-FRST-COST-AMT-DIFF    = '*'             38090099
381000                 ADD 1 TO PB-FRST-COST-AMT-DIFF                   38100099
381100                 MOVE 'FRST COST AMT     '   TO PV-FIELD-NAME     38110099
381200                 MOVE XL023-PB-FRST-COST-AMT-RMS       TO         38120099
381300                                             PV-RMS-VALUE-PIC9V9  38130099
381400                 MOVE XL023-PB-FRST-COST-AMT-LGCY TO              38140099
381500                                          PV-LEGACY-VALUE-PIC9V9  38150099
381600                 PERFORM 8000-WRITE-DETAIL-LINE                   38160099
381700              END-IF                                              38170099
381800              IF XL023-PB-UNT-RTL-AMT-DIFF      = '*'             38180099
381900                 ADD 1 TO PB-UNT-RTL-AMT-DIFF                     38190099
382000                 MOVE 'UNT RTL AMT       '   TO PV-FIELD-NAME     38200099
382100                 MOVE XL023-PB-UNT-RTL-AMT-RMS       TO           38210099
382200                                             PV-RMS-VALUE-PIC9V9  38220099
382300                 MOVE XL023-PB-UNT-RTL-AMT-LGCY TO                38230099
382400                                          PV-LEGACY-VALUE-PIC9V9  38240099
382500                 PERFORM 8000-WRITE-DETAIL-LINE                   38250099
382600              END-IF                                              38260099
382700              IF XL023-PB-GP-RTL-AMT-DIFF       = '*'             38270099
382710                 ADD 1 TO PB-GP-RTL-AMT-DIFF                      38271099
382720                 MOVE 'GP RTL AMT        '   TO PV-FIELD-NAME     38272099
382730                 MOVE XL023-PB-GP-RTL-AMT-RMS       TO            38273099
382740                                             PV-RMS-VALUE-PIC9V9  38274099
382750                 MOVE XL023-PB-GP-RTL-AMT-LGCY TO                 38275099
382760                                          PV-LEGACY-VALUE-PIC9V9  38276099
382770                 PERFORM 8000-WRITE-DETAIL-LINE                   38277099
382780              END-IF                                              38278099
382790              IF XL023-PB-GP-RTL-QTY-DIFF       = '*'             38279099
382800                 ADD 1 TO PB-GP-RTL-QTY-DIFF                      38280099
382801                 MOVE 'GP RTL QTY        '   TO PV-FIELD-NAME     38280199
382802                 MOVE XL023-PB-GP-RTL-QTY-RMS       TO            38280299
382803                                             PV-RMS-VALUE-PIC9V9  38280399
382804                 MOVE XL023-PB-GP-RTL-QTY-LGCY TO                 38280499
382805                                          PV-LEGACY-VALUE-PIC9V9  38280599
382806                 PERFORM 8000-WRITE-DETAIL-LINE                   38280699
382807              END-IF                                              38280799
382808              IF XL023-PB-RATO-UNT-QTY-DIFF     = '*'             38280899
382809                 ADD 1 TO PB-RATO-UNT-QTY-DIFF                    38280999
382810                 MOVE 'RATO UNT QTY      '   TO PV-FIELD-NAME     38281099
382820                 MOVE XL023-PB-RATO-UNT-QTY-RMS       TO          38282099
382830                                             PV-RMS-VALUE-PIC9    38283099
382840                 MOVE XL023-PB-RATO-UNT-QTY-LGCY TO               38284099
382850                                             PV-LEGACY-VALUE-PIC9 38285099
382860                 PERFORM 8000-WRITE-DETAIL-LINE                   38286099
382870              END-IF                                              38287099
382871*GB 7/31/12                                                       38287199
382872              IF XL023-PB-INPK-QTY-DIFF  = '*'                    38287299
382873                 ADD 1 TO PB-INPK-UNT-QTY-DIFF                    38287399
382874                 MOVE 'PRPK INPK QTY     '   TO PV-FIELD-NAME     38287499
382875                 MOVE XL023-PB-RATO-UNT-QTY-RMS       TO          38287599
382876                                             PV-RMS-VALUE-PIC9    38287699
382877                 MOVE XL023-PB-RATO-UNT-QTY-LGCY TO               38287799
382878                                             PV-LEGACY-VALUE-PIC9 38287899
382879                 PERFORM 8000-WRITE-DETAIL-LINE                   38287999
382881              END-IF                                              38288199
382882              IF XL023-PB-OTPK-QTY-DIFF  = '*'                    38288299
382883                 ADD 1 TO PB-OTPK-UNT-QTY-DIFF                    38288399
382884                 MOVE 'OTPK INPK QTY     '   TO PV-FIELD-NAME     38288499
382885                 MOVE XL023-PB-OTPK-QTY-RMS           TO          38288599
382886                                             PV-RMS-VALUE-PIC9    38288699
382887                 MOVE XL023-PB-OTPK-QTY-LGCY     TO               38288799
382888                                             PV-LEGACY-VALUE-PIC9 38288899
382889                 PERFORM 8000-WRITE-DETAIL-LINE                   38288999
382890              END-IF                                              38289099
382891*GB 7/31/12                                                       38289199
382892                                                                  38289299
382893         WHEN XL023-XXT-PO-PK-SKU-LOC                             38289399
382900              IF XL023-PL-PO-NBR-DIFF           = '*'             38290099
383000                 ADD 1 TO PL-PO-NBR-DIFF                          38300099
383100                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     38310099
383200                 MOVE XL023-PL-PO-NBR-RMS       TO                38320099
383300                                             PV-RMS-VALUE-PIC9    38330099
383400                 MOVE XL023-PL-PO-NBR-LGCY TO                     38340099
383500                                             PV-LEGACY-VALUE-PIC9 38350099
383600                 PERFORM 8000-WRITE-DETAIL-LINE                   38360099
383700              END-IF                                              38370099
383800              IF XL023-PL-SKU-NBR-DIFF          = '*'             38380099
383900                 ADD 1 TO PL-SKU-NBR-DIFF                         38390099
384000                 MOVE 'SKU NBR           '   TO PV-FIELD-NAME     38400099
384100                 MOVE XL023-PL-SKU-NBR-RMS       TO               38410099
384200                                             PV-RMS-VALUE-PIC9    38420099
384300                 MOVE XL023-PL-SKU-NBR-LGCY TO                    38430099
384400                                             PV-LEGACY-VALUE-PIC9 38440099
384500                 PERFORM 8000-WRITE-DETAIL-LINE                   38450099
384600              END-IF                                              38460099
384700              IF XL023-PL-PK-SKU-NBR-DIFF       = '*'             38470099
384800                 ADD 1 TO PL-PK-SKU-NBR-DIFF                      38480099
384900                 MOVE 'PK SKU NBR        '   TO PV-FIELD-NAME     38490099
385000                 MOVE XL023-PL-PK-SKU-NBR-RMS       TO            38500099
385100                                             PV-RMS-VALUE-PIC9    38510099
385200                 MOVE XL023-PL-PK-SKU-NBR-LGCY TO                 38520099
385300                                             PV-LEGACY-VALUE-PIC9 38530099
385400                 PERFORM 8000-WRITE-DETAIL-LINE                   38540099
385500              END-IF                                              38550099
385600              IF XL023-PL-LOC-NBR-DIFF          = '*'             38560099
385700                 ADD 1 TO PL-LOC-NBR-DIFF                         38570099
385800                 MOVE 'LOC NBR           '   TO PV-FIELD-NAME     38580099
385900                 MOVE XL023-PL-LOC-NBR-RMS       TO               38590099
386000                                             PV-RMS-VALUE-PIC9    38600099
386100                 MOVE XL023-PL-LOC-NBR-LGCY TO                    38610099
386200                                             PV-LEGACY-VALUE-PIC9 38620099
386300                 PERFORM 8000-WRITE-DETAIL-LINE                   38630099
386400              END-IF                                              38640099
386500                                                                  38650099
386600         WHEN XL023-XXT-PO-INBD-ALLOC                             38660099
386700              IF XL023-LO-PO-NBR-DIFF           = '*'             38670099
386800                 ADD 1 TO LO-PO-NBR-DIFF                          38680099
386900                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     38690099
387000                 MOVE XL023-LO-PO-NBR-RMS       TO                38700099
387100                                             PV-RMS-VALUE-PIC9    38710099
387200                 MOVE XL023-LO-PO-NBR-LGCY TO                     38720099
387300                                             PV-LEGACY-VALUE-PIC9 38730099
387400                 PERFORM 8000-WRITE-DETAIL-LINE                   38740099
387500              END-IF                                              38750099
387600              IF XL023-LO-SKU-NBR-DIFF          = '*'             38760099
387700                 ADD 1 TO LO-SKU-NBR-DIFF                         38770099
387800                 MOVE 'SKU NBR           '   TO PV-FIELD-NAME     38780099
387900                 MOVE XL023-LO-SKU-NBR-RMS       TO               38790099
388000                                             PV-RMS-VALUE-PIC9    38800099
388100                 MOVE XL023-LO-SKU-NBR-LGCY TO                    38810099
388200                                             PV-LEGACY-VALUE-PIC9 38820099
388300                 PERFORM 8000-WRITE-DETAIL-LINE                   38830099
388400              END-IF                                              38840099
388500              IF XL023-LO-LOC-NBR-DIFF          = '*'             38850099
388600                 ADD 1 TO LO-LOC-NBR-DIFF                         38860099
388700                 MOVE 'LOC NBR           '   TO PV-FIELD-NAME     38870099
388800                 MOVE XL023-LO-LOC-NBR-RMS       TO               38880099
388900                                             PV-RMS-VALUE-PIC9    38890099
389000                 MOVE XL023-LO-LOC-NBR-LGCY TO                    38900099
389100                                             PV-LEGACY-VALUE-PIC9 38910099
389200                 PERFORM 8000-WRITE-DETAIL-LINE                   38920099
389300              END-IF                                              38930099
389400              IF XL023-LO-LOC-TYP-CDE-DIFF      = '*'             38940099
389500                 ADD 1 TO LO-LOC-TYP-CDE-DIFF                     38950099
389600                 MOVE 'LOC TYP CDE       '   TO PV-FIELD-NAME     38960099
389700                 MOVE XL023-LO-LOC-TYP-CDE-RMS       TO           38970099
389800                                             PV-RMS-VALUE         38980099
389900                 MOVE XL023-LO-LOC-TYP-CDE-LGCY TO                38990099
390000                                             PV-LEGACY-VALUE      39000099
390100                 PERFORM 8000-WRITE-DETAIL-LINE                   39010099
390200              END-IF                                              39020099
390300              IF XL023-LO-ORD-QTY-DIFF          = '*'             39030099
390400                 ADD 1 TO LO-ORD-QTY-DIFF                         39040099
390500                 MOVE 'ORD QTY           '   TO PV-FIELD-NAME     39050099
390600                 MOVE XL023-LO-ORD-QTY-RMS       TO               39060099
390700                                             PV-RMS-VALUE-PIC9V9  39070099
390800                 MOVE XL023-LO-ORD-QTY-LGCY TO                    39080099
390900                                          PV-LEGACY-VALUE-PIC9V9  39090099
391000                 PERFORM 8000-WRITE-DETAIL-LINE                   39100099
391100              END-IF                                              39110099
391200              IF XL023-LO-ORIG-ORD-QTY-DIFF     = '*'             39120099
391300                 ADD 1 TO LO-ORIG-ORD-QTY-DIFF                    39130099
391400                 MOVE 'ORIG ORD QTY      '   TO PV-FIELD-NAME     39140099
391500                 MOVE XL023-LO-ORIG-ORD-QTY-RMS       TO          39150099
391600                                             PV-RMS-VALUE-PIC9V9  39160099
391700                 MOVE XL023-LO-ORIG-ORD-QTY-LGCY TO               39170099
391800                                          PV-LEGACY-VALUE-PIC9V9  39180099
391900                 PERFORM 8000-WRITE-DETAIL-LINE                   39190099
392000              END-IF                                              39200099
392100              IF XL023-LO-CNCLD-QTY-DIFF        = '*'             39210099
392200                 ADD 1 TO LO-CNCLD-QTY-DIFF                       39220099
392300                 MOVE 'CNCLD QTY         '   TO PV-FIELD-NAME     39230099
392400                 MOVE XL023-LO-CNCLD-QTY-RMS       TO             39240099
392500                                             PV-RMS-VALUE-PIC9V9  39250099
392600                 MOVE XL023-LO-CNCLD-QTY-LGCY TO                  39260099
392700                                          PV-LEGACY-VALUE-PIC9V9  39270099
392800                 PERFORM 8000-WRITE-DETAIL-LINE                   39280099
392900              END-IF                                              39290099
393000              IF XL023-LO-CNCL-CDE-DIFF         = '*'             39300099
393100                 ADD 1 TO LO-CNCL-CDE-DIFF                        39310099
393200                 MOVE 'CNCL CDE          '   TO PV-FIELD-NAME     39320099
393300                 MOVE XL023-LO-CNCL-CDE-RMS       TO              39330099
393400                                             PV-RMS-VALUE         39340099
393500                 MOVE XL023-LO-CNCL-CDE-LGCY TO                   39350099
393600                                          PV-LEGACY-VALUE         39360099
393700                 PERFORM 8000-WRITE-DETAIL-LINE                   39370099
393800              END-IF                                              39380099
393900              IF XL023-LO-CNCL-DTE-DIFF         = '*'             39390099
394000                 ADD 1 TO LO-CNCL-DTE-DIFF                        39400099
394100                 MOVE 'CNCL DTE          '   TO PV-FIELD-NAME     39410099
394200                 MOVE XL023-LO-CNCL-DTE-RMS       TO              39420099
394300                                             PV-RMS-VALUE         39430099
394400                 MOVE XL023-LO-CNCL-DTE-LGCY TO                   39440099
394500                                          PV-LEGACY-VALUE         39450099
394600                 PERFORM 8000-WRITE-DETAIL-LINE                   39460099
394700              END-IF                                              39470099
394800              IF XL023-LO-CNCLD-BY-USR-ID-DIFF  = '*'             39480099
394900                 ADD 1 TO LO-CNCLD-BY-USR-ID-DIFF                 39490099
395000                 MOVE 'CNCLD BY USR ID   '   TO PV-FIELD-NAME     39500099
395100                 MOVE XL023-LO-CNCLD-BY-USR-ID-RMS       TO       39510099
395200                                             PV-RMS-VALUE         39520099
395300                 MOVE XL023-LO-CNCLD-BY-USR-ID-LGCY TO            39530099
395400                                             PV-LEGACY-VALUE      39540099
395500                 PERFORM 8000-WRITE-DETAIL-LINE                   39550099
395600              END-IF                                              39560099
395700              IF XL023-LO-DC-ALLC-MULT-QTY-DIFF = '*'             39570099
395800                 ADD 1 TO LO-DC-ALLC-MULT-QTY-DIFF                39580099
395900                 MOVE 'DC ALLC MULT QTY  '   TO PV-FIELD-NAME     39590099
396000                 MOVE XL023-LO-DC-ALLC-MULT-QTY-RMS       TO      39600099
396100                                             PV-RMS-VALUE-PIC9    39610099
396200                 MOVE XL023-LO-DC-ALLC-MULT-QTY-LGCY TO           39620099
396300                                          PV-LEGACY-VALUE-PIC9    39630099
396400                 PERFORM 8000-WRITE-DETAIL-LINE                   39640099
396500              END-IF                                              39650099
396600              IF XL023-LO-STR-ALLC-MLT-QTY-DIFF = '*'             39660099
396700                 ADD 1 TO LO-STR-ALLC-MLT-QTY-DIFF                39670099
396800                 MOVE 'STR ALLC MLT QTY  '   TO PV-FIELD-NAME     39680099
396900                 MOVE XL023-LO-STR-ALLC-MLT-QTY-RMS       TO      39690099
397000                                             PV-RMS-VALUE-PIC9    39700099
397100                 MOVE XL023-LO-STR-ALLC-MLT-QTY-LGCY TO           39710099
397200                                          PV-LEGACY-VALUE-PIC9    39720099
397300                 PERFORM 8000-WRITE-DETAIL-LINE                   39730099
397400              END-IF                                              39740099
397500              IF XL023-LO-ALLOC-RND-CDE-DIFF    = '*'             39750099
397600                 ADD 1 TO LO-ALLOC-RND-CDE-DIFF                   39760099
397700                 MOVE 'ALLOC RND CDE     '   TO PV-FIELD-NAME     39770099
397800                 MOVE XL023-LO-ALLOC-RND-CDE-RMS       TO         39780099
397900                                             PV-RMS-VALUE         39790099
398000                 MOVE XL023-LO-ALLOC-RND-CDE-LGCY TO              39800099
398100                                             PV-LEGACY-VALUE      39810099
398200                 PERFORM 8000-WRITE-DETAIL-LINE                   39820099
398300              END-IF                                              39830099
398400              IF XL023-LO-SHTG-PRT-OPT-CDE-DIFF = '*'             39840099
398500                 ADD 1 TO LO-SHTG-PRT-OPT-CDE-DIFF                39850099
398600                 MOVE 'SHTG PRT OPT CDE  '   TO PV-FIELD-NAME     39860099
398700                 MOVE XL023-LO-SHTG-PRT-OPT-CDE-RMS       TO      39870099
398800                                             PV-RMS-VALUE         39880099
398900                 MOVE XL023-LO-SHTG-PRT-OPT-CDE-LGCY TO           39890099
399000                                             PV-LEGACY-VALUE      39900099
399100                 PERFORM 8000-WRITE-DETAIL-LINE                   39910099
399200              END-IF                                              39920099
399300              IF XL023-LO-OVRG-PRT-OPT-CDE-DIFF = '*'             39930099
399400                 ADD 1 TO LO-OVRG-PRT-OPT-CDE-DIFF                39940099
399500                 MOVE 'OVRG PRT OPT CDE  '   TO PV-FIELD-NAME     39950099
399600                 MOVE XL023-LO-OVRG-PRT-OPT-CDE-RMS       TO      39960099
399700                                             PV-RMS-VALUE         39970099
399800                 MOVE XL023-LO-OVRG-PRT-OPT-CDE-LGCY TO           39980099
399900                                             PV-LEGACY-VALUE      39990099
400000                 PERFORM 8000-WRITE-DETAIL-LINE                   40000099
400100              END-IF                                              40010099
400200              IF XL023-LO-EXT-SHTG-THR-IND-DIFF = '*'             40020099
400300                 ADD 1 TO LO-EXT-SHTG-THR-IND-DIFF                40030099
400400                 MOVE 'EXT SHTG THR IND  '   TO PV-FIELD-NAME     40040099
400500                 MOVE XL023-LO-EXT-SHTG-THR-IND-RMS       TO      40050099
400600                                             PV-RMS-VALUE         40060099
400700                 MOVE XL023-LO-EXT-SHTG-THR-IND-LGCY TO           40070099
400800                                             PV-LEGACY-VALUE      40080099
400900                 PERFORM 8000-WRITE-DETAIL-LINE                   40090099
401000              END-IF                                              40100099
401100                                                                  40110099
401200         WHEN XL023-XXT-PO-OTBND-ALLOC                            40120099
401300              IF XL023-SB-PO-NBR-DIFF           = '*'             40130099
401400                 ADD 1 TO SB-PO-NBR-DIFF                          40140099
401500                 MOVE 'PO NBR            '   TO PV-FIELD-NAME     40150099
401600                 MOVE XL023-SB-PO-NBR-RMS       TO                40160099
401700                                             PV-RMS-VALUE-PIC9    40170099
401800                 MOVE XL023-SB-PO-NBR-LGCY TO                     40180099
401900                                             PV-LEGACY-VALUE-PIC9 40190099
402000                 PERFORM 8000-WRITE-DETAIL-LINE                   40200099
402100              END-IF                                              40210099
402200              IF XL023-SB-SKU-NBR-DIFF          = '*'             40220099
402300                 ADD 1 TO SB-SKU-NBR-DIFF                         40230099
402400                 MOVE 'SKU NBR           '   TO PV-FIELD-NAME     40240099
402500                 MOVE XL023-SB-SKU-NBR-RMS       TO               40250099
402600                                             PV-RMS-VALUE-PIC9    40260099
402700                 MOVE XL023-SB-SKU-NBR-LGCY TO                    40270099
402800                                             PV-LEGACY-VALUE-PIC9 40280099
402900                 PERFORM 8000-WRITE-DETAIL-LINE                   40290099
403000              END-IF                                              40300099
403100              IF XL023-SB-LOC-NBR-DIFF          = '*'             40310099
403200                 ADD 1 TO SB-LOC-NBR-DIFF                         40320099
403300                 MOVE 'LOC NBR           '   TO PV-FIELD-NAME     40330099
403400                 MOVE XL023-SB-LOC-NBR-RMS       TO               40340099
403500                                             PV-RMS-VALUE-PIC9    40350099
403600                 MOVE XL023-SB-LOC-NBR-LGCY TO                    40360099
403700                                             PV-LEGACY-VALUE-PIC9 40370099
403800                 PERFORM 8000-WRITE-DETAIL-LINE                   40380099
403900              END-IF                                              40390099
404000              IF XL023-SB-STR-NBR-DIFF          = '*'             40400099
404100                 ADD 1 TO SB-STR-NBR-DIFF                         40410099
404200                 MOVE 'STR NBR           '   TO PV-FIELD-NAME     40420099
404300                 MOVE XL023-SB-STR-NBR-RMS       TO               40430099
404400                                             PV-RMS-VALUE-PIC9    40440099
404500                 MOVE XL023-SB-STR-NBR-LGCY TO                    40450099
404600                                             PV-LEGACY-VALUE-PIC9 40460099
404700                 PERFORM 8000-WRITE-DETAIL-LINE                   40470099
404800              END-IF                                              40480099
404900              IF XL023-SB-RNK-SEQ-NBR-DIFF      = '*'             40490099
405000                 ADD 1 TO SB-RNK-SEQ-NBR-DIFF                     40500099
405100                 MOVE 'RNK SEQ NBR       '   TO PV-FIELD-NAME     40510099
405200                 MOVE XL023-SB-RNK-SEQ-NBR-RMS       TO           40520099
405300                                             PV-RMS-VALUE-PIC9    40530099
405400                 MOVE XL023-SB-RNK-SEQ-NBR-LGCY TO                40540099
405500                                             PV-LEGACY-VALUE-PIC9 40550099
405600                 PERFORM 8000-WRITE-DETAIL-LINE                   40560099
405700              END-IF                                              40570099
405800              IF XL023-SB-ALLOC-QTY-DIFF        = '*'             40580099
405900                 ADD 1 TO SB-ALLOC-QTY-DIFF                       40590099
406000                 MOVE 'ALLOC QTY         '   TO PV-FIELD-NAME     40600099
406100                 MOVE XL023-SB-ALLOC-QTY-RMS       TO             40610099
406200                                             PV-RMS-VALUE-PIC9    40620099
406300                 MOVE XL023-SB-ALLOC-QTY-LGCY TO                  40630099
406400                                             PV-LEGACY-VALUE-PIC9 40640099
406500                 PERFORM 8000-WRITE-DETAIL-LINE                   40650099
406600              END-IF                                              40660099
406700              IF XL023-SB-ALLOC-SEQ-CDE-DIFF    = '*'             40670099
406800                 ADD 1 TO SB-ALLOC-SEQ-CDE-DIFF                   40680099
406900                 MOVE 'ALLOC SEQ CDE     '   TO PV-FIELD-NAME     40690099
407000                 MOVE XL023-SB-ALLOC-SEQ-CDE-RMS       TO         40700099
407100                                             PV-RMS-VALUE         40710099
407200                 MOVE XL023-SB-ALLOC-SEQ-CDE-LGCY TO              40720099
407300                                             PV-LEGACY-VALUE      40730099
407400                 PERFORM 8000-WRITE-DETAIL-LINE                   40740099
407500              END-IF                                              40750099
407600              IF XL023-SB-STR-CNSTR-CDE-DIFF    = '*'             40760099
407700                 ADD 1 TO SB-STR-CNSTR-CDE-DIFF                   40770099
407800                 MOVE 'STR CNSTR CDE     '   TO PV-FIELD-NAME     40780099
407900                 MOVE XL023-SB-STR-CNSTR-CDE-RMS       TO         40790099
408000                                             PV-RMS-VALUE         40800099
408100                 MOVE XL023-SB-STR-CNSTR-CDE-LGCY TO              40810099
408200                                             PV-LEGACY-VALUE      40820099
408300                 PERFORM 8000-WRITE-DETAIL-LINE                   40830099
408400              END-IF                                              40840099
408500              IF XL023-SB-STR-CNSTR-QTY-DIFF    = '*'             40850099
408600                 ADD 1 TO SB-STR-CNSTR-QTY-DIFF                   40860099
408700                 MOVE 'STR CNSTR QTY     '   TO PV-FIELD-NAME     40870099
408800                 MOVE XL023-SB-STR-CNSTR-QTY-RMS       TO         40880099
408900                                             PV-RMS-VALUE-PIC9    40890099
409000                 MOVE XL023-SB-STR-CNSTR-QTY-LGCY TO              40900099
409100                                             PV-LEGACY-VALUE-PIC9 40910099
409200                 PERFORM 8000-WRITE-DETAIL-LINE                   40920099
409300              END-IF                                              40930099
409400                                                                  40940099
409500     END-EVALUATE.                                                40950099
409600                                                                  40960099
409700 4200-EXIT. EXIT.                                                 40970099
409800                                                                  40980099
409900 7000-SELECT-TPURCHS.                                             40990099
410000                                                                  41000099
410100     MOVE CURRENT-PO-NO TO CURRENT-PO-NO-COMP.                    41010099
410200                                                                  41020099
410300     EXEC SQL                                                     41030099
410400        SELECT  PO_NBR                                            41040099
410500               ,EDI_IND                                           41050099
410600               ,PKGNG_CDE                                         41060099
410700               ,EDI_REXMIT_IND                                    41070099
410800               ,EDI_REXMIT_TMST                                   41080099
410900               ,STATUS_CDE                                        41090099
411000                                                                  41100099
411100          INTO  :PURCHS-PO-NBR                                    41110099
411200               ,:PURCHS-EDI-IND                                   41120099
411300               ,:PURCHS-PKGNG-CDE                                 41130099
411400               ,:PURCHS-EDI-REXMIT-IND                            41140099
411500               ,:PURCHS-EDI-REXMIT-TMST                           41150099
411600               ,:PURCHS-STATUS-CDE                                41160099
411700                                                                  41170099
411800         FROM  TPURCHS                                            41180099
411900                                                                  41190099
412000        WHERE  PO_NBR          = :CURRENT-PO-NO-COMP              41200099
412100          AND  VER_STATUS_CDE  = 'A'                              41210099
412200                                                                  41220099
412300     END-EXEC.                                                    41230099
412400                                                                  41240099
412500     EVALUATE SQLCODE                                             41250099
412600         WHEN 0                                                   41260099
412700              CONTINUE                                            41270099
412800                                                                  41280099
412900         WHEN OTHER                                               41290099
413000              MOVE SQLCODE TO PV-SQLCODE                          41300099
413100              DISPLAY '7000-SELECT-TPURCHS - INVALID SQLCODE - '  41310099
413200                       PV-SQLCODE ' - '                           41320099
413300                       CURRENT-PO-NO                              41330099
413400**            MOVE '7000-SELECT-TPURCHS  ' TO DP013-PARAGRAPH     41340099
413500**            STRING 'SELECT TPURCHS                         '    41350099
413600**                   '                                       '    41360099
413700**                    DELIMITED BY SIZE                           41370099
413800**                    INTO DP013-MESSAGE-TEXT (1)                 41380099
413900**            MOVE 'TPURCHS           '                           41390099
414000**                             TO DP013-DB2-TABLE-NAME (1)        41400099
414100**            MOVE SQLCA       TO DP013-SQLCA                     41410099
414200**            SET DP013-DB2-ABEND                                 41420099
414300**                DP013-XCTL-DISPLAY-RESTART TO TRUE              41430099
414400**            PERFORM DP013-0000-PROCESS-ABEND                    41440099
414500                                                                  41450099
414600     END-EVALUATE.                                                41460099
414700                                                                  41470099
414800 7000-EXIT. EXIT.                                                 41480099
414900                                                                  41490099
415000*--------------------------------------------------------------*  41500099
415100*    ROUTINE PRINTS DAILY REPORT.                              *  41510099
415200*       CHECKS FOR PAGE BREAK.  PV-NUMBER-LINES IS USED        *  41520099
415300*           TO DETERMINE THIS.                                 *  41530099
415400*       READS TPURCHS TABLE FOR REPORT INFORMATION.            *  41540099
415500*       DETERMINES WHETHER OR NOT THIS IS A NEW PO AND TAKES   *  41550099
415600*           APPROPRIATE ACTION.                                *  41560099
415700*       TRACKS WHETHER ONE PO AND TEMPLATE TYPE EXCEEDS THE    *  41570099
415800*           MAXIMUM NUMBER OF LINES TO DISPLAY.                *  41580099
415900*           PS-EXCEEDED-MAXIMUM IS USED FOR THIS.              *  41590099
416000*                                                              *  41600099
416100*--------------------------------------------------------------*  41610099
416200                                                                  41620099
416300 8000-WRITE-DETAIL-LINE.                                          41630099
416400                                                                  41640099
416500     IF PV-NUMBER-LINES > PC-MAX-LINES                            41650099
416600        PERFORM 8400-PRINT-HEADINGS.                              41660099
416700                                                                  41670099
416800     PERFORM 7000-SELECT-TPURCHS.                                 41680099
416900                                                                  41690099
417000     EVALUATE TRUE                                                41700099
417100         WHEN PS-NEW-PAGE                                         41710099
417200             MOVE XL023-PO-SORT-KEY-PO   TO DTL1-PO-NBR           41720099
417300                                            PV-PREVIOUS-PO-NO     41730099
417400             MOVE PURCHS-PKGNG-CDE       TO DTL1-PKG-CD           41740099
417410*** PRB0051493 START                                              41741099
417500*            MOVE PURCHS-EDI-REXMIT-IND  TO DTL1-EDI-IND          41750099
417600*            MOVE PURCHS-EDI-REXMIT-TMST TO DTL1-EDI-XMIT         41760099
417610*** PRB0051493 END                                                41761099
417700             MOVE PURCHS-STATUS-CDE      TO DTL1-STATUS-CODE      41770099
417800             MOVE 1 TO PV-LINE-ADVANCE-COUNT                      41780099
417900                                                                  41790099
418000         WHEN XL023-PO-SORT-KEY-PO = PV-PREVIOUS-PO-NO            41800099
418100             ADD  1 TO PV-LINE-COUNT                              41810099
418200             MOVE SPACES     TO DTL1-PO-NBR                       41820099
418300                                DTL1-PKG-CD                       41830099
418400                                DTL1-EDI-IND                      41840099
418500                                DTL1-EDI-XMIT                     41850099
418600                                                                  41860099
418700         WHEN OTHER                                               41870099
418800*JPL (ADDED SAVE FIELDS)                                          41880099
418900             MOVE XL023-PO-SORT-KEY-PO   TO PV-PREVIOUS-PO-NO     41890099
419000                                            DTL1-PO-NBR           41900099
419100                                            SAVE-PO-NBR           41910099
419200             MOVE PURCHS-PKGNG-CDE       TO DTL1-PKG-CD           41920099
419300                                            SAVE-PKG-CD           41930099
419310*** PRB0051493 START                                              41931099
419400*            MOVE PURCHS-EDI-REXMIT-IND  TO DTL1-EDI-IND          41940099
419500*                                           SAVE-EDI-IND          41950099
419600*            MOVE PURCHS-EDI-REXMIT-TMST TO DTL1-EDI-XMIT         41960099
419700*                                           SAVE-EDI-XMIT         41970099
419710*** PRB0051493 END                                                41971099
419800             MOVE PURCHS-STATUS-CDE      TO DTL1-STATUS-CODE      41980099
419900                                            SAVE-STATUS-CODE      41990099
420000             MOVE 2 TO PV-LINE-ADVANCE-COUNT                      42000099
420100             MOVE 1 TO PV-LINE-COUNT                              42010099
420200             SET PS-DIDNT-EXCEED-LIMIT TO TRUE                    42020099
420300             SET PS-NEW-PO             TO TRUE                    42030099
420400     END-EVALUATE.                                                42040099
420500                                                                  42050099
420600     IF XL023-PO-DOMAIN-TEMPLATE-IND = PREVIOUS-TEMPLATE-IND      42060099
420700        CONTINUE                                                  42070099
420800     ELSE                                                         42080099
420900        MOVE 0 TO PV-LINE-COUNT                                   42090099
421000        SET PS-DIDNT-EXCEED-LIMIT TO TRUE                         42100099
421100        MOVE XL023-PO-DOMAIN-TEMPLATE-IND TO                      42110099
421200                           PREVIOUS-TEMPLATE-IND                  42120099
421300     END-IF.                                                      42130099
421400                                                                  42140099
421500     IF XL023-COMPARE-INDICATOR = PREVIOUS-COMPARE-IND            42150099
421600        CONTINUE                                                  42160099
421700     ELSE                                                         42170099
421800        MOVE 0 TO PV-LINE-COUNT                                   42180099
421900        SET PS-DIDNT-EXCEED-LIMIT TO TRUE                         42190099
422000        MOVE XL023-COMPARE-INDICATOR TO                           42200099
422100                           PREVIOUS-COMPARE-IND                   42210099
422200     END-IF.                                                      42220099
422300                                                                  42230099
422400     EVALUATE TRUE                                                42240099
422500         WHEN XL023-ON-RMS-ONLY                                   42250099
422600              PERFORM 8100-DETERMINE-TEMPLATE                     42260099
422700              MOVE '*** RMS ONLY ***' TO DTL1-RMS-VALUE           42270099
422800              MOVE SPACES             TO DTL1-LEGACY-VALUE        42280099
422900                                                                  42290099
423000         WHEN XL023-ON-LEGACY-ONLY                                42300099
423100              PERFORM 8100-DETERMINE-TEMPLATE                     42310099
423200              MOVE SPACES                TO DTL1-RMS-VALUE        42320099
423300              MOVE '*** LEGACY ONLY ***' TO DTL1-LEGACY-VALUE     42330099
423400                                                                  42340099
423500         WHEN XL023-ON-BOTH-RMS-LEGACY                            42350099
423600             IF (PURCHS-PKGNG-CDE NOT = 'B')                      42360099
423700               AND (XL023-LO-DC-ALLC-MULT-QTY-DIFF = '*')         42370099
423800                 INITIALIZE DETAIL-LINE-1                         42380099
423900                 SUBTRACT 1 FROM  PV-LINE-COUNT                   42390099
424000                 SET PS-DIDNT-EXCEED-LIMIT TO TRUE                42400099
424100             ELSE                                                 42410099
424200                 PERFORM 8100-DETERMINE-TEMPLATE                  42420099
424300                 MOVE PV-RMS-VALUE  TO DTL1-RMS-VALUE             42430099
424400                 MOVE PV-LEGACY-VALUE TO DTL1-LEGACY-VALUE        42440099
424500             END-IF                                               42450099
424600                                                                  42460099
424700     END-EVALUATE.                                                42470099
424800                                                                  42480099
424900     EVALUATE TRUE                                                42490099
425000         WHEN PV-LINE-COUNT = PV-LINE-COUNT-LIMIT                 42500099
425100              MOVE '** EXCEEDED LIMIT **' TO DTL1-TEMP-FIELD-NBR  42510099
425200                                             DTL1-RMS-VALUE       42520099
425300                                             DTL1-LEGACY-VALUE    42530099
425400              WRITE REPORT-RECORD FROM DETAIL-LINE-1              42540099
425500                    AFTER ADVANCING PV-LINE-ADVANCE-COUNT         42550099
425600              ADD PV-LINE-ADVANCE-COUNT TO PV-NUMBER-LINES        42560099
425700              MOVE 1 TO PV-LINE-ADVANCE-COUNT                     42570099
425800              SET PS-EXCEEDED-LIMIT TO TRUE                       42580099
425900                                                                  42590099
426000         WHEN PV-LINE-COUNT > PV-LINE-COUNT-LIMIT                 42600099
426100              CONTINUE                                            42610099
426200****          DON"T PRINT ANY LINES BEYOND THE LIMIT              42620099
426300                                                                  42630099
426400         WHEN OTHER                                               42640099
426500             IF PURCHS-PKGNG-CDE NOT = 'B' AND                    42650099
426600                XL023-LO-DC-ALLC-MULT-QTY-DIFF = '*'              42660099
426700                  CONTINUE                                        42670099
426800              ELSE                                                42680099
426900                  WRITE REPORT-RECORD FROM DETAIL-LINE-1          42690099
427000                        AFTER ADVANCING PV-LINE-ADVANCE-COUNT     42700099
427100                  ADD PV-LINE-ADVANCE-COUNT TO PV-NUMBER-LINES    42710099
427200                  MOVE 1 TO PV-LINE-ADVANCE-COUNT                 42720099
427300                  SET PS-DIDNT-EXCEED-LIMIT TO TRUE               42730099
427400              END-IF                                              42740099
427500                                                                  42750099
427600     END-EVALUATE.                                                42760099
427700                                                                  42770099
427800     INITIALIZE DETAIL-LINE-1                                     42780099
427900                PV-RMS-VALUE                                      42790099
428000                PV-LEGACY-VALUE.                                  42800099
428100     SET PS-NO-NEW-PAGE TO TRUE.                                  42810099
428200                                                                  42820099
428300 8000-EXIT. EXIT.                                                 42830099
428400                                                                  42840099
428500 8100-DETERMINE-TEMPLATE.                                         42850099
428600                                                                  42860099
428700     EVALUATE TRUE                                                42870099
428800         WHEN XL023-XXT-PO                                        42880099
428900              MOVE 0 TO PV-SKU-NBR-PIC9                           42890099
429000              IF XL023-ON-BOTH-RMS-LEGACY                         42900099
429100                 STRING '15-'                                     42910099
429200                         PV-FIELD-NAME                            42920099
429300                         DELIMITED BY SIZE                        42930099
429400                         INTO DTL1-TEMP-FIELD-NBR                 42940099
429500              ELSE                                                42950099
429600                 MOVE '15-PO              '  TO                   42960099
429700                                  DTL1-TEMP-FIELD-NBR             42970099
429800              END-IF                                              42980099
429900                                                                  42990099
430000         WHEN XL023-XXT-PO-INSTR                                  43000099
430100              MOVE 0 TO PV-SKU-NBR-PIC9                           43010099
430200              IF XL023-ON-BOTH-RMS-LEGACY                         43020099
430300                 STRING '16-'                                     43030099
430400                         PV-FIELD-NAME                            43040099
430500                         DELIMITED BY SIZE                        43050099
430600                         INTO DTL1-TEMP-FIELD-NBR                 43060099
430700              ELSE                                                43070099
430800                 MOVE '16-PO_INSTR        '  TO                   43080099
430900                                  DTL1-TEMP-FIELD-NBR             43090099
431000              END-IF                                              43100099
431100                                                                  43110099
431200         WHEN XL023-XXT-PO-DISC                                   43120099
431300              MOVE 0 TO PV-SKU-NBR-PIC9                           43130099
431400              IF XL023-ON-BOTH-RMS-LEGACY                         43140099
431500                 STRING '17-'                                     43150099
431600                         PV-FIELD-NAME                            43160099
431700                         DELIMITED BY SIZE                        43170099
431800                         INTO DTL1-TEMP-FIELD-NBR                 43180099
431900              ELSE                                                43190099
432000              MOVE '17-PO_DISC         '  TO                      43200099
432100                                  DTL1-TEMP-FIELD-NBR             43210099
432200              END-IF                                              43220099
432300                                                                  43230099
432400         WHEN XL023-XXT-PO-SKU                                    43240099
432500              IF XL023-ON-RMS-ONLY                                43250099
432600                 MOVE XL023-SK-SKU-NBR-RMS TO PV-SKU-NBR-PIC9     43260099
432700              ELSE                                                43270099
432800                 MOVE XL023-SK-SKU-NBR-LGCY TO PV-SKU-NBR-PIC9    43280099
432900              END-IF                                              43290099
433000              IF XL023-ON-BOTH-RMS-LEGACY                         43300099
433100                 STRING '18-'                                     43310099
433200                         PV-FIELD-NAME                            43320099
433300                         DELIMITED BY SIZE                        43330099
433400                         INTO DTL1-TEMP-FIELD-NBR                 43340099
433500              ELSE                                                43350099
433600                 MOVE '18-PO_SKU          '  TO                   43360099
433700                                  DTL1-TEMP-FIELD-NBR             43370099
433800              END-IF                                              43380099
433900                                                                  43390099
434000         WHEN XL023-XXT-PO-PK-SKU                                 43400099
434100              IF XL023-ON-RMS-ONLY                                43410099
434200                 MOVE XL023-PB-PK-SKU-NBR-RMS TO PV-SKU-NBR-PIC9  43420099
434300                 MOVE XL023-PB-SKU-NBR-RMS TO                     43430099
434400                                      DTL1-COMPONENT-NBR          43440099
434500              ELSE                                                43450099
434600                 MOVE XL023-PB-PK-SKU-NBR-LGCY TO PV-SKU-NBR-PIC9 43460099
434700                 MOVE XL023-PB-SKU-NBR-LGCY TO                    43470099
434800                                      DTL1-COMPONENT-NBR          43480099
434900              END-IF                                              43490099
435000              IF XL023-ON-BOTH-RMS-LEGACY                         43500099
435100                 MOVE XL023-PB-PK-SKU-NBR-RMS TO PV-SKU-NBR-PIC9  43510099
435200                 MOVE XL023-PB-SKU-NBR-RMS TO                     43520099
435300                                      DTL1-COMPONENT-NBR          43530099
435400                 STRING '21-'                                     43540099
435500                         PV-FIELD-NAME                            43550099
435600                         DELIMITED BY SIZE                        43560099
435700                         INTO DTL1-TEMP-FIELD-NBR                 43570099
435800              ELSE                                                43580099
435900                 MOVE '21-PO_PK_SKU       '  TO                   43590099
436000                                  DTL1-TEMP-FIELD-NBR             43600099
436100              END-IF                                              43610099
436200                                                                  43620099
436300         WHEN XL023-XXT-PO-PK-SKU-LOC                             43630099
436400              IF XL023-ON-RMS-ONLY                                43640099
436500                 MOVE XL023-PL-SKU-NBR-RMS TO PV-SKU-NBR-PIC9     43650099
436600                 MOVE XL023-PL-PK-SKU-NBR-RMS TO                  43660099
436700                                      DTL1-COMPONENT-NBR          43670099
436800              ELSE                                                43680099
436900                 MOVE XL023-PL-SKU-NBR-LGCY TO PV-SKU-NBR-PIC9    43690099
437000                 MOVE XL023-PL-PK-SKU-NBR-LGCY TO                 43700099
437100                                      DTL1-COMPONENT-NBR          43710099
437200              END-IF                                              43720099
437300              IF XL023-ON-BOTH-RMS-LEGACY                         43730099
437400                 MOVE XL023-PL-PK-SKU-NBR-RMS TO                  43740099
437500                                      DTL1-COMPONENT-NBR          43750099
437600                 STRING '22-'                                     43760099
437700                         PV-FIELD-NAME                            43770099
437800                         DELIMITED BY SIZE                        43780099
437900                         INTO DTL1-TEMP-FIELD-NBR                 43790099
438000              ELSE                                                43800099
438100                 MOVE '22-PO_PK_SKU_LOC   '  TO                   43810099
438200                                  DTL1-TEMP-FIELD-NBR             43820099
438300              END-IF                                              43830099
438400                                                                  43840099
438500         WHEN XL023-XXT-PO-INBD-ALLOC                             43850099
438600              IF XL023-ON-RMS-ONLY                                43860099
438700                 MOVE XL023-LO-SKU-NBR-RMS TO PV-SKU-NBR-PIC9     43870099
438800                 MOVE XL023-LO-LOC-NBR-RMS TO DTL1-LOC-NBR        43880099
438900              ELSE                                                43890099
439000                 MOVE XL023-LO-SKU-NBR-LGCY TO PV-SKU-NBR-PIC9    43900099
439100                 MOVE XL023-LO-LOC-NBR-LGCY TO DTL1-LOC-NBR       43910099
439200              END-IF                                              43920099
439300              IF XL023-ON-BOTH-RMS-LEGACY                         43930099
439400                 MOVE XL023-LO-LOC-NBR-RMS TO DTL1-LOC-NBR        43940099
439500                 STRING '19-'                                     43950099
439600                         PV-FIELD-NAME                            43960099
439700                         DELIMITED BY SIZE                        43970099
439800                         INTO DTL1-TEMP-FIELD-NBR                 43980099
439900              ELSE                                                43990099
440000                 MOVE '19-PO_INBD_ALLOC   '  TO                   44000099
440100                                  DTL1-TEMP-FIELD-NBR             44010099
440200              END-IF                                              44020099
440300                                                                  44030099
440400         WHEN XL023-XXT-PO-OTBND-ALLOC                            44040099
440500              IF XL023-ON-RMS-ONLY                                44050099
440600                 MOVE XL023-SB-SKU-NBR-RMS TO PV-SKU-NBR-PIC9     44060099
440700                 MOVE XL023-SB-LOC-NBR-RMS TO DTL1-LOC-NBR        44070099
440800                 MOVE XL023-SB-STR-NBR-RMS TO DTL1-STR-NBR        44080099
440900              ELSE                                                44090099
441000                 MOVE XL023-SB-SKU-NBR-LGCY TO PV-SKU-NBR-PIC9    44100099
441100                 MOVE XL023-SB-LOC-NBR-LGCY TO DTL1-LOC-NBR       44110099
441200                 MOVE XL023-SB-STR-NBR-LGCY TO DTL1-STR-NBR       44120099
441300              END-IF                                              44130099
441400              IF XL023-ON-BOTH-RMS-LEGACY                         44140099
441500                 MOVE XL023-SB-LOC-NBR-RMS TO DTL1-LOC-NBR        44150099
441600                 MOVE XL023-SB-STR-NBR-RMS TO DTL1-STR-NBR        44160099
441700                 STRING '20-'                                     44170099
441800                         PV-FIELD-NAME                            44180099
441900                         DELIMITED BY SIZE                        44190099
442000                         INTO DTL1-TEMP-FIELD-NBR                 44200099
442100              ELSE                                                44210099
442200                 MOVE '20-PO_OTBND_ALLOC  '  TO                   44220099
442300                                  DTL1-TEMP-FIELD-NBR             44230099
442400              END-IF                                              44240099
442500                                                                  44250099
442600         WHEN OTHER                                               44260099
442700              MOVE '??-INVALID         '  TO                      44270099
442800                                  DTL1-TEMP-FIELD-NBR             44280099
442900              DISPLAY ASTERISK-LINE                               44290099
443000              DISPLAY '     8000-WRITE-DETAIL - '                 44300099
443100                      'INVALID RECORD'                            44310099
443200              DISPLAY ASTERISK-LINE                               44320099
443300                                                                  44330099
443400     END-EVALUATE.                                                44340099
443500                                                                  44350099
443600     IF PS-NEW-PAGE                                               44360099
443700         MOVE PV-SKU-NBR TO DTL1-SKU-NBR                          44370099
443800     ELSE                                                         44380099
443900         IF PV-SKU-NBR = PV-PREVIOUS-SKU                          44390099
444000           AND PS-NOT-NEW-PO                                      44400099
444100             MOVE SPACES TO DTL1-SKU-NBR                          44410099
444200         ELSE                                                     44420099
444300             MOVE PV-SKU-NBR TO PV-PREVIOUS-SKU                   44430099
444400                                DTL1-SKU-NBR                      44440099
444500*JPL (MOVE SAVE FIELDS TO DETAIL PRINT LINE)                      44450099
444600             IF CURRENT-PO-NO = PREVIOUS-PO-NO                    44460099
444700               AND PS-PRT-PO-YES                                  44470099
444800                 MOVE SAVE-PO-NBR      TO DTL1-PO-NBR             44480099
444900                 MOVE SAVE-PKG-CD      TO DTL1-PKG-CD             44490099
445000                 MOVE SAVE-EDI-XMIT    TO DTL1-EDI-XMIT           44500099
445100                 MOVE SAVE-EDI-IND     TO DTL1-EDI-IND            44510099
445200                 MOVE SAVE-STATUS-CODE TO DTL1-STATUS-CODE        44520099
445300                 SET PS-PRT-PO-NO      TO TRUE                    44530099
445400             END-IF                                               44540099
445500         END-IF                                                   44550099
445600     END-IF.                                                      44560099
445700                                                                  44570099
445800     SET PS-NOT-NEW-PO TO TRUE.                                   44580099
445900                                                                  44590099
446000 8100-EXIT. EXIT.                                                 44600099
446100                                                                  44610099
446200 8400-PRINT-HEADINGS.                                             44620099
446300                                                                  44630099
446400     ADD  1  TO PV-PAGE-NUMBER.                                   44640099
446500     MOVE PV-PAGE-NUMBER TO DP133-PAGE-NUMBER.                    44650099
446600                                                                  44660099
446700     WRITE REPORT-RECORD FROM DP133-STANDRD-HEADER-133-COLS       44670099
446800           AFTER ADVANCING PAGE.                                  44680099
446900     WRITE REPORT-RECORD FROM REPORT-HEADING-2                    44690099
447000           AFTER ADVANCING 1 LINE.                                44700099
447010** CHG0107941 START                                               44701099
447031     WRITE REPORT-RECORD FROM REPORT-HEADING-8                    44703199
447032           AFTER ADVANCING 1 LINE.                                44703299
447100     WRITE REPORT-RECORD FROM REPORT-HEADING-4                    44710099
447200           AFTER ADVANCING 2 LINES.                               44720099
447300     WRITE REPORT-RECORD FROM REPORT-HEADING-5                    44730099
447400           AFTER ADVANCING 1 LINE.                                44740099
447410*** PRB0051493 START                                              44741099
447420*    WRITE REPORT-RECORD FROM REPORT-HEADING-8                    44742099
447430*          AFTER ADVANCING 1 LINE.                                44743099
447601*** PRB0051493 END                                                44760199
447602** CHG0107941 END                                                 44760299
447610     WRITE REPORT-RECORD FROM REPORT-HEADING-6                    44761099
447620           AFTER ADVANCING 1 LINE.                                44762099
447700     WRITE REPORT-RECORD FROM REPORT-HEADING-7                    44770099
447800           AFTER ADVANCING 1 LINE.                                44780099
447900     MOVE 2 TO PV-LINE-ADVANCE-COUNT.                             44790099
448000     SET PS-NEW-PAGE TO TRUE.                                     44800099
448100     MOVE 7 TO PV-NUMBER-LINES.                                   44810099
448200                                                                  44820099
448300 8400-EXIT. EXIT.                                                 44830099
448400                                                                  44840099
448410*** PRB0051493 START                                              44841099
448420 9000-CHECK-RMSONLY-PO.                                           44842099
448430     SET CS-IDX                             TO 1                  44843099
448440     SEARCH WS-RMSONLY-TABLE                                      44844099
448450        VARYING CS-IDX                                            44845099
448460           AT END                                                 44846099
448480              MOVE SPACES                   TO DTL1-EDI-XMIT      44848099
448481                                               SAVE-EDI-XMIT      44848199
448490           WHEN RMSONLY-PO-NBR(CS-IDX) = CURRENT-PO-NO            44849099
448491              MOVE RMSONLY-UPD-TMST(CS-IDX) TO DTL1-EDI-XMIT      44849199
448492                                               SAVE-EDI-XMIT      44849299
448493              DISPLAY 'DTL1-EDI-XMIT ' DTL1-EDI-XMIT              44849399
448494              DISPLAY 'SAVE-EDI-XMIT ' SAVE-EDI-XMIT              44849499
448495     END-SEARCH.                                                  44849599
448496                                                                  44849699
448497*** PRB0051493 END                                                44849799
448498                                                                  44849899
448500 9200-READ-COMPARE-INPUT.                                         44850099
448600                                                                  44860099
448700     READ FD-COMPARE-FILE-IN  INTO  XL023-COMPARE-RECORD          44870099
448800          AT END                                                  44880099
448900             MOVE  WS-YES  TO  END-OF-COMPARE-RECORDS             44890099
449000             GO TO 9200-EXIT.                                     44900099
449100                                                                  44910099
449200     MOVE XL023-PO-SORT-KEY-PO TO CURRENT-PO-NO.                  44920099
449300     ADD  1  TO  NUMBER-OF-COMPARE-RECORDS.                       44930099
449400***  SET PS-PRT-PO-YES TO TRUE.                                   44940099
449500                                                                  44950099
449600 9200-EXIT. EXIT.                                                 44960099
449700                                                                  44970099
449710*** PRB0051493 START                                              44971099
449720 9300-READ-START-TIMESTAMP.                                       44972099
449730     READ FD-STRTTMST-FILE-IN INTO XL014-CONTROL-RECORD.          44973099
449800                                                                  44980099
449810 9400-READ-END-TIMESTAMP.                                         44981099
449820     READ FD-ENDTMST-FILE-IN  INTO XL014-CONTROL-RECORD.          44982099
449830                                                                  44983099
449840 9500-READ-RMSONLY-FILE.                                          44984099
449841     PERFORM VARYING CS-IDX FROM 1 BY 1                           44984199
449842       UNTIL PS-END-OF-RMSONLY-FILE                               44984299
449843          OR CS-IDX > PC-MAX-IDX                                  44984399
449844                                                                  44984499
449850          READ FD-RMSONLY-FILE-IN  INTO XL063-DCLTPURCHS          44985099
449851          AT END                                                  44985199
449852              SET PS-END-OF-RMSONLY-FILE TO TRUE                  44985299
449853          NOT AT END                                              44985399
449854              MOVE XL063-PO-NBR        TO RMSONLY-PO-NBR(CS-IDX)  44985499
449855              MOVE XL063-RMS-PO-UPD-TMST                          44985599
449856                                       TO RMSONLY-UPD-TMST(CS-IDX)44985699
449859          END-READ                                                44985999
449860     END-PERFORM.                                                 44986099
449861                                                                  44986199
449862     IF CS-IDX > PC-MAX-IDX                                       44986299
449863        MOVE +4004 TO ABEND-CODE                                  44986399
449864        DISPLAY '**  ABEND     **'                                44986499
449865        DISPLAY '**  PROGRAM   **  =  XLKRP001'                   44986599
449866        DISPLAY '**  PARAGRAPH **  =  9500-READ-RMSONLY-FILE'     44986699
449867        DISPLAY '**  WS-RMSONLY-TABLE TABLE OVERFLOW  **'         44986799
449868        CALL 'ILBOABN0' USING ABEND-CODE                          44986899
449869     END-IF.                                                      44986999
449870                                                                  44987099
449871*** PRB0051493 END                                                44987199
449880                                                                  44988099
449900 9600-WRITE-REPORT-RECORD.                                        44990099
450000                                                                  45000099
450100                                                                  45010099
450200**?? WRITE REPORT-RECORD FROM WS-REPORT-RECORD.                   45020099
450300**   MOVE SPACES TO WS-REPORT-RECORD.                             45030099
450400                                                                  45040099
450500 9600-EXIT. EXIT.                                                 45050099
450600                                                                  45060099
450700                                                                  45070099
450800 9900-TERMINATION.                                                45080099
450900                                                                  45090099
451000     IF NUMBER-OF-COMPARE-RECORDS = 0                             45100099
451100        DISPLAY ' '                                               45110099
451200        DISPLAY '***************************'                     45120099
451300        DISPLAY '*    NO ERRORS FOUND      *'                     45130099
451400        DISPLAY '***************************'                     45140099
451500        DISPLAY ' '                                               45150099
451600        GO TO 9900-EXIT.                                          45160099
451700                                                                  45170099
451800     MOVE 4055 TO RETURN-CODE.                                    45180099
451900                                                                  45190099
452000     DISPLAY ' '.                                                 45200099
452100     DISPLAY ASTERISK-LINE.                                       45210099
452200     DISPLAY 'PO NUMBER - '                                       45220099
452300              PREVIOUS-PO-NO.                                     45230099
452400     DISPLAY ASTERISK-LINE.                                       45240099
452500                                                                  45250099
452600     MOVE SPACES         TO WS-REPORT-RECORD.                     45260099
452700     PERFORM 9600-WRITE-REPORT-RECORD THRU                        45270099
452800             9600-EXIT.                                           45280099
452900     MOVE ASTERISK-LINE  TO WS-REPORT-RECORD.                     45290099
453000     PERFORM 9600-WRITE-REPORT-RECORD THRU                        45300099
453100             9600-EXIT.                                           45310099
453200                                                                  45320099
453300     STRING '  PO NUMBER - '                                      45330099
453400             PREVIOUS-PO-NO                                       45340099
453500             DELIMITED BY SIZE                                    45350099
453600             INTO WS-REPORT-RECORD.                               45360099
453700     PERFORM 9600-WRITE-REPORT-RECORD THRU                        45370099
453800             9600-EXIT.                                           45380099
453900                                                                  45390099
454000     MOVE ASTERISK-LINE  TO WS-REPORT-RECORD.                     45400099
454100     PERFORM 9600-WRITE-REPORT-RECORD THRU                        45410099
454200             9600-EXIT.                                           45420099
454300                                                                  45430099
454400     PERFORM 4000-DISPLAY-COUNTS THRU                             45440099
454500             4000-EXIT.                                           45450099
454600                                                                  45460099
454700     DISPLAY '***************************'.                       45470099
454800     DISPLAY '*    FINAL TOTALS         *'.                       45480099
454900     DISPLAY '***************************'.                       45490099
455000     DISPLAY ' '.                                                 45500099
455100     DISPLAY 'TTL-PO ---------------->'                           45510099
455200             ' - XLRD015 - 1 - '                                  45520099
455300             WS-BLANK-03                                          45530099
455400              TTL-PO-HDR-DATA              ' - DATA'              45540099
455500             WS-BLANK-03                                          45550099
455600              TTL-PO-HDR-RMS               ' - RMS'               45560099
455700             WS-BLANK-03                                          45570099
455800              TTL-PO-HDR-LGCY              ' - LGCY'              45580099
455900             WS-BLANK-03                                          45590099
456000              TTL-XXT-PO                   ' - TOTL'.             45600099
456100                                                                  45610099
456200     DISPLAY ' '.                                                 45620099
456300     DISPLAY 'TTL-PO-INSTR ---------->'                           45630099
456400             ' - XLRD016 - 2 - '                                  45640099
456500             WS-BLANK-03                                          45650099
456600              TTL-PO-INSTR-DATA            ' - DATA'              45660099
456700             WS-BLANK-03                                          45670099
456800              TTL-PO-INSTR-RMS             ' - RMS'               45680099
456900             WS-BLANK-03                                          45690099
457000              TTL-PO-INSTR-LGCY            ' - LGCY'              45700099
457100             WS-BLANK-03                                          45710099
457200              TTL-XXT-PO-INSTR             ' - TOTL'.             45720099
457300                                                                  45730099
457400     DISPLAY ' '.                                                 45740099
457500     DISPLAY WS-BLANK-30                                          45750099
457600             'TTL-IN-PO-NBR-DIFF          '                       45760099
457700              TTL-IN-PO-NBR-DIFF.                                 45770099
457800     DISPLAY WS-BLANK-30                                          45780099
457900             'TTL-IN-RECIP-CDE-DIFF       '                       45790099
458000              TTL-IN-RECIP-CDE-DIFF.                              45800099
458100     DISPLAY WS-BLANK-30                                          45810099
458200             'TTL-IN-INSTR-DESC-DIFF      '                       45820099
458300              TTL-IN-INSTR-DESC-DIFF.                             45830099
458400                                                                  45840099
458500     DISPLAY ' '.                                                 45850099
458600     DISPLAY 'TTL-PO-DISC ----------->'                           45860099
458700             ' - XLRD017 - 3 - '                                  45870099
458800             WS-BLANK-03                                          45880099
458900              TTL-PO-DISC-DATA             ' - DATA'              45890099
459000             WS-BLANK-03                                          45900099
459100              TTL-PO-DISC-RMS              ' - RMS'               45910099
459200             WS-BLANK-03                                          45920099
459300              TTL-PO-DISC-LGCY             ' - LGCY'              45930099
459400             WS-BLANK-03                                          45940099
459500              TTL-XXT-PO-DISC              ' - TOTL'.             45950099
459600                                                                  45960099
459700     DISPLAY ' '.                                                 45970099
459800     DISPLAY WS-BLANK-30                                          45980099
459900             'TTL-DI-PO-NBR-DIFF          '                       45990099
460000              TTL-DI-PO-NBR-DIFF.                                 46000099
460100     DISPLAY WS-BLANK-30                                          46010099
460200             'TTL-DI-DL-ID-DIFF           '                       46020099
460300              TTL-DI-DL-ID-DIFF.                                  46030099
460400     DISPLAY WS-BLANK-30                                          46040099
460500             'TTL-DI-DL-DTL-ID-DIFF       '                       46050099
460600              TTL-DI-DL-DTL-ID-DIFF.                              46060099
460700     DISPLAY WS-BLANK-30                                          46070099
460800             'TTL-DI-DISC-TYPE-CDE-DIFF   '                       46080099
460900              TTL-DI-DISC-TYPE-CDE-DIFF.                          46090099
461000     DISPLAY WS-BLANK-30                                          46100099
461100             'TTL-DI-EXTD-DAYS-QTY-DIFF   '                       46110099
461200              TTL-DI-EXTD-DAYS-QTY-DIFF.                          46120099
461300     DISPLAY WS-BLANK-30                                          46130099
461400             'TTL-DI-DISC-PCT-DIFF        '                       46140099
461500              TTL-DI-DISC-PCT-DIFF.                               46150099
461600     DISPLAY WS-BLANK-30                                          46160099
461700             'TTL-DI-TOT-DISC-AMT-DIFF    '                       46170099
461800              TTL-DI-TOT-DISC-AMT-DIFF.                           46180099
461900                                                                  46190099
462000     DISPLAY ' '.                                                 46200099
462100     DISPLAY 'TTL-PO-SKU ------------>'                           46210099
462200             ' - XLRD018 - 4 - '                                  46220099
462300             WS-BLANK-03                                          46230099
462400              TTL-PO-SKU-DATA              ' - DATA'              46240099
462500             WS-BLANK-03                                          46250099
462600              TTL-PO-SKU-RMS               ' - RMS'               46260099
462700             WS-BLANK-03                                          46270099
462800              TTL-PO-SKU-LGCY              ' - LGCY'              46280099
462900             WS-BLANK-03                                          46290099
463000              TTL-XXT-PO-SKU               ' - TOTL'.             46300099
463100     DISPLAY ' '.                                                 46310099
463200     DISPLAY WS-BLANK-30                                          46320099
463300          'TTL-SK-PO-NBR-DIFF           '                         46330099
463400           TTL-SK-PO-NBR-DIFF.                                    46340099
463500     DISPLAY WS-BLANK-30                                          46350099
463600          'TTL-SK-SKU-NBR-DIFF          '                         46360099
463700           TTL-SK-SKU-NBR-DIFF.                                   46370099
463800     DISPLAY WS-BLANK-30                                          46380099
463900          'TTL-SK-UNT-COST-AMT-DIFF     '                         46390099
464000           TTL-SK-UNT-COST-AMT-DIFF.                              46400099
464100     DISPLAY WS-BLANK-30                                          46410099
464200          'TTL-SK-FRST-COST-AMT-DIFF    '                         46420099
464300           TTL-SK-FRST-COST-AMT-DIFF.                             46430099
464400     DISPLAY WS-BLANK-30                                          46440099
464500          'TTL-SK-VND-QTY-DIFF          '                         46450099
464600           TTL-SK-VND-QTY-DIFF.                                   46460099
464601*GB 3/20/12                                                       46460199
464610     DISPLAY WS-BLANK-30                                          46461099
464620          'TTL-SK-INPK-QTY-DIFF          '                        46462099
464630           TTL-SK-INPK-QTY-DIFF.                                  46463099
464631     DISPLAY WS-BLANK-30                                          46463199
464632          'TTL-SK-OTPK-QTY-DIFF          '                        46463299
464633           TTL-SK-OTPK-QTY-DIFF.                                  46463399
464640*GB 3/20/12                                                       46464099
464700     DISPLAY WS-BLANK-30                                          46470099
464800          'TTL-SK-PROMO-STRT-DTE-DIFF   '                         46480099
464900           TTL-SK-PROMO-STRT-DTE-DIFF.                            46490099
465000     DISPLAY WS-BLANK-30                                          46500099
465100          'TTL-SK-PIC-SKU-IND-DIFF       '                        46510099
465200           TTL-SK-PIC-SKU-IND-DIFF.                               46520099
465300     DISPLAY WS-BLANK-30                                          46530099
465400          'TTL-SK-ORIG-ORD-QTY-DIFF      '                        46540099
465500           TTL-SK-ORIG-ORD-QTY-DIFF.                              46550099
465600     DISPLAY WS-BLANK-30                                          46560099
465700          'TTL-SK-ORD-QTY-DIFF           '                        46570099
465800           TTL-SK-ORD-QTY-DIFF.                                   46580099
465900     DISPLAY WS-BLANK-30                                          46590099
466000          'TTL-SK-CNCLD-QTY-DIFF         '                        46600099
466100           TTL-SK-CNCLD-QTY-DIFF.                                 46610099
466200     DISPLAY WS-BLANK-30                                          46620099
466300          'TTL-SK-PK-SKU-IND-DIFF        '                        46630099
466400           TTL-SK-PK-SKU-IND-DIFF.                                46640099
466500     DISPLAY WS-BLANK-30                                          46650099
466600          'TTL-SK-PK-SKU-DESC-DIFF       '                        46660099
466700           TTL-SK-PK-SKU-DESC-DIFF.                               46670099
466800     DISPLAY WS-BLANK-30                                          46680099
466900          'TTL-SK-DC-ORD-MULT-QTY-DIFF   '                        46690099
467000           TTL-SK-DC-ORD-MULT-QTY-DIFF.                           46700099
467100     DISPLAY WS-BLANK-30                                          46710099
467200          'TTL-SK-UNT-RTL-AMT-DIFF      '                         46720099
467300           TTL-SK-UNT-RTL-AMT-DIFF.                               46730099
467400     DISPLAY WS-BLANK-30                                          46740099
467500          'TTL-SK-GP-RTL-AMT-DIFF       '                         46750099
467600           TTL-SK-GP-RTL-AMT-DIFF.                                46760099
467700     DISPLAY WS-BLANK-30                                          46770099
467800          'TTL-SK-GP-RTL-QTY-DIFF       '                         46780099
467900           TTL-SK-GP-RTL-QTY-DIFF.                                46790099
468000                                                                  46800099
468100     DISPLAY ' '.                                                 46810099
468200     DISPLAY 'TTL-PO-PK-SKU --------->'                           46820099
468300             ' - XLRD021 - 5 - '                                  46830099
468400             WS-BLANK-03                                          46840099
468500              TTL-PO-PK-SKU-DATA           ' - DATA'              46850099
468600             WS-BLANK-03                                          46860099
468700              TTL-PO-PK-SKU-RMS            ' - RMS'               46870099
468800             WS-BLANK-03                                          46880099
468900              TTL-PO-PK-SKU-LGCY           ' - LGCY'              46890099
469000             WS-BLANK-03                                          46900099
469100              TTL-XXT-PO-PK-SKU            ' - TOTL'.             46910099
469200                                                                  46920099
469300     DISPLAY WS-BLANK-30                                          46930099
469400          'TTL-PB-PO-NBR-DIFF           '                         46940099
469500           TTL-PB-PO-NBR-DIFF.                                    46950099
469600     DISPLAY WS-BLANK-30                                          46960099
469700          'TTL-PB-PK-SKU-NBR-DIFF       '                         46970099
469800           TTL-PB-PK-SKU-NBR-DIFF.                                46980099
469900     DISPLAY WS-BLANK-30                                          46990099
470000          'TTL-PB-SKU-NBR-DIFF          '                         47000099
470100           TTL-PB-SKU-NBR-DIFF.                                   47010099
470200     DISPLAY WS-BLANK-30                                          47020099
470300          'TTL-PB-UNT-COST-AMT-DIFF     '                         47030099
470400           TTL-PB-UNT-COST-AMT-DIFF.                              47040099
470500     DISPLAY WS-BLANK-30                                          47050099
470600          'TTL-PB-FRST-COST-AMT-DIFF    '                         47060099
470700           TTL-PB-FRST-COST-AMT-DIFF.                             47070099
470800     DISPLAY WS-BLANK-30                                          47080099
470900          'TTL-PB-UNT-RTL-AMT-DIFF      '                         47090099
471000           TTL-PB-UNT-RTL-AMT-DIFF.                               47100099
471100     DISPLAY WS-BLANK-30                                          47110099
471200          'TTL-PB-GP-RTL-AMT-DIFF       '                         47120099
471300           TTL-PB-GP-RTL-AMT-DIFF.                                47130099
471400     DISPLAY WS-BLANK-30                                          47140099
471500          'TTL-PB-GP-RTL-QTY-DIFF       '                         47150099
471600           TTL-PB-GP-RTL-QTY-DIFF.                                47160099
471700     DISPLAY WS-BLANK-30                                          47170099
471800          'TTL-PB-RATO-UNT-QTY-DIFF     '                         47180099
471900           TTL-PB-RATO-UNT-QTY-DIFF.                              47190099
471910     DISPLAY WS-BLANK-30                                          47191099
471920          'TTL-PB-INPK-UNT-QTY-DIFF     '                         47192099
471930           TTL-PB-INPK-UNT-QTY-DIFF.                              47193099
471940     DISPLAY WS-BLANK-30                                          47194099
471950          'TTL-PB-OTPK-UNT-QTY-DIFF     '                         47195099
471960           TTL-PB-OTPK-UNT-QTY-DIFF.                              47196099
472000                                                                  47200099
472100     DISPLAY ' '.                                                 47210099
472200     DISPLAY 'TTL-PO-PK-SKU-LOC ----->'                           47220099
472300             ' - XLRD022 - 6 - '                                  47230099
472400             WS-BLANK-03                                          47240099
472500              TTL-PO-PK-SKU-LOC-DATA       ' - DATA'              47250099
472600             WS-BLANK-03                                          47260099
472700              TTL-PO-PK-SKU-LOC-RMS        ' - RMS'               47270099
472800             WS-BLANK-03                                          47280099
472900              TTL-PO-PK-SKU-LOC-LGCY       ' - LGCY'              47290099
473000             WS-BLANK-03                                          47300099
473100              TTL-XXT-PO-PK-SKU-LOC        ' - TOTL'.             47310099
473200                                                                  47320099
473300     DISPLAY WS-BLANK-30                                          47330099
473400          'TTL-PL-PO-NBR-DIFF           '                         47340099
473500           TTL-PL-PO-NBR-DIFF.                                    47350099
473600     DISPLAY WS-BLANK-30                                          47360099
473700          'TTL-PL-SKU-NBR-DIFF          '                         47370099
473800           TTL-PL-SKU-NBR-DIFF.                                   47380099
473900     DISPLAY WS-BLANK-30                                          47390099
474000          'TTL-PL-PK-SKU-NBR-DIFF       '                         47400099
474100           TTL-PL-PK-SKU-NBR-DIFF.                                47410099
474200     DISPLAY WS-BLANK-30                                          47420099
474300          'TTL-PL-LOC-NBR-DIFF          '                         47430099
474400           TTL-PL-LOC-NBR-DIFF.                                   47440099
474500                                                                  47450099
474600     DISPLAY ' '.                                                 47460099
474700     DISPLAY 'TTL-PO-INBD-ALLOC ----->'                           47470099
474800             ' - XLRD019 - 7 - '                                  47480099
474900             WS-BLANK-03                                          47490099
475000              TTL-PO-INBD-ALLOC-DATA       ' - DATA'              47500099
475100             WS-BLANK-03                                          47510099
475200              TTL-PO-INBD-ALLOC-RMS        ' - RMS'               47520099
475300             WS-BLANK-03                                          47530099
475400              TTL-PO-INBD-ALLOC-LGCY       ' - LGCY'              47540099
475500             WS-BLANK-03                                          47550099
475600              TTL-XXT-PO-INBD-ALLOC        ' - TOTL'.             47560099
475700                                                                  47570099
475800     DISPLAY WS-BLANK-30                                          47580099
475900          'TTL-LO-PO-NBR-DIFF           '                         47590099
476000           TTL-LO-PO-NBR-DIFF.                                    47600099
476100     DISPLAY WS-BLANK-30                                          47610099
476200          'TTL-LO-SKU-NBR-DIFF          '                         47620099
476300           TTL-LO-SKU-NBR-DIFF.                                   47630099
476400     DISPLAY WS-BLANK-30                                          47640099
476500          'TTL-LO-LOC-NBR-DIFF          '                         47650099
476600           TTL-LO-LOC-NBR-DIFF.                                   47660099
476700     DISPLAY WS-BLANK-30                                          47670099
476800          'TTL-LO-LOC-TYP-CDE-DIFF      '                         47680099
476900           TTL-LO-LOC-TYP-CDE-DIFF.                               47690099
477000     DISPLAY WS-BLANK-30                                          47700099
477100          'TTL-LO-ORD-QTY-DIFF          '                         47710099
477200           TTL-LO-ORD-QTY-DIFF.                                   47720099
477300     DISPLAY WS-BLANK-30                                          47730099
477400          'TTL-LO-ORIG-ORD-QTY-DIFF     '                         47740099
477500           TTL-LO-ORIG-ORD-QTY-DIFF.                              47750099
477600     DISPLAY WS-BLANK-30                                          47760099
477700          'TTL-LO-CNCLD-QTY-DIFF        '                         47770099
477800           TTL-LO-CNCLD-QTY-DIFF.                                 47780099
477900     DISPLAY WS-BLANK-30                                          47790099
478000          'TTL-LO-CNCL-CDE-DIFF         '                         47800099
478100           TTL-LO-CNCL-CDE-DIFF.                                  47810099
478200     DISPLAY WS-BLANK-30                                          47820099
478300          'TTL-LO-CNCL-DTE-DIFF         '                         47830099
478400           TTL-LO-CNCL-DTE-DIFF.                                  47840099
478500     DISPLAY WS-BLANK-30                                          47850099
478600          'TTL-LO-CNCLD-BY-USR-ID-DIFF  '                         47860099
478700           TTL-LO-CNCLD-BY-USR-ID-DIFF.                           47870099
478800     DISPLAY WS-BLANK-30                                          47880099
478900          'TTL-LO-DC-ALLC-MULT-QTY-DIFF '                         47890099
479000           TTL-LO-DC-ALLC-MULT-QTY-DIFF.                          47900099
479100     DISPLAY WS-BLANK-30                                          47910099
479200          'TTL-LO-STR-ALLC-MLT-QTY-DIFF '                         47920099
479300           TTL-LO-STR-ALLC-MLT-QTY-DIFF.                          47930099
479400     DISPLAY WS-BLANK-30                                          47940099
479500          'TTL-LO-ALLOC-RND-CDE-DIFF    '                         47950099
479600           TTL-LO-ALLOC-RND-CDE-DIFF.                             47960099
479700     DISPLAY WS-BLANK-30                                          47970099
479800          'TTL-LO-SHTG-PRT-OPT-CDE-DIFF '                         47980099
479900           TTL-LO-SHTG-PRT-OPT-CDE-DIFF.                          47990099
480000     DISPLAY WS-BLANK-30                                          48000099
480100          'TTL-LO-OVRG-PRT-OPT-CDE-DIFF '                         48010099
480200           TTL-LO-OVRG-PRT-OPT-CDE-DIFF.                          48020099
480300     DISPLAY WS-BLANK-30                                          48030099
480400          'TTL-LO-EXT-SHTG-THR-IND-DIFF '                         48040099
480500           TTL-LO-EXT-SHTG-THR-IND-DIFF.                          48050099
480600                                                                  48060099
480700     DISPLAY ' '.                                                 48070099
480800     DISPLAY 'TTL-PO-OUTBND-ALLOC --->'                           48080099
480900             ' - XLRD020 - 8 - '                                  48090099
481000             WS-BLANK-03                                          48100099
481100              TTL-PO-OUTBND-ALLOC-DATA     ' - DATA'              48110099
481200             WS-BLANK-03                                          48120099
481300              TTL-PO-OUTBND-ALLOC-RMS      ' - RMS'               48130099
481400             WS-BLANK-03                                          48140099
481500              TTL-PO-OUTBND-ALLOC-LGCY     ' - LGCY'              48150099
481600             WS-BLANK-03                                          48160099
481700              TTL-XXT-PO-OUTBND-ALLOC      ' - TOTL'.             48170099
481800                                                                  48180099
481900     DISPLAY WS-BLANK-30                                          48190099
482000          'TTL-SB-PO-NBR-DIFF           '                         48200099
482100           TTL-SB-PO-NBR-DIFF.                                    48210099
482200     DISPLAY WS-BLANK-30                                          48220099
482300          'TTL-SB-SKU-NBR-DIFF          '                         48230099
482400           TTL-SB-SKU-NBR-DIFF.                                   48240099
482500     DISPLAY WS-BLANK-30                                          48250099
482600          'TTL-SB-LOC-NBR-DIFF          '                         48260099
482700           TTL-SB-LOC-NBR-DIFF.                                   48270099
482800     DISPLAY WS-BLANK-30                                          48280099
482900          'TTL-SB-STR-NBR-DIFF          '                         48290099
483000           TTL-SB-STR-NBR-DIFF.                                   48300099
483100     DISPLAY WS-BLANK-30                                          48310099
483200          'TTL-SB-RNK-SEQ-NBR-DIFF      '                         48320099
483300           TTL-SB-RNK-SEQ-NBR-DIFF.                               48330099
483400     DISPLAY WS-BLANK-30                                          48340099
483500          'TTL-SB-ALLOC-QTY-DIFF        '                         48350099
483600           TTL-SB-ALLOC-QTY-DIFF.                                 48360099
483700     DISPLAY WS-BLANK-30                                          48370099
483800          'TTL-SB-ALLOC-SEQ-CDE-DIFF    '                         48380099
483900           TTL-SB-ALLOC-SEQ-CDE-DIFF.                             48390099
484000     DISPLAY WS-BLANK-30                                          48400099
484100          'TTL-SB-STR-CNSTR-CDE-DIFF    '                         48410099
484200           TTL-SB-STR-CNSTR-CDE-DIFF.                             48420099
484300     DISPLAY WS-BLANK-30                                          48430099
484400          'TTL-SB-STR-CNSTR-QTY-DIFF    '                         48440099
484500           TTL-SB-STR-CNSTR-QTY-DIFF.                             48450099
484600                                                                  48460099
484700     DISPLAY ' '.                                                 48470099
484800     DISPLAY ' '.                                                 48480099
484900                                                                  48490099
485000     CLOSE                                                        48500099
485100            FD-COMPARE-FILE-IN                                    48510099
485200            FD-REPORT.                                            48520099
485300                                                                  48530099
485400 9900-EXIT. EXIT.                                                 48540099
485500                                                                  48550099
