000100***************************************************************** 00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300***************************************************************** 00030000
000400 PROGRAM-ID.    XLKUP027.                                         00040000
000500 AUTHOR.        AL PETERS.                                        00050000
000600 INSTALLATION.  KOHLS.                                            00060000
000700 DATE-WRITTEN   DEC 2003.                                         00070000
000800 DATE-COMPILED.                                                   00080000
000900***************************************************************** 00090000
001000*  THIS BATCH DB2 PROGRAM READS AN EXTRACT FILE CONTAINING    *   00100000
001100*  PACKSKU INFORMATION.  THIS DATA IS INSERTED INTO             * 00110000
001200*  THE XLT_PK_CPT_SKU                                           * 00120000
001400***************************************************************** 00130000
001500 ENVIRONMENT DIVISION.                                            00140000
001600 INPUT-OUTPUT SECTION.                                            00150000
001700                                                                  00160000
001800 FILE-CONTROL.                                                    00170000
001900                                                                  00180000
002000     SELECT PACKSKU-IN                                            00190000
002010         ASSIGN TO INP01.                                         00200000
002100                                                                  00210000
002200***************************************************************** 00220000
002300 DATA DIVISION.                                                   00230000
002400***************************************************************** 00240000
002500 FILE SECTION.                                                    00250000
002600                                                                  00260000
002700 FD  PACKSKU-IN                                                   00270000
002800     RECORDING MODE IS F                                          00280000
002810     BLOCK CONTAINS 0 RECORDS                                     00281000
002900     LABEL RECORDS ARE STANDARD.                                  00282000
003000                                                                  00283000
003300 01  PACKSKU-IN-RECORD           PIC X(22).                       00284000
003700                                                                  00285000
003800                                                                  00286000
003900***************************************************************** 00287000
004000 WORKING-STORAGE SECTION.                                         00288000
004100                                                                  00289000
       01  PA-DB2-COMMIT-COUNT              PIC S9(09) VALUE +0         00290000
                                                          COMP-3.       00300000
004200 01  PS-PROGRAM-SWITCHES.                                         00310000
004300     05  PS-EOF-INPUT-SW              PIC X(01)  VALUE 'N'.       00320000
004400         88  PS-EOF-INPUT-YES                    VALUE 'Y'.       00330000
004500         88  PS-EOF-INPUT-NO                     VALUE 'N'.       00340000
004600                                                                  00350000
004700 01  PC-PROGRAM-CONSTANTS.                                        00360000
004800     05  PC-PROGRAM-NAME              PIC  X(08) VALUE 'XLKUP027'.00370000
005000                                                                  00380000
005100 01  PV-PROGRAM-VARIABLES.                                        00390000
005900     05  PV-RECORDS-READ              PIC  9(09) VALUE  0.        00400000
006000     05  PV-RECORDS-INSERTED          PIC  9(09) VALUE  0.        00410000
006400     05  PV-DISP-PK-SKU               PIC  9(08) VALUE  0.        00420000
           05  PV-DISP-CPT-SKU              PIC  9(08) VALUE  0.        00430000
006700     05  PV-SQLCODE                   PIC  S9(9) VALUE +0.        00440000
006800     05  PV-DISP-SQLCODE              PIC ZZZZZZ9-.               00450000
006900                                                                  00460000
007000                                                                  00470000
007100 01  PV-ABEND-FIELDS.                                             00480000
007200     05  PV-ABEND-CODE                PIC  S9(4) VALUE +0         00490000
007300                                                 COMP SYNC.       00500000
007400     05  PV-ABEND-PROGRAM             PIC  X(08) VALUE 'XLKUP027'.00510000
007500     05  PV-ABEND-PARAGRAPH           PIC  X(50) VALUE SPACES.    00520000
007600     05  PV-ABEND-OPERATION           PIC  X(50) VALUE SPACES.    00530000
007700     05  PV-ABEND-TABLE               PIC  X(12) VALUE SPACES.    00540000
007900     05  PV-DB2-OPERATION-MESSAGE-1   PIC  X(79) VALUE SPACES.    00550000
008000     05  PV-DB2-OPERATION-MESSAGE-2   PIC  X(79) VALUE SPACES.    00560000
008100     05  PV-DB2-OPERATION-MESSAGE-3   PIC  X(79) VALUE SPACES.    00570000
008200                                                                  00580000
008300                                                                  00590000
008400***********************************************************       00600000
008500*  COPYBOOK USED FOR PACK DATA    INPUT FILE              *       00610000
008600***********************************************************       00620000
008700     COPY IMRD076.                                                00630000
008800                                                                  00640000
008900***********************************************************       00650000
009000*  USED FOR DB2 ERROR MESSAGE BUILDING                    *       00660000
009100***********************************************************       00670000
009200     COPY DPWS004.                                                00680000
009300                                                                  00690000
009400***********************************************************       00700000
009500*  DB2 SQL COMMUNICATION AREA                             *       00710000
009600***********************************************************       00720000
009700     EXEC SQL                                                     00730000
009800          INCLUDE SQLCA                                           00740000
009900     END-EXEC.                                                    00750000
010000                                                                  00760000
010100***********************************************************       00770000
010200*  XLT_PK_CPT_SKU                                         *       00780000
010300***********************************************************       00790000
010400     EXEC SQL                                                     00800000
010500          INCLUDE XLT00008                                        00810000
010600     END-EXEC.                                                    00820000
010700                                                                  00830000
010800***************************************************************** 00840000
010900 PROCEDURE DIVISION.                                              00850000
011000***************************************************************** 00860000
011100     DISPLAY '**** BEGINNING XLKUP027 ****'.                      00870000
011200     DISPLAY ' '.                                                 00880000
011300                                                                  00890000
011400     OPEN INPUT  PACKSKU-IN.                                      00900000
011500                                                                  00910000
011600     PERFORM 1000-READ-INPUT-FILE.                                00920000
011700                                                                  00930000
012100     PERFORM 2000-PROCESS-INPUT-FILE                              00940000
012200       UNTIL PS-EOF-INPUT-YES.                                    00950000
012300                                                                  00960000
012400     CLOSE PACKSKU-IN.                                            00970000
012500                                                                  00980000
012510     PERFORM 3000-TABLE-COMMIT.                                   00990000
012520                                                                  01000000
012600     DISPLAY 'INPUT PACKSKU RECS READ  = ' PV-RECORDS-READ.       01010000
012700     DISPLAY 'XKT_PK_CPT_SKU ROWS INSRT= ' PV-RECORDS-INSERTED.   01020000
012800     DISPLAY ' '.                                                 01030000
012900     DISPLAY '****  END OF  XLKUP027  ****'.                      01040000
013000                                                                  01050000
013100     GOBACK.                                                      01060000
013200                                                                  01070000
013300                                                                  01080000
013400***************************************************************** 01090000
013500*  READ A PACKSKU EXTRACT RECORD THAT WILL BE USED TO INSERT    * 01100000
013510*  A ROW OF DATA INTO THE XLT_PK_CPT_SKU TABLE.                 * 01110000
013600***************************************************************** 01120000
013700 1000-READ-INPUT-FILE.                                            01130000
013800                                                                  01140000
013900     MOVE '1000-READ-INPUT-FILE    ' TO PV-ABEND-PARAGRAPH.       01150000
014000                                                                  01160000
014010     INITIALIZE IM076-PACKSKU-PK-CPT-SKU                          01170000
                      PA-DB2-COMMIT-COUNT.                              01180000
014020                                                                  01190000
014100     READ PACKSKU-IN                                              01200000
014200          INTO IM076-PACKSKU-PK-CPT-SKU                           01210000
014300            AT END                                                01220000
014400               SET PS-EOF-INPUT-YES TO TRUE                       01230000
014500                                                                  01240000
014600            NOT AT END                                            01250000
014700               SET PS-EOF-INPUT-NO  TO TRUE                       01260000
014800               ADD +1 TO PV-RECORDS-READ                          01270000
014900     END-READ.                                                    01280000
015000                                                                  01290000
015100                                                                  01300000
015200***************************************************************** 01310000
015300*  LOAD THE INFORMATION FROM THE PACKSKU EXTRACT FILE INTO THE  * 01320000
015310*  HOST VARIABLES AND PERFORM A PARAGRAPH TO INSERT THE NEW ROW * 01330000
015320*  INTO THE XLT_PK_CPT_SKU TABLE.                               * 01340000
015400***************************************************************** 01350000
015500 2000-PROCESS-INPUT-FILE.                                         01360000
015600                                                                  01370000
015700     MOVE '2000-PROCESS-INPUT-FILE '   TO PV-ABEND-PARAGRAPH.     01380000
015800                                                                  01390000
016361     MOVE IM076-PKSKU-PK-SKU-NBR       TO XLT00008-PK-SKU-NBR.    01400000
016362     MOVE IM076-PKSKU-CPT-SKU-NBR      TO XLT00008-CPT-SKU-NBR.   01410000
           MOVE IM076-PKSKU-PK-RATO-UNT-QTY                             01420000
                               TO XLT00008-PK-RATIO-UNT-QTY             01430000
016380                                                                  01440000
016400     PERFORM 2100-INSERT-XLT-PK-CPT-SKU.                          01450000
017700                                                                  01460000
017800     PERFORM 1000-READ-INPUT-FILE.                                01470000
018500                                                                  01480000
018600                                                                  01490000
021600***************************************************************** 01500000
021700*  INSERT A ROW TO THE XLT_PK_CPT_SKU TABLE                     * 01510000
021800***************************************************************** 01520000
021900 2100-INSERT-XLT-PK-CPT-SKU.                                      01530000
022000                                                                  01540000
022100     EXEC SQL                                                     01550000
022200          INSERT                                                  01560000
022300          INTO  XLT_PK_CPT_SKU                                    01570000
023093              ( PK_SKU_NBR                                        01580000
023094               ,CPT_SKU_NBR                                       01590000
023095               ,PK_RATIO_UNT_QTY                                  01600034
                     ,LAST_UPD_TMST)                                    01601034
023200          VALUES                                                  01610000
023993             (  :XLT00008-PK-SKU-NBR                              01620000
023994               ,:XLT00008-CPT-SKU-NBR                             01630000
023995               ,:XLT00008-PK-RATIO-UNT-QTY                        01640034
                     ,CURRENT TIMESTAMP)                                01641034
024010     END-EXEC.                                                    01650000
024100                                                                  01660000
024200     EVALUATE TRUE                                                01670000
024300         WHEN SQLCODE = ZERO                                      01680000
024400              ADD +1                 TO PV-RECORDS-INSERTED       01690000
                    ADD +1                 TO PA-DB2-COMMIT-COUNT       01700000
                    IF PA-DB2-COMMIT-COUNT > 4500                       01710000
                        PERFORM 3000-TABLE-COMMIT                       01720000
                        MOVE 0 TO PA-DB2-COMMIT-COUNT                   01730000
                    END-IF                                              01740000
               WHEN SQLCODE = -803                                      01750000
                    CONTINUE                                            01760000
024500         WHEN SQLCODE NOT = +0                                    01770000
024600              MOVE '2100-INSERT-XLT-PK-CPT-SKU'                   01780000
024700                                     TO PV-ABEND-PARAGRAPH        01790000
024800              MOVE 'INSERT XLT_PK_CPT_SKU'                        01800000
024810                                     TO PV-ABEND-OPERATION        01810000
024821              MOVE IM076-PKSKU-PK-SKU-NBR                         01820000
024821                                     TO PV-DISP-PK-SKU            01830000
                    MOVE IM076-PKSKU-CPT-SKU-NBR                        01840000
                                           TO PV-DISP-CPT-SKU           01850000
025500              STRING 'PK SKU NBR: '           DELIMITED BY SIZE   01860000
025600                     PV-DISP-PK-SKU           DELIMITED BY SIZE   01870000
026100                     '  CPT SKU: '            DELIMITED BY SIZE   01880000
026200                     PV-DISP-CPT-SKU          DELIMITED BY SIZE   01890000
026700                                   INTO PV-DB2-OPERATION-MESSAGE-101900000
026800                                                                  01910000
026900              MOVE 'XLT_PK_CPT_SKU'  TO PV-ABEND-TABLE            01920000
027000              PERFORM Z999-SQL-ABEND                              01930000
027100     END-EVALUATE.                                                01940000
027200                                                                  01950000
027300                                                                  01960000
027400***************************************************************** 01970000
027500* COMMIT THE PENDING TABLE CHANGES.                             * 01980000
027600***************************************************************** 01990000
027700 3000-TABLE-COMMIT.                                               02000000
027800                                                                  02010000
027900     EXEC SQL                                                     02020000
028000          COMMIT                                                  02030000
028100     END-EXEC.                                                    02040000
028200                                                                  02050000
028300                                                                  02060000
028400***************************************************************** 02070000
028500*  DISPLAY DB2 ERROR INFORMATION, ROLLBACK ANY PENDING CHANGES, * 02080000
028510*  AND ABEND THE PROGRAM.                                       * 02090000
028600***************************************************************** 02100000
028700 Z999-SQL-ABEND.                                                  02110000
028800                                                                  02120000
028900     MOVE SQLCODE            TO PV-SQLCODE.                       02130000
029000     MOVE PV-SQLCODE         TO PV-DISP-SQLCODE.                  02140000
029100     DISPLAY '*** DB2 ERROR '.                                    02150000
029200     DISPLAY '*** SQLCODE   = ' PV-DISP-SQLCODE.                  02160000
029300     DISPLAY '*** PROGRAM   = ' PV-ABEND-PROGRAM.                 02170000
029400     DISPLAY '*** PARAGRAPH = ' PV-ABEND-PARAGRAPH.               02180000
029500     DISPLAY '*** OPERATION = ' PV-ABEND-OPERATION.               02190000
029600     DISPLAY '*** MESSAGE   = ' PV-DB2-OPERATION-MESSAGE-1.       02200000
029700     DISPLAY '***           = ' PV-DB2-OPERATION-MESSAGE-2.       02210000
029800     DISPLAY '***           = ' PV-DB2-OPERATION-MESSAGE-3.       02220000
029900     DISPLAY '*** TABLE 1   = ' PV-ABEND-TABLE.                   02230000
030000                                                                  02240000
030100     COPY DPPD004.                                                02250000
030200                                                                  02260000
030300     MOVE +4013         TO PV-ABEND-CODE.                         02270000
030400     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         02280000
