000100***************************************************************** 00010000
000200 IDENTIFICATION DIVISION.                                         00020000
000300***************************************************************** 00030000
000400 PROGRAM-ID.    XLKUT021.                                         00040000
000500 AUTHOR.        STEPHANIE HERON.                                  00050000
000600 INSTALLATION.  KOHLS.                                            00060000
000700 DATE-WRITTEN   FEB 2003.                                         00070000
000800 DATE-COMPILED.                                                   00080000
000900***************************************************************** 00090000
001000*  THIS BATCH DB2 PROGRAM READS THE FILE CREATED BY XLKUT020    * 00100000
001100*  CONTAINING UPC XREF INFORMATION.  THIS DATA IS INSERTED INTO * 00110000
001200*  THE XLT_UPC TABLE.                                           * 00120000
001400***************************************************************** 00130000
001500 ENVIRONMENT DIVISION.                                            00140000
001600 INPUT-OUTPUT SECTION.                                            00150000
001700                                                                  00160000
001800 FILE-CONTROL.                                                    00170000
001900                                                                  00180000
002000     SELECT UPC-UPDATE-FILE                                       00190000
002010         ASSIGN TO INP01.                                         00200000
002100                                                                  00210000
002200***************************************************************** 00220000
002300 DATA DIVISION.                                                   00230000
002400***************************************************************** 00240000
002500 FILE SECTION.                                                    00250000
002600                                                                  00260000
002700 FD  UPC-UPDATE-FILE                                              00270000
002800     RECORDING MODE IS F                                          00280000
002810     BLOCK CONTAINS 0 RECORDS                                     00281000
002900     LABEL RECORDS ARE STANDARD.                                  00282000
003000                                                                  00283000
003300 01  UPC-UPDATE-FILE-RECORD       PIC X(150).                     00284000
003700                                                                  00285000
003800                                                                  00286000
003900***************************************************************** 00287000
004000 WORKING-STORAGE SECTION.                                         00288000
004100                                                                  00289000
004200 01  PA-DB2-COMMIT-COUNT              PIC S9(09) VALUE +0         00290000
004201                                                    COMP-3.       00300000
004202 01  PS-PROGRAM-SWITCHES.                                         00310000
004300     05  PS-EOF-INPUT-SW              PIC X(01)  VALUE 'N'.       00320000
004400         88  PS-EOF-INPUT-YES                    VALUE 'Y'.       00330000
004500         88  PS-EOF-INPUT-NO                     VALUE 'N'.       00340000
004600                                                                  00350000
004700 01  PC-PROGRAM-CONSTANTS.                                        00360000
004800     05  PC-PROGRAM-NAME              PIC  X(08) VALUE 'XLKUT021'.00370000
005000                                                                  00380000
005100 01  PV-PROGRAM-VARIABLES.                                        00390000
005900     05  PV-RECORDS-READ              PIC  9(09) VALUE  0.        00400000
006000     05  PV-RECORDS-UPDATE            PIC  9(09) VALUE  0.        00410000
006100     05  PV-RECORDS-INSERTED          PIC  9(09) VALUE  0.        00410000
006400     05  PV-DISP-INTR-UPC-ID          PIC  9(09) VALUE  0.        00420000
006410     05  PV-DISP-UPC-ID               PIC  9(09) VALUE  0.        00420000
006500     05  PV-DISP-UPC-NBR              PIC  9(15) VALUE  0.        00430000
006700     05  PV-SQLCODE                   PIC  S9(9) VALUE +0.        00440000
006800     05  PV-DISP-SQLCODE              PIC ZZZZZZ9-.               00450000
006900                                                                  00460000
007000                                                                  00470000
007100 01  PV-ABEND-FIELDS.                                             00480000
007200     05  PV-ABEND-CODE                PIC  S9(4) VALUE +0         00490000
007300                                                 COMP SYNC.       00500000
007400     05  PV-ABEND-PROGRAM             PIC  X(08) VALUE 'XLKUT021'.00510000
007500     05  PV-ABEND-PARAGRAPH           PIC  X(50) VALUE SPACES.    00520000
007600     05  PV-ABEND-OPERATION           PIC  X(50) VALUE SPACES.    00530000
007700     05  PV-ABEND-TABLE               PIC  X(12) VALUE SPACES.    00540000
007900     05  PV-DB2-OPERATION-MESSAGE-1   PIC  X(79) VALUE SPACES.    00550000
008000     05  PV-DB2-OPERATION-MESSAGE-2   PIC  X(79) VALUE SPACES.    00560000
008100     05  PV-DB2-OPERATION-MESSAGE-3   PIC  X(79) VALUE SPACES.    00570000
008200                                                                  00580000
008300                                                                  00590000
008400***********************************************************       00600000
008500*  COPYBOOK USED FOR THE UPC ERROR INPUT FILE             *       00610000
008600***********************************************************       00620000
008700     COPY XLRD010.                                                00630000
008800                                                                  00640000
008900***********************************************************       00650000
009000*  USED FOR DB2 ERROR MESSAGE BUILDING                    *       00660000
009100***********************************************************       00670000
009200     COPY DPWS004.                                                00680000
009300                                                                  00690000
009400***********************************************************       00700000
009500*  DB2 SQL COMMUNICATION AREA                             *       00710000
009600***********************************************************       00720000
009700     EXEC SQL                                                     00730000
009800          INCLUDE SQLCA                                           00740000
009900     END-EXEC.                                                    00750000
010000                                                                  00760000
010100***********************************************************       00770000
010200*  XLT_UPC TABLE                                          *       00780000
010300***********************************************************       00790000
010400     EXEC SQL                                                     00800000
010500          INCLUDE XLT00006                                        00810000
010600     END-EXEC.                                                    00820000
010700                                                                  00830000
010800***************************************************************** 00840000
010900 PROCEDURE DIVISION.                                              00850000
011000***************************************************************** 00860000
011100     DISPLAY '**** BEGINNING XLKUT021 ****'.                      00870000
011200     DISPLAY ' '.                                                 00880000
011300                                                                  00890000
011400     OPEN INPUT  UPC-UPDATE-FILE.                                 00900000
011500                                                                  00910000
011600     PERFORM 1000-READ-INPUT-FILE.                                00920000
011700                                                                  00930000
012100     PERFORM 2000-PROCESS-INPUT-FILE                              00940000
012200       UNTIL PS-EOF-INPUT-YES.                                    00950000
012300                                                                  00960000
012400     CLOSE UPC-UPDATE-FILE.                                       00970000
012500                                                                  00980000
012510     PERFORM 3000-TABLE-COMMIT.                                   00990000
012520                                                                  01000000
012600     DISPLAY '  INPUT UPC RECS READ    = ' PV-RECORDS-READ.       01010000
012700     DISPLAY '  XLT_UPC ROWS UPDATED   = ' PV-RECORDS-UPDATE.     01020000
012710     DISPLAY '  XLT_UPC ROWS INSERTED  = ' PV-RECORDS-INSERTED.   01020000
012800     DISPLAY ' '.                                                 01030000
012900     DISPLAY '****  END OF  XLKUT021  ****'.                      01040000
013000                                                                  01050000
013100     GOBACK.                                                      01060000
013200                                                                  01070000
013300                                                                  01080000
013400***************************************************************** 01090000
013500*  READ A UPC ADD EXTRACT RECORD THAT WILL BE USED TO UPDATE    * 01100000
013510*  A ROW OF DATA INTO THE XLT_UPC TABLE.                        * 01110000
013600***************************************************************** 01120000
013700 1000-READ-INPUT-FILE.                                            01130000
013800                                                                  01140000
013900     MOVE '1000-READ-INPUT-FILE    ' TO PV-ABEND-PARAGRAPH.       01150000
014000                                                                  01160000
014010     INITIALIZE XL010-UPC-RECORD                                  01170000
014011                PA-DB2-COMMIT-COUNT.                              01180000
014020                                                                  01190000
014100     READ UPC-UPDATE-FILE                                         01200000
014200          INTO XL010-UPC-RECORD                                   01210000
014300            AT END                                                01220000
014400               SET PS-EOF-INPUT-YES TO TRUE                       01230000
014500                                                                  01240000
014600            NOT AT END                                            01250000
014700               SET PS-EOF-INPUT-NO  TO TRUE                       01260000
014800               ADD +1 TO PV-RECORDS-READ                          01270000
014900     END-READ.                                                    01280000
015000                                                                  01290000
015100                                                                  01300000
015200***************************************************************** 01310000
015300*  LOAD THE INFORMATION FROM THE UPC ADD EXTRACT FILE INTO THE  * 01320000
015310*  HOST VARIABLES AND PERFORM A PARAGRAPH TO INSERT THE NEW ROW * 01330000
015320*  INTO THE XLT_UPC TABLE.                                      * 01340000
015400***************************************************************** 01350000
015500 2000-PROCESS-INPUT-FILE.                                         01360000
015600                                                                  01370000
015700     MOVE '2000-PROCESS-INPUT-FILE ' TO PV-ABEND-PARAGRAPH.       Ù1380000
015800                                                                  01390000
015900     IF XL010-FILE-INDICATOR = 'A'                                        
016000        PERFORM 2100-UPDATE-UPC-TABLE                                     
016100     END-IF.                                                              
017700                                                                  01490000
017800     PERFORM 1000-READ-INPUT-FILE.                                01500000
018500                                                                  01510000
018600                                                                  01520000
021600***************************************************************** 01530000
021700*  UPDATE THE UPC TABLE                                                 00
021800***************************************************************** 01550000
021900 2100-UPDATE-UPC-TABLE.                                           01560000
022000                                                                  01570000
022030     MOVE XL010-INTR-UPC-ID          TO XLT00006-INTR-UPC-ID.     01420000
022031     MOVE XL010-UPC-ID               TO XLT00006-UPC-ID.                00
022032     MOVE XL010-UPC-TYP-CDE          TO XLT00006-UPC-TYP-CDE.     01420000
022040     MOVE XL010-EDI-ORD-IND          TO XLT00006-EDI-ORD-IND.     01430000
022050     MOVE XL010-CERTD-IND            TO XLT00006-CERTD-IND.       01440000
022060     MOVE XL010-CERTD-DTE            TO XLT00006-CERTD-DTE.       01450000
022070     MOVE XL010-UPC-NBR              TO XLT00006-UPC-NBR.         01460000
      * START CHG0208353                                                        
           MOVE XL010-PREPK-IND            TO XLT00006-PREPK-IND.               
      * END   CHG0208353                                                        
022080                                                                  01570000
022100     EXEC SQL                                                     01580000
022200          UPDATE XLT_UPC                                                00
022300       SET   INTR_UPC_ID = :XLT00006-INTR-UPC-ID                  01600000
      *          , UPC_ID      = :XLT00006-UPC-ID                               
023093           , UPC_TYP_CDE = :XLT00006-UPC-TYP-CDE                  01610000
023094           , EDI_ORD_IND = :XLT00006-EDI-ORD-IND                        00
023095           , CERTD_IND   = :XLT00006-CERTD-IND                    01630000
023096           , CERTD_DTE   = :XLT00006-CERTD-DTE                          00
                 , LAST_UPD_TMST = CURRENT TIMESTAMP                            
      * START CHG0208353                                                        
                 , PREPK_IND   = :XLT00006-PREPK-IND                            
      * END   CHG0208353                                                        
023097       WHERE UPC_NBR     = :XLT00006-UPC-NBR                              
024010     END-EXEC.                                                    01760000
024100                                                                  01770000
024200     EVALUATE TRUE                                                01780000
024300         WHEN SQLCODE = ZERO                                      01790000
024400              ADD +1                 TO PV-RECORDS-UPDATE               00
024500              ADD +1                 TO PA-DB2-COMMIT-COUNT       01810000
024600              IF PA-DB2-COMMIT-COUNT > 200                              00
024700                  PERFORM 3000-TABLE-COMMIT                       01830000
024800                  MOVE 0 TO PA-DB2-COMMIT-COUNT                   01840000
024900              END-IF                                              01850000
025000         WHEN SQLCODE = +100                                      01860000
025001              MOVE XLT00006-UPC-NBR     TO PV-DISP-UPC-NBR                
025002              STRING ' UPC NUMBER '   DELIMITED BY SIZE                 13
025003                     PV-DISP-UPC-NBR    DELIMITED BY SIZE                 
025004                     ' NOT FOUND ON XLT_UPC        '                      
025005                                       DELIMITED BY SIZE                  
025006                                   INTO PV-DB2-OPERATION-MESSAGE-102670001
025007              DISPLAY '*** MESSAGE   = '                                  
025008                                        PV-DB2-OPERATION-MESSAGE-1        
025009              PERFORM 2200-INSERT-UPC                                     
025010         WHEN SQLCODE = -803                                      01860000
025012              MOVE XLT00006-UPC-ID  TO PV-DISP-UPC-ID                     
025014              STRING ' UPC ID '        DELIMITED BY SIZE                13
025015                     PV-DISP-UPC-ID    DELIMITED BY SIZE                  
025016                     ' ALREADY ON XLT_UPC '                               
025017                                       DELIMITED BY SIZE                  
025019                                   INTO PV-DB2-OPERATION-MESSAGE-102670001
025020              DISPLAY '*** MESSAGE   = '                                  
025021                                        PV-DB2-OPERATION-MESSAGE-1        
025022         WHEN SQLCODE = -530                                      02441013
025023              MOVE XLT00006-INTR-UPC-ID TO PV-DISP-INTR-UPC-ID            
025024              MOVE XLT00006-UPC-NBR TO PV-DISP-UPC-NBR                    
025026              STRING ' UPC '           DELIMITED BY SIZE                13
025027                     PV-DISP-UPC-NBR   DELIMITED BY SIZE                  
025028                     ' NOT UPDATED DUE TO RI FOR INTR UPC ID '            
025029                                       DELIMITED BY SIZE                  
025030                     PV-DISP-INTR-UPC-ID  DELIMITED BY SIZE               
025031                                   INTO PV-DB2-OPERATION-MESSAGE-102670001
025032              DISPLAY '*** MESSAGE   = '                                  
025033                                        PV-DB2-OPERATION-MESSAGE-1        
025034         WHEN SQLCODE NOT = +0                                    01880000
025035              MOVE '2100-UPDATE-XLT-UPC'                          01890000
025036                                     TO PV-ABEND-PARAGRAPH        01900000
025037              MOVE 'UPDATE XLT_UPC'                               01910000
025038                                     TO PV-ABEND-OPERATION        01920000
025039              MOVE XL010-UPC-ID      TO PV-DISP-UPC-ID            01930000
025040              MOVE XL010-INTR-UPC-ID TO PV-DISP-INTR-UPC-ID       01930000
025050              MOVE XL010-UPC-NBR     TO PV-DISP-UPC-NBR           01940000
025500              STRING 'UPC ID NBR: '           DELIMITED BY SIZE   01950000
025600                     PV-DISP-UPC-ID           DELIMITED BY SIZE   01960000
026100                     '  UPC NBR: '            DELIMITED BY SIZE   01970000
026200                     PV-DISP-UPC-NBR          DELIMITED BY SIZE   01980000
026300                     ' INTR UPCID: '          DELIMITED BY SIZE   01970000
026400                     PV-DISP-INTR-UPC-ID      DELIMITED BY SIZE   01980000
026700                                   INTO PV-DB2-OPERATION-MESSAGE-101990000
026800                                                                  02000000
026900              MOVE 'XLT_UPC'         TO PV-ABEND-TABLE            02010000
027000              PERFORM Z999-SQL-ABEND                              02020000
027100     END-EVALUATE.                                                02030000
027200                                                                  02040000
027210***************************************************************** 02160001
027220*  INSERT A ROW TO THE XLT_UPC TABLE.                           * 02170016
027230***************************************************************** 02180001
027240 2200-INSERT-UPC.                                                       16
027250                                                                  02200001
027260     EXEC SQL                                                     02210001
027270          INSERT                                                  02220001
027280          INTO  XLT_UPC                                           02230016
027290              ( UPC_ID                                            02309316
027291               ,INTR_UPC_ID                                       02309416
027292               ,UPC_TYP_CDE                                       02309516
027293               ,EDI_ORD_IND                                       02309616
027294               ,CERTD_IND                                         02309716
027295               ,CERTD_DTE                                         02309816
027296               ,UPC_NBR                                           02309916
                     ,LAST_UPD_TMST                                             
      * START CHG0208353                                                        
                     ,PREPK_IND)                                                
      * END   CHG0208353                                                        
027297          VALUES                                                  02320001
027298             (  :XLT00006-UPC-ID                                  02399316
027299               ,:XLT00006-INTR-UPC-ID                             02399416
027300               ,:XLT00006-UPC-TYP-CDE                             02399516
027301               ,:XLT00006-EDI-ORD-IND                             02399616
027302               ,:XLT00006-CERTD-IND                               02399716
027303               ,:XLT00006-CERTD-DTE                               02399816
027304               ,:XLT00006-UPC-NBR                                 02399916
                     ,CURRENT TIMESTAMP                                         
      * START CHG0208353                                                        
                     ,:XLT00006-PREPK-IND)                                      
      * END   CHG0208353                                                        
027305     END-EXEC.                                                    02401001
027306                                                                  02410001
027307     EVALUATE TRUE                                                02420001
027308         WHEN SQLCODE = ZERO                                      02430001
027309              ADD +1                 TO PV-RECORDS-INSERTED       02440001
027310              ADD +1                 TO PA-DB2-COMMIT-COUNT       02440123
027311              IF PA-DB2-COMMIT-COUNT > 4500                       02440226
027312                  PERFORM 3000-TABLE-COMMIT                       02440321
027313                  MOVE 0 TO PA-DB2-COMMIT-COUNT                   02440423
027314              END-IF                                              02440521
027315         WHEN SQLCODE = -803                                      02441013
027316              MOVE XLT00006-UPC-ID      TO PV-DISP-UPC-ID                 
027317              STRING ' UPC ID     '   DELIMITED BY SIZE                 13
027318                     PV-DISP-UPC-ID     DELIMITED BY SIZE                 
027319                     ' ALREADY ON XLT_UPC        '                        
027320                                       DELIMITED BY SIZE                  
027321                                   INTO PV-DB2-OPERATION-MESSAGE-102670001
027322              DISPLAY '*** MESSAGE   = '                                  
027323                                        PV-DB2-OPERATION-MESSAGE-1        
027324         WHEN SQLCODE = -530                                      02441013
027325              MOVE XLT00006-INTR-UPC-ID TO PV-DISP-INTR-UPC-ID            
027326              MOVE XLT00006-UPC-NBR TO PV-DISP-UPC-NBR                    
027328              STRING ' UPC '           DELIMITED BY SIZE                13
027329                     PV-DISP-UPC-NBR   DELIMITED BY SIZE                  
027330                     ' NOT UPDATED DUE TO RI FOR INTR UPC ID '            
027331                                       DELIMITED BY SIZE                  
027332                     PV-DISP-INTR-UPC-ID  DELIMITED BY SIZE               
027333                                   INTO PV-DB2-OPERATION-MESSAGE-102670001
027334              DISPLAY '*** MESSAGE   = '                                  
027335                                        PV-DB2-OPERATION-MESSAGE-1        
027336         WHEN SQLCODE NOT = +0                                    02450001
027337              MOVE '2100-INSERT-UPC'                                    16
027338                                     TO PV-ABEND-PARAGRAPH        02470001
027339              MOVE 'INSERT XLT_UPC'                               02480016
027340                                     TO PV-ABEND-OPERATION        02481001
027341              MOVE XLT00006-UPC-ID   TO PV-DISP-UPC-ID            02482124
027342              MOVE XLT00006-UPC-NBR  TO PV-DISP-UPC-NBR           02482224
027343              STRING 'UPC ID NBR: '           DELIMITED BY SIZE   02550016
027344                     PV-DISP-UPC-ID           DELIMITED BY SIZE   02560016
027345                     '  UPC NBR: '            DELIMITED BY SIZE   02610016
027346                     PV-DISP-UPC-NBR          DELIMITED BY SIZE   02620016
027347                                   INTO PV-DB2-OPERATION-MESSAGE-102670001
027348                                                                  02680001
027349              MOVE 'XLT_UPC'         TO PV-ABEND-TABLE            02690016
027350              PERFORM Z999-SQL-ABEND                              02700001
027351     END-EVALUATE.                                                02710001
027352                                                                  02720001
027353                                                                  02730001
027360                                                                  02050000
027400***************************************************************** 02060000
027500* COMMIT THE PENDING TABLE CHANGES.                             * 02070000
027600***************************************************************** 02080000
027700 3000-TABLE-COMMIT.                                               02090000
027800                                                                  02100000
027900     EXEC SQL                                                     02110000
028000          COMMIT                                                  02120000
028100     END-EXEC.                                                    02130000
028200                                                                  02140000
028300                                                                  02150000
028400***************************************************************** 02160000
028500*  DISPLAY DB2 ERROR INFORMATION, ROLLBACK ANY PENDING CHANGES, * 02170000
028510*  AND ABEND THE PROGRAM.                                       * 02180000
028600***************************************************************** 02190000
028700 Z999-SQL-ABEND.                                                  02200000
028800                                                                  02210000
028900     MOVE SQLCODE            TO PV-SQLCODE.                       02220000
029000     MOVE PV-SQLCODE         TO PV-DISP-SQLCODE.                  02230000
029100     DISPLAY '*** DB2 ERROR '.                                    02240000
029200     DISPLAY '*** SQLCODE   = ' PV-DISP-SQLCODE.                  02250000
029300     DISPLAY '*** PROGRAM   = ' PV-ABEND-PROGRAM.                 02260000
029400     DISPLAY '*** PARAGRAPH = ' PV-ABEND-PARAGRAPH.               02270000
029500     DISPLAY '*** OPERATION = ' PV-ABEND-OPERATION.               02280000
029600     DISPLAY '*** MESSAGE   = ' PV-DB2-OPERATION-MESSAGE-1.       02290000
029700     DISPLAY '***           = ' PV-DB2-OPERATION-MESSAGE-2.       02300000
029800     DISPLAY '***           = ' PV-DB2-OPERATION-MESSAGE-3.       02310000
029900     DISPLAY '*** TABLE 1   = ' PV-ABEND-TABLE.                   02320000
030000                                                                  02330000
030100     COPY DPPD004.                                                02340000
030200                                                                  02350000
030300     MOVE +4013         TO PV-ABEND-CODE.                         02360000
030400     CALL 'ILBOABN0' USING PV-ABEND-CODE.                         02370000
