000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    XLKUT070.                                         00020051
000300 AUTHOR.        THERESE RAMSEYER.                                 00030051
000400 DATE-WRITTEN.  JANUARY 2004.                                     00040051
000500****************************************************************  00050000
000600*    U S E R   D O M A I N   S Y N C / E X T R A C T              00060051
000700*                                                                 00070000
000800* THIS PROGRAM READS THE COMMON EXTRACT FILE AND A FILE CONTAINING00080070
000900* AN UNLOAD OF THE DB2 TABLE XLT_USR. THE UNLOAD FILE WAS MADE    00090070
001000* USING BMC UNLOAD SOFTWARE.                                      00100070
001100* THE FILES ARE COMPARED AS PROCESSING DETERMINES IF RECORDS NEED 00110070
001200* TO BE ADDED, UPDATED OR DELETED ON XLT_USR.                     00120070
001300* THE DIFFERENCES ARE WRITTEN TO AN OUTPUT FILE TO BE PASSED TO   00130070
001400* AN UPDATE PROGRAM (XLKUP030).                                   00140070
001500* IF THE COMMON EXTRACT FILE IS EMPTY, THE PROGRAM WILL ABEND AND 00150070
001510* SEND A MESSAGE TO SYSOUT.                                       00151070
001520* THE PROGRAM WILL COMPLETE WITH A RETURN CODE 0F 4 TO KICK OFF   00152070
001530* AN EMAIL NOTIFICATION TO THE XL GROUP IF THERE ARE DATA         00153070
001540* INTEGRITY ISSUES DURING THE WEEKLY RUN OF THIS PROGRAM.         00154070
001550* THIS PROGRAM WILL DUN DAILY TO SYNC THE TABLE AND THIS WILL     00155070
001560* ALSO RUN WEEKLY TO CHECK FOR DATA INTEGRITY ISSUES.             00156070
001570* --------RETURN CODES-----------                                 00157076
001580* 4092 - REFERENTIAL INTEGRITY ISSUE /DELETE NOT PERFORMED        00158076
001590* 4093 - NOT FOUND SQL CODE /UPDATE NOT PERFORMED                 00159076
001591* 4094 - DATA INTEGRITY ISSUE FOUND DURING A WEEKLY CHECK         00159176
001592* 4095 - COMMON EXTRACT FILE IS EMPTY                             00159276
001600****************************************************************  00160000
001700 ENVIRONMENT DIVISION.                                            00170000
001800 INPUT-OUTPUT SECTION.                                            00180000
001900                                                                  00190000
002000 FILE-CONTROL.                                                    00200000
002100     SELECT COMMON-EXTRACT-FILE  ASSIGN TO INP01.                 00210051
002200     SELECT XLT-USR-UNLOAD-FILE  ASSIGN TO INP02.                 00220052
002300                                                                  00230000
002400     SELECT OUTPUT-FILE          ASSIGN TO OUT01.                 00240000
002500                                                                  00250000
002600****************************************************************  00260000
002700 DATA DIVISION.                                                   00270000
002800 FILE SECTION.                                                    00280000
002900                                                                  00290000
003000 FD  COMMON-EXTRACT-FILE                                          00300051
003100     LABEL RECORDS ARE STANDARD                                   00310000
003200     RECORDING MODE IS F                                          00320000
003300     BLOCK CONTAINS 0 RECORDS.                                    00330000
003400 01  COMMON-EXTRACT-REC          PIC X(140).                      00340066
003500                                                                  00350000
003600 FD  XLT-USR-UNLOAD-FILE                                          00360051
003700     LABEL RECORDS ARE STANDARD                                   00370000
003800     RECORDING MODE IS F                                          00380000
003900     BLOCK CONTAINS 0 RECORDS.                                    00390000
004000 01  XLT-USR-UNLOAD-REC          PIC X(137).                      00400084
004100                                                                  00410000
004200                                                                  00420000
004300 FD  OUTPUT-FILE                                                  00430000
004400     LABEL RECORDS ARE STANDARD                                   00440000
004500     RECORDING MODE IS F                                          00450000
004600     BLOCK CONTAINS 0 RECORDS.                                    00460000
004700 01  OUTPUT-REC                  PIC X(250).                      00470054
004800                                                                  00480000
004900****************************************************************  00490000
005000 WORKING-STORAGE SECTION.                                         00500000
005100                                                                  00510000
005200 01  WS-WORKING-STOAGE-VALUE     PIC X(35)  VALUE                 00520000
005300                          '*** WORKING STORAGE STARTS HERE ***'.  00530000
005400 01  PS-PROGRAM-SWITCHES.                                         00540000
005500     05  PS-EMPTY-FILE-SW        PIC X(01)  VALUE 'N'.            00550000
005600         88  PS-EMPTY-FILE-YES              VALUE 'Y'.            00560000
005700         88  PS-EMPTY-FILE-NO               VALUE 'N'.            00570000
005800     05  PS-EOF-EXT-SW           PIC X(01)  VALUE 'N'.            00580051
005900         88  PS-EOF-EXT-YES                 VALUE 'Y'.            00590051
006000         88  PS-EOF-EXT-NO                  VALUE 'N'.            00600051
006100     05  PS-EOF-DB2-SW           PIC X(01)  VALUE 'N'.            00610000
006200         88  PS-EOF-DB2-YES                 VALUE 'Y'.            00620000
006300         88  PS-EOF-DB2-NO                  VALUE 'N'.            00630000
006400                                                                  00640000
006500 01  PC-PROGRAM-CONSTANTS.                                        00650000
006600     05  PC-PROGRAM-NAME         PIC X(08)  VALUE 'XLKUT070'.     00660051
006601     05  PC-Y                    PIC X(01)  VALUE 'Y'.            00660178
006610     05  ABEND-CODE              PIC S9(04) VALUE ZERO COMP SYNC. 00661059
006700                                                                  00670000
006800 01  CONTROL-CARD-DATA.                                           00680000
006900     05  CC-PROGRAM-RUN-TYPE     PIC X(01)  VALUE SPACES.         00690051
007000         88  CC-DAILY-MAINT                 VALUE 'D'.            00700051
007100         88  CC-WEEKLY-INTEGRITY            VALUE 'W'.            00710051
007200     05  CC-FILLER               PIC X(79)  VALUE SPACES.         00720000
007300                                                                  00730000
007400 01  PV-PROGRAM-VARIABLES.                                        00740000
007500     05  PV-PARAGRAPH-NAME       PIC X(30)  VALUE SPACES.         00750000
007510     05  PV-INPUT-PRTR-ID.                                        00751082
007520         10  PV-INPUT-PRTR-ID-5    PIC X(05)  VALUE SPACES.       00752082
007530         10  PV-INPUT-PRTR-ID-3    PIC X(03)  VALUE SPACES.       00753082
007600                                                                  00760000
007700 01  PA-PROGRAM-ACCUMULATORS.                                     00770000
007800     05  PA-TOT-EXT-RECS-READ      PIC 9(07).                     00780080
007900     05  PA-TOT-XLT-RECS-READ      PIC 9(07).                     00790080
008000     05  PA-TOT-MATCH-NO-CHG       PIC 9(07).                     00800080
008100     05  PA-TOT-MATCH-WITH-CHG     PIC 9(07).                     00810080
008200     05  PA-TOT-OUTRECS-WRITTEN    PIC 9(07).                     00820080
008300     05  PA-TOT-OUTRECS-ADD        PIC 9(07).                     00830080
008400     05  PA-TOT-OUTRECS-MOD        PIC 9(07).                     00840080
008500     05  PA-TOT-OUTRECS-DEL        PIC 9(07).                     00850080
008510     05  PA-TOT-RVKED-DELS         PIC 9(07).                     00851080
008600                                                                  00860000
008910******************************************************************00891070
009000*COMMON EXTRACT INPUT FILE (DRIVER)                               00900070
009010******************************************************************00901070
009100     COPY XIRD001.                                                00910077
009200                                                                  00920000
009201******************************************************************00920170
009210*XLT_USR UNLOAD LAYOUT INPUT                                      00921070
009211******************************************************************00921170
009220     COPY XLRD045.                                                00922064
009230                                                                  00923064
010400******************************************************************01040000
010500* COPYBOOK OF OUTPUT FILE                                         01050070
010600******************************************************************01060000
010700     COPY XLRD038.                                                01070051
010800                                                                  01080000
010900******************************************************************01090070
011000 PROCEDURE DIVISION.                                              01100000
011100                                                                  01110000
011200     PERFORM 1000-INITIALIZATION.                                 01120000
011300                                                                  01130000
011400*CHECK IF THE EXTRACT-FILE IS EMPTY (ERROR MESSAGE).              01140051
011500     SET PS-EMPTY-FILE-NO TO TRUE.                                01150000
011600     PERFORM 8000-READ-EXT-FILE.                                  01160051
011700     PERFORM 8010-READ-USR-FILE.                                  01170051
011800     IF PS-EMPTY-FILE-YES                                         01180000
011900         PERFORM 1100-CLOSE-INPUT-FILES                           01190000
012000         MOVE 4095 TO RETURN-CODE                                 01200075
012010                      ABEND-CODE                                  01201062
012100         PERFORM 9500-TERMINATE                                   01210059
012110         PERFORM 9999-ABEND                                       01211059
012200         STOP RUN                                                 01220051
012300     END-IF.                                                      01230051
012400                                                                  01240000
012500*COMPARE FILES.                                                   01250051
012600     PERFORM 2000-COMPARE-FILES                                   01260051
012700       UNTIL PS-EOF-EXT-YES                                       01270051
012800          OR PS-EOF-DB2-YES.                                      01280000
012900                                                                  01290000
013000*PROCESS THE REST OF DB2 FILE.                                    01300051
013100     IF PS-EOF-EXT-YES                                            01310051
P42541        IF CC-DAILY-MAINT                                         01311087
P42541           PERFORM 2020-PROCESS-DELETES                           01320086
P42541             UNTIL PS-EOF-DB2-YES                                 01330086
P42541        END-IF                                                    01331086
013400     ELSE                                                         01340000
013500*PROCESS THE REST OF EXT FILE.                                    01350051
013600         PERFORM 2010-PROCESS-ADDS                                01360051
013700           UNTIL PS-EOF-EXT-YES                                   01370051
013800     END-IF.                                                      01380000
013900                                                                  01390000
014000*CLOSE FILES.                                                     01400051
014100     CLOSE COMMON-EXTRACT-FILE                                    01410051
014200           XLT-USR-UNLOAD-FILE.                                   01420051
014300                                                                  01430000
014400*FINISH PROCESSING.                                               01440000
014500     PERFORM 9500-TERMINATE.                                      01450059
014600                                                                  01460000
014700     STOP RUN.                                                    01470051
014800                                                                  01480000
014900******************************************************************01490000
015000*             I N I T I A L I Z A T I O N                        *01500000
015100******************************************************************01510000
015200 1000-INITIALIZATION.                                             01520000
015300     MOVE '1000-INITIALIZATION           ' TO PV-PARAGRAPH-NAME.  01530000
015400                                                                  01540000
015500*OPEN FILES.                                                      01550000
015600     OPEN INPUT  COMMON-EXTRACT-FILE                              01560051
015700                 XLT-USR-UNLOAD-FILE                              01570051
015800          OUTPUT OUTPUT-FILE.                                     01580000
015900                                                                  01590000
016000*SET COUNTERS TO ZERO.                                            01600000
016100     INITIALIZE PA-PROGRAM-ACCUMULATORS.                          01610000
016200                                                                  01620000
016300*READ SYSIN CONTROL CARD.                                         01630000
016400     ACCEPT CONTROL-CARD-DATA FROM SYSIN.                         01640000
016500                                                                  01650051
016600*SET EOF SWITCHES                                                 01660051
016700     SET PS-EOF-EXT-NO TO TRUE.                                   01670051
016800     SET PS-EOF-DB2-NO TO TRUE.                                   01680051
016900                                                                  01690000
017000******************************************************************01700000
017100 1100-CLOSE-INPUT-FILES.                                          01710000
017200     MOVE '1100-CLOSE-INPUT-FILES        ' TO PV-PARAGRAPH-NAME.  01720000
017300                                                                  01730000
017400     CLOSE COMMON-EXTRACT-FILE                                    01740051
017500           XLT-USR-UNLOAD-FILE.                                   01750051
017600                                                                  01760000
017700******************************************************************01770000
017800* C O M P A R E   F I L E S (USING THE EXT USERID AS THE DRIVER) *01780051
017900******************************************************************01790000
018000 2000-COMPARE-FILES.                                              01800051
018100     MOVE '2000-COMPARE-FILES            ' TO PV-PARAGRAPH-NAME.  01810051
018200                                                                  01820000
018300* COMPARE TO SEARCH FOR MODIFICATIONS                             01830051
018400     IF XI001-EMPLOYEE-USER-ID = XL045-USR-ID                     01840077
018500         IF XI001-LAST-NAME =  XL045-USR-LAST-NM                  01850077
018600           AND XI001-FIRST-NAME   = XL045-USR-FRST-NM             01860077
018700           AND XI001-MIDDLE-INIT  = XL045-USR-MID-INIT            01870077
018800           AND XI001-USR-RVKE-IND = XL045-USR-RVKE-IND            01880077
018900           AND XI001-DFLT-PRTR-ID = XL045-DFLT-PRTR-ID            01890083
019000           AND XI001-EMP-ID       = XL045-EMP-ID                  01900077
019100             ADD  1  TO PA-TOT-MATCH-NO-CHG                       01910052
019200             PERFORM 8000-READ-EXT-FILE                           01920052
019300             PERFORM 8010-READ-USR-FILE                           01930052
019400         ELSE                                                     01940000
019500             INITIALIZE XL038-TRANS-REC                           01950051
019600             ADD  1  TO PA-TOT-MATCH-WITH-CHG                     01960052
019700             SET XL038-MODIFY                                     01970051
019800                 XL038-USR                                        01980051
019900                 XL038-USR-UPD  TO TRUE                           01990051
020000             MOVE XI001-EMPLOYEE-USER-ID   TO XL038-U-USR-ID      02000077
020100             MOVE XI001-LAST-NAME          TO XL038-U-LAST-NM     02010077
020200             MOVE XI001-FIRST-NAME         TO XL038-U-FRST-NM     02020077
020300             MOVE XI001-MIDDLE-INIT        TO XL038-U-MID-INIT    02030077
020400             MOVE XI001-USR-RVKE-IND       TO XL038-U-RVKE-IND    02040077
020500             MOVE XI001-DFLT-PRTR-ID       TO XL038-U-DFLT-PRTR-ID02050083
020600             MOVE XI001-EMP-ID             TO XL038-U-EMP-ID      02060077
020700                                                                  02070000
020800             PERFORM 9000-WRITE-OUTPUT-REC                        02080000
020900             ADD 1 TO PA-TOT-OUTRECS-MOD                          02090051
021000                                                                  02100000
021100             PERFORM 8000-READ-EXT-FILE                           02110051
021200             PERFORM 8010-READ-USR-FILE                           02120052
021300         END-IF                                                   02130052
021400     END-IF.                                                      02140051
021500                                                                  02150051
021600* COMPARE TO SEARCH FOR ADDS                                      02160051
021700     IF XI001-EMPLOYEE-USER-ID < XL045-USR-ID                     02170077
021800         PERFORM 2010-PROCESS-ADDS                                02180052
021900     END-IF.                                                      02190052
022000                                                                  02200051
022100* COMPARE TO SEARCH FOR DELETES                                   02210051
022200     IF XI001-EMPLOYEE-USER-ID > XL045-USR-ID                     02220077
P42541         IF CC-WEEKLY-INTEGRITY                                   02221085
P42541            PERFORM 8010-READ-USR-FILE                            02222085
P42541         ELSE                                                     02223085
P42541            PERFORM 2020-PROCESS-DELETES                          02230086
P42541         END-IF                                                   02231085
022400     END-IF.                                                      02240051
022500                                                                  02250000
022600******************************************************************02260000
022700 2010-PROCESS-ADDS.                                               02270052
022800     MOVE '2010-PROCESS-ADDS             ' TO PV-PARAGRAPH-NAME.  02280052
022900                                                                  02290000
023000     INITIALIZE XL038-TRANS-REC.                                  02300051
023100                                                                  02310051
023200     SET XL038-ADD                                                02320051
023300         XL038-USR                                                02330051
023400         XL038-USR-ADD  TO TRUE                                   02340051
023500     MOVE XI001-EMPLOYEE-USER-ID   TO XL038-U-USR-ID              02350077
023600     MOVE XI001-LAST-NAME          TO XL038-U-LAST-NM             02360077
023700     MOVE XI001-FIRST-NAME         TO XL038-U-FRST-NM             02370077
023800     MOVE XI001-MIDDLE-INIT        TO XL038-U-MID-INIT            02380077
023900     MOVE XI001-USR-RVKE-IND       TO XL038-U-RVKE-IND            02390077
024000     MOVE XI001-DFLT-PRTR-ID       TO XL038-U-DFLT-PRTR-ID        02400083
024100     MOVE XI001-EMP-ID             TO XL038-U-EMP-ID              02410077
024200                                                                  02420000
024300     PERFORM 9000-WRITE-OUTPUT-REC.                               02430000
024400     ADD 1 TO PA-TOT-OUTRECS-ADD.                                 02440051
024500                                                                  02450000
024510     IF PS-EOF-EXT-NO                                             02451063
024600        PERFORM 8000-READ-EXT-FILE                                02460063
024610     END-IF.                                                      02461063
024700                                                                  02470000
024800******************************************************************02480051
024900 2020-PROCESS-DELETES.                                            02490052
025000     MOVE '2020-PROCESS-DELETES          ' TO PV-PARAGRAPH-NAME.  02500052
025100                                                                  02510051
025200     INITIALIZE XL038-TRANS-REC.                                  02520051
025300                                                                  02530051
025400     SET XL038-DELETE                                             02540051
025500         XL038-USR                                                02550051
025600         XL038-USR-DLT  TO TRUE.                                  02560058
025700     MOVE XL045-USR-ID             TO XL038-U-USR-ID.             02570067
025800     MOVE XL045-USR-LAST-NM        TO XL038-U-LAST-NM.            02580067
025900     MOVE XL045-USR-FRST-NM        TO XL038-U-FRST-NM.            02590067
026000     MOVE XL045-USR-MID-INIT       TO XL038-U-MID-INIT.           02600067
026100     MOVE XL045-USR-RVKE-IND       TO XL038-U-RVKE-IND.           02610067
026200     MOVE XI001-DFLT-PRTR-ID       TO XL038-U-DFLT-PRTR-ID.       02620083
026300     MOVE XL045-EMP-ID             TO XL038-U-EMP-ID.             02630067
026400                                                                  02640051
026500     PERFORM 9000-WRITE-OUTPUT-REC.                               02650051
026600     ADD 1 TO PA-TOT-OUTRECS-DEL.                                 02660051
026700                                                                  02670051
026710     IF PS-EOF-DB2-NO                                             02671063
026800        PERFORM 8010-READ-USR-FILE                                02680063
026810     END-IF.                                                      02681063
026900                                                                  02690051
027000******************************************************************02700000
027100*            I N P U T   F I L E   R E A D S                     *02710000
027200******************************************************************02720000
027300 8000-READ-EXT-FILE.                                              02730051
027400     MOVE '8000-READ-EXT-FILE            ' TO PV-PARAGRAPH-NAME.  02740051
027500                                                                  02750000
027510     INITIALIZE XI001-FORMATTED-OUTPUT-RECORD.                    02751077
027600     READ COMMON-EXTRACT-FILE INTO XI001-FORMATTED-OUTPUT-RECORD  02760077
027700       AT END                                                     02770000
027800         SET PS-EMPTY-FILE-YES                                    02780068
027900             PS-EOF-EXT-YES    TO TRUE                            02790069
028000         MOVE '99999999'       TO XI001-EMPLOYEE-USER-ID          02800077
028001     END-READ.                                                    02800169
028010                                                                  02801068
028100     IF PS-EOF-EXT-NO                                             02810051
028200        ADD 1 TO PA-TOT-EXT-RECS-READ                             02820051
028300     END-IF.                                                      02830051
028400                                                                  02840051
028500******************************************************************02850000
028600 8010-READ-USR-FILE.                                              02860051
028700     MOVE '8010-READ-USR-FILE            ' TO PV-PARAGRAPH-NAME.  02870051
028800                                                                  02880000
028810     INITIALIZE XL045-RECORD.                                     02881068
028900     READ XLT-USR-UNLOAD-FILE INTO XL045-RECORD                   02890064
029000       AT END                                                     02900000
029100         SET PS-EOF-DB2-YES TO TRUE                               02910069
029210         MOVE '99999999'    TO XL045-USR-ID                       02921069
029211     END-READ.                                                    02921169
029220                                                                  02922068
029300     IF PS-EOF-DB2-NO                                             02930051
029400        ADD 1 TO PA-TOT-XLT-RECS-READ                             02940057
029500     END-IF.                                                      02950051
029510                                                                  02951072
029700******************************************************************02970000
029800 9000-WRITE-OUTPUT-REC.                                           02980000
029900                                                                  02990000
029910     IF CC-DAILY-MAINT                                            02991079
030000        WRITE OUTPUT-REC FROM XL038-TRANS-REC                     03000079
030010        ADD 1 TO PA-TOT-OUTRECS-WRITTEN                           03001079
030020     END-IF.                                                      03002079
030100                                                                  03010000
030200     IF CC-WEEKLY-INTEGRITY                                       03020051
030210        IF  XL038-DELETE                                          03021078
030220        AND XL038-U-RVKE-IND = PC-Y                               03022078
030230            ADD 1 TO PA-TOT-RVKED-DELS                            03023081
030240        ELSE                                                      03024078
030300            MOVE 4094 TO RETURN-CODE                              03030078
030301            WRITE OUTPUT-REC FROM XL038-TRANS-REC                 03030179
030302            ADD 1 TO PA-TOT-OUTRECS-WRITTEN                       03030279
030310        END-IF                                                    03031078
030400     END-IF.                                                      03040000
030500                                                                  03050051
030700                                                                  03070000
030800******************************************************************03080000
030900*                 E N D   O F   J O B                            *03090000
031000******************************************************************03100000
031100 9500-TERMINATE.                                                  03110059
031200     MOVE '9500-TERMINATE                ' TO PV-PARAGRAPH-NAME.  03120059
031300                                                                  03130000
031400*CLOSE OUTPUT FILE                                                03140051
031500     CLOSE OUTPUT-FILE.                                           03150000
031600                                                                  03160051
031700*DISPLAY SUMMARY STATISTICS                                       03170051
031800     DISPLAY ' '.                                                 03180000
031900     DISPLAY '*************************************'.             03190051
032000     DISPLAY '**      XLKUT070 SUMMARY STATS     **'.             03200051
032100     DISPLAY '*************************************'.             03210051
032200     DISPLAY ' '.                                                 03220000
032300     DISPLAY 'TOTAL EXTRACT RECS READ:    ' PA-TOT-EXT-RECS-READ. 03230051
032400     DISPLAY 'TOTAL XLT_USR RECS READ:    ' PA-TOT-XLT-RECS-READ. 03240057
032500     DISPLAY ' '.                                                 03250051
032600     DISPLAY 'TOTAL MATCHES - NO CHANGES: ' PA-TOT-MATCH-NO-CHG.  03260051
032700     DISPLAY 'TOTAL MATCHES - W/ CHANGES: ' PA-TOT-MATCH-WITH-CHG.03270051
032800     DISPLAY ' '.                                                 03280000
032900     DISPLAY 'TOTAL XLT_USR ADDS:         ' PA-TOT-OUTRECS-ADD.   03290051
033000     DISPLAY 'TOTAL XLT_USR MODS:         ' PA-TOT-OUTRECS-MOD.   03300051
033100     DISPLAY 'TOTAL XLT_USR DELS:         ' PA-TOT-OUTRECS-DEL.   03310051
033200     DISPLAY '-'.                                                 03320051
033300     DISPLAY 'TOTAL OUTPUT RECS WRITTEN : ' PA-TOT-OUTRECS-WRITTEN03330080
033310     DISPLAY 'TOTAL REVOKED IGNORED DELS: ' PA-TOT-RVKED-DELS.    03331080
033400     DISPLAY ' '.                                                 03340051
033500     DISPLAY '*************************************'.             03350051
033600                                                                  03360000
033700******************************************************************03370059
033800*                 A B E N D    R O U T I N E                     *03380059
033900******************************************************************03390059
034000 9999-ABEND.                                                      03400059
034100                                                                  03410059
034200     DISPLAY '***************'.                                   03420059
034300     DISPLAY '** ABEND     **'.                                   03430059
034400     DISPLAY '** PROGRAM   ** = ' PC-PROGRAM-NAME.                03440059
034500     DISPLAY '** PARAGRAPH ** = ' PV-PARAGRAPH-NAME.              03450059
034600     DISPLAY '**********************************************'.    03460059
034610     DISPLAY '* !!!!! COMMON EXTRACT FILE IS EMPTY !!!!!   *'.    03461059
034620     DISPLAY '**********************************************'.    03462059
034700                                                                  03470059
034900     CALL 'ILBOABN0' USING ABEND-CODE.                            03490059
035000                                                                  03500059
035100******************************************************************03510000
035200*                 E N D   O F   P R O G R A M                    *03520059
035300******************************************************************03530000
