000100***************************************************************** 00010001
000200 IDENTIFICATION DIVISION.                                         00020001
000300***************************************************************** 00030001
000400 PROGRAM-ID.    XLKUT020.                                         00040001
000500 AUTHOR.        AL PETERS.                                        00050001
000600 INSTALLATION.  KOHLS.                                            00060001
000700 DATE-WRITTEN   JANUARY 2003.                                     00070001
000800 DATE-COMPILED.                                                   00080001
000900***************************************************************** 00090001
001000*  THIS PROGRAM WILL COMPARE THE VSM UPC TO THE LOGISTIC        * 00100001
001100*  DOMAIN UPC RECORDS.                                          *       01
001400***************************************************************** 00140001
001500 ENVIRONMENT DIVISION.                                            00150001
001600 INPUT-OUTPUT SECTION.                                            00160001
001700                                                                  00170001
001800 FILE-CONTROL.                                                    00180001
001900                                                                  00190001
002000     SELECT VSM-UPC-FILE                                          00200001
002010         ASSIGN TO INP01.                                         00201001
002100                                                                  00210001
002110     SELECT LOGISTIC-UPC-FILE                                     00200001
002120         ASSIGN TO INP02.                                               01
002130                                                                  00210001
002140     SELECT ERROR-FILE                                                  01
002150         ASSIGN TO OUT01.                                               01
002160                                                                  00210001
002200***************************************************************** 00220001
002300 DATA DIVISION.                                                   00230001
002400***************************************************************** 00240001
002500 FILE SECTION.                                                    00250001
002600                                                                  00260001
002700 FD  VSM-UPC-FILE                                                 00270001
002800     RECORDING MODE IS F                                          00280001
002810     BLOCK CONTAINS 0 RECORDS                                     00281001
002900     LABEL RECORDS ARE STANDARD.                                  00290001
003000                                                                  00300001
003300 01  VSM-UPC-RECORD               PIC X(150).                     00330001
003700                                                                  00370001
003710 FD  LOGISTIC-UPC-FILE                                            00270001
003720     RECORDING MODE IS F                                          00280001
003730     BLOCK CONTAINS 0 RECORDS                                     00281001
003740     LABEL RECORDS ARE STANDARD.                                  00290001
003750                                                                  00300001
003760 01  LOGISTIC-UPC-RECORD          PIC X(150).                     00330001
003770                                                                  00370001
003800                                                                  00380001
003810 FD  ERROR-FILE                                                         01
003820     RECORDING MODE IS F                                          00280001
003830     BLOCK CONTAINS 0 RECORDS                                     00281001
003840     LABEL RECORDS ARE STANDARD.                                  00290001
003850                                                                  00300001
003860 01  ERROR-RECORD                 PIC X(150).                     00330001
003870                                                                  00370001
003880                                                                  00380001
203900***************************************************************** 00390001
004000 WORKING-STORAGE SECTION.                                         00400001
004100                                                                  00410001
004200 01  PS-PROGRAM-SWITCHES.                                         00420001
004300     05  PS-EOF-INPUT1-SW             PIC X(01)  VALUE 'N'.       00430001
004400         88  PS-EOF-INPUT1-YES                   VALUE 'Y'.       00440001
004500         88  PS-EOF-INPUT1-NO                    VALUE 'N'.       00450001
004510     05  PS-EOF-INPUT2-SW             PIC X(01)  VALUE 'N'.       00430001
004520         88  PS-EOF-INPUT2-YES                   VALUE 'Y'.       00440001
004530         88  PS-EOF-INPUT2-NO                    VALUE 'N'.       00450001
           05  PS-EMAIL-SW                  PIC X(01)  VALUE 'N'.               
               88  PS-EMAIL-YES                        VALUE 'Y'.               
               88  PS-EMAIL-NO                         VALUE 'N'.               
004600                                                                  00460001
004700 01  PC-PROGRAM-CONSTANTS.                                        00470001
004800     05  PC-PROGRAM-NAME              PIC  X(08) VALUE 'XLKUT020'.00480001
005000                                                                  00500001
005100 01  PV-PROGRAM-VARIABLES.                                        00510001
005900     05  PV-RECORDS-READ-1            PIC  9(09) VALUE  0.        00590001
005910     05  PV-RECORDS-READ-2            PIC  9(09) VALUE  0.        00590001
006000     05  PV-RECORDS-WRITTEN           PIC  9(09) VALUE  0.        00600001
006700     05  PV-SQLCODE                   PIC  S9(9) VALUE +0.        00670003
006800     05  PV-DISP-SQLCODE              PIC ZZZZZZ9-.               00680001
006900                                                                  00690001
007000                                                                  00700001
007100 01  PV-ABEND-FIELDS.                                             00710001
007200     05  PV-ABEND-CODE                PIC  S9(4) VALUE +0         00720001
007300                                                 COMP SYNC.       00730001
007400     05  PV-ABEND-PROGRAM             PIC  X(08) VALUE 'XLKUT020'.00740001
007500     05  PV-ABEND-PARAGRAPH           PIC  X(50) VALUE SPACES.    00750001
007600     05  PV-ABEND-OPERATION           PIC  X(50) VALUE SPACES.    00760001
007700     05  PV-ABEND-TABLE               PIC  X(12) VALUE SPACES.    00770005
007900     05  PV-DB2-OPERATION-MESSAGE-1   PIC  X(79) VALUE SPACES.    00790001
008000     05  PV-DB2-OPERATION-MESSAGE-2   PIC  X(79) VALUE SPACES.    00800001
008100     05  PV-DB2-OPERATION-MESSAGE-3   PIC  X(79) VALUE SPACES.    00810001
008200                                                                  00820001
008300 01  PV-VSM-INPUT.                                                        
009206     COPY XLRD010.                                                00870001
009300                                                                  00880001
009400 01  PV-LOGISTIC-INPUT.                                                   
009500     COPY XLRD010.                                                00870001
009600                                                                  00880001
010800***************************************************************** 01080001
010900 PROCEDURE DIVISION.                                              01090001
011000***************************************************************** 01100001
011100     DISPLAY '**** BEGINNING XLKUT020 ****'.                      01110001
011200     DISPLAY ' '.                                                 01120001
011300                                                                  01130001
011400     OPEN INPUT  VSM-UPC-FILE                                     01140001
011401                 LOGISTIC-UPC-FILE                                01140001
011410          OUTPUT ERROR-FILE.                                            01
011500                                                                  01150001
           SET PS-EMAIL-NO      TO TRUE.                                        
                                                                                
011600     PERFORM 1000-READ-VSM-INPUT.                                 01160001
011610     PERFORM 1100-READ-LOGISTIC-INPUT.                            01160001
011700                                                                  01170001
012100     PERFORM 2000-PROCESS-INPUT-FILE                              01210001
012200       UNTIL PS-EOF-INPUT1-YES AND                                      01
012210             PS-EOF-INPUT2-YES.                                         01
012300                                                                  01230001
012310     CLOSE VSM-UPC-FILE                                                 01
012320           LOGISTIC-UPC-FILE                                            01
012330           ERROR-FILE.                                                  01
012500                                                                  01250001
012600     DISPLAY '  INPUT VSM UPC RECS     = ' PV-RECORDS-READ-1.     01260001
012610     DISPLAY '  INPUT DOMAIN UPC RECS  = ' PV-RECORDS-READ-2.           01
012700     DISPLAY '  OUTPUT RECORDS WRITTEN = ' PV-RECORDS-WRITTEN.          01
012800     DISPLAY ' '.                                                 01280001
012900     DISPLAY '****  END OF  XLKUT020  ****'.                      01290001
013000                                                                  01300001
      *    SET RETURN CODE IF E-MAIL SWITCH IS TRUE.                            
           IF PS-EMAIL-YES                                                      
               MOVE 4095 TO RETURN-CODE                                         
           END-IF.                                                              
                                                                                
013100     GOBACK.                                                      01310001
013200                                                                  01320001
013300                                                                  01330001
013400***************************************************************** 01340001
013500*  READ A VSM UPC   RECORD                                        01350003
013600***************************************************************** 01360001
013700 1000-READ-VSM-INPUT.                                             01370001
013800                                                                  01380001
013900     MOVE '1000-READ-INPUT-FILE    ' TO PV-ABEND-PARAGRAPH.       01390001
014000                                                                  01400001
014010     INITIALIZE PV-VSM-INPUT.                                     01401003
014020                                                                  01402003
014100     READ VSM-UPC-FILE                                            01410004
014200          INTO PV-VSM-INPUT                                             01
014300            AT END                                                01430001
014400               SET PS-EOF-INPUT1-YES TO TRUE                            01
014900     END-READ.                                                    01490001
015000                                                                  01500001
015010     IF PS-EOF-INPUT1-YES                                                 
015020        CONTINUE                                                          
015030     ELSE                                                                 
015040        ADD +1 TO PV-RECORDS-READ-1                                       
015050     END-IF.                                                              
015100                                                                  01510001
015101***************************************************************** 01340001
015102*  READ A LOGISTIC DOMAIN UPC RECORD                              01350003
015103***************************************************************** 01360001
015104 1100-READ-LOGISTIC-INPUT.                                        01370001
015105                                                                  01380001
015106     MOVE '1100-READ-LOGISTIC-INPUT' TO PV-ABEND-PARAGRAPH.       01390001
015107                                                                  01400001
015108     INITIALIZE PV-LOGISTIC-INPUT.                                01401003
015109                                                                  01402003
015110     READ LOGISTIC-UPC-FILE                                             04
015111          INTO PV-LOGISTIC-INPUT                                        01
015112            AT END                                                01430001
015113               SET PS-EOF-INPUT2-YES TO TRUE                            01
015114     END-READ.                                                    01490001
015115                                                                  01500001
015116     IF PS-EOF-INPUT2-YES                                                 
015117        CONTINUE                                                          
015118     ELSE                                                                 
015119        ADD +1 TO PV-RECORDS-READ-2                                       
015120     END-IF.                                                              
015130                                                                  01510001
015200***************************************************************** 01520001
015300*  REFORMAT THE VSM UPC EXTRACT FILE                            * 01530003
015400***************************************************************** 01540001
015500 2000-PROCESS-INPUT-FILE.                                         01550001
015600                                                                  01560001
015700     MOVE '2000-PROCESS-INPUT-FILE ' TO PV-ABEND-PARAGRAPH.       01570001
015800                                                                  01580001
015010     IF PS-EOF-INPUT1-YES                                                 
             AND PS-EOF-INPUT2-NO                                               
016102          PERFORM 2150-WRITE-LOGISTIC-ERROR                               
016020          PERFORM 1100-READ-LOGISTIC-INPUT                                
           END-IF.                                                              
                                                                                
015010     IF PS-EOF-INPUT2-YES                                                 
             AND PS-EOF-INPUT1-NO                                               
016010          PERFORM 2100-WRITE-VSM-ERROR                                    
016110          PERFORM 1000-READ-VSM-INPUT                                     
           END-IF.                                                              
                                                                                
           IF PS-EOF-INPUT1-NO                                                  
             AND PS-EOF-INPUT2-NO                                               
                PERFORM 2001-PROCESS-INPUT-FILE                                 
           END-IF.                                                              
                                                                                
015400***************************************************************** 01540001
015500 2001-PROCESS-INPUT-FILE.                                         01550001
015600                                                                  01560001
015700     MOVE '2001-PROCESS-INPUT-FILE ' TO PV-ABEND-PARAGRAPH.       01570001
                                                                                
015900     IF XL010-UPC-ID  OF PV-VSM-INPUT <                                   
016000        XL010-UPC-ID  OF PV-LOGISTIC-INPUT                                
016001*       ON VSM NOT ON DOMAIN                                              
016010           PERFORM 2100-WRITE-VSM-ERROR                                   
016020           PERFORM 1000-READ-VSM-INPUT                                    
016030     ELSE                                                                 
016040        IF XL010-UPC-ID  OF PV-VSM-INPUT =                                
016050           XL010-UPC-ID  OF PV-LOGISTIC-INPUT                             
016051*       ON VSM AND ON DOMAIN                                              
016060              IF XL010-DATA OF PV-VSM-INPUT =                             
016070                 XL010-DATA OF PV-LOGISTIC-INPUT                          
016080                    PERFORM 1000-READ-VSM-INPUT                           
016090                    PERFORM 1100-READ-LOGISTIC-INPUT                      
016091              ELSE                                                        
016092*       BUT SOMETHING DOESNT MATCH                                        
016093                 PERFORM 2100-WRITE-VSM-ERROR                             
016094                 PERFORM 2150-WRITE-LOGISTIC-ERROR                        
016095                 PERFORM 1000-READ-VSM-INPUT                              
016096                 PERFORM 1100-READ-LOGISTIC-INPUT                         
016097              END-IF                                                      
016098        ELSE                                                              
016099           IF XL010-UPC-ID  OF PV-VSM-INPUT >                             
016100              XL010-UPC-ID  OF PV-LOGISTIC-INPUT                          
016101*       ON DOMAIN NOT ON VSM                                              
016102                PERFORM 2150-WRITE-LOGISTIC-ERROR                         
016110                PERFORM 1100-READ-LOGISTIC-INPUT                          
016120           END-IF                                                         
016130        END-IF                                                            
016140     END-IF.                                                              
016200                                                                          
021600***************************************************************** 02160001
021700*  WRITE A VSM RECORD TO THE ERROR FILE                                 03
021800***************************************************************** 02180001
021900 2100-WRITE-VSM-ERROR.                                            02190003
022000                                                                  02200001
022010     WRITE ERROR-RECORD FROM                                            07
022020         PV-VSM-INPUT                                                   07
022030     END-WRITE.                                                   03940007
024400     ADD +1                 TO PV-RECORDS-WRITTEN.                        
                                                                                
      *    SET SWITCH FOR E-MAIL NOTIFICATION OF ERRORS.                        
           SET PS-EMAIL-YES       TO TRUE.                                      
027200                                                                  02720001
027300***************************************************************** 02160001
027400*  WRITE A LOGISTIC DOMAIN RECORD TO THE ERROR FILE                     03
027500***************************************************************** 02180001
027600 2150-WRITE-LOGISTIC-ERROR.                                             03
027700                                                                  02200001
027800     WRITE ERROR-RECORD FROM                                            07
027900         PV-LOGISTIC-INPUT                                              07
028000     END-WRITE.                                                   03940007
028100     ADD +1                 TO PV-RECORDS-WRITTEN.                        
028200                                                                  02720001
      *    SET SWITCH FOR E-MAIL NOTIFICATION OF ERRORS.                        
           SET PS-EMAIL-YES       TO TRUE.                                      
