000100 IDENTIFICATION DIVISION.                                         00010002
000200 PROGRAM-ID.    XLKUT032.                                         00020002
000300 AUTHOR.        RON KRIER.                                        00030002
000400 INSTALLATION.  KOHLS.                                            00040002
000500 DATE-WRITTEN   MARCH 29, 2003.                                   00050002
000600 DATE-COMPILED.                                                   00060002
000700                                                                  00070002
000800* ************************************************************** *00080002
000900* * XLKUT032.  "PURCHASE ORDER DOMAIN INTEGRITY"               * *00090002
001000* *                                                            * *00100002
001100* * PURPOSE:                                                   * *00110002
001200* * THIS PROGRAM CREATES AN EXTRACT FILE FROM: TPOPRPK.        * *00120002
001300* * THIS EXTRACT FILE CONSISTS OF ROWS ELIGIBLE TO BE TO PART  * *00130002
001400* * OF THE INTEGRITY PROCESS BETWEEN THE RMS PURCHASE ORDER    * *00140002
001500* * SYSTEM AND THE LOGISTICS DOMAIN PURCHASE ORDER TABLES.     * *00150002
001600* *                                                            * *00160002
001700* * PROCESSING OVERVIEW:                                       * *00170002
001800* *   THIS PROGRAM WILL READ THE INPUT DRIVER FILE AND THEN    * *00180002
001900* *   PERFORM A SELECT ON THE TPOPRPK TABLE.  DATA RETRIEVED   * *00190002
002000* *   FROM THE SELECT WILL THEN BE WRITTEN TO THE OUTPUT FILE. * *00200002
002100**************************************************************** *00210002
002200 ENVIRONMENT DIVISION.                                            00220002
002300 CONFIGURATION SECTION.                                           00230002
002400 SOURCE-COMPUTER.        IBM-3090.                                00240002
002500 OBJECT-COMPUTER.        IBM-3090.                                00250002
002600                                                                  00260002
002700 INPUT-OUTPUT SECTION.                                            00270002
002800 FILE-CONTROL.                                                    00280002
002900                                                                  00290002
003000     SELECT IN-DRIVER-FILE                ASSIGN TO IN01.         00300002
003100     SELECT OUT-EXTRACT-FILE              ASSIGN TO OUT01.        00310002
003200                                                                  00320002
003300******************************************************************00330002
003400 DATA DIVISION.                                                   00340002
003500 FILE SECTION.                                                    00350002
003600                                                                  00360002
003700 FD  IN-DRIVER-FILE                                               00370002
003800     RECORDING MODE IS F                                          00380002
003900     LABEL RECORDS ARE STANDARD                                   00390002
004000     BLOCK CONTAINS 0 RECORDS.                                    00400002
004100 01  IN-DRIVER-RECORD                PIC  X(030).                 00410002
004200                                                                  00420002
004300**** TPOPRPK:                                                     00430002
004400 FD  OUT-EXTRACT-FILE                                             00440002
004500     RECORDING MODE IS F                                          00450002
004600     LABEL RECORDS ARE STANDARD                                   00460002
004700     BLOCK CONTAINS 0 RECORDS.                                    00470002
004800 01  OUT-EXTRACT-RECORD              PIC  X(104).                 00480002
004900                                                                  00490002
005000                                                                  00500002
005100                                                                  00510002
005200 WORKING-STORAGE SECTION.                                         00520002
005300                                                                  00530002
005400 01  PC-PROGRAM-CONSTANTS.                                        00540002
005500     05  PC-CURRENT-PROGRAM-NAME     PIC X(08) VALUE 'XLKUT032'.  00550002
005600     05  PC-PGM-PROGRESS-DESC.                                    00560002
005700         10  PC-BEGINNING            PIC X(09) VALUE 'BEGINNING'. 00570002
005800         10  PC-CONTINUING           PIC X(10) VALUE              00580002
005900                                               'CONTINUING'.      00590002
006000         10  PC-ENDING               PIC X(06) VALUE 'ENDING'.    00600002
006100         10  PC-ABENDING             PIC X(08) VALUE 'ABENDING'.  00610002
006200     05  PC-ABEND-INFO.                                           00620002
006300         10  PC-ABEND                PIC X(11) VALUE              00630002
006400                                               '** ABEND **'.     00640002
006500         10  PC-ABEND-MSG-PARA       PIC X(15) VALUE              00650002
006600                                               '- PARA       : '. 00660002
006700         10  PC-ABEND-MSG-DISPLAY-PARA                            00670002
006800                                     PIC X(15) VALUE              00680002
006900                                               '  CALLED PARA: '. 00690002
007000         10  PC-ABEND-MSG-NUMBER     PIC X(15) VALUE              00700002
007100                                               '  FOR ABEND# : '. 00710002
007200         10  PC-ABEND-MSG-DESC       PIC X(15) VALUE              00720002
007300                                               '- ERROR IS   : '. 00730002
007400         10  PC-ABEND-MSG-INDENT-15  PIC X(15) VALUE SPACES.      00740002
007500         10  PC-ABEND-MSG-ACTION     PIC X(15) VALUE              00750002
007600                                               '- ACTION     : '. 00760002
007700     05  PC-HOW-OFTEN-TO-DISPLAY     PIC 9(9)  VALUE 5000.        00770002
007800                                                                  00780002
007900 01  PS-PROGRAM-SWITCHES.                                         00790002
008000     05  PS-IN-DRIVER-EOF-SW         PIC X(01) VALUE 'N'.         00800002
008100         88  PS-IN-DRIVER-EOF                  VALUE 'Y'.         00810002
008200         88  PS-IN-DRIVER-NOT-EOF              VALUE 'N'.         00820002
008300     05  PS-CURSOR-HAS-DATA-SW       PIC X(01) VALUE 'N'.         00830002
008400         88  PS-CURSOR-HAS-DATA                VALUE 'Y'.         00840002
008500         88  PS-CURSOR-HAS-NO-DATA             VALUE 'N'.         00850002
008600     05  PS-TABLE-LOOP-DONE-SW       PIC X(01) VALUE 'N'.         00860002
008700         88  PS-TABLE-LOOP-DONE                VALUE 'Y'.         00870002
008800         88  PS-TABLE-LOOP-NOT-DONE            VALUE 'N'.         00880002
008900                                                                  00890002
009000 01  PV-PROGRAM-VARIABLES.                                        00900002
009100     05  PV-PO-NBR-COMP              PIC S9(9) VALUE 0 COMP.      00910002
009200     05  PV-PO-NBR-NUM               PIC  9(9) VALUE 0.           00920002
009300     05  PV-IN-DRIVER-RECS-READ-CNT  PIC  9(9) VALUE 0.           00930002
009400     05  PV-RECS-WITH-MATCHES-CNT    PIC  9(9) VALUE 0.           00940002
009500     05  PV-TABLE-ROW-SELECT-CNT     PIC  9(9) VALUE 0.           00950002
009600     05  PV-EXTRACT-WRITTEN-CNT      PIC  9(9) VALUE 0.           00960002
009700                                                                  00970002
009800     05  PV-PARAGRAPH-NAME           PIC X(30) VALUE SPACES.      00980002
009900     05  PV-DB2-OPERATION-MSG-1      PIC X(79) VALUE SPACES.      00990002
010000     05  PV-DB2-TABLE-NAME           PIC X(18) VALUE SPACES.      01000002
010100     05  PV-DISPLAY-NTH-MULTIPLE     PIC 9(9)  VALUE 0.           01010002
010200     05  PV-DISPLAY-NTH-REMAINDER    PIC 9(9)  VALUE 0.           01020002
010300     05  PV-SQLCODE                  PIC +999  VALUE ZERO.        01030002
010400                                                                  01040002
010500     05  PV-TMST                     PIC X(26) VALUE SPACES.      01050002
010600     05  PV-TIMESTAMP-DETAIL                                      01060002
010700         REDEFINES                                                01070002
010800         PV-TMST.                                                 01080002
010900         10  PV-TIMESTAMP-19.                                     01090002
011000             15  PV-TMS-DATE.                                     01100002
011100                 20  PV-TMS-YEAR.                                 01110002
011200                     25  PV-TMS-CC   PIC X(02).                   01120002
011300                     25  PV-TMS-YY   PIC X(02).                   01130002
011400                 20  FILLER          PIC X(01).                   01140002
011500                 20  PV-TMS-MONTH    PIC X(02).                   01150002
011600                 20  FILLER          PIC X(01).                   01160002
011700                 20  PV-TMS-DAY      PIC X(02).                   01170002
011800             15  FILLER              PIC X(01).                   01180002
011900             15  PV-TMS-HOUR         PIC X(02).                   01190002
012000             15  FILLER              PIC X(01).                   01200002
012100             15  PV-TMS-MINUTE       PIC X(02).                   01210002
012200             15  FILLER              PIC X(01).                   01220002
012300             15  PV-TMS-SECOND       PIC X(02).                   01230002
012400         10  FILLER                  PIC X(01).                   01240002
012500         10  PV-TMS-MSECOND          PIC X(06).                   01250002
012600                                                                  01260002
012700 01  DM-DISPLAY-MESSAGE.                                          01270002
012800     05  DM-01-10.                                                01280002
012900         10  DM-PROGRAM              PIC X(08) VALUE SPACE.       01290002
013000         10  FILLER                  PIC X(02) VALUE ': '.        01300002
013100     05  DM-11-80.                                                01310002
013200         10  FILLER                  PIC X(37) VALUE              01320002
013300                        'SELECT ROWS MATCHING PO DRIVER FILE, '.  01330002
013400         10  FILLER                  PIC X(30) VALUE              01340002
013500                        'CREATING TPOPRPK EXTRACT FILE.'.         01350002
013600         10  FILLER                  PIC X(01) VALUE SPACE.       01360002
013700         10  FILLER                  PIC X(01) VALUE ALL '*'.     01370002
013800     05  DM-81-120.                                               01380002
013900         10  FILLER                  PIC X(40) VALUE ALL '*'.     01390002
014000                                                                  01400002
014100 01  DP-DISPLAY-PROGRESS-MSG.                                     01410002
014200     05  DP-PROGRAM                  PIC X(08) VALUE SPACE.       01420002
014300     05  FILLER                      PIC X(02) VALUE SPACE.       01430002
014400     05  DP-STATUS-DESCRIPTION       PIC X(10) VALUE SPACE.       01440002
014500     05  FILLER                      PIC X(04) VALUE ' AT '.      01450002
014600     05  DP-TIMESTAMP-19             PIC X(19) VALUE SPACE.       01460002
014700     05  FILLER                      PIC X(03) VALUE '.  '.       01470002
014800     05  FILLER                      PIC X(03) VALUE              01480002
014900                                         'IN:'.                   01490002
015000     05  DP-IN-CNT                   PIC ZZZ,ZZZ,ZZ9              01500002
015100                                               VALUE ZERO.        01510002
015200     05  FILLER                      PIC X(02) VALUE ', '.        01520002
015300*    05  FILLER                      PIC X(16) VALUE              01530002
015400*                                        'DRIVER W/ROW(S):'.      01540002
015500*    05  DP-MATCHES-FOUND-CNT        PIC ZZZ,ZZZ,ZZ9              01550002
015600*                                              VALUE ZERO.        01560002
015700*    05  FILLER                      PIC X(02) VALUE ', '.        01570002
015800     05  FILLER                      PIC X(14) VALUE              01580002
015900                                         'ROWS SELECTED:'.        01590002
016000     05  DP-ROWS-SELECTED-CNT        PIC ZZZ,ZZZ,ZZ9              01600002
016100                                               VALUE ZERO.        01610002
016200     05  FILLER                      PIC X(02) VALUE ', '.        01620002
016300     05  FILLER                      PIC X(04) VALUE              01630002
016400                                         'OUT:'.                  01640002
016500     05  DP-OUT-CNT                  PIC ZZZ,ZZZ,ZZ9              01650002
016600                                               VALUE ZERO.        01660002
016700     05  FILLER                      PIC X(01) VALUE '.'.         01670002
016800                                                                  01680002
016900 01  ABEND-CODE                      PIC S9(04)                   01690002
017000                                               VALUE ZEROES       01700002
017100                                               COMP SYNC.         01710002
017200                                                                  01720002
017300*---------------------------------------------------------------* 01730002
017400*  DB2 FORMATTED MESSAGE AREA                                     01740002
017500*---------------------------------------------------------------* 01750002
017600     COPY DPWS004.                                                01760002
017700                                                                  01770002
017800                                                                  01780002
017900*---------------------------------------------------------------* 01790002
018000*  XLRD013  - RECORD LAYOUT FOR PO DRIVER FILE, INPUT.          * 01800002
018100*---------------------------------------------------------------* 01810002
018200     COPY XLRD013.                                                01820002
018300                                                                  01830002
018400                                                                  01840002
018500*---------------------------------------------------------------* 01850002
018600*    DB2 AREA FOR TPOPRPK                                       * 01860002
018700*---------------------------------------------------------------* 01870002
018800     EXEC SQL                                                     01880002
018900          INCLUDE TPOPRPK                                         01890002
019000     END-EXEC.                                                    01900002
019100                                                                  01910002
019200*---------------------------------------------------------------* 01920002
019300*    DB2 AREA FOR COMMUNICATIONS                                * 01930002
019400*---------------------------------------------------------------* 01940002
019500     EXEC SQL                                                     01950002
019600          INCLUDE SQLCA                                           01960002
019700     END-EXEC.                                                    01970002
019800                                                                  01980002
019900*---------------------------------------------------------------* 01990002
020000*    DEFINE CURSOR FOR TPOPRPK :                                * 02000002
020100*    PULL ALL AVAILABLE COLUMNS, SO EXTRACT FILE WILL CONTAIN   * 02010002
020200*    ALL DATA TO POPULATE "ARCHIVE HISTORY" COPY OF THIS TABLE. * 02020002
020300*---------------------------------------------------------------* 02030002
020400     EXEC SQL                                                     02040002
020500          DECLARE TABLE-CURSOR CURSOR FOR                         02050002
020600           SELECT PO_NBR                                          02060002
020700                 ,VER_NBR                                         02070002
020800                 ,PO_PREPK_ID                                     02080002
020900                 ,PREPK_TYP_CDE                                   02090002
021000                 ,PREPK_DESC                                      02100002
021100                 ,PREPK_STAT_CDE                                  02110002
021200                 ,PREPK_UPC_NBR                                   02120002
021300                 ,INPK_UNT_QTY                                    02130002
021400                 ,INPK_CNVYB_IND                                  02140002
021500                 ,OTPK_UNT_QTY                                    02150002
021600                 ,OTPK_ORD_QTY                                    02160002
021700                 ,PK_DTL_CHG_TMST                                 02170002
021800                 ,PK_SKU_NBR                                      02180002
021900           FROM   TPOPRPK                                         02190002
022000          WHERE  (PO_NBR = :PV-PO-NBR-COMP)                       02200002
022100*LMM        AND  PREPK_STAT_CDE = 'A'                             02210005
022200            FOR  FETCH ONLY                                       02220002
022300           WITH  UR                                               02230002
022400     END-EXEC.                                                    02240002
022500                                                                  02250002
022600                                                                  02260002
022700 PROCEDURE DIVISION.                                              02270002
022800********************                                              02280002
022900                                                                  02290002
023000 0000-PROGRAM-MAINLINE.                                           02300002
023100                                                                  02310002
023200     PERFORM 1000-INITIALIZE.                                     02320002
023300                                                                  02330002
023400     SET PS-IN-DRIVER-NOT-EOF TO TRUE.                            02340002
023500     PERFORM 2000-PROCESS-DRIVER-FILE                             02350002
023600         UNTIL PS-IN-DRIVER-EOF.                                  02360002
023700                                                                  02370002
023800     PERFORM 6000-EOJ-ROUTINE.                                    02380002
023900     STOP RUN.                                                    02390002
024000                                                                  02400002
024100                                                                  02410002
024200* ************************************************************** *02420002
024300* * INITIALIZATIONS                                            * *02430002
024400* ************************************************************** *02440002
024500 1000-INITIALIZE.                                                 02450002
024600                                                                  02460002
024700     MOVE PC-CURRENT-PROGRAM-NAME TO DM-PROGRAM.                  02470002
024800     DISPLAY DM-DISPLAY-MESSAGE.                                  02480002
024900                                                                  02490002
025000     MOVE PC-BEGINNING              TO DP-STATUS-DESCRIPTION.     02500002
025100     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           02510002
025200                                                                  02520002
025300     PERFORM 9000-OPEN-IN-DRIVER-FILE.                            02530002
025400     PERFORM 9700-OPEN-OUT-EXTRACT-FILE.                          02540002
025500                                                                  02550002
025600                                                                  02560002
025700* ************************************************************** *02570002
025800* * 1) GET NEXT RECORD FROM DRIVER FILE, AND                   * *02580002
025900* *    1A- POPULATE KEY (WHERE CLAUSE) FOR TABLE CURSOR        * *02590002
026000* *    1B- OPEN TABLE CURSOR                                   * *02600002
026100* *    1C- LOOP THRU TABLE CURSOR TO EXTRACT ALL               * *02610002
026200* *        ROWS FOR THIS INPUT DRIVER RECORD                   * *02620002
026300* *    2) FOR EACH ROW,                                        * *02630002
026400* *       2A- INCREMENT COUNTS                                 * *02640002
026500* *       2B- WRITE EXTRACT RECORD                             * *02650002
026600* *    1D- CLOSE TABLE CURSOR                                  * *02660002
026700* ************************************************************** *02670002
026800 2000-PROCESS-DRIVER-FILE.                                        02680002
026900                                                                  02690002
027000     PERFORM 9050-READ-IN-DRIVER-FILE.                            02700002
027100     IF PS-IN-DRIVER-EOF                                          02710002
027200         CONTINUE                                                 02720002
027300     ELSE                                                         02730002
027400         MOVE XL013-PO-NBR TO         PV-PO-NBR-COMP              02740002
027500                                      PV-PO-NBR-NUM               02750002
027600         PERFORM 2100-CHECK-PGM-PROGRESS                          02760002
027700         SET PS-TABLE-LOOP-NOT-DONE   TO TRUE                     02770002
027800         SET PS-CURSOR-HAS-NO-DATA    TO TRUE                     02780002
027900         PERFORM 9100-OPEN-TABLE-CURSOR                           02790002
028000         PERFORM 3000-EXTRACT-ROWS-FROM-TABLE                     02800002
028100             UNTIL PS-TABLE-LOOP-DONE                             02810002
028200         PERFORM 9190-CLOSE-TABLE-CURSOR                          02820002
028300     END-IF.                                                      02830002
028400                                                                  02840002
028500                                                                  02850002
028600* ************************************************************** *02860002
028700* *    EVERY NTH RECORD (IE: INITIAL SETTING 1000), REPORT     * *02870002
028800* *    RECORD COUNT AND CURRENT DATE/TIME.  THIS WILL ASSIST   * *02880002
028900* *    WITH RUN-TIME ESTIMATE OF TIME REMAINING TO COMPLETE.   * *02890002
029000* ************************************************************** *02900002
029100 2100-CHECK-PGM-PROGRESS.                                         02910002
029200     DIVIDE    PV-IN-DRIVER-RECS-READ-CNT                         02920002
029300         BY        PC-HOW-OFTEN-TO-DISPLAY                        02930002
029400         GIVING    PV-DISPLAY-NTH-MULTIPLE                        02940002
029500         REMAINDER PV-DISPLAY-NTH-REMAINDER.                      02950002
029600                                                                  02960002
029700     IF PV-DISPLAY-NTH-REMAINDER = ZERO                           02970002
029800         MOVE PC-CONTINUING         TO DP-STATUS-DESCRIPTION      02980002
029900         PERFORM 6200-DISPLAY-PGM-PROGRESS                        02990002
030000     END-IF.                                                      03000002
030100                                                                  03010002
030200                                                                  03020002
030300* ************************************************************** *03030002
030400* * EXTRACT ROWS FROM TABLE, FOR THE CURRENT DRIVER RECORD     * *03040002
030500* ************************************************************** *03050002
030600 3000-EXTRACT-ROWS-FROM-TABLE.                                    03060002
030700     INITIALIZE DCLTPOPRPK.                                       03070002
030800     PERFORM 9150-FETCH-TABLE-CURSOR.                             03080002
030900     IF PS-TABLE-LOOP-DONE                                        03090002
031000         CONTINUE                                                 03100002
031100     ELSE                                                         03110002
031200         PERFORM 9750-WRITE-EXTRACT-RECORD                        03120002
031300     END-IF.                                                      03130002
031400                                                                  03140002
031500                                                                  03150002
031600* ************************************************************** *03160002
031700* * DISPLAY END OF RUN MESSAGE, CLOSE THE OUTPUT FILES         * *03170002
031800* ************************************************************** *03180002
031900 6000-EOJ-ROUTINE.                                                03190002
032000                                                                  03200002
032100     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           03210002
032200     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         03220002
032300                                                                  03230002
032400     MOVE PC-ENDING                 TO DP-STATUS-DESCRIPTION.     03240002
032500     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           03250002
032600                                                                  03260002
032700                                                                  03270002
032800* ************************************************************** *03280002
032900* * DISPLAY PROGRAM PROGRESS.                                  * *03290002
033000* ************************************************************** *03300002
033100 6200-DISPLAY-PGM-PROGRESS.                                       03310002
033200                                                                  03320002
033300     EXEC SQL                                                     03330002
033400          SET :PV-TMST = CURRENT TIMESTAMP                        03340002
033500     END-EXEC.                                                    03350002
033600                                                                  03360002
033700     MOVE PC-CURRENT-PROGRAM-NAME   TO DP-PROGRAM.                03370002
033800     MOVE PV-TIMESTAMP-19           TO DP-TIMESTAMP-19.           03380002
033900     MOVE PV-IN-DRIVER-RECS-READ-CNT                              03390002
034000                                    TO DP-IN-CNT.                 03400002
034100*    MOVE PV-RECS-WITH-MATCHES-CNT  TO DP-MATCHES-FOUND-CNT.      03410002
034200     MOVE PV-TABLE-ROW-SELECT-CNT   TO DP-ROWS-SELECTED-CNT.      03420002
034300     MOVE PV-EXTRACT-WRITTEN-CNT    TO DP-OUT-CNT.                03430002
034400                                                                  03440002
034500     DISPLAY DP-DISPLAY-PROGRESS-MSG.                             03450002
034600                                                                  03460002
034700                                                                  03470002
034800* ************************************************************** *03480002
034900* * FILE AND DB2 TABLE ACCESS PARAGRAPHS.                      * *03490002
035000* * 90XX- INPUT:  DRIVER FILE                                  * *03500002
035100* * 91XX- INPUT:  TABLE CURSOR                                 * *03510002
035200* * 97XX- OUTPUT: TABLE EXTRACT                                * *03520002
035300* ************************************************************** *03530002
035400                                                                  03540002
035500* ************************************************************** *03550002
035600* * OPEN  INPUT DRIVER FILE                                    * *03560002
035700* ************************************************************** *03570002
035800 9000-OPEN-IN-DRIVER-FILE.                                        03580002
035900     OPEN  INPUT  IN-DRIVER-FILE.                                 03590002
036000                                                                  03600002
036100                                                                  03610002
036200* ************************************************************** *03620002
036300* * READ  INPUT DRIVER FILE OF ELIGIBLE DATA TO EXTRACT        * *03630002
036400* ************************************************************** *03640002
036500 9050-READ-IN-DRIVER-FILE.                                        03650002
036600     READ IN-DRIVER-FILE                                          03660002
036700          INTO XL013-DRIVER-RECORD-LAYOUT                         03670002
036800          AT END                                                  03680002
036900              SET PS-IN-DRIVER-EOF TO TRUE.                       03690002
037000                                                                  03700002
037100     IF PS-IN-DRIVER-EOF                                          03710002
037200         CONTINUE                                                 03720002
037300     ELSE                                                         03730002
037400         ADD +1 TO PV-IN-DRIVER-RECS-READ-CNT                     03740002
037500     END-IF.                                                      03750002
037600                                                                  03760002
037700                                                                  03770002
037800* ************************************************************** *03780002
037900* * CLOSE INPUT DRIVER FILE                                    * *03790002
038000* ************************************************************** *03800002
038100 9090-CLOSE-IN-DRIVER-FILE.                                       03810002
038200     CLOSE IN-DRIVER-FILE.                                        03820002
038300                                                                  03830002
038400                                                                  03840002
038500* ************************************************************** *03850002
038600* * OPEN  TABLE CURSOR                                         * *03860002
038700* ************************************************************** *03870002
038800 9100-OPEN-TABLE-CURSOR.                                          03880002
038900     EXEC SQL                                                     03890002
039000          OPEN TABLE-CURSOR                                       03900002
039100     END-EXEC.                                                    03910002
039200                                                                  03920002
039300     EVALUATE TRUE                                                03930002
039400         WHEN SQLCODE = ZERO                                      03940002
039500              ADD +1 TO PV-RECS-WITH-MATCHES-CNT                  03950002
039600              SET PS-CURSOR-HAS-DATA TO TRUE                      03960002
039700         WHEN SQLCODE = +100                                      03970002
039800              SET PS-TABLE-LOOP-DONE TO TRUE                      03980002
039900         WHEN SQLWARN0 NOT EQUAL SPACE                            03990002
040000         WHEN SQLCODE  NOT EQUAL ZERO                             04000002
040100              MOVE '9100-OPEN-TABLE-CURSOR'                       04010002
040200                                 TO PV-PARAGRAPH-NAME             04020002
040300              MOVE 'OPEN TABLE CURSOR'                            04030002
040400                                 TO PV-DB2-OPERATION-MSG-1        04040002
040500              MOVE 'TPOPRPK'     TO PV-DB2-TABLE-NAME             04050002
040600              PERFORM 9999-DB2-ABEND                              04060002
040700     END-EVALUATE.                                                04070002
040800                                                                  04080002
040900                                                                  04090002
041000* ************************************************************** *04100002
041100* * FETCH TABLE CURSOR                                         * *04110002
041200* ************************************************************** *04120002
041300 9150-FETCH-TABLE-CURSOR.                                         04130002
041400     EXEC SQL                                                     04140002
041500         FETCH TABLE-CURSOR                                       04150002
041600          INTO  :POPRPK-PO-NBR                                    04160002
041700               ,:POPRPK-VER-NBR                                   04170002
041800               ,:POPRPK-PO-PREPK-ID                               04180002
041900               ,:POPRPK-PREPK-TYP-CDE                             04190002
042000               ,:POPRPK-PREPK-DESC                                04200002
042100               ,:POPRPK-PREPK-STAT-CDE                            04210002
042200               ,:POPRPK-PREPK-UPC-NBR                             04220002
042300               ,:POPRPK-INPK-UNT-QTY                              04230002
042400               ,:POPRPK-INPK-CNVYB-IND                            04240002
042500               ,:POPRPK-OTPK-UNT-QTY                              04250002
042600               ,:POPRPK-OTPK-ORD-QTY                              04260002
042700               ,:POPRPK-PK-DTL-CHG-TMST                           04270002
042800               ,:POPRPK-PK-SKU-NBR                                04280002
042900     END-EXEC.                                                    04290002
043000                                                                  04300002
043100     EVALUATE TRUE                                                04310002
043200         WHEN SQLCODE = ZERO                                      04320002
043300              ADD +1                 TO PV-TABLE-ROW-SELECT-CNT   04330002
043400              SET PS-CURSOR-HAS-DATA TO TRUE                      04340002
043500         WHEN SQLCODE = +100                                      04350002
043600              SET PS-TABLE-LOOP-DONE TO TRUE                      04360002
043700         WHEN SQLWARN0 NOT EQUAL SPACE                            04370002
043800         WHEN SQLCODE NOT EQUAL ZERO                              04380002
043900              MOVE '9150-FETCH-TABLE-CURSOR'                      04390002
044000                                 TO PV-PARAGRAPH-NAME             04400002
044100              MOVE 'FETCH TABLE CURSOR'                           04410002
044200                                 TO PV-DB2-OPERATION-MSG-1        04420002
044300              MOVE 'TPOPRPK'     TO PV-DB2-TABLE-NAME             04430002
044400              PERFORM 9999-DB2-ABEND                              04440002
044500     END-EVALUATE.                                                04450002
044600                                                                  04460002
044700                                                                  04470002
044800* ************************************************************** *04480002
044900* * CLOSE TABLE CURSOR                                         * *04490002
045000* ************************************************************** *04500002
045100 9190-CLOSE-TABLE-CURSOR.                                         04510002
045200     EXEC SQL                                                     04520002
045300          CLOSE TABLE-CURSOR                                      04530002
045400     END-EXEC.                                                    04540002
045500                                                                  04550002
045600     EVALUATE TRUE                                                04560002
045700         WHEN SQLCODE = ZERO                                      04570002
045800              CONTINUE                                            04580002
045900         WHEN SQLWARN0 NOT EQUAL SPACE                            04590002
046000         WHEN SQLCODE NOT EQUAL ZERO                              04600002
046100              MOVE '9190-CLOSE-TABLE-CURSOR'                      04610002
046200                                 TO PV-PARAGRAPH-NAME             04620002
046300              MOVE 'CLOSE TABLE CURSOR'                           04630002
046400                                 TO PV-DB2-OPERATION-MSG-1        04640002
046500              MOVE 'TPOPRPK'     TO PV-DB2-TABLE-NAME             04650002
046600              PERFORM 9999-DB2-ABEND                              04660002
046700     END-EVALUATE.                                                04670002
046800                                                                  04680002
046900                                                                  04690002
047000* ************************************************************** *04700002
047100* * OPEN OUTPUT EXTRACT FILE                                   * *04710002
047200* ************************************************************** *04720002
047300 9700-OPEN-OUT-EXTRACT-FILE.                                      04730002
047400     OPEN OUTPUT OUT-EXTRACT-FILE.                                04740002
047500                                                                  04750002
047600                                                                  04760002
047700* ************************************************************** *04770002
047800* * WRITE A RECORD TO THE TABLE EXTRACT FILE                   * *04780002
047900* ************************************************************** *04790002
048000 9750-WRITE-EXTRACT-RECORD.                                       04800002
048100     WRITE  OUT-EXTRACT-RECORD  FROM  DCLTPOPRPK.                 04810002
048200     ADD +1 TO PV-EXTRACT-WRITTEN-CNT.                            04820002
048300                                                                  04830002
048400                                                                  04840002
048500* ************************************************************** *04850002
048600* * CLOSE OUTPUT EXTRACT FILE                                  * *04860002
048700* ************************************************************** *04870002
048800 9790-CLOSE-OUT-EXTRACT-FILE.                                     04880002
048900     CLOSE OUT-EXTRACT-FILE.                                      04890002
049000                                                                  04900002
049100                                                                  04910002
049200* ************************************************************** *04920002
049300* * DISPLAY INFORMATION NEEDED FOR DEBUGGING/MAINTENANCE/SUPPORT *04930002
049400* * AND CALL THE ABEND PROCESSOR IN THE EVENT THAT AN          * *04940002
049500* * SQL ERROR OR WARNING CODE OCCURS.                          * *04950002
049600* ************************************************************** *04960002
049700 9999-DB2-ABEND.                                                  04970002
049800                                                                  04980002
049900     DISPLAY PC-CURRENT-PROGRAM-NAME                              04990002
050000             ' 9999-DB2-ABEND'.                                   05000002
050100     DISPLAY PC-CURRENT-PROGRAM-NAME                              05010002
050200             ' ** ABEND           **'.                            05020002
050300     DISPLAY PC-CURRENT-PROGRAM-NAME                              05030002
050400             ' ** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.       05040002
050500     DISPLAY PC-CURRENT-PROGRAM-NAME                              05050002
050600             ' ** TABLES AFFECTED ** = ' PV-DB2-TABLE-NAME.       05060002
050700     DISPLAY PC-CURRENT-PROGRAM-NAME                              05070002
050800             ' ** OPERATION       ** = ' PV-DB2-OPERATION-MSG-1.  05080002
050900                                                                  05090002
051000     DISPLAY PC-CURRENT-PROGRAM-NAME                              05100002
051100             ' ** SQLCODE         ** = ' SQLCODE.                 05110002
051200     MOVE SQLCODE TO PV-SQLCODE.                                  05120002
051300     DISPLAY PC-CURRENT-PROGRAM-NAME                              05130002
051400             ' ** PV-SQLCODE      ** = ' PV-SQLCODE '.'.          05140002
051500                                                                  05150002
051600     DISPLAY PC-CURRENT-PROGRAM-NAME                              05160002
051700             ' ** SQLWARN0        ** = ' SQLWARN0 '.'.            05170002
051800                                                                  05180002
051900     DISPLAY PC-CURRENT-PROGRAM-NAME                              05190004
052000             ' ** PO NUMBER       ** = ' PV-PO-NBR-NUM '.'.       05200004
052100                                                                  05210004
052200                                                                  05220002
052300*----------------------------------------------------------------*05230002
052400* THIS COPY BOOK MEMBER CONTAINS THE PROCEDURE DIVISION STATE-   *05240002
052500* MENTS THAT ARE REQUIRED TO UTILIZE THE DB2 ABEND MODULE        *05250002
052600* 'DSNTIAR' AND CONVERT THE SQLCA INFORMATION INTO A READABLE    *05260002
052700* FORMAT.                                                        *05270002
052800*----------------------------------------------------------------*05280002
052900     COPY DPPD004.                                                05290002
053000                                                                  05300002
053100     MOVE PC-ABENDING               TO DP-STATUS-DESCRIPTION.     05310002
053200     PERFORM 6200-DISPLAY-PGM-PROGRESS.                           05320002
053300     PERFORM 9090-CLOSE-IN-DRIVER-FILE.                           05330002
053400     PERFORM 9790-CLOSE-OUT-EXTRACT-FILE.                         05340002
053500                                                                  05350002
053600*----------------------------------------------------------------*05360002
053700* CALL ABEND                                                     *05370002
053800*----------------------------------------------------------------*05380002
053900     MOVE +4013                  TO ABEND-CODE.                   05390002
054000     CALL 'ILBOABN0' USING ABEND-CODE.                            05400002
054100*                                                                 05410002
