000100************************************************************      00010000
000200*    COPYBOOK NAME : XLRD039                                      00020000
000300*    RECORD PURPOSE: TO FORMAT UPDATE TRANSACTIONS FOR            00030000
000400*                    LOGISTICS DOMAIN TABLES XLT_BUS_AREA,        00040000
000500*                    XLT_BUS_GP, XLT_DEPT, XLT_MAJ_CL             00050000
000600*                    XLT_SUB_CL                                   00060000
000700*    RECORD LENGTH:  080 BYTES                                    00070000
000800*    RECORD FORMAT:  SEQUENTIAL                                   00080000
000900*                                                                 00090000
001000*  THE VALUE OF ACTION-TYPE CONTROLS THE SEQUENCE IN WHICH        00100000
001100*  THE UPDATING IS DONE.  PROCESS ORDER IS INSERTS, MODIFIES      00110000
001200*  AND THEN DELETES.  TABLES MUST BE ADDED IN THIS ORDER:         00120000
001300*  AREA, GROUP, DEPT, MAJOR CLASS AND THE SUBCLASS.               00130000
001400*  DELETES ARE DONE IN THE REVERSE ORDER.                         00140000
001500************************************************************      00150000
001600 01  XL039-TRANS-REC.                                             00160000
001700     05  XL039-COMMON-AREA.                                       00170000
001800         10  XL039-ACTION-TYPE   PIC X(01)     VALUE SPACES.      00180000
001900             88  XL039-ADD                     VALUE '1'.         00190000
002000             88  XL039-MODIFY                  VALUE '2'.         00200000
002100             88  XL039-DELETE                  VALUE '3'.         00210000
002200         10  FILLER              PIC X(01)     VALUE SPACES.      00220000
002300         10  XL039-RECORD-TYPE   PIC X(01)     VALUE SPACES.      00230000
002400             88  XL039-AREA                    VALUE 'A'.         00240000
002500             88  XL039-GROUP                   VALUE 'G'.         00250000
002600             88  XL039-DEPT                    VALUE 'D'.         00260000
002700             88  XL039-MAJ-CL                  VALUE 'M'.         00270000
002800             88  XL039-SUB-CL                  VALUE 'S'.         00280000
002900         10  FILLER              PIC X(01)     VALUE SPACES.      00290000
003000         10  XL039-SORT-SEQUENCE PIC X(02)     VALUE SPACES.      00300000
003100     05  XL039-TRANS-DATA.                                        00310000
003200         10  FILLER              PIC X(74).                       00320000
003300     05  XL039-AREA-DATA   REDEFINES XL039-TRANS-DATA.            00330000
003400         10  XL039-AREA-ID       PIC 9(02).                       00340000
003500         10  FILLER              PIC X(01).                       00350000
003600         10  XL039-AREA-DESC     PIC X(25).                       00360000
003700         10  FILLER              PIC X(46).                       00370000
003800     05  XL039-GROUP-DATA  REDEFINES XL039-TRANS-DATA.            00380000
003900         10  XL039-GROUP-NBR     PIC 9(03).                       00390000
004000         10  FILLER              PIC X(01).                       00400000
004100         10  XL039-GP-AREA-ID    PIC 9(02).                       00410000
004200         10  FILLER              PIC X(01).                       00420000
004300         10  XL039-GROUP-DESC    PIC X(25).                       00430000
004400         10  FILLER              PIC X(42).                       00440000
004500     05  XL039-DEPT-DATA   REDEFINES XL039-TRANS-DATA.            00450000
004600         10  XL039-DEPT-NBR      PIC 9(04).                       00460000
004700         10  FILLER              PIC X(01).                       00470000
004800         10  XL039-DEPT-NAME     PIC X(20).                       00480000
004900         10  FILLER              PIC X(01).                       00490000
005000         10  XL039-MDSE-LNE-CDE  PIC X(01).                       00500000
005100         10  FILLER              PIC X(01).                       00510000
005200         10  XL039-BUS-GP-NBR    PIC 9(03).                       00520000
005300         10  FILLER              PIC X(01).                       00530000
005400         10  XL039-STR-ZN-CDE    PIC X(05).                       00540000
005500         10  FILLER              PIC X(01).                       00550001
005600         10  XL039-BYR-NBR       PIC 9(04).                       00560001
005700         10  FILLER              PIC X(01).                       00570001
005800         10  XL039-DMA-NBR       PIC 9(04).                       00580001
005900         10  FILLER              PIC X(01).                       00590001
006000         10  XL039-EXCLN-IND     PIC X(01).                       00600003
006100         10  FILLER              PIC X(25).                       00610003
006200     05  XL039-MAJ-CL-DATA REDEFINES XL039-TRANS-DATA.            00620000
006300         10  XL039-MAJ-CL-DEPT-NBR   PIC 9(04).                   00630002
006400         10  FILLER                  PIC X(01).                   00640002
006500         10  XL039-MAJ-CL-NBR        PIC 9(04).                   00650002
006600         10  FILLER                  PIC X(01).                   00660002
006700         10  XL039-MAJ-CL-NM         PIC X(20).                   00670002
006800         10  FILLER                  PIC X(01).                   00680004
006700         10  XL039-PUT-AWY-CDE       PIC X(02).                   00690004
006800         10  FILLER                  PIC X(41).                   00700004
006900     05  XL039-SUB-CL-DATA REDEFINES XL039-TRANS-DATA.            00710000
007000         10  XL039-SUB-CL-DEPT-NBR   PIC 9(04).                   00720002
007100         10  FILLER                  PIC X(01).                   00730002
007200         10  XL039-SUB-CL-MAJ-CL-NBR PIC 9(04).                   00740002
007300         10  FILLER                  PIC X(01).                   00750002
007400         10  XL039-SUB-CL-NBR        PIC 9(04).                   00760002
007500         10  FILLER                  PIC X(01).                   00770002
007600         10  XL039-SUB-CL-NM         PIC X(20).                   00780002
007700         10  FILLER                  PIC X(01).                   00790002
007800         10  XL039-SUB-CL-MDSE-DESC  PIC X(30).                   00800002
007900         10  FILLER                  PIC X(01).                   00810002
008000         10  XL039-TAX-DFLT-IND      PIC X(01).                   00820002
008100         10  FILLER                  PIC X(01).                   00830002
008200         10  XL039-DISC-ELIG-IND     PIC X(01).                   00840002
008300         10  FILLER                  PIC X(04).                   00850002
