000100*----------------------------------------------------------*      00010002
000200*                                                          *      00020002
000300*    XLRD011 - PO HEADER BRIDGE -RMS TO MAINFRAME COPYBOOK *      00030002
000400*    LENGTH  - 1000 BYTES                                  *      00040002
000500*                                                          *      00050002
000600*----------------------------------------------------------*      00060002
000700* ****************************************************************00070002
000800* CHANGE DESCRIPTION                                              00080002
000900* ****************************************************************00090002
001000* DATE  05/04/2010                                                00100002
001100*  CHANGE MADE: ADDED A NEW IR INDICATOR(WHSE_RPLNT_IND) IN       00110002
001200*  TPURCHS TABLE UNDER IMPORT REPLENISHMENT PROJECT. ADDED THE NEW00120002
001300*  INDICATOR FIELD FOR HEADER ADD, HEADER CHANGE AND HEADER       00130002
001400*  ATTRIBUTE CHANGE.                                              00140002
001500* MADE BY: MONIKA SACHDEVA         TKID: TKMAW78                  00150002
001600* CHANGES TAGGED AS MS 05/04/2010                                 00160002
001700* ****************************************************************00170002
001800                                                                  00180002
001900     02  XL011-DATA.                                              00190002
002000         05 XL011-MSG-ID                    PIC X(20).            00200002
002100         05 XL011-ORDER-NBR                 PIC 9(08).            00210002
002200         05 XL011-DATA-AREA                 PIC X(500).           00220002
002300                                                                  00230002
002400*MESSAGE ID: HDR_ADD                                              00240002
002500         05 XL011-HDR-ADD      REDEFINES XL011-DATA-AREA.         00250002
002600             10 XL011-HA-DEPT               PIC 9(04).            00260002
002700             10 XL011-HA-BUYER              PIC 9(04).            00270002
002800             10 XL011-HA-ENT-ID             PIC 9(10).            00280002
002900             10 XL011-HA-WRITTEN-DATE       PIC 9(08).            00290002
003000             10 XL011-HA-NOT-BEFORE-DATE    PIC 9(08).            00300002
003100             10 XL011-HA-NOT-AFTER-DATE     PIC 9(14).            00310002
003200             10 XL011-HA-OTB-EOW-DATE       PIC 9(08).            00320002
003300             10 XL011-HA-CLOSE-DATE         PIC 9(14).            00330002
003400             10 XL011-HA-TERMS              PIC 9(05).            00340002
003500             10 XL011-HA-FREIGHT-TERMS      PIC 9(05).            00350002
003600             10 XL011-HA-STATUS             PIC X(01).            00360002
003700             10 XL011-HA-ORIG-APPROVAL-DATE PIC 9(08).            00370002
003800             10 XL011-HA-ORIG-APPROVAL-ID   PIC X(08).            00380002
003900             10 XL011-HA-EDI-SENT-IND       PIC X(01).            00390002
004000             10 XL011-HA-EDI-PO-IND         PIC X(01).            00400002
004100             10 XL011-HA-IMPORT-ORDER-IND   PIC X(01).            00410002
004200             10 XL011-HA-FACTORY            PIC X(10).            00420002
004300             10 XL011-HA-POE-CDE            PIC X(03).            00430002
004400             10 XL011-HA-FOB-CDE            PIC X(03).            00440002
004500             10 XL011-HA-PO-TYPE            PIC X(04).            00450002
004600             10 XL011-HA-PK-BY-STR-IND      PIC X(01).            00460002
004700             10 XL011-HA-CONSLR-ACT-DATE    PIC 9(08).            00470002
004800             10 XL011-HA-CONSLR-REQR-DATE   PIC 9(08).            00480002
004900             10 XL011-HA-CONSLR-RLSE-CODE   PIC X(01).            00490002
005000             10 XL011-HA-TKT-MKR-ACT-DATE   PIC 9(08).            00500002
005100             10 XL011-HA-TKT-MKR-REQ-DATE   PIC 9(08).            00510002
005200             10 XL011-HA-TKT-MKR-RLSE-CODE  PIC X(01).            00520002
005300             10 XL011-HA-RELEASE-DATE       PIC 9(08).            00530002
005400             10 XL011-HA-FIRST-FACTORY-DATE PIC 9(08).            00540002
005500             10 XL011-HA-LAST-FACTORY-DATE  PIC 9(08).            00550002
005600             10 XL011-HA-DIR-TO-STORE-IND   PIC X(01).            00560002
005700             10 XL011-HA-EXT-NOT-AFTER-DAT  PIC 9(08).            00570002
005800             10 XL011-HA-HANG-IND           PIC X(01).            00580002
005900             10 XL011-HA-NEW-STORE-PO-IND   PIC X(01).            00590002
006000             10 XL011-HA-PACKAGING-CODE     PIC X(01).            00600002
006100             10 XL011-HA-PACKAGING-DESC     PIC X(20).            00610002
006200             10 XL011-HA-PTKT-LEAD-TM-DAYS  PIC 9(05).            00620002
006300             10 XL011-HA-SEASET-SHORT-DESC  PIC X(05).            00630002
006400             10 XL011-HA-SEASET-YEAR        PIC X(04).            00640002
006500             10 XL011-HA-CREATE-BY-USER-ID  PIC X(08).            00650002
006600             10 XL011-HA-PTKT-IND           PIC X(01).            00660002
006700             10 XL011-HA-C-O-PROD-CDE       PIC X(03).            00670002
006800             10 XL011-HA-AGNT-OFC-CNTRY-CDE PIC X(03).            00680002
006900             10 XL011-HA-IMPORT-VENDOR-ID   PIC 9(10).            00690002
007000             10 XL011-HA-IMPORT-FACTORY-ID  PIC 9(10).            00700002
007100             10 XL011-HA-UNTS-PER-CUBIC-MTR PIC 9(06).            00710002
007200             10 XL011-HA-QTA-CTG-CDE        PIC X(06).            00720002
007300             10 XL011-HA-AGNT-ENT-ID        PIC X(10).            00730002
007400             10 XL011-HA-IMPORT-VENDOR-NAME PIC X(35).            00740002
007500             10 XL011-HA-IMPORT-FACTORY-NAM PIC X(35).            00750002
007600             10 XL011-HA-DERVD-LBL-TYP-CDE  PIC X(01).            00760002
007700*  WR33239  - 11/13/2007                                          00770002
007800             10 XL011-HA-DELY-ID            PIC X(10).            00780002
007900             10 XL011-HA-PO-SHRT-CYC-IND    PIC X(01).            00790002
008000** MS 05/04/2010                                                  00800002
008100             10 XL011-HA-WHSE-RPLNT-IND     PIC X(01).            00810002
008200*  WR33239  - 11/13/2007                                          00820002
008300*                                                                 00830002
008400*MESSAGE ID: HDR_CHANGE                                           00840002
008500         05 XL011-HDR-CHANGE   REDEFINES XL011-DATA-AREA.         00850002
008600             10 XL011-HC-DEPT               PIC 9(04).            00860002
008700             10 XL011-HC-BUYER              PIC 9(04).            00870002
008800             10 XL011-HC-NOT-BEFORE-DATE    PIC 9(08).            00880002
008900             10 XL011-HC-NOT-AFTER-DATE     PIC 9(14).            00890002
009000             10 XL011-HC-OTB-EOW-DATE       PIC 9(08).            00900002
009100             10 XL011-HC-TERMS              PIC 9(05).            00910002
009200             10 XL011-HC-FREIGHT-TERMS      PIC 9(05).            00920002
009300             10 XL011-HC-EDI-SENT-IND       PIC X(01).            00930002
009400             10 XL011-HC-EDI-PO-IND         PIC X(01).            00940002
009500             10 XL011-HC-IMPORT-ORDER-IND   PIC X(01).            00950002
009600             10 XL011-HC-PO-TYPE            PIC X(04).            00960002
009700             10 XL011-HC-PK-BY-STR-IND      PIC X(01).            00970002
009800** MS 05/04/2010                                                  00980002
009900             10 XL011-HC-WHSE-RPLNT-IND     PIC X(01).            00990002
010000*                                                                 01000002
010100*MESSAGE ID: HDR_ATTR_CHANGE                                      01010002
010200         05 XL011-HDR-ATTR-CHG REDEFINES XL011-DATA-AREA.         01020002
010300             10 XL011-HAC-RELEASE-DATE      PIC 9(08).            01030002
010400             10 XL011-HAC-DIR-TO-STORE-IND  PIC X(01).            01040002
010500             10 XL011-HAC-EXT-NOT-AFTER-DAT PIC 9(08).            01050002
010600             10 XL011-HAC-HANG-IND          PIC X(01).            01060002
010700             10 XL011-HAC-NEW-STORE-PO-IND  PIC X(01).            01070002
010800             10 XL011-HAC-PACKAGING-CODE    PIC X(01).            01080002
010900             10 XL011-HAC-PACKAGING-DESC    PIC X(20).            01090002
011000             10 XL011-HAC-PTKT-LEAD-TM-DAYS PIC 9(05).            01100002
011100             10 XL011-HAC-SEASET-SHORT-DESC PIC X(05).            01110002
011200             10 XL011-HAC-SEASET-YEAR       PIC X(04).            01120002
011300             10 XL011-HAC-PTKT-IND          PIC X(01).            01130002
011400             10 XL011-HAC-DERVD-LBL-TYP-CDE PIC X(01).            01140002
011500*  WR33239  - 11/13/2007                                          01150002
011600             10 XL011-HAC-DELY-ID           PIC X(10).            01160002
011700             10 XL011-HAC-PO-SHRT-CYC-IND   PIC X(01).            01170002
011800** MS 05/04/2010                                                  01180002
011900             10 XL011-HAC-WHSE-RPLNT-IND    PIC X(01).            01190002
012000*  WR33239  - 11/13/2007                                          01200002
012100                                                                  01210002
012200*MESSAGE ID: HDR_IMPRT_CHANGE                                     01220002
012300         05 XL011-IMPRT-CHG    REDEFINES XL011-DATA-AREA.         01230002
012400             10 XL011-IC-FACTORY            PIC X(10).            01240002
012500             10 XL011-IC-POE-CDE            PIC X(03).            01250002
012600             10 XL011-IC-FOB-CDE            PIC X(03).            01260002
012700             10 XL011-IC-AGNT-ENT-ID        PIC X(10).            01270002
012800                                                                  01280002
012900*MESSAGE ID: HDR_IMPRT_ATTR_CHANGE                                01290002
013000         05 XL011-IMPRT-ATT-CHG                                   01300002
013100                               REDEFINES XL011-DATA-AREA.         01310002
013200             10 XL011-IAC-CONSLR-ACT-DATE    PIC 9(08).           01320002
013300             10 XL011-IAC-CONSLR-REQR-DATE   PIC 9(08).           01330002
013400             10 XL011-IAC-CONSLR-RLSE-CODE   PIC X(01).           01340002
013500             10 XL011-IAC-TKT-MKR-ACT-DATE   PIC 9(08).           01350002
013600             10 XL011-IAC-TKT-MKR-REQ-DATE   PIC 9(08).           01360002
013700             10 XL011-IAC-TKT-MKR-RLSE-CODE  PIC X(01).           01370002
013800             10 XL011-IAC-FIRST-FACTORY-DATE                      01380002
013900                                             PIC 9(08).           01390002
014000             10 XL011-IAC-LAST-FACTORY-DATE  PIC 9(08).           01400002
014100             10 XL011-IAC-AGNT-OFC-CNTRY-CDE PIC X(03).           01410002
014200             10 XL011-IAC-IMPORT-VENDOR-ID   PIC 9(10).           01420002
014300             10 XL011-IAC-IMPORT-FACTORY-ID  PIC 9(10).           01430002
014400             10 XL011-IAC-UNTS-PER-CUBIC-MTR PIC 9(06).           01440002
014500             10 XL011-IAC-QTA-CTG-CDE        PIC X(06).           01450002
014600             10 XL011-IAC-IMPORT-VENDOR-NAME PIC X(35).           01460002
014700             10 XL011-IAC-IMPORT-FACTORY-NAM PIC X(35).           01470002
014800                                                                  01480002
014900                                                                  01490002
015000*MESSAGE ID: HDR_STATUS_CHANGE                                    01500002
015100         05 XL011-STATUS-CHG   REDEFINES XL011-DATA-AREA.         01510002
015200             10 XL011-SC-CLOSE-DATE         PIC 9(14).            01520002
015300             10 XL011-SC-STATUS             PIC X(01).            01530002
015400             10 XL011-SC-ORIG-APPROVAL-DATE PIC 9(08).            01540002
015500             10 XL011-SC-ORIG-APPROVAL-ID   PIC X(08).            01550002
015600                                                                  01560002
015700*MESSAGE ID: HDR_ORIG_CTRY_CHANGE                                 01570002
015800         05 XL011-HDR-ORIG-CTY-CHG REDEFINES XL011-DATA-AREA.     01580002
015900             10 XL011-OCC-C-O-PROD-CDE      PIC X(03).            01590002
016000                                                                  01600002
016100*MESSAGE ID: HDR_DELETE                                           01610002
016200*        05 XL011-HDR-DELETE   REDEFINES XL011-DATA-AREA.         01620002
016300*        ONLY THE ORDER NUMBER IS GIVEN AND IT'S IN THE COMMON    01630002
016400*        DATA AREA ABOVE THE REDEFINES SECTION                    01640002
016500                                                                  01650002
016600*MESSAGE ID: ORD_DISCOUNT_ADD                                     01660002
016700         05 XL011-ORD-DISC-ADD   REDEFINES XL011-DATA-AREA.       01670002
016800             10 XL011-DA-DEAL-ID            PIC 9(08).            01680002
016900             10 XL011-DA-DEAL-DETAIL-ID     PIC 9(08).            01690002
017000             10 XL011-DA-EXTENDED-DAYS-QTY  PIC 9(04).            01700002
017100             10 XL011-DA-DISC-TYPE-CODE     PIC X(06).            01710002
017200             10 XL011-DA-DISC-PERCENT       PIC 999.99.           01720002
017300             10 XL011-DA-TTL-DISC-AMOUNT    PIC 9(16).9(04).      01730002
017400                                                                  01740002
017500*MESSAGE ID: ORD_DISCOUNT_CHANGE                                  01750002
017600         05 XL011-ORD-DISC-CHG   REDEFINES XL011-DATA-AREA.       01760002
017700             10 XL011-DC-DEAL-ID            PIC 9(08).            01770002
017800             10 XL011-DC-DEAL-DETAIL-ID     PIC 9(08).            01780002
017900             10 XL011-DC-EXTENDED-DAYS-QTY  PIC 9(04).            01790002
018000             10 XL011-DC-DISC-TYPE-CODE     PIC X(06).            01800002
018100             10 XL011-DC-DISC-PERCENT       PIC 999.99.           01810002
018200             10 XL011-DC-TTL-DISC-AMOUNT    PIC 9(16).9(04).      01820002
018300*                                                                 01830002
018400*MESSAGE ID: ORD_DISCOUNT_DELETE                                  01840002
018500         05 XL011-ORD-DISC-DEL   REDEFINES XL011-DATA-AREA.       01850002
018600             10 XL011-DD-DEAL-ID            PIC 9(08).            01860002
018700             10 XL011-DD-DEAL-DETAIL-ID     PIC 9(08).            01870002
018800             10 XL011-DD-DISC-TYPE-CODE     PIC X(06).            01880002
018900*                                                                 01890002
019000*MESSAGE ID: SPECIAL_INSTR_ADD                                    01900002
019100         05 XL011-SPEC-INSTR-ADD      REDEFINES XL011-DATA-AREA.  01910002
019200             10 XL011-IA-RECIPIENT-CODE     PIC X(02).            01920002
019300             10 XL011-IA-INSTRUCTION-ID     PIC 9(08).            01930002
019400             10 XL011-IA-INSTRUCTION-DESC   PIC X(150).           01940002
019500*                                                                 01950002
019600*MESSAGE ID: SPECIAL_INSTR_DELETE                                 01960002
019700         05 XL011-SPEC-INSTR-DEL      REDEFINES XL011-DATA-AREA.  01970002
019800             10 XL011-ID-RECIPIENT-CODE     PIC X(02).            01980002
019900             10 XL011-ID-INSTRUCTION-ID     PIC 9(08).            01990002
020000             10 XL011-ID-INSTRUCTION-DESC   PIC X(150).           02000002
020100*                                                                 02010002
020200*MESSAGE ID: ORD_SKU_ADD                                          02020002
020300         05 XL011-SKU-ADD      REDEFINES XL011-DATA-AREA.         02030002
020400             10 XL011-SA-COMP-SKU-NBR       PIC 9(08).            02040002
020500             10 XL011-SA-UNIT-COST          PIC 9(16).9(04).      02050002
020600             10 XL011-SA-FIRST-COST         PIC 9(16).9(04).      02060002
020700             10 XL011-SA-VND-QTY            PIC 9(08).9(04).      02070002
020800             10 XL011-SA-PROMO-STRT-DTE     PIC 9(08).            02080002
020900             10 XL011-SA-PIC-SKU-IND        PIC X(01).            02090002
021000             10 XL011-SA-ORIG-ORD-QTY       PIC 9(08).9(04).      02100002
021100             10 XL011-SA-ORD-QTY            PIC 9(08).9(04).      02110002
021200             10 XL011-SA-CNCLD-QTY          PIC 9(08).9(04).      02120002
021300             10 XL011-SA-PACK-SKU-IND       PIC X(01).            02130002
021400             10 XL011-SA-PK-SKU-DESC        PIC X(40).            02140002
021500             10 XL011-SA-DC-ORD-MULT-QTY    PIC 9(04).            02150002
021600             10 XL011-SA-UNT-RTL-AMT        PIC 9(07).9(02).      02160002
021700             10 XL011-SA-GP-RTL-AMT         PIC 9(07).9(02).      02170002
021800             10 XL011-SA-GP-RTL-QTY         PIC 9(05).            02180002
021810             10 XL011-SA-INNER-PACK-QTY     PIC 9(08).9(04).      02181002
021820             10 XL011-SA-OUTER-PACK-QTY     PIC 9(08).9(04).      02182002
021830                                                                  02183002
021840*MESSAGE ID: ORD_SKU_COST_CHANGE                                  02184002
021850         05 XL011-SKU-COST-CHG REDEFINES XL011-DATA-AREA.         02185002
021860             10 XL011-SCC-COMP-SKU-NBR      PIC 9(08).            02186002
021870             10 XL011-SCC-UNIT-COST         PIC 9(16).9(04).      02187002
021880                                                                  02188002
021890*MESSAGE ID: ORD_SKU_ATTR_CHANGE                                  02189002
021900         05 XL011-SKU-ATTR-CHG REDEFINES XL011-DATA-AREA.         02190002
022000             10 XL011-SAC-COMP-SKU-NBR      PIC 9(08).            02200002
022100             10 XL011-SAC-FIRST-COST        PIC 9(16).9(04).      02210002
022200             10 XL011-SAC-PROMO-STRT-DTE    PIC 9(08).            02220002
022300             10 XL011-SAC-PIC-SKU-IND       PIC X(01).            02230002
022400             10 XL011-SAC-PK-SKU-IND        PIC X(01).            02240002
022500             10 XL011-SAC-UNT-RTL-AMT       PIC 9(07).9(02).      02250002
022600             10 XL011-SAC-GP-RTL-AMT        PIC 9(07).9(02).      02260002
022700             10 XL011-SAC-GP-RTL-QTY        PIC 9(05).            02270002
022800             10 XL011-SAC-INNER-PACK-QTY    PIC 9(08).9(04).      02280002
022900             10 XL011-SAC-OUTER-PACK-QTY    PIC 9(08).9(04).      02290002
023000                                                                  02300002
023100*MESSAGE ID: ORD_QTY_CHANGE                                       02310002
023200         05 XL011-SKU-QTY-CHG  REDEFINES XL011-DATA-AREA.         02320002
023300             10 XL011-SKQC-COMP-SKU-NBR     PIC 9(08).            02330002
023400             10 XL011-SKQC-ORIG-ORD-QTY     PIC 9(08).9(04).      02340002
023500             10 XL011-SKQC-ORD-QTY          PIC 9(08).9(04).      02350002
023600             10 XL011-SKQC-CNCLD-QTY        PIC 9(08).9(04).      02360002
023700             10 XL011-SKQC-PK-SKU-IND       PIC X(01).            02370002
023800                                                                  02380002
023900*MESSAGE ID: ORD_SKU_DELETE                                       02390002
024000         05 XL011-SKU-DEL      REDEFINES XL011-DATA-AREA.         02400002
024100             10 XL011-SD-COMP-SKU-NBR       PIC 9(08).            02410002
024200             10 XL011-SD-PK-SKU-IND         PIC X(01).            02420002
024300                                                                  02430002
024400*MESSAGE ID: ORD_PACK_HDR_CHANGE                                  02440002
024500         05 XL011-PK-HDR-CHG   REDEFINES XL011-DATA-AREA.         02450002
024600             10 XL011-PHC-PK-SKU            PIC 9(08).            02460002
024700             10 XL011-PHC-PK-SKU-DESC       PIC X(40).            02470002
024800             10 XL011-PHC-DC-ORD-MULT-QTY   PIC 9(04).            02480002
024900                                                                  02490002
025000*MESSAGE ID: ORD_LOCATION_ADD                                     02500002
025100         05 XL011-LOCATION-ADD      REDEFINES XL011-DATA-AREA.    02510002
025200             10 XL011-LA-COMP-SKU-NBR       PIC 9(08).            02520002
025300             10 XL011-LA-LOCATION           PIC 9(04).            02530002
025400             10 XL011-LA-LOC-TYP-CDE        PIC X(01).            02540002
025500             10 XL011-LA-ORD-QTY            PIC 9(08).9(04).      02550002
025600             10 XL011-LA-ORIG-ORD-QTY       PIC 9(08).9(04).      02560002
025700             10 XL011-LA-CNCLD-QTY          PIC 9(08).9(04).      02570002
025800             10 XL011-LA-CANCEL-CODE        PIC X(01).            02580002
025900             10 XL011-LA-CANCEL-DATE        PIC 9(08).            02590002
026000             10 XL011-LA-CANCEL-ID          PIC X(30).            02600002
026100             10 XL011-LA-DC-ALLOC-MULT-QTY  PIC 9(05).            02610002
026200             10 XL011-LA-STR-ALLOC-MULT-QTY PIC 9(05).            02620002
026300             10 XL011-LA-ALLOC-MD-CDE       PIC X(01).            02630002
026400             10 XL011-LA-SHTG-PRRT-OPT-CDE  PIC X(01).            02640002
026500             10 XL011-LA-OVRG-PRRT-OPT-CDE  PIC X(01).            02650002
026600             10 XL011-LA-EXST-SHTG-THRS-IND PIC X(01).            02660002
026700             10 XL011-LA-PK-SKU-IND         PIC X(01).            02670002
026800*                                                                 02680002
026900*MESSAGE ID: ORD_LOC_QTY_CHANGE                                   02690002
027000         05 XL011-LOC-QTY-CHNG      REDEFINES XL011-DATA-AREA.    02700002
027100             10 XL011-LQC-COMP-SKU-NBR      PIC 9(08).            02710002
027200             10 XL011-LQC-LOCATION          PIC 9(04).            02720002
027300             10 XL011-LQC-ORD-QTY           PIC 9(08).9(04).      02730002
027400             10 XL011-LQC-ORIG-ORD-QTY      PIC 9(08).9(04).      02740002
027500             10 XL011-LQC-CNCLD-QTY         PIC 9(08).9(04).      02750002
027600             10 XL011-LQC-CANCEL-CODE       PIC X(01).            02760002
027700             10 XL011-LQC-CANCEL-DATE       PIC 9(08).            02770002
027800             10 XL011-LQC-CANCEL-ID         PIC X(30).            02780002
027900             10 XL011-LQC-PK-SKU-IND        PIC X(01).            02790002
028000*                                                                 02800002
028100*MESSAGE ID: ORD_LOC_ATT_CHANGE                                   02810002
028200         05 XL011-LOC-ATT-CHG       REDEFINES XL011-DATA-AREA.    02820002
028300             10 XL011-LAC-COMP-SKU-NBR       PIC 9(08).           02830002
028400             10 XL011-LAC-LOCATION           PIC 9(04).           02840002
028500             10 XL011-LAC-DC-ALLOC-MULT-QTY  PIC 9(05).           02850002
028600             10 XL011-LAC-STR-ALLOC-MULT-QTY PIC 9(05).           02860002
028700             10 XL011-LAC-ALLOC-MD-CDE       PIC X(01).           02870002
028800             10 XL011-LAC-SHTG-PRRT-OPT-CDE  PIC X(01).           02880002
028900             10 XL011-LAC-OVRG-PRRT-OPT-CDE  PIC X(01).           02890002
029000             10 XL011-LAC-EXST-SHTG-THRS-IND PIC X(01).           02900002
029100             10 XL011-LAC-PK-SKU-IND         PIC X(01).           02910002
029200*                                                                 02920002
029300*MESSAGE ID: ORD_LOCATION_DELETE                                  02930002
029400         05 XL011-LOC-DEL           REDEFINES XL011-DATA-AREA.    02940002
029500             10 XL011-LD-COMP-SKU-NBR        PIC 9(08).           02950002
029600             10 XL011-LD-LOCATION            PIC 9(04).           02960002
029700             10 XL011-LD-PK-SKU-IND          PIC X(01).           02970002
029800*                                                                 02980002
029900*MESSAGE ID: STORE_ADD                                            02990002
030000         05 XL011-STORE-ADD      REDEFINES XL011-DATA-AREA.       03000002
030100             10 XL011-STRA-COMP-SKU-NBR      PIC 9(08).           03010002
030200             10 XL011-STRA-LOCATION          PIC 9(04).           03020002
030300             10 XL011-STRA-STORE-NBR         PIC 9(04).           03030002
030400             10 XL011-STRA-QTY-ALLOCATED     PIC 9(08).9(04).     03040002
030500             10 XL011-STRA-ALLOC-SEQ-NBR     PIC X(01).           03050002
030600             10 XL011-STRA-RANK-SEQ-NBR      PIC 9(04).           03060002
030700             10 XL011-STRA-CONSTRAINT-CODE   PIC X(01).           03070002
030800             10 XL011-STRA-CONSTRAINT-QTY    PIC 9(08).           03080002
030900             10 XL011-STRA-PK-SKU-IND        PIC X(01).           03090002
031000                                                                  03100002
031100*MESSAGE ID: STORE_QTY_CHANGE                                     03110002
031200         05 XL011-STORE-QTY-CHG  REDEFINES XL011-DATA-AREA.       03120002
031300             10 XL011-STQC-COMP-SKU-NBR      PIC 9(08).           03130002
031400             10 XL011-STQC-LOCATION          PIC 9(04).           03140002
031500             10 XL011-STQC-STORE-NBR         PIC 9(04).           03150002
031600             10 XL011-STQC-QTY-ALLOCATED     PIC 9(08).9(04).     03160002
031700             10 XL011-STQC-PK-SKU-IND        PIC X(01).           03170002
031800                                                                  03180002
031900*MESSAGE ID: STORE_ATTR_CHANGE                                    03190002
032000         05 XL011-STORE-ATTR-CHG REDEFINES XL011-DATA-AREA.       03200002
032100             10 XL011-STAC-COMP-SKU-NBR      PIC 9(08).           03210002
032200             10 XL011-STAC-LOCATION          PIC 9(04).           03220002
032300             10 XL011-STAC-STORE-NBR         PIC 9(04).           03230002
032400             10 XL011-STAC-ALLOC-SEQ-NBR     PIC X(01).           03240002
032500             10 XL011-STAC-RANK-SEQ-NBR      PIC 9(04).           03250002
032600             10 XL011-STAC-CONSTRAINT-CODE   PIC X(01).           03260002
032700             10 XL011-STAC-CONSTRAINT-QTY    PIC 9(08).           03270002
032800             10 XL011-STAC-PK-SKU-IND        PIC X(01).           03280002
032900                                                                  03290002
033000*MESSAGE ID: STORE_DELETE                                         03300002
033100         05 XL011-STORE-DEL      REDEFINES XL011-DATA-AREA.       03310002
033200             10 XL011-STD-COMP-SKU-NBR       PIC 9(08).           03320002
033300             10 XL011-STD-LOCATION           PIC 9(04).           03330002
033400             10 XL011-STD-STORE-NBR          PIC 9(04).           03340002
033500             10 XL011-STD-PK-SKU-IND         PIC X(01).           03350002
033600                                                                  03360002
033700* MSG_ID = PACK_COMP_ADD                                          03370002
033800         05 XL011-PACK-COMP-ADD REDEFINES XL011-DATA-AREA.        03380002
033900             10  XL011-PCA-PACK-SKU-NBR     PIC 9(08).            03390002
034000             10  XL011-PCA-COMP-SKU-NBR     PIC 9(08).            03400002
034100             10  XL011-PCA-UNIT-COST        PIC 9(16).9(04).      03410002
034200             10  XL011-PCA-FIRST-COST       PIC 9(16).9(04).      03420002
034300             10  XL011-PCA-UNT-RTL-AMT      PIC 9(07).9(02).      03430002
034400             10  XL011-PCA-GP-RTL-AMT       PIC 9(07).9(02).      03440002
034500             10  XL011-PCA-GP-RTL-QTY       PIC 9(05).            03450002
034600             10  XL011-PCA-INNER-PACK-QTY   PIC 9(08).9(04).      03460002
034700             10  XL011-PCA-OUTER-PACK-QTY   PIC 9(08).9(04).      03470002
034800             10  XL011-PCA-PK-RATO-UNT-QTY  PIC 9(04).            03480002
034900                                                                  03490002
035000* MSG_ID WAS PACK_COMP_COST_CHG, IS NOW PACK_COMP_CHANGE          03500002
035100*        05 XL011-PK-COMP-COST  REDEFINES XL011-DATA-AREA.        03510002
035200         05 XL011-PK-COMP-CHG  REDEFINES XL011-DATA-AREA.         03520002
035300             10  XL011-PCC-PACK-SKU-NBR     PIC 9(08).            03530002
035400             10  XL011-PCC-COMP-SKU-NBR     PIC 9(08).            03540002
035500             10  XL011-PCC-UNIT-COST        PIC 9(16).9(04).      03550002
035600             10  XL011-PCC-FIRST-COST       PIC 9(16).9(04).      03560002
035700             10  XL011-PCC-UNT-RTL-AMT      PIC 9(07).9(02).      03570002
035800             10  XL011-PCC-GP-RTL-AMT       PIC 9(07).9(02).      03580002
035900             10  XL011-PCC-GP-RTL-QTY       PIC 9(05).            03590002
035910             10  XL011-PCC-INNER-PACK-QTY   PIC 9(08).9(04).      03591003
035920             10  XL011-PCC-OUTER-PACK-QTY   PIC 9(08).9(04).      03592003
036000                                                                  03600002
036100     02  XL011-WORK-AREA.                                         03610002
036200                                                                  03620002
036300*    THIS STUFF IS CARRIED FROM ORD_SKU_ADD AND IS USED           03630002
036400*    TO BUILD PACK COMPONENTS                                     03640002
036500         05 XL011-PACK-SKU-NBR              PIC 9(08).            03650002
036600         05 XL011-PACK-ORD-QTY              PIC S9(09) COMP.      03660002
036700         05 XL011-PACK-CNCLD-QTY            PIC S9(09) COMP.      03670002
036800         05 XL011-PACK-AD-EVNT-DTE          PIC X(10).            03680002
036900         05 XL011-PACK-PIC-ITM-IND          PIC X(01).            03690002
037200                                                                  03720002
037300                                                                  03730002
037400* SWITCHES                                                        03740002
037500         05 XL011-PACK-IND                  PIC X(01).            03750002
037600             88  XL011-PACK-YES                 VALUE 'Y'.        03760002
037700             88  XL011-PACK-NO                  VALUE 'N'.        03770002
037800                                                                  03780002
037900* THIS SWITCH IS SET BY 1. READING THE DB2 TABLE TO DETERMINE IF  03790002
038000* A PARTICULAR DEPARTMENT SWITCHED TO RMS PROCESSING.  HIS IS     03800002
038100* 2. CHECKING TO SEE IF ODD UNIT SKU MESSAGES ARE COMING IN.      03810002
038200* THIS IS USED TO DETERMINE IF THE MESSAGES SHOULD BE PROCEESSED  03820002
038300* TO LEGACY TABLES OR NOT.                                        03830002
038400         05 XL011-PROCESS-MSGS-SW           PIC X(01).            03840002
038500             88  XL011-PROCESS-MESSAGES         VALUE 'Y'.        03850002
038600             88  XL011-BYPASS-MESSAGES          VALUE '1', '2'.   03860002
038700             88  XL011-NOT-PROCESS              VALUE '1'.        03870002
038800             88  XL011-ODD-UNIT-SKU             VALUE '2'.        03880002
038900                                                                  03890002
039000* PACK-CALC IS SET WHEN TPOPRPK CALULATION NEEDS TO BE DONE AFTER 03900002
039100* PACK LINES ARE ADDED.                                           03910002
039200         05 XL011-PACK-CALC                 PIC X(01).            03920002
039300             88  XL011-PACK-CALC-YES            VALUE 'Y'.        03930002
039400             88  XL011-PACK-CALC-NO             VALUE 'N'.        03940002
039500                                                                  03950002
039600* LOC-UPDATED IS SET WHEN A LOCATION IS ADDED OR DELETED FROM     03960002
039700* TALLPLN.  THIS WILL BE USED IN TPURCHS FOR DETERMINING HOW      03970002
039800* TO SET DEST_KNOWN_IND.                                          03980002
039900         05 XL011-LOC-UPDATED               PIC X(01).            03990002
040000             88  XL011-LOC-UPD-YES              VALUE 'Y'.        04000002
040100             88  XL011-LOC-NOT-UPD              VALUE 'N'.        04010002
040200                                                                  04020002
040300* ROW-COMMITTED IS SET WHEN A LOGICAL UNIT IS COMMITTED TO DB2.   04030002
040400         05 XL011-ROW-COMMITTED             PIC X(01).            04040002
040500             88  XL011-ROW-COMMITTED-YES        VALUE 'Y'.        04050002
040600             88  XL011-ROW-NOT-COMMITTED        VALUE 'N'.        04060002
040700*RETURN AREA                                                      04070002
040800         05 XL011-RETURN-AREA.                                    04080002
040900             10 XL011-RETURN-CODE           PIC 9(02).            04090002
041000                 88 XL011-SUCCESSFUL            VALUE ZERO.       04100002
041100                 88 XL011-SQL-ERROR             VALUE 1.          04110002
041200                 88 XL011-SYSTEM-ERROR          VALUE 2.          04120002
041300             10 XL011-SQLCODE               PIC S9(9).            04130002
041400                 88 XL011-SQL-SUCCESSFUL        VALUE ZERO.       04140002
041500                 88 XL011-SQL-NOT-FOUND         VALUE +100.       04150002
041600                 88 XL011-SQL-CONTENTION        VALUES            04160002
041700                                            -904, -911, -913.     04170002
041800             10 XL011-ERROR-PROGRAM         PIC X(8).             04180002
041900             10 XL011-ERROR-PARAGRAPH       PIC X(30).            04190002
042000             10 XL011-DB2-TABLE-NAME    OCCURS 5 TIMES            04200002
042100                                            PIC  X(18).           04210002
042200             10 XL011-ERROR-TEXT            PIC X(80).            04220002
042300             10 XL011-SQLCA                 PIC X(136).           04230002
042400         05  XL011-DEBUG-SW                 PIC X(01).            04240002
042500             88  XL011-DEBUG-YES                VALUE 'Y'.        04250002
042600             88  XL011-DEBUG-NO                 VALUE 'N'.        04260002
042700         05  XL011-TMESTDS-FIELDS.                                04270002
042800             10  XL011-PO-LINE-NBR          PIC  S9(9) COMP.      04280002
042900             10  XL011-PLAN-NBR             PIC  S9(4) COMP.      04290002
043000         05  FILLER                         PIC X(78).            04300002
043100                                                                  04310002
043200 01  XL011-MODULE-NAME                      PIC X(08).            04320002
