000200******************************************************************00020001
000300*** TABLE XLT_STR_GP WITH NULL FIELDS.                            00030002
000600******************************************************************00060001
000700 01  DCLXL042.                                                    00070003
000800     10 XL042-STR-GP-TYP-CDE          PIC  S9(4) COMP.            00080003
000900     10 XL042-STR-GP-ID               PIC  S9(4) COMP.            00090003
001000     10 XL042-STR-GP-NM               PIC   X(30).                00100003
001100     10 XL042-ST-CDE                  PIC   X(2).                 00110003
001110     10 FILLER                        PIC   X(1).                 00111001
001200     10 XL042-RPT-FLSH-SLS-IND        PIC   X(1).                 00120003
001210     10 FILLER                        PIC   X(1).                 00121001
001300******************************************************************00130001
