000100*----------------------------------------------------------*      00010000
000200*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      00020000
000300*    XLRD021 - XXT_PO_PK_SKU                               *      00030000
000400*    LENGTH  - 95  BYTES                                   *      00040000
000500*                                                          *      00050000
000600*----------------------------------------------------------*      00060000
000700     02  XL021-RECORD.                                            00070000
000800         05 XL021-DATA-AREA.                                      00080000
000900             10  XL021-PO-NBR                PIC 9(08).           00090000
001000             10  XL021-PK-SKU-NBR            PIC 9(08).           00100000
001100             10  XL021-SKU-NBR               PIC 9(08).           00110000
001200             10  XL021-UNT-COST-AMT          PIC 9(16).9(04).     00120000
001300             10  XL021-FRST-COST-AMT         PIC 9(16).9(04).     00130000
001400             10  XL021-UNT-RTL-AMT           PIC 9(07).9(02).     00140000
001500             10  XL021-GP-RTL-AMT            PIC 9(07).9(02).     00150000
001600             10  XL021-GP-RTL-QTY            PIC 9(05).           00160000
001800             10  XL021-INPK-QTY              PIC 9(08).9(04).     00180000
001900             10  XL021-OTPK-QTY              PIC 9(08).9(04).     00190000
002000             10  XL021-RATO-UNT-QTY          PIC 9(04).           00200000
