000100************************************************************      00010000
000200*    RECORD PURPOSE: TO FORMAT UPDATE TRANSACTIONS FOR            00020000
000300*                    LOGISTICS DOMAIN TABLES                      00030000
000400*                    XLT_MDSE_INV_PARM                            00040012
000500*                                                                 00050000
000600*    RECORD LENGTH:  330 BYTES                                    00060019
000700*    RECORD FORMAT:  SEQUENTIAL                                   00070000
000800*                                                                 00080000
000900*  THE VALUES OF ACTION-TYPE CONTROLS THE  THE SEQUENCE IN        00090012
001000*  WHICH THE UPDATING IS DONE. PROCESSING ORDER IS INSERTS,       00100012
001100*  MODIFIES THEN DELETES.                                         00110012
001200*                                                                 00120000
001300************************************************************      00130000
001400 01 XL053-INVPAR-TRANS-REC.                                       00140016
001500     05 XL053-COMMON-AREA.                                        00150016
001600         10 XL053-ACTION-TYPE         PIC X(01)   VALUE SPACES.   00160016
001700             88 XL053-INSERT                      VALUE '1'.      00170016
001800             88 XL053-MODIFY                      VALUE '2'.      00180016
001900             88 XL053-DELETE                      VALUE '3'.      00190016
002000     05 XL053-DATA-AREA.                                          00200016
002010          10 XL053-INV-ID             PIC  S9(9) COMP.            00201018
002100          10 XL053-LOC-NBR            PIC  S9(4) COMP VALUE ZEROS.00210016
002200          10 XL053-INV-DTE            PIC   X(10) VALUE SPACES.   00220016
002300          10 XL053-PLND-INV-DTE       PIC   X(10) VALUE SPACES.   00230016
002400          10 XL053-SCN-INV-IND        PIC   X(1)  VALUE SPACES.   00240016
002500          10 XL053-UNIT-BK-DTE        PIC   X(10) VALUE SPACES.   00250016
002600          10 XL053-FIN-BK-DTE         PIC   X(10) VALUE SPACES.   00260016
002700          10 XL053-PLND-UNIT-BK-DTE   PIC   X(10) VALUE SPACES.   00270016
002800          10 XL053-PLND-FIN-BK-DTE    PIC   X(10) VALUE SPACES.   00280016
002900          10 XL053-INV-RCVD-DTE       PIC   X(10) VALUE SPACES.   00290016
003000          10 XL053-STKRM-DAY-QTY      PIC  S9(4) COMP VALUE ZEROS.00300016
003100          10 XL053-CORR-DAY-QTY       PIC  S9(4) COMP VALUE ZEROS.00310016
003200          10 XL053-SOR-LAST-UPD-TMST  PIC   X(26) VALUE SPACES.   00320016
003300          10 XL053-SOR-UPD-BY-USR-ID  PIC   X(8)  VALUE SPACES.   00330016
003400          10 XL053-LDGR-CTOFF-TMST    PIC   X(26) VALUE SPACES.   00340016
003500          10 XL053-DC-CTOFF-DTE       PIC   X(10) VALUE SPACES.   00350016
003600          10 XL053-PHY-CNT-TMST       PIC   X(26) VALUE SPACES.   00360016
003700          10 XL053-SLS-ADJ-CPLD-IND   PIC   X(1)  VALUE SPACES.   00370016
003800          10 XL053-SCHD-PHY-CNT-CDE   PIC   X(2)  VALUE SPACES.   00380017
003900          10 XL053-XFER-INV-CTOFF-DTE PIC   X(10) VALUE SPACES.   00390016
004000          10 XL053-SHEET-INV-CPLD-IND PIC   X(1)  VALUE SPACES.   00400016
004100          10 XL053-UNT-BKG-STAT-CDE   PIC   X(2)  VALUE SPACES.   00410017
004200          10 XL053-FIL-TOT-BAL-CDE    PIC   X(1)  VALUE SPACES.   00420016
004300          10 XL053-STKRM-WDRWL-IND    PIC   X(1)  VALUE SPACES.   00430016
004400          10 XL053-MFSTNG-IND         PIC   X(1)  VALUE SPACES.   00440016
004500          10 XL053-INV-SRVC-CDE       PIC   X(2)  VALUE SPACES.   00450017
004600          10 XL053-SHEET-INV-REQR-IND PIC   X(1)  VALUE SPACES.   00460016
004700          10 XL053-TMST-EDT-STAT-CDE  PIC   X(2)  VALUE SPACES.   00470017
004710          10 XL053-INV-NM.                                        00471023
004711             15  XL053-INV-NM-LEN     PIC   S9(4) COMP.           00471123
004712             15  XL053-INV-NM-TEXT    PIC   X(20) VALUE SPACES.   00471223
004720          10 XL053-ACTV-IND           PIC   X(1)  VALUE SPACES.   00472017
004730          10 XL053-OPN-FSCL-MN-NBR    PIC   X(2)  VALUE SPACES.   00473017
004740          10 XL053-OPN-FSCL-MN-DTE    PIC   X(10) VALUE SPACES.   00474022
004750          10 XL053-ITM-CTOFF-IND      PIC   X(1)  VALUE SPACES.   00475017
004760          10 XL053-SHTG-ACTL-INV-DTE  PIC   X(10) VALUE SPACES.   00476018
004770          10 XL053-JOB-NM             PIC   X(8)  VALUE SPACES.   00477017
004780          10 XL053-INV-CLO-DTE        PIC   X(10) VALUE SPACES.   00478018
004790          10 XL053-FINCL-INV-STAT-CDE PIC   X(2)  VALUE SPACES.   00479017
004791          10 XL053-LOC-INV-STAT-CDE   PIC   X(2)  VALUE SPACES.   00479117
004792          10 XL053-LOC-DEL-RSN-TXT    PIC   X(25) VALUE SPACES.   00479217
004793          10 XL053-LOC-DEL-DTE        PIC   X(10) VALUE SPACES.   00479318
004800          10  FILLER                  PIC   X(25) VALUE SPACES.   00480023
