000100******************************************************************00010001
000200*** TABLE XLT_STR_GP_PRCHG REFORMATTED                            00020001
000300*   FILE LAYOUT FOR STR_GP_PRCHG                                  00030001
000400***                                                               00040001
000500*** RECORD LENGTH:  71 BYTES                                      00050001
000600******************************************************************00060001
      * CHANGE LOG                                                      00061001
      ***                                                               00062001
      * 7/17/2012 - DAVE WELLER                                         00063001
      *     ADDED THE XL056-SOR-CRE-TMST FIELD                          00064001
000600******************************************************************00065001
000700 01  XL056-DCLXL056.                                              00066001
000800     10 XL056-STR-GP-TYP-CDE          PIC  S9(4) COMP.            00067001
000900     10 XL056-STR-GP-ID               PIC  S9(4) COMP.            00068001
001000     10 XL056-PRCHG-ID                PIC  S9(9) COMP.            00069001
001100     10 XL056-PRCHG-EFF-DTE.                                      00070001
001200        15 XL056-PRCHG-EFF-CC         PIC   X(2).                 00080001
001300        15 XL056-PRCHG-EFF-YY         PIC   X(2).                 00090001
001400        15 FILLER                     PIC   X(1).                 00100001
001500        15 XL056-PRCHG-EFF-MM         PIC   X(2).                 00110001
001600        15 FILLER                     PIC   X(1).                 00120001
001700        15 XL056-PRCHG-EFF-DD         PIC   X(2).                 00130001
001800     10 XL056-LAST-UPD-TMST           PIC   X(26).                00140001
001900     10 XL056-LAST-ACTN-CDE           PIC   X(01).                00150001
001800     10 XL056-SOR-CRE-TMST            PIC   X(26).                00160001
