000100*---------------------------------------------------------------*         
000200*                                                               *         
000300*    XLRD027 - LOGISTICS ITEM PACK DATA TEMPLATE COPYBOOK       *         
000400*    LENGTH  - 144 BYTES                                        *         
000500*---------------------------------------------------------------*         
000600*    WR/PITS#     DATE        DESCRIPTION                       *         
000700*    --------   ----------   -----------------------------      *         
000800*    WR24572    06/05/2003   INITIAL CREATION                   *         
000900*---------------------------------------------------------------*         
001000     05  XL027-PACK-RECORD.                                               
001000         10  XL027-PACK-DATA.                                             
001100             15  XL027-PACK-PK-SKU-NBR        PIC 9(08).                  
001200             15  XL027-PACK-PK-DESC           PIC X(40).                  
001300             15  XL027-PACK-DEPT-NBR          PIC 9(04).                  
001400             15  XL027-PACK-MAJ-CL-NBR        PIC 9(04).                  
001500             15  XL027-PACK-SUB-CL-NBR        PIC 9(04).                  
001600             15  XL027-PACK-DC-ORD-MULT-QTY   PIC 9(04).                  
001700             15  XL027-PACK-ERROR-MESSAGE     PIC X(25).                  
001700             15  XL027-FILLER                 PIC X(55).                  
