000100******************************************************************00010001
000200*** TABLE XLT_PRCHG_MDSE WITH NULL FIELDS.                        00020001
000300*   FILE LAYOUT FOR XLT_PRCHG_MDSE                                00030001
000400***                                                               00040001
000500*** RECORD LENGTH:  057 BYTES                                     00050002
000600******************************************************************00060001
      * CHANGE LOG                                                      00061001
      ***                                                               00062001
      * 7/19/2012 - DAVE WELLER                                         00063001
      *     EXPANDED RECORD LENGTH TO 57                                00063102
      *     ADDED THE XL057-PREV-UNT-RTL-AMT FIELD                      00064001
      *     ADDED THE XL057-PREV-UNT-RTL-AMT-NI FIELD                   00065001
000600******************************************************************00066001
000700 01  XL057-DCLXL057.                                              00067001
000800     05 XL057-STR-GP-TYP-CDE          PIC   S9(4) COMP.           00068001
000900     05 XL057-STR-GP-ID               PIC   S9(4) COMP.           00069001
001000     05 XL057-PRCHG-ID                PIC   S9(9) COMP.           00070001
001100     05 XL057-PRCHG-MDSE-ID           PIC   S9(9) COMP.           00080001
001200     05 XL057-SKU-NBR                 PIC   S9(8)V COMP-3.        00090001
001300     05 XL057-SKU-NBR-NI              PIC   X(01).                00100001
001400     05 XL057-UNT-RTL-AMT             PIC   S9(7)V9(2) COMP-3.    00110001
001500     05 XL057-UNT-RTL-AMT-NI          PIC   X(1).                 00120001
001600     05 XL057-LAST-UPD-TMST           PIC   X(26).                00130001
001700     05 XL057-LAST-ACTN-CDE           PIC   X(1).                 00140001
           05 XL057-PREV-UNT-RTL-AMT        PIC   S9(7)V9(2) COMP-3.    00150004
001500     05 XL057-PREV-UNT-RTL-AMT-NI     PIC   X(1).                 00160004
