004900******************************************************************00490000
005000* COULD NOT USE THE DCLGEN FOR XLT_MDSE_INV_PARM (XLT00025)       00500000
005010* DSNINTAUL ADDED ADDITIONAL CHARACTER BEFORE LAST COLUMN         00501000
005100******************************************************************00510000
005110 01  XL064-DCLXLT0025.                                            00511001
005300     10 XL064-INV-ID                  PIC  S9(9) COMP.            00530000
005400     10 XL064-LOC-NBR                 PIC  S9(4) COMP.            00540000
005500     10 XL064-INV-DTE                 PIC   X(10).                00550000
005600     10 XL064-PLND-INV-DTE            PIC   X(10).                00560000
005700     10 XL064-SCN-INV-IND             PIC   X(1).                 00570000
005800     10 XL064-UNIT-BK-DTE             PIC   X(10).                00580000
005900     10 XL064-FIN-BK-DTE              PIC   X(10).                00590000
006000     10 XL064-PLND-UNIT-BK-DTE        PIC   X(10).                00600000
006100     10 XL064-PLND-FIN-BK-DTE         PIC   X(10).                00610000
006200     10 XL064-INV-RCVD-DTE            PIC   X(10).                00620000
006300     10 XL064-STKRM-DAY-QTY           PIC  S9(4) COMP.            00630000
006400     10 XL064-CORR-DAY-QTY            PIC  S9(4) COMP.            00640000
006500     10 XL064-SOR-LAST-UPD-TMST       PIC   X(26).                00650000
006600     10 XL064-SOR-UPD-BY-USR-ID       PIC   X(8).                 00660000
006700     10 XL064-LDGR-CTOFF-TMST         PIC   X(26).                00670000
006800     10 XL064-DC-CTOFF-DTE            PIC   X(10).                00680000
006900     10 XL064-PHY-CNT-TMST            PIC   X(26).                00690000
007000     10 XL064-SLS-ADJ-CPLD-IND        PIC   X(1).                 00700000
007100     10 XL064-SCHD-PHY-CNT-CDE        PIC   X(2).                 00710000
007200     10 XL064-XFER-INV-CTOFF-DTE      PIC   X(10).                00720000
007300     10 XL064-SHEET-INV-CPLD-IND      PIC   X(1).                 00730000
007400     10 XL064-UNT-BKG-STAT-CDE        PIC   X(2).                 00740000
007500     10 XL064-FIL-TOT-BAL-CDE         PIC   X(1).                 00750000
007600     10 XL064-STKRM-WDRWL-IND         PIC   X(1).                 00760000
007700     10 XL064-MFSTNG-IND              PIC   X(1).                 00770000
007800     10 XL064-INV-SRVC-CDE            PIC   X(2).                 00780000
007900     10 XL064-SHEET-INV-REQR-IND      PIC   X(1).                 00790000
008000     10 XL064-TMST-EDT-STAT-CDE       PIC   X(2).                 00800000
008100     10 XL064-INV-NM.                                             00810000
008200         49 XL064-INV-NM-LEN               PIC S9(4) COMP.        00820000
008300         49 XL064-INV-NM-TEXT              PIC X(20).             00830000
008400     10 XL064-ACTV-IND                PIC   X(1).                 00840000
008500     10 XL064-OPN-FSCL-MN-NBR         PIC   X(2).                 00850000
008600     10 XL064-OPN-FSCL-MN-DTE         PIC   X(10).                00860000
008700     10 XL064-ITM-CTOFF-IND           PIC   X(1).                 00870000
008800     10 XL064-SHTG-ACTL-INV-DTE       PIC   X(10).                00880000
008900     10 XL064-JOB-NM                  PIC   X(8).                 00890000
009000     10 XL064-INV-CLO-DTE             PIC   X(10).                00900000
009100     10 XL064-FINCL-INV-STAT-CDE      PIC   X(2).                 00910000
009200     10 XL064-LOC-INV-STAT-CDE        PIC   X(2).                 00920000
009300     10 XL064-LOC-DEL-RSN-TXT         PIC   X(25).                00930000
009310     10 FILLER                        PIC   X(01).                00931000
009400     10 XL064-LOC-DEL-DTE             PIC   X(10).                00940000
009410     10 FILLER                        PIC   X(01).                00941002
009500******************************************************************00950000
009700******************************************************************00970000
