004900******************************************************************00001001
005000* BRAND EXTRACT FILE                                              00002001
005100******************************************************************00004001
           05 XL065-DATA.                                               00005013
000800        10 XL065-BRND-ID                PIC  S9(4)  COMP.         00006113
005400        10 XL065-BRND-DESC              PIC  X(20).               00007013
005500        10 XL065-BRND-TYP-CDE           PIC  X(01).               00008013
000300        10 XL065-STYL-ID                PIC  S9(8)V COMP-3.       00010013
009410     05 FILLER                          PIC  X(22).               00029214
009700******************************************************************00029401
