000100************************************************************      00010000
000200*    COPYBOOK NAME : XLRD058                                      00020000
000300*    RECORD PURPOSE: TO FORMAT UPDATE TRANSACTIONS FOR            00030000
000400*                    LOGISTICS DOMAIN TABLES XLT_VND,             00040000
000500*                    XLT_VND_DEPT, XLT_VND_CPBL AND               00050000
000600*                    XLT_VND_CPBL_CDE                             00060000
000700*    RECORD LENGTH:  900 BYTES                                    00070000
000800*    RECORD FORMAT:  SEQUENTIAL                                   00080000
000900*                                                                 00090000
001000*  THE VALUES OF ACTION-TYPE CONTROLS THE SEQUENCE IN WHICH       00100000
001100*  THE UPDATING IS DONE.  PROCESSING ORDER IS INSERTS, UPDATES    00110000
001200*  THEN DELETES.  TABLES MUST BE ADDED IN THIS ORDER:             00120000
001300*  XLT_VND, XLT_VND_DEPT, XLT_VND_CPBL_CDE, XLT_VND_CPBL          00130000
001400*  DELETES ARE DONE IN THE REVERSE ORDER.                         00140000
001500*                                                                 00150000
001600************************************************************      00160000
001700 01  XL058-TRANS-REC.                                             00170000
001800     05  XL058-COMMON-AREA.                                       00180000
001900         10  XL058-ACTION-TYPE            PIC X(01) VALUE SPACES. 00190000
002000             88  XL058-INSERT                       VALUE '1'.    00200000
002100             88  XL058-UPDATE                       VALUE '2'.    00210000
002200             88  XL058-DELETE                       VALUE '3'.    00220000
002300         10  FILLER                       PIC X(01) VALUE SPACES. 00230000
002400         10  XL058-RECORD-TYPE            PIC X(01) VALUE SPACES. 00240000
002500             88  XL058-VND                          VALUE 'A'.    00250000
002600             88  XL058-VND-DEPT                     VALUE 'B'.    00260000
002700             88  XL058-VND-CPBL-CDE                 VALUE 'C'.    00270000
002800             88  XL058-VND-CPBL                     VALUE 'D'.    00280000
002900         10  FILLER                       PIC X(01) VALUE SPACES. 00290000
003000         10  XL058-SORT-SEQUENCE          PIC X(02) VALUE SPACES. 00300000
003100     05  XL058-TRANS-DATA.                                        00310000
003200         10  FILLER                       PIC X(894).             00320000
003300                                                                  00330000
003400***                                                               00340000
003500                                                                  00350000
003600     05  XL058-VEND-DATA                  REDEFINES               00360000
003700                                          XL058-TRANS-DATA.       00370000
003800         10  XL058-VEND-ENT-ID            PIC 9(09).              00380000
003900         10  FILLER                       PIC X(01).              00390000
004000         10  XL058-VEND-VND-NBR           PIC X(10).              00400000
004100         10  FILLER                       PIC X(01).              00410000
004200         10  XL058-VEND-VND-TYP-CDE       PIC X(01).              00420000
004300         10  FILLER                       PIC X(01).              00430000
004400         10  XL058-VEND-PRTNR-TYP-CDE     PIC X(02).              00440000
004500         10  FILLER                       PIC X(01).              00450000
004600         10  XL058-VEND-PRIM-VND-NM       PIC X(30).              00460000
004700         10  FILLER                       PIC X(01).              00470000
004800         10  XL058-VEND-STAT-CDE          PIC X(01).              00480000
004900         10  FILLER                       PIC X(01).              00490000
005000         10  XL058-VEND-SCAC-CDE          PIC X(04).              00500000
005100         10  FILLER                       PIC X(01).              00510000
005200         10  XL058-VEND-CFY-SLSRNK-NBR    PIC 9(04).              00520000
005300         10  FILLER                       PIC X(01).              00530000
005400         10  XL058-VEND-PFY-SLSRNK-NBR    PIC 9(04).              00540000
005500         10  FILLER                       PIC X(01).              00550000
005600         10  XL058-VEND-P12MN-SLSRNK-NBR  PIC 9(04).              00560000
005700         10  FILLER                       PIC X(01).              00570000
005800         10  XL058-VEND-EDI-PO-PREPK-CDE  PIC X(01).              00580000
005900         10  FILLER                       PIC X(01).              00590000
006000         10  XL058-VEND-SOR-CRE-TMST      PIC X(26).              00600000
006100         10  FILLER                       PIC X(01).              00610000
006200         10  XL058-VEND-SOR-LAST-UPD-TMST PIC X(26).              00620000
006300         10  FILLER                       PIC X(01).              00630000
006400         10  XL058-VEND-SHRT-VND-NM       PIC X(10).              00640000
006500         10  FILLER                       PIC X(749).             00650000
006600                                                                  00660000
006700***                                                               00670000
006800                                                                  00680000
006900     05  XL058-VNDP-DATA                  REDEFINES               00690000
007000                                          XL058-TRANS-DATA.       00700000
007100         10  XL058-VNDP-ENT-ID            PIC 9(09).              00710000
007200         10  FILLER                       PIC X(01).              00720000
007300         10  XL058-VNDP-DEPT-NBR          PIC 9(04).              00730003
007400         10  FILLER                       PIC X(01).              00740000
007500         10  XL058-VNDP-DC-RET-CDE        PIC X(02).              00750001
007600         10  FILLER                       PIC X(01).              00760000
007700         10  XL058-VNDP-DEPT-TYP-CDE      PIC X(01).              00770001
007710         10  FILLER                       PIC X(01).              00771001
007720         10  XL058-VNDP-VND-DEPT-STAT-CDE PIC X(01).              00772001
007800         10  FILLER                       PIC X(873).             00780004
007900                                                                  00790000
008000***                                                               00800000
008100                                                                  00810000
008200     05  XL058-VNCP-DATA                  REDEFINES               00820000
008300                                          XL058-TRANS-DATA.       00830000
008400         10  XL058-VNCP-ENT-ID            PIC 9(09).              00840000
008500         10  FILLER                       PIC X(01).              00850000
008600         10  XL058-VNCP-VND-CPBL-CDE      PIC X(03).              00860000
008700         10  FILLER                       PIC X(01).              00870000
008800         10  XL058-VNCP-EFF-BEG-DTE       PIC X(10).              00880000
008900         10  FILLER                       PIC X(01).              00890000
009000         10  XL058-VNCP-EFF-END-DTE       PIC X(10).              00900000
009100         10  FILLER                       PIC X(01).              00910000
009200         10  XL058-VNCP-CRE-DTE           PIC X(10).              00920000
009300         10  FILLER                       PIC X(01).              00930000
009400         10  XL058-VNCP-LAST-UPD-TMST     PIC X(26).              00940000
009500         10  FILLER                       PIC X(01).              00950000
009600         10  XL058-VNCP-LAST-UPD-BY-USR-ID PIC X(08).             00960000
009700         10  FILLER                       PIC X(812).             00970000
009800                                                                  00980000
009900***                                                               00990000
010000                                                                  01000000
010100     05  XL058-VNCD-DATA                  REDEFINES               01010000
010200                                          XL058-TRANS-DATA.       01020000
010300         10  XL058-VNCD-VND-CPBL-CDE      PIC X(03).              01030000
010400         10  FILLER                       PIC X(01).              01040000
010500         10  XL058-VNCD-VND-CPBL-DESC     PIC X(30).              01050000
010600         10  FILLER                       PIC X(01).              01060000
010700         10  XL058-VNCD-LAST-UPD-TMST     PIC X(26).              01070000
010800         10  FILLER                       PIC X(01).              01080000
010900         10  XL058-VNCD-LAST-UPD-BY-USR-ID PIC X(08).             01090000
010910         10  FILLER                       PIC X(01).              01091005
010920         10  XL058-VNCD-ACTV-IND          PIC X(01).              01092005
011000         10  FILLER                       PIC X(822).             01100005
