000100************************************************************      00010000
000110* XLRD045                                                  *      00011003
000120************************************************************      00012003
000200*    RECORD PURPOSE: TO PROVIDE A FORMAT FOR THE BMC UNLOAD       00020003
000300*                    OF DB2 TABLE XLT_USR (W/ NULLS)              00030004
001000*    RECORD LENGTH:  200 BYTES                                    00100003
001100*    RECORD FORMAT:  SEQUENTIAL                                   00110000
001200*                                                                 00120000
002100************************************************************      00210000
002200                                                                  00220000
002300 01  XL045-RECORD.                                                00230003
002400     05  XL045-USR-ID             PIC X(08) VALUE SPACE.          00240003
002500     05  XL045-USR-LAST-NM        PIC X(40) VALUE SPACE.          00250003
002600     05  XL045-USR-FRST-NM        PIC X(40) VALUE SPACE.          00260003
002700     05  FILLER                   PIC X(01) VALUE SPACE.          00270006
002710     05  XL045-USR-MID-INIT       PIC X(01) VALUE SPACE.          00271003
002720     05  FILLER                   PIC X(01) VALUE SPACE.          00272006
002800     05  XL045-USR-RVKE-IND       PIC X(01) VALUE SPACE.          00280003
002900     05  XL045-DFLT-PRTR-ID       PIC X(08) VALUE SPACE.          00290007
003000     05  XL045-EMP-ID             PIC X(11) VALUE SPACE.          00300003
003100     05  XL045-LAST-UPD-TMST      PIC X(26) VALUE SPACE.          00310003
003200     05  FILLER                   PIC X(63) VALUE SPACE.          00320007
