000100*----------------------------------------------------------*              
000200*    PURCHASE ORDER - DOMAIN TEMPLATE                      *              
000300*    XLRD015 - XXT_PO                                      *              
000400*    LENGTH  - 368 BYTES                                   *              
000500*                                                          *              
000600*----------------------------------------------------------*              
      * ****************************************************************        
      * CHANGE DESCRIPTION                                                      
      * ****************************************************************        
      * DATE  05/12/2010                                                        
      *  CHANGE MADE: ADDED A NEW IR INDICATOR(WHSE_RPLNT_IND) IN               
      *  TPURCHS TABLE UNDER IMPORT REPLENISHMENT PROJECT. ADDED THE NEW        
      *  INDICATOR FIELD XL015-WHSE-RPLNT-IND                                   
      * MADE BY: MONIKA SACHDEVA         TKID: TKMAW78                          
      * CHANGES TAGGED AS MS 05/12/2010                                         
      * ****************************************************************        
000700     02  XL015-RECORD.                                                    
000800         05 XL015-DATA-AREA.                                              
000900             10 XL015-PO-NBR             PIC 9(08).                       
001000             10 XL015-DEPT-NBR           PIC 9(04).                       
001100             10 XL015-BYR-NBR            PIC 9(04).                       
001200             10 XL015-ENT-ID             PIC 9(10).                       
001300             10 XL015-CRE-DTE            PIC X(08).                       
001400             10 XL015-NOT-BEF-DTE        PIC X(08).                       
001500             10 XL015-NOT-AFT-DTE        PIC X(14).                       
001600             10 XL015-OTB-EOW-DTE        PIC X(08).                       
001700             10 XL015-CLOSE-DTE          PIC X(14).                       
001800             10 XL015-PAYT-TERM-ID       PIC 9(05).                       
001900             10 XL015-FRGT-TERM-ID       PIC 9(05).                       
002000             10 XL015-STAT-CDE           PIC X(01).                       
002100             10 XL015-ORIG-PO-APVL-DTE   PIC X(08).                       
002200             10 XL015-ORIG-APP-BY-USR-ID PIC X(08).                       
002300             10 XL015-EDI-SNT-IND        PIC X(01).                       
002400             10 XL015-EDI-PO-IND         PIC X(01).                       
002500             10 XL015-IMPRT-PO-IND       PIC X(01).                       
002600             10 XL015-FCTRY-NM           PIC X(10).                       
002700             10 XL015-POE-CDE            PIC X(03).                       
002800             10 XL015-FOB-CDE            PIC X(03).                       
002900             10 XL015-PO-TYP-CDE         PIC X(04).                       
003000             10 XL015-PK-BY-STR-IND      PIC X(01).                       
003100             10 XL015-CONSLR-ACTL-DTE    PIC X(08).                       
003200             10 XL015-CONSLR-REQR-DTE    PIC X(08).                       
003300             10 XL015-CONSLR-RLSE-CDE    PIC X(01).                       
003400             10 XL015-TKT-MKR-ACTL-DTE   PIC X(08).                       
003500             10 XL015-TKT-MKR-REQR-DTE   PIC X(08).                       
003600             10 XL015-TKT-MKR-RLSE-CDE   PIC X(01).                       
003700             10 XL015-RLSE-DTE           PIC X(08).                       
003800             10 XL015-FRST-FCTRY-DTE     PIC X(08).                       
003900             10 XL015-LAST-FCTRY-DTE     PIC X(08).                       
004000             10 XL015-DIR-STR-IND        PIC X(01).                       
004100             10 XL015-EXTD-NOT-AFT-DTE   PIC X(08).                       
004200             10 XL015-HNG-IND            PIC X(01).                       
004300             10 XL015-NW-STR-ORD-IND     PIC X(01).                       
004400             10 XL015-PKGNG-CDE          PIC X(01).                       
004500             10 XL015-PKGNG-DESC         PIC X(20).                       
004600             10 XL015-PTKT-LDTM-DAYS-QTY PIC 9(05).                       
004700             10 XL015-SEASET-SHRT-DESC   PIC X(05).                       
004800             10 XL015-SEASET-YR          PIC X(04).                       
004900             10 XL015-CRE-BY-USR-ID      PIC X(08).                       
005000             10 XL015-PTKT-IND           PIC X(01).                       
005100             10 XL015-C-O-PROD-CDE       PIC X(03).                       
005200             10 XL015-AGNT-OFC-CNTRY-CDE PIC X(03).                       
005300             10 XL015-IMPRT-VND-ID       PIC 9(10).                       
005400             10 XL015-IMPRT-FCTRY-ID     PIC 9(10).                       
005500             10 XL015-UNT-PER-CBMT-QTY   PIC 9(06).                       
005600             10 XL015-QTA-CTG-CDE        PIC X(06).                       
005700             10 XL015-AGNT-ENT-ID        PIC X(10).                       
005800             10 XL015-IMPRT-VND-NM       PIC X(35).                       
005900             10 XL015-IMPRT-FCTRY-NM     PIC X(35).                       
006000             10 XL015-DERVD-LBL-TYP-CDE  PIC X(01).                       
006100             10 XL015-DELY-ID            PIC X(10).                       
006200             10 XL015-PO-SHRT-CYC-IND    PIC X(01).                       
                   10 XL015-WHSE-RPLNT-IND     PIC X(01).                       
