000100************************************************************      00010000
000200*    RECORD PURPOSE: TO FORMAT UPDATE TRANSACTIONS FOR            00020000
000300*                    LOGISTICS DOMAIN USER TABLES (TO START       00030000
000400*                    WITH, IT WILL BE XLT_USR).                   00040001
000500*                    THIS INCLUDE IS SET-UP TO INCLUDE THE        00050001
000600*                    OTHER TABLES WITHIN THE USER DOMAIN          00060001
000700*                    BUT ARE NOT BEING USED BY XL AT THIS         00070001
000800*                    TIME (XXT_USR_TYP, XXT_SYS_USR,              00080001
000900*                    XXT_USR_GP AND XXT_GP_MBRSHP).               00090001
001000*    RECORD LENGTH:  153 BYTES                                    00100000
001100*    RECORD FORMAT:  SEQUENTIAL                                   00110000
001200*                                                                 00120000
001300*  THE VALUES OF ACTION-TYPE CONTROLS THE SEQUENCE IN WHICH       00130000
001400*  THE UPDATING IS DONE.  PROCESSING ORDER IS DELETES,            00140000
001500*  ADDS THEN MODIFIES.  TABLES MUST BE ADDED IN THIS ORDER:       00150000
001600*  XXT_USR_TYP, XXT_SYS_USR, XLT_USR, XXT_USR_GP AND              00160001
001700*  XXT_USR_GP_MBRSHP                                              00170001
001800*  DELETES ARE DONE IN THE REVERSE ORDER.  MODIFIES ARE           00180001
001900*  NOT DEPENDENT ON ANY ORDER.                                    00190001
002000*                                                                 00200000
002100************************************************************      00210000
002200                                                                  00220000
002300 01  XL038-TRANS-REC.                                             00230001
002400     05  XL038-COMMON-AREA.                                       00240001
002500         10  XL038-ACTION-TYPE    PIC X(01)      VALUE  SPACES.   00250002
002600             88  XL038-DELETE                    VALUE '1'.       00260001
002700             88  XL038-ADD                       VALUE '2'.       00270001
002800             88  XL038-MODIFY                    VALUE '3'.       00280001
002900         10  XL038-RECORD-TYPE    PIC X(01)      VALUE SPACES.    00290001
003000             88  XL038-USR-TYPE                  VALUE 'A'.       00300001
003100             88  XL038-SYS-USR                   VALUE 'B'.       00310001
003200             88  XL038-USR                       VALUE 'C'.       00320001
003300             88  XL038-USR-GP                    VALUE 'D'.       00330001
003400             88  XL038-USR-GP-MBRSHP             VALUE 'E'.       00340001
003500         10  XL038-SORT-SEQ       PIC X(01)      VALUE SPACES.    00350001
003510             88  XL038-USR-GP-MBRSHP-DLT         VALUE 'A'.       00351001
003520             88  XL038-USR-GP-DLT                VALUE 'B'.       00352001
003530             88  XL038-USR-DLT                   VALUE 'C'.       00353001
003540             88  XL038-SYS-USR-DLT               VALUE 'D'.       00354001
003550             88  XL038-USR-TYPE-DLT              VALUE 'E'.       00355001
003551             88  XL038-USR-TYPE-ADD              VALUE 'F'.       00355101
003552             88  XL038-SYS-USR-ADD               VALUE 'G'.       00355201
003553             88  XL038-USR-ADD                   VALUE 'H'.       00355301
003554             88  XL038-USR-GP-ADD                VALUE 'I'.       00355401
003560             88  XL038-USR-GP-MBRSHP-ADD         VALUE 'J'.       00356001
003561             88  XL038-USR-TYPE-UPD              VALUE 'K'.       00356101
003570             88  XL038-SYS-USR-UPD               VALUE 'L'.       00357001
003580             88  XL038-USR-UPD                   VALUE 'M'.       00358001
003590             88  XL038-USR-GP-UPD                VALUE 'N'.       00359001
003591             88  XL038-USR-GP-MBRSHP-UPD         VALUE 'O'.       00359101
003600     05  XL038-TRANS-DATA.                                        00360001
003700         10  FILLER               PIC X(150).                     00370001
003800     05  XL038-USR-TYPE-DATA      REDEFINES                       00380001
003900                                  XL038-TRANS-DATA.               00390001
004000         10  XL038-UT-TYP-CDE     PIC X(01).                      00400001
004100         10  XL038-UT-TYP-DESC    PIC X(20).                      00410001
004200         10  XL038-UT-FILLER      PIC X(129).                     00420001
004300     05  XL038-SYS-USR-DATA       REDEFINES                       00430001
004400                                  XL038-TRANS-DATA.               00440001
004500         10  XL038-SU-USR-ID      PIC X(08).                      00450001
004600         10  XL038-SU-TYP-CDE     PIC X(01).                      00460001
004700         10  XL038-SU-FILLER      PIC X(141).                     00470001
004800     05  XL038-USR-DATA           REDEFINES                       00480001
004900                                  XL038-TRANS-DATA.               00490001
005000         10  XL038-U-USR-ID       PIC X(08).                      00500001
005100         10  XL038-U-LAST-NM      PIC X(40).                      00510001
005200         10  XL038-U-FRST-NM      PIC X(40).                      00520001
005300         10  XL038-U-MID-INIT     PIC X(01).                      00530001
005400         10  XL038-U-RVKE-IND     PIC X(01).                      00540001
005500         10  XL038-U-DFLT-PRTR-ID PIC X(08).                      00550003
005600         10  XL038-U-EMP-ID       PIC X(11).                      00560001
005700         10  XL038-U-FILLER       PIC X(41).                      00570003
005800     05  XL038-USR-GP-DATA        REDEFINES                       00580001
005900                                  XL038-TRANS-DATA.               00590001
006000         10  XL038-UG-USR-GP-ID   PIC X(08).                      00600001
006100         10  XL038-UG-USR-GP-NM   PIC X(40).                      00610001
006200         10  XL038-UG-FILLER      PIC X(102).                     00620001
006300     05  XL038-USR-GP-MBRSHP      REDEFINES                       00630001
006400                                  XL038-TRANS-DATA.               00640001
006500         10  XL038-UGM-USR-ID     PIC X(08).                      00650001
006600         10  XL038-UGM-USR-GP-ID  PIC X(08).                      00660001
006700         10  XL038-UGM-FILLER     PIC X(134).                     00670001
