000600*----------------------------------------------------------*              
000300*    PURCHASE ORDER - DOMAIN TEMPLATE                      *              
000300*    XLRD016 - XXT_PO_INSTR                                *              
000400*    LENGTH  - 168 BYTES                                   *              
000500*                                                          *              
000600*----------------------------------------------------------*              
000900     02  XL016-RECORD.                                                    
001200         05 XL016-DATA-AREA.                                              
001100             10 XL016-PO-NBR                PIC 9(08).                    
015700             10 XL016-RECIP-CDE             PIC X(02).                    
015800             10 XL016-INSTR-ID              PIC 9(08).                    
015900             10 XL016-INSTR-DESC            PIC X(150).                   
016000*                                                                         
