000100******************************************************************00010000
000200*                         XLRD918                                *00020000
000300*                                                                *00030000
000400*   THIS LAYOUT IS FOR THE PO THAT REQUIRES SPLIT/ALLOCATION     *00040000
000500*   MESSAGES TO BE RESENT                                        *00050000
000600*                                                                *00060000
000700******************************************************************00070000
000800 01  XL918-RECORD.                                                00080000
000900     05  XL918-PO-NBR                     PIC 9(08).              00090000
000910     05  FILLER                           PIC X(01) VALUE ','.    00091000
001000*    05  XL918-SKU-NBR                    PIC 9(08).              00100000
001100     05  XL918-CURR-SPLIT                 PIC 9(09).              00110000
001110     05  FILLER                           PIC X(01) VALUE ','.    00111000
001200     05  XL918-SPLIT-REQ                  PIC X(01).              00120000
001300         88  XL918-SPLIT-REQ-YES                    VALUE 'Y'.    00130000
001400         88  XL918-SPLIT-REQ-NO                     VALUE 'N'.    00140000
001410     05  FILLER                           PIC X(01) VALUE ','.    00141000
001500     05  XL918-CURR-ALLOC                 PIC 9(09).              00150000
001510     05  FILLER                           PIC X(01) VALUE ','.    00151000
001600     05  XL918-ALLOC-REQ                  PIC X(01).              00160000
001800         88  XL918-ALLOC-REQ-YES                    VALUE 'Y'.    00180000
001900         88  XL918-ALLOC-REQ-NO                     VALUE 'N'.    00190000
002000     05  FILLER                           PIC X(47) VALUE SPACES. 00200000
