000100*----------------------------------------------------------*      00010000
000200*  IF THERE IS A DIFFERENCE BETWEEN THE TWO EXTRACT FILES  *      00020000
000300*  THEN AN '*' WILL BE PUT IN THE -DIFF FIELD.             *      00030000
000400*----------------------------------------------------------*      00040000
000500* ****************************************************************00050000
000600* CHANGE DESCRIPTION                                              00060000
000700* ****************************************************************00070000
000800* DATE  05/12/2010                                                00080000
000900*  CHANGE MADE: ADDED A NEW IR INDICATOR(WHSE_RPLNT_IND) IN       00090000
001000*  TPURCHS TABLE UNDER IMPORT REPLENISHMENT PROJECT. ADDED THE NEW00100000
001100*  INDICATOR FIELD XL023-PO-WHSE-RPLNT-IND-DIFF,                  00110000
001200*  XL023-PO-WHSE-RPLNT-IND-RMS AND XL023-PO-WHSE-RPLNT-IND-LGCY   00120000
001300* MADE BY: MONIKA SACHDEVA         TKID: TKMAW78                  00130000
001400* CHANGES TAGGED AS MS 05/12/2010                                 00140000
001500* ****************************************************************00150000
001600  05  XL023-COMPARE-RECORD.                                       00160000
001601      10 XL023-PO-DOMAIN-TEMPLATE-IND      PIC X.                 00160100
001602         88  XL023-XXT-PO                        VALUE '1'.       00160200
001603         88  XL023-XXT-PO-INSTR                  VALUE '2'.       00160300
001604         88  XL023-XXT-PO-DISC                   VALUE '3'.       00160400
001605         88  XL023-XXT-PO-SKU                    VALUE '4'.       00160500
001606         88  XL023-XXT-PO-PK-SKU                 VALUE '5'.       00160600
001607         88  XL023-XXT-PO-PK-SKU-LOC             VALUE '6'.       00160700
001608         88  XL023-XXT-PO-INBD-ALLOC             VALUE '7'.       00160800
001609         88  XL023-XXT-PO-OTBND-ALLOC            VALUE '8'.       00160900
001610      10 XL023-PO-SORT-KEY.                                       00161000
001620         15  XL023-PO-SORT-KEY-PO            PIC  X(08).          00162000
001630         15  XL023-PO-SORT-KEY-DATA          PIC  X(20).          00163000
001631      10 XL023-COMPARE-INDICATOR             PIC  X.              00163100
001632         88  XL023-ON-RMS-ONLY                    VALUE 'A'.      00163200
001633         88  XL023-ON-LEGACY-ONLY                 VALUE 'B'.      00163300
001634         88  XL023-ON-BOTH-RMS-LEGACY             VALUE 'C'.      00163400
001635      10 XL023-COMPARE-DATA-AREA             PIC  X(800).         00163500
001636*                                                                 00163600
001637*----------------------------------------------------------*      00163700
001638*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      00163800
001639*    ORDER HEADER BUSINESS EVENTS                          *      00163900
001640*    XLRD015 - XXT_PO                                      *      00164000
001650*----------------------------------------------------------*      00165000
001660*    ***************  P O   H E A D E R ***************    *      00166000
001670*----------------------------------------------------------*      00167000
001680      10 XL023-PO       REDEFINES XL023-COMPARE-DATA-AREA.        00168000
001690             15 XL023-PO-NBR-DIFF        PIC X(01).               00169000
001700             15 XL023-PO-NBR-RMS         PIC 9(08).               00170000
001800             15 XL023-PO-NBR-LGCY        PIC 9(08).               00180000
001900             15 XL023-DEPT-NBR-DIFF      PIC X(01).               00190000
002000             15 XL023-DEPT-NBR-RMS       PIC 9(04).               00200000
002100             15 XL023-DEPT-NBR-LGCY      PIC 9(04).               00210000
002200             15 XL023-BYR-NBR-DIFF       PIC X(01).               00220000
002300             15 XL023-BYR-NBR-RMS        PIC 9(04).               00230000
002400             15 XL023-BYR-NBR-LGCY       PIC 9(04).               00240000
002500             15 XL023-ENT-ID-DIFF        PIC X(01).               00250000
002600             15 XL023-ENT-ID-RMS         PIC 9(10).               00260000
002700             15 XL023-ENT-ID-LGCY        PIC 9(10).               00270000
002800             15 XL023-AGNT-ENT-ID-DIFF   PIC X(01).               00280000
002900             15 XL023-AGNT-ENT-ID-RMS    PIC X(10).               00290000
003000             15 XL023-AGNT-ENT-ID-LGCY   PIC X(10).               00300000
003100             15 XL023-CRE-DTE-DIFF       PIC X(01).               00310000
003200             15 XL023-CRE-DTE-RMS        PIC X(08).               00320000
003300             15 XL023-CRE-DTE-LGCY       PIC X(08).               00330000
003400             15 XL023-NOT-BEF-DTE-DIFF   PIC X(01).               00340000
003500             15 XL023-NOT-BEF-DTE-RMS    PIC X(08).               00350000
003600             15 XL023-NOT-BEF-DTE-LGCY   PIC X(08).               00360000
003700             15 XL023-NOT-AFT-DTE-DIFF   PIC X(01).               00370000
003800             15 XL023-NOT-AFT-DTE-RMS    PIC X(14).               00380000
003900             15 XL023-NOT-AFT-DTE-LGCY   PIC X(14).               00390000
004000             15 XL023-OTB-EOW-DTE-DIFF   PIC X(01).               00400000
004100             15 XL023-OTB-EOW-DTE-RMS    PIC X(08).               00410000
004200             15 XL023-OTB-EOW-DTE-LGCY   PIC X(08).               00420000
004300             15 XL023-CLOSE-DTE-DIFF     PIC X(01).               00430000
004400             15 XL023-CLOSE-DTE-RMS      PIC X(14).               00440000
004500             15 XL023-CLOSE-DTE-LGCY     PIC X(14).               00450000
004600             15 XL023-PAYT-TERM-ID-DIFF  PIC X(01).               00460000
004700             15 XL023-PAYT-TERM-ID-RMS   PIC 9(05).               00470000
004800             15 XL023-PAYT-TERM-ID-LGCY  PIC 9(05).               00480000
004900             15 XL023-FRGT-TERM-ID-DIFF  PIC X(01).               00490000
005000             15 XL023-FRGT-TERM-ID-RMS   PIC 9(05).               00500000
005100             15 XL023-FRGT-TERM-ID-LGCY  PIC 9(05).               00510000
005200             15 XL023-STAT-CDE-DIFF      PIC X(01).               00520000
005300             15 XL023-STAT-CDE-RMS       PIC X(01).               00530000
005400             15 XL023-STAT-CDE-LGCY      PIC X(01).               00540000
005500             15 XL023-ORIG-PO-APVL-DTE-DIFF   PIC X(01).          00550000
005600             15 XL023-ORIG-PO-APVL-DTE-RMS    PIC X(08).          00560000
005700             15 XL023-ORIG-PO-APVL-DTE-LGCY   PIC X(08).          00570000
005800             15 XL023-ORIG-APP-BY-USR-ID-DIFF PIC X(01).          00580000
005900             15 XL023-ORIG-APP-BY-USR-ID-RMS  PIC X(08).          00590000
006000             15 XL023-ORIG-APP-BY-USR-ID-LGCY PIC X(08).          00600000
006100             15 XL023-EDI-SNT-IND-DIFF   PIC X(01).               00610000
006200             15 XL023-EDI-SNT-IND-RMS    PIC X(01).               00620000
006300             15 XL023-EDI-SNT-IND-LGCY   PIC X(01).               00630000
006400             15 XL023-EDI-PO-IND-DIFF    PIC X(01).               00640000
006500             15 XL023-EDI-PO-IND-RMS     PIC X(01).               00650000
006600             15 XL023-EDI-PO-IND-LGCY    PIC X(01).               00660000
006700             15 XL023-IMPRT-PO-IND-DIFF  PIC X(01).               00670000
006800             15 XL023-IMPRT-PO-IND-RMS   PIC X(01).               00680000
006900             15 XL023-IMPRT-PO-IND-LGCY  PIC X(01).               00690000
007000             15 XL023-FCTRY-NM-DIFF      PIC X(01).               00700000
007100             15 XL023-FCTRY-NM-RMS       PIC X(10).               00710000
007200             15 XL023-FCTRY-NM-LGCY      PIC X(10).               00720000
007300             15 XL023-POE-CDE-DIFF       PIC X(01).               00730000
007400             15 XL023-POE-CDE-RMS        PIC X(03).               00740000
007500             15 XL023-POE-CDE-LGCY       PIC X(03).               00750000
007600             15 XL023-FOB-CDE-DIFF       PIC X(01).               00760000
007700             15 XL023-FOB-CDE-RMS        PIC X(03).               00770000
007800             15 XL023-FOB-CDE-LGCY       PIC X(03).               00780000
007900             15 XL023-PO-TYP-CDE-DIFF    PIC X(01).               00790000
008000             15 XL023-PO-TYP-CDE-RMS     PIC X(04).               00800000
008100             15 XL023-PO-TYP-CDE-LGCY    PIC X(04).               00810000
008200             15 XL023-PK-BY-STR-IND-DIFF PIC X(01).               00820000
008300             15 XL023-PK-BY-STR-IND-RMS  PIC X(01).               00830000
008400             15 XL023-PK-BY-STR-IND-LGCY PIC X(01).               00840000
008500             15 XL023-CONSLR-ACTL-DTE-DIFF PIC X(01).             00850000
008600             15 XL023-CONSLR-ACTL-DTE-RMS  PIC X(08).             00860000
008700             15 XL023-CONSLR-ACTL-DTE-LGCY PIC X(08).             00870000
008800             15 XL023-CONSLR-REQR-DTE-DIFF PIC X(01).             00880000
008900             15 XL023-CONSLR-REQR-DTE-RMS  PIC X(08).             00890000
009000             15 XL023-CONSLR-REQR-DTE-LGCY PIC X(08).             00900000
009100             15 XL023-CONSLR-RLSE-CDE-DIFF PIC X(01).             00910000
009200             15 XL023-CONSLR-RLSE-CDE-RMS  PIC X(01).             00920000
009300             15 XL023-CONSLR-RLSE-CDE-LGCY PIC X(01).             00930000
009400             15 XL023-TKT-MKR-ACTL-DTE-DIFF  PIC X(01).           00940000
009500             15 XL023-TKT-MKR-ACTL-DTE-RMS   PIC X(08).           00950000
009600             15 XL023-TKT-MKR-ACTL-DTE-LGCY  PIC X(08).           00960000
009700             15 XL023-TKT-MKR-REQR-DTE-DIFF  PIC X(01).           00970000
009800             15 XL023-TKT-MKR-REQR-DTE-RMS   PIC X(08).           00980000
009900             15 XL023-TKT-MKR-REQR-DTE-LGCY  PIC X(08).           00990000
010000             15 XL023-TKT-MKR-RLSE-CDE-DIFF  PIC X(01).           01000000
010100             15 XL023-TKT-MKR-RLSE-CDE-RMS   PIC X(01).           01010000
010200             15 XL023-TKT-MKR-RLSE-CDE-LGCY  PIC X(01).           01020000
010300             15 XL023-RLSE-DTE-DIFF        PIC X(01).             01030000
010400             15 XL023-RLSE-DTE-RMS         PIC X(08).             01040000
010500             15 XL023-RLSE-DTE-LGCY        PIC X(08).             01050000
010600             15 XL023-FRST-FCTRY-DTE-DIFF  PIC X(01).             01060000
010700             15 XL023-FRST-FCTRY-DTE-RMS   PIC X(08).             01070000
010800             15 XL023-FRST-FCTRY-DTE-LGCY  PIC X(08).             01080000
010900             15 XL023-LAST-FCTRY-DTE-DIFF  PIC X(01).             01090000
011000             15 XL023-LAST-FCTRY-DTE-RMS   PIC X(08).             01100000
011100             15 XL023-LAST-FCTRY-DTE-LGCY  PIC X(08).             01110000
011200             15 XL023-DIR-STR-IND-DIFF     PIC X(01).             01120000
011300             15 XL023-DIR-STR-IND-RMS      PIC X(01).             01130000
011400             15 XL023-DIR-STR-IND-LGCY     PIC X(01).             01140000
011500             15 XL023-EXTD-NOT-AFT-DTE-DIFF  PIC X(01).           01150000
011600             15 XL023-EXTD-NOT-AFT-DTE-RMS   PIC X(08).           01160000
011700             15 XL023-EXTD-NOT-AFT-DTE-LGCY  PIC X(08).           01170000
011800             15 XL023-HNG-IND-DIFF         PIC X(01).             01180000
011900             15 XL023-HNG-IND-RMS          PIC X(01).             01190000
012000             15 XL023-HNG-IND-LGCY         PIC X(01).             01200000
012100             15 XL023-NW-STR-ORD-IND-DIFF  PIC X(01).             01210000
012200             15 XL023-NW-STR-ORD-IND-RMS   PIC X(01).             01220000
012300             15 XL023-NW-STR-ORD-IND-LGCY  PIC X(01).             01230000
012400             15 XL023-PKGNG-CDE-DIFF       PIC X(01).             01240000
012500             15 XL023-PKGNG-CDE-RMS        PIC X(01).             01250000
012600             15 XL023-PKGNG-CDE-LGCY       PIC X(01).             01260000
012700             15 XL023-PKGNG-DESC-DIFF      PIC X(01).             01270000
012800             15 XL023-PKGNG-DESC-RMS       PIC X(20).             01280000
012900             15 XL023-PKGNG-DESC-LGCY      PIC X(20).             01290000
013000             15 XL023-PTKT-LDTM-DAYS-QTY-DIFF  PIC X(01).         01300000
013100             15 XL023-PTKT-LDTM-DAYS-QTY-RMS   PIC 9(05).         01310000
013200             15 XL023-PTKT-LDTM-DAYS-QTY-LGCY  PIC 9(05).         01320000
013300             15 XL023-SEASET-SHRT-DESC-DIFF    PIC X(01).         01330000
013400             15 XL023-SEASET-SHRT-DESC-RMS     PIC X(05).         01340000
013500             15 XL023-SEASET-SHRT-DESC-LGCY    PIC X(05).         01350000
013600             15 XL023-SEASET-YR-DIFF       PIC X(01).             01360000
013700             15 XL023-SEASET-YR-RMS        PIC X(04).             01370000
013800             15 XL023-SEASET-YR-LGCY       PIC X(04).             01380000
013900             15 XL023-CRE-BY-USR-ID-DIFF   PIC X(01).             01390000
014000             15 XL023-CRE-BY-USR-ID-RMS    PIC X(08).             01400000
014100             15 XL023-CRE-BY-USR-ID-LGCY   PIC X(08).             01410000
014200             15 XL023-PTKT-IND-DIFF        PIC X(01).             01420000
014300             15 XL023-PTKT-IND-RMS         PIC X(01).             01430000
014400             15 XL023-PTKT-IND-LGCY        PIC X(01).             01440000
014500             15 XL023-C-O-PROD-CDE-DIFF    PIC X(01).             01450000
014600             15 XL023-C-O-PROD-CDE-RMS     PIC X(03).             01460000
014700             15 XL023-C-O-PROD-CDE-LGCY    PIC X(03).             01470000
014800             15 XL023-AGNT-OFC-CNTRY-CDE-DIFF  PIC X(01).         01480000
014900             15 XL023-AGNT-OFC-CNTRY-CDE-RMS   PIC X(03).         01490000
015000             15 XL023-AGNT-OFC-CNTRY-CDE-LGCY  PIC X(03).         01500000
015100             15 XL023-UNT-PER-CBMT-QTY-DIFF    PIC X(01).         01510000
015200             15 XL023-UNT-PER-CBMT-QTY-RMS     PIC 9(06).         01520000
015300             15 XL023-UNT-PER-CBMT-QTY-LGCY    PIC 9(06).         01530000
015400             15 XL023-QTA-CTG-CDE-DIFF         PIC X(01).         01540000
015500             15 XL023-QTA-CTG-CDE-RMS          PIC 9(06).         01550000
015600             15 XL023-QTA-CTG-CDE-LGCY         PIC 9(06).         01560000
015700             15 XL023-IMPRT-VND-ID-DIFF    PIC X(01).             01570000
015800             15 XL023-IMPRT-VND-ID-RMS     PIC 9(10).             01580000
015900             15 XL023-IMPRT-VND-ID-LGCY    PIC 9(10).             01590000
016000             15 XL023-IMPRT-FCTRY-ID-DIFF  PIC X(01).             01600000
016100             15 XL023-IMPRT-FCTRY-ID-RMS   PIC 9(10).             01610000
016200             15 XL023-IMPRT-FCTRY-ID-LGCY  PIC 9(10).             01620000
016300             15 XL023-IMPRT-VND-NM-DIFF        PIC X(01).         01630000
016400             15 XL023-IMPRT-VND-NM-RMS         PIC X(35).         01640000
016500             15 XL023-IMPRT-VND-NM-LGCY        PIC X(35).         01650000
016600             15 XL023-IMPRT-FCTRY-NM-DIFF      PIC X(01).         01660000
016700             15 XL023-IMPRT-FCTRY-NM-RMS       PIC X(35).         01670000
016800             15 XL023-IMPRT-FCTRY-NM-LGCY      PIC X(35).         01680000
016900             15 XL023-DERVD-LBL-TYP-CDE-DIFF   PIC X(01).         01690000
017000             15 XL023-DERVD-LBL-TYP-CDE-RMS    PIC X(01).         01700000
017100             15 XL023-DERVD-LBL-TYP-CDE-LGCY   PIC X(01).         01710000
017200                                                                  01720000
017300             15 XL023-DELY-ID-DIFF             PIC X(01).         01730000
017400             15 XL023-DELY-ID-RMS              PIC X(06).         01740000
017500             15 XL023-DELY-ID-LGCY             PIC X(06).         01750000
017600                                                                  01760000
017700             15 XL023-PO-SHRT-CYC-IND-DIFF     PIC X(01).         01770000
017800             15 XL023-PO-SHRT-CYC-IND-RMS      PIC X(01).         01780000
017900             15 XL023-PO-SHRT-CYC-IND-LGCY     PIC X(01).         01790000
018000             15 XL023-PO-WHSE-RPLNT-IND-DIFF   PIC X(01).         01800000
018100             15 XL023-PO-WHSE-RPLNT-IND-RMS    PIC X(01).         01810000
018200             15 XL023-PO-WHSE-RPLNT-IND-LGCY   PIC X(01).         01820000
018300*                                                                 01830000
018400*----------------------------------------------------------*      01840000
018500*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      01850000
018600*    SPECIAL INSTRUCTION BUSINESS EVENTS                   *      01860000
018700*    XLRD016 - XXT_PO_INSTR                                *      01870000
018800*----------------------------------------------------------*      01880000
018900*    *****  S P E C I A L   I N S T R U C T I O N S *****  *      01890000
019000*----------------------------------------------------------*      01900000
019100      10 XL023-PO-INSTR    REDEFINES XL023-COMPARE-DATA-AREA.     01910000
019200             15 XL023-IN-PO-NBR-DIFF           PIC X(01).         01920000
019300             15 XL023-IN-PO-NBR-RMS            PIC 9(08).         01930000
019400             15 XL023-IN-PO-NBR-LGCY           PIC 9(08).         01940000
019500             15 XL023-IN-RECIP-CDE-DIFF        PIC X(01).         01950000
019600             15 XL023-IN-RECIP-CDE-RMS         PIC X(02).         01960000
019700             15 XL023-IN-RECIP-CDE-LGCY        PIC X(02).         01970000
019800             15 XL023-IN-INSTR-ID-DIFF         PIC X(01).         01980000
019900             15 XL023-IN-INSTR-ID-RMS          PIC 9(08).         01990000
020000             15 XL023-IN-INSTR-ID-LGCY         PIC 9(08).         02000000
020100             15 XL023-IN-INSTR-DESC-DIFF       PIC X(01).         02010000
020200             15 XL023-IN-INSTR-DESC-RMS        PIC X(150).        02020000
020300             15 XL023-IN-INSTR-DESC-LGCY       PIC X(150).        02030000
020400*                                                                 02040000
020500*----------------------------------------------------------*      02050000
020600*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      02060000
020700*    ORDER DISCOUNT BUSINESS EVENTS                        *      02070000
020800*    XLRD017 - XXT_PO_DISC                                 *      02080000
020900*----------------------------------------------------------*      02090000
021000*    **********  O R D E R   D I S C O U N T *********     *      02100000
021100*----------------------------------------------------------*      02110000
021200      10 XL023-PO-DISC    REDEFINES XL023-COMPARE-DATA-AREA.      02120000
021300             15 XL023-DI-PO-NBR-DIFF           PIC X(01).         02130000
021400             15 XL023-DI-PO-NBR-RMS            PIC 9(08).         02140000
021500             15 XL023-DI-PO-NBR-LGCY           PIC 9(08).         02150000
021600             15 XL023-DI-DL-ID-DIFF            PIC X(01).         02160000
021700             15 XL023-DI-DL-ID-RMS             PIC 9(08).         02170000
021800             15 XL023-DI-DL-ID-LGCY            PIC 9(08).         02180000
021900             15 XL023-DI-DL-DTL-ID-DIFF        PIC X(01).         02190000
022000             15 XL023-DI-DL-DTL-ID-RMS         PIC 9(08).         02200000
022100             15 XL023-DI-DL-DTL-ID-LGCY        PIC 9(08).         02210000
022200             15 XL023-DI-DISC-TYPE-CDE-DIFF    PIC X(01).         02220000
022300             15 XL023-DI-DISC-TYPE-CDE-RMS     PIC X(06).         02230000
022400             15 XL023-DI-DISC-TYPE-CDE-LGCY    PIC X(06).         02240000
022500             15 XL023-DI-EXTD-DAYS-QTY-DIFF    PIC X(01).         02250000
022600             15 XL023-DI-EXTD-DAYS-QTY-RMS     PIC 9(04).         02260000
022700             15 XL023-DI-EXTD-DAYS-QTY-LGCY    PIC 9(04).         02270000
022800             15 XL023-DI-DISC-PCT-DIFF         PIC X(01).         02280000
022900             15 XL023-DI-DISC-PCT-RMS          PIC 999.99.        02290000
023000             15 XL023-DI-DISC-PCT-LGCY         PIC 999.99.        02300000
023100             15 XL023-DI-TOT-DISC-AMT-DIFF     PIC X(01).         02310000
023200             15 XL023-DI-TOT-DISC-AMT-RMS      PIC 9(16).9(04).   02320000
023300             15 XL023-DI-TOT-DISC-AMT-LGCY     PIC 9(16).9(04).   02330000
023400*                                                                 02340000
023500*----------------------------------------------------------*      02350000
023600*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      02360000
023700*    SKU BUSINESS EVENTS                                   *      02370000
023800*    XLRD018 - XXT_PO_SKU                                  *      02380000
023900*----------------------------------------------------------*      02390000
024000*    *****************  P O   S K U  *******************   *      02400000
024100*----------------------------------------------------------*      02410000
024200      10 XL023-PO-SKU      REDEFINES XL023-COMPARE-DATA-AREA.     02420000
024300             15 XL023-SK-PO-NBR-DIFF           PIC X(01).         02430000
024400             15 XL023-SK-PO-NBR-RMS            PIC 9(08).         02440000
024500             15 XL023-SK-PO-NBR-LGCY           PIC 9(08).         02450000
024600             15 XL023-SK-SKU-NBR-DIFF          PIC X(01).         02460000
024700             15 XL023-SK-SKU-NBR-RMS           PIC 9(08).         02470000
024800             15 XL023-SK-SKU-NBR-LGCY          PIC 9(08).         02480000
024900             15 XL023-SK-UNT-COST-AMT-DIFF     PIC X(01).         02490000
025000             15 XL023-SK-UNT-COST-AMT-RMS      PIC 9(16).9(04).   02500000
025100             15 XL023-SK-UNT-COST-AMT-LGCY     PIC 9(16).9(04).   02510000
025200             15 XL023-SK-FRST-COST-AMT-DIFF    PIC X(01).         02520000
025300             15 XL023-SK-FRST-COST-AMT-RMS     PIC 9(16).9(04).   02530000
025400             15 XL023-SK-FRST-COST-AMT-LGCY    PIC 9(16).9(04).   02540000
025500             15 XL023-SK-VND-QTY-DIFF          PIC X(01).         02550000
025600             15 XL023-SK-VND-QTY-RMS           PIC 9(08).9(04).   02560000
025700             15 XL023-SK-VND-QTY-LGCY          PIC 9(08).9(04).   02570000
025800             15 XL023-SK-PROMO-STRT-DTE-DIFF   PIC X(01).         02580000
025900             15 XL023-SK-PROMO-STRT-DTE-RMS    PIC X(08).         02590000
026000             15 XL023-SK-PROMO-STRT-DTE-LGCY   PIC X(08).         02600000
026100             15 XL023-SK-PIC-SKU-IND-DIFF      PIC X(01).         02610000
026200             15 XL023-SK-PIC-SKU-IND-RMS       PIC X(01).         02620000
026300             15 XL023-SK-PIC-SKU-IND-LGCY      PIC X(01).         02630000
026400             15 XL023-SK-ORIG-ORD-QTY-DIFF     PIC X(01).         02640000
026500             15 XL023-SK-ORIG-ORD-QTY-RMS      PIC 9(08).9(04).   02650000
026600             15 XL023-SK-ORIG-ORD-QTY-LGCY     PIC 9(08).9(04).   02660000
026700             15 XL023-SK-ORD-QTY-DIFF          PIC X(01).         02670000
026800             15 XL023-SK-ORD-QTY-RMS           PIC 9(08).9(04).   02680000
026900             15 XL023-SK-ORD-QTY-LGCY          PIC 9(08).9(04).   02690000
027000             15 XL023-SK-CNCLD-QTY-DIFF        PIC X(01).         02700000
027100             15 XL023-SK-CNCLD-QTY-RMS         PIC 9(08).9(04).   02710000
027200             15 XL023-SK-CNCLD-QTY-LGCY        PIC 9(08).9(04).   02720000
027300             15 XL023-SK-PK-SKU-IND-DIFF       PIC X(01).         02730000
027400             15 XL023-SK-PK-SKU-IND-RMS        PIC X(01).         02740000
027500             15 XL023-SK-PK-SKU-IND-LGCY       PIC X(01).         02750000
027600             15 XL023-SK-PK-SKU-DESC-DIFF      PIC X(01).         02760000
027700             15 XL023-SK-PK-SKU-DESC-RMS       PIC X(40).         02770000
027800             15 XL023-SK-PK-SKU-DESC-LGCY      PIC X(40).         02780000
027900             15 XL023-SK-DC-ORD-MULT-QTY-DIFF  PIC X(01).         02790000
028000             15 XL023-SK-DC-ORD-MULT-QTY-RMS   PIC 9(04).         02800000
028100             15 XL023-SK-DC-ORD-MULT-QTY-LGCY  PIC 9(04).         02810000
028200             15 XL023-SK-UNT-RTL-AMT-DIFF      PIC X(01).         02820000
028300             15 XL023-SK-UNT-RTL-AMT-RMS       PIC 9(07).9(02).   02830000
028400             15 XL023-SK-UNT-RTL-AMT-LGCY      PIC 9(07).9(02).   02840000
028500             15 XL023-SK-GP-RTL-AMT-DIFF       PIC X(01).         02850000
028600             15 XL023-SK-GP-RTL-AMT-RMS        PIC 9(07).9(02).   02860000
028700             15 XL023-SK-GP-RTL-AMT-LGCY       PIC 9(07).9(02).   02870000
028800             15 XL023-SK-GP-RTL-QTY-DIFF       PIC X(01).         02880000
028900             15 XL023-SK-GP-RTL-QTY-RMS        PIC 9(07).9(02).   02890000
029000             15 XL023-SK-GP-RTL-QTY-LGCY       PIC 9(07).9(02).   02900000
029001             15 XL023-SK-INPK-QTY-DIFF         PIC X(01).         02900100
029010             15 XL023-SK-INPK-QTY-RMS          PIC 9(08).9(04).   02901000
029020             15 XL023-SK-INPK-QTY-LGCY         PIC 9(08).9(04).   02902000
029030             15 XL023-SK-OTPK-QTY-DIFF         PIC X(01).         02903001
029040             15 XL023-SK-OTPK-QTY-RMS          PIC 9(08).9(04).   02904001
029050             15 XL023-SK-OTPK-QTY-LGCY         PIC 9(08).9(04).   02905001
029100*                                                                 02910000
029200*----------------------------------------------------------*      02920000
029300*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      02930000
029400*    PACK BUSINESS EVENTS                                  *      02940000
029500*    XLRD021 - XXT_PO_PK_SKU                               *      02950000
029600*----------------------------------------------------------*      02960000
029700*    *************  P O   P A C K   S K U  *************   *      02970000
029800*----------------------------------------------------------*      02980000
029900      10 XL023-PO-PK-SKU     REDEFINES XL023-COMPARE-DATA-AREA.   02990000
030000             15  XL023-PB-PO-NBR-DIFF           PIC X(01).        03000000
030100             15  XL023-PB-PO-NBR-RMS            PIC 9(08).        03010000
030200             15  XL023-PB-PO-NBR-LGCY           PIC 9(08).        03020000
030300             15  XL023-PB-PK-SKU-NBR-DIFF       PIC X(01).        03030000
030400             15  XL023-PB-PK-SKU-NBR-RMS        PIC 9(08).        03040000
030500             15  XL023-PB-PK-SKU-NBR-LGCY       PIC 9(08).        03050000
030600             15  XL023-PB-SKU-NBR-DIFF          PIC X(01).        03060000
030700             15  XL023-PB-SKU-NBR-RMS           PIC 9(08).        03070000
030800             15  XL023-PB-SKU-NBR-LGCY          PIC 9(08).        03080000
030900             15  XL023-PB-UNT-COST-AMT-DIFF     PIC X(01).        03090000
031000             15  XL023-PB-UNT-COST-AMT-RMS      PIC 9(16).9(04).  03100000
031100             15  XL023-PB-UNT-COST-AMT-LGCY     PIC 9(16).9(04).  03110000
031200             15  XL023-PB-FRST-COST-AMT-DIFF    PIC X(01).        03120000
031300             15  XL023-PB-FRST-COST-AMT-RMS     PIC 9(16).9(04).  03130000
031400             15  XL023-PB-FRST-COST-AMT-LGCY    PIC 9(16).9(04).  03140000
031500             15  XL023-PB-UNT-RTL-AMT-DIFF      PIC X(01).        03150000
031600             15  XL023-PB-UNT-RTL-AMT-RMS       PIC 9(07).9(02).  03160000
031700             15  XL023-PB-UNT-RTL-AMT-LGCY      PIC 9(07).9(02).  03170000
031800             15  XL023-PB-GP-RTL-AMT-DIFF       PIC X(01).        03180000
031900             15  XL023-PB-GP-RTL-AMT-RMS        PIC 9(07).9(02).  03190000
032000             15  XL023-PB-GP-RTL-AMT-LGCY       PIC 9(07).9(02).  03200000
032100             15  XL023-PB-GP-RTL-QTY-DIFF       PIC X(01).        03210000
032200             15  XL023-PB-GP-RTL-QTY-RMS        PIC 9(07).9(02).  03220000
032300             15  XL023-PB-GP-RTL-QTY-LGCY       PIC 9(07).9(02).  03230000
032400             15  XL023-PB-RATO-UNT-QTY-DIFF     PIC X(01).        03240000
032500             15  XL023-PB-RATO-UNT-QTY-RMS      PIC 9(04).        03250000
032600             15  XL023-PB-RATO-UNT-QTY-LGCY     PIC 9(04).        03260000
032610             15  XL023-PB-INPK-QTY-DIFF         PIC X(01).        03261002
032620             15  XL023-PB-INPK-QTY-RMS          PIC 9(08).9(04).  03262002
032630             15  XL023-PB-INPK-QTY-LGCY         PIC 9(08).9(04).  03263003
032640             15  XL023-PB-OTPK-QTY-DIFF         PIC X(01).        03264003
032650             15  XL023-PB-OTPK-QTY-RMS          PIC 9(08).9(04).  03265003
032660             15  XL023-PB-OTPK-QTY-LGCY         PIC 9(08).9(04).  03266003
032700*                                                                 03270000
032800*----------------------------------------------------------*      03280000
032900*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      03290000
033000*    PACK LOCATION BUSINESS EVENTS                         *      03300000
033100*    XLRD022 - XXT_PO_PK_SKU_LOC                           *      03310000
033200*----------------------------------------------------------*      03320000
033300*    ****  P O   P A C K   S K U   L O C A T I O N ****    *      03330000
033400*----------------------------------------------------------*      03340000
033500      10 XL023-PO-PK-SKU-LOC REDEFINES XL023-COMPARE-DATA-AREA.   03350000
033600             15 XL023-PL-PO-NBR-DIFF           PIC X(01).         03360000
033700             15 XL023-PL-PO-NBR-RMS            PIC 9(08).         03370000
033800             15 XL023-PL-PO-NBR-LGCY           PIC 9(08).         03380000
033900             15 XL023-PL-SKU-NBR-DIFF          PIC X(01).         03390000
034000             15 XL023-PL-SKU-NBR-RMS           PIC 9(08).         03400000
034100             15 XL023-PL-SKU-NBR-LGCY          PIC 9(08).         03410000
034200             15 XL023-PL-PK-SKU-NBR-DIFF       PIC X(01).         03420000
034300             15 XL023-PL-PK-SKU-NBR-RMS        PIC 9(08).         03430000
034400             15 XL023-PL-PK-SKU-NBR-LGCY       PIC 9(08).         03440000
034500             15 XL023-PL-LOC-NBR-DIFF          PIC X(01).         03450000
034600             15 XL023-PL-LOC-NBR-RMS           PIC 9(04).         03460000
034700             15 XL023-PL-LOC-NBR-LGCY          PIC 9(04).         03470000
034800*                                                                 03480000
034900*----------------------------------------------------------*      03490000
035000*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      03500000
035100*    LOCATION BUSINESS EVENTS                              *      03510000
035200*    XLRD019 - XXT_INBD_ALLOC                              *      03520000
035300*----------------------------------------------------------*      03530000
035400*    ********  I N B N D   A L L O C A T I O N *******     *      03540000
035500*----------------------------------------------------------*      03550000
035600      10 XL023-INBD-ALLOC   REDEFINES XL023-COMPARE-DATA-AREA.    03560000
035700             15 XL023-LO-PO-NBR-DIFF           PIC X(01).         03570000
035800             15 XL023-LO-PO-NBR-RMS            PIC 9(08).         03580000
035900             15 XL023-LO-PO-NBR-LGCY           PIC 9(08).         03590000
036000             15 XL023-LO-SKU-NBR-DIFF          PIC X(01).         03600000
036100             15 XL023-LO-SKU-NBR-RMS           PIC 9(08).         03610000
036200             15 XL023-LO-SKU-NBR-LGCY          PIC 9(08).         03620000
036300             15 XL023-LO-LOC-NBR-DIFF          PIC X(01).         03630000
036400             15 XL023-LO-LOC-NBR-RMS           PIC 9(04).         03640000
036500             15 XL023-LO-LOC-NBR-LGCY          PIC 9(04).         03650000
036600             15 XL023-LO-LOC-TYP-CDE-DIFF      PIC X(01).         03660000
036700             15 XL023-LO-LOC-TYP-CDE-RMS       PIC X(01).         03670000
036800             15 XL023-LO-LOC-TYP-CDE-LGCY      PIC X(01).         03680000
036900             15 XL023-LO-ORD-QTY-DIFF          PIC X(01).         03690000
037000             15 XL023-LO-ORD-QTY-RMS           PIC 9(08).9(04).   03700000
037100             15 XL023-LO-ORD-QTY-LGCY          PIC 9(08).9(04).   03710000
037200             15 XL023-LO-ORIG-ORD-QTY-DIFF     PIC X(01).         03720000
037300             15 XL023-LO-ORIG-ORD-QTY-RMS      PIC 9(08).9(04).   03730000
037400             15 XL023-LO-ORIG-ORD-QTY-LGCY     PIC 9(08).9(04).   03740000
037500             15 XL023-LO-CNCLD-QTY-DIFF        PIC X(01).         03750000
037600             15 XL023-LO-CNCLD-QTY-RMS         PIC 9(08).9(04).   03760000
037700             15 XL023-LO-CNCLD-QTY-LGCY        PIC 9(08).9(04).   03770000
037800             15 XL023-LO-CNCL-CDE-DIFF         PIC X(01).         03780000
037900             15 XL023-LO-CNCL-CDE-RMS          PIC X(01).         03790000
038000             15 XL023-LO-CNCL-CDE-LGCY         PIC X(01).         03800000
038100             15 XL023-LO-CNCL-DTE-DIFF         PIC X(01).         03810000
038200             15 XL023-LO-CNCL-DTE-RMS          PIC 9(08).         03820000
038300             15 XL023-LO-CNCL-DTE-LGCY         PIC 9(08).         03830000
038400             15 XL023-LO-CNCLD-BY-USR-ID-DIFF  PIC X(01).         03840000
038500             15 XL023-LO-CNCLD-BY-USR-ID-RMS   PIC X(30).         03850000
038600             15 XL023-LO-CNCLD-BY-USR-ID-LGCY  PIC X(30).         03860000
038700             15 XL023-LO-DC-ALLC-MULT-QTY-DIFF     PIC X(01).     03870000
038800             15 XL023-LO-DC-ALLC-MULT-QTY-RMS      PIC 9(05).     03880000
038900             15 XL023-LO-DC-ALLC-MULT-QTY-LGCY     PIC 9(05).     03890000
039000             15 XL023-LO-STR-ALLC-MLT-QTY-DIFF     PIC X(01).     03900000
039100             15 XL023-LO-STR-ALLC-MLT-QTY-RMS      PIC 9(05).     03910000
039200             15 XL023-LO-STR-ALLC-MLT-QTY-LGCY     PIC 9(05).     03920000
039300             15 XL023-LO-ALLOC-RND-CDE-DIFF        PIC X(01).     03930000
039400             15 XL023-LO-ALLOC-RND-CDE-RMS         PIC X(01).     03940000
039500             15 XL023-LO-ALLOC-RND-CDE-LGCY        PIC X(01).     03950000
039600             15 XL023-LO-SHTG-PRT-OPT-CDE-DIFF     PIC X(01).     03960000
039700             15 XL023-LO-SHTG-PRT-OPT-CDE-RMS      PIC X(01).     03970000
039800             15 XL023-LO-SHTG-PRT-OPT-CDE-LGCY     PIC X(01).     03980000
039900             15 XL023-LO-OVRG-PRT-OPT-CDE-DIFF     PIC X(01).     03990000
040000             15 XL023-LO-OVRG-PRT-OPT-CDE-RMS      PIC X(01).     04000000
040100             15 XL023-LO-OVRG-PRT-OPT-CDE-LGCY     PIC X(01).     04010000
040200             15 XL023-LO-EXT-SHTG-THR-IND-DIFF     PIC X(01).     04020000
040300             15 XL023-LO-EXT-SHTG-THR-IND-RMS      PIC X(01).     04030000
040400             15 XL023-LO-EXT-SHTG-THR-IND-LGCY     PIC X(01).     04040000
040500*                                                                 04050000
040600*----------------------------------------------------------*      04060000
040700*    PURCHASE ORDER - DOMAIN TEMPLATE                      *      04070000
040800*    STORE BUSINESS EVENTS                                 *      04080000
040900*    XLRD020 - XXT_OTBND_ALLOC                             *      04090000
041000*----------------------------------------------------------*      04100000
041100*    ********  O T B N D   A L L O C A T I O N *******     *      04110000
041200*----------------------------------------------------------*      04120000
041300      10 XL023-OTBND-ALLOC   REDEFINES XL023-COMPARE-DATA-AREA.   04130000
041400             15 XL023-SB-PO-NBR-DIFF            PIC X(01).        04140000
041500             15 XL023-SB-PO-NBR-RMS             PIC 9(08).        04150000
041600             15 XL023-SB-PO-NBR-LGCY            PIC 9(08).        04160000
041700             15 XL023-SB-SKU-NBR-DIFF           PIC X(01).        04170000
041800             15 XL023-SB-SKU-NBR-RMS            PIC 9(08).        04180000
041900             15 XL023-SB-SKU-NBR-LGCY           PIC 9(08).        04190000
042000             15 XL023-SB-LOC-NBR-DIFF           PIC X(01).        04200000
042100             15 XL023-SB-LOC-NBR-RMS            PIC 9(04).        04210000
042200             15 XL023-SB-LOC-NBR-LGCY           PIC 9(04).        04220000
042300             15 XL023-SB-STR-NBR-DIFF           PIC X(01).        04230000
042400             15 XL023-SB-STR-NBR-RMS            PIC 9(04).        04240000
042500             15 XL023-SB-STR-NBR-LGCY           PIC 9(04).        04250000
042600             15 XL023-SB-RNK-SEQ-NBR-DIFF       PIC X(01).        04260000
042700             15 XL023-SB-RNK-SEQ-NBR-RMS        PIC 9(04).        04270000
042800             15 XL023-SB-RNK-SEQ-NBR-LGCY       PIC 9(04).        04280000
042900             15 XL023-SB-ALLOC-QTY-DIFF         PIC X(01).        04290000
043000             15 XL023-SB-ALLOC-QTY-RMS          PIC 9(08).        04300000
043100             15 XL023-SB-ALLOC-QTY-LGCY         PIC 9(08).        04310000
043200             15 XL023-SB-ALLOC-SEQ-CDE-DIFF     PIC X(01).        04320000
043300             15 XL023-SB-ALLOC-SEQ-CDE-RMS      PIC X(01).        04330000
043400             15 XL023-SB-ALLOC-SEQ-CDE-LGCY     PIC X(01).        04340000
043500             15 XL023-SB-STR-CNSTR-CDE-DIFF     PIC X(01).        04350000
043600             15 XL023-SB-STR-CNSTR-CDE-RMS      PIC X(01).        04360000
043700             15 XL023-SB-STR-CNSTR-CDE-LGCY     PIC X(01).        04370000
043800             15 XL023-SB-STR-CNSTR-QTY-DIFF     PIC X(01).        04380000
043900             15 XL023-SB-STR-CNSTR-QTY-RMS      PIC 9(08).        04390000
044000             15 XL023-SB-STR-CNSTR-QTY-LGCY     PIC 9(08).        04400000
044100*                                                                 04410000
