        05 XL008-SKU-RECORD.                                                    
           10 XL008-FILE-INDICATOR          PIC  X.                             
           10 XL008-DATA1.                                                      
              15 XL008-INTR-UPC-ID             PIC  S9(9) COMP.                 
              15 XL008-STYL-ID                 PIC  S9(8)V COMP-3.              
              15 XL008-ITM-NBR                 PIC  S9(15)V COMP-3.             
              15 XL008-SKU-NBR                 PIC  S9(8)V COMP-3.              
           10 XL008-SKU-STAT-CDE               PIC   X(2).                      
           10 XL008-SKU-STAT-DESC              PIC   X(10).                     
           10 XL008-DATA2.                                                      
              15 XL008-INNR-PK-QTY             PIC  S9(4) COMP.                 
              15 XL008-OUTR-PK-QTY             PIC  S9(4) COMP.                 
              15 XL008-SKU-DESC                PIC   X(30).                     
              15 XL008-KOHLS-SIZE-CDE          PIC  S9(9) COMP.                 
              15 XL008-SIZE-DESC               PIC   X(10).                     
              15 XL008-NRF-CLOR-CDE            PIC   X(3).                      
              15 XL008-SHRT-CLOR-DESC          PIC   X(4).                      
              15 XL008-CSTM-CLOR-DESC          PIC   X(10).                     
              15 XL008-REGN-PRIC-IND           PIC   X(1).                      
              15 XL008-KY-ITM-IND              PIC   X(1).                      
              15 XL008-GP-CDE                  PIC   X(3).                      
              15 XL008-WHSE-RPLNT-IND          PIC   X(01).                     
           10 FILLER                        PIC   X(44).                        
