000600*----------------------------------------------------------*              
000300*  EXTRACT CREATED BY XLKUT031 FOR DATA INTEGRITY PROCESS  *              
000300*  PO DRIVER EXTRACTS FROM BOTH TPOINST AND TINSTCD TABLES *              
000300*  XLRD028 - TPOINST (LRECL 44)                            *              
000300*          - TINSTCD (LRECL 172)                           *              
000400*  LENGTH  - 216 BYTES                                     *              
000500*                                                          *              
000600*----------------------------------------------------------*              
       01  XLRD028-RECORD.                                                      
      *                                                                         
           05  XL028-DATA.                                                      
               10  XL028-POINST-PO-NBR          PIC S9(09) COMP.                
               10  XL028-POINST-RECIP-CDE       PIC X(02).                      
               10  XL028-POINST-INSTR-NBR       PIC S9(09) COMP.                
               10  XL028-POINST-CRE-BY-UID      PIC X(08).                      
               10  XL028-POINST-CRE-TMST        PIC X(26).                      
               10  XL028-INSTCD-INSTR-NBR       PIC S9(09) COMP.                
               10  XL028-INSTCD-DESC            PIC X(150).                     
               10  XL028-INSTCD-CRE-BY-UID      PIC X(08).                      
               10  XL028-INSTCD-CRE-DTE         PIC X(10).                      
      *                                                                         
