       05  XL007-STYLE-RECORD.                                                  
           10 XL007-FILE-INDICATOR          PIC  X.                             
           10 XL007-DATA.                                                       
               15 XL007-STYL-ID                 PIC  S9(8)V COMP-3.             
               15 XL007-DEPT-NBR                PIC  S9(4)V COMP-3.             
               15 XL007-MAJ-CL-NBR              PIC  S9(4)V COMP-3.             
               15 XL007-SUB-CL-NBR              PIC  S9(4)V COMP-3.             
               15 XL007-VS-ID                   PIC  S9(9) COMP.                
               15 XL007-VS-NBR                  PIC   X(20).                    
               15 XL007-ENT-ID                  PIC  S9(9) COMP.                
               15 XL007-STKR-NBR                PIC  S9(9) COMP.                
               15 XL007-TKT-TYP-DESC            PIC   X(20).                    
               15 XL007-HNG-FOLD-DESC           PIC   X(20).                    
               15 XL007-VS-DESC                 PIC   X(30).                    
               15 XL007-LBL-SEQ-NBR             PIC  S9(4) COMP.                
               15 FILLER                        PIC   X(31).                    
