000100**************************************************************    00010000
000200*    ******                IMPORTANT                 ******  *    00020000
000210*   THIS IS THE COMMUNICATION AREA TO BE USED BY A CALLING   *    00021000
000220*   PROGRAM THAT WILL USE ROUTINE XLKUT107 TO WRITE          *    00022000
000230*   INFORMATION TO THE EAI EXPORT TABLES FOR THE VARIOUS     *    00023000
000240*   APPLICATION ID'S WITHIN THE LOGISTICS MAINFRAME SYSTEMS. *    00024000
000250*                                                            *    00025000
000260*   THIS LAYOUT CONTAINS THE FIELDS NEEDED TO POPULATE THE   *    00026000
000270*   THE COLUMNS ON THE XXT_BUS_EVNT_EXPRT TABLE AND THE      *    00027000
000280*   CORRESPONDING XXT_BUS_EVNT_DTL TABLE (THE XX BEING       *    00028000
000290*   REPLACED BY THE 2 CHARACTER APPLICATION ID.              *    00029000
000300*                                                            *    00030000
000400*   THIS LAYOUT CONTAINS A REDEFINES FOR THE VARIOUS         *    00040000
001900*   BUSINESS EVENTS THAT NEED TO HAVE INFORMATION WRITTEN    *    00190000
002000*   TO THE EAI EXPORT TABLES.                                *    00200000
002100*                                                            *    00210000
002200*   THIS COPYBOOK INCLUDES FIELDS THAT ARE TO BE PASSED TO   *    00220000
002300*   THE XLKUT107 ROUTINE AND WILL ALSO CONTAIN SOME OUTPUT   *    00230000
002400*   FIELDS WITH INFORMATION RETURNED FROM THE XLKUT107       *    00240000
002500*   ROUTINE.                                                 *    00250000
002600*                                                            *    00260000
002700*   THE XL033-DTL-TXT FIELDS WITHIN THIS COPYBOOK WILL       *    00270000
002800*   CONTAIN INFORMATION THAT WILL BE FORMATTED VIA           *    00280000
002900*   ANOTHER COPYBOOK (WHICH WILL BE DOCUMENTED LATER IN      *    00290000
003000*   THIS COPYBOOK (THE XL033-DTL-TXT FIELD WILL BE USED      *    00300000
003100*   TO POPULATE THE DLT_TXT COLUMN WITHIN THE                *    00310000
003110*   XXT_BUS_EVNT_DTL TABLE.                                  *    00311000
003111*                                                            *    00311100
003112*   COPYBOOK LENGTH IS 2100                                  *    00311200
003120**************************************************************    00312000
003200 01  XL091-EAI-EXPORT-COMMAREA.                                   00320000
003210     05  XL091-INPUT-FIELDS.                                      00321000
003300         10  XL091-APP-ID-EXPORT-CDE  PIC  X(02).                 00330000
003400             88  XL091-PC-APP-ID           VALUE 'PC'.            00340000
003410             88  XL091-SU-APP-ID           VALUE 'SU'.            00341000
003420             88  XL091-VALID-APP-ID        VALUES 'PC', 'SU'.     00342000
003500         10  XL091-EVNT-OBJ-TXT       PIC  X(40).                 00350000
003600         10  XL091-EVNT-OBJ-ACTN-TXT  PIC  X(40).                 00360000
003610         10  XL091-CRE-BY-USR-ID      PIC  X(08).                 00361000
003620         10  XL091-CRE-PGM-NM         PIC  X(08).                 00362000
003630         10  XL091-REF-ID             PIC  X(40).                 00363000
003631         10  XL091-EVNT-KY-1-NBR      PIC S9(18)V        COMP-3.  00363100
003632         10  XL091-EVNT-KY-2-NBR      PIC S9(18)V        COMP-3.  00363200
003633         10  XL091-EVNT-KY-3-NBR      PIC S9(18)V        COMP-3.  00363300
003634         10  XL091-EVNT-KY-4-NBR      PIC S9(18)V        COMP-3.  00363400
003635         10  XL091-EVNT-KY-5-NBR      PIC S9(18)V        COMP-3.  00363500
003636         10  XL091-EVNT-KY-1-TXT      PIC  X(40).                 00363600
003637         10  XL091-EVNT-KY-2-TXT      PIC  X(40).                 00363700
003638         10  XL091-EVNT-KY-3-TXT      PIC  X(40).                 00363800
003639         10  XL091-EVNT-KY-4-TXT      PIC  X(40).                 00363900
003640         10  XL091-EVNT-KY-5-TXT      PIC  X(40).                 00364000
003641         10  XL091-EVNT-KY-1-TMST     PIC  X(26).                 00364100
003642         10  XL091-EVNT-KY-2-TMST     PIC  X(26).                 00364200
003643         10  XL091-EVNT-KY-3-TMST     PIC  X(26).                 00364300
003644         10  XL091-EVNT-KY-4-TMST     PIC  X(26).                 00364400
003645         10  XL091-EVNT-KY-5-TMST     PIC  X(26).                 00364500
003646         10  XL091-DTL-TXT            PIC  X(1002).               00364600
003647         10  XL091-DTL-COPYBOOK-NM    PIC  X(08).                 00364700
003648             88  XL091-COPYBOOK-NOT-USED   VALUE 'N/A     '.      00364800
003649             88  XL091-PCWS242-COPYBOOK    VALUE 'PCWS242 '.      00364900
003650             88  XL091-SUWS050-COPYBOOK    VALUE 'SUWS050 '.      00365000
003651             88  XL091-VALID-COPYBOOK      VALUES 'N/A     ',     00365100
003652                                                  'PCWS242 ',     00365200
003653                                                  'SUWS050 '.     00365300
003654         10  XL091-FILLER-1           PIC  X(242).                00365400
003660                                                                  00366000
003670* THE FOLLOWING FIELD SHOULD CONTAIN THE ORIGINAL CALLING         00367000
003680* PROGRAM ASSOCIATED TO THE PROCESSING TO BE DONE.                00368000
003690     05  XL091-ORIG-CALLING-PGM-NM    PIC  X(08).                 00369000
003700                                                                  00370000
004800     05  XL091-COMMIT-CDE             PIC  X(01).                 00480000
004900         88  XL091-COMMIT-UPDATE          VALUE 'C'.              00490000
005000         88  XL091-DO-NOT-COMMIT-UPDATE   VALUE 'N'.              00500000
005400     05  XL091-RETURN-CODE            PIC  X(02).                 00540000
005500         88  XL091-SUCCESSFUL             VALUES ZERO.            00550000
005600         88  XL091-SQL-ERROR              VALUE '01'.             00560000
005700         88  XL091-INVALID-BUS-EVNT       VALUE '02'.             00570000
006200         88  XL091-INPUT-FIELDS-MISSING   VALUE '03'.             00620000
006201         88  XL091-APP-ID-CODE-MISSING    VALUE '04'.             00620100
006202         88  XL091-COPYBOOK-NM-MISSING    VALUE '05'.             00620200
006203         88  XL091-CRE-BY-FIELDS-MISSING  VALUE '06'.             00620300
006204*           **************************************************    00620400
006205*           *  FOLLOWING RETURN CODES INDICATE THAT INPUT    *    00620500
006206*           *  IS PRESENT IN THE XL091 FIELDS BUT NOT VALID  *    00620600
006207*           *  FOR THE OBJ TXT, OBJ ACTN TXT COMBINATION.    *    00620700
006208*           *                                                *    00620800
006209*           **************************************************    00620900
006210         88  XL091-KY1-NBR-INVALID        VALUE '07'.             00621000
006211         88  XL091-KY2-NBR-INVALID        VALUE '08'.             00621100
006212         88  XL091-KY3-NBR-INVALID        VALUE '09'.             00621200
006213         88  XL091-KY4-NBR-INVALID        VALUE '10'.             00621300
006214         88  XL091-KY5-NBR-INVALID        VALUE '11'.             00621400
006215         88  XL091-KY1-TXT-INVALID        VALUE '12'.             00621500
006216         88  XL091-KY2-TXT-INVALID        VALUE '13'.             00621600
006217         88  XL091-KY3-TXT-INVALID        VALUE '14'.             00621700
006218         88  XL091-KY4-TXT-INVALID        VALUE '15'.             00621800
006219         88  XL091-KY5-TXT-INVALID        VALUE '16'.             00621900
006220         88  XL091-KY1-TMST-INVALID       VALUE '17'.             00622000
006221         88  XL091-KY2-TMST-INVALID       VALUE '18'.             00622100
006222         88  XL091-KY3-TMST-INVALID       VALUE '19'.             00622200
006223         88  XL091-KY4-TMST-INVALID       VALUE '20'.             00622300
006224         88  XL091-KY5-TMST-INVALID       VALUE '21'.             00622400
006225                                                                  00622500
006226*           **************************************************    00622600
006227*           *  FOLLOWING RETURN CODES INDICATE THAT A        *    00622700
006228*           *  FIELD IS REQUIRED FOR THE OBJ TXT, OBJ ACTN   *    00622800
006229*           *  TXT COMBINATION BUT NOT PASSED IN THE XLWS072 *    00622900
006230*           *  COMMAREA.                                     *    00623000
006231*           **************************************************    00623100
006232         88  XL091-KY1-NBR-REQD           VALUE '22'.             00623200
006233         88  XL091-KY2-NBR-REQD           VALUE '23'.             00623300
006234         88  XL091-KY3-NBR-REQD           VALUE '24'.             00623400
006235         88  XL091-KY4-NBR-REQD           VALUE '25'.             00623500
006236         88  XL091-KY5-NBR-REQD           VALUE '26'.             00623600
006237         88  XL091-KY1-TXT-REQD           VALUE '27'.             00623700
006238         88  XL091-KY2-TXT-REQD           VALUE '28'.             00623800
006239         88  XL091-KY3-TXT-REQD           VALUE '29'.             00623900
006240         88  XL091-KY4-TXT-REQD           VALUE '30'.             00624000
006241         88  XL091-KY5-TXT-REQD           VALUE '31'.             00624100
006242         88  XL091-KY1-TMST-REQD          VALUE '32'.             00624200
006243         88  XL091-KY2-TMST-REQD          VALUE '33'.             00624300
006244         88  XL091-KY3-TMST-REQD          VALUE '34'.             00624400
006245         88  XL091-KY4-TMST-REQD          VALUE '35'.             00624500
006246         88  XL091-KY5-TMST-REQD          VALUE '36'.             00624600
006247         88  XL091-COMMIT-CODE-INVALID    VALUE '51'.             00624700
006248         88  XL091-INVALID-KEY-VALUE      VALUE '97'.             00624800
006249         88  XL091-CALLED-MODULE-FAILURE  VALUE '98'.             00624900
006250         88  XL091-INVALID-ACCESS         VALUE '99'.             00625000
006300     05  XL091-RETURN-SQLCODES.                                   00630000
006400         10  XL091-EAI-DB-SQLCODE     PIC  S9(9).                 00640000
006500             88  XL091-EAI-DB-NOT-FOUND   VALUE  +100.            00650000
006600             88  XL091-EAI-DB-CONTENTION  VALUES -904 -911 -913.  00660000
006800     05  XL091-FILLER-2               PIC  X(25).                 00680000
006900* THE FOLLOWING ARE TO CONTAIN PARAGRAPH NUMBERS ASSOCIATED TO    00690000
007000* THE ABOVE SQL RETURN CODES.                                     00700000
007200     05  XL091-SQL-ERROR-PARA         PIC  X(05).                 00720000
007210     05  XL091-CALL-MOD-FAIL-NM       PIC  X(08).                 00721000
007220     05  XL091-CALL-MOD-FAIL-ERR-CDE  PIC  X(02).                 00722000
007300     05  XL091-FILLER-3               PIC  X(10).                 00730000
007400                                                                  00740000
007500* THE FOLLOWING IS FILLER SET UP FOR POSSIBLE OUTPUT FIELDS       00750000
007600* FROM THE XLKUT107 MODULE.                                       00760000
009300                                                                  00930000
009310     05  XL091-FILLER-4               PIC  X(122).                00931000
009400                                                                  00940000
009500     05  XL091-SQLCA                  PIC X(138).                 00950000
009600 01  XL091-COMMAREA                   PIC X(01).                  00960000
009700 01  XL091-USER-PGM                   PIC X(08) VALUE 'XLKUP046'. 00970001
