000100**************************************************************            
000500*                                                            *            
000600*   TO INVOKE THIS PROGRAM FROM A CICS EXIT YOU MUST USE THIS*            
000700*   FORMAT:                                                  *            
000800*     CALL XL074-ONLINE-PGM USING DFHEIBLK                   *            
000900*                                 XL074-COMMAREA             *            
001000*                                 XL074-ITEM-COMMAREA        *            
001100*   IN BATCH DO THIS:                                        *            
001200*     CALL XL074-BATCH-PGM USING XL074-ITEM-COMMAREA         *            
001300*    ******                IMPORTANT                 ******  *            
001400*                                                            *            
001500*     INITIALIZE XL074-ITEM-COMMAREA BEFORE CALLING XLKUT074.*            
001600*                                                            *            
001700*     AT LEAST ONE XL074-ITEM-ACCESS-METHOD IS REQUIRED,     *            
001800*        ALONG WITH ONE XL074-LOCATION-ACCESS-METHOD.        *            
001900*                                                            *            
002000*        DEPENDING ON THE XL074-ITEM-ACCESS-METHOD SELECTED  *            
002100*            THE APPROPRIATE KEY MUST ALSO BE FILLED IN.     *            
002200*                                                            *            
002300*        IF THE XL074-LOCATION-ACCESS IS SET TO "STORE"      *            
002400*           A STORE NUMBER IS REQUIRED.                      *            
002500*                                                            *            
002510*     IF THE ITEM ISN'T FOUND, AN APPROPRIATE RETURN CODE    *            
002520*        IS RETURNED.  FOR EXAMPLE, IF YOU REQUEST A         *            
002600*        SKU AND FILL IN THE ITEM FIELD, YOU WILL GET        *            
002610*        SKU NOT FOUND CONDITION.                            *            
002620*                                                            *            
002700*     REGARDING XL074-OUTPUT-FIELDS:                         *            
002800*       XL074-INTR-UPC-ID IS ALWAYS RETURNED AS ARE THE      *            
003000*       STORE EXPECTED (SE-QTY) AND INTRANSIT (IT-QTY)       *            
003010*       QUANITIES.                                           *            
003200*                                                            *            
003300*     NOTE: IF FIELD(S) ARE ADDED TO THIS COPYBOOK           *            
003400*           DECREMENT THE FILLER NEAR THE END OF THIS        *            
003500*           COPYBOOK SO THE TOTAL LENGTH REMAINS THE SAME    *            
003600*           AT LENGTH OF 1500                                *            
003700**************************************************************            
003800                                                                          
003900 01  XL074-ITEM-COMMAREA.                                                 
004000     05  XL074-ITEM-ACCESS-METHOD     PIC X(07).                          
004100         88  XL074-BY-SKU                   VALUE 'SKU    '.              
004200         88  XL074-BY-ITEM                  VALUE 'ITEM   '.              
004300         88  XL074-BY-UPC-NBR               VALUE 'UPCNBR '.              
004400         88  XL074-BY-INTERNAL-UPC          VALUE 'INTRUPC'.              
004500     05  XL074-LOCATION-ACCESS-METHOD PIC X(05).                          
004600         88  XL074-BY-STORE                 VALUE 'STORE'.                
004700         88  XL074-BY-ALL-LOCATIONS         VALUE 'ALL  '.                
004800     05  XL074-KEYS.                                                      
004900         10  XL074-KEY-INTR-UPC       PIC S9(9)   COMP.                   
005000         10  XL074-KEY-UPC-NBR        PIC S9(15)V COMP-3.                 
005100         10  XL074-KEY-ITEM-NBR       PIC S9(15)V COMP-3.                 
005200         10  XL074-KEY-SKU            PIC S9(8)V  COMP-3.                 
005300         10  XL074-KEY-LOC-NBR        PIC S9(4)   COMP.                   
005400         10  XL074-KEY-UPC-TYP-CDE    PIC X.                              
005500     05  XL074-FILLER                 PIC X(100).                         
005600     05  XL074-RETURN-CODE            PIC X(02).                          
005700         88  XL074-SUCCESSFUL              VALUES ZERO.                   
005800         88  XL074-SQL-ERROR               VALUE '01'.                    
005900         88  XL074-INTR-UPC-NOT-FOUND      VALUE '02'.                    
006000         88  XL074-UPC-NOT-FOUND           VALUE '03'.                    
006100         88  XL074-ITEM-NBR-NOT-FOUND      VALUE '04'.                    
006200         88  XL074-SKU-NOT-FOUND           VALUE '05'.                    
006300         88  XL074-LOCATION-NOT-FOUND      VALUE '06'.                    
006310         88  XL074-SKU-IS-ZERO             VALUE '07'.                    
006320         88  XL074-ITEM-NBR-IS-ZERO        VALUE '08'.                    
006330         88  XL074-UPC-NBR-IS-ZERO         VALUE '09'.                    
006340         88  XL074-INTR-UPC-IS-ZERO        VALUE '10'.                    
006350         88  XL074-LOCATION-NBR-IS-ZERO    VALUE '11'.                    
006400         88  XL074-UNKNOWN-ERROR           VALUE '97'.                    
006410         88  XL074-INVALID-ITEM-ACCESS     VALUE '98'.                    
006500         88  XL074-INVALID-LOCATION-ACCESS VALUE '99'.                    
006600     05  XL074-DB2-INFORMATION.                                           
006700         10  XL074-SQLCODE            PIC S9(9).                          
006800         10  FILLER                   PIC X(172).                         
006900     05  XL074-ERROR-PARAGRAPH-NBR    PIC X(5).                           
006910     05  XL074-CALLED-PROGRAM-PARA    PIC X(5).                           
007200     05  XL074-FILLER                 PIC X(20).                          
007300                                                                          
007400     05  XL074-OUTPUT-FIELDS.                                             
007500         10  XL074-SE-QTY             PIC S9(9) COMP.                     
007600         10  XL074-IT-QTY             PIC S9(9) COMP.                     
007610         10  XL074-INTR-UPC           PIC S9(9) COMP.                     
007700         10  FILLER                   PIC X(74).                          
007800                                                                          
007900     05  FILLER                       PIC X(929).                         
008000     05  XL074-SQLCA                  PIC X(136).                         
008100                                                                          
008200 01  XL074-COMMAREA                   PIC X(01).                          
008300 01  XL074-BATCH-PGM                  PIC X(08) VALUE 'XLKUT074'.         
008400 01  XL074-ONLINE-PGM                 PIC X(08) VALUE 'XLKCS074'.         
