000200 IDENTIFICATION DIVISION.                                         00010000
000300 PROGRAM-ID.         XMKRP036.                                    00020000
000400 AUTHOR.             BOB MCASEY.                                  00030000
000500 INSTALLATION.       KOHLS DEPARTMENT STORES.                     00040000
000600 DATE-WRITTEN.       02-17-2003.                                  00050000
000700 DATE-COMPILED.                                                   00060000
000710                                                                  00070000
000800******************************************************************00080000
000810*  COMPARES DATA FROM THE XMDOMAIN AND SYSTEM OF RECORD           00090000
000811*  XMT_DC_LOC_ASGMT TABLES.                                       00100000
000820******************************************************************00110000
      *---------------------------------------------------------------* 00120005
      *    WR/PITS#     DATE        DESCRIPTION                       * 00130005
      *    --------   ----------   ---------------------------------  * 00140005
      *    WR24442    08/20/2003   INITIAL CREATION.                  * 00150005
      *---------------------------------------------------------------* 00160005
000830                                                                  00170000
000900 ENVIRONMENT DIVISION.                                            00180000
001000                                                                  00190000
001100 CONFIGURATION SECTION.                                           00200000
001200                                                                  00210000
001300 SOURCE-COMPUTER.    IBM-3090.                                    00220000
001400 OBJECT-COMPUTER.    IBM-3090.                                    00230000
001500                                                                  00240000
001600 INPUT-OUTPUT SECTION.                                            00250000
001700                                                                  00260000
001800 FILE-CONTROL.                                                    00270000
001900                                                                  00280000
002000     SELECT XMT-INPUT-FILE       ASSIGN TO INP01.                 00290000
002100     SELECT RMS-INPUT-FILE       ASSIGN TO INP02.                 00300000
002200     SELECT ERROR-REPORT         ASSIGN TO RPT01.                 00310000
002300                                                                  00320000
002400 DATA DIVISION.                                                   00330000
002500                                                                  00340000
002600 FILE SECTION.                                                    00350000
002700                                                                  00360000
003400 FD  XMT-INPUT-FILE                                               00370000
003500     RECORDING MODE IS F                                          00380000
003600     BLOCK CONTAINS 0 RECORDS                                     00390000
003700     LABEL RECORDS ARE OMITTED.                                   00400000
003800 01  XMT-INPUT-RECORD                    PIC  X(24).              00410004
003900                                                                  00420000
002800 FD  RMS-INPUT-FILE                                               00430000
002900     RECORDING MODE IS F                                          00440000
003000     BLOCK CONTAINS 0 RECORDS                                     00450000
003100     LABEL RECORDS ARE OMITTED.                                   00460000
003200 01  RMS-INPUT-RECORD                    PIC  X(30).              00470004
003300                                                                  00480000
004000 FD  ERROR-REPORT                                                 00490000
004100     RECORDING MODE IS F                                          00500000
004200     BLOCK CONTAINS 0 RECORDS                                     00510000
004300     LABEL RECORDS ARE OMITTED.                                   00520000
004400 01  ERR-RPT-LINE                        PIC  X(200).             00530000
004500                                                                  00540000
004600 WORKING-STORAGE SECTION.                                         00550000
004700                                                                  00560000
006000 01 PC-PROGRAM-CONSTANTS.                                         00570000
006100     05 PC-PGM-NAME                PIC X(08)  VALUE 'XMKRP036'.   00580000
006200                                                                  00590000
006300 01 PV-PROGRAM-VARIABLES.                                         00600000
006400     05 PV-XMT-KEY.                                               00610000
006500        10 PV-XMT-DC-LOC-NBR       PIC 9(04).                     00620000
006600        10 PV-XMT-EFF-BEG-DTE      PIC X(10) VALUE SPACE.         00630000
006700     05 PV-XMT-DC-NBR              PIC 9(04).                     00640000
007000                                                                  00650000
007100     05 PV-RMS-KEY.                                               00660000
007200         10 PV-RMS-DC-LOC-NBR      PIC 9(04).                     00670000
007300         10 PV-RMS-EFF-BEG-DTE     PIC X(10) VALUE SPACE.         00680000
007400     05 PV-RMS-DC-NBR              PIC 9(04).                     00690000
007700                                                                  00700000
007800     05 PV-PAGE-CNT                 PIC S9(05)  VALUE ZERO.       00710000
007900     05 PV-LINE-CNT                 PIC S9(04)  COMP VALUE ZERO.  00720000
008000     05 PV-MAX-LINES                PIC S9(04)  COMP VALUE +71.   00730000
008100                                                                  00740000
008200     05 PV-DISPLAY-CNT              PIC ZZZZ9.                    00750000
008300     05 PV-NBR-ERRORS               PIC S9(04)  COMP              00760000
008400                                                VALUE ZERO.       00770000
008500     05 PV-DATE-YYMMDD.                                           00780000
008600          10 PV-YYMMDD-YY           PIC X(02)  VALUE SPACE.       00790000
008700          10 PV-YYMMDD-MM           PIC X(02)  VALUE SPACE.       00800000
008800          10 PV-YYMMDD-DD           PIC X(02)  VALUE SPACE.       00810000
008900     05 PV-TIME-HHMMSS.                                           00820000
009000          10 PV-HHMMSS-HH           PIC X(02)  VALUE SPACE.       00830000
009100          10 PV-HHMMSS-MM           PIC X(02)  VALUE SPACE.       00840000
009200          10 PV-HHMMSS-SS           PIC X(02)  VALUE SPACE.       00850000
009300     05 PV-MESSAGE                  PIC X(50)  VALUE SPACE.       00860000
009400                                                                  00870000
009500 01 RPT-TOTAL-LINE.                                               00880000
009600     05 FILLER     PIC  X(23) VALUE                               00890000
009700                         'TOTAL NUMBER OF ERRORS '.               00900000
009800     05 RPT-NBR-ERRORS PIC ZZZZZZ9.                               00910000
009900                                                                  00920000
010000 01 RPT-END-OF-REPORT-LINE.                                       00930000
010100     05 FILLER     PIC  X(21) VALUE                               00940000
010200                            '*** END OF REPORT ***'.              00950000
010300 01 PA-PROGRAM-ACCUMULATORS.                                      00960000
010400     05 PA-ERROR-MESSAGES      PIC 9(13) VALUE ZERO.              00970000
010500     05 PA-XMT-RECS-READ       PIC 9(13) VALUE ZERO.              00980000
010600     05 PA-RMS-RECS-READ       PIC 9(13) VALUE ZERO.              00990000
010700                                                                  01000000
010800 01 PS-PROGRAM-SWITCHES.                                          01010000
010900     05 PS-MORE-RMS-INPUT-RECS-SW PIC X(01)  VALUE 'Y'.           01020000
011000         88 PS-MORE-RMS-INPUT-RECS           VALUE 'Y'.           01030000
011100         88 PS-END-OF-RMS-INPUT-RECS         VALUE 'N'.           01040000
011200     05 PS-MORE-XMT-INPUT-RECS-SW PIC X(01)  VALUE 'Y'.           01050000
011300         88 PS-MORE-XMT-INPUT-RECS           VALUE 'Y'.           01060000
011400         88 PS-END-OF-XMT-INPUT-RECS         VALUE 'N'.           01070000
011500     05 PS-RMS-OR-XMT-ERR        PIC X(01)   VALUE '0'.           01080000
011600         88 PS-RMS-ERROR                     VALUE '1'.           01090000
011700         88 PS-XMT-ERROR                     VALUE '2'.           01100000
011800         88 PS-DATA-ERROR                    VALUE '3'.           01110000
011900                                                                  01120000
012000 01 RPT-REPORT-HEADING.                                           01130000
012100     05 FILLER     PIC  X(77)    VALUE SPACES.                    01140002
012200     05 FILLER     PIC  X(47)    VALUE                            01150000
012300         'XM DC LOCATION ASSIGNMENT DATA INTEGRITY ERRORS'.       01160000
012400                                                                  01170000
012500 01 RPT-COL-HEADING-1.                                            01180000
012600     05 FILLER     PIC  X(01) VALUE SPACE.                        01190000
012700     05 FILLER     PIC  X(07) VALUE ALL '-'.                      01200000
012800     05 FILLER     PIC  X(03) VALUE 'KEY'.                        01210000
012900     05 FILLER     PIC  X(08) VALUE ALL '-'.                      01220000
013000                                                                  01230000
013100 01 RPT-COL-HEADING-2.                                            01240000
013200     05 FILLER     PIC  X(01) VALUE SPACE.                        01250000
013300     05 FILLER     PIC  X(07) VALUE 'LOC_NBR'.                    01260000
013400     05 FILLER     PIC  X(02) VALUE SPACE.                        01270000
013500     05 FILLER     PIC  X(07) VALUE 'EFF_BEG'.                    01280000
013600     05 FILLER     PIC  X(06) VALUE SPACE.                        01290000
013700     05 FILLER     PIC  X(08) VALUE 'XMDOMAIN'.                   01300000
013800     05 FILLER     PIC  X(04) VALUE SPACE.                        01310000
013900     05 FILLER     PIC  X(16) VALUE 'SYSTEM OF RECORD'.           01320000
014000     05 FILLER     PIC  X(04) VALUE SPACE.                        01330000
014100     05 FILLER     PIC  X(07) VALUE 'MESSAGE'.                    01340000
014400                                                                  01350000
014500 01 RPT-COL-HEADING-3.                                            01360000
014600     05 FILLER     PIC  X(10) VALUE SPACE.                        01370000
014900     05 FILLER     PIC  X(04) VALUE '_DTE'.                       01380000
015000     05 FILLER     PIC  X(10) VALUE SPACE.                        01390000
015100     05 FILLER     PIC  X(06) VALUE 'DC_NBR'.                     01400000
015200     05 FILLER     PIC  X(06) VALUE SPACE.                        01410000
015300     05 FILLER     PIC  X(06) VALUE 'DC_NBR'.                     01420000
015600                                                                  01430000
015700 01 RPT-COL-HEADING-4.                                            01440000
015800     05 FILLER     PIC  X(132) VALUE ALL '-'.                     01450000
015900                                                                  01460000
016000 01 DL-DETAIL-LINE.                                               01470000
016100     05 FILLER                PIC  X(01) VALUE SPACE.             01480000
016200     05 DL-DC-LOC-NBR         PIC  X(04) VALUE SPACE.             01490000
016300     05 FILLER                PIC  X(04) VALUE SPACE.             01500000
016400     05 DL-EFF-BEG-DTE        PIC  X(10) VALUE SPACE.             01510000
016500     05 FILLER                PIC  X(05) VALUE SPACE.             01520000
016600     05 DL-XMT-DC-NBR         PIC  X(04) VALUE SPACE.             01530000
016700     05 FILLER                PIC  X(08) VALUE SPACE.             01540000
016800     05 DL-RMS-DC-NBR         PIC  X(04) VALUE SPACE.             01550000
016900     05 FILLER                PIC  X(15) VALUE SPACE.             01560000
017400     05 DL-MESSAGE            PIC  X(50) VALUE SPACE.             01570000
                                                                        01580000
005000     COPY DPWS200O.                                               01590001
005100                                                                  01600000
004800     COPY HORD007.                                                01610001
004900                                                                  01620000
005200 01 XMT-REC.                                                      01630000
005300     05 XMT-DC-LOC-NBR             PIC S9(04) COMP.               01640000
005400     05 XMT-EFF-BEG-DTE            PIC X(10) VALUE SPACE.         01650000
005500     05 XMT-DC-NBR                 PIC S9(04) COMP.               01660000
005400     05 XMT-PO-STRT-DTE            PIC X(10) VALUE SPACE.         01670000
005900                                                                  01680000
017510******************************************************************01690000
017600 PROCEDURE DIVISION.                                              01700000
017610******************************************************************01710000
017800 0000-MAIN-MODULE.                                                01720000
017900                                                                  01730000
018000       OPEN INPUT RMS-INPUT-FILE                                  01740000
018100                  XMT-INPUT-FILE                                  01750000
018200            OUTPUT ERROR-REPORT.                                  01760000
018300                                                                  01770000
018400       PERFORM 1000-INITIALIZE.                                   01780000
018500       PERFORM 7000-READ-XMT-INPUT-FILE.                          01790000
018600       PERFORM 7100-READ-RMS-INPUT-FILE.                          01800000
018700                                                                  01810000
018800       PERFORM 2000-PROCESS-RECS                                  01820000
018900          UNTIL (PS-END-OF-XMT-INPUT-RECS                         01830000
019000            AND PS-END-OF-RMS-INPUT-RECS).                        01840000
019100                                                                  01850000
019200       PERFORM 8400-WRITE-TOTALS.                                 01860000
019300                                                                  01870000
019400       CLOSE RMS-INPUT-FILE                                       01880000
019500             XMT-INPUT-FILE                                       01890000
019600             ERROR-REPORT.                                        01900000
019700                                                                  01910000
019800       DISPLAY '**** XMKRP036 STATISTICS ****'                    01920000
019900       DISPLAY 'TOTAL ERROR MESSAGES   : ' PA-ERROR-MESSAGES.     01930000
020000       DISPLAY 'TOTAL XMT RECORDS READ : ' PA-XMT-RECS-READ.      01940000
020100       DISPLAY 'TOTAL RMS RECORDS READ : ' PA-RMS-RECS-READ.      01950000
020200       DISPLAY ' '                                                01960000
020300                                                                  01970000
020400       STOP RUN.                                                  01980000
020500                                                                  01990000
020600 1000-INITIALIZE.                                                 02000000
020700                                                                  02010000
020800       ACCEPT PV-DATE-YYMMDD FROM DATE.                           02020000
020900       MOVE PV-YYMMDD-YY TO DP200O-RUN-YEAR.                      02030000
021000       MOVE PV-YYMMDD-MM TO DP200O-RUN-MONTH.                     02040000
021100       MOVE PV-YYMMDD-DD TO DP200O-RUN-DAY.                       02050000
021200                                                                  02060000
021300       ACCEPT PV-TIME-HHMMSS FROM TIME.                           02070000
021400       MOVE PV-HHMMSS-HH TO DP200O-RUN-HOUR.                      02080000
021500       MOVE PV-HHMMSS-MM TO DP200O-RUN-MINUTE.                    02090000
021600       MOVE PC-PGM-NAME TO DP200O-PROGRAM-NAME.                   02100000
021700       MOVE 1        TO DP200O-REPORT-NUMBER.                     02110000
021800                                                                  02120000
021900       PERFORM 8100-WRITE-STD-RPT-HEADING.                        02130000
022000       PERFORM 8200-WRITE-REPORT-HEADING.                         02140000
022100       PERFORM 8300-WRITE-COLUMN-HEADING.                         02150000
022200                                                                  02160000
022300 2000-PROCESS-RECS.                                               02170000
022400                                                                  02180000
022500       MOVE HO007-DCLOC-LOC-NBR     TO  PV-RMS-DC-LOC-NBR.        02190000
022600       MOVE HO007-DCLOC-EFF-BEG-DTE TO  PV-RMS-EFF-BEG-DTE.       02200000
022700       MOVE HO007-DCLOC-DC-NBR      TO  PV-RMS-DC-NBR.            02210000
023000                                                                  02220000
023100       MOVE XMT-DC-LOC-NBR      TO  PV-XMT-DC-LOC-NBR             02230000
023200       MOVE XMT-EFF-BEG-DTE     TO  PV-XMT-EFF-BEG-DTE.           02240000
023300       MOVE XMT-DC-NBR          TO  PV-XMT-DC-NBR.                02250000
023600                                                                  02260000
023700       IF PV-XMT-EFF-BEG-DTE NOT > ZEROES                         02270000
023800           MOVE SPACES TO PV-XMT-EFF-BEG-DTE                      02280000
023900       END-IF.                                                    02290000
024100                                                                  02300000
024200      IF PV-XMT-KEY = PV-RMS-KEY                                  02310000
024400         PERFORM 3000-COMPARE-FIELDS                              02320000
024500         PERFORM 7000-READ-XMT-INPUT-FILE                         02330000
024600         PERFORM 7100-READ-RMS-INPUT-FILE                         02340000
024700      ELSE                                                        02350000
024800         IF ((PV-RMS-KEY < PV-XMT-KEY)                            02360000
024900             OR PS-END-OF-XMT-INPUT-RECS) AND                     02370000
025000             PS-MORE-RMS-INPUT-RECS                               02380000
025100             MOVE '1' TO PS-RMS-OR-XMT-ERR                        02390000
025200             MOVE 'KEY ON SYSTEM OF RECORD TABLE ONLY'            02400001
025300                TO PV-MESSAGE                                     02410000
025400             PERFORM 8000-WRITE-OUTPUT-REC                        02420000
025500             PERFORM 7100-READ-RMS-INPUT-FILE                     02430000
025600          ELSE                                                    02440000
025700             IF ((PV-RMS-KEY > PV-XMT-KEY)                        02450000
025800                OR PS-END-OF-RMS-INPUT-RECS) AND                  02460000
025900                PS-MORE-XMT-INPUT-RECS                            02470000
026000                MOVE '2' TO PS-RMS-OR-XMT-ERR                     02480000
026100                MOVE 'KEY ON XM DOMAIN TABLE ONLY' TO PV-MESSAGE  02490001
026200                PERFORM 8000-WRITE-OUTPUT-REC                     02500000
026300                PERFORM 7000-READ-XMT-INPUT-FILE                  02510000
026400             END-IF                                               02520000
026500          END-IF                                                  02530000
026600      END-IF.                                                     02540000
026700                                                                  02550000
026800 3000-COMPARE-FIELDS.                                             02560000
026900                                                                  02570000
027000      EVALUATE TRUE                                               02580000
027100         WHEN PV-RMS-DC-NBR NOT = PV-XMT-DC-NBR                   02590000
027200             MOVE '3' TO PS-RMS-OR-XMT-ERR                        02600000
027300             MOVE 'DC NUMBERS DO NOT MATCH'                       02610000
027400                        TO PV-MESSAGE                             02620000
027500             PERFORM 8000-WRITE-OUTPUT-REC                        02630000
027600      END-EVALUATE.                                               02640000
027700                                                                  02650000
027800 7000-READ-XMT-INPUT-FILE.                                        02660000
027900                                                                  02670000
028000       INITIALIZE XMT-REC.                                        02680000
028100                                                                  02690000
028200       READ XMT-INPUT-FILE INTO XMT-REC                           02700000
028300           AT END SET PS-END-OF-XMT-INPUT-RECS TO TRUE.           02710000
028400                                                                  02720000
028500       ADD 1 TO PA-XMT-RECS-READ.                                 02730000
028600                                                                  02740000
028700 7100-READ-RMS-INPUT-FILE.                                        02750000
028800                                                                  02760000
028900       INITIALIZE HO007-DCLOCASG-DATA                             02770000
029000                                                                  02780000
029100       READ RMS-INPUT-FILE INTO HO007-DCLOCASG-DATA               02790000
029200            AT END SET PS-END-OF-RMS-INPUT-RECS TO TRUE.          02800000
029300                                                                  02810000
029400       ADD 1 TO PA-RMS-RECS-READ.                                 02820000
029500                                                                  02830000
029600 8000-WRITE-OUTPUT-REC.                                           02840000
029800                                                                  02850000
029900       IF PS-RMS-ERROR                                            02860000
030000          MOVE SPACES TO DL-DETAIL-LINE                           02870000
030100          MOVE PV-RMS-DC-LOC-NBR      TO DL-DC-LOC-NBR            02880000
030200          MOVE PV-RMS-EFF-BEG-DTE     TO DL-EFF-BEG-DTE           02890000
030300          MOVE PV-RMS-DC-NBR          TO DL-RMS-DC-NBR            02900000
030600          MOVE PV-MESSAGE TO DL-MESSAGE                           02910000
030700       ELSE                                                       02920000
030800          IF PS-XMT-ERROR                                         02930000
030900             MOVE SPACES TO DL-DETAIL-LINE                        02940000
031000             MOVE PV-XMT-DC-LOC-NBR   TO DL-DC-LOC-NBR            02950000
031100             MOVE PV-XMT-EFF-BEG-DTE  TO DL-EFF-BEG-DTE           02960000
031200             MOVE PV-XMT-DC-NBR       TO DL-XMT-DC-NBR            02970000
031500             MOVE PV-MESSAGE TO DL-MESSAGE                        02980000
031600          ELSE                                                    02990000
031700             MOVE SPACES TO DL-DETAIL-LINE                        03000000
031800             MOVE PV-RMS-DC-LOC-NBR   TO DL-DC-LOC-NBR            03010000
031900             MOVE PV-RMS-EFF-BEG-DTE  TO DL-EFF-BEG-DTE           03020000
032000             MOVE PV-RMS-DC-NBR       TO DL-RMS-DC-NBR            03030000
032500             MOVE PV-XMT-DC-NBR       TO DL-XMT-DC-NBR            03040000
032700             MOVE PV-MESSAGE TO DL-MESSAGE                        03050000
032800          END-IF                                                  03060000
032900       END-IF.                                                    03070000
033000                                                                  03080000
033100       IF PV-LINE-CNT > PV-MAX-LINES                              03090000
033200          PERFORM 8100-WRITE-STD-RPT-HEADING                      03100000
033300          PERFORM 8200-WRITE-REPORT-HEADING                       03110000
033400          PERFORM 8300-WRITE-COLUMN-HEADING                       03120000
033500       END-IF.                                                    03130000
033600                                                                  03140000
033700       WRITE ERR-RPT-LINE FROM DL-DETAIL-LINE                     03150000
033800             AFTER ADVANCING 1 LINE.                              03160000
033900       ADD +1 TO PV-LINE-CNT.                                     03170000
034000                                                                  03180000
034010       MOVE 4095 TO RETURN-CODE.                                  03190000
034100       ADD 1 TO PA-ERROR-MESSAGES.                                03200000
034200                                                                  03210000
034300 8100-WRITE-STD-RPT-HEADING.                                      03220000
034400                                                                  03230000
034500       INITIALIZE PV-LINE-CNT.                                    03240000
034600       ADD 1  TO PV-PAGE-CNT.                                     03250000
034700       MOVE PV-PAGE-CNT TO DP200O-PAGE-NUMBER.                    03260000
034800       WRITE ERR-RPT-LINE FROM DP200O-STANDRD-HEADER-200-COLS     03270000
034900             AFTER ADVANCING PAGE.                                03280000
035000       ADD +1 TO PV-LINE-CNT.                                     03290000
035100                                                                  03300000
035200 8200-WRITE-REPORT-HEADING.                                       03310000
035300                                                                  03320000
035400       WRITE ERR-RPT-LINE FROM RPT-REPORT-HEADING                 03330000
035500            AFTER ADVANCING 1 LINES.                              03340000
035600       ADD +1 TO PV-LINE-CNT.                                     03350000
035700                                                                  03360000
035800 8300-WRITE-COLUMN-HEADING.                                       03370000
035900                                                                  03380000
036000       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-1                  03390000
036100            AFTER ADVANCING 2 LINES.                              03400000
036200       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-2                  03410000
036300            AFTER ADVANCING 1 LINES.                              03420000
036400       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-3                  03430000
036500            AFTER ADVANCING 1 LINES.                              03440000
036600       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-4                  03450000
036700            AFTER ADVANCING 1 LINES.                              03460000
036800       ADD +5 TO PV-LINE-CNT.                                     03470000
036900                                                                  03480000
037000 8400-WRITE-TOTALS.                                               03490000
037100                                                                  03500000
037200       IF PV-LINE-CNT > PV-MAX-LINES                              03510000
037300          PERFORM 8100-WRITE-STD-RPT-HEADING                      03520000
037400          PERFORM 8200-WRITE-REPORT-HEADING                       03530000
037500          PERFORM 8300-WRITE-COLUMN-HEADING                       03540000
037600       END-IF.                                                    03550000
037700                                                                  03560000
037800      MOVE PA-ERROR-MESSAGES TO RPT-NBR-ERRORS                    03570000
037900      WRITE ERR-RPT-LINE FROM RPT-TOTAL-LINE                      03580000
038000            AFTER ADVANCING 2 LINES.                              03590000
038100      ADD +2 TO PV-LINE-CNT.                                      03600000
038200                                                                  03610000
038300      IF PV-LINE-CNT > PV-MAX-LINES                               03620000
038400         PERFORM 8100-WRITE-STD-RPT-HEADING                       03630000
038500         PERFORM 8200-WRITE-REPORT-HEADING                        03640000
038600         PERFORM 8300-WRITE-COLUMN-HEADING                        03650000
038700      END-IF.                                                     03660000
038800      WRITE ERR-RPT-LINE FROM RPT-END-OF-REPORT-LINE              03670000
038900            AFTER ADVANCING 1 LINES.                              03680000
039000                                                                  03690000
