      ***********************************************************       00010000
      **                      XMRD013                          **       00020000
      **                     LRECL=80                          **       00030004
      **  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00040000
      **  XMT_PRICG_GRID TABLE.                                **       00050000
      ***********************************************************       00060000
       01  XM013-PRICG-GRID-UNLOAD.                                     00070000
           10 XM013-PRICG-GRID-ID           PIC  S9(09) COMP.           00080000
           10 XM013-PRICG-GRID-DESC         PIC   X(20).                00090000
           10 XM013-PRCHG-ID                PIC  S9(09) COMP.           00100001
           10 XM013-SOR-CRE-TMST            PIC   X(26).                00330000
           10 XM013-SOR-LAST-UPD-TMST       PIC   X(26).                00340000
