000100***********************************************************       00020001
000200**                      XMRD012                          **       00030001
000300**                     LRECL=118                         **       00040006
000400**  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00050001
000500**  XMT_PRCHG_MDSE TABLE.                                **       00060008
000600***********************************************************       00070001
       01  XM012-PRCHG-MDSE-UNLOAD.                                     00080001
           10 XM012-PRCHG-ID             PIC  S9(9) COMP.               00090001
           10 XM012-STR-GP-TYP-CDE       PIC  S9(4) COMP.               00100001
           10 XM012-STR-GP-ID            PIC  S9(4) COMP.               00110001
           10 XM012-PRCHG-MDSE-ID        PIC  S9(9) COMP.               00120001
           10 XM012-MDSE-HIER-CDE        PIC   X(3).                    00130001
           10 XM012-DEPT-NBR             PIC  S9(4)V COMP-3.            00140001
           10 XM012-DEPT-NBR-NULL        PIC   X.                       00141002
              88 XM012-DEPT-NBR-IS-NULL       VALUE '?'.                00142002
           10 XM012-MAJ-CL-NBR           PIC  S9(4)V COMP-3.            00150001
           10 XM012-MAJ-CL-NBR-NULL      PIC   X.                       00151002
              88 XM012-MAJ-CL-NBR-IS-NULL     VALUE '?'.                00152002
           10 XM012-SUB-CL-NBR           PIC  S9(4)V COMP-3.            00160001
           10 XM012-SUB-CL-NBR-NULL      PIC   X.                       00161002
              88 XM012-SUB-CL-NBR-IS-NULL     VALUE '?'.                00162002
           10 XM012-STYL-ID              PIC  S9(8)V COMP-3.            00170001
           10 XM012-STYL-ID-NULL         PIC   X.                       00171002
              88 XM012-STYL-ID-IS-NULL        VALUE '?'.                00172002
           10 XM012-SKU-NBR              PIC  S9(8)V COMP-3.            00180001
           10 XM012-SKU-NBR-NULL         PIC   X.                       00181002
              88 XM012-SKU-NBR-IS-NULL        VALUE '?'.                00182002
           10 XM012-UNT-RTL-AMT          PIC  S9(7)V9(2) COMP-3.        00183007
           10 XM012-UNT-RTL-AMT-NULL     PIC   X.                       00184007
              88 XM012-UNT-RTL-AMT-IS-NULL     VALUE '?'.               00185007
           10 XM012-GP-PRIC-ID           PIC  S9(9) COMP.               00200001
           10 XM012-GP-PRIC-ID-NULL      PIC   X.                       00201002
              88 XM012-GP-PRIC-ID-IS-NULL     VALUE '?'.                00202005
           10 XM012-GP-RTL-QTY           PIC  S9(4) COMP.               00210001
           10 XM012-GP-RTL-QTY-NULL      PIC   X.                       00211002
              88 XM012-GP-RTL-QTY-IS-NULL     VALUE '?'.                00212002
           10 XM012-GP-RTL-AMT           PIC  S9(7)V9(2) COMP-3.        00220001
           10 XM012-GP-RTL-AMT-NULL      PIC   X.                       00221002
              88 XM012-GP-RTL-AMT-IS-NULL      VALUE '?'.               00222002
           10 XM012-CLR-TYP-CDE          PIC   X.                       00226006
           10 XM012-CLR-TYP-CDE-NULL     PIC   X.                       00227006
              88 XM012-CLR-TYP-CDE-IS-NULL     VALUE '?'.               00228006
           10 XM012-PRICG-GRID-ID        PIC  S9(9) COMP.               00229006
           10 XM012-PRICG-GRID-ID-NULL   PIC   X.                       00229106
              88 XM012-PRICG-GRID-ID-IS-NULL   VALUE '?'.               00229206
           10 XM012-SOR-CRE-TMST         PIC   X(26).                   00230001
           10 XM012-SOR-LAST-UPD-TMST    PIC   X(26).                   00240001
