000100***********************************************************       00020001
000200**                      XMRD011                          **       00030001
000300**                     LRECL=071                         **       00040003
000400**  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00050001
000500**  XMT_STR_GP_PRCHG TABLE.                              **       00060008
000600***********************************************************       00070001
       01  XM011-STR-GP-PRCHG-UNLOAD.                                   00080005
           10 XM011-PRCHG-ID                PIC  S9(9) COMP.            00090006
           10 XM011-STR-GP-TYP-CDE          PIC  S9(4) COMP.            00100002
           10 XM011-STR-GP-ID               PIC  S9(4) COMP.            00110002
           10 XM011-PRCHG-EFF-DTE           PIC   X(10).                00150002
           10 XM011-OH-AUTO-CNT-IND         PIC   X(1).                 00160002
           10 XM011-SOR-CRE-TMST            PIC   X(26).                00300001
           10 XM011-SOR-LAST-UPD-TMST       PIC   X(26).                00310001
