      ***********************************************************       00010000
      **                      XMRD014                          **       00020000
      **                     LRECL=75                          **       00030001
      **  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00040000
      **  XMT_PRICG_GRID_DTL TABLE.                            **       00050000
      ***********************************************************       00060000
       01  XM014-PRICG-GRID-DTL-UNLOAD.                                 00070000
           10 XM014-PRICG-GRID-ID           PIC  S9(09) COMP.           00080000
           10 XM014-PRICG-GRID-DTL-ID       PIC  S9(09) COMP.           00081000
           10 XM014-MIN-UNT-RTL-AMT         PIC  S9(7)V9(2) COMP-3.     00082000
           10 XM014-MAX-UNT-RTL-AMT         PIC  S9(7)V9(2) COMP-3.     00083000
           10 XM014-NEW-UNT-RTL-AMT         PIC  S9(7)V9(2) COMP-3.     00084000
           10 XM014-SOR-CRE-TMST            PIC   X(26).                00100000
           10 XM014-SOR-LAST-UPD-TMST       PIC   X(26).                00110000
