      ***********************************************************       00010000
      **                      XMRD016                          **       00020000
      **                     LRECL=463                         **       00030000
      **  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00040000
      **  XMT_LOC TABLE FOR XM DATA INTEGRITY.                 **       00050000
      ***********************************************************       00060000
       01  XM016-LOC-UNLOAD.                                            00070000
           05  XM016-LOC-NBR                 PIC  S9(4) COMP.           00230001
           05  XM016-REPLT-STR-NBR           PIC  S9(4)V COMP-3.        00240001
           05  FILLER                        PIC  X(01).                00250000
           05  XM016-DIST-NBR                PIC  S9(4)V COMP-3.        00260001
           05  FILLER                        PIC  X(01).                00270000
           05  XM016-LOC-TYP-CDE             PIC  X(02).                00280001
           05  XM016-LOC-NM                  PIC  X(40).                00290001
           05  XM016-LOC-5-ABBR-NM           PIC  X(05).                00300001
           05  XM016-LNE-1-ADDR              PIC  X(30).                00310001
           05  XM016-LNE-2-ADDR              PIC  X(30).                00320001
           05  XM016-CTY-NM                  PIC  X(20).                00330001
           05  XM016-ST-CDE                  PIC  X(02).                00340001
           05  XM016-ZIP-10-CDE              PIC  X(10).                00350001
           05  XM016-OPN-DTE                 PIC  X(10).                00360001
           05  XM016-CLO-DTE                 PIC  X(10).                00370001
           05  XM016-PHN-NBR                 PIC  X(26).                00380001
           05  FILLER                        PIC  X(01).                00390000
           05  XM016-MGR-NM                  PIC  X(32).                00400001
           05  FILLER                        PIC  X(01).                00410000
           05  XM016-FINCL-CLO-DTE           PIC  X(10).                00420001
           05  FILLER                        PIC  X(01).                00430000
           05  XM016-MN-SLS-INCL-DTE         PIC  X(10).                00440001
           05  FILLER                        PIC  X(01).                00450000
           05  XM016-YR-SLS-INCL-DTE         PIC  X(10).                00460001
           05  FILLER                        PIC  X(01).                00470000
           05  XM016-OCPNC-DTE               PIC  X(10).                00480001
           05  FILLER                        PIC  X(01).                00490000
           05  XM016-POS-RGST-BNK-QTY        PIC  S9(3)V COMP-3.        00500001
           05  FILLER                        PIC  X(01).                00510000
           05  XM016-DST-IND                 PIC  X(01).                00520001
           05  FILLER                        PIC  X(01).                00530000
           05  XM016-E-BUS-IND               PIC  X(01).                00540001
           05  FILLER                        PIC  X(01).                00550000
           05  XM016-FMT-CDE                 PIC  S9(4)V COMP-3.        00560001
           05  FILLER                        PIC  X(01).                00570000
           05  XM016-STD-TM-ZN-CDE           PIC  X(03).                00580001
           05  FILLER                        PIC  X(01).                00590000
           05  XM016-SLS-INCL-DTE-CDE        PIC  X(01).                00600001
           05  FILLER                        PIC  X(01).                00610000
           05  XM016-TOT-SLG-SQ-FTG-QTY      PIC  S9(8)V COMP-3.        00620001
           05  FILLER                        PIC  X(01).                00630000
           05  XM016-TOT-SQ-FTG-QTY          PIC  S9(8)V COMP-3.        00640001
           05  FILLER                        PIC  X(01).                00650000
           05  XM016-STP-ORD-DAYS-QTY        PIC  S9(3)V COMP-3.        00660001
           05  FILLER                        PIC  X(01).                00670000
           05  XM016-STRT-ORD-DAYS-QTY       PIC  S9(3)V COMP-3.        00680001
           05  FILLER                        PIC  X(01).                00690000
           05  XM016-ACQR-DTE                PIC  X(10).                00700001
           05  FILLER                        PIC  X(01).                00710000
           05  XM016-RMDL-DTE                PIC  X(10).                00720001
           05  FILLER                        PIC  X(01).                00730000
           05  XM016-MEDN-AGE-NBR            PIC  S9(2)V9(2) COMP-3.    00740001
           05  FILLER                        PIC  X(01).                00750000
           05  XM016-EST-HH-INCM-AMT         PIC  S9(11)V COMP-3.       00760001
           05  FILLER                        PIC  X(01).                00770000
           05  XM016-QTR-SLS-INCL-DTE        PIC  X(10).                00780001
           05  FILLER                        PIC  X(01).                00790000
           05  XM016-SEA-SLS-INCL-DTE        PIC  X(10).                00800001
           05  FILLER                        PIC  X(01).                00810000
           05  XM016-EXTD-MALL-NM            PIC  X(40).                00820001
           05  FILLER                        PIC  X(01).                00830000
           05  XM016-GRND-OPN-DTE            PIC  X(10).                00840001
           05  FILLER                        PIC  X(01).                00850000
           05  XM016-PRCHG-CRE-IND           PIC  X(01).                00860001
           05  FILLER                        PIC  X(01).                00870000
           05  XM016-IN-STR-PRCHG-IND        PIC  X(01).                00880001
           05  FILLER                        PIC  X(01).                00890000
           05  XM016-LAST-UPD-TMST           PIC  X(26).                00900001
           05  XM016-LOC-10-ABBR-NM          PIC  X(10).                00910001
           05  FILLER                        PIC  X(01).                00920000
           05  XM016-NW-STR-OPNG-GP-MN       PIC  S9(2)V COMP-3.        00930001
           05  XM016-NW-STR-OPNG-GP-MN-NULL  PIC  X(01).                00940001
               88  XM016-OPNG-GP-MN-IS-NULL              VALUE '?'.     00941002
           05  XM016-NW-STR-OPNG-GP-YR       PIC  S9(4)V COMP-3.        00950001
           05  XM016-NW-STR-OPNG-GP-YR-NULL  PIC  X(01).                00951002
               88  XM016-OPNG-GP-YR-IS-NULL              VALUE '?'.     00952002
