      ******************************************************************        
      *                         XMWS002                                *        
      *                                                                *        
      *   THIS COPYBOOK IS NEEDED TO COMMUNICATE MERCHANDISING         *        
      *   INFOMATION TO OTHER PROGRAMS.                                *        
      *   LENGTH:  200 BYTES                                           *        
      ******************************************************************        
       01  XM002-ITEM-COMMAREA.                                                 
           05  XM002-SEND-FIELDS.                                               
               10  XM002-SKU                PIC S9(8)V COMP-3.                  
               10  FILLER                   PIC X(95).                          
           05  XM002-RETURN-FIELDS.                                             
               10  XM002-SETUP-DATE         PIC X(10).                          
               10  XM002-ORIG-UNT-RTL-AMT   PIC S9(5)V9(2) COMP-3.              
               10  XM002-LOWST-UNT-RTL-AMT  PIC S9(5)V9(2) COMP-3.              
               10  XM002-RETURN-FLAG.                                           
                   15 XM002-RETURN-SQL      PIC X(01).                          
                       88 XM002-SUCCESSFUL        VALUE 'Y'.                    
                       88 XM002-NOT-SUCCESSFUL    VALUE 'N'.                    
               10  XM002-RETURN-CODES.                                          
                   15 XM002-RETURN-SQLCODE  PIC S9(04).                         
               10  FILLER                   PIC X(77).                          
      ******************************************************************        
