      ******************************************************************        
      *                         XMWS003                                *        
      *                                                                *        
      *   THIS COPYBOOK IS NEEDED TO COMMUNICATE CURRENT POSITION      *        
      *   TO OTHER PROGRAMS.  (ON-LINE VERSION)                        *        
      *   LENGTH:  200 BYTES                                           *        
      ******************************************************************        
       01  XM003-ITEM-COMMAREA.                                                 
           05  XM003-SEND-FIELDS.                                               
               10  XM003-KEY-SKU            PIC S9(08).                         
               10  XM003-KEY-STR-NBR        PIC S9(04)  COMP.                   
               10  XM003-ITEM-NBR           PIC S9(15)V COMP-3.                 
               10  XM003-SEND-FLAGS.                                            
                   15 XM003-ONORDER-FLAG    PIC X(01).                          
                       88 XM003-ONORDER-YES     VALUE 'Y'.                      
                       88 XM003-ONORDER-NO      VALUE 'N'.                      
                   15 XM003-ONHAND-FLAG     PIC X(01).                          
                       88 XM003-ONHAND-YES      VALUE 'Y'.                      
                       88 XM003-ONHAND-NO       VALUE 'N'.                      
               10  FILLER                   PIC X(29).                          
           05  XM003-RETURN-FIELDS.                                             
               10  XM003-ONORDER            PIC S9(7) COMP.                     
               10  XM003-ONHAND             PIC S9(7)V COMP-3.                  
               10  XM003-LAST-SALE-DATE     PIC X(10).                          
               10  XM003-LAST-RCVD-DATE     PIC X(10).                          
               10  XM003-FIRST-SALE-DATE    PIC X(10).                          
               10  XM003-FIRST-RCVD-DATE    PIC X(10).                          
               10  XM003-YTD-SALES-AMT      PIC S9(7)V9(2) COMP-3.              
               10  XM003-YTD-SALES-UNIT-QTY PIC S9(7)V COMP-3.                  
               10  XM003-LAST-UPD-TMST      PIC X(26).                          
               10  XM003-RETURN-FLAGS.                                          
                   15 XM003-RETURN-SQL            PIC X(01).                    
                       88 XM003-SUCCESSFUL        VALUE 'Y'.                    
                       88 XM003-NOT-SUCCESSFUL    VALUE 'N'.                    
                   15 XM003-RETURN-ONORDER        PIC X(01).                    
                       88 XM003-ONORDER-ERROR-Y   VALUE 'Y'.                    
                       88 XM003-ONORDER-ERROR-N   VALUE 'N'.                    
                   15 XM003-RETURN-ONHAND         PIC X(01).                    
                       88 XM003-ONHAND-ERROR-Y    VALUE 'Y'.                    
                       88 XM003-ONHAND-ERROR-N    VALUE 'N'.                    
               10  XM003-RETURN-CODES.                                          
                   15 XM003-RETURN-SQLCODE  PIC S9(04).                         
               10  FILLER                   PIC X(61).                          
