       IDENTIFICATION DIVISION.                                         00010000
       PROGRAM-ID.             XSKRP021.                                00020000
       AUTHOR.                 KOHLS DEPARTMENT STORES.                 00030000
       INSTALLATION.           KOHLS DEPARTMENT STORES.                 00040000
       DATE-WRITTEN.           01/30/2003.                              00050000
       DATE-COMPILED.                                                   00060000
      ******************************************************************00070000
      ***XS DOMAIN - XST_SKU REPORT                                     00080000
      ******************************************************************00090000
      **THIS PROGRAM FORMATS XST_SKU ERROR DATA INTO A REPORT           00100000
      ******************************************************************00110000
      *DATE:01/30/2003   MADE BY:CHRIS ALBRIGHT INITIAL WRITE           00120000
      ******************************************************************00130021
091004*DATE:09/10/2004   MADE BY:JULIE TEWES ADD CUSTFACG-CLOR-DESC AND 00140021
091004*                  POG-IND FIELDS                                 00150021
112006*DATE:11/20/2006   MADE BY:RICH KELLEN REMOVE REFERENCE TO        00151026
112006*                  WT-UM-CDE AS THE FIELDS USED FOR THIS FIELD ARE00152027
112006*                  OF DIFFERENT FORMATS AND THE COMPARISON WAS NOT00153027
112006*                  VALID. ALSO, CHANGE REPORT TO PRINT ON THE 200 00154027
112006*                  BYTE LENGTH FORMAT USING 2 LINES INSTEAD OF 3. 00155027
091004******************************************************************00160021
       ENVIRONMENT DIVISION.                                            00170000
       CONFIGURATION SECTION.                                           00180000
       SOURCE-COMPUTER.                        IBM-3090.                00190000
       OBJECT-COMPUTER.                        IBM-3090.                00200000
       INPUT-OUTPUT SECTION.                                            00210000
       FILE-CONTROL.                                                    00220000
                                                                        00230000
           SELECT INPUT-FILE                                            00240000
                  ASSIGN TO INP01.                                      00250000
           SELECT REPORT-FILE                                           00260000
                  ASSIGN TO RPT01.                                      00270000
                                                                        00280000
       DATA DIVISION.                                                   00290000
       FILE SECTION.                                                    00300000
                                                                        00310000
       FD  INPUT-FILE                                                   00320000
           RECORDING MODE IS F                                          00330000
           LABEL RECORDS ARE STANDARD                                   00340000
           BLOCK CONTAINS 0 CHARACTERS.                                 00350000
       01  INPUT-RECORD                    PIC X(400).                  00360021
                                                                        00370000
       FD  REPORT-FILE                                                  00380000
           RECORDING MODE IS F                                          00390000
           LABEL RECORDS ARE STANDARD                                   00400000
           BLOCK CONTAINS 0 CHARACTERS.                                 00410000
       01  REPORT-RECORD                   PIC X(201).                  00420024
                                                                        00430000
       WORKING-STORAGE SECTION.                                         00440000
      ******************************************************************00450000
      *SWITCHES                                                         00460000
      ******************************************************************00470000
       01  PS-PROGRAM-SWITCHES.                                         00480000
           05  PS-END-OF-INPUT-FILE-SW    PIC X(01)   VALUE 'N'.        00490000
               88  PS-EOF-INPUT-FILE                  VALUE 'Y'.        00500000
               88  PS-NOT-EOF-INPUT-FILE              VALUE 'N'.        00510000
      ******************************************************************00520000
      **TIME FIELDS                                                     00530000
      ******************************************************************00540000
       01  DF-DATETIME-FIELDS.                                          00550000
           05  DF-ACCEPT-TIME.                                          00560000
               10  DF-ACCEPT-HR             PIC 9(02) VALUE ZEROS.      00570000
               10  DF-ACCEPT-MIN            PIC 9(02) VALUE ZEROS.      00580000
               10  DF-ACCEPT-SEC            PIC 9(02) VALUE ZEROS.      00590000
               10  DF-ACCEPT-HSEC           PIC 9(02) VALUE ZEROS.      00600000
           05  DF-ACCEPT-DATE.                                          00610000
               10  DF-ACCEPT-YR             PIC 9(02) VALUE ZEROS.      00620000
               10  DF-ACCEPT-MO             PIC 9(02) VALUE ZEROS.      00630000
               10  DF-ACCEPT-DY             PIC 9(02) VALUE ZEROS.      00640000
      ******************************************************************00650000
      *PROGRAM CONSTANTS                                                00660000
      ******************************************************************00670000
       01  PC-PROGRAM-CONSTANTS.                                        00680000
           05  PC-PROGRAM-NAME            PIC X(08) VALUE 'XSKRP021'.   00690000
      ******************************************************************00700000
      **PROGRAM COUNTS                                                  00710000
      ******************************************************************00720000
       01  PC-PROGRAM-COUNTERS.                                         00730000
           05  PC-LINE-COUNT              PIC 9(03) VALUE ZEROS.        00740000
           05  PC-PAGE-COUNT              PIC 9(03) VALUE ZEROS.        00750000
           05  PC-RECORDS-READ            PIC 9(06) VALUE ZEROS.        00760000
      ***************************************************************** 00770000
      **ABEND CODE FIELDS                                               00780000
      ***************************************************************** 00790000
       01  ABEND-CODE                     PIC S9(4)                     00800000
                                                 VALUE ZEROS COMP SYNC. 00810000
       01  PV-MISC-ABEND-FIELDS.                                        00820000
           05  PV-PARAGRAPH-NAME          PIC  X(30)    VALUE SPACE.    00830000
           05  PV-OPERATION-MSG-1         PIC  X(40)    VALUE SPACE.    00840000
           05  PV-OPERATION-MSG-2         PIC  X(40)    VALUE SPACE.    00850000
           05  PV-DB2-OPERATION           PIC  X(30)    VALUE SPACES.   00860000
      ***************************************************************** 00870000
      **REPORT HEADINGS                                                 00880000
      ***************************************************************** 00890000
       01  REPORT-HEADING-1.                                            00900000
           05  FILLER                     PIC  X(56)  VALUE SPACES.     00910000
           05  FILLER                     PIC  X(22)                    00920000
                                 VALUE 'XS DOMAIN ERROR REPORT'.        00930000
           05  FILLER                     PIC  X(37)  VALUE SPACES.     00940000
       01  REPORT-HEADING-2.                                            00950000
           05  FILLER                     PIC  X(55)  VALUE SPACES.     00960000
           05  FILLER                     PIC  X(24)                    00970000
                                 VALUE 'XST_SKU INTEGRITY REPORT'.      00980000
           05  FILLER                     PIC  X(37)  VALUE SPACES.     00990000
       01  REPORT-HEADING-2A.                                           00991024
           05  FILLER                     PIC  X(04)  VALUE SPACES.     00992124
           05  FILLER                     PIC  X(29)                    00993024
                                 VALUE 'XS DATA FOLLOWED BY SOR DATA'.  00994024
           05  FILLER                     PIC  X(37)  VALUE SPACES.     00995024
       01  REPORT-HEADING-3.                                            01000000
           05  FILLER                     PIC  X(02)  VALUE SPACES.     01010000
           05  FILLER                     PIC  X(11)                    01020000
                                 VALUE 'INTR_UPC_ID'.                   01030000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01040000
           05  FILLER                     PIC  X(07)                    01050000
                                 VALUE 'STYL_ID'.                       01060000
           05  FILLER                     PIC  X(02)  VALUE SPACES.     01070000
           05  FILLER                     PIC  X(07)                    01080000
                                 VALUE 'SKU_NBR'.                       01090000
           05  FILLER                     PIC  X(04)  VALUE SPACES.     01100000
           05  FILLER                     PIC  X(10)                    01110000
                                 VALUE 'SKU_DESC'.                      01120000
           05  FILLER                     PIC  X(21)  VALUE SPACES.     01130000
           05  FILLER                     PIC  X(14)                    01140000
                                 VALUE 'KOHLS_SIZE_CDE'.                01150000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01160000
           05  FILLER                     PIC  X(09)                    01170000
                                 VALUE 'SIZE_DESC'.                     01180000
           05  FILLER                     PIC  X(03)  VALUE SPACES.     01190026
           05  FILLER                     PIC  X(09)                    01230000
                                 VALUE 'WT_UM_QTY'.                     01240000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01250000
           05  FILLER                     PIC  X(11)                    01260000
                                 VALUE 'SIZE_UM_CDE'.                   01270000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01280000
           05  FILLER                     PIC  X(09)                    01290000
                                 VALUE 'HT_UM_QTY'.                     01300000
           05  FILLER                     PIC  X(04)  VALUE SPACES.     01301024
           05  FILLER                     PIC  X(14)                    01302024
                                 VALUE 'CSTM_CLOR_DESC'.                01303024
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01304024
           05  FILLER                     PIC  X(13)                    01305024
                                 VALUE 'REGN_PRIC_IND'.                 01306024
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01307024
           05  FILLER                     PIC  X(15)                    01308024
                                 VALUE 'TX_PRD_CDE_DESC'.               01309024
           05  FILLER                     PIC  X(06)  VALUE SPACES.     01309124
           05  FILLER                     PIC  X(13)                    01309224
                                 VALUE 'E_BUS_ITM_IND'.                 01309324
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01309424
       01  REPORT-HEADING-4.                                            01311000
           05  FILLER                     PIC  X(02)  VALUE SPACES.     01320000
           05  FILLER                     PIC  X(11)  VALUE ALL '-'.    01330000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01340000
           05  FILLER                     PIC  X(08)  VALUE ALL '-'.    01350000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01360000
           05  FILLER                     PIC  X(10)  VALUE ALL '-'.    01370000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01380000
           05  FILLER                     PIC  X(30)  VALUE ALL '-'.    01390000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01400000
           05  FILLER                     PIC  X(14)  VALUE ALL '-'.    01410000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01420000
           05  FILLER                     PIC  X(10)  VALUE ALL '-'.    01430000
           05  FILLER                     PIC  X(02)  VALUE SPACES.     01460026
           05  FILLER                     PIC  X(09)  VALUE ALL '-'.    01470000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01480000
           05  FILLER                     PIC  X(11)  VALUE ALL '-'.    01490000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01500000
           05  FILLER                     PIC  X(10)  VALUE ALL '-'.    01510000
           05  FILLER                     PIC  X(03)  VALUE SPACES.     01830024
           05  FILLER                     PIC  X(14)  VALUE ALL '-'.    01840021
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01850021
           05  FILLER                     PIC  X(13)  VALUE ALL '-'.    01860021
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01870021
           05  FILLER                     PIC  X(20)  VALUE ALL '-'.    01880024
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01890024
           05  FILLER                     PIC  X(13)  VALUE ALL '-'.    01900024
           05  FILLER                     PIC  X(01)  VALUE SPACES.     01910024
                                                                        02010021
091004 01  REPORT-HEADING-7.                                            02020021
           05  FILLER                     PIC  X(04)  VALUE SPACES.     02021024
           05  FILLER                     PIC  X(16)                    02021124
                                 VALUE 'E_BUS_PRD_GP_NBR'.              02021224
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02021324
           05  FILLER                     PIC  X(09)                    02021424
                                 VALUE 'WD_UM_QTY'.                     02021524
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02021624
           05  FILLER                     PIC  X(11)                    02021724
                                 VALUE 'DPTH_UM_QTY'.                   02021824
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02021924
           05  FILLER                     PIC  X(12)                    02022024
                                 VALUE 'NRF_CLOR_CDE'.                  02022124
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02022224
           05  FILLER                     PIC  X(13)                    02022324
                                 VALUE 'NRF_CLOR_DESC'.                 02023024
091004     05  FILLER                     PIC  X(01)  VALUE SPACES.     02030024
091004     05  FILLER                     PIC  X(18)                    02040021
091004                           VALUE 'CUSTFACG_CLOR_DESC'.            02050021
091004     05  FILLER                     PIC  X(05)  VALUE SPACES.     02060021
091004     05  FILLER                     PIC  X(07)                    02070021
091004                           VALUE 'POG_IND'.                       02080021
122007     05  FILLER                     PIC  X(05)  VALUE SPACES.     02081029
122007     05  FILLER                     PIC  X(06)                    02082028
122007                           VALUE 'GP_CDE'.                        02083028
                                                                        02090021
091004 01  REPORT-HEADING-8.                                            02100021
091004     05  FILLER                     PIC  X(04)  VALUE SPACES.     02110024
           05  FILLER                     PIC  X(16)  VALUE ALL '-'.    02110524
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02110624
           05  FILLER                     PIC  X(09)  VALUE ALL '-'.    02110724
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02110824
           05  FILLER                     PIC  X(11)  VALUE ALL '-'.    02110924
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02111024
           05  FILLER                     PIC  X(12)  VALUE ALL '-'.    02111124
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02111224
           05  FILLER                     PIC  X(13)  VALUE ALL '-'.    02111324
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02112024
091004     05  FILLER                     PIC  X(22)  VALUE ALL '-'.    02120021
091004     05  FILLER                     PIC  X(01)  VALUE SPACES.     02130021
091004     05  FILLER                     PIC  X(07)  VALUE ALL '-'.    02140021
091004     05  FILLER                     PIC  X(05)  VALUE SPACES.     02141029
091004     05  FILLER                     PIC  X(06)  VALUE ALL '-'.    02142029
                                                                        02150021
      ***************************************************************** 02160021
      **REPORT DETAIL                                                   02170021
      ***************************************************************** 02180021
       01  REPORT-DETAIL-1.                                             02190021
           05  FILLER                     PIC  X(03)  VALUE SPACES.     02200021
           05  RD-XS-INTRL-UPC-ID         PIC  ZZZZZZZZZ9.              02210021
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02220021
           05  RD-XS-STYL-ID              PIC  ZZZZZZZ9.                02230021
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02240021
           05  RD-XS-SKU-NBR              PIC  ZZZZZZZZZ9.              02250000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02260000
           05  RD-XS-SKU-DESC             PIC  X(30).                   02270000
           05  FILLER                     PIC  X(05)  VALUE SPACES.     02280000
           05  RD-XS-KOHLS-SIZE-CDE       PIC  ZZZZZZZZZ9.              02290000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02300000
           05  RD-XS-SIZE-DESC            PIC  X(10).                   02310000
           05  FILLER                     PIC  X(03)  VALUE SPACES.     02320026
           05  RD-XS-WT-UM-QTY            PIC  ZZZZ.999.                02350000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02360000
           05  RD-XS-SIZE-UM-CDE          PIC  X(02).                   02370000
           05  FILLER                     PIC  X(12)  VALUE SPACES.     02380024
           05  RD-XS-HT-UM-QTY            PIC  ZZZZ.999.                02390000
                                                                        02400000
           05  FILLER                     PIC  X(03)  VALUE SPACES.     02420024
           05  RD-XS-CSTM-CLOR-DESC       PIC  X(10).                   02430000
           05  FILLER                     PIC  X(05)  VALUE SPACES.     02440000
           05  RD-XS-REGN-PRIC-IND        PIC  X(01).                   02450000
           05  FILLER                     PIC  X(13)  VALUE SPACES.     02460000
           05  RD-XS-TX-PRD-CDE-DESC      PIC  X(20).                   02470000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02480000
           05  RD-XS-E-BUS-ITM-IND        PIC  X(01).                   02490000
           05  FILLER                     PIC  X(21)  VALUE SPACES.     02500000
                                                                        02580124
       01  REPORT-DETAIL-2.                                             02581024
091004     05  FILLER                     PIC  X(12)  VALUE SPACES.     02582024
           05  RD-XS-E-BUS-PRD-GRP-NBR    PIC  ZZZZZZZ9.                02583024
           05  FILLER                     PIC  X(02)  VALUE SPACES.     02584024
           05  RD-XS-WD-UM-QTY            PIC  ZZZZ.999.                02585024
           05  FILLER                     PIC  X(04)  VALUE SPACES.     02586024
           05  RD-XS-DPTH-UM-QTY          PIC  ZZZZ.999.                02587024
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02588024
           05  RD-XS-NRF-CLOR-CDE         PIC  X(03).                   02589024
           05  FILLER                     PIC  X(10)  VALUE SPACES.     02589124
           05  RD-XS-NRF-CLOR-DESC        PIC  X(10).                   02590000
091004     05  FILLER                     PIC  X(04)  VALUE SPACES.     02620023
091004     05  RD-XS-CUSTFACG-CLOR-DESC   PIC  X(22).                   02630023
091004     05  FILLER                     PIC  X(01)  VALUE SPACES.     02640023
091004     05  RD-XS-POG-IND              PIC  X(01).                   02650023
122007     05  FILLER                     PIC  X(14)  VALUE SPACES.     02651029
122007     05  RD-XS-GP-CDE               PIC  X(03).                   02652028
                                                                        02660023
       01  REPORT-DETAIL-3.                                             02670000
           05  FILLER                     PIC  X(03)  VALUE SPACES.     02680000
           05  RD-VSM-INTRL-UPC-ID        PIC  ZZZZZZZZZ9.              02690000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02700000
           05  RD-VSM-STYL-ID             PIC  ZZZZZZZ9.                02710000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02720000
           05  RD-VSM-SKU-NBR             PIC  ZZZZZZZZZ9.              02730000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02740000
           05  RD-VSM-SKU-DESC            PIC  X(30).                   02750000
           05  FILLER                     PIC  X(05)  VALUE SPACES.     02760000
           05  RD-VSM-KOHLS-SIZE-CDE      PIC  ZZZZZZZZZ9.              02770000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02780000
           05  RD-VSM-SIZE-DESC           PIC  X(10).                   02790000
           05  FILLER                     PIC  X(03)  VALUE SPACES.     02800026
           05  RD-VSM-WT-UM-QTY           PIC  ZZZZ.999.                02830000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02840000
           05  RD-VSM-SIZE-UM-CDE         PIC  X(02).                   02850000
           05  FILLER                     PIC  X(12)  VALUE SPACES.     02860024
           05  RD-VSM-HT-UM-QTY           PIC  ZZZZ.999.                02870000
                                                                        02880000
           05  FILLER                     PIC  X(03)  VALUE SPACES.     02900024
           05  RD-VSM-CSTM-CLOR-DESC      PIC  X(10).                   02910000
           05  FILLER                     PIC  X(05)  VALUE SPACES.     02920000
           05  RD-VSM-REGN-PRIC-IND       PIC  X(01).                   02930000
           05  FILLER                     PIC  X(13)  VALUE SPACES.     02940000
           05  RD-VSM-TX-PRD-CDE-DESC     PIC  X(20).                   02950000
           05  FILLER                     PIC  X(01)  VALUE SPACES.     02960000
           05  RD-VSM-E-BUS-ITM-IND       PIC  X(01).                   02970024
           05  FILLER                     PIC  X(21)  VALUE SPACES.     02980024
                                                                        03060124
       01  REPORT-DETAIL-4.                                             03061024
091004     05  FILLER                     PIC  X(12)  VALUE SPACES.     03062024
           05  RD-VSM-EBUS-PRD-GRP-NBR    PIC  ZZZZZZZ9.                03065024
           05  FILLER                     PIC  X(02)  VALUE SPACES.     03066024
           05  RD-VSM-WD-UM-QTY           PIC  ZZZZ.999.                03067024
           05  FILLER                     PIC  X(04)  VALUE SPACES.     03068024
           05  RD-VSM-DPTH-UM-QTY         PIC  ZZZZ.999.                03069024
           05  FILLER                     PIC  X(01)  VALUE SPACES.     03069124
           05  RD-VSM-NRF-CLOR-CDE        PIC  X(03).                   03069224
           05  FILLER                     PIC  X(10)  VALUE SPACES.     03069324
           05  RD-VSM-NRF-CLOR-DESC       PIC  X(10).                   03070000
091004     05  FILLER                     PIC  X(04)  VALUE SPACES.     03100021
091004     05  RD-VSM-CUSTFACG-CLOR-DESC  PIC  X(22).                   03110021
091004     05  FILLER                     PIC  X(01)  VALUE SPACES.     03120021
091004     05  RD-VSM-POG-IND             PIC  X(01).                   03130021
122007     05  FILLER                     PIC  X(14)  VALUE SPACES.     03131029
122007     05  RD-VSM-GP-CDE              PIC  X(03).                   03132028
                                                                        03140021
       01  RF-END-OF-REPORT.                                            03150000
           05  FILLER                     PIC X(57)  VALUE SPACES.      03160000
           05  FILLER                     PIC X(21)                     03170000
                                 VALUE '***END OF REPORT***'.           03180000
           05  FILLER                     PIC X(57)  VALUE SPACES.      03190000
      ***************************************************************** 03200000
      **COPYBOOKS                                                       03210000
      ***************************************************************** 03220000
      ****ABEND ROUTINE INFORMATION                                     03230000
           COPY DPWS900.                                                03240000
      ****ABEND ROUTINE INFORMATION                                     03250000
           COPY DPWS004.                                                03260021
      ***STANDARD REPORT HEADER FOR A 200 COLUMN REPORT.                03270025
           COPY DPWS200O.                                               03280024
      ***INPUT RECORD                                                   03290000
           COPY XSRD012.                                                03300000
                                                                        03310000
       PROCEDURE DIVISION.                                              03320000
      ******************************************************************03330000
       0000-MAINLINE.                                                   03340000
                                                                        03350000
           PERFORM 1000-INITIALIZATION.                                 03360000
           PERFORM 2000-PROCESS-FILES                                   03370000
                   UNTIL PS-EOF-INPUT-FILE.                             03380000
           PERFORM 9999-WRAPUP.                                         03390000
           GOBACK.                                                      03400000
                                                                        03410000
       EJECT.                                                           03420000
      ******************************************************************03430000
      *INITIALIZATION ROUTINE                                           03440000
      ******************************************************************03450000
       1000-INITIALIZATION.                                             03460000
                                                                        03470000
           OPEN INPUT   INPUT-FILE                                      03480000
                OUTPUT  REPORT-FILE.                                    03490000
                                                                        03500000
           ACCEPT DF-ACCEPT-TIME FROM TIME.                             03510000
           ACCEPT DF-ACCEPT-DATE FROM DATE.                             03520000
                                                                        03530000
           PERFORM 1100-SETUP-HEADINGS.                                 03540000
                                                                        03550000
           PERFORM 9999-READ-INPUT-FILE.                                03560000
                                                                        03570000
       EJECT.                                                           03580000
      ******************************************************************03590000
      *SETS UP ALL HEADING STATIC VARIABLES FOR THE REPORT DURATION     03600000
      ******************************************************************03610000
       1100-SETUP-HEADINGS.                                             03620000
                                                                        03630000
           MOVE '1200-SETUP-HEADINGS' TO PV-PARAGRAPH-NAME.             03640000
                                                                        03650000
           MOVE DF-ACCEPT-YR          TO DP200O-RUN-YEAR.               03660024
           MOVE DF-ACCEPT-MO          TO DP200O-RUN-MONTH.              03670024
           MOVE DF-ACCEPT-DY          TO DP200O-RUN-DAY.                03680024
           MOVE DF-ACCEPT-HR          TO DP200O-RUN-HOUR.               03690024
           MOVE DF-ACCEPT-MIN         TO DP200O-RUN-MINUTE.             03700024
                                                                        03710000
           MOVE PC-PROGRAM-NAME  TO DP200O-PROGRAM-NAME.                03720024
           MOVE 1                TO DP200O-REPORT-NUMBER.               03730024
                                                                        03740000
           PERFORM 4000-PRINT-HEADINGS.                                 03750000
                                                                        03760000
       EJECT.                                                           03770000
      ******************************************************************03780000
      *PROCESS BOTH FILES                                               03790000
      ******************************************************************03800000
       2000-PROCESS-FILES.                                              03810000
                                                                        03820000
           MOVE '2000-PROCESS-FILES' TO PV-PARAGRAPH-NAME.              03830000
                                                                        03840000
           PERFORM 4100-PRINT-DETAIL.                                   03850000
                                                                        03860000
           IF  PC-LINE-COUNT > 60                                       03870000
               PERFORM 4000-PRINT-HEADINGS                              03880000
           END-IF.                                                      03890000
                                                                        03900000
           PERFORM 9999-READ-INPUT-FILE.                                03910000
                                                                        03920000
       EJECT.                                                           03930000
      ******************************************************************03940000
      *PRINTS REPORT HEADINGS AT TOP OF PAGE                            03950000
      ******************************************************************03960000
       4000-PRINT-HEADINGS.                                             03970000
                                                                        03980000
           MOVE '4000-PRINT-HEADINGS' TO PV-PARAGRAPH-NAME.             03990000
                                                                        04000000
           INITIALIZE PC-LINE-COUNT.                                    04010000
           ADD +1                     TO PC-PAGE-COUNT.                 04020000
           MOVE PC-PAGE-COUNT         TO DP200O-PAGE-NUMBER.            04030024
                                                                        04040000
           WRITE REPORT-RECORD FROM DP200O-STANDRD-HEADER-200-COLS      04050024
                                                  AFTER ADVANCING PAGE. 04060000
           WRITE REPORT-RECORD FROM REPORT-HEADING-1                    04070000
                                               AFTER ADVANCING 2 LINES. 04080000
           WRITE REPORT-RECORD FROM REPORT-HEADING-2                    04090000
                                               AFTER ADVANCING 1 LINES. 04100000
           WRITE REPORT-RECORD FROM REPORT-HEADING-2A                   04101024
                                               AFTER ADVANCING 2 LINES. 04102024
           WRITE REPORT-RECORD FROM REPORT-HEADING-3                    04110000
                                               AFTER ADVANCING 1 LINES. 04120024
           WRITE REPORT-RECORD FROM REPORT-HEADING-4                    04130000
                                               AFTER ADVANCING 1 LINES. 04140000
091004     WRITE REPORT-RECORD FROM REPORT-HEADING-7                    04190021
091004                                         AFTER ADVANCING 1 LINES. 04200021
091004     WRITE REPORT-RECORD FROM REPORT-HEADING-8                    04210021
091004                                         AFTER ADVANCING 1 LINES. 04220021
091004     ADD +09                    TO PC-LINE-COUNT.                 04230024
                                                                        04240000
       EJECT.                                                           04250000
      ******************************************************************04260000
      *PRINTS DETAIL REPORT                                             04270000
      ******************************************************************04280000
       4100-PRINT-DETAIL.                                               04290000
                                                                        04300000
           MOVE '4100-PRINT-DETAIL' TO PV-PARAGRAPH-NAME.               04310000
                                                                        04320000
           MOVE XSRD012-XS-INTRL-UPC-ID TO RD-XS-INTRL-UPC-ID.          04330021
           MOVE XSRD012-XS-STYL-ID TO RD-XS-STYL-ID.                    04340021
           MOVE XSRD012-XS-SKU-NBR TO RD-XS-SKU-NBR.                    04350021
           MOVE XSRD012-XS-SKU-DESC TO RD-XS-SKU-DESC.                  04360021
           MOVE XSRD012-XS-KOHLS-SIZE-CDE TO RD-XS-KOHLS-SIZE-CDE.      04370021
           MOVE XSRD012-XS-SIZE-DESC TO RD-XS-SIZE-DESC.                04380021
           MOVE XSRD012-XS-CSTM-CLOR-DESC TO RD-XS-CSTM-CLOR-DESC.      04390021
           MOVE XSRD012-XS-REGN-PRIC-IND TO RD-XS-REGN-PRIC-IND.        04400021
           MOVE XSRD012-XS-TX-PRD-CDE-DESC TO RD-XS-TX-PRD-CDE-DESC.    04410021
           MOVE XSRD012-XS-E-BUS-ITM-IND TO RD-XS-E-BUS-ITM-IND.        04420021
           MOVE XSRD012-XS-E-BUS-PRD-GRP-NBR TO RD-XS-E-BUS-PRD-GRP-NBR.04430021
112006*    MOVE XSRD012-XS-WT-UM-CDE TO RD-XS-WT-UM-CDE.                04440026
           MOVE XSRD012-XS-WT-UM-QTY TO RD-XS-WT-UM-QTY.                04450021
           MOVE XSRD012-XS-SIZE-UM-CDE TO RD-XS-SIZE-UM-CDE.            04460021
           MOVE XSRD012-XS-NRF-CLOR-CDE TO RD-XS-NRF-CLOR-CDE.          04470021
           MOVE XSRD012-XS-NRF-CLOR-DESC TO RD-XS-NRF-CLOR-DESC.        04480021
           MOVE XSRD012-XS-WD-UM-QTY TO RD-XS-WD-UM-QTY.                04490021
           MOVE XSRD012-XS-HT-UM-QTY TO RD-XS-HT-UM-QTY.                04500021
           MOVE XSRD012-XS-DPTH-UM-QTY TO RD-XS-DPTH-UM-QTY.            04510021
091004     MOVE XSRD012-XS-CUSTFACG-CLOR-DESC                           04520021
091004                                 TO RD-XS-CUSTFACG-CLOR-DESC.     04530021
091004     MOVE XSRD012-XS-POG-IND     TO RD-XS-POG-IND.                04540021
122007     MOVE XSRD012-XS-GP-CDE      TO RD-XS-GP-CDE.                 04541028
                                                                        04550000
           MOVE XSRD012-VSM-INTRL-UPC-ID TO RD-VSM-INTRL-UPC-ID.        04560021
           MOVE XSRD012-VSM-STYL-ID TO RD-VSM-STYL-ID.                  04570021
           MOVE XSRD012-VSM-SKU-NBR TO RD-VSM-SKU-NBR.                  04580021
           MOVE XSRD012-VSM-SKU-DESC TO RD-VSM-SKU-DESC.                04590021
           MOVE XSRD012-VSM-KOHLS-SIZE-CDE TO RD-VSM-KOHLS-SIZE-CDE.    04600021
           MOVE XSRD012-VSM-SIZE-DESC TO RD-VSM-SIZE-DESC.              04610021
           MOVE XSRD012-VSM-CSTM-CLOR-DESC TO RD-VSM-CSTM-CLOR-DESC.    04620021
           MOVE XSRD012-VSM-REGN-PRIC-IND TO RD-VSM-REGN-PRIC-IND.      04630021
           MOVE XSRD012-VSM-TX-PRD-CDE-DESC TO RD-VSM-TX-PRD-CDE-DESC.  04640021
           MOVE XSRD012-VSM-E-BUS-ITM-IND TO RD-VSM-E-BUS-ITM-IND.      04650021
           MOVE XSRD012-VSM-E-BUS-PRD-GRP-NBR                           04660021
                                          TO RD-VSM-EBUS-PRD-GRP-NBR.   04670021
112006*    MOVE XSRD012-VSM-WT-UM-CDE TO RD-VSM-WT-UM-CDE.              04680026
           MOVE XSRD012-VSM-WT-UM-QTY TO RD-VSM-WT-UM-QTY.              04690021
           MOVE XSRD012-VSM-SIZE-UM-CDE TO RD-VSM-SIZE-UM-CDE.          04700021
           MOVE XSRD012-VSM-NRF-CLOR-CDE TO RD-VSM-NRF-CLOR-CDE.        04710021
           MOVE XSRD012-VSM-NRF-CLOR-DESC TO RD-VSM-NRF-CLOR-DESC.      04720021
           MOVE XSRD012-VSM-WD-UM-QTY TO RD-VSM-WD-UM-QTY.              04730021
           MOVE XSRD012-VSM-HT-UM-QTY TO RD-VSM-HT-UM-QTY.              04740021
           MOVE XSRD012-VSM-DPTH-UM-QTY TO RD-VSM-DPTH-UM-QTY.          04750021
091004     MOVE XSRD012-VSM-CUSTFACG-CLOR-DESC                          04760022
091004                                  TO RD-VSM-CUSTFACG-CLOR-DESC.   04770021
091004     MOVE XSRD012-VSM-POG-IND     TO RD-VSM-POG-IND.              04780021
122007     MOVE XSRD012-VSM-GP-CDE      TO RD-VSM-GP-CDE.               04781028
                                                                        04790000
           WRITE REPORT-RECORD FROM REPORT-DETAIL-1                     04800000
                                            AFTER ADVANCING 2 LINES.    04810000
           WRITE REPORT-RECORD FROM REPORT-DETAIL-2                     04820000
                                            AFTER ADVANCING 1 LINES.    04830000
           WRITE REPORT-RECORD FROM REPORT-DETAIL-3                     04860000
                                            AFTER ADVANCING 1 LINES.    04870000
           WRITE REPORT-RECORD FROM REPORT-DETAIL-4                     04880000
                                            AFTER ADVANCING 1 LINES.    04890000
                                                                        04920000
           ADD +5                   TO PC-LINE-COUNT.                   04930024
                                                                        04940000
       EJECT.                                                           04950000
      ******************************************************************04960000
      *READS INPUT FILE                                                 04970000
      ******************************************************************04980000
       9999-READ-INPUT-FILE.                                            04990000
                                                                        05000000
           READ INPUT-FILE INTO XSRD012-SKU-ERR-RECORD                  05010000
               AT END SET PS-EOF-INPUT-FILE TO TRUE                     05020000
           END-READ.                                                    05030000
                                                                        05040000
           ADD +1  TO PC-RECORDS-READ.                                  05050000
                                                                        05060000
       EJECT.                                                           05070000
      ******************************************************************05080000
      *PROGRAM END PROCESSING                                           05090000
      ******************************************************************05100000
       9999-WRAPUP.                                                     05110000
                                                                        05120000
           WRITE REPORT-RECORD FROM RF-END-OF-REPORT                    05130000
                                    AFTER ADVANCING 2 LINES.            05140000
                                                                        05150000
           CLOSE INPUT-FILE                                             05160000
                 REPORT-FILE.                                           05170000
                                                                        05180000
           DISPLAY '*************************************************'. 05190000
           DISPLAY '* PROGRAM..................: ' PC-PROGRAM-NAME.     05200000
           DISPLAY '* RUN DATE.................: ' DF-ACCEPT-DATE.      05210000
           DISPLAY '* RUN TIME.................: ' DF-ACCEPT-TIME.      05220000
           DISPLAY '*--------- COUNTS FOR THIS RUN ---------'.          05230000
           DISPLAY '* RECORDS READ........: ' PC-RECORDS-READ.          05240000
           DISPLAY '*************************************************'. 05250000
                                                                        05260000
       EJECT.                                                           05270000
                                                                        05280000
       EJECT.                                                           05290000
