000200 IDENTIFICATION DIVISION.                                         00010000
000300 PROGRAM-ID.         XSKRP004.                                    00020000
000400 AUTHOR.             JIM LEIKNESS.                                00030000
000500 INSTALLATION.       KOHLS DEPARTMENT STORES.                     00040000
000600 DATE-WRITTEN.       12-27-2002.                                  00050000
000700 DATE-COMPILED.                                                   00060000
000800*                                                                 00070000
000900******************************************************************00080000
001000*  COMPARES DATA FROM DOMAIN TABLES AND SYSTEM OF RECORD TABLES   00090000
001100*  FOR THE XST_REGN AND XST_REGN_TERR TABLES                      00100000
001200******************************************************************00110000
001300                                                                  00120000
001400 ENVIRONMENT DIVISION.                                            00130000
001500                                                                  00140000
001600 CONFIGURATION SECTION.                                           00150000
001700                                                                  00160000
001800 SOURCE-COMPUTER.    IBM-3090.                                    00170000
001900 OBJECT-COMPUTER.    IBM-3090.                                    00180000
002000                                                                  00190000
002100 INPUT-OUTPUT SECTION.                                            00200000
002200                                                                  00210000
002300 FILE-CONTROL.                                                    00220000
002400                                                                  00230000
002500     SELECT XST-INPUT-FILE       ASSIGN TO INP01.                 00240000
002600     SELECT RMS-INPUT-FILE       ASSIGN TO INP02.                 00250000
002700     SELECT ERROR-REPORT         ASSIGN TO RPT01.                 00260000
002800                                                                  00270000
002900 DATA DIVISION.                                                   00280000
003000                                                                  00290000
003100 FILE SECTION.                                                    00300000
003200                                                                  00310000
003300 FD  RMS-INPUT-FILE                                               00320000
003400     RECORDING MODE IS F                                          00330000
003500     BLOCK CONTAINS 0 RECORDS                                     00340000
003600     LABEL RECORDS ARE OMITTED.                                   00350000
003700 01  RMS-INPUT-RECORD                    PIC  X(62).              00360000
003800                                                                  00370000
003900 FD  XST-INPUT-FILE                                               00380000
004000     RECORDING MODE IS F                                          00390000
004100     BLOCK CONTAINS 0 RECORDS                                     00400000
004200     LABEL RECORDS ARE OMITTED.                                   00410000
004300 01  XST-INPUT-RECORD                    PIC  X(62).              00420000
004400                                                                  00430000
004500 FD  ERROR-REPORT                                                 00440000
004600     RECORDING MODE IS F                                          00450000
004700     BLOCK CONTAINS 0 RECORDS                                     00460000
004800     LABEL RECORDS ARE OMITTED.                                   00470000
004900 01  ERR-RPT-LINE                        PIC  X(200).             00480000
005000                                                                  00490000
005100 WORKING-STORAGE SECTION.                                         00500000
005200                                                                  00510000
005300     COPY HORD007.                                                00520000
005400                                                                  00530000
005500     COPY DPWS200O.                                               00540000
005600                                                                  00550000
005700 01 XST-REC.                                                      00560000
005800     05 XST-REGN-NBR          PIC 9(04).                          00570000
005801     05 FILLER                PIC X(01) VALUE SPACE.              00580000
005810     05 XST-REGN-TERR-NBR     PIC 9(04).                          00581000
005820     05 FILLER                PIC X(01) VALUE SPACE.              00582000
005900     05 XST-REGN-NM           PIC X(20) VALUE SPACE.              00583000
006000     05 XST-REGN-MGR-NM       PIC X(32) VALUE SPACE.              00584000
006100                                                                  00585000
006200 01 PC-PROGRAM-CONSTANTS.                                         00586000
006300     05 PC-PGM-NAME           PIC X(08)  VALUE 'XSKRP004'.        00587000
006400                                                                  00588000
006500 01 PV-PROGRAM-VARIABLES.                                         00589000
006600     05 PV-XST-KEY.                                               00590000
006700        10 PV-XST-REGN-NBR       PIC 9(04).                       00600000
006710     05 PV-XST-REGN-TERR-NBR     PIC 9(04).                       00610000
006800     05 PV-XST-REGN-NM           PIC X(20) VALUE SPACE.           00620000
006900     05 PV-XST-REGN-MGR-NM       PIC X(32) VALUE SPACE.           00630000
007000                                                                  00640000
007100     05 PV-RMS-KEY.                                               00650000
007200         10 PV-RMS-REGN-NBR       PIC 9(04).                      00660000
007210     05 PV-RMS-REGN-TERR-NBR      PIC 9(04).                      00670000
007300     05 PV-RMS-REGN-NM            PIC X(20) VALUE SPACE.          00680000
007400     05 PV-RMS-REGN-MGR-NM        PIC X(32) VALUE SPACE.          00690000
007500                                                                  00700000
007600     05 PV-PAGE-CNT               PIC S9(05)  VALUE ZERO.         00710000
007700     05 PV-LINE-CNT               PIC S9(04)  COMP VALUE ZERO.    00720000
007800     05 PV-MAX-LINES              PIC S9(04)  COMP VALUE +71.     00730000
007900                                                                  00740000
008000     05 PV-DISPLAY-CNT            PIC ZZZZ9.                      00750000
008100     05 PV-NBR-ERRORS             PIC S9(04)  COMP                00760000
008200                                                VALUE ZERO.       00770000
008300     05 PV-DATE-YYMMDD.                                           00780000
008400          10 PV-YYMMDD-YY       PIC X(02)  VALUE SPACE.           00790000
008500          10 PV-YYMMDD-MM       PIC X(02)  VALUE SPACE.           00800000
008600          10 PV-YYMMDD-DD       PIC X(02)  VALUE SPACE.           00810000
008700     05 PV-TIME-HHMMSS.                                           00820000
008800          10 PV-HHMMSS-HH       PIC X(02)  VALUE SPACE.           00830000
008900          10 PV-HHMMSS-MM       PIC X(02)  VALUE SPACE.           00840000
009000          10 PV-HHMMSS-SS       PIC X(02)  VALUE SPACE.           00850000
009100     05 PV-MESSAGE              PIC X(58)  VALUE SPACE.           00860000
009200                                                                  00870000
009300 01 RPT-TOTAL-LINE.                                               00880000
009400     05 FILLER     PIC  X(23) VALUE                               00890000
009500                         'TOTAL NUMBER OF ERRORS '.               00900000
009600     05 RPT-NBR-ERRORS PIC ZZZZZZ9.                               00910000
009700                                                                  00920000
009800 01 RPT-END-OF-REPORT-LINE.                                       00930000
009900     05 FILLER     PIC  X(21) VALUE                               00940000
010000                            '*** END OF REPORT ***'.              00950000
010100 01 PA-PROGRAM-ACCUMULATORS.                                      00960000
010200     05 PA-ERROR-MESSAGES      PIC 9(13) VALUE ZERO.              00970000
010300     05 PA-XST-RECS-READ       PIC 9(13) VALUE ZERO.              00980000
010400     05 PA-RMS-RECS-READ       PIC 9(13) VALUE ZERO.              00990000
010500                                                                  01000000
010600 01 PS-PROGRAM-SWITCHES.                                          01010000
010700     05 PS-MORE-RMS-INPUT-RECS-SW PIC X(01)  VALUE 'Y'.           01020000
010800         88 PS-MORE-RMS-INPUT-RECS           VALUE 'Y'.           01030000
010900         88 PS-END-OF-RMS-INPUT-RECS         VALUE 'N'.           01040000
011000     05 PS-MORE-XST-INPUT-RECS-SW PIC X(01)  VALUE 'Y'.           01050000
011100         88 PS-MORE-XST-INPUT-RECS           VALUE 'Y'.           01060000
011200         88 PS-END-OF-XST-INPUT-RECS         VALUE 'N'.           01070000
011300     05 PS-RMS-OR-XST-ERR        PIC X(01)   VALUE '0'.           01080000
011400         88 PS-RMS-ERROR                     VALUE '1'.           01090000
011500         88 PS-XST-ERROR                     VALUE '2'.           01100000
011600         88 PS-DATA-ERROR                    VALUE '3'.           01110000
011700                                                                  01120000
011800 01 RPT-REPORT-HEADING.                                           01130000
011900     05 FILLER     PIC  X(86)    VALUE SPACES.                    01140000
012000     05 FILLER     PIC  X(37)    VALUE                            01150000
012100         'XS REGION DATA INTEGRITY ERRORS'.                       01160000
012200                                                                  01170000
012300 01 RPT-COL-HEADING-1.                                            01180000
012400     05 FILLER     PIC  X(01) VALUE SPACE.                        01190000
012500     05 FILLER     PIC  X(01) VALUE ALL '-'.                      01200000
012600     05 FILLER     PIC  X(03) VALUE 'KEY'.                        01210000
012700     05 FILLER     PIC  X(01) VALUE ALL '-'.                      01220000
012800                                                                  01230000
012900 01 RPT-COL-HEADING-2.                                            01240000
013200     05 FILLER     PIC  X(23) VALUE SPACE.                        01250000
013300     05 FILLER     PIC  X(34) VALUE 'XSDOMAIN'.                   01260000
013400     05 FILLER     PIC  X(24) VALUE SPACE.                        01270000
013500     05 FILLER     PIC  X(41) VALUE 'SYSTEM OF RECORD'.           01280000
013800                                                                  01290000
013900 01 RPT-COL-HEADING-3.                                            01300000
014000     05 FILLER     PIC  X(01) VALUE SPACE.                        01310000
014010     05 FILLER     PIC  X(04) VALUE 'REGN'.                       01320000
014020     05 FILLER     PIC  X(04) VALUE SPACE.                        01330000
014100     05 FILLER     PIC  X(04) VALUE 'TERR'.                       01340000
014200     05 FILLER     PIC  X(02) VALUE SPACE.                        01350000
014210     05 FILLER     PIC  X(04) VALUE 'REGN'.                       01360000
014220     05 FILLER     PIC  X(18) VALUE SPACE.                        01370000
014300     05 FILLER     PIC  X(04) VALUE 'REGN'.                       01380000
014400     05 FILLER     PIC  X(30) VALUE SPACE.                        01390000
014500     05 FILLER     PIC  X(04) VALUE 'TERR'.                       01400000
014600     05 FILLER     PIC  X(02) VALUE SPACE.                        01410000
014610     05 FILLER     PIC  X(04) VALUE 'REGN'.                       01420000
014620     05 FILLER     PIC  X(18) VALUE SPACE.                        01430000
014700     05 FILLER     PIC  X(04) VALUE 'REGN'.                       01440000
014800                                                                  01450000
014900 01 RPT-COL-HEADING-4.                                            01460000
015010     05 FILLER     PIC  X(01) VALUE SPACE.                        01470000
015020     05 FILLER     PIC  X(04) VALUE '_NBR'.                       01480000
015030     05 FILLER     PIC  X(04) VALUE SPACE.                        01490000
015040     05 FILLER     PIC  X(04) VALUE '_NBR'.                       01500000
015050     05 FILLER     PIC  X(02) VALUE SPACE.                        01501000
015060     05 FILLER     PIC  X(03) VALUE '_NM'.                        01502000
015070     05 FILLER     PIC  X(19) VALUE SPACE.                        01503000
015080     05 FILLER     PIC  X(07) VALUE '_MGR_NM'.                    01504000
015090     05 FILLER     PIC  X(27) VALUE SPACE.                        01505000
015091     05 FILLER     PIC  X(04) VALUE '_NBR'.                       01506000
015092     05 FILLER     PIC  X(02) VALUE SPACE.                        01507000
015093     05 FILLER     PIC  X(03) VALUE '_NM'.                        01508000
015094     05 FILLER     PIC  X(19) VALUE SPACE.                        01509000
015095     05 FILLER     PIC  X(07) VALUE '_MGR_NM'.                    01509100
015096     05 FILLER     PIC  X(27) VALUE SPACE.                        01509200
015097     05 FILLER     PIC  X(07) VALUE 'MESSAGE'.                    01509300
015100                                                                  01509400
015110 01 RPT-COL-HEADING-5.                                            01509500
015120     05 FILLER     PIC  X(175) VALUE ALL '-'.                     01509600
015130                                                                  01509700
015200 01 DL-DETAIL-LINE.                                               01509800
015300     05 FILLER                PIC  X(01) VALUE SPACE.             01509900
015400     05 DL-REGN-NBR           PIC  X(04) VALUE SPACE.             01510000
015500     05 FILLER                PIC  X(04) VALUE SPACE.             01520000
015510     05 DL-XST-REGN-TERR-NBR  PIC  X(04) VALUE SPACE.             01530000
015520     05 FILLER                PIC  X(02) VALUE SPACE.             01540000
015600     05 DL-XST-REGN-NM        PIC  X(20) VALUE SPACE.             01550000
015700     05 FILLER                PIC  X(02) VALUE SPACE.             01560000
015800     05 DL-XST-REGN-MGR-NM    PIC  X(32) VALUE SPACE.             01570000
015900     05 FILLER                PIC  X(02) VALUE SPACE.             01580000
015910     05 DL-RMS-REGN-TERR-NBR  PIC  X(04) VALUE SPACE.             01590000
015920     05 FILLER                PIC  X(02) VALUE SPACE.             01591000
016000     05 DL-RMS-REGN-NM        PIC  X(20) VALUE SPACE.             01592000
016100     05 FILLER                PIC  X(02) VALUE SPACE.             01593000
016200     05 DL-RMS-REGN-MGR-NM    PIC  X(32) VALUE SPACE.             01594000
016300     05 FILLER                PIC  X(02) VALUE SPACE.             01595000
016400     05 DL-MESSAGE            PIC  X(53) VALUE SPACE.             01596000
016500                                                                  01597000
016600 PROCEDURE DIVISION.                                              01598000
016700                                                                  01599000
016800 0000-MAIN-MODULE.                                                01600000
016900                                                                  01610000
017000       OPEN INPUT RMS-INPUT-FILE                                  01620000
017100                  XST-INPUT-FILE                                  01630000
017200            OUTPUT ERROR-REPORT.                                  01640000
017300                                                                  01650000
017400       PERFORM 1000-INITIALIZE.                                   01660000
017500       PERFORM 7000-READ-XST-INPUT-FILE.                          01670000
017600       PERFORM 7100-READ-RMS-INPUT-FILE.                          01680000
017700                                                                  01690000
017800       PERFORM 2000-PROCESS-RECS                                  01700000
017900          UNTIL (PS-END-OF-XST-INPUT-RECS                         01710000
018000            AND PS-END-OF-RMS-INPUT-RECS).                        01720000
018100                                                                  01730000
018200       PERFORM 8400-WRITE-TOTALS.                                 01740000
018300                                                                  01750000
018400       CLOSE RMS-INPUT-FILE                                       01760000
018500             XST-INPUT-FILE                                       01770000
018600             ERROR-REPORT.                                        01780000
018700                                                                  01790000
018800       DISPLAY '**** XSKRP004 STATISTICS ****'                    01800000
018900       DISPLAY 'TOTAL ERROR MESSAGES   : ' PA-ERROR-MESSAGES.     01810000
019000       DISPLAY 'TOTAL XST RECORDS READ : ' PA-XST-RECS-READ.      01820000
019100       DISPLAY 'TOTAL RMS RECORDS READ : ' PA-RMS-RECS-READ.      01830000
019200       DISPLAY ' '                                                01840000
019300                                                                  01850000
019400       STOP RUN.                                                  01860000
019500                                                                  01870000
019600 1000-INITIALIZE.                                                 01880000
019700                                                                  01890000
019800       ACCEPT PV-DATE-YYMMDD FROM DATE.                           01900000
019900       MOVE PV-YYMMDD-YY TO DP200O-RUN-YEAR.                      01910000
020000       MOVE PV-YYMMDD-MM TO DP200O-RUN-MONTH.                     01920000
020100       MOVE PV-YYMMDD-DD TO DP200O-RUN-DAY.                       01930000
020200                                                                  01940000
020300       ACCEPT PV-TIME-HHMMSS FROM TIME.                           01950000
020400       MOVE PV-HHMMSS-HH TO DP200O-RUN-HOUR.                      01960000
020500       MOVE PV-HHMMSS-MM TO DP200O-RUN-MINUTE.                    01970000
020600       MOVE PC-PGM-NAME TO DP200O-PROGRAM-NAME.                   01980000
020700       MOVE 1        TO DP200O-REPORT-NUMBER.                     01990000
020800                                                                  02000000
020900       PERFORM 8100-WRITE-STD-RPT-HEADING.                        02010000
021000       PERFORM 8200-WRITE-REPORT-HEADING.                         02020000
021100       PERFORM 8300-WRITE-COLUMN-HEADING.                         02030000
021200                                                                  02040000
021300 2000-PROCESS-RECS.                                               02050000
021400                                                                  02060000
021500       MOVE HO007-REGN-NBR      TO  PV-RMS-REGN-NBR.              02070000
021510       MOVE HO007-REGN-TERR-NBR TO  PV-RMS-REGN-TERR-NBR.         02080000
021600       MOVE HO007-REGN-NM       TO  PV-RMS-REGN-NM.               02090000
021700       MOVE HO007-REGN-MGR-NM   TO  PV-RMS-REGN-MGR-NM.           02100000
021800                                                                  02110000
021900       MOVE XST-REGN-NBR        TO  PV-XST-REGN-NBR.              02120000
021910       MOVE XST-REGN-TERR-NBR   TO  PV-XST-REGN-TERR-NBR.         02130000
022000       MOVE XST-REGN-NM         TO  PV-XST-REGN-NM.               02140000
022100       MOVE XST-REGN-MGR-NM     TO  PV-XST-REGN-MGR-NM.           02150000
022200                                                                  02160000
022300     IF PV-XST-KEY = PV-RMS-KEY                                   02170000
022400*----- KEYS ON BOTH RMS AND XST, CONTINUE PROCESSING              02180000
022500        PERFORM 3000-COMPARE-FIELDS                               02190000
022600        PERFORM 7000-READ-XST-INPUT-FILE                          02200000
022700        PERFORM 7100-READ-RMS-INPUT-FILE                          02210000
022800      ELSE                                                        02220000
022900          IF ((PV-RMS-KEY < PV-XST-KEY)                           02230000
023000             OR PS-END-OF-XST-INPUT-RECS) AND                     02240000
023100             PS-MORE-RMS-INPUT-RECS                               02250000
023200             MOVE '1' TO PS-RMS-OR-XST-ERR                        02260000
023300             MOVE 'KEY ON SYSTEM OF RECORD TABLES ONLY'           02270000
023400                 TO PV-MESSAGE                                    02280000
023500             PERFORM 8000-WRITE-OUTPUT-REC                        02290000
023600             PERFORM 7100-READ-RMS-INPUT-FILE                     02300000
023700          ELSE                                                    02310000
023800              IF (PV-RMS-KEY > PV-XST-KEY                         02320000
023900                   OR PS-END-OF-RMS-INPUT-RECS)                   02330000
024000                  AND PS-MORE-XST-INPUT-RECS                      02340000
024100                  MOVE '2' TO PS-RMS-OR-XST-ERR                   02350000
024200                  MOVE 'KEY ON XS DOMAIN TABLES ONLY'             02360000
024210                                                   TO PV-MESSAGE  02370000
024300                  PERFORM 8000-WRITE-OUTPUT-REC                   02380000
024400                  PERFORM 7000-READ-XST-INPUT-FILE                02390000
024500              END-IF                                              02400000
024600          END-IF                                                  02410000
024700      END-IF.                                                     02420000
024800                                                                  02430000
024900 3000-COMPARE-FIELDS.                                             02440000
025000                                                                  02450000
025100      EVALUATE TRUE                                               02460000
025200         WHEN PV-RMS-REGN-TERR-NBR NOT = PV-XST-REGN-TERR-NBR     02470000
025300             MOVE '3' TO PS-RMS-OR-XST-ERR                        02480000
025400             MOVE 'REGION TERRITORY NUMBER DOES NOT MATCH'        02490000
025500                                                TO PV-MESSAGE     02500000
025501             PERFORM 8000-WRITE-OUTPUT-REC                        02510000
025510         WHEN PV-RMS-REGN-NM  NOT = PV-XST-REGN-NM                02520000
025520             MOVE '3' TO PS-RMS-OR-XST-ERR                        02530000
025530             MOVE 'REGION NAME DATA DOES NOT MATCH'               02540000
025540                                                TO PV-MESSAGE     02550000
025600             PERFORM 8000-WRITE-OUTPUT-REC                        02560000
025700         WHEN PV-RMS-REGN-MGR-NM  NOT = PV-XST-REGN-MGR-NM        02570000
025800             MOVE '3' TO PS-RMS-OR-XST-ERR                        02580000
025900             MOVE 'REGION MANAGER NAME DOES NOT MATCH'            02590000
026000                                                TO PV-MESSAGE     02600000
026100             PERFORM 8000-WRITE-OUTPUT-REC                        02610000
026200      END-EVALUATE.                                               02620000
026300                                                                  02630000
026400 7000-READ-XST-INPUT-FILE.                                        02640000
026500                                                                  02650000
026600       INITIALIZE XST-REC.                                        02660000
026700                                                                  02670000
026800       READ XST-INPUT-FILE INTO XST-REC                           02680000
026900           AT END SET PS-END-OF-XST-INPUT-RECS TO TRUE.           02690000
027000                                                                  02700000
027100       ADD 1 TO PA-XST-RECS-READ.                                 02710000
027200                                                                  02720000
027300 7100-READ-RMS-INPUT-FILE.                                        02730000
027400                                                                  02740000
027500       INITIALIZE HO007-REGION-DATA.                              02750000
027600                                                                  02760000
027700       READ RMS-INPUT-FILE INTO HO007-REGION-DATA                 02770000
027800            AT END SET PS-END-OF-RMS-INPUT-RECS TO TRUE.          02780000
027900                                                                  02790000
028000       ADD 1 TO PA-RMS-RECS-READ.                                 02800000
028100                                                                  02810000
028200 8000-WRITE-OUTPUT-REC.                                           02820000
028300                                                                  02830000
028400                                                                  02840000
028500       IF PS-RMS-ERROR                                            02850000
028600          MOVE SPACES TO DL-DETAIL-LINE                           02860000
028700          MOVE PV-RMS-REGN-NBR      TO DL-REGN-NBR                02870000
028710          MOVE PV-RMS-REGN-TERR-NBR TO DL-RMS-REGN-TERR-NBR       02871000
028800          MOVE PV-RMS-REGN-NM       TO DL-RMS-REGN-NM             02872000
028900          MOVE PV-RMS-REGN-MGR-NM   TO DL-RMS-REGN-MGR-NM         02873000
029000          MOVE PV-MESSAGE TO DL-MESSAGE                           02874000
029100       ELSE                                                       02875000
029200          IF PS-XST-ERROR                                         02876000
029300             MOVE SPACES TO DL-DETAIL-LINE                        02877000
029400             MOVE PV-XST-REGN-NBR      TO DL-REGN-NBR             02878000
029410             MOVE PV-XST-REGN-TERR-NBR TO DL-XST-REGN-TERR-NBR    02879000
029500             MOVE PV-XST-REGN-NM       TO DL-XST-REGN-NM          02880000
029600             MOVE PV-XST-REGN-MGR-NM   TO DL-XST-REGN-MGR-NM      02890000
029700             MOVE PV-MESSAGE TO DL-MESSAGE                        02900000
029800          ELSE                                                    02910000
029900             MOVE SPACES TO DL-DETAIL-LINE                        02920000
030000             MOVE PV-RMS-REGN-NBR      TO DL-REGN-NBR             02930000
030010             MOVE PV-RMS-REGN-TERR-NBR TO DL-RMS-REGN-TERR-NBR    02940000
030100             MOVE PV-RMS-REGN-NM       TO DL-RMS-REGN-NM          02950000
030200             MOVE PV-RMS-REGN-MGR-NM   TO DL-RMS-REGN-MGR-NM      02960000
030210             MOVE PV-XST-REGN-TERR-NBR TO DL-XST-REGN-TERR-NBR    02970000
030300             MOVE PV-XST-REGN-NM       TO DL-XST-REGN-NM          02980000
030400             MOVE PV-XST-REGN-MGR-NM   TO DL-XST-REGN-MGR-NM      02990000
030500             MOVE PV-MESSAGE TO DL-MESSAGE                        03000000
030600          END-IF                                                  03010000
030700       END-IF.                                                    03020000
030800                                                                  03030000
030900       IF PV-LINE-CNT > PV-MAX-LINES                              03040000
031000          PERFORM 8100-WRITE-STD-RPT-HEADING                      03050000
031100          PERFORM 8200-WRITE-REPORT-HEADING                       03060000
031200          PERFORM 8300-WRITE-COLUMN-HEADING                       03070000
031300       END-IF.                                                    03080000
031400                                                                  03090000
031500       WRITE ERR-RPT-LINE FROM DL-DETAIL-LINE                     03100000
031600             AFTER ADVANCING 1 LINE.                              03110000
031700       ADD +1 TO PV-LINE-CNT.                                     03120000
031800                                                                  03130000
031810       MOVE 4095 TO RETURN-CODE.                                  03140000
031900       ADD 1 TO PA-ERROR-MESSAGES.                                03150000
032000                                                                  03160000
032100 8100-WRITE-STD-RPT-HEADING.                                      03170000
032200                                                                  03180000
032300       ADD 1  TO PV-PAGE-CNT.                                     03190000
032400       MOVE PV-PAGE-CNT TO DP200O-PAGE-NUMBER.                    03200000
032500       WRITE ERR-RPT-LINE FROM DP200O-STANDRD-HEADER-200-COLS     03210000
032600             AFTER ADVANCING PAGE.                                03220000
032700       MOVE +1 TO PV-LINE-CNT.                                    03230000
032800                                                                  03240000
032900 8200-WRITE-REPORT-HEADING.                                       03250000
033000                                                                  03260000
033100       WRITE ERR-RPT-LINE FROM RPT-REPORT-HEADING                 03270000
033200            AFTER ADVANCING 1 LINES.                              03280000
033300       ADD +1 TO PV-LINE-CNT.                                     03290000
033400                                                                  03300000
033500 8300-WRITE-COLUMN-HEADING.                                       03310000
033600                                                                  03320000
033700       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-1                  03330000
033800            AFTER ADVANCING 2 LINES.                              03340000
033900       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-2                  03350000
034000            AFTER ADVANCING 1 LINES.                              03360000
034100       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-3                  03370000
034200            AFTER ADVANCING 1 LINES.                              03380000
034300       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-4                  03390000
034400            AFTER ADVANCING 1 LINES.                              03400000
034410       WRITE ERR-RPT-LINE FROM RPT-COL-HEADING-5                  03410000
034420            AFTER ADVANCING 1 LINES.                              03420000
034500       ADD +6 TO PV-LINE-CNT.                                     03430000
034600                                                                  03440000
034700 8400-WRITE-TOTALS.                                               03450000
034800                                                                  03460000
034900      IF PV-LINE-CNT > PV-MAX-LINES                               03470000
035000         PERFORM 8100-WRITE-STD-RPT-HEADING                       03480000
035100         PERFORM 8200-WRITE-REPORT-HEADING                        03490000
035200         PERFORM 8300-WRITE-COLUMN-HEADING                        03500000
035300      END-IF.                                                     03510000
035400                                                                  03520000
035500      MOVE PA-ERROR-MESSAGES TO RPT-NBR-ERRORS                    03530000
035600      WRITE ERR-RPT-LINE FROM RPT-TOTAL-LINE                      03540000
035700            AFTER ADVANCING 2 LINES.                              03550000
035800      WRITE ERR-RPT-LINE FROM RPT-END-OF-REPORT-LINE              03560000
035900            AFTER ADVANCING 1 LINES.                              03570000
036000                                                                  03580000
