000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.      XSKUT059.                                       00020001
000300 AUTHOR.          KOHLS.                                          00030000
000400 DATE-WRITTEN.    AUGUST 19, 2003.                                00040004
000500                                                                  00050000
000600*-----------------------------------------------------------      00060000
000700*                PROMO DATA ERROR QUEUE READER                    00070000
000800*-----------------------------------------------------------      00080000
000900*   THIS PROGRAM WILL READ THE XS DOMAIN MQ ERROR QUEUE AND/OR    00090000
001000*   A FLAT FILE LOG.  BASED ON CERTAIN CRITERIA, THE MESSAGE      00100000
001100*   IN THE QUEUE AND/OR LOG WILL BE WRITTEN TO EITHER             00110000
001200*   THE XS DOMAIN MQ LOADING QUEUE OR TO THE FLAT FILE LOG        00120000
001300*   WHICH ALSO SERVES AS A POSSIBLE INPUT FILE.                   00130000
001400*                                                                 00140000
001500*-----------------------------------------------------------      00150000
001600* HISTORY LOG:                                                    00160000
001700*-----------------------------------------------------------      00170000
001800* DATE:                                                           00180000
001900* WR/IR#:                                                         00190000
002000* PROGRAMMER:                                                     00200000
002100* DESCRIPTION:                                                    00210000
002200*                                                                 00220000
002300*----------------------------------------------------------       00230000
002400 ENVIRONMENT DIVISION.                                            00240000
002500*----------------------------------------------------------       00250000
002600 CONFIGURATION SECTION.                                           00260000
002700 SOURCE-COMPUTER.        IBM-3090.                                00270000
002800 OBJECT-COMPUTER.        IBM-3090.                                00280000
002900                                                                  00290000
003000 INPUT-OUTPUT SECTION.                                            00300000
003100                                                                  00310000
003200 FILE-CONTROL.                                                    00320000
003300                                                                  00330000
003400     SELECT CC-QUEUE-MGR-CONNECT                                  00340000
003500            ASSIGN TO INP01.                                      00350000
003600     SELECT CC-QUEUE-MGR-BUSS-EVNT                                00360000
003700            ASSIGN TO INP02.                                      00370000
003800     SELECT CC-QUEUE-MGR-ERROR                                    00380000
003900            ASSIGN TO INP03.                                      00390000
004000     SELECT CC-INPUT-SOURCE                                       00400000
004100            ASSIGN TO INP04.                                      00410000
004400     SELECT CC-REC-PROCESS-NBR                                    00440000
004500            ASSIGN TO INP06.                                      00450000
004600     SELECT MESSAGE-LOG-IN                                        00460000
004700            ASSIGN TO INP07.                                      00470000
004800     SELECT MESSAGE-LOG-OUT                                       00480000
004900            ASSIGN TO OUT01.                                      00490000
005000                                                                  00500000
005100 DATA DIVISION.                                                   00510000
005200 FILE SECTION.                                                    00520000
005300                                                                  00530000
005400 FD  CC-QUEUE-MGR-CONNECT                                         00540000
005500     RECORDING MODE F                                             00550000
005600     BLOCK CONTAINS 0 RECORDS                                     00560000
005700     LABEL RECORDS ARE OMITTED                                    00570000
005800     DATA RECORD IS CC-QUEUE-MGR-CONNECT-RECORD.                  00580000
005900 01  CC-QUEUE-MGR-CONNECT-RECORD     PIC X(80).                   00590000
006000                                                                  00600000
006100 FD  CC-QUEUE-MGR-BUSS-EVNT                                       00610000
006200     RECORDING MODE F                                             00620000
006300     BLOCK CONTAINS 0 RECORDS                                     00630000
006400     LABEL RECORDS ARE OMITTED                                    00640000
006500     DATA RECORD IS CC-QUEUE-MGR-BUSS-EVNT-RECORD.                00650000
006600 01  CC-QUEUE-MGR-BUSS-EVNT-RECORD   PIC X(80).                   00660000
006700                                                                  00670000
006800 FD  CC-QUEUE-MGR-ERROR                                           00680000
006900     RECORDING MODE F                                             00690000
007000     BLOCK CONTAINS 0 RECORDS                                     00700000
007100     LABEL RECORDS ARE OMITTED                                    00710000
007200     DATA RECORD IS CC-QUEUE-MGR-ERROR-RECORD.                    00720000
007300 01  CC-QUEUE-MGR-ERROR-RECORD       PIC X(80).                   00730000
007400                                                                  00740000
007500 FD  CC-INPUT-SOURCE                                              00750000
007600     RECORDING MODE F                                             00760000
007700     BLOCK CONTAINS 0 RECORDS                                     00770000
007800     LABEL RECORDS ARE OMITTED                                    00780000
007900     DATA RECORD IS CC-INPUT-SOURCE-RECORD.                       00790000
008000 01  CC-INPUT-SOURCE-RECORD          PIC X(80).                   00800000
008100                                                                  00810000
008900 FD  CC-REC-PROCESS-NBR                                           00890000
009000     RECORDING MODE F                                             00900000
009100     BLOCK CONTAINS 0 RECORDS                                     00910000
009200     LABEL RECORDS ARE OMITTED                                    00920000
009300     DATA RECORD IS CC-REC-PROCESS-NBR-RECORD.                    00930000
009400 01  CC-REC-PROCESS-NBR-RECORD       PIC X(80).                   00940000
009500                                                                  00950000
009600 FD  MESSAGE-LOG-IN                                               00960000
009700     RECORDING MODE F                                             00970000
009800     BLOCK CONTAINS 0 RECORDS                                     00980000
009900     LABEL RECORDS ARE OMITTED                                    00990000
010000     DATA RECORD IS MESSAGE-LOG-IN-RECORD.                        01000000
010100 01  MESSAGE-LOG-IN-RECORD.                                       01010000
010300     05  MSG-LOG-IN-REC           PIC  X(128).                    01020001
010400                                                                  01040000
010500 FD  MESSAGE-LOG-OUT                                              01050000
010600     RECORDING MODE F                                             01060000
010700     BLOCK CONTAINS 0 RECORDS                                     01070000
010800     LABEL RECORDS ARE OMITTED                                    01080000
010900     DATA RECORD IS MESSAGE-LOG-OUT-RECORD.                       01090000
011000 01  MESSAGE-LOG-OUT-RECORD.                                      01100000
010300     05  MSG-LOG-OUT-REC          PIC  X(128).                    01110001
011300                                                                  01130000
011400 WORKING-STORAGE SECTION.                                         01140000
011500*-----------------------------------------------------------      01150000
011600* PS- PROGRAM SWITCHES                                            01160000
011700*-----------------------------------------------------------      01170000
011800 01  PS-PROGRAM-SWITCHES.                                         01180000
011900     05  PS-PROCESS-INDICATOR-SW  PIC X(01) VALUE 'Y'.            01190000
012000         88  PS-PROCESS-COMPLETE            VALUE 'N'.            01200000
012100         88  PS-PROCESS-CONTINUE            VALUE 'Y'.            01210000
012200     05  PS-PROCESS-QUEUE-SW      PIC X(01) VALUE 'Y'.            01220000
012300         88  PS-PROCESS-QUEUE-COMPLETE      VALUE 'N'.            01230000
012400         88  PS-PROCESS-QUEUE-CONTINUE      VALUE 'Y'.            01240000
012500     05  PS-PROCESS-LOG-SW        PIC X(01) VALUE 'Y'.            01250000
012600         88  PS-PROCESS-LOG-COMPLETE        VALUE 'N'.            01260000
012700         88  PS-PROCESS-LOG-CONTINUE        VALUE 'Y'.            01270000
012800     05  PS-END-OF-SQL-FILE-SW    PIC X(01) VALUE 'N'.            01280000
012900         88  PS-END-OF-SQL-FILE             VALUE 'Y'.            01290000
013000     05  PS-SQL-CODE-SW           PIC X(01) VALUE 'Y'.            01300000
013100         88  PS-SQL-CODE-NOT-FOUND          VALUE 'N'.            01310000
013200         88  PS-SQL-CODE-FOUND              VALUE 'Y'.            01320000
013300     05  PS-RETRY-PUT-MSG-SW      PIC X(01) VALUE 'Y'.            01330000
013400         88  PS-RETRY-PUT-YES               VALUE 'N'.            01340000
013500         88  PS-RETRY-PUT-NO                VALUE 'Y'.            01350000
013600                                                                  01360000
013700*-----------------------------------------------------------      01370000
013800* CONTROL CARD 1 RECORD LAYOUT - QUEUE MANAGER NAME               01380000
013900*-----------------------------------------------------------      01390000
014000 01  CC-CONTROL-CARD-1-LAYOUT.                                    01400000
014100     05  CC-QUEUE-MANAGER-NAME    PIC X(48) VALUE SPACES.         01410000
014200     05  FILLER                   PIC X(32) VALUE SPACES.         01420000
014300                                                                  01430000
014400*-----------------------------------------------------------      01440000
014500* CONTROL CARD 2 RECORD LAYOUT - BUSINESS EVENT QUEUE NAME        01450000
014600*-----------------------------------------------------------      01460000
014700 01  CC-CONTROL-CARD-2-LAYOUT.                                    01470000
014800     05  CC-BUS-EVNT-QUEUE-NAME   PIC X(48) VALUE SPACES.         01480000
014900     05  FILLER                   PIC X(32) VALUE SPACES.         01490000
015000                                                                  01500000
015100*-----------------------------------------------------------      01510000
015200* CONTROL CARD 3 RECORD LAYOUT - BUSINESS EVENT ERROR QUEUE NAME  01520000
015300*-----------------------------------------------------------      01530000
015400 01  CC-CONTROL-CARD-3-LAYOUT.                                    01540000
015500     05  CC-ERROR-QUEUE-NAME      PIC X(48) VALUE SPACES.         01550000
015600     05  FILLER                   PIC X(32) VALUE SPACES.         01560000
015700                                                                  01570000
015800*-----------------------------------------------------------      01580000
015900* PROGRAM CONSTANTS                                               01590000
016000*-----------------------------------------------------------      01600000
016100 01  PC-PROGRAM-CONSTANTS.                                        01610000
016200     05  PC-CURRENT-PROGRAM-NAME  PIC X(08) VALUE 'XSKUT059'.     01620001
016300                                                                  01630000
016400*-----------------------------------------------------------      01640000
016500* PV- PROGRAM VARIABLES                                           01650000
016600*-----------------------------------------------------------      01660000
016700 01  PV-PROGRAM-VARAIBLES.                                        01670000
016800     05  PV-MQ-ERROR-COUNT        PIC 9(04)  VALUE 0.             01680000
016900     05  PV-CURRENT-DATE          PIC X(10) VALUE SPACES.         01690000
017000     05  PV-FORMAT-CORR-ID.                                       01700000
017100         10  PV-FORMAT-MQ-CORR-ID PIC X(03).                      01710000
017200         10  PV-NULL-VALUE        PIC X(21).                      01720000
017300     05  PV-MQ-CORR-COM           PIC X(03).                      01730000
017400     05  PV-MQ-CORR-ID-COM  REDEFINES                             01740000
017500        PV-MQ-CORR-COM            PIC S9(04) COMP-3.              01750000
017600     05  PV-MQ-CORR-ID            PIC S9(04) VALUE +0 COMP-3.     01760000
017700     05  PV-MQ-CORR-ID-CHAR REDEFINES                             01770000
017800        PV-MQ-CORR-ID             PIC X(03).                      01780000
017900     05  PV-MESSAGE-RECORD.                                       01790000
018000         10  PV-BUS-EVNT-ID       PIC X(03)  VALUE SPACES.        01800000
018100         10  FILLER               PIC X(171) VALUE SPACES.        01810000
018200     05  PV-PRGM-STAT-CDE         PIC X(02).                      01820000
018300         88  PV-SUCCESS                      VALUE '00'.          01830000
018400         88  PV-UPDATE-NEEDED                VALUE '01'.          01840000
018500         88  PV-UPDATE-NOT-NEEDED            VALUE '02'.          01850000
018600         88  PV-INSERT                       VALUE '03'.          01860000
018700         88  PV-UPDATE-BYPASS                VALUE '04'.          01870000
018800         88  PV-NO-SUCCESS                   VALUE '05'.          01880000
018900         88  PV-UNEXPECTED                   VALUE '06'.          01890000
019000     05  PV-SEVERITY-ERR-CDE      PIC X(02).                      01900000
019100         88  PV-CRITICAL-ERROR               VALUE '01'.          01910000
019200         88  PV-UNCRITICAL-ERROR             VALUE '02'.          01920000
019300     05  PV-REFER-INTEGRITY-ERR   PIC S9(04).                     01930000
019400         88  PV-RI-ERROR                     VALUES -530,         01940000
019500                                        -531, -532, -543.         01950000
019600     05  PV-END-OF-DAY            PIC 9(03)  VALUE 999.           01960000
019700                                                                  01970000
019800*----------------------------------------------------------       01980000
019900* MQ WORKING STORAGE                                              01990000
020000*----------------------------------------------------------       02000000
020100 01  MQV-WORKING-STORAGE.                                         02010000
020200     05  MQV-MQCONN               PIC  X(08) VALUE 'CSQBCONN'.    02020000
020300     05  MQV-MQOPEN               PIC  X(08) VALUE 'CSQBOPEN'.    02030000
020400     05  MQV-MQPUT                PIC  X(08) VALUE 'CSQBPUT '.    02040000
020500     05  MQV-MQGET                PIC  X(08) VALUE 'CSQBGET '.    02050000
020600     05  MQV-MQCMIT               PIC  X(08) VALUE 'CSQBCOMM'.    02060000
020700     05  MQV-MQBACK               PIC  X(08) VALUE 'CSQBBACK'.    02070000
020800     05  MQV-MQCLOSE              PIC  X(08) VALUE 'CSQBCLOS'.    02080000
020900     05  MQV-MQDISC               PIC  X(08) VALUE 'CSQBDISC'.    02090000
021000     05  MQV-MQCHECK              PIC  X(08) VALUE 'MQR2C'.       02100000
021100     05  MQV-HCONN                PIC S9(09) BINARY VALUE 0.      02110000
021200     05  MQV-COMPLETION-CODE      PIC S9(09) BINARY.              02120000
021300     05  MQV-REASON               PIC S9(09) BINARY.              02130000
021400     05  MQV-OPEN-OPTIONS         PIC S9(09) BINARY.              02140000
021500     05  MQV-PROMO-HANDLE         PIC S9(09) BINARY VALUE 0.      02150000
021600     05  MQV-ERROR-HANDLE         PIC S9(09) BINARY VALUE 0.      02160000
012600     05  MQV-REASON-TEXT          PIC X(30)  VALUE SPACES.        02170005
021800     05  MQV-MSGBUFFER            PIC X(300) VALUE SPACES.        02180000
021900     05  MQV-ERRMSGBUF            PIC X(300) VALUE SPACES.        02190000
022000     05  MQV-MSG-LENGTH           PIC S9(09) BINARY VALUE         02200000
022100                                              +300.               02210000
022200     05  MQV-DATA-LENGTH          PIC S9(09) BINARY.              02220000
022300                                                                  02230000
022400*----------------------------------------------------------       02240000
022500* PROMO PRICE EXCLUSION LAYOUT                                    02250001
022600*----------------------------------------------------------       02260000
022700     COPY XSRD021.                                                02270001
022800                                                                  02280000
022400*----------------------------------------------------------       02281000
022500* PROMO ERROR PROCESSING DATA SOURCE                              02282000
022600*----------------------------------------------------------       02283000
022700     COPY XSRD038.                                                02284000
022800                                                                  02285000
022900*----------------------------------------------------------       02290000
023000* PROMO REPORCESS SQL CODES                                       02300000
023100*----------------------------------------------------------       02310000
023200*    COPY XSRD039.                                                02320000
023300                                                                  02330000
023400*----------------------------------------------------------       02340000
023500* PROMO ERROR PROCESSING RETRY LIMIT                              02350000
023600*----------------------------------------------------------       02360000
023700     COPY XSRD049.                                                02370000
023800                                                                  02380000
023900                                                                  02390000
024000*----------------------------------------------------------       02400000
024100* DATE ROUTINE COPY MEMBERS                                       02410000
024200*----------------------------------------------------------       02420000
024300     COPY DPWS500.                                                02430000
024400                                                                  02440000
024500*-----------------------------------------------------------      02450000
024600* OBJECT-DESCRIPTOR - MQ SERIES                                   02460000
024700*-----------------------------------------------------------      02470000
024800 01  MQM-OBJECT-DESCRIPTOR.                                       02480000
024900     COPY CMQODV.                                                 02490000
025000                                                                  02500000
025100*-----------------------------------------------------------      02510000
025200* MESSAGE-DESCRIPTOR - MQ SERIES                                  02520000
025300*-----------------------------------------------------------      02530000
025400 01  MQM-MESSAGE-DESCRIPTOR.                                      02540000
025500     COPY CMQMDV.                                                 02550000
025600                                                                  02560000
025700*-----------------------------------------------------------      02570000
025800* GET-MESSAGE-OPTIONS - MQ SERIES                                 02580000
025900*-----------------------------------------------------------      02590000
026000 01  MQM-GET-MESSAGE-OPTIONS.                                     02600000
026100     COPY CMQGMOV.                                                02610000
026200                                                                  02620000
026300*-----------------------------------------------------------      02630000
026400* PUT-MESSAGE-OPTIONS - MQ SERIES                                 02640000
026500*-----------------------------------------------------------      02650000
026600 01  MQM-PUT-MESSAGE-OPTIONS.                                     02660000
026700     COPY CMQPMOV.                                                02670000
026800                                                                  02680000
026900*-----------------------------------------------------------      02690000
027000* CONSTANTS - MQ SERIES                                           02700000
027100*-----------------------------------------------------------      02710000
027200 01  MQM-CONSTANTS.                                               02720000
027300     COPY CMQV.                                                   02730000
027400                                                                  02740000
027500*-----------------------------------------------------------      02750000
027600* PROGRAM COUNTERS                                                02760000
027700*-----------------------------------------------------------      02770000
027800 01  PC-PROGRAM-COUNTERS.                                         02780000
027900     05  PC-MESSAGE-FROM-ERROR-QUEUE  PIC 9(09) VALUE ZEROS.      02790000
028000     05  PC-MESSAGE-FROM-ERROR-LOG    PIC 9(09) VALUE ZEROS.      02800000
028100     05  PC-MESSAGE-WRITTEN-TO-FILE   PIC 9(09) VALUE ZEROS.      02810000
028200     05  PC-MESSAGE-TO-BUSEVNT-QUEUE  PIC 9(09) VALUE ZEROS.      02820000
028300     05  PC-SQL-CARD-COUNT            PIC 9(09) VALUE ZEROS.      02830000
028400     05  PC-SQL-CARD-RETRIEVE-COUNT   PIC 9(09) VALUE ZEROS.      02840000
028500                                                                  02850000
028600*-----------------------------------------------------------      02860000
028700* ERROR HANDLING                                                  02870000
028800*-----------------------------------------------------------      02880000
028900 01  PV-MISC-ABEND-FIELDS.                                        02890000
029000     05  PV-PARAGRAPH-NAME            PIC X(30) VALUE SPACE.      02900000
029100     05  PV-OPERATION-MSG-1           PIC X(40) VALUE SPACE.      02910000
029200     05  PV-OPERATION-MSG-2           PIC X(40) VALUE SPACE.      02920000
029300     05  PV-COMPLETION-CODE           PIC S9(09) BINARY.          02930000
029400     05  PV-REASON                    PIC S9(09) BINARY.          02940000
020130     05  PV-REASON-TEXT               PIC X(30)  VALUE SPACES.    02950006
029600 01  ABEND-CODE                  PIC S9(4) VALUE ZEROS COMP SYNC. 02960000
029700     88  ABEND-4003-CTRL-CARD-ERROR        VALUE +4003.           02970000
029800     88  ABEND-4013-DB2-ERROR              VALUE +4013.           02980000
029900     88  ABEND-4019-CAL-SUB-ERROR          VALUE +4019.           02990000
030000     88  ABEND-4020-MQ-ERROR               VALUE +4020.           03000000
030100     88  ABEND-4444-FORCED-ABEND           VALUE +4444.           03010000
030200                                                                  03020000
030300*----------------------------------------------------------       03030000
030400*  TABLE TO HOLD SQL CODES TO PULL FROM ERROR QUEUE               03040000
030500*----------------------------------------------------------       03050000
030600 01  PV-ERROR-QUEUE-SQL.                                          03060000
030700     05  PV-ERROR-QUEUE-SQL-CODES   OCCURS 50 TIMES               03070000
030800                                     INDEXED BY PV-SQL-X.         03080000
030900         10  PV-SQL-CODE          PIC S9(04) VALUE +0 COMP-3.     03090000
031000                                                                  03100000
031100*----------------------------------------------------------       03110000
031200 PROCEDURE DIVISION.                                              03120000
031300*----------------------------------------------------------       03130000
031400 0000-MAINLINE.                                                   03140000
031500                                                                  03150000
031600     PERFORM 1000-INITIALIZATION.                                 03160000
031700                                                                  03170000
031800     PERFORM 2000-PROCESS-RECORDS.                                03180000
031900                                                                  03190000
032000     PERFORM 9000-WRAPUP.                                         03200000
032100                                                                  03210000
032200     GOBACK.                                                      03220000
032300                                                                  03230000
032400*0000-EXIT.                                                       03240000
032500 EJECT.                                                           03250000
032600                                                                  03260000
032700*----------------------------------------------------------       03270000
032800* 1000-INITIALIZATION.                                            03280000
032900*     INITIALIZATION AREA -                                       03290000
033000*               INITIALIZES PROGRAM COUNTERS                      03300000
033100*               READS CONTROL CARDS                               03310000
033200*               CONNECT TO QUEUE                                  03320000
033300*               OPEN BUSINESS EVENT AND ERROR QUEUES              03330000
033400*----------------------------------------------------------       03340000
033500 1000-INITIALIZATION.                                             03350000
033600                                                                  03360000
033700                                                                  03370000
033800     INITIALIZE PC-PROGRAM-COUNTERS.                              03380000
033900                                                                  03390000
034000     OPEN INPUT  CC-QUEUE-MGR-CONNECT                             03400000
034100                 CC-QUEUE-MGR-BUSS-EVNT                           03410000
034200                 CC-QUEUE-MGR-ERROR                               03420000
034300                 CC-INPUT-SOURCE                                  03430000
034500                 CC-REC-PROCESS-NBR                               03450000
034600                 MESSAGE-LOG-IN                                   03460000
034700          OUTPUT MESSAGE-LOG-OUT.                                 03470000
034800                                                                  03480000
034900     PERFORM 1010-READ-CC-Q-MGR-CONN.                             03490000
035000     PERFORM 1020-READ-CC-Q-MGR-BUSS-EVNT.                        03500000
035100     PERFORM 1030-READ-CC-Q-MGR-ERROR.                            03510000
035200     PERFORM 1040-READ-CC-INP-SRC.                                03520000
035300     SET PV-SQL-X TO +1.                                          03530000
035400     MOVE +0 TO PC-SQL-CARD-COUNT.                                03540000
035700     PERFORM 1060-READ-CC-REC-PROCESS-NBR.                        03570000
035800                                                                  03580000
035900     IF  CC-QUEUE-MANAGER-NAME    =  SPACES                       03590000
036000      OR CC-BUS-EVNT-QUEUE-NAME   =  SPACES                       03600000
036100      OR CC-ERROR-QUEUE-NAME      =  SPACES                       03610000
036200      OR XS038-CC-DATA-SOURCE     =  SPACES                       03620000
036300      OR XS049-CC-RETRY-LIMIT     =  SPACES                       03630000
036400         DISPLAY 'EMPTY CONTROL CARD'                             03640000
036500         DISPLAY 'QUEUE MANAGER NAME: ' CC-QUEUE-MANAGER-NAME     03650000
036600         DISPLAY 'BUS EVENT QUEUE NAME: ' CC-BUS-EVNT-QUEUE-NAME  03660000
036700         DISPLAY 'ERROR QUEUE NAME: ' CC-ERROR-QUEUE-NAME         03670000
036800         DISPLAY 'DATA SOURCE:      ' XS038-CC-DATA-SOURCE        03680000
036900         DISPLAY 'RETRY LIMIT:      ' XS049-CC-RETRY-LIMIT        03690000
037000         MOVE '1000-INITIALIZATION' TO PV-PARAGRAPH-NAME          03700000
037100         MOVE 'CONTROL CARD IS EMPTY' TO PV-OPERATION-MSG-1       03710000
037200         SET ABEND-4003-CTRL-CARD-ERROR TO TRUE                   03720000
037300         PERFORM 9300-ABEND                                       03730000
037400     END-IF.                                                      03740000
037500                                                                  03750000
037600     PERFORM 1100-CONNECT-TO-QMGR.                                03760000
037700     PERFORM 1200-OPEN-BUS-EVNT-QUEUE.                            03770000
037800     PERFORM 1300-OPEN-ERROR-QUEUE.                               03780000
037900                                                                  03790000
038000                                                                  03800000
038100*1000-EXIT.                                                       03810000
038200 EJECT.                                                           03820000
038300                                                                  03830000
038400                                                                  03840000
038500*----------------------------------------------------------       03850000
038600* 1010-READ-CC-Q-MGR-CONN.                                        03860000
038700*     READ CONTROL CARD TO GET THE QUEUE MANAGER NAME.            03870000
038800*----------------------------------------------------------       03880000
038900 1010-READ-CC-Q-MGR-CONN.                                         03890000
039000                                                                  03900000
039100     READ CC-QUEUE-MGR-CONNECT INTO CC-CONTROL-CARD-1-LAYOUT.     03910000
039200     DISPLAY 'QUEUE MANAGER NAME: ' CC-QUEUE-MANAGER-NAME.        03920000
039300                                                                  03930000
039400*1010-EXIT.                                                       03940000
039500 EJECT.                                                           03950000
039600                                                                  03960000
039700*----------------------------------------------------------       03970000
039800* 1020-READ-CC-Q-MGR-BUSS-EVNT.                                   03980000
039900*     READS CONTROL CARD TO GET THE BUSINESS EVENT QUEUE          03990000
040000*     NAME.                                                       04000000
040100*----------------------------------------------------------       04010000
040200 1020-READ-CC-Q-MGR-BUSS-EVNT.                                    04020000
040300                                                                  04030000
040400     READ CC-QUEUE-MGR-BUSS-EVNT INTO CC-CONTROL-CARD-2-LAYOUT.   04040000
040500     DISPLAY 'BUS EVENT QUEUE NAME: ' CC-BUS-EVNT-QUEUE-NAME.     04050000
040600                                                                  04060000
040700*1020-EXIT.                                                       04070000
040800 EJECT.                                                           04080000
040900                                                                  04090000
041000*----------------------------------------------------------       04100000
041100* 1030-READ-CC-Q-MGR-ERROR.                                       04110000
041200*     READS CONTROL CARD TO GET THE ERROR QUEUE NAME.             04120000
041300*----------------------------------------------------------       04130000
041400 1030-READ-CC-Q-MGR-ERROR.                                        04140000
041500                                                                  04150000
041600     READ CC-QUEUE-MGR-ERROR INTO CC-CONTROL-CARD-3-LAYOUT.       04160000
041700     DISPLAY 'ERROR QUEUE NAME: ' CC-ERROR-QUEUE-NAME.            04170000
041800                                                                  04180000
041900*1030-EXIT.                                                       04190000
042000 EJECT.                                                           04200000
042100                                                                  04210000
042200*----------------------------------------------------------       04220000
042300* 1040-READ-CC-INP-SRC.                                           04230000
042400*     READ CONTROL CARD 4.  THIS GETS THE INPUT SOURCE.           04240000
042500*----------------------------------------------------------       04250000
042600 1040-READ-CC-INP-SRC.                                            04260000
042700                                                                  04270000
042800     READ CC-INPUT-SOURCE INTO XS038-CC-CONTROL-CARD.             04280000
042900     DISPLAY XS038-CC-CONTROL-CARD.                               04290000
043000                                                                  04300000
043100*1040-EXIT.                                                       04310000
043200 EJECT.                                                           04320000
043300                                                                  04330000
045300                                                                  04530000
045400*----------------------------------------------------------       04540000
045500* 1060-READ-CC-REC-PROCESS-NBR.                                   04550000
045600*     READ CONTROL CARD 6.  THIS GETS THE NUMBER OF TIME READ.    04560000
045700*----------------------------------------------------------       04570000
045800 1060-READ-CC-REC-PROCESS-NBR.                                    04580000
045900                                                                  04590000
046000     READ CC-REC-PROCESS-NBR INTO XS049-CC-CONTROL-CARD.          04600000
046100     DISPLAY XS049-CC-CONTROL-CARD.                               04610000
046200                                                                  04620000
046300*1060-EXIT.                                                       04630000
046400 EJECT.                                                           04640000
046500                                                                  04650000
046600*----------------------------------------------------------       04660000
046700* 1100-CONNECT-TO-QMGR.                                           04670000
046800*     CONNECT TO THE QUEUE MANAGER.                               04680000
046900*----------------------------------------------------------       04690000
047000 1100-CONNECT-TO-QMGR.                                            04700000
047100                                                                  04710000
047200     CALL MQV-MQCONN USING CC-QUEUE-MANAGER-NAME                  04720000
047300                           MQV-HCONN                              04730000
047400                           MQV-COMPLETION-CODE                    04740000
047500                           MQV-REASON.                            04750000
047600                                                                  04760000
047700     EVALUATE TRUE                                                04770000
047800        WHEN MQV-COMPLETION-CODE = MQCC-OK                        04780000
047900             DISPLAY ' '                                          04790000
048000             DISPLAY 'SUCCESSFULLY CONNECTED TO: '                04800000
048100                                            CC-QUEUE-MANAGER-NAME 04810000
048200        WHEN OTHER                                                04820000
048300             CALL MQV-MQCHECK USING MQV-REASON                    04830000
048400                                    MQV-REASON-TEXT               04840000
048500             DISPLAY 'QUEUE CONNECTING TO ' CC-QUEUE-MANAGER-NAME 04850000
048600             MOVE '1100-CONNECT-TO-QMGR' TO PV-PARAGRAPH-NAME     04860000
048700             MOVE 'UNABLE TO CONNECT'  TO PV-OPERATION-MSG-1      04870000
048800             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    04880000
048900             MOVE MQV-REASON             TO PV-REASON             04890000
049000             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        04900000
049100             PERFORM 9400-MQ-ABEND                                04910000
049200     END-EVALUATE.                                                04920000
049300                                                                  04930000
049400*1100-EXIT.                                                       04940000
049500 EJECT.                                                           04950000
049600                                                                  04960000
049700*----------------------------------------------------------       04970000
049800* 1200-OPEN-BUS-EVNT-QUEUE.                                       04980000
049900*     OPEN THE BUSINESS EVENT QUEUE.                              04990000
050000*----------------------------------------------------------       05000000
050100 1200-OPEN-BUS-EVNT-QUEUE.                                        05010000
050200                                                                  05020000
050300     MOVE CC-BUS-EVNT-QUEUE-NAME   TO MQOD-OBJECTNAME             05030000
050400     MOVE CC-QUEUE-MANAGER-NAME    TO MQOD-OBJECTQMGRNAME.        05040000
050500                                                                  05050000
050600     COMPUTE MQV-OPEN-OPTIONS      = MQOO-OUTPUT                  05060000
050700                                   + MQOO-SET-ALL-CONTEXT         05070000
050800                                   + MQOO-FAIL-IF-QUIESCING.      05080000
050900                                                                  05090000
051000     CALL MQV-MQOPEN USING MQV-HCONN                              05100000
051100                           MQM-OBJECT-DESCRIPTOR                  05110000
051200                           MQV-OPEN-OPTIONS                       05120000
051300                           MQV-PROMO-HANDLE                       05130000
051400                           MQV-COMPLETION-CODE                    05140000
051500                           MQV-REASON.                            05150000
051600                                                                  05160000
051700     EVALUATE TRUE                                                05170000
051800        WHEN MQV-COMPLETION-CODE = MQCC-OK                        05180000
051900             DISPLAY 'SUCCESSFULLY OPENED QUEUE: '                05190000
052000                                           CC-BUS-EVNT-QUEUE-NAME 05200000
052100        WHEN OTHER                                                05210000
052200             CALL MQV-MQCHECK USING MQV-REASON                    05220000
052300                                   MQV-REASON-TEXT                05230000
052400             DISPLAY 'CANNOT OPEN QUEUE ' CC-BUS-EVNT-QUEUE-NAME  05240000
052500             MOVE '1200-OPEN-BUS-EVNT-QUEUE' TO PV-PARAGRAPH-NAME 05250000
052600             MOVE 'CANNOT OPEN QUEUE'  TO PV-OPERATION-MSG-1      05260000
052700             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    05270000
052800             MOVE MQV-REASON             TO PV-REASON             05280000
052900             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        05290000
053000             PERFORM 9200-DISCONNECT-QMGR                         05300000
053100             PERFORM 9400-MQ-ABEND                                05310000
053200     END-EVALUATE.                                                05320000
053300                                                                  05330000
053400*1200-EXIT.                                                       05340000
053500 EJECT.                                                           05350000
053600                                                                  05360000
053700*----------------------------------------------------------       05370000
053800* 1300-OPEN-ERROR-QUEUE.                                          05380000
053900*     OPEN THE ERROR QUEUE.                                       05390000
054000*----------------------------------------------------------       05400000
054100 1300-OPEN-ERROR-QUEUE.                                           05410000
054200                                                                  05420000
054300     MOVE CC-ERROR-QUEUE-NAME          TO MQOD-OBJECTNAME         05430000
054400     MOVE CC-QUEUE-MANAGER-NAME        TO MQOD-OBJECTQMGRNAME.    05440000
054500                                                                  05450000
054600     COMPUTE MQV-OPEN-OPTIONS      = MQOO-INPUT-SHARED            05460000
054700                                   + MQOO-SAVE-ALL-CONTEXT        05470000
054800                                   + MQOO-FAIL-IF-QUIESCING.      05480000
054900                                                                  05490000
055000     CALL MQV-MQOPEN USING MQV-HCONN                              05500000
055100                           MQM-OBJECT-DESCRIPTOR                  05510000
055200                           MQV-OPEN-OPTIONS                       05520000
055300                           MQV-ERROR-HANDLE                       05530000
055400                           MQV-COMPLETION-CODE                    05540000
055500                           MQV-REASON.                            05550000
055600                                                                  05560000
055700     EVALUATE TRUE                                                05570000
055800        WHEN MQV-COMPLETION-CODE = MQCC-OK                        05580000
055900             DISPLAY 'SUCCESSFULLY OPENED QUEUE: '                05590000
056000                                          CC-ERROR-QUEUE-NAME     05600000
056100        WHEN OTHER                                                05610000
056200             CALL MQV-MQCHECK USING MQV-REASON                    05620000
056300                                    MQV-REASON-TEXT               05630000
056400             MOVE '1300-OPEN-ERROR-QUEUE' TO PV-PARAGRAPH-NAME    05640000
056500             MOVE 'CANNOT OPEN QUEUE'  TO PV-OPERATION-MSG-1      05650000
056600             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    05660000
056700             MOVE MQV-REASON             TO PV-REASON             05670000
056800             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        05680000
056900             PERFORM 9200-DISCONNECT-QMGR                         05690000
057000             PERFORM 9400-MQ-ABEND                                05700000
057100     END-EVALUATE.                                                05710000
057200                                                                  05720000
057300*1300-EXIT.                                                       05730000
057400 EJECT.                                                           05740000
057500                                                                  05750000
057600                                                                  05760000
057700*----------------------------------------------------------       05770000
057800* 2000-PROCESS-RECORDS.                                           05780000
057900*----------------------------------------------------------       05790000
058000 2000-PROCESS-RECORDS.                                            05800000
058100                                                                  05810000
058200*                                                                 05820000
058300* READ ERROR MESSAGES FROM ERROR QUEUE                            05830000
058400*                                                                 05840000
058500     IF XS038-CC-SOURCE-QUEUE                                     05850000
058600        SET PV-SQL-X TO +1                                        05860000
058700        MOVE +1 TO PC-SQL-CARD-RETRIEVE-COUNT                     05870000
058800        PERFORM 3000-RETRIEVE-MESSAGE-QUEUE                       05880000
058900             UNTIL PS-PROCESS-QUEUE-COMPLETE                      05890000
059000     ELSE                                                         05900000
059100*                                                                 05910000
059200* READ ERROR MESSAGES FROM ERROR MESSAGE LOG                      05920000
059300*                                                                 05930000
059400        IF XS038-CC-SOURCE-LOG                                    05940000
059500           PERFORM 4000-RETRIEVE-MESSAGE-LOG                      05950000
059600             UNTIL PS-PROCESS-LOG-COMPLETE                        05960000
059700        ELSE                                                      05970000
059800*                                                                 05980000
059900* READ ERROR MESSAGES FROM ERROR QUEUE AND MESSAGE LOG            05990000
060000*                                                                 06000000
060100           IF XS038-CC-SOURCE-QUEUE-LOG                           06010000
060200              SET PV-SQL-X TO +1                                  06020000
060300              MOVE +1 TO PC-SQL-CARD-RETRIEVE-COUNT               06030000
060400              PERFORM 3000-RETRIEVE-MESSAGE-QUEUE                 06040000
060500                UNTIL PS-PROCESS-QUEUE-COMPLETE                   06050000
060600              PERFORM 4000-RETRIEVE-MESSAGE-LOG                   06060000
060700                UNTIL PS-PROCESS-LOG-COMPLETE                     06070000
060800           END-IF                                                 06080000
060900        END-IF                                                    06090000
061000     END-IF.                                                      06100000
061100                                                                  06110000
061200                                                                  06120000
061300                                                                  06130000
061400*2000-EXIT.                                                       06140000
061500 EJECT.                                                           06150000
061600                                                                  06160000
061700*----------------------------------------------------------       06170000
061800* 3000-RETRIEVE-MESSAGE-QUEUE.                                    06180000
061900*     RETRIEVES THE NEXT MESSAGE FROM THE ERROR QUEUE.            06190000
062000*----------------------------------------------------------       06200000
062100 3000-RETRIEVE-MESSAGE-QUEUE.                                     06210000
062200                                                                  06220000
062300     INITIALIZE MQV-MSGBUFFER                                     06230000
062400                MQV-ERRMSGBUF.                                    06240000
062500                                                                  06250000
062600     MOVE +300                 TO MQV-MSG-LENGTH.                 06260000
062700                                                                  06270000
062800     MOVE MQMI-NONE            TO MQMD-MSGID.                     06280000
062900     MOVE MQCI-NONE            TO MQMD-CORRELID                   06290000
063000                                  PV-NULL-VALUE.                  06300000
063100                                                                  06310000
063700                                                                  06370000
063800     MOVE CC-ERROR-QUEUE-NAME  TO MQOD-OBJECTNAME.                06380000
063900     MOVE MQFMT-STRING         TO MQMD-FORMAT.                    06390000
064100                                                                  06410000
064200     COMPUTE MQGMO-OPTIONS  =  MQGMO-SYNCPOINT +                  06420000
064300                               MQGMO-CONVERT   +                  06430000
064400                               MQGMO-ACCEPT-TRUNCATED-MSG.        06440000
064600                                                                  06460000
064700     CALL MQV-MQGET USING MQV-HCONN                               06470000
064800                          MQV-ERROR-HANDLE                        06480000
064900                          MQM-MESSAGE-DESCRIPTOR                  06490000
065000                          MQM-GET-MESSAGE-OPTIONS                 06500000
065100                          MQV-MSG-LENGTH                          06510000
065200                          MQV-ERRMSGBUF                           06520000
065300                          MQV-DATA-LENGTH                         06530000
065400                          MQV-COMPLETION-CODE                     06540000
065500                          MQV-REASON.                             06550000
065600                                                                  06560000
065700     IF  MQV-COMPLETION-CODE = MQCC-OK                            06570000
065800         ADD +1             TO PC-MESSAGE-FROM-ERROR-QUEUE        06580000
065900         MOVE SPACES TO PV-MESSAGE-RECORD                         06590000
066000         MOVE MQV-ERRMSGBUF TO PV-MESSAGE-RECORD                  06600000
066100         IF PV-BUS-EVNT-ID = PV-END-OF-DAY                        06610000
066200            SET PS-PROCESS-QUEUE-COMPLETE     TO TRUE             06620000
066300         ELSE                                                     06630000
066400            SET PS-RETRY-PUT-YES TO TRUE                          06640000
066500            PERFORM 5000-PUT-ON-BUS-EVNT-QUEUE                    06650000
066600                          UNTIL PS-RETRY-PUT-NO                   06660000
066700         END-IF                                                   06670000
066800     ELSE                                                         06680000
066900         EVALUATE TRUE                                            06690000
067000            WHEN MQV-REASON = MQRC-Q-MGR-QUIESCING                06700000
067100            WHEN MQV-REASON = MQRC-Q-MGR-STOPPING                 06710000
067200                 CONTINUE                                         06720000
067300            WHEN MQV-REASON = MQRC-NO-MSG-AVAILABLE               06730000
067400                 DISPLAY 'NO MORE MESSAGES AVAILABLE'             06740000
067500                 SET PV-SQL-X UP BY +1                            06750000
067600                 ADD +1 TO PC-SQL-CARD-RETRIEVE-COUNT             06760000
067700                 IF PC-SQL-CARD-RETRIEVE-COUNT >                  06770000
067800                    PC-SQL-CARD-COUNT                             06780000
067900                      SET PS-PROCESS-QUEUE-COMPLETE TO TRUE       06790000
068000                 ELSE                                             06800000
068100                    CONTINUE                                      06810000
068400                 END-IF                                           06840000
068500            WHEN OTHER                                            06850000
068600                 CALL MQV-MQCHECK USING MQV-REASON                06860000
068700                                        MQV-REASON-TEXT           06870000
068800                 MOVE '3000-RETRIEVE-MESSAGE' TO PV-PARAGRAPH-NAME06880000
068900                 MOVE 'ERROR RETRIEVING MESSAGE'                  06890000
069000                                       TO PV-OPERATION-MSG-1      06900000
069100                 MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE06910000
069200                 MOVE MQV-REASON             TO PV-REASON         06920000
069300                 MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT    06930000
069400                 PERFORM 3100-BACK-OUT-MQV-CHANGES                06940000
069500                 PERFORM 9200-DISCONNECT-QMGR                     06950000
069600                 PERFORM 9400-MQ-ABEND                            06960000
069700         END-EVALUATE                                             06970000
069800     END-IF.                                                      06980000
069900                                                                  06990000
071000                                                                  07100000
071100*----------------------------------------------------------       07110000
071200* 3100-BACK-OUT-MQV-CHANGES.                                      07120000
071300*     ROLLBACK MQ CHANGES.                                        07130000
071400*----------------------------------------------------------       07140000
071500 3100-BACK-OUT-MQV-CHANGES.                                       07150000
071600                                                                  07160000
071700     CALL MQV-MQBACK USING MQV-HCONN                              07170000
071800                           MQV-COMPLETION-CODE                    07180000
071900                           MQV-REASON.                            07190000
072000                                                                  07200000
072100     EVALUATE TRUE                                                07210000
072200        WHEN MQV-COMPLETION-CODE = MQCC-OK                        07220000
072300             CONTINUE                                             07230000
072400        WHEN OTHER                                                07240000
072500             CALL MQV-MQCHECK USING MQV-REASON                    07250000
072600                                    MQV-REASON-TEXT               07260000
072700             MOVE '3100-BACK-OUT-MQV-CHANGES' TO PV-PARAGRAPH-NAME07270000
072800             MOVE 'MQBACK ERROR'  TO PV-OPERATION-MSG-1           07280000
072900             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    07290000
073000             MOVE MQV-REASON             TO PV-REASON             07300000
073100             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        07310000
073200             PERFORM 9200-DISCONNECT-QMGR                         07320000
073300             PERFORM 9400-MQ-ABEND                                07330000
073400     END-EVALUATE.                                                07340000
073500                                                                  07350000
073600*3100-EXIT.                                                       07360000
073700 EJECT.                                                           07370000
073800                                                                  07380000
073900*----------------------------------------------------------       07390000
074000* 4000-RETRIEVE-MESSAGE-LOG.                                      07400000
074100*     RETRIEVES THE NEXT MESSAGE FROM THE MESSAGE LOG.            07410000
074200*     SEARCH THE SQL TABLE FOR SQL MESSAGE                        07420000
074300*     PUTS THE MESSAGE ON THE BUSINESS EVENTS QUEUE               07430000
074400*----------------------------------------------------------       07440000
074500 4000-RETRIEVE-MESSAGE-LOG.                                       07450000
074600                                                                  07460000
074700     PERFORM 4100-READ-MESSAGE-IN-LOG.                            07470000
074800                                                                  07480000
074900     IF PS-PROCESS-LOG-CONTINUE                                   07490000
075000                                                                  07500000
075300                                                                  07530000
075400        MOVE MSG-LOG-IN-REC TO PV-MESSAGE-RECORD                  07540000
075500                                                                  07550000
076900           SET PS-RETRY-PUT-YES TO TRUE                           07690000
077000           PERFORM 5000-PUT-ON-BUS-EVNT-QUEUE                     07700000
077100                   UNTIL PS-RETRY-PUT-NO                          07710000
077200           ADD +1 TO PC-MESSAGE-FROM-ERROR-LOG                    07720000
077400                                                                  07740000
077500     END-IF.                                                      07750000
077600                                                                  07760000
077700*4000-EXIT.                                                       07770000
077800 EJECT.                                                           07780000
077900                                                                  07790000
078000*----------------------------------------------------------       07800000
078100* 4100-READ-MESSAGE-IN-LOG.                                       07810000
078200*----------------------------------------------------------       07820000
078300 4100-READ-MESSAGE-IN-LOG.                                        07830000
078400                                                                  07840000
078500     READ MESSAGE-LOG-IN                                          07850000
078600         AT END                                                   07860000
078700             SET PS-PROCESS-LOG-COMPLETE TO TRUE.                 07870000
078800                                                                  07880000
078900*4100-EXIT.                                                       07890000
079000 EJECT.                                                           07900000
081200*----------------------------------------------------------       08120000
081300* 5000-PUT-ON-BUS-EVNT-QUEUE.                                     08130000
081400*     PUTS THE MESSAGE THAT PREVIOUSLY HAD AN ERROR ON THE        08140000
081500*     BUSINESS EVENTS QUEUE.                                      08150000
081600*----------------------------------------------------------       08160000
081700 5000-PUT-ON-BUS-EVNT-QUEUE.                                      08170000
081800                                                                  08180000
081900     MOVE +300                      TO MQV-MSG-LENGTH.            08190002
082000     MOVE CC-BUS-EVNT-QUEUE-NAME    TO MQOD-OBJECTNAME.           08200000
082100     MOVE CC-QUEUE-MANAGER-NAME     TO MQOD-OBJECTQMGRNAME.       08210000
082200                                                                  08220000
082300     MOVE PV-MESSAGE-RECORD         TO MQV-MSGBUFFER.             08230000
082400                                                                  08240000
082500     MOVE MQMI-NONE                 TO MQMD-MSGID.                08250000
082600     MOVE MQCI-NONE                 TO MQMD-CORRELID              08260000
082700                                       PV-NULL-VALUE.             08270000
082800                                                                  08280000
082900     MOVE MQFMT-STRING              TO MQMD-FORMAT.               08290000
083000     ADD 1                          TO PV-MQ-ERROR-COUNT.         08300000
083100     MOVE PV-MQ-ERROR-COUNT         TO MQMD-APPLORIGINDATA.       08310000
083200                                                                  08320000
083300     COMPUTE MQPMO-OPTIONS  =  MQPMO-SYNCPOINT +                  08330000
083400                               MQPMO-SET-ALL-CONTEXT.             08340000
083500                                                                  08350000
083600     CALL MQV-MQPUT USING MQV-HCONN                               08360000
083700                          MQV-PROMO-HANDLE                        08370000
083800                          MQM-MESSAGE-DESCRIPTOR                  08380000
083900                          MQM-PUT-MESSAGE-OPTIONS                 08390000
084000                          MQV-MSG-LENGTH                          08400000
084100                          MQV-MSGBUFFER                           08410000
084200                          MQV-COMPLETION-CODE                     08420000
084300                          MQV-REASON.                             08430000
084400                                                                  08440000
084500     EVALUATE TRUE                                                08450000
084600        WHEN MQV-COMPLETION-CODE = MQCC-OK                        08460000
084700             ADD +1 TO PC-MESSAGE-TO-BUSEVNT-QUEUE                08470000
084800             PERFORM 5500-COMMIT-MESSAGE                          08480000
084900             SET PS-RETRY-PUT-NO TO TRUE                          08490000
085100                INITIALIZE PV-MQ-ERROR-COUNT                      08510000
085500        WHEN OTHER                                                08550000
085600             DISPLAY 'UNABLE TO WRITE TO BUS EVNT Q '             08560000
085700             IF PV-MQ-ERROR-COUNT > XS049-CC-RETRY-LIMIT          08570000
085800                PERFORM 6000-WRITE-ERROR-MESSAGE                  08580000
085900                INITIALIZE PV-MQ-ERROR-COUNT                      08590000
086000                SET PS-RETRY-PUT-NO TO TRUE                       08600000
087100             ELSE                                                 08710000
087200                CONTINUE                                          08720000
087300             END-IF                                               08730000
087400     END-EVALUATE.                                                08740000
087500                                                                  08750000
087600*5000-EXIT.                                                       08760000
087700 EJECT.                                                           08770000
087800                                                                  08780000
087900*----------------------------------------------------------       08790000
088000* 5500-COMMIT-MESSAGE.                                            08800000
088100*     REMOVES THE MESSAGE FROM THE QUEUE.                         08810000
088200*----------------------------------------------------------       08820000
088300 5500-COMMIT-MESSAGE.                                             08830000
088400                                                                  08840000
088500     CALL MQV-MQCMIT USING MQV-HCONN                              08850000
088600                           MQV-COMPLETION-CODE                    08860000
088700                           MQV-REASON.                            08870000
088800                                                                  08880000
088900     EVALUATE TRUE                                                08890000
089000        WHEN MQV-COMPLETION-CODE = MQCC-OK                        08900000
089100             CONTINUE                                             08910000
089200        WHEN OTHER                                                08920000
089300             CALL MQV-MQCHECK USING MQV-REASON                    08930000
089400                                    MQV-REASON-TEXT               08940000
089500             MOVE '5500-COMMIT-MESSAGE'  TO PV-PARAGRAPH-NAME     08950000
089600             MOVE 'ERROR COMMITING DATA' TO PV-OPERATION-MSG-1    08960000
089700             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    08970000
089800             MOVE MQV-REASON             TO PV-REASON             08980000
089900             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        08990000
090000             PERFORM 3100-BACK-OUT-MQV-CHANGES                    09000000
090100             PERFORM 9200-DISCONNECT-QMGR                         09010000
090200             PERFORM 9400-MQ-ABEND                                09020000
090300     END-EVALUATE.                                                09030000
090400                                                                  09040000
090500*5500-EXIT.                                                       09050000
090600 EJECT.                                                           09060000
090700                                                                  09070000
090800*----------------------------------------------------------       09080000
090900* 6000-WRITE-ERROR-MESSAGE.                                       09090000
091000*     WRITES THE MESSAGE TO A ERROR LOG.                          09100000
091100*----------------------------------------------------------       09110000
091200 6000-WRITE-ERROR-MESSAGE.                                        09120000
091300                                                                  09130000
091500     MOVE PV-MESSAGE-RECORD TO MSG-LOG-OUT-REC.                   09150000
091600     WRITE MESSAGE-LOG-OUT-RECORD.                                09160000
091700                                                                  09170000
091800     ADD +1 TO PC-MESSAGE-WRITTEN-TO-FILE.                        09180000
091900                                                                  09190000
092000*6000-EXIT.                                                       09200000
092100 EJECT.                                                           09210000
092200                                                                  09220000
092300                                                                  09230000
092400*----------------------------------------------------------       09240000
092500* 9000-WRAPUP.                                                    09250000
092600*     END OF PROGRAM ROUTINE.  CLOSES ALL QUEUES, DISCONNECTS     09260000
092700*     FROM THE QUEUE MANAGER, CLOSES ALL FILES, AND               09270000
092800*     DISPLAYS ALL DATA.                                          09280000
092900*----------------------------------------------------------       09290000
093000 9000-WRAPUP.                                                     09300000
093100                                                                  09310000
093200     PERFORM 9100-CLOSE-BUSINESS-QUEUE.                           09320000
093300     PERFORM 9150-CLOSE-ERROR-QUEUE.                              09330000
093400     PERFORM 9200-DISCONNECT-QMGR.                                09340000
093500                                                                  09350000
093600     CLOSE CC-QUEUE-MGR-CONNECT                                   09360000
093700           CC-QUEUE-MGR-BUSS-EVNT                                 09370000
093800           CC-QUEUE-MGR-ERROR                                     09380000
093900           CC-INPUT-SOURCE                                        09390000
094100           CC-REC-PROCESS-NBR                                     09410000
094200           MESSAGE-LOG-IN                                         09420000
094300           MESSAGE-LOG-OUT.                                       09430000
094400                                                                  09440000
094500     DISPLAY ' '.                                                 09450000
094600     DISPLAY '*********************************************'.     09460000
094700     DISPLAY 'PROGRAM NAME: ' PC-CURRENT-PROGRAM-NAME.            09470000
094800     DISPLAY '*********************************************'.     09480000
094900     DISPLAY 'MESSAGES READ FROM ERROR QUEUE: '                   09490000
095000                     PC-MESSAGE-FROM-ERROR-QUEUE.                 09500000
095100     DISPLAY '*********************************************'.     09510000
095200     DISPLAY 'MESSAGES READ FROM ERROR LOG:   '                   09520000
095300                     PC-MESSAGE-FROM-ERROR-LOG.                   09530000
095400     DISPLAY '*********************************************'.     09540000
095500     DISPLAY 'MESSAGES WRITTEN TO ERROR LOG: '                    09550000
095600                     PC-MESSAGE-WRITTEN-TO-FILE.                  09560000
095700     DISPLAY '*********************************************'.     09570000
095800     DISPLAY 'MESSAGES WRITTEN TO BUSINESS QUEUE: '               09580000
095900                     PC-MESSAGE-TO-BUSEVNT-QUEUE.                 09590000
096000     DISPLAY '*********************************************'.     09600000
096100                                                                  09610000
096200*9000-EXIT.                                                       09620000
096300 EJECT.                                                           09630000
096400                                                                  09640000
096500*----------------------------------------------------------       09650000
096600* 9100-CLOSE-BUSINESS-QUEUE.                                      09660000
096700*     CLOSE BUSINESS EVENT QUEUE.                                 09670000
096800*----------------------------------------------------------       09680000
096900 9100-CLOSE-BUSINESS-QUEUE.                                       09690000
097000                                                                  09700000
097100     CALL MQV-MQCLOSE USING MQV-HCONN                             09710000
097200                            MQV-PROMO-HANDLE                      09720000
097300                            MQCO-NONE                             09730000
097400                            MQV-COMPLETION-CODE                   09740000
097500                            MQV-REASON.                           09750000
097600                                                                  09760000
097700     EVALUATE TRUE                                                09770000
097800        WHEN MQV-COMPLETION-CODE = MQCC-OK                        09780000
097900             CONTINUE                                             09790000
098000        WHEN MQV-COMPLETION-CODE NOT EQUAL MQCC-OK                09800000
098100             CALL MQV-MQCHECK USING MQV-REASON                    09810000
098200                                    MQV-REASON-TEXT               09820000
098300             MOVE '9100-CLOSE-BUSINESS-QUEUE'                     09830000
098400                                      TO PV-PARAGRAPH-NAME        09840000
098500             MOVE 'CANNOT CLOSE BUS EVENT QUEUE'                  09850000
098600                                    TO PV-OPERATION-MSG-1         09860000
098700             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    09870000
098800             MOVE MQV-REASON             TO PV-REASON             09880000
098900             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        09890000
099000             PERFORM 9400-MQ-ABEND                                09900000
099100     END-EVALUATE.                                                09910000
099200                                                                  09920000
099300                                                                  09930000
099400*9100-EXIT.                                                       09940000
099500 EJECT.                                                           09950000
099600                                                                  09960000
099700*----------------------------------------------------------       09970000
099800* 9150-CLOSE-ERROR-QUEUE.                                         09980000
099900*     CLOSE ERROR QUEUE.                                          09990000
100000*----------------------------------------------------------       10000000
100100 9150-CLOSE-ERROR-QUEUE.                                          10010000
100200                                                                  10020000
100300                                                                  10030000
100400     CALL MQV-MQCLOSE USING MQV-HCONN                             10040000
100500                            MQV-ERROR-HANDLE                      10050000
100600                            MQCO-NONE                             10060000
100700                            MQV-COMPLETION-CODE                   10070000
100800                            MQV-REASON.                           10080000
100900                                                                  10090000
101000     EVALUATE TRUE                                                10100000
101100        WHEN MQV-COMPLETION-CODE = MQCC-OK                        10110000
101200             CONTINUE                                             10120000
101300        WHEN MQV-COMPLETION-CODE NOT EQUAL MQCC-OK                10130000
101400             CALL MQV-MQCHECK USING MQV-REASON                    10140000
101500                                    MQV-REASON-TEXT               10150000
101600             MOVE '9150-CLOSE-ERROR-QUEUE'                        10160000
101700                                      TO PV-PARAGRAPH-NAME        10170000
101800             MOVE 'CANNOT CLOSE ERROR QUEUE' TO PV-OPERATION-MSG-110180000
101900             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    10190000
102000             MOVE MQV-REASON             TO PV-REASON             10200000
102100             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        10210000
102200             PERFORM 9400-MQ-ABEND                                10220000
102300     END-EVALUATE.                                                10230000
102400                                                                  10240000
102500*9150-EXIT.                                                       10250000
102600 EJECT.                                                           10260000
102700                                                                  10270000
102800*----------------------------------------------------------       10280000
102900* 9200-DISCONNECT-QMGR.                                           10290000
103000*     DISCONNECT FROM THE QUEUE MANAGER.                          10300000
103100*----------------------------------------------------------       10310000
103200 9200-DISCONNECT-QMGR.                                            10320000
103300                                                                  10330000
103400     CALL MQV-MQDISC USING MQV-HCONN                              10340000
103500                           MQV-COMPLETION-CODE                    10350000
103600                           MQV-REASON.                            10360000
103700                                                                  10370000
103800     EVALUATE TRUE                                                10380000
103900        WHEN MQV-COMPLETION-CODE = MQCC-OK                        10390000
104000             CONTINUE                                             10400000
104100        WHEN MQV-COMPLETION-CODE NOT EQUAL MQCC-OK                10410000
104200             CALL MQV-MQCHECK USING MQV-REASON                    10420000
104300                                    MQV-REASON-TEXT               10430000
104400             MOVE '9200-DISCONNECT-QMGR' TO PV-PARAGRAPH-NAME     10440000
104500             MOVE 'MQDISC ERROR'         TO PV-OPERATION-MSG-1    10450000
104600             MOVE MQV-COMPLETION-CODE    TO PV-COMPLETION-CODE    10460000
104700             MOVE MQV-REASON             TO PV-REASON             10470000
104800             MOVE MQV-REASON-TEXT        TO PV-REASON-TEXT        10480000
104900             PERFORM 9400-MQ-ABEND                                10490000
105000     END-EVALUATE.                                                10500000
105100                                                                  10510000
105200*9200-EXIT.                                                       10520000
105300 EJECT.                                                           10530000
105400                                                                  10540000
105500*---------------------------------------------------------        10550000
105600* 9300-ABEND.                                                     10560000
105700*     ABEND PROGRAM WHEN A NON-DB2 ERROR OCCURS.                  10570000
105800*---------------------------------------------------------        10580000
105900 9300-ABEND.                                                      10590000
106000                                                                  10600000
106100     DISPLAY '** ABEND           **'.                             10610000
106200     DISPLAY '** PROGRAM         ** = ' PC-CURRENT-PROGRAM-NAME.  10620000
106300     DISPLAY '** PARAGRAPH       ** = ' PV-PARAGRAPH-NAME.        10630000
106400     DISPLAY '** OPERATION       ** = ' PV-OPERATION-MSG-1.       10640000
106500     DISPLAY '**                 ** = ' PV-OPERATION-MSG-2.       10650000
106600     CALL 'ILBOABN0' USING ABEND-CODE.                            10660000
106700                                                                  10670000
106800*9300-EXIT.                                                       10680000
106900 EJECT.                                                           10690000
107000                                                                  10700000
107100*----------------------------------------------------------       10710000
107200* 9400-MQ-ABEND.                                                  10720000
107300*     MQ ABEND ROUTINE.                                           10730000
107400*----------------------------------------------------------       10740000
107500 9400-MQ-ABEND.                                                   10750000
107600                                                                  10760000
107700     SET ABEND-4020-MQ-ERROR TO TRUE.                             10770000
107800     DISPLAY '**** ABEND *************************************'.  10780000
107900     DISPLAY '** MQSERIES ERROR **'.                              10790000
108000     DISPLAY '** PROGRAM:    ' PC-CURRENT-PROGRAM-NAME.           10800000
108100     DISPLAY '** ABEND CODE: ' ABEND-CODE.                        10810000
108200     DISPLAY '** PARAGRAPH:  ' PV-PARAGRAPH-NAME.                 10820000
108300     DISPLAY '** MESSAGE:    ' PV-OPERATION-MSG-1.                10830000
108400     DISPLAY '** COMP CODE:  ' PV-COMPLETION-CODE.                10840000
108500     DISPLAY '** RSN CODE:   ' PV-REASON.                         10850000
108600     DISPLAY '** RSN TEXT:   ' PV-REASON-TEXT.                    10860000
108700     DISPLAY '************************************************'.  10870000
108800     CALL 'ILBOABN0' USING ABEND-CODE.                            10880000
108900                                                                  10890000
109000*9400-EXIT.                                                       10900000
109100 EJECT.                                                           10910000
109200                                                                  10920000
109300                                                                  10930000
