000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    XSKUP043.                                         00020000
000300 AUTHOR.        BARB ERTL.                                        00030000
000400 INSTALLATION.  KOHLS DEPARTMENT STORES.                          00040000
000500 DATE-WRITTEN.  10/29/2002.                                       00050000
000600 DATE-COMPILED.                                                   00060000
000700******************************************************************00070000
000800**      OUTLOC MESSAGE TO POPULATE XST_LOC                        00080000
000900******************************************************************00090000
001000**THIS IS A CALLED MODULE FOR LOCATION TABLES.  THIS PROGRAM      00100000
001100**     WILL PERFORM UPDATES/INSERTS/DELETES FOR THE XST_LOC       00110000
001200**     TABLE.                                                     00120000
001300**     IT DOES THE FOLLOWING WITH THESE RETURN CODES:             00130000
001400**     0000 - END PROGRAM                                         00140000
001500**    -0530 - END PROGRAM                                         00150000
001600**    -0803 - END PROGRAM                                         00160000
001700**    -0911 - RETRY INSERT UP TO 5 TIMES AND THEN END PROGRAM     00170000
001800******************************************************************00180000
001900 ENVIRONMENT DIVISION.                                            00190000
002000 CONFIGURATION SECTION.                                           00200000
002100 SOURCE-COMPUTER.  IBM-3090.                                      00210000
002200 OBJECT-COMPUTER.  IBM-3090.                                      00220000
002300 DATA DIVISION.                                                   00230000
002400                                                                  00240000
002500 WORKING-STORAGE SECTION.                                         00250000
002600******************************************************************00260000
002700**PROGRAM SWITCHES                                                00270000
002800******************************************************************00280000
002900 01  PS-PROGRAM-SWITCHES.                                         00290000
003000     05  PS-PROCESS-CONTINUE-SW      PIC X(01)  VALUE 'Y'.        00300000
003100         88  PS-PROCESS-CONTINUE                VALUE 'Y'.        00310000
003200         88  PS-PROCESS-COMPLETE                VALUE 'N'.        00320000
003300******************************************************************00330000
003400**PROGRAM CONSTANTS                                               00340000
003500******************************************************************00350000
003600 01  PC-PROGRAM-CONSTANTS.                                        00360000
003700     05  PC-RETRY-MAX                PIC 9(01)  VALUE 5.          00370000
003800******************************************************************00380000
003900**PROGRAM VARIABLES                                               00390000
004000******************************************************************00400000
004100 01  PV-PROGRAM-VARIABLES.                                        00410000
004200     05  PV-RETRY-COUNTER               PIC  9(01)  VALUE ZEROS.  00420000
004300     05  PV-LOC-NBR-X                   PIC  X(05).               00430007
004400     05  PV-LOC-NBR-N REDEFINES PV-LOC-NBR-X PIC 9(05).           00440008
004500******************************************************************00450000
004600**COPYBOOKS                                                       00460000
004700******************************************************************00470000
004800***DB2 MESSAGE AREA                                               00480000
004900     COPY SQLCA2.                                                 00490011
005000***MESSAGE COPYBOOK                                               00500000
005100     COPY HORD100.                                                00510011
005200******************************************************************00520000
005300**TABLE INCLUSIONS                                                00530000
005400******************************************************************00540000
005500***DB2 COMMUNICATIONS AREA                                        00550000
005600     EXEC SQL                                                     00560000
005700          INCLUDE SQLCA                                           00570000
005800     END-EXEC.                                                    00580000
005900* ------------------------------------------------------------- * 00590000
006000*  SQL AND COBOL DECLARATIONS FOR LOCATION TABLE (XST_LOC)        00600000
006100* ------------------------------------------------------------- * 00610000
006200     EXEC SQL                                                     00620000
006300         INCLUDE XST00001                                         00630000
006400     END-EXEC.                                                    00640000
006500                                                                  00650000
006600 LINKAGE SECTION.                                                 00660000
006700******************************************************************00670000
006800**LINKAGE VARIABLES                                               00680000
006900******************************************************************00690000
007000 01  LV-LINKAGE-VARIABLES.                                        00700001
007100     05  LV-HORD100-RECORD               PIC X(500).              00710001
007200     05  LV-RETURN-CODE                  PIC S9(04).              00720001
007300                                                                  00730001
007400 PROCEDURE DIVISION USING LV-LINKAGE-VARIABLES.                   00740001
007500******************************************************************00750000
007600 0000-MAINLINE.                                                   00760000
007700                                                                  00770000
007800      PERFORM 1000-INITIALIZATION.                                00780000
007900      PERFORM 2000-PROCESS-MESSAGE.                               00790000
008000      PERFORM 9999-WRAPUP.                                        00800000
008100                                                                  00810000
008200***************************************************************** 00820000
008300**INITIALIZATION AREA - ALL MOVES TO UPDATE/INSERT                00830000
008400***************************************************************** 00840000
008500 1000-INITIALIZATION.                                             00850000
008600                                                                  00860000
008700     INITIALIZE PV-RETRY-COUNTER.                                 00870000
008800     SET PS-PROCESS-CONTINUE TO TRUE.                             00880010
008900                                                                  00890000
009000     MOVE LV-HORD100-RECORD          TO HORD100-RECORD.           00900000
009100                                                                  00910000
009200     INITIALIZE DCLXST00001.                                      00920000
009300                                                                  00930000
009400     MOVE HO100-OTLC-ID             TO PV-LOC-NBR-X.              00940009
009500     MOVE PV-LOC-NBR-N              TO XST00001-LOC-NBR.          00950007
009600     MOVE HO100-OTLC-TYPE           TO XST00001-LOC-TYP-CDE.      00960000
009700     MOVE HO100-OTLC-DESC           TO XST00001-LOC-NM.           00970000
009800     MOVE HO100-OUTLOC-DESC1-10     TO XST00001-LOC-10-ABBR-NM.   00980000
009900     MOVE HO100-OTLC-ADD1           TO XST00001-LNE-1-ADDR.       00990000
010000     MOVE HO100-OTLC-ADD2           TO XST00001-LNE-2-ADDR.       01000000
010100     MOVE HO100-OTLC-CITY           TO XST00001-CTY-NM.           01010000
010200     MOVE HO100-OTLC-STATE-1-2      TO XST00001-ST-CDE.           01020000
010300     MOVE HO100-OTLC-POST           TO XST00001-ZIP-10-CDE.       01030000
010400     MOVE HO100-OTLC-CONTACT-PHONE  TO XST00001-PHN-NBR.          01040000
010500     MOVE HO100-OTLC-NM-5-ABBR      TO XST00001-LOC-5-ABBR-NM.    01050000
010600     MOVE HO100-OTLC-OPN-DTE        TO XST00001-OPN-DTE.          01060000
010700     MOVE HO100-OTLC-CLO-DTE        TO XST00001-CLO-DTE.          01070000
010800                                                                  01080000
010900***************************************************************** 01090000
011000**MAIN PROGRAM LOGIC - READS ACTION TYPE ON HORD100 RECORD        01100000
011100***************************************************************** 01110000
011200 2000-PROCESS-MESSAGE.                                            01120000
011300                                                                  01130000
011400     EVALUATE TRUE                                                01140000
011500        WHEN HO100-ACTN-TYP-INSERT                                01150000
011600             PERFORM 2100-INSERT-DATA                             01160000
011700                                                                  01170000
011800        WHEN HO100-ACTN-TYP-UPDATE                                01180000
011900             PERFORM 2200-UPDATE-DATA                             01190000
012000                                                                  01200000
012100        WHEN HO100-ACTN-TYP-DELETE                                01210000
012200            PERFORM 2300-DELETE-DATA                              01220000
012300     END-EVALUATE.                                                01230000
012400                                                                  01240000
012500***************************************************************** 01250000
012600**INSERT ACTION TYPE                                              01260000
012700***************************************************************** 01270000
012800 2100-INSERT-DATA.                                                01280000
012900                                                                  01290000
013000     PERFORM                                                      01300000
013100         WITH TEST AFTER                                          01310000
013200         VARYING PV-RETRY-COUNTER                                 01320000
013300         FROM 1 BY 1                                              01330000
013400         UNTIL PV-RETRY-COUNTER > PC-RETRY-MAX                    01340000
013500            OR SQLCODE = 0                                        01350000
013600            OR PS-PROCESS-COMPLETE                                01360000
013700                                                                  01370000
013800        EXEC SQL                                                  01380000
013900          INSERT INTO XST_LOC                                     01390000
014000              (LOC_NBR                                            01400000
014100             , LOC_TYP_CDE                                        01410000
014200             , LOC_NM                                             01420000
014300             , LOC_5_ABBR_NM                                      01430000
014400             , LOC_10_ABBR_NM                                     01440000
014500             , LNE_1_ADDR                                         01450000
014600             , LNE_2_ADDR                                         01460000
014700             , CTY_NM                                             01470000
014800             , ST_CDE                                             01480000
014900             , ZIP_10_CDE                                         01490000
015000             , PHN_NBR                                            01500000
015100             , OPN_DTE                                            01510000
015200             , CLO_DTE                                            01520000
015300             , LAST_UPD_TMST)                                     01530000
015400     VALUES                                                       01540000
015500            ( : XST00001-LOC-NBR                                  01550000
015600            , : XST00001-LOC-TYP-CDE                              01560000
015700            , : XST00001-LOC-NM                                   01570000
015800            , : XST00001-LOC-5-ABBR-NM                            01580000
015900            , : XST00001-LOC-10-ABBR-NM                           01590000
016000            , : XST00001-LNE-1-ADDR                               01600000
016100            , : XST00001-LNE-2-ADDR                               01610000
016200            , : XST00001-CTY-NM                                   01620000
016300            , : XST00001-ST-CDE                                   01630000
016400            , : XST00001-ZIP-10-CDE                               01640000
016500            , : XST00001-PHN-NBR                                  01650000
016600            , : XST00001-OPN-DTE                                  01660000
016700            , : XST00001-CLO-DTE                                  01670000
016800            , CURRENT TIMESTAMP)                                  01680000
016900        END-EXEC                                                  01690000
017000                                                                  01700000
017100         EVALUATE TRUE                                            01710000
017200             WHEN SQLCODE = -911                                  01720000
017300             WHEN SQLCODE = -913                                  01730000
017400             WHEN SQLCODE = 0                                     01740000
017500                 CONTINUE                                         01750000
017600             WHEN SQLWARN0 NOT = SPACE                            01760000
017700             WHEN SQLCODE NOT =  ZERO                             01770000
017800                 SET PS-PROCESS-COMPLETE TO TRUE                  01780000
017900         END-EVALUATE                                             01790000
018000     END-PERFORM.                                                 01800000
018100                                                                  01810000
018200     SET PS-PROCESS-COMPLETE     TO TRUE.                         01820000
018300                                                                  01830000
018400******************************************************************01840000
018500**UPDATE ACTION TYPE                                              01850000
018600******************************************************************01860000
018700 2200-UPDATE-DATA.                                                01870000
018800                                                                  01880000
018900     PERFORM                                                      01890000
019000         WITH TEST AFTER                                          01900000
019100         VARYING PV-RETRY-COUNTER                                 01910000
019200         FROM 1 BY 1                                              01920000
019300         UNTIL PV-RETRY-COUNTER > PC-RETRY-MAX                    01930000
019400            OR SQLCODE = 0                                        01940000
019500            OR PS-PROCESS-COMPLETE                                01950000
019600                                                                  01960000
019700        EXEC SQL                                                  01970000
019800          UPDATE XST_LOC                                          01980000
019900          SET LOC_TYP_CDE        = : XST00001-LOC-TYP-CDE         01990000
020000             ,LOC_NM             = : XST00001-LOC-NM              02000000
020100             ,LOC_5_ABBR_NM      = : XST00001-LOC-5-ABBR-NM       02010000
020200             ,LOC_10_ABBR_NM     = : XST00001-LOC-10-ABBR-NM      02020000
020300             ,LNE_1_ADDR         = : XST00001-LNE-1-ADDR          02030000
020400             ,LNE_2_ADDR         = : XST00001-LNE-2-ADDR          02040000
020500             ,CTY_NM             = : XST00001-CTY-NM              02050000
020600             ,ST_CDE             = : XST00001-ST-CDE              02060000
020700             ,ZIP_10_CDE         = : XST00001-ZIP-10-CDE          02070000
020800             ,PHN_NBR            = : XST00001-PHN-NBR             02080000
020900             ,OPN_DTE            = : XST00001-OPN-DTE             02090000
021000             ,CLO_DTE            = : XST00001-CLO-DTE             02100000
021100             ,LAST_UPD_TMST      = CURRENT TIMESTAMP              02110000
021200              WHERE  (LOC_NBR = : XST00001-LOC-NBR)               02120000
021300           END-EXEC                                               02130000
021400                                                                  02140000
021500         EVALUATE TRUE                                            02150000
021600             WHEN SQLCODE = -911                                  02160000
021700             WHEN SQLCODE = -913                                  02170000
021800             WHEN SQLCODE = 0                                     02180000
021900                 CONTINUE                                         02190000
022000             WHEN SQLWARN0 NOT = SPACE                            02200000
022100             WHEN SQLCODE NOT =  ZERO                             02210000
022200                 SET PS-PROCESS-COMPLETE TO TRUE                  02220000
022300         END-EVALUATE                                             02230000
022400     END-PERFORM.                                                 02240000
022500                                                                  02250000
022600     SET PS-PROCESS-COMPLETE     TO TRUE.                         02260000
022700                                                                  02270000
022800******************************************************************02280000
022900**DELETE TYPE ACTION                                              02290000
023000******************************************************************02300000
023100 2300-DELETE-DATA.                                                02310000
023200                                                                  02320000
023300     PERFORM                                                      02330000
023400         WITH TEST AFTER                                          02340000
023500         VARYING PV-RETRY-COUNTER                                 02350000
023600         FROM 1 BY 1                                              02360000
023700         UNTIL PV-RETRY-COUNTER > PC-RETRY-MAX                    02370000
023800            OR SQLCODE = 0                                        02380000
023900            OR PS-PROCESS-COMPLETE                                02390000
024000                                                                  02400000
024100           EXEC SQL                                               02410000
024200               DELETE FROM XST_LOC                                02420000
024300             WHERE  (LOC_NBR = :XST00001-LOC-NBR)                 02430000
024400           END-EXEC                                               02440000
024500                                                                  02450000
024600         EVALUATE TRUE                                            02460000
024700             WHEN SQLCODE = -911                                  02470000
024800             WHEN SQLCODE = -913                                  02480000
024900             WHEN SQLCODE = 0                                     02490000
025000                 CONTINUE                                         02500000
025100             WHEN SQLWARN0 NOT = SPACE                            02510000
025200             WHEN SQLCODE NOT =  ZERO                             02520000
025300                 SET PS-PROCESS-COMPLETE TO TRUE                  02530000
025400         END-EVALUATE                                             02540000
025500     END-PERFORM.                                                 02550000
025600                                                                  02560000
025700     SET PS-PROCESS-COMPLETE     TO TRUE.                         02570000
025800                                                                  02580000
025900******************************************************************02590000
026000**PASS SQLCODE TO CALLING AND EXIT PROGRAM                        02600000
026100******************************************************************02610000
026200 9999-WRAPUP.                                                     02620000
026300                                                                  02630000
026400     MOVE SQLCODE       TO LV-RETURN-CODE.                        02640000
026500                                                                  02650000
026600     EXIT PROGRAM.                                                02660000
