000100***********************************************************       00010078
000200**                      XSRD024                          **       00020078
000300**                     LRECL=123                         **       00030079
000400**  THIS COPYBOOK IS USED FOR NEW PROMO ADHOC STORE      **       00040078
000500**  LIST BUSINESS EVENT.                                 **       00050078
000600***********************************************************       00060079
000700 01  XS024-ADHOC-STR-LST-RECORD.                                  00070080
000800   05 XS024-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZERO.        00080080
000900   05 XS024-ACTION-CDE               PIC X(01) VALUE SPACES.      00090080
001000   05 XS024-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00100080
001100   05 XS024-ADHC-STR-GP-ID           PIC 9(10) VALUE ZERO.        00110080
001200   05 XS024-STR-NBR                  PIC 9(05) VALUE ZERO.        00120081
001300   05 XS024-STRT-TMST                PIC X(26) VALUE SPACES.      00130080
001400   05 XS024-END-TMST                 PIC X(26) VALUE SPACES.      00140080
001500   05 XS024-STAT-CDE                 PIC X(01) VALUE SPACES.      00150080
001600   05 XS024-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00160080
