000100***********************************************************       00010000
000200**                      XSRD030                          **       00020001
000300**                     LRECL=06                          **       00030002
000400**  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00040000
000500**  XST SKU LOC ATTR TABLE.                              **       00050001
000600***********************************************************       00060000
       01  XS030-SKU-LOC-ATTR-UNLOAD.                                   00220002
           10 XS030-INTR-UPC-ID             PIC  S9(9) COMP.            00230002
           10 XS030-LOC-NBR                 PIC  S9(4) COMP.            00240002
