000100***********************************************************       00010000
000200**                      XSRD042                          **       00020000
000300**                     LRECL=361                                  00030010
000400**  THIS COPYBOOK IS USED FOR NEW PROMO PRICE            **       00040000
000500**  DETERMINATION.                                       **       00050000
000600***********************************************************       00060000
000700 01  XS042-PD-DETAIL-RECORD.                                      00070002
000800   05 XS042-RECORD-TYPE              PIC X(01) VALUE SPACES.      00080000
000900   05 XS042-STORE                    PIC S9(04) VALUE +0 COMP.    00090004
000900   05 XS042-INTR-UPC-ID              PIC S9(09) VALUE +0 COMP.    00100000
         05 XS042-DATE                     PIC X(10).                   00110009
         05 XS042-TIME                     PIC X(08).                   00120009
         05 XS042-PROMO-ID                 PIC S9(10)V COMP-3.          00130011
001000   05 XS042-ELIG-PROMO-ID            PIC S9(10)V VALUE +0 COMP-3. 00140000
001100   05 XS042-ELIG-PROMO-INTFC-ID      PIC S9(10)V VALUE +0 COMP-3. 00150000
001100   05 XS042-ELIG-MDSE-LNE-ID         PIC S9(10)V VALUE +0 COMP-3. 00160007
001100   05 XS042-BWP-PROMO-INTFC-SUB-ID   PIC S9(10)V VALUE +0 COMP-3. 00170007
001200   05 XS042-PROMO-STRT-DTE           PIC X(26) VALUE SPACES.      00180000
001300   05 XS042-PROMO-END-DTE            PIC X(26) VALUE SPACES.      00190000
001400   05 XS042-PRICG-TYP-CDE            PIC X(03) VALUE SPACES.      00200000
001500   05 XS042-MRCH-HEIR-CDE            PIC X(03) VALUE SPACES.      00210000
001600   05 XS042-DISC-GP-QTY              PIC S9(04) VALUE +0 COMP.    00220000
001700   05 XS042-DISC-GP-AMT              PIC S9(07)V9(03)             00230000
001710                                               VALUE +0 COMP-3.   00240000
001800   05 XS042-ELIG-TIERED-ARRAY.                                    00250000
001900      10  FILLER                      OCCURS 10 TIMES             00260000
001910                                      INDEXED BY XS042-TIER-INDEX.00270000
002000       15  XS042-BUY-QTY             PIC S9(04) VALUE +0 COMP.    00280000
002010       15  XS042-BUY-DLR             PIC S9(07)V9(02)             00290000
002020                                               VALUE +0 COMP-3.   00300000
002030       15  XS042-GET-PCT             PIC S9(07)V9(03)             00310000
002031                                               VALUE +0 COMP-3.   00320000
002032       15  XS042-GET-DLR             PIC S9(07)V9(02)             00330000
002033                                               VALUE +0 COMP-3.   00340000
002034       15  XS042-INTFC-SUB-ID        PIC S9(10)V VALUE +0 COMP-3. 00350000
