000100***********************************************************       00010007
000200**                      XSRD039                          **       00020017
000300**                     LRECL=80                          **       00030014
000310** THIS COPYBOOK WILL DEFINE THE LAYOUT OF THE CONTROL   **       00040016
000320** CARD USED BY THE 'XS' DOMAIN PROMO DATA ERROR READER. **       00050016
000330** THE CONTROL CARD INDICATES WHAT TYPE OF DB2 ERRORS    **       00060017
000340** SHOULD BE REPROCESSED.                                **       00070017
000900***********************************************************       00080001
000910 01  XS039-CC-CONTROL-CARD.                                       00090017
000920   05 XS039-CC-CONTROL-CARD-DISPLY.                               00100017
000930      10 XS039-CC-NAME               PIC  X(22) VALUE SPACES.     00110017
000940         88 XS039-CC-VALID-NAME                 VALUE             00120017
000950             'REPROCESS SQL CODES = '.                            00130017
011514      10 XS039-CC-SQL-CODE     PIC S9(04) VALUE +0 COMP-3.        00140019
000980   05 FILLER                         PIC  X(54) VALUE SPACES.     00150017
