000100***********************************************************       00010078
000200**                      XSRD016                          **       00020078
000300**                     LRECL=250                         **       00030081
000400**  THIS COPYBOOK IS USED FOR NEW PROMO PROMOTION        **       00040078
000500**  BUSINESS EVENT.                                      **       00050078
000600***********************************************************       00060078
000700 01  XS016-PROMOTION-RECORD.                                      00070078
000800   05 XS016-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZERO.        00080078
000900   05 XS016-ACTION-CDE               PIC X(01) VALUE SPACES.      00090078
001000   05 XS016-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00100078
001100   05 XS016-PROMO-ID                 PIC 9(10) VALUE ZERO.        00110078
001200   05 XS016-AD-EVNT-ID               PIC 9(10) VALUE ZERO.        00120078
001300   05 XS016-PROMO-TYP-CDE            PIC X(02) VALUE SPACES.      00130078
001400   05 XS016-PROMO-NBR-TXT            PIC X(15) VALUE SPACES.      00140078
001500   05 XS016-CPLT-NM                  PIC X(40) VALUE SPACES.      00150078
001600   05 XS016-ABBR-NM                  PIC X(05) VALUE SPACES.      00160078
001700   05 XS016-REG-PROMO-TYP-CDE        PIC X(02) VALUE SPACES.      00170078
001800   05 XS016-SPECIFIC-PROMO-TYP-CDE   PIC X(02) VALUE SPACES.      00180078
001900   05 XS016-STRT-TMST                PIC X(26) VALUE SPACES.      00190078
002000   05 XS016-END-TMST                 PIC X(26) VALUE SPACES.      00200078
002010   05 XS016-ACT-STRT-TMST            PIC X(26) VALUE SPACES.      00201079
002020   05 XS016-ACT-END-TMST             PIC X(26) VALUE SPACES.      00202080
002030   05 XS016-ESL-TOPR-TYP             PIC X(03) VALUE SPACES.      00203084
002100   05 XS016-STAT-CDE                 PIC X(01) VALUE SPACES.      00210078
002200   05 XS016-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00220078
