      *---------------------------------------------------------------*         
      *                                                               *         
      *    XSRD078 - PERM PRICE CHANGE SUBMIT PRICING GRID MESSAGE    *         
      *              COPYBOOK                                         *         
      *                                                               *         
      *    LENGTH  - 225 TO 88137 TOTAL BYTES                         *         
      *              43 BYTES OF HEADER DATA                          *         
      *              182 TO 88094 BYTES OF DETAIL DATA                *         
      *                                                               *         
      *    NOTES:  - THIS COPYBOOK SHOULD BE KEPT IN SYNC WITH THE    *         
      *              XMRD007 COPYBOOK.                                *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR#27634   11/16/2004   INITIAL CREATION                   *         
      *---------------------------------------------------------------*         
       01  XS078-RECORD.                                                        
           05  XS078-BUSINESS-EVENT                   PIC X(30).                
               88  XS078-BE-SUBMIT-PRICING-GRID             VALUE               
                   'SubmitPricingGrid             '.                            
           05  XS078-REVISION                         PIC X(04).                
           05  XS078-MESSAGE-ID                       PIC 9(09).                
      *                                                                         
           05  XS078-SUBMIT-PRICING-GRID-DATA.                                  
               10  XS078-SUBMIT-PG-GRID-ID            PIC 9(09).                
               10  XS078-SUBMIT-PG-GRID-DESC          PIC X(20).                
               10  XS078-SUBMIT-PG-PRCHG-ID           PIC 9(09).                
               10  XS078-SUBMIT-PG-CRE-TMST           PIC X(26).                
               10  XS078-SUBMIT-PG-LAST-UPD-TMST      PIC X(26).                
               10  XS078-SUBMIT-PG-DETAIL-COUNT       PIC 9(04).                
               10  XS078-SUBMIT-PG-DETAIL                                       
                       OCCURS 1 TO 1000 TIMES                                   
                       DEPENDING ON XS078-SUBMIT-PG-DETAIL-COUNT.               
      *            *** each occurance is 88 bytes of data   ***                 
                   15  XS078-SUBMIT-DTL-GRID-DTL-ID   PIC 9(09).                
                   15  XS078-SUBMIT-DTL-MIN-RTL-AMT   PIC 9(07)V99.             
                   15  XS078-SUBMIT-DTL-MAX-RTL-AMT   PIC 9(07)V99.             
                   15  XS078-SUBMIT-DTL-NEW-RTL-AMT   PIC 9(07)V99.             
                   15  XS078-SUBMIT-DTL-CRE-TMST      PIC X(26).                
                   15  XS078-SUBMIT-DTL-LAST-UPD-TMST PIC X(26).                
