000100***********************************************************       00010078
000200**                      XSRD017                          **       00020078
000300**                     LRECL=79                          **       00030081
000400**  THIS COPYBOOK IS USED FOR NEW PROMO PRICE VERSION    **       00040078
000500**  BUSINESS EVENT.                                      **       00050078
000600***********************************************************       00060080
000700 01  XS017-PRICE-VERSION-RECORD.                                  00070081
000800   05 XS017-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZERO.        00080081
000900   05 XS017-ACTION-CDE               PIC X(01) VALUE SPACES.      00090081
001000   05 XS017-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00100081
001100   05 XS017-PROMO-PRIC-VER-ID        PIC 9(10) VALUE ZERO.        00110081
001300   05 XS017-PROMO-ID                 PIC 9(10) VALUE ZERO.        00130081
001400   05 XS017-PRIC-VER-ABBR-NM         PIC X(02) VALUE SPACES.      00140081
001500   05 XS017-STAT-CDE                 PIC X(01) VALUE SPACES.      00150081
001600   05 XS017-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00160081
