      ***********************************************************       00010003
      **XS UNLOAD RECORD LAYOUT FOR TABLE XST_POG_FIXT_LOC              00020005
      ***********************************************************       00030003
       01  XSRD064-POG-FIXT-UNLD-RECORD.                                00040005
           05  XSRD064-POG-ID              PIC S9(09) COMP VALUE ZEROS. 00050006
           05  XSRD064-FLR-PAD-CDE         PIC X(02)       VALUE SPACES.00060006
           05  XSRD064-FIXT-LOC-NBR        PIC S9(09) COMP VALUE ZEROS. 00070007
           05  FILLER                      PIC X(68)       VALUE ZEROS. 00080006
