000100***********************************************************       00010007
000200**                      XSRD049                          **       00020015
000300**                     LRECL=80                          **       00030014
000310** THIS COPYBOOK WILL DEFINE THE LAYOUT OF THE CONTROL   **       00031016
000320** CARD USED BY THE 'XS' DOMAIN PROMO DATA ERROR READER. **       00032016
000330** THE CONTROL CARD WILL INDICATE HOW MANY RETRIES CAN   **       00033016
000340** BE MADE FROM THE ERROR QUEUE DATA BEFORE PUTTING THE  **       00034016
000350** BUSINESS EVENT OUT TO THE FLAT LOG FILE.              **       00035016
000900***********************************************************       00090001
000910 01  XS049-CC-CONTROL-CARD.                                       00091016
000920   05 XS049-CC-CONTROL-CARD-DISPLY.                               00092016
000930      10 XS049-CC-NAME               PIC X(37) VALUE SPACES.      00093016
000940         88 XS049-CC-VALID-NAME                VALUE              00094016
000950             'PROMO ERROR PROCESSING RETRY LIMIT = '.             00095016
000970      10 XS049-CC-RETRY-LIMIT        PIC 9(03) VALUE ZEROES.      00097016
000980   05 FILLER                         PIC X(40) VALUE SPACES.      00098016
