      ******************************************************************00010024
      **XS ERROR RECORD LAYOUT FOR TABLE XST_BUS_AREA                   00020067
      ******************************************************************00030024
         01  XSRD002-BUSAREA-ERR-RECORD.                                00040067
             05  XSRD002-XS-BUS-AREA-ID        PIC 9(02).               00050067
             05  XSRD002-VSM-BUS-AREA-ID       PIC 9(02).               00060067
             05  XSRD002-XS-BUS-AREA-DESC      PIC X(25).               00070067
             05  XSRD002-VSM-BUS-AREA-DESC     PIC X(25).               00080067
             05  FILLER                        PIC X(26).               00090067
