      ***********************************************************       00010003
      **XS UNLOAD RECORD FOR TABLE XST_POG                              00020004
      ***********************************************************       00030003
       01  XSRD062-POG-UNLD-RECORD.                                     00040005
           05  XSRD062-POG-ID              PIC S9(09) COMP VALUE ZEROS. 00050006
           05  XSRD062-POG-NM              PIC X(40)       VALUE SPACES.00060006
           05  XSRD062-SET-DTE             PIC X(10)       VALUE SPACES.00070006
           05  XSRD062-BRK-DTE             PIC X(10)       VALUE SPACES.00080006
           05  FILLER                      PIC X(36)       VALUE SPACES.00090006
