      ***********************************************************       00010003
      **XS ERROR RECORD LAYOUT FOR TABLE XST_POG_FIXT_LOC               00020003
      ***********************************************************       00030003
       01  XSRD059-POG-ERR-RECORD.                                      00040006
           05  XSRD059-XS-POG-ID           PIC 9(15)  VALUE ZEROS.      00050004
           05  XSRD059-PG-POG-ID           PIC 9(15)  VALUE ZEROS.      00060004
           05  XSRD059-XS-FLR-PAD-CDE      PIC X(02)  VALUE SPACES.     00070004
           05  XSRD059-PG-FLR-PAD-CDE      PIC X(02)  VALUE SPACES.     00080004
           05  XSRD059-XS-FIXT-LOC-NBR     PIC 9(15)  VALUE ZEROS.      00090004
           05  XSRD059-PG-FIXT-LOC-NBR     PIC 9(15)  VALUE ZEROS.      00100004
           05  FILLER                      PIC X(36)  VALUE ZEROS.      00110003
