      ***********************************************************       00010003
      **XS ERROR RECORD LAYOUT FOR TABLE XST_POG_POSN                   00020003
      ***********************************************************       00030003
061107* 06/11/2007 DAVE WELLER WR31875                                  00031006
      ***********************************************************       00032006
       01  XSRD060-POG-ERR-RECORD.                                      00040003
           05  XSRD060-XS-POG-ID           PIC 9(15)  VALUE ZEROS.      00050003
           05  XSRD060-PG-POG-ID           PIC 9(15)  VALUE ZEROS.      00060003
           05  XSRD060-XS-FLR-PAD-CDE      PIC X(02)  VALUE SPACES.     00070003
           05  XSRD060-PG-FLR-PAD-CDE      PIC X(02)  VALUE SPACES.     00080003
           05  XSRD060-XS-FIXT-LOC-NBR     PIC 9(15)  VALUE ZEROS.      00090003
           05  XSRD060-PG-FIXT-LOC-NBR     PIC 9(15)  VALUE ZEROS.      00100003
061107*    05  XSRD060-XS-POG-POSN-NBR     PIC 9(05)  VALUE ZEROS.      00110006
061107*    05  XSRD060-PG-POG-POSN-NBR     PIC 9(05)  VALUE ZEROS.      00120006
061107     05  XSRD060-XS-FIXT-OBJ-ID      PIC X(01)  VALUE ZEROS.      00121006
061107     05  XSRD060-PG-FIXT-NAME        PIC X(01)  VALUE ZEROS.      00122006
           05  XSRD060-XS-PSN-UNT-CAP-QTY  PIC 9(05)  VALUE ZEROS.      00130004
           05  XSRD060-PG-PSN-UNT-CAP-QTY  PIC 9(05)  VALUE ZEROS.      00140004
           05  FILLER                      PIC X(24)  VALUE SPACES.     00150006
