000100***************************************************************** 00001000
000200*    RECORD PURPOSE: INSERT RECORDS TO XST_RTV_LOC_RLTNSHP      * 00002000
000300*    RECORD LENGTH:  80 BYTES                                   * 00003000
000500*    RECORD FORMAT:  SEQUENTIAL                                 * 00004000
000600***************************************************************** 00005000
       01  XS151-RTV-REC.                                               00010000
           05  XS151-LOC-NBR                PIC  9(04).                 00020001
           05  FILLER                       PIC  X(01).                 00030000
           05  XS151-XFER-TYP               PIC  X(02).                 00040000
           05  FILLER                       PIC  X(01).                 00050000
           05  XS151-BEG-DTE                PIC  X(10).                 00060000
           05  FILLER                       PIC  X(01).                 00070000
           05  XS151-END-DTE                PIC  X(10).                 00080000
           05  FILLER                       PIC  X(01).                 00090000
           05  XS151-RTV-LOC-NBR            PIC  9(04).                 00100001
           05  FILLER                       PIC  X(46).                 00110000
