      ******************************************************************00010024
      **XS DOMAIN TABLE BMC UNLOAD LAYOUT FOR TABLE XST_VND_STYL        00020071
      ******************************************************************00030024
100704**DATE:10/04/2004 CHANGED BY:JULIE TEWES  ADD VS-DESC TO UNLOAD   00040073
      ******************************************************************00050073
         01  XSRD009-VNDSTYL-UNLOAD-FILE.                               00060072
             05  XSRD009-STYL-ID               PIC S9(08)V COMP-3.      00070072
             05  XSRD009-DEPT-NBR              PIC S9(04)V COMP-3.      00080072
             05  XSRD009-MAJ-CL-NBR            PIC S9(04)V COMP-3.      00090072
             05  XSRD009-SUB-CL-NBR            PIC S9(04)V COMP-3.      00100072
             05  XSRD009-VS-ID                 PIC S9(09)  COMP.        00110072
             05  XSRD009-VS-NBR                PIC  X(20).              00120072
             05  XSRD009-ENT-ID                PIC S9(09)  COMP.        00130072
             05  XSRD009-STKR-NBR              PIC S9(09)  COMP.        00140072
             05  XSRD009-RTL-CLSN-DESC         PIC  X(20).              00150072
             05  XSRD009-LBL-NM                PIC  X(20).              00160072
             05  XSRD009-ESL-IND               PIC  X(20).              00170072
             05  XSRD009-HNG-FOLD-DESC         PIC  X(20).              00180072
             05  XSRD009-VS-DESC               PIC  X(30).              00190073
