      ******************************************************************00010024
      **XS ERROR RECORD LAYOUT FOR TABLE XST_UPC                        00020076
      ******************************************************************00030024
         01  XSRD014-UPC-ERR-RECORD.                                    00040076
             05  XSRD014-XS-UPC-ID             PIC 9(10).               00050076
             05  XSRD014-VSM-UPC-ID            PIC 9(10).               00060076
             05  XSRD014-XS-INTRL-UPC-ID       PIC 9(10).               00070076
             05  XSRD014-VSM-INTRL-UPC-ID      PIC 9(10).               00080076
             05  XSRD014-XS-UPC-TYP-CDE        PIC X(01).               00090076
             05  XSRD014-VSM-UPC-TYP-CDE       PIC X(01).               00100076
             05  XSRD014-XS-UPC-NBR            PIC 9(15).               00110076
             05  XSRD014-VSM-UPC-NBR           PIC 9(15).               00120076
             05  FILLER                        PIC X(08).               00130076
