      ******************************************************************00010024
      **XS ERROR RECORD LAYOUT FOR TABLE XST_DEPT                       00020069
      ******************************************************************00030024
         01  XSRD006-DEPT-ERR-RECORD.                                   00040069
             05  XSRD006-XS-DEPT-NBR           PIC 9(04).               00050070
             05  XSRD006-VSM-DEPT-NBR          PIC 9(04).               00060070
             05  XSRD006-XS-BUS-GP-NBR         PIC 9(03).               00070070
             05  XSRD006-VSM-BUS-GP-NBR        PIC 9(03).               00080070
             05  XSRD006-XS-BUS-DEPT-NM        PIC X(20).               00090072
             05  XSRD006-VSM-BUS-DEPT-NM       PIC X(20).               00100072
             05  XSRD006-XS-MERCH-LNE-CDE      PIC X(01).               00110072
             05  XSRD006-VSM-MERCH-LEN-CDE     PIC X(01).               00120072
             05  XSRD006-XS-DMA-NBR            PIC 9(04).               00130071
             05  XSRD006-VSM-DMA-NBR           PIC 9(04).               00140071
             05  XSRD006-XS-STR-ZN-CDE         PIC X(05).               00150071
             05  XSRD006-VSM-STR-ZN-CDE        PIC X(05).               00160071
             05  XSRD006-XS-BYR-NBR            PIC 9(04).               00170071
             05  XSRD006-VSM-BYR-NBR           PIC 9(04).               00180071
             05  XSRD006-XS-CONT-CLR-EXCLN-IND PIC X(01).               00190071
             05  XSRD006-VSM-CON-CLR-EXCLN-IND PIC X(01).               00200071
             05  FILLER                        PIC X(80).               00210072
