000100***********************************************************       00010000
000200**                      XSRD026                          **       00020000
000300**                     LRECL=43                          **       00030003
000400**  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00040000
000500**  XST VND TABLE.                                       **       00050000
000600***********************************************************       00060000
       01  XS026-VND-UNLOAD.                                            00220003
           10 XS026-ENT-ID                  PIC  S9(9) COMP.            00230003
           10 XS026-ENT-NM-DESC             PIC   X(30).                00240003
           10 XS026-VND-NBR                 PIC   X(9).                 00250003
