      *---------------------------------------------------------------*         
      *                                                               *         
      *    XSRD077 - PERM PRICE CHANGE DELETE STORE GROUP MESSAGE     *         
      *              COPYBOOK                                         *         
      *                                                               *         
      *    LENGTH  - 92 to 430049 TOTAL BYTES                         *         
      *              43 BYTES OF HEADER DATA                          *         
      *              49 to 430006 BYTES OF DETAIL DATA                *         
      *                                                               *         
      *    NOTES:  - THIS COPYBOOK SHOULD BE KEPT IN SYNC WITH THE    *         
      *              XMRD006 COPYBOOK.                                *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR#27634   10/20/2004   INITIAL CREATION                   *         
      *---------------------------------------------------------------*         
       01  XS077-RECORD.                                                        
           05  XS077-BUSINESS-EVENT                   PIC X(30).                
               88  XS077-BE-DEL-PRIC-CHG-STR-GRP      VALUE                     
                   'DeletePriceChangeStoreGroup   '.                            
           05  XS077-REVISION                         PIC X(04).                
           05  XS077-MESSAGE-ID                       PIC 9(09).                
      *                                                                         
           05  XS077-DEL-PC-STR-GRP-DATA.                                       
               10  XS077-DEL-PC-SG-STR-GP-COUNT       PIC 9(06).                
               10  XS077-DEL-PC-SG-STORE-GROUP                                  
                       OCCURS 1 TO 10000 TIMES                                  
                       DEPENDING ON XS077-DEL-PC-SG-STR-GP-COUNT.               
      *            *** each occurance is 43 bytes of data   ***                 
                   15  XS077-DEL-PC-SG-STR-GP-TYP-CD  PIC 9(04).                
                   15  XS077-DEL-PC-SG-STR-GP-ID      PIC 9(04).                
                   15  XS077-DEL-PC-SG-PRCHG-ID       PIC 9(09).                
                   15  XS077-DEL-PC-SG-LAST-UPD-TMST  PIC X(26).                
