000100***********************************************************       00010000
000200**                      XSRD022                          **       00020000
000300**                     LRECL=231                         **       00030000
000400**  THIS COPYBOOK IS USED FOR NEW PROMO PRICING STORE    **       00040000
000500**  GROUP BUSINESS EVENT.                                **       00050000
000600***********************************************************       00060000
000700 01  XS022-PRICING-STR-GP-RECORD.                                 00070000
000800   05 XS022-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZERO.        00080000
000900   05 XS022-ACTION-CDE               PIC X(01) VALUE SPACES.      00090000
001000   05 XS022-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00100000
001100   05 XS022-PROMO-INTFC-ID           PIC 9(10) VALUE ZERO.        00110000
001200   05 XS022-MDSE-LNE-ID              PIC 9(10) VALUE ZERO.        00120000
001300   05 XS022-PROMO-PRIC-VER-ID        PIC 9(10) VALUE ZERO.        00130000
001400   05 XS022-STR-SELN-TYP-CDE         PIC X(01) VALUE SPACES.      00140000
001410   05 XS022-STR-SELN-HIER-LVL-CDE    PIC 9(02) VALUE ZERO.        00150000
001420   05 XS022-ADHC-STR-GP-ID           PIC 9(10) VALUE ZERO.        00160000
001430   05 XS022-STR-GP-TYP-CDE           PIC 9(04) VALUE ZERO.        00170000
001440   05 XS022-STR-GP-ID                PIC 9(04) VALUE ZERO.        00180000
001450   05 XS022-PRNT-OV-STR-SELN-CDE     PIC X(01) VALUE SPACES.      00190000
001460   05 XS022-PRNT-OV-STR-GP-CDE       PIC 9(04) VALUE ZERO.        00200000
001470   05 XS022-PRNT-OV-STR-GP-ID        PIC 9(04) VALUE ZERO.        00210000
001480   05 XS022-PRNT-ADHC-STR-GP-ID      PIC 9(10) VALUE ZERO.        00220000
001490   05 XS022-STRT-TMST                PIC X(26) VALUE SPACES.      00230000
001500   05 XS022-END-TMST                 PIC X(26) VALUE SPACES.      00240000
001600   05 XS022-ACT-STRT-TMST            PIC X(26) VALUE SPACES.      00250000
001700   05 XS022-ACT-END-TMST             PIC X(26) VALUE SPACES.      00260000
001800   05 XS022-ESL-TOPR-TYP-CDE         PIC X(03) VALUE SPACES.      00270000
001800   05 XS022-STAT-CDE                 PIC X(01) VALUE SPACES.      00271000
001900   05 XS022-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00272000
