      *---------------------------------------------------------------*         
      *                                                               *         
      *    XSRD073 - PERM PRICE CHANGE SUBMIT MESSAGE COPYBOOK        *         
      *                                                               *         
      *    LENGTH  - 456 to 1660226 TOTAL BYTES                       *         
      *              43 BYTES OF HEADER DATA                          *         
      *              413 to 1660183 BYTES OF DETAIL DATA              *         
      *                                                               *         
      *    NOTES:  - THIS COPYBOOK SHOULD BE KEPT IN SYNC WITH THE    *         
      *              XMRD002 COPYBOOK.                                *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR#27634   10/06/2004   INITIAL CREATION                   *         
      *---------------------------------------------------------------*         
       01  XS073-RECORD.                                                        
           05  XS073-BUSINESS-EVENT                   PIC X(30).                
               88  XS073-BE-SUBMIT-PRIC-CHG           VALUE                     
                   'SubmitPriceChange             '.                            
           05  XS073-REVISION                         PIC X(04).                
           05  XS073-MESSAGE-ID                       PIC 9(09).                
      *                                                                         
           05  XS073-SUBMIT-PRIC-CHG-DATA.                                      
               10  XS073-SUBMIT-PC-PRCHG-ID           PIC 9(09).                
               10  XS073-SUBMIT-PC-PRCHG-DESC         PIC X(30).                
               10  XS073-SUBMIT-PC-DEPT-NBR           PIC 9(04).                
               10  XS073-SUBMIT-PC-EVNT-CTG-CDE       PIC X(03).                
               10  XS073-SUBMIT-PC-PRCHG-TYP-CDE      PIC X(03).                
               10  XS073-SUBMIT-PC-PRCHG-ST-CDE       PIC X(03).                
               10  XS073-SUBMIT-PC-ALL-RMNG-STR       PIC X(01).                
               10  XS073-SUBMIT-PC-SUBM-BY-USR-ID     PIC X(08).                
               10  XS073-SUBMIT-PC-SUBMTD-TMST        PIC X(26).                
               10  XS073-SUBMIT-PC-APP-BY-USR-ID      PIC X(08).                
               10  XS073-SUBMIT-PC-APP-TMST           PIC X(26).                
               10  XS073-SUBMIT-PC-CRE-TMST           PIC X(26).                
               10  XS073-SUBMIT-PC-LAST-UPD-TMST      PIC X(26).                
               10  XS073-SUBMIT-PC-STR-GP-COUNT       PIC 9(04).                
               10  XS073-SUBMIT-PC-MDSE-COUNT         PIC 9(06).                
               10  XS073-SUBMIT-PC-STORE-GROUP                                  
                       OCCURS 1 TO 2000 TIMES                                   
                       DEPENDING ON XS073-SUBMIT-PC-STR-GP-COUNT.               
      *            *** each occurance is 80 bytes of data   ***                 
                   15  XS073-SUBMIT-SG-STR-GP-TYP-CD  PIC 9(04).                
                   15  XS073-SUBMIT-SG-STR-GP-ID      PIC 9(04).                
                   15  XS073-SUBMIT-SG-PRCHG-ID       PIC 9(09).                
                   15  XS073-SUBMIT-SG-EFF-DTE        PIC X(10).                
                   15  XS073-SUBMIT-SG-AUTO-CNT-IND   PIC X(01).                
                   15  XS073-SUBMIT-SG-CRE-TMST       PIC X(26).                
                   15  XS073-SUBMIT-SG-LAST-UPD-TMST  PIC X(26).                
               10  XS073-SUBMIT-PC-MERCHANDISE                                  
                       OCCURS 1 TO 10000 TIMES                                  
                       DEPENDING ON XS073-SUBMIT-PC-MDSE-COUNT.                 
      *            *** each occurance is 150 bytes of data  ***                 
                   15  XS073-SUBMIT-MDSE-STR-GP-TYP-C PIC 9(04).                
                   15  XS073-SUBMIT-MDSE-STR-GP-ID    PIC 9(04).                
                   15  XS073-SUBMIT-MDSE-PRCHG-ID     PIC 9(09).                
                   15  XS073-SUBMIT-MDSE-PCHG-MDSE-ID PIC 9(09).                
                   15  XS073-SUBMIT-MDSE-HIER-CDE     PIC X(03).                
                       88  XS073-SUBMIT-MDSE-HIER-DPT     VALUE 'DPT'.          
                       88  XS073-SUBMIT-MDSE-HIER-MCL     VALUE 'MCL'.          
                       88  XS073-SUBMIT-MDSE-HIER-SCL     VALUE 'SCL'.          
                       88  XS073-SUBMIT-MDSE-HIER-STY     VALUE 'STY'.          
                       88  XS073-SUBMIT-MDSE-HIER-SKU     VALUE 'SKU'.          
                   15  XS073-SUBMIT-MDSE-DEPT-NBR     PIC 9(04).                
                   15  XS073-SUBMIT-MDSE-MAJ-CL-NBR   PIC 9(04).                
                   15  XS073-SUBMIT-MDSE-SUB-CL-NBR   PIC 9(04).                
                   15  XS073-SUBMIT-MDSE-STYL-ID      PIC 9(08).                
                   15  XS073-SUBMIT-MDSE-SKU-NBR      PIC 9(08).                
                   15  XS073-SUBMIT-MDSE-UNT-RTL-AMT  PIC 9(07)V99.             
                   15  XS073-SUBMIT-MDSE-GP-PRIC-ID   PIC 9(09).                
                   15  XS073-SUBMIT-MDSE-GP-RTL-AMT   PIC 9(07)V99.             
                   15  XS073-SUBMIT-MDSE-GP-RTL-QTY   PIC 9(04).                
                   15  XS073-SUBMIT-MDSE-CLR-TYP-CDE  PIC X(01).                
                   15  XS073-SUBMIT-MDSE-PRCG-GRID-ID PIC 9(09).                
                   15  XS073-SUBMIT-MDSE-CRE-TMST     PIC X(26).                
                   15  XS073-SUBMIT-MDSE-LST-UPD-TMST PIC X(26).                
