      ******************************************************************00010024
      **XS DOMAIN TABLE BMC UNLOAD LAYOUT FOR TABLE XST_BUS_GP          00020067
      ******************************************************************00030024
         01  XSRD003-BUS-GP-UNLOAD-FILE.                                00040067
             05  XSRD003-BUS-GP-NBR            PIC S9(03)V COMP-3.      00050067
             05  XSRD003-BUS-AREA-ID           PIC S9(02)V COMP-3.      00060068
             05  XSRD003-BUS-AREA-DESC         PIC  X(25).              00070067
