      ***********************************************************       00010000
      **                      XSRD044                          **       00020000
W26114**                     LRECL=778                         **       00030001
      **  THIS COPYBOOK IS USED FOR NEW PROMO PRICE            **       00040000
      **  DETERMINATION.                                       **       00050000
      ***********************************************************       00060000
       01  XS044-PD-OUTPUT-RECORD.                                      00070000
         05 XS044-STORE                    PIC S9(04) VALUE +0 COMP.    00080000
         05 XS044-DATE                     PIC X(10) VALUE SPACES.      00090000
         05 XS044-TIME                     PIC X(08) VALUE SPACES.      00100000
         05 XS044-PROMO-ID                 PIC S9(10)V VALUE +0 COMP-3. 00110000
         05 XS044-INTR-UPC-ID              PIC S9(09) VALUE +0 COMP.    00120000
         05 XS044-SKU                      PIC S9(08)V VALUE +0 COMP-3. 00130000
         05 XS044-UPC-CDE                  PIC S9(15)V VALUE +0 COMP-3. 00140000
         05 XS044-INCL-UNAD-SW             PIC X(01) VALUE SPACES.      00150000
         05 XS044-INCL-PART-DAY-SW         PIC X(01) VALUE SPACES.      00160000
         05 XS044-INCL-GOLD-STR-SW         PIC X(01) VALUE SPACES.      00170000
         05 XS044-INCL-LWST-SIX-WK-SW      PIC X(01) VALUE SPACES.      00180000
         05 XS044-INCL-GP-PRC-SW           PIC X(01) VALUE SPACES.      00190000
         05 XS044-INCL-BWP-PROMO-SW        PIC X(01) VALUE SPACES.      00200000
         05 XS044-INCL-TIER-PROMO-SW       PIC X(01) VALUE SPACES.      00210000
         05 XS044-INCL-ADL-PCT-AMT-SW      PIC X(01) VALUE SPACES.      00220000
         05 XS044-CALLING-APPL-IDENT       PIC X(02) VALUE SPACES.      00230000
         05 XS044-RGLR-PRICE               PIC S9(07)V9(02)             00240000
                                                     VALUE +0 COMP-3.   00250000
         05 XS044-PD-PRICE                 PIC S9(07)V9(02)             00260000
                                                     VALUE +0 COMP-3.   00270000
         05 XS044-PD-PRICG-TYP-CDE         PIC X(03) VALUE SPACES.      00280000
         05 XS044-PD-PROMO-ID              PIC S9(10)V VALUE +0 COMP-3. 00290000
         05 XS044-PD-INTFC-ID              PIC S9(10)V VALUE +0 COMP-3. 00300000
         05 XS044-PD-MDSE-LNE-ID           PIC S9(10)V VALUE +0 COMP-3. 00310000
         05 XS044-PD-STRT-TMST             PIC X(26) VALUE SPACES.      00320000
         05 XS044-PD-END-TMST              PIC X(26) VALUE SPACES.      00330000
         05 XS044-REG-GP-QTY               PIC S9(04) VALUE +0 COMP.    00340000
         05 XS044-REG-GP-DLR               PIC S9(07)V9(02)             00350000
                                                     VALUE +0 COMP-3.   00360000
         05 XS044-PCT-OFF-GP-PRC-PCT       PIC S9(03)V9(03)             00370000
                                                     VALUE +0 COMP-3.   00380000
         05 XS044-PCT-OFF-GP-PRC-AMT       PIC S9(07)V9(02)             00390000
                                                     VALUE +0 COMP-3.   00400000
         05 XS044-PROMO-GP-PRICG-QTY       PIC S9(04) VALUE +0 COMP.    00410000
         05 XS044-PROMO-GP-PRICG-DLR       PIC S9(07)V9(02)             00420000
                                                     VALUE +0 COMP-3.   00430000
         05 XS044-GP-PRICG-TYP-CDE         PIC X(03) VALUE SPACES.      00440000
         05 XS044-GP-PROMO-ID              PIC S9(10)V VALUE +0 COMP-3. 00450000
         05 XS044-GP-INTFC-ID              PIC S9(10)V VALUE +0 COMP-3. 00460000
         05 XS044-GP-MDSE-LNE-ID           PIC S9(10)V VALUE +0 COMP-3. 00470000
         05 XS044-GP-STRT-TMST             PIC X(26) VALUE SPACES.      00480000
         05 XS044-GP-END-TMST              PIC X(26) VALUE SPACES.      00490000
         05 XS044-LWST-SIX-WEEK-PRC        PIC S9(07)V9(02)             00500000
                                                     VALUE +0 COMP-3.   00510000
         05 XS044-ADDL-PCT-OFF-DSCT-PCT    PIC S9(03)V9(03)             00520000
                                                     VALUE +0 COMP-3.   00530000
         05 XS044-ADDL-DLR-OFF-AMT         PIC S9(07)V9(02)             00540000
                                                     VALUE +0 COMP-3.   00550000
         05 XS044-ADDL-PRICG-TYP-CDE       PIC X(03) VALUE SPACES.      00560000
         05 XS044-ADDL-PROMO-ID            PIC S9(10)V VALUE +0 COMP-3. 00570000
         05 XS044-ADDL-INTFC-ID            PIC S9(10)V VALUE +0 COMP-3. 00580000
         05 XS044-ADDL-MDSE-LNE-ID         PIC S9(10)V VALUE +0 COMP-3. 00590000
         05 XS044-ADDL-STRT-TMST           PIC X(26) VALUE SPACES.      00600000
         05 XS044-ADDL-END-TMST            PIC X(26) VALUE SPACES.      00610000
         05 XS044-BWP-IND                  PIC X(01) VALUE SPACES.      00620000
            88 XS044-GWP                             VALUE 'G'.         00630000
            88 XS044-PWP                             VALUE 'P'.         00640000
         05 XS044-BWP-AMT                  PIC S9(07)V9(02)             00650000
                                                     VALUE +0 COMP-3.   00660000
         05 XS044-BWP-PRICG-TYP-CDE        PIC X(03) VALUE SPACES.      00670000
         05 XS044-BWP-PROMO-ID             PIC S9(10)V VALUE +0 COMP-3. 00680000
         05 XS044-BWP-INTFC-ID             PIC S9(10)V VALUE +0 COMP-3. 00690000
         05 XS044-BWP-MDSE-LNE-ID          PIC S9(10)V VALUE +0 COMP-3. 00700000
         05 XS044-BWP-INTFC-SUB-ID         PIC S9(10)V VALUE +0 COMP-3. 00710000
         05 XS044-BWP-STRT-TMST            PIC X(26) VALUE SPACES.      00720000
         05 XS044-BWP-END-TMST             PIC X(26) VALUE SPACES.      00730000
         05 XS044-TIER-PRICG-TYP-CDE       PIC X(03) VALUE SPACES.      00740000
         05 XS044-TIERED-PROMO-ID          PIC S9(10)V VALUE +0 COMP-3. 00750000
         05 XS044-TIERED-PROMO-INTFC-ID    PIC S9(10)V VALUE +0 COMP-3. 00760000
         05 XS044-TIERED-MDSE-LNE-ID       PIC S9(10)V VALUE +0 COMP-3. 00770000
         05 XS044-TIERED-STRT-TMST         PIC X(26) VALUE SPACES.      00780000
         05 XS044-TIERED-END-TMST          PIC X(26) VALUE SPACES.      00790000
         05 XS044-TIERED-ARRAY.                                         00800000
            10 FILLER                      OCCURS 10 TIMES              00810000
                                           INDEXED BY XS044-TIER-INDX.  00820000
               15 XS044-BUY-QTY            PIC S9(04) VALUE +0 COMP.    00830000
               15 XS044-BUY-DLR            PIC S9(07)V9(02)             00840000
                                                     VALUE +0 COMP-3.   00850000
               15 XS044-GET-PCT            PIC S9(03)V9(03)             00860000
                                                     VALUE +0 COMP-3.   00870000
               15 XS044-GET-DLR            PIC S9(07)V9(02)             00880000
                                                     VALUE +0 COMP-3.   00890000
               15 XS044-INTFC-SUB-ID                                    00900000
                                           PIC S9(10)V VALUE +0 COMP-3. 00910000
         05 XS044-EBOGO-PRICG-TYP-CDE      PIC X(03) VALUE SPACES.      00920000
         05 XS044-EBOGO-PROMO-ID           PIC S9(10)V VALUE +0 COMP-3. 00930000
         05 XS044-EBOGO-INTFC-ID           PIC S9(10)V VALUE +0 COMP-3. 00940000
         05 XS044-EBOGO-MDSE-LNE-ID        PIC S9(10)V VALUE +0 COMP-3. 00950000
         05 XS044-EBOGO-STRT-TMST          PIC X(26) VALUE SPACES.      00960000
         05 XS044-EBOGO-END-TMST           PIC X(26) VALUE SPACES.      00970000
W26114   05 XS044-EBOGO-DISC-QTY           PIC S9(04) COMP              00980000
W26114                                                VALUE +0.         00981000
W26114   05 XS044-EBOGO-DISC-AMT           PIC S9(07)V9(03)             00990000
W26114                                          VALUE +0 COMP-3.        01000000
