      ******************************************************************00010000
      **XS DOMAIN TABLE BMC UNLOAD LAYOUT FOR TABLE XST_SKU             00020000
      ******************************************************************00030000
         01  XSRD011-SKU-UNLOAD-FILE.                                   00040000
             05  XSRD011-INTR-UPC-ID           PIC S9(09) COMP.         00050000
             05  XSRD011-STYL-ID               PIC S9(08)V COMP-3.      00060000
             05  XSRD011-SKU-NBR               PIC S9(08)V COMP-3.      00070000
             05  XSRD011-SKU-DESC              PIC  X(30).              00080000
             05  XSRD011-KOHLS-SIZE-CDE        PIC S9(09) COMP.         00090000
             05  XSRD011-SIZE-DESC             PIC  X(10).              00100000
             05  XSRD011-NRF-CLOR-CDE          PIC  X(03).              00110000
             05  XSRD011-NRF-CLOR-DESC         PIC  X(10).              00120000
             05  XSRD011-CSTM-CLOR-DESC        PIC  X(10).              00130000
             05  XSRD011-REGN-PRIC-IND         PIC  X(01).              00140000
             05  XSRD011-TX-PRD-CDE-DESC       PIC  X(20).              00150000
             05  XSRD011-E-BUS-ITM-IND         PIC  X(01).              00160000
             05  XSRD011-E-BUS-PRD-GP-NBR      PIC S9(08)V COMP-3.      00170000
             05  XSRD011-WT-UM-CDE             PIC  X(02).              00180000
             05  XSRD011-WT-UM-QTY             PIC S9(05)V9(03) COMP-3. 00190000
             05  XSRD011-SIZE-UM-CDE           PIC  X(02).              00200000
             05  XSRD011-WD-UM-QTY             PIC S9(04)V9(03) COMP-3. 00210000
             05  XSRD011-HT-UM-QTY             PIC S9(04)V9(03) COMP-3. 00220000
             05  XSRD011-DPTH-UM-QTY           PIC S9(04)V9(03) COMP-3. 00230000
091004       05  XSRD011-CUSTFACG-CLOR-DESC    PIC  X(22).              00240000
091004       05  XSRD011-POG-IND               PIC  X(01).              00250000
             05  XSRD011-GP-CDE                PIC  X(03).              00260000
