000100*---------------------------------------------------------------* 00010000
000110*--THIS COPYBOOK IS PART OF MDO HISTORY TABLE CREATION - 2/10/10* 00011008
000120*---------------------------------------------------------------* 00012008
000200*-  THIS COPYBOOK IS FOR THE HISTORY TABLE EXTRACT FILE         * 00020001
000300*---------------------------------------------------------------* 00030001
000400 01 XS147-PERM-EXTRACT.                                           00040004
000410    05 XS147-PRCHG-ID-KEY               PIC  9(10) VALUE ZERO.    00041011
000411    05 XS147-STR-GP-TYP-CDE-K           PIC  9(04).               00041118
000412    05 XS147-STR-GP-ID-K                PIC  9(04).               00041218
000413    05 XS147-PRCHG-MDSE-ID-K            PIC  9(09).               00041321
000420    05 XS147-EVNT-CTG-CDE-KEY           PIC  X(03) VALUE SPACES.  00042011
000430    05 XS147-PRCHG-TYP-CDE-KEY          PIC  X(03) VALUE SPACES.  00043011
000431    05 XS147-TABLE-TYPE                 PIC  X(01).               00043109
000432       88 XS147-PRCHGH-TABLE            VALUE '1'.                00043219
000433       88 XS147-STRGP-PRCHG-TABLE       VALUE '2'.                00043319
000434       88 XS147-MDSE-PRCHG-TABLE        VALUE '3'.                00043419
000440    05 XS147-DETAIL-INFORMATION         PIC  X(135) VALUE SPACES. 00044019
000450    05 XS147-PRCHG-DATA REDEFINES XS147-DETAIL-INFORMATION.       00045004
000500*--- XST_PRCHG DATA                                               00050002
000600       10 XS147-PRCHG-ID                PIC  9(09).               00060006
000700       10 XS147-PRCHG-DESC              PIC  X(30).               00070006
000800       10 XS147-DEPT-NBR-PRCHG          PIC  9(04).               00080013
000900       10 XS147-EVNT-CTG-CDE            PIC  X(03).               00090006
001000       10 XS147-PRCHG-TYP-CDE           PIC  X(03).               00100006
001100       10 XS147-PRCHG-ST-CDE            PIC  X(03).               00110006
001200       10 XS147-ALL-RMNG-STR-IND        PIC  X(01).               00120006
001300       10 XS147-APP-TMST                PIC  X(26).               00130006
001400       10 XS147-SOR-LAST-UPD-TMST1      PIC  X(26).               00140009
001500       10 XS147-LAST-UPD-TMST1          PIC  X(26).               00150009
001600       10 XS147-LAST-ACTN-CDE1          PIC  X(01).               00160009
001610       10 XS147-PRCHG-SECT-FILLER       PIC  X(03).               00161018
001700*--- XST_STR_GP_PRCHG DATA                                        00170002
001710    05 XS147-PRCHG-STR-GP-DATA                                    00171004
001720                        REDEFINES XS147-DETAIL-INFORMATION.       00172004
001800       10 XS147-STR-GP-TYP-CDE          PIC  9(04).               00180006
001900       10 XS147-STR-GP-ID               PIC  9(04).               00190006
002000       10 XS147-PRCHG-ID-STRGP          PIC  9(09).               00200012
002100       10 XS147-PRCHG-EFF-DTE           PIC  X(10).               00210006
002200       10 XS147-OH-AUTO-CNT-IND         PIC  X(01).               00220006
002300       10 XS147-SOR-LAST-UPD-TMST2      PIC  X(26).               00230009
002400       10 XS147-LAST-UPD-TMST2          PIC  X(26).               00240009
002500       10 XS147-LAST-ACTN-CDE2          PIC  X(01).               00250009
002510       10 XS147-STRGP-SECT-FILLER       PIC  X(54).               00251018
002600*--- XST_PRCHG_MDSE DATA                                          00260002
002610    05 XS147-PRCHG-MDSE-DATA                                      00261004
002620                        REDEFINES XS147-DETAIL-INFORMATION.       00262004
002700       10 XS147-PRCHG-MDSE-ID           PIC  9(09).               00270006
002800       10 XS147-MDSE-HIER-CDE           PIC  X(03).               00280006
002900       10 XS147-DEPT-NBR                PIC  9(04).               00290006
002910       10 XS147-DEPT-NBR-NUL            REDEFINES                 00291015
002920          XS147-DEPT-NBR                PIC X(04).                00292016
003000       10 XS147-MAJ-CL-NBR              PIC  9(04).               00300006
003010       10 XS147-MAJ-CL-NBR-NUL          REDEFINES                 00301015
003020          XS147-MAJ-CL-NBR              PIC  X(04).               00302015
003100       10 XS147-SUB-CL-NBR              PIC  9(04).               00310006
003110       10 XS147-SUB-CL-NBR-NUL          REDEFINES                 00311015
003120          XS147-SUB-CL-NBR              PIC  X(04).               00312015
003200       10 XS147-STYL-ID                 PIC  9(08).               00320006
003210       10 XS147-STYL-ID-NUL             REDEFINES                 00321015
003220          XS147-STYL-ID                 PIC  X(08).               00322015
003300       10 XS147-SKU-NBR                 PIC  9(08).               00330006
003310       10 XS147-SKU-NBR-NUL             REDEFINES                 00331015
003320          XS147-SKU-NBR                 PIC  X(08).               00332015
003400       10 XS147-UNT-RTL-AMT             PIC  9(07)V9(2).          00340006
003410       10 XS147-UNT-RTL-AMT-NUL         REDEFINES                 00341017
003420          XS147-UNT-RTL-AMT             PIC  X(09).               00342015
003500       10 XS147-GP-PRIC-ID              PIC  9(09).               00350006
003510       10 XS147-GP-PRIC-ID-NUL          REDEFINES                 00351015
003520          XS147-GP-PRIC-ID              PIC  X(09).               00352015
003600       10 XS147-GP-RTL-QTY              PIC  9(04).               00360006
003610       10 XS147-GP-RTL-QTY-NUL          REDEFINES                 00361015
003620          XS147-GP-RTL-QTY              PIC  X(04).               00362015
003700       10 XS147-GP-RTL-AMT              PIC  9(07)V9(2).          00370006
003710       10 XS147-GP-RTL-AMT-NUL          REDEFINES                 00371015
003720          XS147-GP-RTL-AMT              PIC  X(09).               00372015
003800       10 XS147-CLR-TYP-CDE             PIC  X(01).               00380006
004000       10 XS147-SOR-LAST-UPD-TMST3      PIC  X(26).               00400009
004100       10 XS147-LAST-UPD-TMST3          PIC  X(26).               00410009
004200       10 XS147-LAST-ACTN-CDE3          PIC  X(01).               00420009
004300       10 XS147-MDSE-SECT-FILLER        PIC  X(10).               00430018
