000100***********************************************************       00010079
000200**                      XSRD036                          **       00020082
000300**                     LRECL=109                         **       00030087
000400**  THIS COPYBOOK IS RESERVED FOR THE TRANSLATE CODE     **       00040081
000500**  BUSINESS EVENT AS PART OF THE 'XS' DOMAIN ASSOCIATE  **       00050084
000510**  DATA MESSAGING PROJECT.                              **       00051084
000600***********************************************************       00060079
000700 01  XS036-TRANSLATE-CODE-RECORD.                                 00070082
000801   05  XS036-MSG-EVNT-ACTN          PIC X(06) VALUE SPACES.       00080184
000802   05  XS036-MSG-EVNT-NM            PIC X(13) VALUE SPACES.       00080284
000910   05  XS036-EFF-DTE                PIC X(10) VALUE SPACES.       00080386
000803   05  XS036-MAPPING-CDE            PIC X(04) VALUE SPACES.       00080487
000804   05  XS036-DESC-CDE               PIC X(10) VALUE SPACES.       00080787
000805   05  XS036-DESC-NM                PIC X(30) VALUE SPACES.       00081087
000804   05  XS036-ALT-KEY-1              PIC X(10) VALUE SPACES.       00082087
000910   05  XS036-SOR-LAST-MSG-TMST      PIC X(26) VALUE SPACES.       00091084
