000100***********************************************************       00010079
000200**                      XSRD015                          **       00020079
000300**                     LRECL=174                         **       00030079
000400**  THIS COPYBOOK IS USED FOR NEW PROMO ADEVENT BUSINESS **       00040079
000500**  EVENT.                                               **       00050079
000600***********************************************************       00060079
000700 01  XS015-ADEVENT-RECORD.                                        00070079
000800   05 XS015-BUSINESS-EVNT-ID         PIC 9(03) VALUE ZERO.        00080079
000900   05 XS015-ACTION-CDE               PIC X(01) VALUE SPACES.      00090079
001000   05 XS015-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00100079
001100   05 XS015-AD-EVNT-ID               PIC 9(10) VALUE ZERO.        00110079
001200   05 XS015-AD-EVNT-NBR-TXT          PIC X(15) VALUE SPACES.      00120079
001300   05 XS015-CPLT-NM                  PIC X(40) VALUE SPACES.      00130079
001400   05 XS015-STRT-DTE                 PIC X(26) VALUE SPACES.      00140079
001500   05 XS015-END-DTE                  PIC X(26) VALUE SPACES.      00150079
001600   05 XS015-STAT-CDE                 PIC X(01) VALUE SPACES.      00160079
001700   05 XS015-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00170079
