      ******************************************************************00010024
      **XS DOMAIN TABLE BMC UNLOAD LAYOUT FOR TABLE XST_MAJ_CL          00020067
      ******************************************************************00030024
         01  XSRD067-MAJCLASS-UNLOAD-FILE.                              00040068
             05  XSRD067-DEPT-NBR              PIC S9(04)V COMP-3.      00050067
             05  XSRD067-MAJ-CL-NBR            PIC S9(04)V COMP-3.      00060069
             05  XSRD067-MAJ-CL-NM             PIC  X(20).              00070067
