000100***********************************************************       00010007
000200**                      XSRD038                          **       00020014
000300**                     LRECL=80                          **       00030014
000310** THIS COPYBOOK WILL DEFINE THE LAYOUT OF THE CONTROL   **       00031016
000320** CARD USED BY THE 'XS' DOMAIN PROMO DATA ERROR READER. **       00032016
000330** THE CONTROL CARD INDICATES WHAT SOURCE THE INPUT DATA **       00033016
000340** SHOULD COME FROM(ERROR QUEUE, FLAT LOG FILE, OR BOTH) **       00034016
000900***********************************************************       00090001
000910 01  XS038-CC-CONTROL-CARD.                                       00091014
000920   05 XS038-CC-CONTROL-CARD-DISPLY.                               00092014
000930      10 XS038-CC-NAME               PIC X(37) VALUE SPACES.      00093014
000940         88 XS038-CC-VALID-NAME                VALUE              00094014
000950             'PROMO ERROR PROCESSING DATA SOURCE = '.             00095014
000970      10 XS038-CC-DATA-SOURCE        PIC X(01) VALUE SPACES.      00097014
000971         88 XS038-CC-SOURCE-QUEUE              VALUE 'Q'.         00097114
000972         88 XS038-CC-SOURCE-LOG                VALUE 'L'.         00097214
000973         88 XS038-CC-SOURCE-QUEUE-LOG          VALUE 'B'.         00097314
000980   05 FILLER                         PIC X(42) VALUE SPACES.      00098014
