      ******************************************************************00010000
      **XS ERROR RECORD LAYOUT FOR TABLE XST_SKU                        00020000
      ******************************************************************00030000
         01  XSRD012-SKU-ERR-RECORD.                                    00040000
             05  XSRD012-XS-INTRL-UPC-ID       PIC 9(10).               00050000
             05  XSRD012-VSM-INTRL-UPC-ID      PIC 9(10).               00060000
             05  XSRD012-XS-STYL-ID            PIC 9(08).               00070000
             05  XSRD012-VSM-STYL-ID           PIC 9(08).               00080000
             05  XSRD012-XS-SKU-NBR            PIC 9(10).               00090000
             05  XSRD012-VSM-SKU-NBR           PIC 9(10).               00100000
             05  XSRD012-XS-SKU-DESC           PIC X(30).               00110000
             05  XSRD012-VSM-SKU-DESC          PIC X(30).               00120000
             05  XSRD012-XS-KOHLS-SIZE-CDE     PIC 9(10).               00130000
             05  XSRD012-VSM-KOHLS-SIZE-CDE    PIC 9(10).               00140000
             05  XSRD012-XS-SIZE-DESC          PIC X(10).               00150000
             05  XSRD012-VSM-SIZE-DESC         PIC X(10).               00160000
             05  XSRD012-XS-NRF-CLOR-CDE       PIC X(03).               00170000
             05  XSRD012-VSM-NRF-CLOR-CDE      PIC X(03).               00180000
             05  XSRD012-XS-NRF-CLOR-DESC      PIC X(10).               00190000
             05  XSRD012-VSM-NRF-CLOR-DESC     PIC X(10).               00200000
             05  XSRD012-XS-CSTM-CLOR-DESC     PIC X(10).               00210000
             05  XSRD012-VSM-CSTM-CLOR-DESC    PIC X(10).               00220000
             05  XSRD012-XS-REGN-PRIC-IND      PIC X(01).               00230000
             05  XSRD012-VSM-REGN-PRIC-IND     PIC X(01).               00240000
             05  XSRD012-XS-TX-PRD-CDE-DESC    PIC X(20).               00250000
             05  XSRD012-VSM-TX-PRD-CDE-DESC   PIC X(20).               00260000
             05  XSRD012-XS-E-BUS-ITM-IND      PIC X(01).               00270000
             05  XSRD012-VSM-E-BUS-ITM-IND     PIC X(01).               00280000
             05  XSRD012-XS-E-BUS-PRD-GRP-NBR  PIC 9(08).               00290000
             05  XSRD012-VSM-E-BUS-PRD-GRP-NBR PIC 9(08).               00300000
             05  XSRD012-XS-WT-UM-CDE          PIC X(02).               00310000
             05  XSRD012-VSM-WT-UM-CDE         PIC X(02).               00320000
             05  XSRD012-XS-WT-UM-QTY          PIC 9(05)V9(03).         00330000
             05  XSRD012-VSM-WT-UM-QTY         PIC 9(05)V9(03).         00340000
             05  XSRD012-XS-SIZE-UM-CDE        PIC X(02).               00350000
             05  XSRD012-VSM-SIZE-UM-CDE       PIC X(02).               00360000
             05  XSRD012-XS-WD-UM-QTY          PIC 9(04)V9(03).         00370000
             05  XSRD012-VSM-WD-UM-QTY         PIC 9(04)V9(03).         00380000
             05  XSRD012-XS-HT-UM-QTY          PIC 9(04)V9(03).         00390000
             05  XSRD012-VSM-HT-UM-QTY         PIC 9(04)V9(03).         00400000
             05  XSRD012-XS-DPTH-UM-QTY        PIC 9(04)V9(03).         00410000
             05  XSRD012-VSM-DPTH-UM-QTY       PIC 9(04)V9(03).         00420000
091004       05  XSRD012-XS-CUSTFACG-CLOR-DESC PIC X(22).               00430000
091004       05  XSRD012-VSM-CUSTFACG-CLOR-DESC                         00440000
091004                                         PIC X(22).               00450000
091004       05  XSRD012-XS-POG-IND            PIC X(01).               00460000
091004       05  XSRD012-VSM-POG-IND           PIC X(01).               00470000
             05  XSRD012-XS-GP-CDE             PIC X(03).               00480000
             05  XSRD012-VSM-GP-CDE            PIC X(03).               00490001
