      ******************************************************************00010024
      **XS DOMAIN TABLE BMC UNLOAD LAYOUT FOR TABLE XST_UPC             00020074
      ******************************************************************00030024
         01  XSRD013-UPC-UNLOAD-FILE.                                   00040074
             05  XSRD013-UPC-ID                PIC S9(09) COMP.         00050075
             05  XSRD013-INTR-UPC-ID           PIC S9(09) COMP.         00060075
             05  XSRD013-UPC-TYP-CDE           PIC  X(01).              00070075
             05  XSRD013-UPC-NBR               PIC S9(15)V COMP-3.      00080075
