000100***********************************************************       00010000
000200**                      XSRD028                          **       00020001
000300**                     LRECL=119                         **       00030009
000400**  THIS COPYBOOK IS THE LAYOUT OF THE BMC UNLOAD OF THE **       00040000
000500**  XST SKU LOC TABLE.                                   **       00050001
000600***********************************************************       00060000
       01  XS028-SKU-LOC-UNLOAD.                                        00320002
           10 XS028-INTR-UPC-ID             PIC  S9(9)      COMP.       00330002
           10 XS028-LOC-NBR                 PIC  S9(4)      COMP.       00340002
           10 XS028-BEG-TMST                PIC   X(26).                00350002
           10 XS028-BEG-TMST-PARTS REDEFINES XS028-BEG-TMST.            00351003
              15 XS028-BEG-DATE             PIC   X(10).                00352003
              15 FILLER                     PIC   X.                    00353003
              15 XS028-BEG-TIME             PIC   X(15).                00354003
           10 XS028-END-TMST                PIC   X(26).                00360004
           10 XS028-END-TMST-NULL           PIC   X.                    00361005
              88 XS028-END-TMST-IS-NULL           VALUE '?'.            00362006
           10 XS028-UNT-RTL-AMT             PIC  S9(7)V9(2) COMP-3.     00370002
           10 XS028-UNT-COST-AMT            PIC  S9(7)V9(3) COMP-3.     00380002
           10 XS028-LOC-SKU-STAT-CDE        PIC   X(2).                 00390002
           10 XS028-UPC-STAT-CHG-DTE        PIC   X(10).                00400002
           10 XS028-UNT-RTL-CHG-DTE         PIC   X(10).                00410002
           10 XS028-GP-PRIC-ID              PIC  S9(9)      COMP.       00420002
           10 XS028-GP-PRIC-ID-NULL         PIC  X.                     00421005
              88 XS028-GP-PRIC-ID-IS-NULL         VALUE '?'.            00422006
           10 XS028-GP-RTL-QTY              PIC  S9(4)      COMP.       00430002
           10 XS028-GP-RTL-QTY-NULL         PIC  X.                     00431005
              88 XS028-GP-RTL-QTY-IS-NULL         VALUE '?'.            00432006
           10 XS028-GP-RTL-AMT              PIC  S9(7)V9(2) COMP-3.     00440002
           10 XS028-GP-RTL-AMT-NULL         PIC  X.                     00450005
              88 XS028-GP-RTL-AMT-IS-NULL         VALUE '?'.            00460007
           10 XS028-MKDN-CDE                PIC  X.                     00470009
              88 XS028-MKDN-CDE-MARK1             VALUE '1'.            00480008
              88 XS028-MKDN-CDE-MARK2             VALUE '2'.            00490008
              88 XS028-MKDN-CDE-FINAL             VALUE 'F'.            00500008
           10 XS028-MKDN-CDE-NULL           PIC  X.                     00511009
              88 XS028-MKDN-CDE-IS-NULL           VALUE '?'.            00512009
           10 XS028-ORIG-CLR-DTE            PIC  X(10).                 00520009
           10 XS028-ORIG-CLR-DTE-NULL       PIC  X.                     00530009
              88 XS028-ORIG-CLR-DTE-IS-NULL       VALUE '?'.            00540009
