      ***********************************************************       00010003
      **XS UNLOAD RECORD LAYOUT FOR TABLE XST_POG_POSN                  00020004
      ***********************************************************       00030003
061107* 06/11/07 DAVE WELLER WR31875                                    00031008
      ***********************************************************       00032008
       01  XSRD065-POG-POSN-UNLD-RECORD.                                00040006
           05  XSRD065-POG-ID              PIC S9(09) COMP VALUE ZEROS. 00050005
           05  XSRD065-FLR-PAD-CDE         PIC X(02)       VALUE SPACES.00060005
           05  XSRD065-FIXT-LOC-NBR        PIC S9(09) COMP VALUE ZEROS. 00070005
061107*    05  XSRD065-POG-POSN-NBR        PIC S9(04) COMP VALUE ZEROS. 00080008
061107     05  XSRD065-FIXT-OBJ-ID         PIC X(01)       VALUE SPACE. 00081008
           05  XSRD065-PSN-UNT-CAP-QTY     PIC S9(04) COMP VALUE ZEROS. 00090005
           05  FILLER                      PIC X(37)       VALUE SPACES.00100008
