      ******************************************************************        
      **XS DOMAIN SKU LOC MISMATCH ERROR REPORT FILE LAYOUT                     
      ******************************************************************        
         01  XSRD999-SKU-LOC-ERROR-FILE.                                        
             05  FILLER                        PIC X(02).                       
             05  XSRD999-UPC-ID                PIC Z(10).                       
             05  FILLER                        PIC X(01).                       
             05  XSRD999-STR-NBR               PIC X(05).                       
             05  FILLER                        PIC X(122).                      
             05  XSRD999-ERR-MSG               PIC X(18).                       
             05  FILLER                        PIC X(43).                       
