000100***********************************************************       00010000
000200**                      XSRD046                          **       00020001
000300**                     LRECL=80                          **       00030001
000400**  THIS COPYBOOK IS THE LAYOUT FOR CONTROL CARDS USED   **       00040001
000500**  BY THE XS DOMAIN INTEGRITY PROCESS TO INDICATE WHICH **       00050001
000500**  RECORD NUMBER TO START CHECKING AT AND HOW MANY      **       00051001
000500**  RECORDS TO SKIP BEFORE CHECKING AGAIN.               **       00052001
000600***********************************************************       00060000
       01  XS046-CONTROL-CARD.                                          00280001
           05  XS046-START-POINT               PIC 9(05) VALUE ZEROS.   00290001
           05  FILLER                          PIC X(01) VALUE SPACES.  00300001
           05  XS046-READ-FREQUENCY            PIC 9(05) VALUE ZEROS.   00310001
           05  FILLER                          PIC X(69) VALUE SPACES.  00320001
