      ***************************************************************   00010000
      **                      XSRD047                              **   00020000
      **  XS047-PRICE-DETERMINATION     LRECL = 840                **   00030015
      **  XS047-COMMAREA                LRECL = 1                  **   00031013
      **  THIS COPYBOOK IS THE LAYOUT FOR THE PRICE DETERMINATION. **   00040000
      ***************************************************************   00053000
       01  XS047-PRICE-DETERMINATION.                                   00057100
           05  XS047-STR                      PIC 9(05).                00057200
           05  XS047-DTE                      PIC X(10).                00057300
           05  XS047-TM                       PIC X(08).                00057400
           05  XS047-PROMO-ID                 PIC 9(10).                00058000
           05  XS047-INTR-UPC-ID              PIC 9(10).                00059100
           05  XS047-SKU                      PIC 9(08).                00060000
           05  XS047-UPC                      PIC 9(15).                00070000
           05  XS047-INCLD-UNADVERTISED-SW    PIC X(01).                00080000
           05  XS047-INCLD-PARTIAL-DAY-SW     PIC X(01).                00090000
           05  XS047-INCLD-GOLDSTAR-SW        PIC X(01).                00100000
           05  XS047-INCLD-LST-SIX-WK-PRIC-SW PIC X(01).                00110000
           05  XS047-INCLD-PROMO-GRP-PRIC-SW  PIC X(01).                00120000
           05  XS047-INCLD-GWP-PWP-PROMO-SW   PIC X(01).                00130000
           05  XS047-INCLD-TIERED-PROMO-SW    PIC X(01).                00140000
           05  XS047-INCLD-ADD-PCT-AMT-OFF-SW PIC X(01).                00150000
           05  XS047-CALLING-APPL-IDENTIFIER  PIC X(02).                00160000
           05  XS047-SUCCESSFUL-COMPLETE-IND  PIC X(01).                00170000
           05  XS047-INVALID-INPUT-CODE       PIC X(01).                00180000
           05  XS047-ERROR-SQL-CODE           PIC 9(05).                00190000
           05  XS047-ERROR-SECTION-NAME       PIC X(32).                00200000
           05  XS047-RGLR-PRICE               PIC 9(07)V9(02).          00210000
           05  XS047-PRICE-DET-PRICE          PIC 9(07)V9(02).          00230000
           05  XS047-PRICE-DET-PRICG-TYP-CDE  PIC X(03).                00250000
           05  XS047-PRICE-DET-PROMO-ID       PIC 9(10).                00260000
           05  XS047-PRICE-DET-STRT-TMST      PIC X(26).                00261012
           05  XS047-PRICE-DET-END-TMST       PIC X(26).                00262012
           05  XS047-REG-GRP-PRICG-QTY        PIC 9(05).                00270000
           05  XS047-REG-GRP-PRICG-DLR        PIC 9(07)V9(02).          00280000
           05  XS047-PCT-OFF-REG-GRP-PRIC-PCT PIC 9(03)V9(03).          00300000
           05  XS047-PCT-OFF-REG-GRP-PRIC-AMT PIC 9(07)V9(02).          00320000
           05  XS047-PROMO-GRP-PRICG-QTY      PIC 9(05).                00340000
           05  XS047-PROMO-GRP-PRICG-DLR      PIC 9(07)V9(02).          00350000
           05  XS047-PROMO-GRP-PRICG-TYP-CDE  PIC X(03).                00370000
           05  XS047-PROMO-GRP-PROMO-ID       PIC 9(10).                00380000
           05  XS047-PROMO-GRP-STRT-TMST      PIC X(26).                00381012
           05  XS047-PROMO-GRP-END-TMST       PIC X(26).                00382012
           05  XS047-LWST-SIX-WEEK-PRICE      PIC 9(07)V9(02).          00390000
           05  XS047-ADDL-PCT-OFF-DISC-PCT    PIC 9(03)V9(03).          00410000
           05  XS047-ADDL-DLR-OFF-AMT         PIC 9(07)V9(02).          00430000
           05  XS047-ADD-PCT-DLR-PRIC-TYP-CDE PIC X(03).                00450000
           05  XS047-ADDL-PCT-DLR-PROMO-ID    PIC 9(10).                00460000
           05  XS047-ADDL-PCT-DLR-STRT-TMST   PIC X(26).                00461012
           05  XS047-ADDL-PCT-DLR-END-TMST    PIC X(26).                00462012
           05  XS047-GWP-PWP-IND              PIC X(01).                00470000
           05  XS047-GWP-PWP-AMT              PIC 9(07)V9(02).          00480000
           05  XS047-GWP-PWP-PRICG-TYP-CDE    PIC X(03).                00500000
           05  XS047-GWP-PWP-PROMO-ID         PIC 9(10).                00510000
           05  XS047-GWP-PWP-STRT-TMST        PIC X(26).                00511012
           05  XS047-GWP-PWP-END-TMST         PIC X(26).                00512012
           05  XS047-TIERED-PRICG-TYP-CDE     PIC X(03).                00520000
           05  XS047-TIERED-PROMO-ID          PIC 9(10).                00530000
           05  XS047-TIERED-STRT-TMST         PIC X(26).                00531012
           05  XS047-TIERED-END-TMST          PIC X(26).                00532012
           05  XS047-TIERED-ARRAY.                                      00540000
               10  FILLER                     OCCURS 10 TIMES           00550000
                                   INDEXED BY XS047-TIER-INDEX.         00560000
                   15  XS047-BUY-QTY          PIC 9(05).                00570000
                   15  XS047-BUY-DLR          PIC 9(07)V9(02).          00580000
                   15  XS047-GET-PCT          PIC 9(03)V9(03).          00600000
                   15  XS047-GET-DLR          PIC 9(07)V9(02).          00620000
           05  XS047-EBOGO-PRICG-TYP-CDE      PIC X(03).                00621014
           05  XS047-EBOGO-PROMO-ID           PIC 9(10).                00622014
           05  XS047-EBOGO-STRT-TMST          PIC X(26).                00628014
           05  XS047-EBOGO-END-TMST           PIC X(26).                00629014
           05  XS047-EBOGO-PRICG-QTY          PIC 9(05).                00629115
           05  XS047-EBOGO-DISC-PRICG-AMT     PIC 9(07)V9(03).          00629215
       01  XS047-COMMAREA                     PIC X(01).                00630009
