000100***********************************************************       00010078
000200**                      XSRD019                          **       00020078
000300**                     LRECL=258                         **       00030090
000400**  THIS COPYBOOK IS USED FOR NEW PROMO PRICING          **       00040078
000500**  BUSINESS EVENT.                                      **       00050078
000600***********************************************************       00060084
000700 01  XS019-PRICING-RECORD.                                        00070085
000800   05 XS019-BUSINESS-EVNT-ID         PIC 9(03) VALUE 0.           00080085
000900   05 XS019-ACTION-CDE               PIC X(01) VALUE SPACE.       00090085
001000   05 XS019-BUSINESS-EVNT-CRE-TMST   PIC X(26) VALUE SPACES.      00100085
001100   05 XS019-PROMO-INTFC-ID           PIC 9(10) VALUE 0.           00110085
001200   05 XS019-PROMO-INTFC-SUB-ID       PIC 9(10) VALUE 0.           00120085
001300   05 XS019-PRICG-TYP-CDE            PIC X(03) VALUE SPACES.      00130085
001400   05 XS019-PROMO-ID                 PIC 9(10) VALUE 0.           00140089
001500   05 XS019-PROMO-ITM-ID             PIC 9(10) VALUE 0.           00150089
001600   05 XS019-MDSE-LNE-ID              PIC 9(10) VALUE 0.           00160089
001700   05 XS019-MDSE-HIER-CDE            PIC X(03) VALUE SPACES.      00170089
001800   05 XS019-DEPT-NBR                 PIC 9(04) VALUE 0.           00180089
001900   05 XS019-MAJ-CL-NBR               PIC 9(04) VALUE 0.           00190089
002000   05 XS019-SUB-CL-NBR               PIC 9(04) VALUE 0.           00200089
002100   05 XS019-STYLE-ID                 PIC 9(08) VALUE 0.           00210089
002200   05 XS019-SKU-NBR                  PIC 9(08) VALUE 0.           00220089
002210   05 XS019-ADV-IND                  PIC X(01) VALUE SPACE.       00221089
002220   05 XS019-CLRNC-TYP-CDE            PIC X(01) VALUE SPACE.       00222089
002230   05 XS019-PRICG-AMT                PIC 9(07).9(03)              00223089
002240                                               VALUE ZERO.        00224089
002250   05 XS019-GP-QTY                   PIC 9(05) VALUE 0.           00225089
002260   05 XS019-GP-AMT                   PIC 9(07).9(02)              00226089
002270                                               VALUE ZERO.        00227089
002280   05 XS019-THRS-QTY                 PIC 9(05) VALUE 0.           00228089
002290   05 XS019-THRS-AMT                 PIC 9(07).9(02)              00229089
002300                                               VALUE ZERO.        00230089
002400   05 XS019-DISC-AMT                 PIC 9(07).9(02)              00240089
002500                                               VALUE ZERO.        00250089
002600   05 XS019-DISC-PCT                 PIC 9(03).9(03)              00260089
002700                                               VALUE ZERO.        00270089
002800   05 XS019-RCPT-CMMT-TXT            PIC X(40) VALUE SPACES.      00280089
002900   05 XS019-BUY-THRS-AMT             PIC 9(07).9(03)              00290089
003000                                               VALUE ZERO.        00300089
003100   05 XS019-MUST-BUY-ALL-IND         PIC X(01) VALUE SPACE.       00310089
003200   05 XS019-RPETG-BWP-IND            PIC X(01) VALUE SPACE.       00320089
003300   05 XS019-ASSN-LVL-CDE             PIC X(01) VALUE SPACE.       00330089
003310   05 XS019-ESL-TOPR-TYP             PIC X(03) VALUE SPACES.      00331092
003400   05 XS019-STAT-CDE                 PIC X(01) VALUE SPACE.       00340089
003500   05 XS019-LAST-UPD-TMST            PIC X(26) VALUE SPACES.      00350089
