000100***********************************************************       00010000
000200**                      XSRD043                          **       00020000
000300**                     LRECL=66                                   00030004
000400**  THIS COPYBOOK IS USED FOR NEW PROMO PRICE            **       00040000
000500**  DETERMINATION.                                       **       00050000
000600***********************************************************       00060000
000700 01  XS043-PD-HEADER-RECORD.                                      00070000
000800   05 XS043-RECORD-TYPE              PIC X(01) VALUE SPACES.      00080000
000900   05 XS043-STORE                    PIC S9(04) VALUE +0 COMP.    00090000
001300   05 XS043-INTR-UPC-ID              PIC S9(09) VALUE +0 COMP.    00091002
001000   05 XS043-DATE                     PIC X(10) VALUE SPACES.      00100000
001100   05 XS043-TIME                     PIC X(08) VALUE SPACES.      00110000
001200   05 XS043-PROMO-ID                 PIC S9(10)V VALUE +0 COMP-3. 00120000
001400   05 XS043-SKU                      PIC S9(08)V VALUE +0 COMP-3. 00140000
001410   05 XS043-UPC-CDE                  PIC S9(15)V VALUE +0 COMP-3. 00141000
001500   05 XS043-INCL-UNAD-SW             PIC X(01) VALUE SPACES.      00150000
001600   05 XS043-INCL-PART-DAY-SW         PIC X(01) VALUE SPACES.      00160000
001610   05 XS043-INCL-GOLD-STR-SW         PIC X(01) VALUE SPACES.      00161000
001620   05 XS043-INCL-LWST-SIX-WK-SW      PIC X(01) VALUE SPACES.      00162000
001630   05 XS043-INCL-GP-PRC-SW           PIC X(01) VALUE SPACES.      00163000
001640   05 XS043-INCL-BWP-PROMO-SW        PIC X(01) VALUE SPACES.      00164000
001650   05 XS043-INCL-TIERED-PROMO-SW     PIC X(01) VALUE SPACES.      00165000
001660   05 XS043-INCL-ADDL-PCT-AMT-SW     PIC X(01) VALUE SPACES.      00166000
001670   05 XS043-CALLING-APPL-IDENT       PIC X(02) VALUE SPACES.      00167000
001700   05 XS043-RGLR-PRICE               PIC S9(07)V9(02)             00170000
001710                                               VALUE +0 COMP-3.   00171000
001711   05 XS043-REG-GP-QTY               PIC S9(04) VALUE +0 COMP.    00171100
001712   05 XS043-REG-GP-DLR               PIC S9(07)V9(02)             00171200
001713                                               VALUE +0 COMP-3.   00171300
