00001 ******************************************************************09/07/99
00002 *    XSRD130 - XST_SKU_LOC PURGE FILE LAYOUT - 059 BYTES          XSRD130 
00003 ******************************************************************   LV001
00006  01  XS130-XST-SKU-LOC-PRGE-REC.                                          
00005      05  XS130-XST-SKU-LOC-DATA.                                          
00005          10  XS130-SKU-LOC-UPC-ID       PIC  S9(9) COMP.                  
00005          10  XS130-SKU-LOC-STR-NBR      PIC  S9(4) COMP.                  
00005          10  XS130-SKU-LOC-EFF-BEG-TMST PIC  X(26).                       
00005          10  XS130-SKU-LOC-EFF-END-TMST PIC  X(26).                       
