      ******************************************************************00010024
      **XS DOMAIN TABLE BMC UNLOAD LAYOUT FOR TABLE XST_BUS_AREA        00020065
      ******************************************************************00030024
         01  XSRD001-BUS-AREA-UNLOAD-FILE.                              00040065
             05  XSRD001-BUS-AREA-ID           PIC S9(02)V COMP-3.      00050066
             05  XSRD001-BUS-AREA-DESC         PIC  X(25).              00060066
