      *---------------------------------------------------------------*         
      *                                                               *         
      *    XSRD075 - PERM PRICE CHANGE SUBMIT CONTINUED MESSAGE       *         
      *              COPYBOOK                                         *         
      *                                                               *         
      *    LENGTH  - 199 to 1500049 TOTAL BYTES                       *         
      *              43 BYTES OF HEADER DATA                          *         
      *              156 to 1500006 BYTES OF DETAIL DATA              *         
      *                                                               *         
      *    NOTES:  - THIS COPYBOOK SHOULD BE KEPT IN SYNC WITH THE    *         
      *              XMRD004 COPYBOOK.                                *         
      *                                                               *         
      *    WR/PITS#     DATE        DESCRIPTION                       *         
      *    --------   ----------   -----------------------------      *         
      *    WR#27634   10/11/2004   INITIAL CREATION                   *         
      *---------------------------------------------------------------*         
       01  XS075-RECORD.                                                        
           05  XS075-BUSINESS-EVENT                   PIC X(30).                
               88  XS075-BE-SUBMIT-PRIC-CHG-CONT      VALUE                     
                   'SubmitPriceChangeContinued    '.                            
           05  XS075-REVISION                         PIC X(04).                
           05  XS075-MESSAGE-ID                       PIC 9(09).                
      *                                                                         
           05  XS075-SUBMIT-MDSE-DATA.                                          
               10  XS075-SUBMIT-PC-MDSE-COUNT         PIC 9(06).                
               10  XS075-SUBMIT-PC-MERCHANDISE                                  
                       OCCURS 1 TO 10000 TIMES                                  
                       DEPENDING ON XS075-SUBMIT-PC-MDSE-COUNT.                 
      *            *** each occurance is 150 bytes of data   ***                
                   15  XS075-SUBMIT-MDSE-STR-GP-TYP-C PIC 9(04).                
                   15  XS075-SUBMIT-MDSE-STR-GP-ID    PIC 9(04).                
                   15  XS075-SUBMIT-MDSE-PRCHG-ID     PIC 9(09).                
                   15  XS075-SUBMIT-MDSE-PCHG-MDSE-ID PIC 9(09).                
                   15  XS075-SUBMIT-MDSE-HIER-CDE     PIC X(03).                
                       88  XS075-SUBMIT-MDSE-HIER-DPT     VALUE 'DPT'.          
                       88  XS075-SUBMIT-MDSE-HIER-MCL     VALUE 'MCL'.          
                       88  XS075-SUBMIT-MDSE-HIER-SCL     VALUE 'SCL'.          
                       88  XS075-SUBMIT-MDSE-HIER-STY     VALUE 'STY'.          
                       88  XS075-SUBMIT-MDSE-HIER-SKU     VALUE 'SKU'.          
                   15  XS075-SUBMIT-MDSE-DEPT-NBR     PIC 9(04).                
                   15  XS075-SUBMIT-MDSE-MAJ-CL-NBR   PIC 9(04).                
                   15  XS075-SUBMIT-MDSE-SUB-CL-NBR   PIC 9(04).                
                   15  XS075-SUBMIT-MDSE-STYL-ID      PIC 9(08).                
                   15  XS075-SUBMIT-MDSE-SKU-NBR      PIC 9(08).                
                   15  XS075-SUBMIT-MDSE-UNT-RTL-AMT  PIC 9(07)V99.             
                   15  XS075-SUBMIT-MDSE-GP-PRIC-ID   PIC 9(09).                
                   15  XS075-SUBMIT-MDSE-GP-RTL-AMT   PIC 9(07)V99.             
                   15  XS075-SUBMIT-MDSE-GP-RTL-QTY   PIC 9(04).                
                   15  XS075-SUBMIT-MDSE-CLR-TYP-CDE  PIC X(01).                
                   15  XS075-SUBMIT-MDSE-PRCG-GRID-ID PIC 9(09).                
                   15  XS075-SUBMIT-MDSE-CRE-TMST     PIC X(26).                
                   15  XS075-SUBMIT-MDSE-LST-UPD-TMST PIC X(26).                
