      ***************************************************************** 00001000
      **COPYBOOK USED FOR CICS PROGRAMS TO RETRIEVE INTRANSIT, FASHION  00002000
      **         SALES ONHAND AND STORE ONHAND.                         00003000
      ***************************************************************** 00004000
      **DATE:05/21/2004 CHANGED BY: DAVE WELLER  INITIAL WRITE          00005000
      ***************************************************************** 00006000
      **DATE:06/15/2004 CHANGED BY: DAVE WELLER                         00007000
      *     VERIFIED RECEIPTS CHANGED TO STORE EXPECTED                 00007100
      ***************************************************************** 00007200
       01  XSWS003-ITEM-COMMAREA.                                       00007300
           05  XSWS003-SEND-FIELDS.                                     00007400
               10  XSWS003-KEY-UPC-NBR PIC S9(15)V COMP-3.              00007500
               10  XSWS003-KEY-STR-NBR PIC S9(04)V COMP-3.              00007600
               10  XSWS003-SKU         PIC S9(08).                      00007700
               10  XSWS003-STR-NBR-X   PIC  X(03).                      00007800
               10  XSWS003-INTR-UPC-ID PIC S9(09)  COMP SYNC.           00007900
               10  XSWS003-STR-NBR-BINARY                               00008000
                                       PIC S9(04)  COMP.                00009000
               10  XSWS003-ITEM-NBR    PIC S9(15)V COMP-3.              00010000
           05  XSWS003-RETURN-FIELDS.                                   00020000
               10  XSWS003-INTRANSIT   PIC S9(7) COMP.                  00030000
               10  XSWS003-STR-EXPCTD  PIC S9(7) COMP.                  00040000
               10  XSWS003-FS-OH       PIC S9(7) COMP.                  00050000
               10  XSWS003-STR-OH      PIC S9(7) COMP.                  00060000
               10  XSWS003-RETURN-FLAGS.                                00070000
                   15 XSWS003-RETURN-SQL                                00080000
                                       PIC X(01).                       00090000
                       88 XSWS003-SUCCESSFUL     VALUE 'Y'.             00100000
                       88 XSWS003-NOT-SUCCESSFUL VALUE 'N'.             00110000
                   15 XSWS003-RETURN-SQLCODE                            00111001
                                       PIC S9(4).                       00112001
                   15 XSWS003-ERROR-PROGRAM                             00113001
                                       PIC X(8).                        00114001
                   15 XSWS003-ERROR-MESSAGE                             00115001
                                       PIC X(70).                       00116001
                   15 XSWS003-RETURN-INTRANSIT                          00120000
                                       PIC X(01).                       00130000
                       88 XSWS003-INTRANSIT-ERROR-Y                     00140000
                                                 VALUE 'Y'.             00150000
                       88 XSWS003-INTRANSIT-ERROR-N                     00160000
                                                 VALUE 'N'.             00170000
                   15 XSWS003-RETURN-STR-EXPCTD                         00180000
                                       PIC X(01).                       00190000
                       88 XSWS003-STR-EXPCTD-ERROR-Y                    00200000
                                                 VALUE 'Y'.             00210000
                       88 XSWS003-STR-EXPCTD-ERROR-N                    00220000
                                                 VALUE 'N'.             00230000
                   15 XSWS003-RETURN-FS-OH                              00240000
                                       PIC X(01).                       00250000
                       88 XSWS003-FS-OH-ERROR-Y  VALUE 'Y'.             00260000
                       88 XSWS003-FS-OH-ERROR-N  VALUE 'N'.             00270000
                   15 XSWS003-RETURN-STR-OH                             00280000
                                       PIC X(01).                       00290000
                       88 XSWS003-STR-OH-ERROR-Y VALUE 'Y'.             00300000
                       88 XSWS003-STR-OH-ERROR-N VALUE 'N'.             00310000
