000110*---------------------------------------------------------*               
000120*                  XSWS065 - LRECL - 80                   *               
000140*                                                         *               
000150*   CONTROL CARD HOLDS TODAYS DATE (THE DATE FOR WHICH    *               
000151*   THE JOB WAS SCHEDULED).                               *               
000170*---------------------------------------------------------*               
000180                                                                          
000200 01  CC-XSCC065-CONTROL-CARD.                                             
000300     05  CC-XSCC065-CONTROL-CARD-DISPLY.                                  
000400         10  CC-XSCC065-DESC          PIC X(07) VALUE 'TODAY: '.          
000700         10  CC-XSCC065-TODAYS-DATE   PIC X(10) VALUE SPACES.             
000800     05  FILLER                       PIC X(63) VALUE SPACES.             
000900                                                                          
