000110*---------------------------------------------------------*       00010001
000120*                         XSWS107                         *       00020001
000140*   THIS IS THE CONTROL CARD LAYOUT FOR MEMBER XSCC107.   *       00030001
000150*   THE CONTROL CARD CONTAINS THE NUMBER OF REFERENTIAL   *       00040001
000151*   INTEGRITY ERRORS THAT CAN BE BYPASSED DURING THE LOAD *       00050001
000151*   PROCESS WITHOUT CAUSING AN ABEND TO OCCUR.            *       00051001
000170*---------------------------------------------------------*       00060001
000200 01  CC-XSCC107-CONTROL-CARD.                                     00070001
000300   05 CC-XSCC107-CONTROL-CARD-DISPLY.                             00080001
000400      10 CC-XSCC107-CONTROL-NM             PIC X(42) VALUE SPACES.00090001
000500         88 CC-XSCC107-VALID-NM                                   00100001
000600           VALUE 'THRESHOLD RI ERRORS FOR XST_STR_GP_PRCHG: '.    00110001
000700      10 CC-XSCC107-MAX-ERRORS             PIC 9(06) VALUE ZEROS. 00120001
000800   05 FILLER                               PIC X(32) VALUE SPACES.00130001
