000110*---------------------------------------------------------*               
000120*                  XSWS069 - LRECL - 80                   *               
000140*                                                         *               
000150*   CONTROL CARD HOLDS THE NUMBER OF DAYS AFTER A UPC     *               
000151*   IS MARKED FOR DELETE THAT IT SHOULD BE PHYSICALLY     *               
000152*   DELETED.                                              *               
000170*---------------------------------------------------------*               
000180                                                                          
000200 01  CC-XSCC069-CONTROL-CARD.                                             
000300     05  CC-XSCC069-CONTROL-CARD-DISPLY.                                  
000400         10  CC-XSCC069-DESC          PIC X(24) VALUE                     
000500             'DAYS BEFORE DELETE UPC: '.                                  
000700         10  CC-XSCC069-NUMBER-DAYS   PIC X(03) VALUE SPACES.             
000800     05  FILLER                       PIC X(53) VALUE SPACES.             
000900                                                                          
